{
    "previousContext": "2-DespairSyndrome2.png\nLeon killed Sayaka...\nMonokuma killed Junko...\nThen Leon got executed...\nThen Mondo killed Chihiro...\nAnd then he got executed...\nHifumi killed Taka...then Celeste killed Hifumi...\nThen *she* got executed...\nAnd that brings us up to now...\n11-BeautifulDeath.png\nThe next morning, in the dining hall...the day after Celeste's case...\n13-Hina14.png\n: So now there's only five of us here...\n14-Hiro13.png\n: Only a third of the number of people we started with...\n15-Kyoko17.png\n: Loneliness has become commonplace.\n16-Sakura4.png\n: That't true...\n17-Makoto.png\n: ...\nStill...\n18-FlashT.png\n20-FlashB.png\nWhat did I see yesterday? I don't understand... Sakura is the mastermind's spy? Can that really be true?\n22-Sakura3.png\n: Makoto, are you okay?\n17-Makoto.png\n: Ah--! N-No, I'm fine...!\nI can't bring it up in front of the others. If I did that...it would just confuse everyone that much more.\n23-Kyoko13.png\n: ...\n25-Hina22.png\n: Okay! In that case, let's eat till we pass out!\n26-Hiro7.png\n: Whaddya mean, \"In that case\"?\n27-Hina2.png\n: Well, cuz look how scary everyone looks! It's gotta be cuz you're all fighting on empty stomachs, right? If you fill your belly, I'm sure you'll all cheer up! So, let's eat!\n28-Hina18.png\n: Let's fry up some fish and donuts and eat till we can't stand up!\n29-Hiro8.png\n: That's like a Deep Impact style, meteor impact, extinction level event combination of foods...\n30-Hina11.png\n: What!? Those are both breakfast time top sellers!\n32-Kyoko5.png\n: Still, the \"till we can't stand up\" part is a problem. After we're done, we need to go\nexplore\n.\n33-Sakura6.png\n: That's right. Since the class trial is over, new areas should have opened up...\n15-Kyoko17.png\n: Plus, we still have\nAlter Ego\n. We don't have to give in to despair just yet.\n17-Makoto.png\n: She's right... We have to plan ahead and think about the future!\n35-Hina5.png\n: Yeah, yeah! Think happy thoughts! Not deathy thoughts!\n36-Hiro18.png\n: Like when we're gonna get outta here, right? When this is all over...I think I wanna get reborn for serious. Er--I mean, reborn AS someone serious...\n37-Hina12.png\n: Hey, are you okay? That sounds like something someone who's about to die would say...\n38-Hiro2.png\n: I'm totally okay! I'm not gonna die! Why? Cuz there aren't gonna be any more murders!\n39-Hina9.png\n: Huh? What makes you so sure...?\n38-Hiro2.png\n: I predicted it last night! Since it revealed itself to me from the ether, there's no doubt about it!\n41-Sakura7.png\n: ...How accurate is your fortune-telling, anyway?\n42-Hiro15.png\n: I can usually hit twenty or thirty percent on a good day!\n37-Hina12.png\n: That seems...really low.\n43-Hiro14.png\n: Well, yeah! It's not like it's ESP or whatever. Of course I'm only gonna get it right sometimes!\n44-Hiro16.png\n: I told you, my fortune-telling isn't like some occult thing!\n39-Hina9.png\n: Fortune-telling...isn't occult?\n46-100MileJunkFoodDash.png\n44-Hiro16.png\n: Of course not! Clairvoyance is clarivoyance! Don't put it in the same category as cattle mutilation!\n37-Hina12.png\n: Cattle... What?\n47-Kyoko3.png\n: He's referring to the urban legend where aliens abduct cows and dissect them as part of their research.\n48-Hiro12.png\n: No...! You're calling it an urban legend!? As a matter of fact, it's true... As a matter of fact, it's happened to me!\n38-Hiro2.png\n: It all happened one day when I went to go get a hamburger... It was a place I'd never been before. They claimed their patties were\n100% all beef\n... So I got a burger to go and headed home. And before long...the sky was filled with a mysterious blinding light!\n50-BurgerAbduction.png\n38-Hiro2.png\n: Some crazy beam came out of nowhere and locked on to my hamburger! And as soon as the beam touched it, the burger started floating in mid-air...! And then, still floating there, the entire burger started coming apart! One part of it just vanished, while the rest fell back into my hand...! Do you realize what that means? It means, the burger wasn't 100% beef! It must've had some pork or something mixed in... Something like seventy percent pork and thirty percent beef, would be my guess.\n48-Hiro12.png\n: So I stormed back into the burger place and got up in the manager's grill. And they totally admitted it... It WASN'T 100% beef! They totally mixed in ground pork with it!\n42-Hiro15.png\n: Now do you see!? THAT is cattle mutilation!\n17-Makoto.png\n: I...kinda got lost halfway through...\n53-Hina23.png\n: I can't tell if you're for the occult or against it. You stink of stupidity...\n44-Hiro16.png\n: I stink of--!? How dare you!?\n53-Hina23.png\n: Well, you do stink, though.\n38-Hiro2.png\n: That's fine!\n37-Hina12.png\n: That's fine!?\n17-Makoto.png\n: U-Umm...anyway... I hope your prediction turns out to be true...\n55-BeautifulMorning.png\n56-Hiro3.png\n: Well, at the very least, *I* won't murder anyone!\n25-Hina22.png\n: Me either! I mean, I would never!\n16-Sakura4.png\n: Me either...\n57-Kyoko2.png\n: Nor I.\n17-Makoto.png\n: That goes for me too, of course. I could never kill any of my friends!\nI felt like those words of encouragement were helping us come together as one. After so much sacrifice and hardship...we'd finally become united. But...\n16-Sakura4.png\n: To be honest, I wish Byakuya and Toko were here for this, too.\n13-Hina14.png\n: But...they're so hard to deal with. They only think about themselves.\n43-Hiro14.png\n: Yeah, we're better off without 'em, I say...\nThat was enough to prove... We were united for the time being, but within that bond hid\nweakness and fragility\n.\nWe began our search as soon as we'd finished our breakfast in the dining hall. We had to find out what had opened up, what was waiting for us...\n3-BeautifulDeath.png\n4-Narration.png\n: The stairs to the 4th floor have opened up.\nSo now we have access to the\n4th floor of Hope's Peak Academy\n...\n6-Makoto.png\n: Maybe this time, we'll find some kind of clue... No! This time I HAVE to find it!\n4-Narration.png\n: The 4th floor has a lot of rooms to check out. Some of them look a little suspicious...\n*Rattle rattle*\nNo good--the door's locked. I guess I won't be getting in here... According to the nameplate, this is called the\ndata center\n... But what's behind the door is a total mystery.\n4-Narration.png\n: The music room, huh?\nThis is...the\nmusic room\n. It's hardly even a classroom. It's more like an actual concert hall...\n16-Kyoko.png\n: You know, you haven't told me what you think yet.\n6-Makoto.png\n: What I think...?\n17-Kyoko2.png\n: About the\nsecret\nroom in the boys bathroom...\n6-Makoto.png\n: ...Ah! W-Well, um...I did find the secret room, but... As soon as I started looking around, I was attacked...\n19-Kyoko9.png\n: Attacked? By who?\n6-Makoto.png\n: Well...they came from behind, and I didn't have any time to react. So I didn't see who it was... And when I came to, the mountains of files and documents...were all gone.\n20-Kyoko11.png\n: ...\n6-Makoto.png\n: I'm sorry. I know how important those were.\n20-Kyoko11.png\n: ...It's okay. I already saw what I needed to in there. And I half suspected the mastermind might come after you.\n6-Makoto.png\n: What...?\n16-Kyoko.png\n: When I discovered the room, the mastermind must have seen me on the surveillance camera in the hallway. They must have seen me go into the boys bathroom, and not come out again. Still, I wanted you to go and see it... I wanted to see how the masterming would react. Essentially, I wanted to find out if the mastermind actually knew about that room.\n22-Kyoko12.png\n: But to attack you, and steal everything in the room... That must mean there was some unknown clue in there that could reveal the mastermind's identity.\n6-Makoto.png\n: Then...you knew I was gonna get attacked?\n23-Kyoko7.png\n: You can handle that kind of thing though, right? After all, you're a boy.\nWhat does she think a boy is...?\n6-Makoto.png\n: Fine...I understand. Then let me ask you something else. Do you know about the note that was left in there? The note that said, \"\nYou must not leave\n\"...\n17-Kyoko2.png\n: We...shouldn't talk about that. Not here.\nKyoko stole a quick glance at the surveillance camera.\n25-Kyoko3.png\n: ...I'm looking into it. If I find out anything, I'll let you know.\n26-Kyoko14.png\n: Is that okay?\nShe made it sound like she was asking, but it was clear I wouldn't have any say in the matter.\n28-Kyoko17.png\n: So, now it's your turn. Let's hear your secret.\n6-Makoto.png\n: ...Huh?\n29-Kyoko15.png\n: Did you think I wouldn't notice? You're hiding something. ...Am I wrong?\n6-Makoto.png\n: Th-That's--!\n30-FlashT.png\n32-FlashB.png\n33-DISTRUST.png\n17-Kyoko2.png\n: What's the matter? If you're worried about the camera, why not just write it down?\n6-Makoto.png\n: U-Um...well...\n17-Kyoko2.png\n: ...\n28-Kyoko17.png\n: We're friends, so you should be able to trust me. Isn't that what you said before?\nYou're right that there shouldn't be any secrets between friends, but... There's nothing worse than expressing doubt about your friend when you don't have evidence for it...\n4-Narration.png\n: This is actually one of those \"But Thou Must\" scenarios. You have to choose not to tell her.\n> Don't tell her\n6-Makoto.png\n: S-Sorry... I can't tell you. Not yet...\n28-Kyoko17.png\n: ... So...that's your answer.\n23-Kyoko7.png\n: But do you think that's fair? You were happy to hear what I had to say, but now you're unwilling to share?\n6-Makoto.png\n: I'm sorry. I really am...\n23-Kyoko7.png\n: ...\n37-Kyoko19.png\n: It's fine. Goodbye.\nWith those as her parting words, Kyoko left me standing there alone. I think I made her mad...\n3-BeautifulDeath.png\n4-Narration.png\n: Good job Makoto, we pissed off our biggest ally.\nThe nameplate on the door says \"\nHeadmaster's Room\n.\"\n6-Makoto.png\n: The headmaster's room... There must be something worthwhile in there...\n*Rattle rattle*\nHuh? The door's locked... Dammit...!\n4-Narration.png\n: There are two classrooms on this floor as well.\n4-Narration.png\n: Nothing in here but Hiro.\n44-Hiro14.png\n: I'm glad this floor got opened up and all, but... there's like a ton of locked rooms up here!\n4-Narration.png\n: This one's completely empty, much like the other classrooms in the building. There is a transcription of Euler's Formula on the left wall though. Don't know why that's there but like other messages in these classrooms I think they're just flavor. Maybe this was the math room?\nThis is...\nthe office\n. But of course there's no hint of any teachers that we'd normally be able to rely on...\n4-Narration.png\n: There's a Monocoin on each of the desks in the room but otherwise, there's one other big thing catching our attention.\nHuh? There's a\npicture\non the floor! This picture...\n33-DISTRUST.png\n54-Makoto2.png\n: ...What!?\nCeleste, Hifumi...and Sayaka!? The smiling faces of three people who are dead now... A classroom without metal plates over the windows...\n54-Makoto2.png\n: It's...exactly the same!\n30-FlashT.png\n32-FlashB.png\nIt's just like that picture I saw before! There's no way this isn't important somehow...\nThey're smiling the way you'd expect any normal teenager to smile... Just a normal group of high schoolers, living a normal school life... I can't possibly believe they were able to smile like that in a world of despair like this. So does that mean this picture was taken before they ever came to Hope's Peak? Which would mean...everyone in the picture knew each other before they got here...? Including Sayaka...?\n54-Makoto2.png\n: No! There's no way! Monokuma did it! It must be fake!\n57-MrMonokumasLesson.png\n58-Monokuma.png\n: Nyohoho! YOU'RE fake!\nMonokuma popped up out of nowhere and snatched the picture from my hand.\n59-Monokuma4.png\n: A forgery plot? What are you, a middle schooler? You think the moon landing was faked, too? Come on!\n54-Makoto2.png\n: Then...you're saying this picture is...real?\n58-Monokuma.png\n: If there were such a thing as the Nobel Truth Prize, I'd take first, second, AND fourth place!\n61-Monokuma5.png\n: Actually, that's probably not true!\n54-Makoto2.png\n: I asked you a question! Is this picture real, or is it a fake!?\n58-Monokuma.png\n: Oh, Makoto. You're so eager to split things in half, aren't you?\n63-Monokuma11.png\n: But it's no use. It's just no use... If you try to split something that can't be split, you'll end up feeling like YOU'RE the one being split.\nThe picture is real\n. No more, no less.\n59-Monokuma4.png\n: Puhuhu...! *leaves*\n3-BeautifulDeath.png\nWithout another word, Monokuma disappeared.\n54-Makoto2.png\n: So the picture...is real?\nIt's really real? If that's true... If that's the case...\n4-Narration.png\n: Now that we've confused the situation even more, let's go check out the Chem Lab.\nSo this is the\nchem lab\n... I hope inhaling all this stuff doesn't do permanent damage...\n4-Narration.png\n: You can try talking to Hina and Sakura but Makoto will just remark that the two of them are deep in coversation.\nIt's a remarkably big shelf. And it's stocked with all kinds of medicine...\n71-Hina22.png\n: Ah! Listen, Makoto! Listen! Just take a deep breath and calm down and LISTEN TO ME!\n6-Makoto.png\n: O-Okay, Hina...just chill out...\n72-Hina5.png\n: There's all kinds of stuff we didn't have before! Vitamins, minerals, amino acids, creatine--!\n71-Hina22.png\n: And--! WHAT!? They even have\nProteinzyme-X\n!\n6-Makoto.png\n: Wh-What's that...?\n74-Sakura5.png\n: A\nhigh-quality protein drink\n! It's nothing like that cheap swill in the warehouse. It's connoisseur level!\n6-Makoto.png\n: O-Oh yeah...?\n75-Hina7.png\n: This is amazing! It's a gold mine! Ahh, my prayers have finally been answered! Time to load up some more prayers, then!\nA gold mine, huh...?\n4-Narration.png\n: With that, our exploration of this floor is finished.\n6-Makoto.png\n: I've already taken a good look at things around here.\nThere's a lot to think about, but for now I should head back to the\ndining hall\nand talk to the others.\nNot long after I got to the dining hall, the others began to trickle in. And after a few minutes...\n79-Hiro2.png\n: So, is this everyone?\n80-Sakura7.png\n: Okay, let's discuss what we all discovered.\n81-Hina2.png\n: Yeah, good idea...\n2-BeautifulDeath.png\n3-Narration.png\n: Time to share information with the others. Let's start with Hina.\n5-Hina.png\n: There was a big shelf in the\nchem lab\non the 4th floor, and it had all kinds of chemicals and stuff. And there was an all-star cast of nutrient additives and supplements! You should at least go take a peek. I highly recommend it!\n6-Hiro14.png\n: I think you and Ogre are probably the only ones interested in stuff like that...\n7-Hina2.png\n: Oh, but...it's not all good stuff, though. There was medicine and health stuff, but on top of that...There was also, um...a bunch of different\npoisons\n.\n8-Makoto.png\n: P-Poison!?\n10-Sakura.png\n: They were all labeled clearly, though. So it would be hard to grab one by mistake...\n11-Kyoko11.png\n: Still, we'd better make sure we're careful around there.\n12-Hina9.png\n: And...we probably shouldn't tell Byakuya or Toko about the poison, right?\n13-Hiro4.png\n: What do you mean...?\n7-Hina2.png\n: Well,\njust in case\n... You know what I'm trying to say.\n15-Hiro5.png\n: J-Just in case... Yeah, I think you're right.\n16-Kyoko17.png\n: It's Byakuya. It won't be long before he's discovered it for himself.\nBut to put something as dangerous as poison right out in the open... That's absolutely the work of the mastermind.\n19-Hiro2.png\n: I found a couple rooms on the 4th floor, but they were locked! The\ndata center\nand the\nheadmaster's room\n!\n20-Hina21.png\n: The headmaster's room!? That sounds like exactly the kinda place we'd find some clues!\n8-Makoto.png\n: If we can somehow unlock the door and get inside...\n13-Hiro4.png\n: Who cares about a stupid lock!\n21-Hiro15.png\n: It should be no problem for the world's strongest missing link to knock down one measly door!\n23-MrMonokumasLesson.png\n24-Monokuma2.png\n: ...What was that?\n25-Hiro8.png\n: Uwah!\n26-Monokuma3.png\n: No, please. Continue.\n28-Monokuma7.png\n: Did you say I've got the nicest butt on the block? The curviest hips in town? Is that what you said!?\n25-Hiro8.png\n: Hell no I didn't!\n24-Monokuma2.png\n: Then what DID you say? Cuz I KNOW you weren't talking about tearing down the door to the headmaster's room.\n29-Hiro7.png\n: Ng--!\n30-Monokuma.png\n: Knocking down your headmaster's door? What kind of war on education are you trying to start here!?\n24-Monokuma2.png\n: That's MY room, ya know? It is *now* anyway... And you're thinking of busting it down?\n26-Monokuma3.png\n: You seriously don't wanna piss me off. You have any idea how much bacteria lives on a single bear claw?\n15-Hiro5.png\n: N-No, I was just kiddin'! Please don't get mad!\n26-Monokuma3.png\n: I'm not mad! >_<\n25-Hiro8.png\n: You're totally mad! ;_;\n33-Monokuma9.png\n: I was hoping I wouldn't have to add a rule for this, but if you're gonna go around having those thoughts...\n34-Monokuma6.png\n: I have no choice but to\nadd to the school regulations\n!\n8-Makoto.png\n: Seriously...?\n24-Monokuma2.png\n:\nBreaking down a locked door is prohibited\n! There, that's a rule now, ya jerks! *leaves*\n15-Hiro5.png\n: I-Is he gone...?\n36-Hiro13.png\n: Whew... Man, I was scared for my life! I was sure he was gonna kill me, for serious!\n37-Sakura3.png\n: But if he would go out of his way to make up a rule like that, there's no doubt that\nsomething important\nmust be hidden in the headmaster's room.\n8-Makoto.png\n: But...now that it's a rule, there's nothing we can do.\n16-Kyoko17.png\n: ...\n40-Sakura4.png\n:\nMetal sheets\nhad been attached to all the windows on the 4th floor. None of them budged an inch...\n41-Kyoko12.png\n: Just like everywhere else...\n40-Sakura4.png\n: Escape from the 4th floor seems unlikely. That was to be expected, though.\n8-Makoto.png\n: Um...Kyoko?\n44-Kyoko2.png\n: ...\nShe's ignoring me...\n7-Hina2.png\n: Hey, Makoto... Does Kyoko seem upset to you?\n20-Hina21.png\n: She is, isn't she!? She's totally mad!\n8-Makoto.png\n: Y-Yeah, it looks like it...\n44-Kyoko2.png\n: ...\n46-Hina16.png\n: I bet it's your fault, isn't it? You must've done something to her.\nAgh...this is bad...\n48-Hiro12.png\n: So...has everyone said what they need to say?\n7-Hina2.png\n: I think so...\n48-Hiro12.png\n: But it looks like nobody found any clues at all, let alone a way out of here.\n49-Hiro6.png\n: I haven't been this depressed since my house burned to the ground! Someone, do something to cheer me up!\n8-Makoto.png\n: Um...can I say something?\n21-Hiro15.png\n: It's cuz my dad was smoking in bed!\n8-Makoto.png\n: That's...no... I have something I'd like to report. So...you guys all remember, right? You remember when I found that\npicture\nup on the 3rd floor the other day?\n51-DISTRUST.png\n37-Sakura3.png\n: You mean the one that showed Mondo, Chihiro, and Leon all together, right?\n7-Hina2.png\n: Yeah, I remember. What about it?\n8-Makoto.png\n: Well, I found another one. Another picture, almost just like that one.\n52-Hina11.png\n: Another one...?\n8-Makoto.png\n: But this time, the picture was of Celeste, Hifumi, and Sayaka.\n29-Hiro7.png\n: Huh...?\n8-Makoto.png\n: And they were all smiling... And the classroom in the picture didn't have any metal covering the windows.\n55-Sakura5.png\n: So the picture of Mondo, Chihiro, and Leon wasn't the only one... Now you found one that had Celeste, Hifumi, and Sayaka?\n12-Hina9.png\n: But...how can that...?\n56-Hiro16.png\n: Monokuma must have faked it!\n8-Makoto.png\n: But...if the picture *is* real...\n8-Makoto.png\n: ...then everyone who was in it...\n8-Makoto.png\n: There would have to be some kind of\nhidden connection\nthere, don't you think? Some deeper truth...that we just don't understand...\n49-Hiro6.png\n: Can't be! It's a fake!\n8-Makoto.png\n: But Monokuma said it was real. I know we could just write that off as a lie, but...\n60-DespairSyndrome2.png\n61-Kyoko13.png\n: Then you trust Monokuma's word over the people who have died?\n8-Makoto.png\n: Huh...?\n61-Kyoko13.png\n: That's what you're saying, isn't it?\n8-Makoto.png\n: No, that's not it...\n63-Kyoko15.png\n: I'm shocked. You told everyone how we should believe in our friends, but you refuse to do the same.\n8-Makoto.png\n: Th-That's not--!\nWhat's going on, Kyoko? Why are you getting emotional...? I don't understand why she's so angry...\n13-Hiro4.png\n: C'mon guys, stop fighting, or all your good luck is gonna float away! Anyway, Makoto...you're thinking about it too much. There's no way Monokuma didn't fake that picture.\n65-Sakura7.png\n: He's just trying to confuse us. You shouldn't listen to anything Monokuma has to say.\n8-Makoto.png\n: Y-You might be right, but still...\n♪\nMusic cuts out.\n♪\n???: Are you still so conflicted?\n67-MrMonokumaAfterClass.png\n68-Byakuya3.png\n: It looks like you guys have stopped playing nice.\n8-Makoto.png\n: Byakuya!\n69-Byakuya7.png\n: You all have the same sunken look on your faces. You were all so ugly before. You shouldn't let them sink any lower.\n68-Byakuya3.png\n: When I look at you, it makes me think of a frog sinking into a pile of manure.\n19-Hiro2.png\n: Sorry...\n70-Hina15.png\n: Why are you apologizing!?\n46-Hina16.png\n: Leave us alone! You're not a part of this!\n68-Byakuya3.png\n: That's true enough. Your problems aren't mine. We are, and always will be, completely separate. So whatever's causing your faces to turn so ugly has absolutely nothing to do with me. And if I happen to discover a\nvital clue\n, it wouldn't concern you in the slightest.\n8-Makoto.png\n: Huh...?\n72-Hina12.png\n: Did he finally just say something useful?\n51-DISTRUST.png\n74-Kyoko7.png\n: ...Byakuya. What have you been up to?\n68-Byakuya3.png\n: I don't mind telling you. Perhaps forcing your lazy brains to get to work might do you some good.\n75-Byakuya5.png\n: I was\nin the bath\n. What else would you like to know? Today's lottery numbers?\nHe was...taking a bath? Is he saying he's been talking to\nAlter Ego\n? Did he tell him something...?\n74-Kyoko7.png\n: Maybe we should *all* go take a bath.\n10-Sakura.png\n: Ah...good idea.\n19-Hiro2.png\n: A mixed bath...?\n77-Hina22.png\n: A mixed bath...!\nIf Alter Ego really did tell him something... I wonder what it could have been.\n2-BeautifulDeath.png\nWhen I got to the dressing room...\n4-Toko.png\n: ...\nToko was sitting alone on the bench, the laptop in front of her.\n5-Makoto.png\n: ...Toko. Did you decide to come hear what Alter Ego has, too?\n4-Toko.png\n: I-I already heard it...with M-Master...\n6-Toko3.png\n: With Master!\n8-Hina23.png\n: You don't have to keep saying it... Anyway, so what are you doing right now?\n4-Toko.png\n: Shut up. Stop b-bothering me.\n9-Hiro15.png\n: Get out of the way. We have to talk to Alter Ego.\n11-Toko5.png\n: N-No. I made Master a p-promise.\n12-Sakura3.png\n: A promise?\n4-Toko.png\n: Master told me to\nw-wait here\n, so that's what I'm d-doing.\n13-Hina12.png\n: What are you, his dog!?\n14-Toko10.png\n: If it's wh-what Master wants, I'd do anything h-he asks.\n15-Hiro14.png\n: You just love being mistreated...\n11-Toko5.png\n: W-Well fine, if you really want me gone, by a-all means...\n17-Toko16.png\n: Hachoo!\n19-100MileJunkFoodDash.png\n20-Jill5.png\n: Hey guys! What's goin' on!?\n21-Hiro7.png\n: Um...we'd like you to move.\n22-Jill7.png\n: Sure thing! Just kneel before me and beg!\n23-Hiro8.png\n: First a mega masochist, now a super sadist!\n5-Makoto.png\n: Um, Toko...? Seriously, I'm asking you nicely to let us use the laptop.\n20-Jill5.png\n: Hm? HmmMMmMmmMmMMMmmMm~~?\n25-Jill8.png\n: Didn't you hear what I said!? I told you to kneel and beg!\n9-Hiro15.png\n: Come on, Makoto! Give her the ol' one-two combo! One--drop to your knees! Two--beseech!\n5-Makoto.png\n: Why are you acting like you're not part of this...?\nI was as desperate as I felt. Finally, I did kneel down in front of her, and I said...\n5-Makoto.png\n: Please, I'm begging you... Will you please let us use the laptop?\n26-Jill3.png\n: Kyeeehahahaha!\n28-Jill6.png\n: Such an ultra miraculous feeling of happiness! All my pent-up anger at Master for abusing me is evaporating!\n8-Hina23.png\n: So even *you* realize it's abuse...\n29-Kyoko2.png\n: That should be enough, right? Hurry up and let us talk to Alter Ego.\n26-Jill3.png\n: O-kaaaaaaay!\n31-DespairSyndrome2.png\n33-AlterEgo2.png\n: Everyone, come closer! I already told Byakuya, but... I was finally able to crack open all the files that were on this laptop! Sorry to have kept you all waiting!\n34-Kyoko11.png\n: Just what I thought...\n35-Sakura4.png\n: Finally...the time has come...\n36-Hiro5.png\n: Nng...I'm starting to get kinda nervous...\nI felt the same way. Resting on the keyboard, my hands had started to shake.\n38-Kyoko7.png\n: Move.\nThe single word was like a sharpened blade. Wounded, I moved to let her take over.\n34-Kyoko11.png\n: Here we go...\nKyoko began typing, the words appearing as fast as I could read them.\n> \"Can you tell us what you found out?\"\n40-DISTRUST.png\n41-AlterEgo5.png\n: Sure. I analyzed the files and extracted all the useful information I could find. And one particularly important fact I discovered was that a\ncertain plan\nhad been put into effect here.\n> \"To isolate the students of Hope's Peak Academy and create a communal life for them.\"\n41-AlterEgo5.png\n: That was the stated goal of the plan... But it was meant to be more than just a normal school life. The students were intended to live out the rest of their lives here.\n42-Makoto2.png\n: Th-That's...!\n44-Sakura5.png\n: It's...exactly the situation we've found ourselves in.\n41-AlterEgo5.png\n: It's quite unthinkable, isn't it? And what's more, the one who came up with the plan was non other than the\nadministrators of Hope's Peak themselves\n.\n45-Hina9.png\n: What!? Wait, hold on! Then the reason we've been imprisoned here... It wasn't the work of some psycho freak or criminal organization or whatever...\n46-Hina10.png\n: It was...the school itself?\n23-Hiro8.png\n: That doesn't make any sense! Why would they do that!?\n48-Kyoko.png\n: I don't think Alter Ego is finished. Perhaps we should hear the rest...\n41-AlterEgo5.png\n: It seems that the reason they devised this plan was because of\nwhat happened\none year ago. This is how they described that event... They said it was the \"\nbiggest, most awful, most tragic event in human history\n.\"\n45-Hina9.png\n: What does that mean...?\n23-Hiro8.png\n: Yeah, what kind of name is that for something!?\n38-Kyoko7.png\n: ...\n50-AlterEgo4.png\n: Otherwise known as The Tragedy, it was apparently some sort of devastating occurrence. Because of The Tragedy, Hope's Peak Academy was forced to discontinue its role as a school and close down.\n34-Kyoko11.png\n: I see. Things are finally starting to make sense... What this means is, one year ago, this thing--this tragedy--took place. And whatever it was, it forced Hope's Peak to shut down. From there, they decided to use the school as a kind of staging ground...\n51-Kyoko13.png\n: They planned to sequester the students here, where they would live out the rest of their lives.\n53-Hina2.png\n: But...why would the Hope's Peak administrators want to shut everyone in like that?\n44-Sakura5.png\n: And what could this \"tragic event\" have possibly been?\nIn a flash, Kyoko had typed their questions into the computer. And the answer we got was...\n54-AlterEgo6.png\n: Sorry...I don't know. If that information was ever on this computer, it's gone now... I'm totally useless... I'm sorry.\nAnd that's all he said.\n56-Hiro6.png\n: Then...is this really the end? We get halfway through the answer, and that's it?\n57-Kyoko17.png\n: It would appear so. Disappointing...\n41-AlterEgo5.png\n: Oh, wait! There's one other thing I forgot to mention. I think it might be important. I believe it has to do with the\nmastermind\n...\n42-Makoto2.png\n: The mastermind!?\nKyoko's fingers moved even faster than they had so far...\n> \"Did you figure out the mastermind's identity?\"\n41-AlterEgo5.png\n: No...that I still don't know. But I *did* find a clue, I think. The one leading the Hope's Peak staff, the one who finalized the plan to isolate you was the\nHope's Peak headmaster\n. So that same person may very well be the mastermind who planned all this out. And according to the files, the headmaster is\na man in his late thirties\n. It seems possible, even likely, that he's\nsomewhere in this school\nright now.\n59-Kyoko10.png\n: The headmaster...is here in the school!?\n60-Hina22.png\n: Then that's gotta be the mastermind! I mean, Monokuma's been calling himself the headmaster, right?\n12-Sakura3.png\n: Which makes the real headmaster that much more suspicious...\n61-Hiro12.png\n: But if we break down the door to his room, we're dead, right? So what are we supposed to do?\n63-Kyoko8.png\n: I'll find a way...\n21-Hiro7.png\n: Huh?\n63-Kyoko8.png\n: No matter what it takes...I will find the headmaster. No matter the cost...\n45-Hina9.png\n: Kyoko? What's going on...?\n38-Kyoko7.png\n: ...I can't explain why. I just...know that I have to find him.\nShe \"has\" to? Kyoko...what's going on with you? When she heard about the headmaster, her reaction was almost...violent.\n48-Kyoko.png\n: ...We should see if Alter Ego has any more information.\nThat seemed to be an attempt to regain her composure, and she started typing again.\n> \"Did you learn anything else?\"\n54-AlterEgo6.png\n: I'm sorry... That's everything I found. All the information on this laptop seems to be pretty old, so that's all I can do from here. I'm really sorry...\n65-Hiro13.png\n: Then...it really is all over.\n34-Kyoko11.png\n: Wait. Alter Ego seems to have more to say.\n67-DeathWishNoIntro.png\n68-AlterEgo.png\n: Um, well... It's kind of a different topic, but...I was wondering about something.\n50-AlterEgo4.png\n: I haven't seen Celeste, Hifumi, or Taka since yesterday...\nA heavy silence fell across the room. The only sound was the flat, precise clicking of keys as Kyoko typed.\n> \"They're all dead.\"\n70-AlterEgo8.png\n: ...What!?\n50-AlterEgo4.png\n: I see... Certainly I knew that was a possibility, but...\n54-AlterEgo6.png\n: ...it really happened. ...\n68-AlterEgo.png\n: Oh, sorry... There's no point in me getting depressed over things I can't do anything about...\n29-Kyoko2.png\n: Well then, I guess that's it.\n\"That's it.\" A simple phrase that held so much meaning... She began typing again...\n> \"You've done your job. Thank you.\"\n50-AlterEgo4.png\n: I'm done? I guess I am, huh?\n54-AlterEgo6.png\n: Then...maybe I'll take a little rest. I'm kinda tired... Goodbye, everyone. See you later...\nWith that, the laptop entered sleep mode...\n35-Sakura4.png\n: So Alter Ego did everything he could...\n29-Kyoko2.png\n: We won't have to talk to him all that much anymore.\n45-Hina9.png\n: But...I feel kinda sorry for him.\n74-Hiro4.png\n: You feel sorry...? But \"he's\" just a computer program, right?\n45-Hina9.png\n: I know, but still...he did everything he could for us, ya know?\n76-Hiro2.png\n: I mean, yeah, it did. But that's what a computer program is *designed* to do. You don't tell a computer \"good job\" every time you shut it down, do you?\n53-Hina2.png\n: Well, no... But when we talked to Alter Ego, I guess I just...didn't see it that way.\n5-Makoto.png\n: I know what you mean. I feel the same way.\n15-Hiro14.png\n: Hey, come on! It's just a program! You *can* tell the difference between a program and a friend, right?\n5-Makoto.png\n: But you know...what's the difference between us and that program, really?\n21-Hiro7.png\n: Huh...?\n5-Makoto.png\n: I started thinking about how you would differentiate a person and an AI. Alter Ego isn't human, I know that. It's just a program running on a computer. But at the same time, I couldn't help but think of him as our\nfriend\n.\n78-Hina21.png\n: Yeah! He's no different from us! He's still our friend!\n74-Hiro4.png\n: I think...maybe I understand where you're coming from...\n79-Hiro3.png\n: Then there's no problem calling him a friend! After all, the more friends the merrier, right!?\n9-Hiro15.png\n: Check this out! Friendship has no survival value. Instead, it gives value to survival.\n57-Kyoko17.png\n: So anyway...\n23-Hiro8.png\n: Don't \"so anyway\" that! It's a totally smart and cool thing that I quoted from I don't remember where!\n29-Kyoko2.png\n: Anyway, there's nothing more Alter Ego can do to help us. As such, his role in this is over. Am I wrong about that?\n5-Makoto.png\n: No, but...\n♪\nMusic cuts out.\n♪\n51-Kyoko13.png\n: And frankly, I question the ease with which you decide who is and isn't your friend.\nDo you really mean that...?\n2-BeautifulDeath.png\n83-Sakura.png\n: The story's gotten off track. We should go over what Alter Ego said one more time.\n36-Hiro5.png\n: Yeah, good idea! What was the Hope's Peak staff thinking...?\n56-Hiro6.png\n: Why are they making us kill each other!?\n12-Sakura3.png\n: Alter Ego said that what happened one year ago is what started everything.\n45-Hina9.png\n: Yeah, he said it was\nthe biggest, most awful, most hopeless event in human history\n, right?\n5-Makoto.png\n: It must have been a huge incident, whatever it was... But did something like that really happen a year ago?\n36-Hiro5.png\n: I don't remember anything happening that you could describe that way. What about you guys?\n85-Hina6.png\n: I don't really watch the news, so...\n35-Sakura4.png\n: Sorry, nothing comes to mind.\n87-Kyoko12.png\n: That event led to the closing of Hope's Peak. If nothing else, it must have had some kind of connection to this school.\n23-Hiro8.png\n: Maybe all the students here were killed or something!\n12-Sakura3.png\n: That kind of catastrophe would have been all over the news. At least one of us would remember that...\n88-Hina15.png\n: Then...maybe they covered it up! That would explain why none of us knew that the school had been shut down!\n12-Sakura3.png\n: Totally covering up something like that... I suppose it's not totally impossible.\n90-Hiro16.png\n: What's wrong with our government!? Our taxes pay their salaries, they should be handling stuff like that!\n48-Kyoko.png\n: Maybe. But right now there's only one path open to us... We have to find the headmaster of Hope's Peak Academy. We have to find him, and make him tell us everything.\n63-Kyoko8.png\n: As long as we can get our hands on him, I think...\nKyoko... When she said \"headmaster\" I got that feeling again...\n35-Sakura4.png\n: But even that is a problem not so easily solved.\n53-Hina2.png\n: Yeah...you're right...\n92-Kyoko3.png\n: Well, our business is done here, so for now we should get out of here.\n36-Hiro5.png\n: Oh yeah, good idea.\n93-Jill10.png\n: Then I...\n17-Toko16.png\n: Ah...achoo!\n19-100MileJunkFoodDash.png\n95-Toko7.png\n: Huh...?\n13-Hina12.png\n: Is it really that dusty...? Wait, I mean...!\n11-Toko5.png\n: O-Oh no! I'm not w-waiting anymore!\n14-Toko10.png\n: I'm n-not guarding it... Byakuya's gonna b-be so mad at me...!\n57-Kyoko17.png\n: Let's avoid getting involved any further.\n74-Hiro4.png\n: Good call...\n1-Narration.png\n: I apologize in advance for the shortness of this update. It really should have been part of last update but I thought that one had gone on long enough. Unfortunately, this update is also too disconnected from the events of the next one so it just exists as a tiny update between two larger ones. Chapter 4 has not been very friendly in terms of choosing where to split updates.\nAs we left the dressing room, someone was there waiting for us...\n4-MrMonokumasLesson.png\n5-Monokuma2.png\n: My heart is pound-pound-pounding away...\n6-Monokuma6.png\n: It's pounding...with anger!\n7-Hiro8.png\n: Y-You're not still mad about that whole \"breaking into the headmaster's room\" thing, are you...?\n8-Monokuma3.png\n: Oh, that little matter doesn't matter even a little. And I'm a little jealous of you guys enjoying an indecent mixed bath, but that doesn't matter, either.\n9-Monokuma10.png\n: It's building... I feel it building...\n6-Monokuma6.png\n: My head's about to boil over with rage!\n11-Hiro11.png\n: D-Don't get so angry. Here, let me help center your chakra...\n8-Monokuma3.png\n: Etch this on the walls of your brain, okay?\nWhen you do something to me, I do it right back\n...\n12-Monokuma5.png\n: An eye for an eye, a fang for a fang... *leaves*\n14-BeautifulDeath.png\n15-Hiro5.png\n: Fang for a...fang?\n16-Hiro9.png\n: B-Be careful! He just chanted the incantation of devastation!\n17-Sakura3.png\n: No... It's just a saying.\n18-Hiro2.png\n: Oh, I see...\n19-Makoto.png\n: But what's he talking about?\n20-Sakura4.png\n: ...\n21-GoodNight.png\n*Ding dong, bing bong*\n24-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\n26-Kyoko3.png\n: So, it's nighttime. What does everyone want to do? Celeste was the one who suggested our nighttime rule, but she's gone now...\n27-Hina9.png\n: I think we should still avoid being out at nighttime. I know it'll make me feel better that way...\n28-Hiro4.png\n: I agree.\n29-Kyoko17.png\n: Very well then. In that case, time for bed.\n♪\nMusic fades out.\n♪\nSo everyone headed back to their rooms. Monokuma's parting words left me feeling anxious the rest of the night.\n32-WelcometoDespair.png\nOnce I was back in my room, I got lost in thought. What we'd learned from Alter Ego kept on spinning around and around in my mind. The administrators of Hope's Peak had planned all of this... They did it because of \"\nThe Tragedy\n\" which had happened a year before. And apparently the\nheadmaster\nis the one behind it all--the mastermind. All these mysteries make me worried. But I still have to try and unravel them, bit by bit. I'm sure the road will be long, and tough, but I don't have any other choice.\n35-MonokumaTheater.png\n: Let's talk a bit about where I was at before I became a bear. At first, I was at a total loss. I just had no idea what I should become! A lady in our tech support department suggested I try being a shrimp. She was like, \"Oh, the company's been trying to push for this forever! It's a really incredible offer!\" But as she laid out all the details, it turned out it wasn't a tiger prawn like I'd hoped, but a little popcorn shrimp! That's totally tiny! I would've been the world's smallest mascot! I like EATING shrimp, I didn't wanna be one myself! Plus someone might come along and step on me... So then the lady totally started laughing at me! She was like, \"You think we can do a tiger prawn on *our* budget?\" So ultimately, I decided to become a bear instead. And that's the secret origin story of Monokuma...\n2-GoodMorning.png\n*Ding dong, bing bong*\n5-MonokumaTV.png\n: Good morning, everyone! It is now 7 a.m. and nighttime is officially over! Time to rise and shine! Get ready to greet another beee-yutiful day!\n7-Makoto.png\n: First things first, I need to head to the dining hall...\n9-BeautifulMorning.png\n11-Narration.png\n: Like most mornings, there are a few people outside in the halls. Hiro is down near the storage room.\n13-Hiro8.png\n: Whoa! Makoto!\n7-Makoto.png\n: H-Huh? Why do you sound so surprised?\n14-Hiro14.png\n: S-Sorry about that. It's just... If you'd gotten here even a minute earlier, it would've cost me a few more minutes off my life!\n7-Makoto.png\n: What? Why?\n16-Hiro2.png\n: Cuz Kyoko, like, JUST left!\n7-Makoto.png\n: Kyoko?\n14-Hiro14.png\n: Ya know, Makoto... When a guy and girl go at it, it shortens the lives of the people who have to watch it happen, too.\n18-Hiro15.png\n: And since it's me saying it, you know it's true!\n16-Hiro2.png\n: So like, hurry up and make it better. Anyway, see ya at breakfast! *leaves*\nThat's easy for him to say. But what am I supposed to do?\n11-Narration.png\n: Byakuya's near the exit to the 1st floor halls.\n21-Byakuya.png\n: ...What do you want?\n7-Makoto.png\n: Um, well...the breakfast meeting...\n22-Byakuya4.png\n: You honestly expect me to go?\nRight... Oh, as long as I'm here, I should ask Byakuya what he made of the stuff Alter Ego told us. Actually no, I'd better not. The surveillance camera would catch us, for sure.\n24-Byakuya2.png\n: ...So?\n7-Makoto.png\n: Oh, um...well...\n25-Byakuya14.png\n: Hmph... *leaves*\nHe's gone...\n11-Narration.png\n: Lastly, Hina's near the dining hall entrance.\n7-Makoto.png\n: Good morning, Hina.\n28-Hina5.png\n: Mornin'!\n29-Hina6.png\n: Hey, so...yesterday...you were kinda cool!\n7-Makoto.png\n: Huh? What do you mean?\n30-Hina.png\n: You know, when you said Alter Ego was your friend!\n32-Hina2.png\n: I was thinking the same thing. But when stuff like that happens, I never know how to say what I'm thinking...\n28-Hina5.png\n: So I'm really glad you said it for me! So...thanks! Ehehe...\n7-Makoto.png\n: Y-You're welcome...\n33-Hina22.png\n: You're usually like, totally normal. But when the time comes, BAM! You bust out your special power.\n35-Hina8.png\n: I mean, even before yesterday, when stuff comes up, it's like...you always do something about it.\nEven before yesterday...? Are you talking about the class trials and stuff?\n7-Makoto.png\n: I mean, that stuff is just...it just kinda took care of itself, ya know?\n33-Hina22.png\n: It totally didn't!\n32-Hina2.png\n: With your power, and Sakura's, and everyone else...I'm sure we'll get outta here...\n7-Makoto.png\n: Yeah, I think you're right.\n33-Hina22.png\n: I am, right!? Alright! Now that we've got that fighting spirit, let's go eat some grub! *leaves*\nShe's right... Even if the road is long... If we don't keep on moving forward, we'll never reach our goal!\nAs I entered the dining hall, the first thing I saw was...her.\n40-Toko.png\n: What are you s-staring at...?\n7-Makoto.png\n: Oh, Toko...?\n41-Toko2.png\n: What, you think y-your eyes will rot just by l-looking at me?\n42-Toko12.png\n: Fine, then DON'T l-look at me!\n14-Hiro14.png\n: I think he's just surprised to see you at the breakfast meeting, is all...\n44-Sakura.png\n: Indeed. It's been quite a while since you joined us.\n32-Hina2.png\n: Yeah, what made you change your mind?\n46-Toko10.png\n: Byakuya said he...l-likes girls to have some meat o-on her bones, so...\n42-Toko12.png\n: I'm g-gonna start eating! I'm gonna force it d-down into my stomach! I'm gonna eat till I d-drop!\n33-Hina22.png\n: I refuse to l-lose!\n47-Sakura4.png\n: I wouldn't do that if I were you...\n7-Makoto.png\n: Well, other than that...it looks like Kyoko isn't here.\n49-Hiro4.png\n: Oh, she said she'd come by later.\n7-Makoto.png\n: Later...?\n50-Hiro12.png\n: Yeah. After you leave.\nShe's not even trying to hide it anymore...\n33-Hina22.png\n: I know I said she wanted you to show some backbone, but you didn't need to show her THAT much!\n11-Narration.png\n: (Can I just pop in real fast to say that this next conversation is really weird coming from Hina after she was so nice to us in the hallway? It's really weirdly juxtaposed. It's like the devs forgot the two conversations were placed next to one another.)\n52-Hina15.png\n: You're dirty, Makoto! Dirty! President Dirty of Dirtlandia!\n7-Makoto.png\n: You don't understand...!\n53-Hina16.png\n: You're the type who takes the stairs of love three steps at a time, aren't you!?\n7-Makoto.png\n: I'm telling you, it's not like that!\n55-100MileJunkFoodDash.png\n56-Toko4.png\n: J-Just shut up already, Hina...! You've been running your f-filthy mouth like that all m-morning...\n57-Hina12.png\n: Filthy? ME!?\n58-Toko3.png\n: Don't m-make me repeat m-myself...\n60-Hina24.png\n: I'm not filthy!\n58-Toko3.png\n: It's n-no use denying it. We can all s-see how disgusting you are...\n35-Hina8.png\n: Sh-Shut up...!\n62-Toko11.png\n: You and that lusty body of yours... Night after n-night, you go out for your illicit c-club meetings...\n60-Hina24.png\n: H-Hey, knock it off. I can't deal with dirty stuff like that...\n62-Toko11.png\n: Your m-midnight sextracurricular activities only put us in e-even more danger...!\n35-Hina8.png\n: S-Stop it...\n62-Toko11.png\n: You'd like me to s-stop, wouldn't you? Your sweaty h-hands gripping the big, fat chalk t-tight...\n64-Toko14.png\n: Going for all that e-extra credit... Your screams are like the s-screech of a violated blackboard! And...! And! Ah! It's a-amazing! Indecent ideas are c-coming to me one after another!\n66-Sakura2.png\n: So, would you rather have your black eye on the left or the right?\n67-Toko6.png\n: Hyeeeh! S-Sorry sorry sorry!\n49-Hiro4.png\n: Let's leave Toko alone. She's gone a little...funny from all her pent-up frustration.\n69-Hiro.png\n: Anyway, you and Kyoko need to make up already, ya know?\nI mean, of course I want things to get better as soon as possible. But with everything that's been going on, I haven't had a chance to talk to her about\nwhat I saw\n... Before anything, I need to\ntalk to Sakura\nabout it.\n71-BeautifulDeath.png\n11-Narration.png\n: Now, I usually skip the non-essential character lines in these situations where you have to talk to one specific character to continue but there were some funny ones that happen right now I didn't want to pass up. Talking to Sakura will continue the story but let's talk to Hiro and Toko first...\n73-Hiro3.png\n: Cheer up, man! It's not a big deal if a girl doesn't like ya!\n74-Hiro13.png\n: It's better than having one sue ya! ...Like I did.\nJeez, Hiro. You've lived a pretty brutal life...\n77-Toko9.png\n: Sorry sorry sorry sorry! Don't hit me don't hit me don't hit me don't hit me!\n64-Toko14.png\n: If you w-wanna hit someone, hit Master. Please h-hit him. Oh, please *please* let me w-watch you hit him!\nI think it's best if I stay far, *far* away from her...\n11-Narration.png\n: My indulgences finished, let's talk to Sakura.\n7-Makoto.png\n: U-Um...Sakura?\n44-Sakura.png\n: What is it?\n7-Makoto.png\n: Can you make some time later? I was hoping I could talk to you.\n60-Hina24.png\n: Ah! Now that Kyoko's dumped him, Makoto's trying to win Sakura's heart!\n46-Toko10.png\n: Are you in h-heat, Makoto? Don't care who they a-are as long as they've g-got the right equipment?\n53-Hina16.png\n: Watch out, Sakura! Makoto's transformed into a wild beast! Prime Minister Wild Beast of Beastopia!\n7-Makoto.png\n: Why is this happening to me...?\n81-Sakura3.png\n: Can our talk wait till tomorrow? I'd like to get some rest today...\n47-Sakura4.png\n: For some reason, I've been feeling worn down these last few days.\n32-Hina2.png\n: Huh? Are you sick? Did you get hurt?\n47-Sakura4.png\n: No, nothing serious. I've just had some minor aches and pains...\nHuh? Is that...?\n82-FlashT.png\n84-FlashB.png\nIt must be because of that battle...\n86-Hina9.png\n: But it must be pretty bad if you have to go rest. Are you sure you're okay?\n47-Sakura4.png\n: I'm sure a protein shake and some sleep will get me back on my feet.\n87-Hina7.png\n: That's true, protein is good for all kinds of stuff!\n14-Hiro14.png\n: You guys, like, worship protein. It's like your god or something...\n33-Hina22.png\n: Makoto! I dunno what it is you wanna talk to Sakura about, but save it till tomorrow! She's in pain!\n7-Makoto.png\n: Y-Yeah, I got it...\n47-Sakura4.png\n: Sorry...\n90-Hiro18.png\n: Well...for now, let's eat!\n46-Toko10.png\n: E-Eat? I'm kinda n-nervous...\n91-Hiro7.png\n: Huh? How come?\n56-Toko4.png\n: Cuz...I don't usually...e-eat in front of other p-people.\n93-Toko5.png\n: Ever since I w-was a kid, I'd...eat b-by myself.\n94-Hiro5.png\n: What about your family?\n56-Toko4.png\n: Oh, well-y-yeah. I used to live with my d-dad, my mom, and my m-mom.\n91-Hiro7.png\n: You had...two moms?\n42-Toko12.png\n: What? That's just how th-things were...\n13-Hiro8.png\n: That's, like, a serious issue!\n96-Hina23.png\n: Just let it go. You're asking for trouble getting involved with her more than you have to.\n58-Toko3.png\n: How d-dare you speak to me with that d-disgusting mouth of yours...\n60-Hina24.png\n: S-Stop saying stuff like that!\n7-Makoto.png\n: A-Anyway...I'm gonna go ahead and eat. If I don't, Kyoko will never show up.\n14-Hiro14.png\n: Pretty miserable situation, man.\n7-Makoto.png\n: H-Hehe...\nI scarfed down breakfast as fast as I could and immediately headed back to my room.\n100-BeautifulDays.png\nI'll have to wait till tomorrow to confront Sakura about what I saw. But in a way...I'm kinda relieved. It takes a lot of courage to stand face-to-face with Sakura and accuse her of something...\n2-BeautifulDays.png\n3-Narration.png\n: We're running low on people to talk to in Free Time now. It doesn't help that of the people still alive our choices are even more limited right now. Sakura is too tired to do Free Time and Kyoko is still mad at us and will just leave as soon as you talk to her.\n3-Narration.png\n: As such, we're going to keep talking with Byakuya.\n6-Byakuya2.png\n: What's the matter? Thinking about who you might like to kill?\n7-Byakuya3.png\n: Well, choose wisely. In this game, loss means nothing less than death.\n> Spend some time with Byakuya\n10-Byakuya7.png\n: Fine. I don't mind allowing you to indulge in my attention. I hope you appreciate this.\nI spent some time with Byakuya. Byakuya and I grew a little closer today.\n> Yes, definitely\nOld Timey Radio\n: A radio with a retro exterior but state-of-the-art technology inside. Of course, there's no reception in the school, so you can't hear anything anyway.\n14-Byakuya12.png\n: You...you bastard! How did you get your hands on this!? Even the collective force of the entire Togami corporation wouldn't be enough to obtain this gem!\n3-Narration.png\n: (I have like, seven more of these...)\n15-Byakuya4.png\n: I...I'm going to hold on to this!\nSeeing Byakuya so please with something I gave him makes me happy!\n17-Byakuya.png\n: A bird in the hand is worth two in the bush.\n18-Makoto.png\n: ...Huh?\n6-Byakuya2.png\n: It's a proverb. It means if you can only obtain something inferior, that's still better than longing for something better.\n18-Makoto.png\n: Yeah, I know what it means. But...so what?\n7-Byakuya3.png\n: Put another way, if all you have nearby is a loser, that's better than a proper assistant far away.\n19-BoysLifeofDespair.png\n6-Byakuya2.png\n: Makoto. Be my secretary.\n18-Makoto.png\n: What...?\n7-Byakuya3.png\n: A useless commoner like you could never hop to earn more than, say, 100,000 dollars a year. But as my secretary, you would be guaranteed an ample salary and job security for the rest of your life. And in honor of it being my birthday today, how about I multiply your already impossible expectations by, oh, 5.5?\n100,000 dollars times 5.5? You mean...?\n> 550,000 dollars?\n550,000 dollars!? That's like, board member money!\n17-Byakuya.png\n: Of course, as my secretary you wouldn't be a mere servant. At some point, I would want you to become an actual assistant, taking the lead on important projects. Assuming you produce acceptable results, you could even become a core part of the Togami Corporation.\n6-Byakuya2.png\n: You have no reason to refuse.\nThis is all so sudden... I don't get why... But he seems serious about it... Still, I...\n18-Makoto.png\n: I'm sorry, but I'm gonna hafta say no.\n22-Byakuya5.png\n: ...I'm trying to give you a chance to enter the battlefield of life and claim victory. Most commoners will never get that chance. This is literally a once-in-a-lifetime opportunity. Do you understand? This is your chance. This is your one and only chance to rise above the 99%.\n10-Byakuya7.png\n: Are you really so scared of having to fight, to compete, in order to win?\n18-Makoto.png\n: It's not that I'm scared... It's that I want to succeed based on my own effort. I want to find my own battlefield... I don't want it handed to me--I want to earn it. I want to find something I'm willing to fight and die for. That's the only way I'll be satisfied.\n23-Byakuya9.png\n: ...Then you meant what you said earlier. That if you can live a life that you're satisfied with, that's all that matters...\n2-BeautifulDays.png\n7-Byakuya3.png\n: Hmm... I'm glad to see you passed my test.\n18-Makoto.png\n: Huh? Your test?\n17-Byakuya.png\n: That's right. The mere thought of someone like you as my secretary makes me physically ill.\n18-Makoto.png\n: Wait, so then...\n7-Byakuya3.png\n: The salary offer still stands, of course. It's yours if you want it. I don't need you spreading rumors that Byakuya Togami doesn't honor his word.\nSo he'd basically be paying me...to do nothing? In a way...I almost regret my decision.\n17-Byakuya.png\n: But I must say, I just don't understand you. You don't want to fight, and yet you don't flee from the battle, either.\n18-Makoto.png\n: It's like I said... For me, happiness comes from\nliving the life I want to live\n.\n7-Byakuya3.png\n: Hmph. Easy enough to say. Now you have to enforce your will until the very end.\n6-Byakuya2.png\n: If you can do that, if you can make it to the end, I'm afraid I'll be forced to acknowledge you...\n18-Makoto.png\n: Then that's exactly what I'll do. Someday, absolutely...\n17-Byakuya.png\n: I don't expect much from you, but I'll be waiting.\n3-Narration.png\n: This Free Time gives us SP+1. I actually went and looked up Byakuya's date of birth in the supplemental materials for this game and it's listed as May 5th. The 5.5x salary thing makes a lot more sense now. I don't know much about when Japanese schools start their terms but would May 5th make sense as a date shortly after the beginning of a new term for the students? I'm just curious if there's consistency here.\nOnce we were all done, I headed back to my room for a little while...\nI have plenty of time... I don't feel like just sitting here. I should go somewhere...\n3-Narration.png\n: The same people are still unavailable to us for Free Time so let's go ahead and finish up Byakuya's Free Time Events. He has five events in total and this is the fifth one.\n17-Byakuya.png\n: The others have flocked together as usual, I see.\n7-Byakuya3.png\n: But they need to be careful. Growing too close will only cloud their judgment.\n> Spend some time with Byakuya\n> Yes, definitely\nMillenium Prize Problems\n: These seven important mathematical problems were posed by the Clay Mathematics Institute, with a reward of one million dollars for each one solved.\n3-Narration.png\n: I've gone ahead and skipped all of these interactions because they are the same as the ones in the previous Free Time.\n32-DespairSyndrome1.png\n17-Byakuya.png\n: ...How do you still not understand?\n18-Makoto.png\n: ...Understand what?\n6-Byakuya2.png\n: I've been sacrificing all this valuable time of mine for *your* sake. But it's all amounted to nothing. We simply have nothing to talk about. We could talk forever and a day, and I would gain nothing from it.\n18-Makoto.png\n: B-But, the more we come to understand each other--\n10-Byakuya7.png\n: You and I will *never* understand each other. We live in different worlds. Our ways of life, our ways of thinking are totally incompatible. You're a loser. So go ahead and live your loser life, make a bunch of loser friends. Then together, you can lick each other's loser wounds.\n18-Makoto.png\n: You don't have to keep saying loser...\n10-Byakuya7.png\n: Whether your self-indulgence is a lie or not, it doesn't matter. Whatever happens, I'm going to keep on fighting, and I'm going to keep on winning.\n6-Byakuya2.png\n: That's one thing that will never change.\n18-Makoto.png\n: But having to win all the time... Doesn't that make your life kinda hard?\n17-Byakuya.png\n: Such is the fate of\nthe chosen\n.\nThe chosen...\n18-Makoto.png\n: Listen, I've been meaning to ask you... You keep talking about \"the chosen\"... What does that mean, exactly? The way you say it, it seems a lot heavier than how I'd normally think of it...\n17-Byakuya.png\n: ...\n36-AllStarApologies.png\n7-Byakuya3.png\n: Fine. If I'm going to waste my time with you anyway, I may as well explain this one last thing. I'll tell you how I became known as the Ultimate Affluent Progeny...\nThere's a story behind that...?\n23-Byakuya9.png\n: It has to do with the secret to the Togami family's prosperity. Our success comes from our family's rather...\npeculiar inheritance system\n.\n18-Makoto.png\n: Peculiar inheritance--what do you mean?\n17-Byakuya.png\n: You see, our family head never takes a wife. Rather, he couples with exceptional women the world over, in order to bear as many children as possible.\nAll over the world...?\n23-Byakuya9.png\n: They then make the children compete, and only one can come out on top. And whoever it is...earns the right to become the next head of the family.\n18-Makoto.png\n: You mean...you have to fight your own brothers and sisters!?\n17-Byakuya.png\n: For my battle, there were fifteen of us in total. When all was said and done, only one was still standing--the youngest brother. Me.\n7-Byakuya3.png\n: In the entire history of the Togami family, the youngest male had never won.\nJeez, that sounds brutal. I can't even imagine something like that...\n23-Byakuya9.png\n: So, now do you understand? I won my title in open combat. *That* is how I became the Ultimate Affluent Progeny. I was not born into greatness. I had to earn it.\n10-Byakuya7.png\n: I put my life on the line, and I *earned* the right to be called the chosen.\n18-Makoto.png\n: You put your life on the line...? Then...what about your siblings?\n15-Byakuya4.png\n: Dead.\n18-Makoto.png\n: D-Dead!?\n17-Byakuya.png\n: I don't mean that literally, of course. They become dead to the family, unfit for the name of Togami.\n7-Byakuya3.png\n: Of course, for them it really is like death. They're forced to become one of the 99%. One of *you*.\n18-Makoto.png\n: But it must've been really hard, right?\n23-Byakuya9.png\n: You can't even imagine. Which is why the survivor is recognized as the chosen. When you take over as the head of the family, all the weight of that family comes to rest on your shoulders.\n10-Byakuya7.png\n: That is how\ndedicated\nI am. I am forever dedicated to keep on winning. And so I shall. Otherwise, I would only feel pity for those I'd already defeated.\nByakuya pretty much said he carries the weight of always having to win... Winning comes natural to him...\n7-Byakuya3.png\n: All I'll say at this point, is that I'm going to win *this* game, too. It's been a long time since I've had so much fun. I need to get as much enjoyment out of it as possible.\n15-Byakuya4.png\n: And in the end, I will stand victorious. I won't lose to the mastermind or you or anyone else. Even as the rest of you fall one by one, I will live and I will win.\n22-Byakuya5.png\n: As long as my name is Byakuya Togami.\nThe finality of his statement left no room for doubt or question. Nobody but Byakuya could talk that way and sound so convincing. But because of him, it seems possible that maybe that *is* his fate... Honestly, the more I talk to him, the more I see how far apart we are. At the same time, I feel like I understand him that much more... At least...I *think* I do...\n41-Byakuya14.png\n: Now let me be crystal clear--we no longer have anything to talk about. Do not come to me like this again. Goodbye, loser.\nI can't imagine any way Byakuya and I could ever become friends in this lifetime...\n3-Narration.png\n: This final free time gives us another SP+1.\n3-Narration.png\n: Additionally, in the Report Card section of the menu, Byakuya's card is now marked with a star to signal that his Free Time Events are completed. It also gives you a Bronze Playstation Trophy titled\nThe Game Hungers\n.\n44-Byakuya.png\nByakuya Togami's Character Art\nOnce Byakuya was gone, I went back to my room.\n♪\nNo Music.\n♪\n46-QuicklytotheGym.png\n*Ding dong, bing bong*\n49-MonokumaTV.png\n: Attention! Attention! Please gather in the gym as soon as you possibly can! Quickly, quickly, quickly, quickly!\nHe made a special announcement...to ask us to come to the gym? And he sounded pretty serious about it, too...\n2-DespairSyndrome1.png\n3-Narration.png\n: Monokuma told us to report to the gym for an emergency meeting.\n3-Narration.png\n: Sakura can be found waiting in the gym lobby.\n6-Sakura.png\n: You're the last one. Everyone else is already inside.\n7-Makoto.png\n: Aren't you gonna go in...?\n8-Sakura6.png\n: ...I...have a bad feeling about this.\n7-Makoto.png\n: More than just a feeling, probably. Monokuma *did* call us together, after all...\n9-Sakura4.png\n: ...\n7-Makoto.png\n: Sakura...?\n8-Sakura6.png\n: Makoto... If something happens to me... Hina...\n7-Makoto.png\n: Huh?\n11-Sakura8.png\n: No, never mind. I... I'm... Who would ever believe in someone who doesn't believe in themselves? *leaves*\n7-Makoto.png\n: Um...\nSakura...?\n♪\nNo Music.\n♪\nEveryone must have heard the announcement, and once we were all gathered at the gym...it began.\n17-DespairSyndrome2.png\n18-Monokuma.png\n: Okay, let's get this show on the road!\n19-Byakuya15.png\n: You're about to give us your next\nmotive\npresentation, aren't you?\n20-Monokuma11.png\n: Hmm?\n21-Byakuya5.png\n: You got us all together to present another motive, right?\n23-Toko7.png\n: I-Is he right...?\n24-Hina10.png\n: We have to go through this again...?\n25-Hiro6.png\n: Ugh...no! Not again! I can't take it anymore!\n26-Byakuya7.png\n: I'm impressed by your level of dismay. You finally see just how low on the totem pole of life you really are.\n28-Monokuma8.png\n: No... No, no, no... No no no no no no no no no no no no no no no NO!\n29-Monokuma4.png\n: That's not it at all. We're not here to talk about motive.\n30-Monokuma12.png\n: The reason I gathered you all here is so that I could get rid of my grudge.\nYour...grudge?\n32-Kyoko7.png\n: We have a grudge against you, of course, but I don't recall *you* ever having a grudge against *us*.\n30-Monokuma12.png\n: I told you yesterday, didn't I? An eye for an eye, a fang for a fang.\n33-Byakuya6.png\n: Stop beating around the bush! Just tell us what you're talking about!\n29-Monokuma4.png\n: Well, Byakuya. You've already told everyone how one of you might be working as a\nspy\nfor me, right?\n33-Byakuya6.png\n: Yeah, so, what about it?\n18-Monokuma.png\n: Well today I'd like to tell you about that spy.\n34-Makoto2.png\n: What...?\n29-Monokuma4.png\n: So guess what.\n36-MrMonokumaAfterClass.png\n37-Monokuma5.png\n: The spy is actually\nSakura Ogami\n!\n34-Makoto2.png\n: ...!\nHe said it so openly, it made it sound like it wasn't that big of a deal even though he'd just revealed a huge secret.\n38-Hiro8.png\n: What...? What did you just say?\n21-Byakuya5.png\n: He said the spy is\nSakura\n.\n39-Hina16.png\n: Wh-What are you talking about?\n41-Hina15.png\n: There's...there's no way Sakura's a spy!\n42-Hina9.png\n: Right, Sakura?\n9-Sakura4.png\n: ...\n42-Hina9.png\n: Sakura...?\n29-Monokuma4.png\n: And I might just make Sakura fulfill the promise she made sometime soon... And if she doesn't...I can't be responsible for what might happen to that hostage of mine... Anyway, that's all I wanted to say. What you guys choose to do with that information is up to you.\n37-Monokuma5.png\n: Roast her, boil her. Kill her, don't kill her. Whatever!\n29-Monokuma4.png\n: Puhuhu... Either way, I can't wait...! *leaves*\nAnd just like that, he was gone... Finally, I understood what he had been talking about. An eye for an eye, a fang for a fang... In other words,\nbetrayal\nwould be met with\nbetrayal\n.\n45-BoysLifeofDespair.png\n46-Hiro7.png\n: U-Um... So what does this mean?\n25-Hiro6.png\n: I-Is it true? Has Ogre really been spying on us for the mastermind!?\n41-Hina15.png\n: What are you saying!? There's no way!\n47-Toko4.png\n: But that *is* wh-what the stuffed animal said, r-right?\n39-Hina16.png\n: Well he's wrong! There's just...no way!\n32-Kyoko7.png\n: Well, Sakura? If he's wrong, all you have to do is tell us.\n9-Sakura4.png\n: ...\n49-Sakura3.png\n: I'm sorry I didn't tell you earlier...\n24-Hina10.png\n: What...?\n25-Hiro6.png\n: Then he was being serious for serious!? Ogre's been working for the mastermind!?\n9-Sakura4.png\n: I'm sorry...\n51-Toko12.png\n: So you've b-been lying to us all this t-time?\n24-Hina10.png\n: I-It's not true...! Sakura was probably...being controlled! There's gotta be some...some reason! She didn't have a choice, she was just...forced to do it!\n34-Makoto2.png\n: Yeah, I'm sure Hina's right. The mastermind probably threatened her somehow, and Sakura had no choice but to do what she was told.\n51-Toko12.png\n: Wh-What...? You're talking like y-you know that for a f-fact!\n34-Makoto2.png\n: Because...I *do* know it for a fact. Because I saw it!\n52-FlashT.png\n54-FlashB.png\n34-Makoto2.png\n: I saw Sakura and Monokuma...fighting... And that's where I heard it... Monokuma mentioned a \"hostage\" a second ago, right? And during their fight, I heard Sakura say she'd decided to\nfight against the mastermind\n.\n8-Sakura6.png\n: You...saw all that?\n34-Makoto2.png\n: The mastermind took a hostage, so you were forced to swear loyalty to them, right? But in the end...you made up your mind to \"betray\" the mastermind.\n56-Byakuya4.png\n: Which means Sakura isn't our enemy. She's a friend who we can trust without question. Is that it?\n57-Byakuya3.png\n: Ridiculous. Do you live in some sort of alternate reality fairy tale?\n21-Byakuya5.png\n: She was the mastermind's tool. You absolutely cannot trust someone like that.\n59-Hiro5.png\n: H-He's right! We can't just believe whatever she says now!\n19-Byakuya15.png\n: How can we even be sure she really *did* betray the mastermind? Maybe this is a double-bluff, and she's still doing exactly what the mastermind wants.\n41-Hina15.png\n: Sakura would never do that!\n26-Byakuya7.png\n: Okay, then Sakura...if you really have cut ties with the mastermind, tell us who they really are.\n61-Sakura5.png\n: Well...\n9-Sakura4.png\n: Sorry, I can't. Even I don't know that.\n57-Byakuya3.png\n: You don't know? That just makes you all the more suspicious.\n24-Hina10.png\n: She's telling the truth! You have to believe her!\n26-Byakuya7.png\n: Shut up. I'm not finished questioning her.\n63-Byakuya8.png\n: Next question. What's this about a \"promise\"? What did the mastermind order you to do?\n9-Sakura4.png\n: ...I was told...\n61-Sakura5.png\n: ...to kill one of my friends.\nIt suddenly felt like the temperature in the room had dropped twenty degrees. The weight of those words...\n57-Byakuya3.png\n: I see. So even now, you've taken aim on our lives.\n41-Hina15.png\n: You're wrong, I'm telling you! Sakura would never do that!\n51-Toko12.png\n: Y-You don't have to yell, we can h-hear you just fine. Don't you have an i-inside voice...?\n41-Hina15.png\n: It's because you're not LISTENING to me!\n49-Sakura3.png\n: Please, stop. You don't need to defend me anymore.\n9-Sakura4.png\n: I have to take full responsibility for this...\n65-Kyoko2.png\n: How do you intend to do that?\n♪\nMusic cuts out.\n♪\n49-Sakura3.png\n: By destroying the mastermind.\n34-Makoto2.png\n: What...?\n61-Sakura5.png\n: I'm going to challenge then. Even if it means we both go down, I *will* defeat them.\n9-Sakura4.png\n: *That* is how I intend to take responsibility.\n17-DespairSyndrome2.png\n24-Hina10.png\n: H-Hold on! What do you mean, if you both go down!?\n9-Sakura4.png\n: Hina...I'm sorry I didn't tell you about this.\n68-Hina12.png\n: What...?\n9-Sakura4.png\n: I didn't know what to do. I went back and forth about confiding in you again and again...\n61-Sakura5.png\n: But I was scared. I thought if I told you, you might think less of me.\n24-Hina10.png\n: S-Sakura!\n69-Sakura12.png\n: I'm sorry... *leaves*\nSakura turned away from us and left the gym. And then...\n71-GoodNight.png\n*Ding dong, bing bong*\n74-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\n2-DespairSyndrome1.png\n26-Byakuya7.png\n: Well, it's nighttime. We should all go to bed.\n24-Hina10.png\n: Hold on! This whole thing with Sakura is--!\n76-Byakuya.png\n: Over. She's our enemy. There's nothing more to discuss.\n41-Hina15.png\n: No! Sakura is NOT our enemy!\n77-Hina14.png\n: ...Why...? Why doesn't anyone understand her...?\n56-Byakuya4.png\n: What is it you think *you* understand? You didn't even know who she really was.\n39-Hina16.png\n: Th-That's--!\n79-Kyoko17.png\n: Let it go for now, Hina. Talking about it isn't going to help anything.\n81-Hina18.png\n: B-But...!\n65-Kyoko2.png\n: Go to your room, cool down, and we can continue this discussion tomorrow.\n82-Hina17.png\n: ...\nIt was the worst... The mood at the end of the night was just the worst... Being in such an awful mood...we were honestly glad the day was over.\nSakura...is the spy. She's the traitor... ...Byakuya said Sakura is the enemy. But he's wrong... She's not my enemy. She's my friend, without a doubt! But...what can I do? What can I do to make everyone believe in Sakura? How...?\n86-MrMonokumasLesson.png\n88-MonokumaTheater.png\n: As long as you're human, there will always come a point where you wish you could do things differently. Even a baseball player in the major leagues... Even a soccer player touring Europe... Even a famous singer who started her career as a backup dancer on a sketch comedy show... She makes a brilliant debut, but instead of going for more, she marries some third-rate actor and retires. Every human has regrets, has things they'd like to go back and change. But I don't! Cuz I'm a bear.\n2-GoodMorning.png\n*Ding dong, bing bong*\n5-MonokumaTV.png\n: Good morning, everyone! It is now 7 a.m. and nighttime is officially over! Time to rise and shine! Get ready to greet another beee-yutiful day!\nI'm worried about Sakura... I need to hurry up and get to the dining hall.\n8-BeautifulMorning.png\n9-Narration.png\n: Kyoko's the only one out in the halls this morning.\n11-Makoto.png\n: Kyoko...good morning...\n12-Kyoko2.png\n: ... *leaves*\nStill ignoring me... Is she really that mad at me? But actually, it's not just Kyoko... Ever since Monokuma summoned us last night, the atmosphere around here has gotten really heavy... I can almost feel it looming over us, weighing us down...\n11-Makoto.png\n: *Sigh*\nWell if nothing else, I need to patch things up with Kyoko as soon as possible.\n14-DespairSyndrome2.png\n16-Hiro4.png\n: Ah, Makoto! Are you okay?\n11-Makoto.png\n: Huh? What do you mean...?\n17-Toko4.png\n: You were late, s-so...we were worried a-about you...\n18-Byakuya.png\n: What a dullard...\n11-Makoto.png\n: Toko? Byakuya? What are you doing here?\n20-Hina16.png\n: They're \"taking refuge\" here.\n11-Makoto.png\n: Refuge...?\n21-Byakuya7.png\n: Don't make that stupid face. We have to protect ourselves against the mastermind's tool.\n22-Makoto2.png\n: The mastermind's...? Are you talking about Sakura!?\n12-Kyoko2.png\n: ...\nThat's when I finally noticed. The only one that wasn't in the dining hall...was Sakura.\n22-Makoto2.png\n: Huh...? Where *is* Sakura?\n24-Byakuya15.png\n: All I know is, if she were here, I wouldn't be. The only reason I went out of my way to join the rest of you was as a safeguard against that threat.\n22-Makoto2.png\n: Th-Threat...!?\n20-Hina16.png\n: Why...? Why do you hate her so much?\n25-Byakuya4.png\n: Isn't it obvious? Because this makes things unfair.\n22-Makoto2.png\n: Unfair...?\n25-Byakuya4.png\n: The game should be fair to all players. The existence of a spy for the mastermind upsets that balance.\n20-Hina16.png\n: That's a stupid reason!\n27-Byakuya5.png\n: Stupid? This is a life-or-death game, is it not?\n28-Hina15.png\n: It IS stupid! You're a stupid idiot!\n30-Kyoko13.png\n: Before you get too far into your argument, maybe you should stop and think things through. Why did the mastermind reveal that Sakura was the spy to us?\n20-Hina16.png\n: They were getting revenge on her, right? Like Monokuma said, \"An eye for an eye.\"\n12-Kyoko2.png\n: That may be part of it, but it's not the whole picture. Revealing that fact also meant to serve as the next\nmotive\nthe mastermind wanted to give us. The chaos and confusion born from suspicion. The hatred...\n30-Kyoko13.png\n: In other words, this right here--the fighting, the bickering--is the trap the mastermind laid for us. Knowing that, will you still stand there and argue like children?\n20-Hina16.png\n: Th-That's not what I'm trying to do. It's just...\n32-Hina17.png\n: I mean...how can I get you guys to believe in Sakura again?\n33-Hiro5.png\n: If she really can beat the mastermind like she said, that'd go a long way in my mind...\n28-Hina15.png\n: Idiot! You'd really ask her to do something so dangerous? What if something terrible happens to her!?\n35-Byakuya3.png\n: It wouldn't matter.\n36-Hina12.png\n: ...What?\n21-Byakuya7.png\n: If Sakura were to die, that's one less person for the mastermind to control. I have no problem with that.\n22-Makoto2.png\n: H-Hold on! Byakuya--!\n18-Byakuya.png\n: In fact, if she did die, that would settle this entire issue, wouldn't it?\n25-Byakuya4.png\n: It would put the whole problem to rest!\n*SLAP*\n♪\nMusic cuts out.\n♪\n38-YouShouldveDied.png\n39-Byakuya20.png\n: What the hell...?\n40-Hina28.png\n: You disgust me! You're...you're a monster! To say something like that... It should've been you. You should've been the one to die!\n42-AllStarApologies.png\n43-Byakuya6.png\n: I should've died...?\n25-Byakuya4.png\n: Interesting. Then are you planning to take care of that yourself? Go ahead. Try it, if you dare. That's how it works here, after all.\n32-Hina17.png\n: You think I can't do it?\n22-Makoto2.png\n: H-Hina! Calm down!\n30-Kyoko13.png\n: This is exactly what the mastermind wants. And it's exactly what Sakura *doesn't* want.\n32-Hina17.png\n: ...\n25-Byakuya4.png\n: What's wrong? Lost your nerve?\n32-Hina17.png\n: ... I'm leaving... I'll be in my room. *leaves*\nTrembling with anger, Hina ran off.\n45-Toko12.png\n: That s-stupid cow...! How dare she...? She should d-die a thousand deaths. No, a million...!\n24-Byakuya15.png\n: So she was just another hysterical little girl. Hardly worth my attention...\n46-Kyoko7.png\n: It's what other people call having \"feelings,\" Byakuya. And all you can do is mock them for it.\n18-Byakuya.png\n: What's wrong with that?\n48-Kyoko14.png\n: A friendly word of warning--someday that attitude is going to come back and bite you. Hard.\n21-Byakuya7.png\n: And I will happily elude its attempts.\n50-Hiro13.png\n: S-So um, ya know...\n33-Hiro5.png\n: How about we, uh...eat? Er...maybe now's not a good time...\n16-Hiro4.png\n: Heh...heh-heh...\nWithout a word, each of us left the dining hall. We headed back to our rooms, one by one...\n11-Makoto.png\n: Whew...\nSo, what should I do today?\n2-BeautifulDays.png\n3-Narration.png\n: Free time again. Let's see who's available to talk with today. Kyoko is still pissed at us and we've finished Byakuya's Free Time Events completely so both of them are unavailable.\n3-Narration.png\n: Sakura's no longer in her room and can be found at the Chem Lab. Let's see what she's up to.\n6-Sakura6.png\n: I'm not sure I'm ready to open up just yet... Maybe if you create the right opportunity...\n> Spend some time with Sakura\n9-Sakura12.png\n: Even if I don't feel like talking...? You'll still stand by me?\n10-Sakura8.png\n: I still don't understand you, Makoto...\nWithout saying a word, I stood by Sakura... Sakura and I grew a little closer today.\n> Yes, definitely\nMac's Gloves:\nA pair of boxing gloves infused with a staggering amount of passion and effort. Wearing them makes you want to throw a thousand cross-counters.\n10-Sakura8.png\n: I never imagined a boy would want to give me anything... I'm a little embarrassed, but also very happy.\nI get the impression that she liked it. That's good...\n3-Narration.png\n: And then the game kicks us back to our room. Yep! Sakura's actually in no mood to do a Free Time Event but I enjoyed that little bit of dialogue enough that I wanted to include it here.\n3-Narration.png\n: One game reload later, here's who we're actually going to be talking with today. Get ready for some fun conversations.\n17-Hiro.png\n: Well well, Makoto! What's goin' on?\n> Spend some time with Hiro\n20-Hiro2.png\n: You wanna go grab a bite to eat in the dining hall? I'll teach you where all the best power spots are!\nHiro taught me about all the best power spots... Hiro and I grew a little closer today.\n> Yes, definitely\nRoyal Curry:\nA curry pack made for kids. It's made with expensive, high-quality ingredients you wouldn't expect from a kid's food.\n24-Hiro7.png\n: Whoa! I've always wanted one of these!\n25-Hiro3.png\n: My God, my Buddha, my Makoto! I'll never forget what you've done for me!\nI get the impression he liked it. That's good...\n27-Hiro12.png\n: Hey, Makoto. You know what I think? You and me meeting like this? It wasn't coincidence.\n20-Hiro2.png\n: So I've got some good news for you! I'm gonna give you a psychic reading at a huge discount!\n28-Makoto.png\n: A discount...?\n30-100MileJunkFoodDash.png\n31-Hiro15.png\n: Normally it's\na thousand bucks\nfor two hours. But for you? Let's call it\nnine hundred\n!\n28-Makoto.png\n: That's only a hundred-dollar discount! And even then it's way too expensive!\n32-Hiro16.png\n: Hey, come on! You should count yourself lucky that the\nUltimate Clairvoyant\nis willing to tell your future!\n28-Makoto.png\n: ...So are you right pretty often?\n20-Hiro2.png\n: I sure am! At the bare minimum, I've got a\n20% chance of accuracy\n!\n20%? That sounds pretty sketchy...\n32-Hiro16.png\n: For real? Don't make that face! Didn't you hear what I said!? 20% of the time I'm right, every time! That includes natural disasters, election results, you name it! Don't you realize how amazing that is!?\n28-Makoto.png\n: Umm...\n31-Hiro15.png\n: Okay, fine! I'll give you a special trial run! After all, I've already seen what the future has in store for you!\n28-Makoto.png\n: What!? When did you see it!?\n20-Hiro2.png\n: Heh heh heh. You won't believe what I saw... It would appear that the mother of your children, and the mother of *my* children, are the same woman!\n28-Makoto.png\n: I refuse! Denied! Don't like it!\n27-Hiro12.png\n: Doesn't matter if you don't like it! That's just the way it is.\n28-Makoto.png\n: ...20% accuracy, you said?\n17-Hiro.png\n: At least.\nI-I pray to everything holy that you're wrong! Please, be wrong!\n25-Hiro3.png\n: Now then, since that was a special trial run, I'm afraid I can't apply the discount. That'll be one thousand dollars, please! Don't worry, you can pay me after we get outta here.\n28-Makoto.png\n: W-Wait, hold on--! But there's no way you're gonna be right, right!?\n20-Hiro2.png\n: If you like, I can do a reading right now to see whether my reading was right or not. Naturally, additional fees will apply!\n25-Hiro3.png\n: Think about it, okay? Let me know as soon as you're ready for my services! Hahaha! *leaves*\n2-BeautifulDays.png\nOh...he's gone... Do I have enough in my bank account to take another crack at it...?\n28-Makoto.png\n: ...No! I can't bring myself to pay for something like that!\nI can see how people could fall into that kind of cycle, though. That was close...\n28-Makoto.png\n: Please, whoever's listening, I'm begging you... Whatever else happens, don't let him be right...!\n3-Narration.png\n: This event unlocks the skill\nLost in Thought.\nOnce we were all done, I headed back to my room for a little while...\nI have plenty of time... I don't feel like just sitting here. I should go somewhere...\n3-Narration.png\n: We're going to continue with Hiro for the time being.\n27-Hiro12.png\n: I had a dream last night... I saw that the spirit world was going to flood us with energy and save us from this school nightmare!\n31-Hiro15.png\n: It's a prophecy! Take heart, my man!\n> Spend some time with Hiro\n20-Hiro2.png\n: Oh, I've got something I wanted to show you! I got the stigmata...on my back!\n25-Hiro3.png\n: Heh-heh-heh. It's a gift from the gods!\nHiro showed me a scar on his back, though I didn't really get what it meant... Hiro and I grew a little closer today.\n> Yes, definitely\nLeaf Covering:\nA loincloth meant to emphasize one's manliness. Its simple design features a single leaf overlaid on white cloth.\n25-Hiro3.png\n: That's real nice of you, man! I'll gladly take it.\nI get the impression that he liked it. That's good...\n30-100MileJunkFoodDash.png\n25-Hiro3.png\n: Hey, Makoto! What's up, my brother and fellow mother lover? Let's raise our semi-siblings up right, okay!?\n28-Makoto.png\n: S-Stop talking about that...\n45-Hiro18.png\n: So! You ready for the next round!?\n28-Makoto.png\n: Never! ...Actually, how do you do your fortune-telling, anyway? I saw you doing palm readings and stuff, and you didn't use any tools or anything...\n20-Hiro2.png\n: Wow, I didn't know you knew about divination tools! Sounds like you know your way around the spirit world!\n28-Makoto.png\n: Er, I'm not sure you need to know that much to know about those kinda tools.\n17-Hiro.png\n: Now that I know you're an expert, I have a question for you! A correct answer gets you another discount!\n28-Makoto.png\n: No thanks...\n27-Hiro12.png\n: There are 22 cards known as the Major Arcana, and 56 cards known as the Minor Arcana... Generally, the cards from the major Arcana are used for divination. Do you know what I'm talking about!?\nThe Major and Minor Arcana... And the Major Arcana cards are used to tell the future... That must be...\n> Tarot\n28-Makoto.png\n: Oh, I know! You're talking about tarot cards!\n49-Hiro8.png\n: Ahh, gloriously correct! I will now tell your fortune for a measly six hundred bones!\n28-Makoto.png\n: Wow, really? ...Is something I'd never say! I've had enough fortune-telling for one lifetime...\n50-Hiro14.png\n: I see... Well, if you ever change your mind, you know where to find me!\n28-Makoto.png\n: Sure thing. Anyway, getting back to what I asked you about before... If you don't use any tools or whatever, how do you do your fortune-telling?\n32-Hiro16.png\n: Well, don't be fooled. I have my own techniques. For example, I employ\nnumerology\n!\n20-Hiro2.png\n: It uses a mathematical formula to predict the future based on birth dates, letter numbering, all that.\n28-Makoto.png\n: But...I didn't see you doing anything like that, either.\n27-Hiro12.png\n: Well, it's more of an\ninspirational\nstyle of fortune-telling! Some kind of unknown power just acts through you, and suddenly, bam! You've got the info!\n28-Makoto.png\n: You're talking about intuition!\n31-Hiro15.png\n: Don't try and describe it using such a cheesy word!\n28-Makoto.png\n: But if it's not intuition, then it's gotta be some kind of supernatural power...\n32-Hiro16.png\n: Don't compare my clairvoyance to some occult bullcrap! I hate the occult! Take that crap somewhere else!\n28-Makoto.png\n: You hate the occult...?\n20-Hiro2.png\n: Yup! Now here's some good news. Act now, and I'll throw in an extra bonus on your reading! I used white magic to record a CD of spirit messages I received from the luxury suite of heaven! Five seconds of this baby, and you'll be witnessing miracles and communing with angels for days!\n28-Makoto.png\n: And you said you...hate the occult...?\n32-Hiro16.png\n: Hey, business is business!\nThe more I talk to him, the less I understand...\n3-Narration.png\n: This conversation gives us SP+1.\nI shook off Hiro's sales pitch, and headed back to my room for a while.\n53-GoodNight.png\n*Ding dong, bing bong*\n56-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\n57-DespairSyndrome1.png\nNighttime already... Tonight feels somehow...uneasy. We still haven't settled things with Sakura. Everyone's in a terrible mood. I just hope nothing happens tonight...\n59-MrMonokumasLesson.png\n61-MonokumaTheater.png\n: After I declined the offer to become a shrimp, the tech support lady just refused to drop the issue. Once the shrimp idea was dead, she came back suggesting I should become a crab instead. How much can one person love crustaceans!? I said no, of course, and she shot back... \"Okay, then how about to make you extra special, you can be a crab that walks sideways AND backwards!\" But how's that any better!? I don't wanna go sideways of backwards! I wanna go FORWARD! I heard her annoyed sigh on the other end of the line, then she said... \"You just don't see the splendor of the crab. Haven't you ever heard of The Tale of the Crab and the Monkey?\" Of course I've heard of it! I know all about it! But so what!? The crab beats the monkey, but it's just some legend. Hardly relevant to our greed-obsessed modern society! Sure, *monkeys* still show up in movies and stuff from time to time, but not crabs! Monkey-themed clothes are sweeping the fashion world, but the crab doesn't stand a chance, right? What I'm saying is, crabs have no place in today's light-speed world! Do your market research, lady! Which is why I chose the always-popular bear image. And that's the secret origin story of Monokuma...\n2-Narration.png\n: Time for some breakfast.\n???: UWAAAAAAAAAAHH!!!\n4-Makoto2.png\n: Huh!?\nWas that someone screaming!? I think it came from the dining hall!\n6-ToSurvive.png\n8-Hiro6.png\n: Ah, Makoto! We got a big problem, man!\n4-Makoto2.png\n: Wh-What's wrong!?\n9-Hiro10.png\n: L-Look!\nHiro's finger shook as he pointed...\n4-Makoto2.png\n: H-Hina!?\n11-Hina29.png\n: Nn...ghh...\n4-Makoto2.png\n: Are you okay!? What happened?\n8-Hiro6.png\n: Sh-She killed her... Genocide Jill killed Hina!\n13-Jill2.png\n: No no no no no! She's not dead! Open your eyes! No way she's dead!\n4-Makoto2.png\n: Wh-Why...? What happened?\n8-Hiro6.png\n: Well, Toko and Hina... Just all of a sudden, they were yelling, and then they knocked the pepper off the table.\n4-Makoto2.png\n: And that led to a sneeze...?\n14-Jill8.png\n: Her giant balloons are a little too perfect, aren't they!? I might be flat, but at least mine are real!\n15-Jill11.png\n: And look at my shapely collarbone! Doesn't it just totally set you on fire!?\n17-Jill.png\n: Anyway, you totally non-adorable boys just get her outta my sight, okay? Or else...\n18-Jill7.png\n: I'll start cutting. And cutting, and cutting, and indulging myself for who knows how long...\n4-Makoto2.png\n: O-Okay then, let's get Hina to the nurse's office. C'mon, Hiro. Help me!\n19-Hiro5.png\n: S-Sure thing!\n20-Jill12.png\n: Weeeoooo, weeeoooo!\n21-Jill3.png\n: Kyeeehahahaha!\nGenocide Jack's abrasive laughter chased us out of the room as we carried Hina away.\n24-BeautifulDeath.png\nBy the time I finished taking care of Hina's injury in the nurse's office she seemed to have finally regained her composure.\n26-Hina14.png\n: Th-Thank you...\n4-Makoto2.png\n: Are you sure you're feeling better?\n26-Hina14.png\n: Yeah...it really was just a scratch.\n28-Hiro3.png\n: But still, that was super close! If I hadn't yelled out, you'd be dead right now! It's all thanks to me, ya know!\n29-Hina16.png\n: Yes, well, a thousand thanks to you, sir.\n30-Hiro8.png\n: So sarcastic! That just makes you sound even MORE hostile!\n4-Makoto2.png\n: Hey, Hina...what the heck happened?\n26-Hina14.png\n: Oh, um...we just got into a\n[fight]\n. And I lost my temper, and flew off the handle...\n> fight\n4-Makoto2.png\n: Let me guess...the fight was because of Sakura?\n32-DeathWishNoIntro.png\n26-Hina14.png\n: At first, I tried to just ignore it. If you let jerk buttholes get to you all the time, you'll never have time left to live your life. But she just wouldn't let it go. So I just...\n33-Hina15.png\n: Without thinking about it, I felt like I wanted to punch her a dozen times!\n19-Hiro5.png\n: A dozen punches isn't really \"without thinking\"...\n34-Hina2.png\n: And when things got out of hand, Genocide Jack got let loose. Right?\n26-Hina14.png\n: It's my own fault. But I just...couldn't take it anymore. Because... Because...!\n36-Hina18.png\n: Because she was saying all these terrible things about my friend, ya know!?\nBefore I knew it, Hina's eyes started welling up with tears. And just as the tears were on the brink of spilling over...\n♪\nMusic cuts out.\n♪\n...the door to the nurse's office burst open. I thought the door was gonna fly off its hinges. And there she stood before us...\n38-BoysLifeofDespair.png\n39-Sakura2.png\n: ...Hina?\n40-Hina12.png\n: Sakura!\n41-Sakura5.png\n: You're hurt... What happened?\n42-Hina10.png\n: Oh! N-Nothing, it's not a big deal...!\n41-Sakura5.png\n: Makoto! Hiro! What's the meaning of this!?\n30-Hiro8.png\n: I-It wasn't me! It was Genocide Jill! It's all that demented murderous fiend's fault!\n44-Sakura11.png\n: Grrrnnnnhhhh!!! To hurt Hina... Damn you...! To leave me alone, but hurt her... What is this...?\n46-Sakura9.png\n: What issss thiiiiiissss!?\n8-Hiro6.png\n: Hyaaaaaahh!\n42-Hina10.png\n: I-I'm okay, really! It's just a scratch...!\n44-Sakura11.png\n: Grrrnnnnhhhh!!! Unforgivable...\n46-Sakura9.png\n: I can't forgive them!\n47-Hiro9.png\n: HYAAAAAAAAAHHH!!!\n44-Sakura11.png\n: Hiro...if you want to hate someone, hate me. If you want to hurt someone, hurt ME!\n8-Hiro6.png\n: I-I-I don't... *hate* you, exactly...\n46-Sakura9.png\n: WHHHHYYYYYYYY!!!\n8-Hiro6.png\n: S-S-S-S-S-S--!\n9-Hiro10.png\n: Somebody save meeeeeee! *runs away*\nHiro nearly tripped over himself as he ran screaming out of the nurse's office. But just a second later...\n???: What's going on?\n50-Kyoko7.png\n: What's all this noise about?\nKyoko stood in the doorway of the nurse's office, taking Hiro's spot in the room.\n51-Kyoko13.png\n: I gather that something happened?\n4-Makoto2.png\n: K-Kyoko! Please, you have to stop Sakura!\n44-Sakura11.png\n: You don't need to stop me... I'm okay. I'm not going to do anything. I just...\n41-Sakura5.png\n: I'm\ndrawing a line\n, right here and now.\nDrawing a line...?\n53-Sakura12.png\n: ...Goodbye. *leaves*\n42-Hina10.png\n: W-Wait! Sakura! *leaves*\nHina sprang into action, leaving the nurse's office to chase after Sakura. The only ones left were...\n54-Kyoko2.png\n: ...\n55-Makoto.png\n: ...U-Umm...Kyoko...?\n57-DespairSyndrome2.png\n58-Kyoko17.png\n: ...\n55-Makoto.png\n: Are you...still mad?\n58-Kyoko17.png\n: ...\n55-Makoto.png\n: Yeah, I figured.\n58-Kyoko17.png\n: It's...fine.\n55-Makoto.png\n: Huh...?\n24-BeautifulDeath.png\n54-Kyoko2.png\n: About\n[that issue]\nwe discussed earlier... It doesn't matter anymore.\n> that issue\n55-Makoto.png\n: Then...do you forgive me for not being able to talk about it...?\n58-Kyoko17.png\n: You could have told me about Sakura and Monokuma fighting, but you stayed quiet. You were only thinking of Sakura, and that's why you didn't tell me, right? You didn't want to confuse everyone until you could talk to her and be sure of what you saw. That's what you were thinking, and that's why you didn't tell me. Right?\n55-Makoto.png\n: Y-Yeah...\n60-Kyoko5.png\n: To think like that...\n62-Kyoko14.png\n: I wouldn't have expected such arrogance from you.\n55-Makoto.png\n: What!?\n51-Kyoko13.png\n: Because ultimately, that means you don't trust me.\n55-Makoto.png\n: N-No, that's not it... But if that's how you feel, I can't really change your mind. I'm sorry...\n63-Kyoko3.png\n: It's fine. I've already forgotten about it. Besides...\n65-Kyoko4.png\n: I may have...overreacted.\n55-Makoto.png\n: Huh...?\n50-Kyoko7.png\n: Anyway, it's over and done with. Like I said, let's just forget about it.\n55-Makoto.png\n: O-Okay. Thank you...\n58-Kyoko17.png\n: I want to talk to you about\n[something else]\n.\n> something else\n55-Makoto.png\n: What is it you wanted to talk to me about?\n54-Kyoko2.png\n: Actually... I'd like you to\ncome somewhere with me\n. I have business there...\n55-Makoto.png\n: Where...? Just come with me, and you'll find out.\nI-I guess, but...\n66-Kyoko19.png\n: Well then, shall we get going? *leaves*\nWith her typical indifference, Kyoko turned and walked away, setting a brisk pace.\n55-Makoto.png\n: Ah! Kyoko...!\nI hurried to catch up to her.\nKyoko walked ahead in silence...and in silence, I chased her. And eventually, we arrived...\n3-DespairSyndrome2.png\n4-Makoto.png\n: The dressing room...!? So the \"something else\" you mentioned...!\n6-Kyoko.png\n: That's right. It has to do with\nAlter Ego\n.\n4-Makoto.png\n: But...you said we didn't need Alter Ego anymore.\n7-Kyoko7.png\n: I didn't say we didn't need him. I just said he had done his job. Besides, it's not us that needs Alter Ego. *He* has business with *us*.\n4-Makoto.png\n: Huh...?\n8-Kyoko17.png\n: Alter Ego asked me to bring others to come see him. Apparently he has something he\nwants to ask us\n.\nAlter Ego...wants to ask us something?\n11-AlterEgo5.png\n: ...Hello. Oh, um...so it's just the two of you? Kyoko and Makoto?\nKyoko's fingers glided across the keyboard.\n> \"Is two not enough?\"\n12-AlterEgo7.png\n: No, it's okay! Two should be plenty.\n4-Makoto.png\n: But what is it he wants to ask us?\n13-Kyoko11.png\n: Let's find out, shall we?\nKyoko typed in the question.\n> \"What did you want to ask us?\"\n15-AlterEgo4.png\n: Oh yeah, so... I'd like you to take me somewhere where you can connect me to the school\nnetwork\n.\n16-Kyoko9.png\n: ...What?\nKyoko and I quickly glanced at each other. She replied...\n> \"Why?\"\n11-AlterEgo5.png\n: Well, um... You said my job was done, right? But...to just stop here... Saying I've finished my work...\n18-DeathWishNoIntro.png\n12-AlterEgo7.png\n: I don't want that! I want to keep being helpful to everyone. I want to work as hard as everyone else so that we can all get out of here!\n19-AlterEgo6.png\n: That's...what Master would want, too. So...to help everyone else... To solve the mystery of this school...\n12-AlterEgo7.png\n: The only way I can help is if you connect me to this school's network!\n4-Makoto.png\n: B-But...if you did that...that's basically suicide. I'm positive the mastermind would find out about it. They'd find you, and they'd... You agree, right Kyoko?\n13-Kyoko11.png\n: ...\n21-AlterEgo.png\n: I realize how dangerous it could be. But still...I have to do this.\n11-AlterEgo5.png\n: I'm scared, but...I can handle it. I...don't really understand why, but...\n12-AlterEgo7.png\n: When I think about everyone else, my courage starts to grow...! You might think I'm just some inhuman AI, but it's true! So...it's okay. If it's for the sake of everyone else, I won't be afraid!\nI couldn't help but get lost in that voice... It was just too committed... Too admirable... Too...fragile.\n8-Kyoko17.png\n: You remember what you asked before, Makoto? You asked what the difference is between a person and a program, right?\n4-Makoto.png\n: Y-Yeah...\n23-Kyoko2.png\n: When I talk to Alter Ego, I don't know... I have no idea how to answer that question. I think maybe that's a question even the program's creator can't answer. But I can say this...\n6-Kyoko.png\n: There's no question that Alter Ego is our\nfriend\n.\n4-Makoto.png\n: Kyoko...\n13-Kyoko11.png\n: To be honest, I didn't want Alter Ego to push himself anymore. Because if we take any more risks, the mastermind really will notice it... But...\n25-Kyoko13.png\n: Let's do it, Makoto. Let's connect Alter Ego to the network.\n4-Makoto.png\n: B-But...!\n8-Kyoko17.png\n: He's our friend, so I want to take his feelings into consideration. And he says that he wants to fight alongside his friends.\n25-Kyoko13.png\n: If you were in his place, could you just sit by and do nothing in this situation? If you saw everyone else fighting and doing their best, could you just look the other way? Or would you stand up? Stand up tall next to everyone else and tell them you're their friend?\n4-Makoto.png\n: ...\n21-AlterEgo.png\n: Hey, are you guys...fighting? If it's about me, please don't.\n11-AlterEgo5.png\n: I...I want to believe in myself. I want to be able to say, \"I know I can do this.\"\n12-AlterEgo7.png\n: So please...let me try!\n4-Makoto.png\n: ...\n13-Kyoko11.png\n: And besides...there's one place where the mastermind might not notice...\n4-Makoto.png\n: One place...?\n6-Kyoko.png\n: Remember? There's another place besides here where there's no surveillance camera.\nA room without a surveillance camera...\n> The secret room\n4-Makoto.png\n: That's it! The\nsecret room\nyou told me about...!\n28-FlashT.png\n30-FlashB.png\n4-Makoto.png\n: I definitely remember there was no surveillance camera in there.\n6-Kyoko.png\n: And I do believe you can connect to the network from there. I remember seeing an ethernet port on the wall.\n13-Kyoko11.png\n: However, just because there's no camera there, doesn't mean there's no danger. There's no way to be sure the mastermind isn't monitoring the network somehow. We'll also have to move Alter Ego, and the mastermind may spot us going into the secret room. If they pick up on any of this, then...it's all over.\n4-Makoto.png\n: You're right...\n25-Kyoko13.png\n: But despite all that, I still think we need to try. Because that's our best chance of finding any new clues.\n4-Makoto.png\n: ... Kyoko... In that case...will you let me carry him? There's no way you could hide him with what you're wearing, right? So let me do it.\n8-Kyoko17.png\n: Okay then, I'll leave it to you. ...Thank you.\n6-Kyoko.png\n: Then let's get started. It's gonna be a little cramped for you, Alter Ego. Bear with us, okay?\nWe started packing him up right away. I closed the laptop and stuffed it underneath my jacket.\n33-AlterEgo2.png\n: Ahaha! I-It tickles!\n4-Makoto.png\n: Shh! You can't talk right now! We're going to move you to another room. Until we get there, you have to be absolutely silent, okay?\n21-AlterEgo.png\n: Understood. Your command has been implemented.\n4-Makoto.png\n: G-Good...\nTo have him react like a machine like that all of a sudden... I didn't know how to react.\n25-Kyoko13.png\n: In the secret room, there are a bunch of different\ncables\nin one of the\ndesk drawers\n.\n4-Makoto.png\n: So there might be a network cable in there?\n13-Kyoko11.png\n: Assuming the mastermind hasn't taken it already...\n4-Makoto.png\n: Well, all we can do is go and check for ourselves.\n6-Kyoko.png\n: Agreed. Let's head to the secret room...\n36-Narration.png\n: One quick trip later...\n3-DespairSyndrome2.png\n25-Kyoko13.png\n: Hey, Makoto...\n38-Kyoko14.png\n: Are you sure all the documents are gone? I refuse to believe you! Go and check again!\n4-Makoto.png\n: What...?\n38-Kyoko14.png\n: Just hurry up and go! And to make sure you don't run off, I'm gonna wait right here!\nOh, I get it--she's acting... She was so forceful, I thought I'd made her mad again somehow...\n40-Kyoko16.png\n: Why are you just standing there? Hurry up and go!\n4-Makoto.png\n: O-Okay, okay, I'm going...\n8-Kyoko17.png\n: And be thorough. I'm counting on you.\nOkay! First we have to find a network cable...\nAccording to Kyoko, there should be a bunch of cables in this drawer. Hmm...\n4-Makoto.png\n: Found it! This is a\nnetwork cable\n, right? Now we just have to connect Alter Ego!\nI immediately got to work. I pulled out the laptop and connected it to the ethernet port with the cable.\n4-Makoto.png\n: And that should do it...!\n21-AlterEgo.png\n: Umm...\n18-DeathWishNoIntro.png\n33-AlterEgo2.png\n: Yeah! I think it worked!\n12-AlterEgo7.png\n: Just leave the rest to me! I swear I'll find something! I might even be able to connect to the outside world. If I can, I'll see if I can call for help!\n11-AlterEgo5.png\n: So please just wait a little while longer...\n12-AlterEgo7.png\n: Just hold tight and put your faith in me!\nAs I was about to leave, I decided to leave him with one last thing...\n> \"No matter what, we're gonna get out of here! You and all the rest of us, as friends!\"\n21-AlterEgo.png\n: Friends...? Even...me?\n33-AlterEgo2.png\n: Thank you. Thank you, Makoto...\n50-BeautifulDeath.png\n7-Kyoko7.png\n: How'd it go?\n4-Makoto.png\n: Well... It went...okay. But all the, um, documents were gone. Just like I told you...\nMy reply was an unintentional mix of acting and real feelings.\n8-Kyoko17.png\n: I see... Then there's nothing left for us here.\n51-Kyoko19.png\n: Goodbye. *begins to leave*\nBefore I knew it, Kyoko was walking away. She wasn't acting anymore, that much was for sure.\n4-Makoto.png\n: Ah--Kyoko!\n23-Kyoko2.png\n: Yes?\n4-Makoto.png\n: Um...so we're just gonna split up?\n23-Kyoko2.png\n: Of course. I have no reason to stay with you at this point.\n4-Makoto.png\n: Well...maybe, but...isn't that a little too...direct?\n25-Kyoko13.png\n: Should I hesitate and fumble for something to say? You're so high-maintenance...\n4-Makoto.png\n: Th-That's not what I meant... I just...had more I wanted to talk to you about. Like, what are you going to do about Sakura?\n8-Kyoko17.png\n: Well...something has to be done, it's true.\n7-Kyoko7.png\n: But the way things are right now, there's no way to persuade anyone. They don't have the mind to listen.\n4-Makoto.png\n: Then what should we...?\n56-Kyoko3.png\n: If we can find some new clue, that would likely change the situation. That's all we can hope for right now.\nWhich is why Alter Ego...\n8-Kyoko17.png\n: All we can do is wait, and believe in our friends.\nYou're right... That's our only option.\nWe parted ways, and I headed back to my room.\n4-Makoto.png\n: ... I'm kinda...tired...\nSo I laid down in bed. Maybe it was because of the stress of moving Alter Ego, but I was way more tired than I realized. So before long at all...\n...I had completely dozed off.\n...\n...\n*Ding dong*\n3-Makoto.png\n: Hunh...?\n*Ding dong*\nThe sharp sound of the doorbell pierced my sleepy haze and pulled me back to the real world.\n*Rattle*\n7-DISTRUST.png\n8-Kyoko7.png\n: Makoto, get out here.\n3-Makoto.png\n: Kyoko...? What's going on?\n8-Kyoko7.png\n: Hina just came to see me, and she was white as a ghost. It sounds like something's happened.\n3-Makoto.png\n: What...?\nAs soon as I heard those words, my heart started to beat a little faster. I suddenly found myself wide awake.\n8-Kyoko7.png\n: She said for us to come to the\nrec room\n.\n9-Makoto2.png\n: The rec room...? Okay! Let's hurry!\n13-Hina10.png\n: Makoto! Kyoko!\n9-Makoto2.png\n: Hina, what's wrong!?\n13-Hina10.png\n: S-Something's not right... In the rec room...!\n9-Makoto2.png\n: What's inside?\nThere was a window on the rec room door, and I hurried to look inside. And when I did...\n9-Makoto2.png\n:\nSakura\n...?\nIs she...unconscious? She's sitting up in the chair, like she's...bowing her head.\n8-Kyoko7.png\n: What's going on? Did something happen to her?\n13-Hina10.png\n: I was just walking past, and I happened to notice her through the window... But I couldn't get the door open... I tried knocking, I tried calling her name... But she wouldn't respond...\n17-Hina13.png\n: S-So what should we do? What are we gonna do!?\n8-Kyoko7.png\n: First of all, we need to get into the room.\n9-Makoto2.png\n: But the door's locked, right? And if we break in, we'll be violating school regulations...\n19-Kyoko14.png\n: We're going to force our way in.\n9-Makoto2.png\n: I just said--!\n20-Kyoko13.png\n: The door isn't locked. It's not locked because\nthe rec room door doesn't *have* a lock\n.\n9-Makoto2.png\n: Huh? Then why...?\n21-Kyoko11.png\n: It feels like the door is pressing against something inside the room. Is it...the chair?\n9-Makoto2.png\n: Chair...?\n20-Kyoko13.png\n: Either way, this door isn't locked. Which means, as far as I can tell, the rule doesn't apply.\n9-Makoto2.png\n: Then...there's no problem if we break in!?\n8-Kyoko7.png\n: Let's smash the window. That should be the fastest way...\n13-Hina10.png\n: Okay, I'll go get something to break it with! Wait right here!\nInside the rec room, Sakura still hadn't moved an inch... She's just unconscious...right?\n9-Makoto2.png\n: Is she...okay? I mean, it's Sakura, so I'm sure...\n8-Kyoko7.png\n: ...\nKyoko didn't reply. There was only silence... But that silence didn't last long.\n13-Hina10.png\n: Here!\n13-Hina10.png\n: *Huff huff* I found a broom! *Huff* In the classroom! *Huff huff* Use it!\n8-Kyoko7.png\n: You can handle this, right Makoto?\n13-Hina10.png\n: C'mon! Please, hurry!\n9-Makoto2.png\n: Okay! You two, stand back!\nI took hold of the broom and swung as hard as I could. Aiming directly at the window, all it took was one solid hit...\n*CRASH*\n♪\nMusic cuts out.\n♪\nThe window shattered into a hundred pieces, scattering across the rec room floor. I stuck my hand through the now open window and started jostling the chair.\n9-Makoto2.png\n: The chair's pretty heavy... But if I can just...!\nI pushed on it with all my strength, and finally the knob turned.\n9-Makoto2.png\n: Sakura!\nI ran up to her as fast as I could. But the moment I laid my hand on her...\n../Smilies/emot-siren.gif\nCLICK HERE FOR VIDEO\n../Smilies/emot-siren.gif\n26-ToSurvive.png\n...all I felt was cold\ndeath\n. I could feel only the last lingering warmth of a living body. Life had abandoned Sakura's body... And then...\n27-BodyDiscovery.png\n*Ding dong, bing bong*\n30-MonokumaTV.png\n: A body has been discovered! After a certain amount of time, which you may use however you like, the\nclass trial\nwill begin!\n2-Hina3.png\n: Huh...?\n2-Hina3.png\n: Sakura's...\n2-Hina3.png\n: Sakura's...dead? She's...really dead?\n4-ToSurvive.png\nI heard Hina talking, but my eyes stared steadily forward. I could only look forward. I could only look on...at\nSakura's dead body\n.\n6-Kyoko7.png\n: We didn't make it in time. It's happened again...\nMuttering to herself, Kyoko began to gently inspect Sakura's body. I wondered, was she confirming that Sakura really was dead? Checking for a pulse, or a reaction?\n2-Hina3.png\n: ... I have to go get them... I have to go get...the others... *leaves*\nOn shaky legs, Hina left the rec room. And I...\n8-Makoto2.png\n: Why...? Why...did this have to happen?\nThat's all I could say. I repeated it over and over again...\n9-Kyoko17.png\n: I need to examine Sakura's body...\nI just stood there motionless behind her, while she checked Sakura's corpse. Time passed. While I stood there, unable to do a thing, time just...passed. And after I don't know how long...\n12-BoysLifeofDespair.png\n2-Hina3.png\n: I got everyone...\n13-Hiro8.png\n: Uwah! O-Ogre!?\n14-Jill2.png\n: Oh. So she's dead, huh?\n15-Byakuya3.png\n: Sakura's been killed? I see...\nAs soon as they arrived, Kyoko began...\n17-Kyoko13.png\n: You heard the announcement just now, right? So you know what this means.\n18-Byakuya7.png\n:\nSakura was murdered\n. And by someone in this very room... Is that what you were going to say?\n2-Hina3.png\n: ...No. Whoever killed her...it's not just \"someone in this room.\"\n20-Hina18.png\n: It was one of you... Hiro, Byakuya, Toko--one of you killed Sakura!\n21-Hiro7.png\n: Wh-Wh--!?\n22-Byakuya5.png\n: You're accusing us before we've even begun the investigation?\n23-Hina17.png\n: I don't need to investigate anything... Because you hated her. You hated the sight of her! One of you did it, I know it!\n???: You...know it?\n25-MrMonokumaAfterClass.png\n26-Monokuma2.png\n: Jeez, I didn't know your power level would increase by that much just by getting mad!\n23-Hina17.png\n: What are you doing here...?\n27-Monokuma4.png\n: Isn't it obvious? I'm here to hand out my little murder flyer.\n28-Monokuma5.png\n: That's right! It's the next Monokuma File!\n27-Monokuma4.png\n: And don't get so mad, Miss Asahina, or you're gonna ruin that lewd little face of yours! Now then! With that, I--\n8-Makoto2.png\n: Hold on... There's something I want to ask you...\n30-Monokuma11.png\n: Huh?\n8-Makoto2.png\n: It was you, wasn't it? You killed Sakura?\n30-Monokuma11.png\n: Huh huh?\n8-Makoto2.png\n: Sakura wanted to challenge the mastermind to a duel. Maybe you and her fought again, and then...\n30-Monokuma11.png\n: Then I killed her?\n32-Monokuma9.png\n: Sorry, not quite! Actually, not even close.\n28-Monokuma5.png\n: That whole thing is totally irrelevant now! Sakura came to a most regrettable end without even getting the chance to finish things with me...\n33-Monokuma10.png\n: Which, thank God for that! It saved me the trouble of having to go through with our little fight.\n34-Monokuma8.png\n: Cuz even for someone like me, it would've been no mean feat to take down a behemoth like that!\n26-Monokuma2.png\n: I gotta tell ya, I was actually pretty worried! I mean, she'd violated a rule by attacking me in the first place, but I wasn't able to punish her!\n28-Monokuma5.png\n: So I dunno who it was, but whoever the blackened is this time...I owe ya one!\n23-Hina17.png\n: Y-You owe them one!?\n27-Monokuma4.png\n: Oopsie! Before you get all pissy-potty at me, you better figure out who did it first!\n36-Monokuma12.png\n: Cuz I mean...your lives are all on the line, right?\n27-Monokuma4.png\n: Puhuhu... Puhuhuhuhu! *leaves*\n12-BoysLifeofDespair.png\n23-Hina17.png\n: What the hell...? He owes them one?\n20-Hina18.png\n: I hate him! I hate this whole thing!\n15-Byakuya3.png\n: Well I, for one, am glad it was Sakura. She was working for the mastermind, after all.\n8-Makoto2.png\n: H-How can you say that now...!?\n18-Byakuya7.png\n: Sorry, I don't have time for your squabbling. The next game has already begun... If you want to be angry at someone, be angry at whoever killed Sakura.\n23-Hina17.png\n: ...\n40-Kyoko2.png\n: Right now, our top priority needs to be uncovering Sakura's killer. If we can't do that, we're all dead.\n41-Byakuya2.png\n: Then let's decide who will stand guard this time.\n42-Hina16.png\n: ...I'll do it.\n8-Makoto2.png\n: Hina...?\n42-Hina16.png\n: I'm okay... Just let me handle it...!\n23-Hina17.png\n: Besides, I...I want to be here...with Sakura.\n44-Byakuya.png\n: Okay, then Hina is guard number one. But we need one more.\n41-Byakuya2.png\n: Kyoko, that's you.\n6-Kyoko7.png\n: ...Me?\n45-Byakuya4.png\n: You're always a thorn in my side. This time just stand by and watch quietly. Consider that an order.\n8-Makoto2.png\n: An o-order!?\n40-Kyoko2.png\n: Fine. I'll stay behind.\n15-Byakuya3.png\n: Then it's settled. Let's begin, shall we?\n42-Hina16.png\n: ...Hold on! Before that, there's something I want to say.\n41-Byakuya2.png\n: Which is...?\n42-Hina16.png\n: Hiro, Byakuya, Toko--none of you are allowed to step foot in the crime scene.\n21-Hiro7.png\n: What...?\n20-Hina18.png\n: One of you killed Sakura!\n23-Hina17.png\n: I won't let someone like that come anywhere near her!\n22-Byakuya5.png\n: Don't be stupid. Our lives are in just as much danger as yours! We have every right to investigate.\n23-Hina17.png\n: I don't care what you say. I'm not letting the one who killed Sakura anywhere near her.\n20-Hina18.png\n: Even if it means I have to use force, you're not getting in here...!\n49-Byakuya15.png\n: Well, it appears further discussion would be a waste of time. How about a compromise?\n45-Byakuya4.png\n: I won't ask you to let all of us in. Just let me.\n13-Hiro8.png\n: What!?\n44-Byakuya.png\n: You don't really care, do you? You're both useless, anyway.\n51-Jill9.png\n: Nope, don't really caaaare!\n52-Jill6.png\n: I'd rather spend my time coming up with another splendid fantasy involving Master, anyway!\n18-Byakuya7.png\n: And you, Hiro? Do you really object?\n53-Hiro4.png\n: I-If you're gonna go that far, what can I do? I mean, I don't have anything to hide, so why should I care?\n15-Byakuya3.png\n: Then it's decided.\n20-Hina18.png\n: Nothing's decided!\n9-Kyoko17.png\n: I know how you feel, Hina, but you should agree to his request.\n23-Hina17.png\n: B-But--!\n9-Kyoko17.png\n: We have to find out who killed Sakura.\n17-Kyoko13.png\n: For those of us still alive, and to honor Sakura's memory...\n23-Hina17.png\n: ...Fine. I guess that's okay. But no matter what, Byakuya, you absolutely aren't allowed to touch her...!\n15-Byakuya3.png\n: Naturally. Who would want to touch a filthy dead body?\n17-Kyoko13.png\n: That's enough fighting. We need to focus on the investigation from here on out. Everyone, keep this in mind. If we can't uncover Sakura's killer...\n56-Kyoko14.png\n: ...all of us face execution.\nFinding out who killed Sakura... It's not a matter of hoping we can do it... If we want to survive, we *have* to do it. It's a kind of...hopeless hope. We have no choice but to just do it...!\n58-BOX15.png\nI'd better check the Monokuma File before anything else...\n\"The victim was Sakura Ogami. The time of death is estimated to be around 12 noon. The body was discovered in the rec room, on the 3rd floor of the school. There is evidence of a strong blow to the victim's head. No other injuries were noted. However, it seems that at some point, the victim suffered from violent vomiting of blood.\"\n62-Kyoko12.png\n: I think the case this time might be...a challenge.\n8-Makoto2.png\n: Why's that...?\n63-Kyoko11.png\n: The only way into the rec room is the door we just came through. And that door had been jammed shut with the chair from inside the rec room. Which means the killed would have had to escape somehow, *after* barring the door.\n8-Makoto2.png\n: So if the door was blocked from the inside, and there was no way in or out till we broke the window... There's like...zero escape, right?\n17-Kyoko13.png\n: In other words, this is a classic\nlocked room murder\n.\n8-Makoto2.png\n: L-Locked room murder...?\nI guess you might see this kind of thing a lot in mystery movies or books or whatever. But could it really happen in real life...? And right before our very eyes like this?\n40-Kyoko2.png\n: Are you curious to hear more about what a \"locked room\" murder entails?\n8-Makoto2.png\n: S-Sure, if you don't mind...\n63-Kyoko11.png\n: When you break down this type of murder mystery, there are\nfour basic types\n. The first type is when\nthe locked room is created after the actual crime is committed\n. This simply means that the killer commits his crime, then through some special method seals the room. This mainly involves some sort of trick involving the \"locking\" of the room. Basic approaches include using a string, or simple mechanism. There are a number of variations.\nSo for that, all we'd have to do is check the door to see if that's what it was, right?\n40-Kyoko2.png\n: The second type is when\nthe locked room already exists before the crime is committed\n.\n8-Makoto2.png\n: Oh...?\n63-Kyoko11.png\n: Basically, the killer uses a special contraption or tool from outside to target the victim inside. You push a switch and it fires a handgun, you shoot an arrow through a gap in the door, something like that.\n9-Kyoko17.png\n: But in this case, that doesn't seem to fit. There are no guns or arrows in the school, and the door doesn't have any gap that would allow it...\nYeah, I think we can probably cross that one off the list...\n68-Kyoko.png\n: The third type is when\nthe killer stays in the room until it's opened up\n.\n8-Makoto2.png\n: What do you mean by that...?\n9-Kyoko17.png\n: They stay hidden, and when the door is opened, they use the confusion to blend in with the group. They pretend they showed up along with everyone else, and that's that.\nThat sounds like it could have been possible...maybe...\n9-Kyoko17.png\n: And the fourth and final type is when\nit wasn't actually a locked room at all\n.\n8-Makoto2.png\n: Not a locked room...?\n63-Kyoko11.png\n: By that I mean, there actually is an alternate escape route somewhere within the room. You see this a lot in novels and things, but in reality it's generally not possible.\n8-Makoto2.png\n: Then you think we can cross that one off, too?\n9-Kyoko17.png\n: I believe so, yes. So, when it comes to locked room mysteries, those are the basics.\n8-Makoto2.png\n: So there are four possibilities... Then...Kyoko, which of those four choices seems the most likely in this case?\n40-Kyoko2.png\n: That's a good question. Answering that should be our primary focus during this trial. But right now...I can't really say.\n8-Makoto2.png\n: I see...\nThe way the killer set up the locked room... Until I figure that out, the truth behind Sakura's death will stay hidden. It's definitely a tough mystery... I need to concentrate and investigate as much as I can. For Sakura, if nothing else...\n2-BOX15.png\n3-Narration.png\n: We've got a lot of stuff to investigate this time. Let's start by going over Sakura's body.\nSakura drew her last breath sitting slumped forward in this chair... There's obvious evidence of the\nblow to the head\nSakura suffered... Normally, I wouldn't have any problem believing that that's what killed her. But according to the Monokuma File, she had also\nvomited blood\n...\nAnd I can see a\ntrace of blood\non her lips for sure. So...what would have caused her to vomit blood? The Monokuma File specifically said she hadn't suffered any other injuries...\n7-Makoto2.png\n: Maybe her getting hit on the head somehow caused her to start vomiting blood?\n8-Byakuya.png\n: Not a chance.\n7-Makoto2.png\n: B-Byakuya...\n9-Byakuya3.png\n: However, your eyes have landed on a most interesting location.\n7-Makoto2.png\n: Interesting...?\n10-Byakuya4.png\n: Yes, most interesting. Don't you agree?\n7-Makoto2.png\n: N-No, I don't think I'd call it \"interesting.\"\nBut it does make me wonder... The reason\nSakura vomited blood\nabsolutely has to be connected to why she died...\n3-Narration.png\n: Let's see what Kyoko thinks of this whole situation.\n13-Kyoko7.png\n: But for Sakura to have been killed...\n7-Makoto2.png\n: Yeah, she's not the type who would go down without a fight.\n14-Kyoko12.png\n: And she certainly didn't, I would say. She was the\nUltimate Martial Artist\n, strong in body, mind, and spirit. So how was the killer able to get the upper hand on her...? I wonder...*did* someone get the upper hand...?\n7-Makoto2.png\n: They must have taken her by surprise, right?\n15-Kyoko11.png\n: Certainly, they would've needed to if they expected to stand any chance against her.\nThis looks like...some kind of\nwrapper\n.\n18-Hina9.png\n: Ah, that's--!\n7-Makoto2.png\n: Do you recognize it, Hina?\n19-Hina2.png\n: Well yeah. I mean, I gave it to her... That's a candy wrapper. Sakura got super upset when she found out Genocide Jack had attacked me, right? So\nafter we left the nurse's office\n, I gave it to her. I thought it might help her calm down a little...\n7-Makoto2.png\n: So you gave that candy to Sakura...\n21-Hina14.png\n: I found a big box of it in the warehouse. I...really like 'em... Actually, as soon as we could get into the warehouse, I took the entire box back to my room. I made sure\nnobody else could get their hands on 'em.\n7-Makoto2.png\n: You really like them that much?\n22-Hina4.png\n: But I wanted Sakura to get a chance to try one for herself. That's why I gave it to her... But now...they've lost all their flavor.\n7-Makoto2.png\n: Hina...\nHuh? The locker's open. And there on the inside...\nIt's...a\nhandprint\n?\n14-Kyoko12.png\n: What's a handprint doing here?\n7-Makoto2.png\n: It looks like someone touched\nthe inside of the locker\n, and it left a handprint in all the dust...\n14-Kyoko12.png\n: And it looks quite fresh, too. I'd say someone was hiding here in the locker, and they left behind a little something extra...\n7-Makoto2.png\n: So then...! Maybe the killer\nhid in here\nuntil the locked room was opened, don't you think? And during all the confusion, they popped out and joined the rest of the group!\n28-Kyoko17.png\n: Unfortunately, that's not a possibility.\n7-Makoto2.png\n: Huh? Why not?\n29-Kyoko.png\n: Think back. Before we opened the door, we looked inside the room, right?\n30-FlashT.png\n32-FlashB.png\n7-Makoto2.png\n: Oh yeah... And the locker was\nalready open\nat that point...\n28-Kyoko17.png\n: So there's no way someone could have hidden in there until *after* we opened the door.\nYeah. So then...what does this handprint mean?\nThere are\nshards of glass\nscattered all around the chair Sakura was sitting on. The glass is all...red. And... These are...the top and bottom sections of a bottle, right? So this must have originally been a\nbottle\n...\nHuh? There's something else on the ground near the glass.\nIt's a figure... It fits in the palm of my hand. It's...a\nMonokuma figure\n.\nThere are\nfour red bottles\nlined up on the shelf.\nAnd inside each bottle, there's some kind of\nMonokuma figure\n...\n7-Makoto2.png\n: What I'm wondering is, how'd they get those figures inside the bottles...?\n15-Kyoko11.png\n: It's no different from your standard\nship in a bottle\n.\n7-Makoto2.png\n: ...Huh?\n15-Kyoko11.png\n: You know, where the bottle's opening is smaller than the boat placed inside? You've never seen that?\n7-Makoto2.png\n: Oh, yeah...maybe I have.\n14-Kyoko12.png\n: So this is the Monokuma version of that. A...\nMonokuma Bottle\n, if you will.\n7-Makoto2.png\n: I feel like I'm finally starting to make sense of things, little by little...\nThe Monokuma Bottles sitting on the shelf... The Monokuma figure we found on the ground... The red shards of glass, which probably started out as a bottle... Which would mean...Sakura must have been hit in the head with a Monokuma Bottle, right? The shards of glass and the Monokuma figure are evidence of that... So I think it's safe to say that the\nMonokuma Bottle\nwas the weapon.\nThere's a\nbloodstain\nin front of the magazine shelf... It must have come from Sakura, right? But that doesn't make sense... Why is it so far away from where she died?\nThere's some kind of plastic container rolling around near the entrance to the room.\n14-Kyoko12.png\n: It looks like...a\nprotein drink\n. And it's empty...\n7-Makoto2.png\n: Sakura must have drank it. Everyone knows how much she loved her protein... And she mentioned more than once how protein was good for all sorts of ailments.\n51-Kyoko13.png\n: I wouldn't take that to heart, if I were you...\n7-Makoto2.png\n: I know...\nBut still, this protein can... It's got a label on it that says\nCHEM A-2\n. That reminds me... Sakura mentioned how the chem lab had all kinds of health stuff. So she must have gotten this from the chem lab...\n13-Kyoko7.png\n: But that's strange...\n7-Makoto2.png\n: Huh? What is?\n14-Kyoko12.png\n: You see what's scattered around the can?\n7-Makoto2.png\n: Shards of light blue glass... They must be parts of the\nwindow\nI broke to get inside.\n15-Kyoko11.png\n: But they aren't just scattered *around* the can. They're also\nunderneath\nit.\n7-Makoto2.png\n: Why does that matter...?\n15-Kyoko11.png\n: I can't say for sure yet, but you're probably going to want to take a note of it. I feel like it'll become an important clue later on...\nAn important clue...? I'm not sure I see how...\n3-Narration.png\n: Let's see how Hina's holding up.\n56-Hina15.png\n: We already know who did it...! Byakuya, Toko, or Hiro--it had to be one of them!\n57-Hina16.png\n: They couldn't stand the sight of her! You agree with me, don't you Makoto!?\n7-Makoto2.png\n: U-Um, well...I don't want to say anything for sure without finding out more.\n59-DISTRUST.png\n57-Hina16.png\n: ...Then let me help you find out more. You see, Sakura asked all three of them to meet with her. You know where? Right here in the rec room.\n7-Makoto2.png\n: What!?\n57-Hina16.png\n: After I went to the nurse's office this morning, Sakura and I both left together, right? Well, eventually she went off on her own. But when I saw her again after that, she told me... She said she'd\nleft a note for each of them\n. She asked them to\nmeet her in the rec room by noon\n.\nBy noon... The Monokuma File said she'd died right around then...\n57-Hina16.png\n: I'm telling you the truth. I heard it right from Sakura herself. And...I tried to stop her.\n21-Hina14.png\n: But she wouldn't listen. She said not to worry, that she just wanted to talk to them. And this is what happened...\n22-Hina4.png\n: If I'd stopped her, by force even, this never would have happened...\n7-Makoto2.png\n: H-Hina...\nIt's impossible not to have regrets, I know...\n2-BOX15.png\nBut the fact that she had asked those three to meet with her. And she asked them to come to the rec room at noon--the same time and place she ended up dying... It might be good to\nconfirm\nwhat I just heard with the three of them directly.\n3-Narration.png\n: Well since Hina mentioned it, let's talk to Byakuya about Sakura's note.\n65-Byakuya7.png\n: What do you want? You're bothering me.\n7-Makoto2.png\n: Um, there's something I'd like to talk to you about.\n8-Byakuya.png\n: Make it quick.\n7-Makoto2.png\n: Is it true that Sakura asked you to meet her in the rec room?\n9-Byakuya3.png\n: So you found out. Interesting.\n7-Makoto2.png\n: Then it's true?\n8-Byakuya.png\n: I did receive a note to that effect, yes. But what fool would do what it said, and risk being killed by that monster?\n7-Makoto2.png\n: So you didn't go see her?\n8-Byakuya.png\n: Of course not. I ripped the note to shreds and threw it away. I\nhaven't seen Sakura today at all\n.\nByakuya says he didn't go see her. Is that the truth...? Well, until I can prove otherwise, I have no choice but to accept it as fact.\n67-Byakuya5.png\n: If you're all finished, please remove yourself from my sight.\n7-Makoto2.png\n: O-Okay. Thanks...\nThis door is the\nonly way\nin or out of the rec room... The door doesn't have a lock, and there's no evidence that the mountings have been tampered with. The only notable change to the door is...the smashed window. Which happened, of course, when I broke it to get inside... There's no evidence that any kind of string or mechanism was used on the door... In other words...\n7-Makoto2.png\n: ...I don't see anything suspicious about the door itself.\nThe chair was shoved up against the doorknob, so we couldn't gt the door open. There's no evidence that any kind of string or mechanism was used on the chair...\n7-Makoto2.png\n: In other words...there's no reason to think the chair had anything special done to it.\nHmm... Having examined both the door and the chair, there's no doubt the reason the door didn't open was simply because the chair was shoved up against it. This kept the doorknob from turning, and the door from opening. And there was no evidence of the door or chair being tampered with or anything like that... So the killer must have created the locked door\nfrom the inside\n, *not* from the outside.\n75-Kyoko2.png\n: Well, Makoto? Have you finished with your general investigation?\n7-Makoto2.png\n: Yeah, I think so...for the most part.\n51-Kyoko13.png\n: Then you should probably go talk with people now. I'm on guard duty, so I can't leave.\n77-Kyoko14.png\n: Which is why I've decided you'll go in my place.\nShe's decided...? She's gotten a lot more pushy since we had out...issue. But she's right. I do have to go talk to the others. Sakura wanted to meet with two other people. I need to hear what they have to say...\nThose other two probably went back to their rooms...\n3-Narration.png\n: Next time: Interrogation.\n2-BOX15.png\n3-Narration.png\n: Last time, we stopped in the dorm halls. We're supposed to go talk to Toko and Hiro about the note they supposedly received from Sakura.\nI pressed the doorbell...\n*Ding dong*\nAnd after a few seconds...\n6-Toko19.png\n: Huh? Wh-Who's there?\nAgh, the most negative aura I've ever felt... An aura of total decay...\n6-Toko19.png\n: Well? What do y-you want?\n7-Makoto2.png\n: So you're back to normal. Genocide Jack isn't around anymore...\n6-Toko19.png\n: D-Don't even say her name... It makes me s-sick to my stomach... I was in such a g-good mood, too...!\nShe didn't *look* like she was in a good mood...\n7-Makoto2.png\n: Hey, I was...hoping to talk to you about something. Is now a bad time?\n6-Toko19.png\n: ... Kh...!\nObviously annoyed, Toko slithered out into the hall.\n9-Toko4.png\n: Wh-What do you want? You said you wanted to\n[talk]\nto m-me about something...?\n> talk\n7-Makoto2.png\n: I wanted to talk to you about the fact that Sakura had asked to meet with you.\n10-Toko7.png\n: Wh--!?\n9-Toko4.png\n: I-I-I don't know what you're t-talking about!\n7-Makoto2.png\n: Byakuya already told me she had asked to meet with him.\n12-Toko5.png\n: What...? She w-wanted to meet with Master, too?\n10-Toko7.png\n: Ah! I just s-said \"\ntoo\n,\" didn't I...?\n13-Toko12.png\n: I guess now it's t-totally obvious, huh?\n7-Makoto2.png\n: Y-Yeah, pretty much... So, can you tell me about it?\n9-Toko4.png\n: I a-admit, I did\nget the note\n... B-But I didn't go\nsee her\n! I was s-scared, so...I couldn't bring m-myself to go!\nHmm... Toko claims she didn't go see her, but...can I really believe her? Well, until I can prove otherwise, I have no choice but to accept it as fact.\n9-Toko4.png\n: Is that g-good enough? Then I'm going back to m-my room... *leaves*\nWith that, Toko quickly retreated into her room.\n3-Narration.png\n: Well, that wasn't so bad. Let's see what Hiro has to say.\nI pressed the doorbell...\n*Ding dong*\nAnd after a few seconds...\n18-Hiro.png\n: What's up, Makoto? Did you\n[need something]\n?\n> need something\n7-Makoto2.png\n: Yeah, actually...I just wanted to check something. It's about how Sakura wanted to meet with you...\n19-Hiro8.png\n: H-H-How'd you know about that!?\n20-Hiro7.png\n: Uwah! Did you maybe...gaze into my soul? Have your special abilities awakened in you!?\n22-Hiro5.png\n: B-But! I'm not the only one she wanted to meet with!\nOgre told me herself\nthat she asked Byakuya and Toko to come, too!\n7-Makoto2.png\n: What? When did Sakura tell you that?\n20-Hiro7.png\n: Oh--! W-Well...!\n23-Hiro4.png\n: When she asked me to meet with her, of course!\n7-Makoto2.png\n: But...didn't she write you a note?\n22-Hiro5.png\n: Yeah, uh...a note...she uh...\n25-Hiro15.png\n: She gave it to me in person! And she happened to mention the others, like, in passing!\nI gotta be honest, this is super suspicious...\n7-Makoto2.png\n: So then you went and met with Sakura?\n26-Hiro16.png\n: N-No way, I totally didn't! Why would I ever do that!?\nYeah...definitely suspicious.\n22-Hiro5.png\n: The last time I saw Ogre was when Hina got hurt and I took her to the nurse's office!\n26-Hiro16.png\n:\nI haven't seen her\nsince then!\n7-Makoto2.png\n: While I'm here, could you show me the note she gave you?\n22-Hiro5.png\n: Oh, um...do I still have it...? Let's see...\nHiro was feeling around in his pockets...\n23-Hiro4.png\n: Ah, sorry! Looks like I don't have it anymore!\nWith a big, goofy smile on his face, he pulled his hands back out of his pockets. But when he did, I saw something flutter to the ground... Something had\nfallen out of Hiro's pocket\n.\n7-Makoto2.png\n: Huh...?\n20-Hiro7.png\n: Ah...\n29-Hiro9.png\n: Aahhh--!\nQuick as the wind, Hiro snatched it back up again and shoved it back into his pocket.\n23-Hiro4.png\n: Ehehe. Sorry, just a bit of trash I forgot to throw out...\n7-Makoto2.png\n: Trash...?\n31-Hiro6.png\n: A-Anyway! I can't deny that Ogre asked to meet with me, but I never went... So, well, if you'll excuse me...! *leaves*\nBefore waiting for a reply, Hiro quickly slipped back into his room. Hiro said that was just trash, but...there's no way that's all there was to it.\n3-Narration.png\n: Hiro could not have been more suspicious there unless he was covered in blood with a giant neon sign reading \"I DID IT\".\nOkay so I've heard from Toko and Hiro. Umm...what next? I'll definitely have to look at the actual\ncrime scene\nagain, but on top of that maybe I should find out more about the\nprotein can\nwe found on the floor of the rec room. I'm sure it must have come from the\nchem lab\n...\n7-Makoto2.png\n: So...where should I start?\n3-Narration.png\n: We're going to start with the Chem Lab.\n36-Byakuya7.png\n: Makoto...did you have your eye on the chem lab, too? Just make sure you don't get in my way.\n7-Makoto2.png\n: Yeah, I got it.\n36-Byakuya7.png\n: I think what you meant to say was, \"Yes, sir. I understand.\"\n7-Makoto2.png\n: ...\n3-Narration.png\n: I'm glad Makoto doesn't respond there. Byakuya's been getting more and more unbearable as the game goes on. Whatever the case, let's check the cabinets over here. There appears to be some stuff on the floor.\nThis isn't my first time seeing the shelf, but I just can't get over how big it is... I should probably take a closer look at it...\nIt looks like three shelves have been connected together to make one giant shelf... But more important right now... What's that\npowder\nthat's been spilled in front of the shelf? I have to be careful not to step in it...\n3-Narration.png\n: I'm not good at following narrative directions, so we're going to check out the three shelves first.\nLet's see... What's on this shelf? There are all kinda of dietary supplements and different medicines. The\nprotein drink\nwe found in the rec room probably came from this shelf... All the containers on this shelf are\nlabeled\nwith\nthe letter A\n, and a number. So I guess I can consider this part of the shelving unit\nsection A\n.\n7-Makoto2.png\n: ...Huh? But wait!\nThere's one bottle here that's labeled\nCHEM C-9\n...! Could someone have put it here on accident...?\nSo...on this shelf is... It looks like...a bunch of chemicals that I have no idea what they are...\n46-Byakuya9.png\n: They're\nreagents\n. Put simply, they're used in experiments to bring about a chemical reaction. How have you lived in such ignorance for so long? It must truly be bliss...\n7-Makoto2.png\n: I-Isn't that kinda harsh...?\n47-Byakuya.png\n: What, you think studying science and mathematics has no practical application in the real world?\n48-Byakuya3.png\n: The words of a lifelong loser. Which, I suppose, suits you well.\nI...didn't even say that... Anyway, that doesn't matter. Right now I need to focus on the shelf... All the containers on this shelf are\nlabeled\nwith\nthe letter B\n, and a number. So I guess I can consider this part of the shelving unit\nsection B\n.\nHmm...I don't see anything out of the ordinary here. In which case, I don't think I have to worry too much about this shelf.\nOn this shelf is... One look and I can tell it's nothing but dangerous chemicals. These look like\npoisons\nand other\npowerful chemicals\n. All the containers on this shelf are\nlabeled\nwith\nthe letter C\n, and a number. So I guess I can consider this part of the shelving unit\nsection C\n.\n7-Makoto2.png\n: I should try to find out more about this shelving unit.\nIt looks like it's split into three sections. Section A has dietary supplements, section B has reagents, and section C has...lethal chemicals. Sakura must have gotten the\nprotein powder\nfrom section A. But what concerns me is that in section A, there was a bottle with a label from\nsection C\n... What was a bottle of\npoison\nfrom section C doing in section A? There's definitely something going on there...\n3-Narration.png\n: Let's investigate the powder next.\nThere's a broken bottle in front of the shelf. Is this where all the powder came from...? It looks like the bottle had a label on it--\nCHEM C-4\n...\n46-Byakuya9.png\n: Would you like to hear something interesting? I was on the 4th floor this morning, checking things out, and at that point...this room wasn't like this.\n7-Makoto2.png\n: Then...this powder must have been spilled...\n46-Byakuya9.png\n: That's right. It could only have been around\nthe time of the incident\n.\nIf that really is when it happened, it must be related to the case somehow.\nThese are...\nfootprints\n? And they're only\nin front of the left shelf\n...\n46-Byakuya9.png\n: How do these footprints relate to the scene as a whole? We may need to sketch out the floor plan...\n7-Makoto2.png\n: By \"we\"...do you mean me?\n48-Byakuya3.png\n: How kind of you to offer.\nWith an insufferable smirk, he handed me a piece of paper and a pen.\n59-Byakuya5.png\n: Well? Let's go, chop chop!\n7-Makoto2.png\n: O-Okay...\nSo I got to work, and before long I'd drawn up a\nsketch\nof the room.\n7-Makoto2.png\n: Um, so...how's this?\n47-Byakuya.png\n: Not bad. For you, I mean.\nFor me...?\n46-Byakuya9.png\n: So, when you look at it like this... Interesting... It would appear that whoever left these footprints only had\nbusiness at the leftmost shelf\n. They came in, went straight to that shelf, did whatever they had to do, and then left. That's what the footprints tell me. These footprints must be...\n62-Byakuya8.png\n: Makoto, are they yours?\n7-Makoto2.png\n: No!\n59-Byakuya5.png\n: Okay. Then let me see your shoes and I'll confirm their size for myself.\nI couldn't think of a reason not to, so I quietly did what Byakuya said.\n46-Byakuya9.png\n: I see... Your feet do appear to be too big. Unfortunately, I must admit these are not your footprints.\n7-Makoto2.png\n: Unfortunately...?\n59-Byakuya5.png\n: But with how clear these prints are, it should be quite easy to determine who they *do* belong to.\nThen these prints are a really valuable clue.\n3-Narration.png\n: Lastly, we have to check the powder between the glass shards and the footprints.\n7-Makoto2.png\n: I should probably take a good, hard look at that powder...\nThere's a bunch of\nyellow powder\nscattered on the floor in front of the shelf.\nThere's also remnants of a broken bottle. It looks like the bottle was labeled\nCHEM C-4\n... Also, it looks like someone left some\nfootprints in the powder.\nBased on the positioning of the prints, whoever it was only went to the\nleft side of the shelf\n. According to Byakuya, the powder would had to have been spilled\nright around the time of the incident\n. That's all I can tell for now...\nI've already taken a good look at the chem lab. Maybe I should take another look around the\nrec room\n...\n3-Narration.png\n: Before we leave, let's quickly talk to Byakuya once more.\n46-Byakuya9.png\n: Makoto. I admit, you have a good eye for spotting useful clues.\n47-Byakuya.png\n: But you also need to learn how to make use of those clues.\n3-Narration.png\n: Let me take a moment here. One thing I've noticed is that Byakuya is sometimes really inconsistent in his character. Moments like this make you think he's having a breakthrough in his character development since he didn't insult anyone or be a general asshole like he was for the rest of the time he was here in the chem room with us. But he'll just as quickly go right back to being a jerk as soon as we walk out of here. This feels like one of those places where having a fully completed set of Free Time Events could have changed how he acts towards Makoto had the developers chosen to implement conditional dialogue. It's something that has always bugged me about his character. His character should either start warming up to the group or stay totally isolated from them but sometimes he walks the line between the two and it feels wrong to me.\n3-Narration.png\n: Regardless of how I feel about Byakuya, we'll pick up next time back at the rec room for one more pass through the crime scene.\n2-BOX15.png\n3-Narration.png\n: Back to the crime scene.\n5-Kyoko17.png\n: So Makoto, how's your investigation going?\nI told Kyoko what Toko and Hiro had told me...\n6-Kyoko11.png\n: I see... So along with Byakuya, they're both claiming they didn't go see her. But it's all too convenient. Someone must be\nlying\n.\nSomeone's...lying...\n7-Kyoko.png\n: Well, I've made some progress of my own.\nSakura's body\n, the\nshelf of magazines\n, and the\nMonokuma Bottles\n. These three things have revealed new clues. You'd do well to look them over one more time.\nKyoko said the magazine shelf was hiding a clue of some kind...\n10-Makoto2.png\n: Hmm...clue...clue...\n...Huh? This magazine is upside down. Did someone put it back that way on accident?\n7-Kyoko.png\n: If something catches your eye, it's important for you to explore that in detail, don't you think?\n10-Makoto2.png\n: Yeah, you're right...\nI picked up the inverted magazine and flipped through it.\n10-Makoto2.png\n: Th-This is...!\nOn one of the pages, near the center of the magazine, a word had been written in bold, bloody letters... And it said...\nToko\n. Could this be...\n10-Makoto2.png\n: ...a dying message!?\n13-Kyoko3.png\n: Then it would appear you've found it.\n10-Makoto2.png\n: Kyoko...is this...?\n6-Kyoko11.png\n: It is indeed a dying message. Someone\nused their finger to write it\n.\nA dying message...\n7-Kyoko.png\n: But just to be clear, I'm not the one who put it back upside down. It was already like that when I found it a little while ago. I made sure to put it back exactly as I found it, for the benefit of others who might come looking.\n16-Hina10.png\n: H-Hey... Is that...? That says...Toko, right?\n10-Makoto2.png\n: Y-Yeah, it looks like it.\n17-Hina16.png\n: Then...she's the killer! Right!?\n10-Makoto2.png\n: W-Well, it hasn't been confirmed yet...\n18-Hina18.png\n: It's settled! She's the killer for sure! That's conclusive evidence, right!? We can use it to corner the killer!\nI can see why you would think that, but... It just seems too easy. If anything, it makes me that much more suspicious...\nI think Kyoko said she'd found a new clue involving the Monokuma Bottles...\nSomething new...something new... Hmm...\n23-Kyoko2.png\n: So? Did you figure it out? There's a hidden\ncorrelation\nbetween all the bottles. Pay careful attention and you're sure to find it.\nA correlation... Umm...\n10-Makoto2.png\n: Hey, Kyoko...can't you just tell me what it is?\n13-Kyoko3.png\n: I don't mind guiding you toward clues, but giving you my conclusion isn't a good idea. Each person needs to come to their own conclusions, so that everyone can have confidence in the outcome.\n10-Makoto2.png\n: And it's not just because you don't trust me...right?\n7-Kyoko.png\n: ...\n10-Makoto2.png\n: No answer!?\n25-Kyoko5.png\n: I do trust you, to a degree. Otherwise, I wouldn't have told you anything to begin with.\nOnly to a degree...?\n28-Kyoko12.png\n: Actually, there's\none other thing\nabout the Monokuma Bottles that's bothering me... I'd like to do an\nexperiment\nto confirm it. You don't mind helping me, right?\n10-Makoto2.png\n: An experiment...?\n7-Kyoko.png\n: Can you gather up all the pieces of the broken Monokuma Bottle? Try to get the smaller pieces, too.\n10-Makoto2.png\n: Huh? Are you sure it's okay to mess with the crime scene like that...?\n23-Kyoko2.png\n: I've already done a thorough investigation, so it's fine. And that obnoxious Byakuya's not here, so...\n30-Kyoko19.png\n: Anyway, I need to get something from the chem lab. While I'm gone, try to gather up all the glass. *leaves*\nWith that, Kyoko left the room.\n10-Makoto2.png\n: I really don't know what this is about, but...what choice do I have? I'd better just do it.\nI took the broom and dustpan and got to work collecting all the broken bottle pieces.\n... ...\nAnd just as I finished up...\n32-Kyoko15.png\n: Sorry to keep you waiting. Is everything ready? Then let's get to work.\n10-Makoto2.png\n: So...what kind of experiment are we doing?\n33-Kyoko13.png\n: I got a scale from the chem lab. We're going to use it to compare weights.\n10-Makoto2.png\n: Compare the weights...of what?\n32-Kyoko15.png\n: The\npieces of glass\nyou collected, and one of the\nMonokuma Bottles\nthat's still intact.\n10-Makoto2.png\n: Why do you want to do what...?\n32-Kyoko15.png\n: That's the point of the experiment. It'll make sense when we're done.\n35-DISTRUST.png\n33-Kyoko13.png\n: First, let's compare the weight of two of the normal Monokuma Bottles.\n10-Makoto2.png\n: It's...balanced.\n6-Kyoko11.png\n: Which means,\neach Monokuma Bottle weighs about the same\n.\n10-Makoto2.png\n: Which makes sense... The Monokuma figures inside are basically the same, and nothing else could really affect the weight.\n6-Kyoko11.png\n: Now, here comes the important part... Put all the pieces you picked up on one side of the scale. Now, what might we expect to see?\n10-Makoto2.png\n: Well, a normal assumption would be either they'll balance out, or the pieces I collected will be lighter. I did my best to get them all, but there's a chance I could have missed some here and there.\n33-Kyoko13.png\n: Okay, then let's give it a try.\n10-Makoto2.png\n: Huh...? The\nbroken pieces\nare...heavier!? H-How is that possible...?\n6-Kyoko11.png\n: Just as I thought...\n10-Makoto2.png\n: What?\n6-Kyoko11.png\n: The\nresults of our experiment\n, and the\ncorrelation between each of the bottles\n--put it all together...\n32-Kyoko15.png\n: ...and I believe you will arrive at one very persuasive conclusion. So? What do you think? It's all on you.\n2-BOX15.png\nAccording to Kyoko, there's still something to be discovered from Sakura's body...\n23-Kyoko2.png\n: Just staring off into space isn't going to help you figure anything out.\n10-Makoto2.png\n: W-Well, yeah, I know. But...\n7-Kyoko.png\n: Don't you think you might need to actually examine the body?\n10-Makoto2.png\n: ...\n5-Kyoko17.png\n: There's no getting around it.\nUnlike me, Kyoko didn't recoil at the thoughts of touching a dead body. She was completely unemotional. It's the kind of thing I've grown perversely used to... Although, there are still some times...\n10-Makoto2.png\n: I can't believe how calm you are. No matter how many times I see a dead body, I can't get used to it...\n5-Kyoko17.png\n: That's totally normal.\n10-Makoto2.png\n: Then...how can you...?\n44-Kyoko7.png\n: I imagine it's because I've had plenty of opportunities to touch dead bodies in the past.\n10-Makoto2.png\n: What...?\n5-Kyoko17.png\n: Sorry, never mind.\n7-Kyoko.png\n: More importantly, look here...\n10-Makoto2.png\n: Her...\nshoes\n?\n7-Kyoko.png\n: You see that\nyellow powder\non her instep?\n10-Makoto2.png\n: Yeah, it really stands out...\n28-Kyoko12.png\n: That powder is clue number one.\n7-Kyoko.png\n: Next is the\nwound to her head\n. Look carefully...\n5-Kyoko17.png\n: Actually, even telling you that, it's incredibly difficult to spot. So let me just explain...\n6-Kyoko11.png\n: It would appear that she didn't suffer a single blow...but instead, received\ntwo blows to the head\n.\n10-Makoto2.png\n: Two blows...?\n5-Kyoko17.png\n: Interesting, wouldn't you say? And there's one more interesting thing...\n33-Kyoko13.png\n:\nBoth of her hands were spotless\n. There's absolutely no trace of blood on either one.\n5-Kyoko17.png\n: So, that's what I learned from examining her body in detail.\nI can't believe she was able to learn all that just by looking at her body... I don't think anyone but Kyoko could have pulled that off.\n50-Timeforthe4thTrial.png\n*Ding dong, bing bong*\n53-MonokumaTV.png\n: ......Oops! Ya caught me sleeping. Your investigation was just so boring, I couldn't stay awake! Should I do it? Is it okay? Can I? Can I can I can I? Okay, then let's begin the\nclass trial\n! You know where to meet, right? Please go through the\nred door\non the first floor of the school! Puhuhu. See you soon!\n55-DespairSyndrome1.png\nIt's already time...!? But the mystery of the locked room is still only half solved... At this point, whatever happens will have to happen at the class trial...!\n10-Makoto2.png\n: No...not whatever happens. I have to MAKE something happen!\n58-BoysLifeofDespair.png\nMonokuma made his announcement, and everyone began to meet up, one after another. And then...\n60-Monokuma4.png\n: The ultimate martial artist!\n../Smilies/emot-banjo.gif\nA locked room murder mystery!\n../Smilies/emot-dance.gif\n44-Kyoko7.png\n: What the...?\n61-Monokuma10.png\n: Oh, I've just recently discovered the power...of emoticons! Like, no matter how awful something is, if you toss in a smiley face, it turns positive!\n63-Monokuma.png\n: For example...\n60-Monokuma4.png\n: You're at a picnic and you find a dead body!\n64-syoon.001.gif\n65-Hiro5.png\n: This is just plain creepy...\n63-Monokuma.png\n: And how about the reverse?\n61-Monokuma10.png\n: No matter how great something is, if you put in a sad face, it makes it look super negative! For example...\n67-Monokuma8.png\n: Do you have a hundred friends?\n../Smilies/negativeman-55f.png\n68-Hiro7.png\n: He's right! That *does* make it seem sad!\n60-Monokuma4.png\n: Now then, please get on the elevator!\n69-captainpopbyob.gif\nI'll see you all down there!\n70-speculate.001.gif\n72-Toko5.png\n: Wh-What the hell was that...?\n73-Hiro14.png\n: I don't get it...\n17-Hina16.png\n: I don't get *you* guys! How can you act so casual after murdering someone!?\n65-Hiro5.png\n: I-I...don't think I'm acting casual.\n75-Hiro16.png\n: Er, I mean...! I didn't murder anyone!\n76-Toko12.png\n: Yeah, I'm c-completely innocent... How d-dare you call me a murderer!?\n17-Hina16.png\n: Whatever...\n77-Byakuya.png\n: Either way, the truth will be revealed soon enough. Because there can be no doubt, one of us is the culprit.\nThe killer... The one that murdered Sakura...\n♪\nMusic cuts out.\n♪\n78-FlashT.png\n80-FlashB.png\nShe was stronger than anyone I know... And yet, someone killed her.\n82-ToSurvive.png\nAnd that person is here...? That person...is one of us...?\n10-Makoto2.png\n: Come on, it's time to put an end to this...\nI made my way toward the elevator. But with each step I took, I felt like I was moving further and further away from my goal. I could feel a chilling fear running through me, trying to make me rot from the inside out... No matter how many times I go through this, it never gets any easier... We climbed into our steel prison in total silence.\nWe watched the doors close and felt it begin its sinister descent.\nThe elevator lowered, uttering its all too familiar clunking sounds. It fell lower, and lower... And as suddenly as always...the ride was over. The doors opened once again.\n63-Monokuma.png\n: Hmm... Just the six of you, huh? Really...\n67-Monokuma8.png\n: That's so few! You must be so lonely!\n10-Makoto2.png\n: You say that like it's not YOUR fault we're all that's left!\n60-Monokuma4.png\n: I wonder, will the class trial end with one less classmate again? Or...\n88-Monokuma5.png\n: ...will your school life come to an end completely?\n63-Monokuma.png\n: Now then, are we ready to begin? You know the drill! Find your assigned seats!\nAnd so, the curtain opened for the fourth time...\nA deadly judgment... A deadly deception... A deadly betrayal...\nA deadly riddle, a deadly defense, a deadly faith...\nA deadly...class trial...!\n91-UndergroundTrial.png\n3-Narration.png\n: Welcome to the 4th Class Trial. It's been a little while, and Sakura certainly didn't seem like the type that could be killed off. We've got one twisting trial ahead of us. The ticker on the bottom reads the following:\n\"Multiple suspects. Murder in a locked room. If anyone was likely to survive, it was Sakura. And yet...\"\n3-Narration.png\n: We gained a couple of new skills this Chapter so time for some explanations.\nLost in Thought:\nIncreases the time limit for each phase. Effective during the Class Trial. Costs 3 SP.\n-This skill came from Hiro. It gives you extra time whenever a timer pops up in the trial. I'm not positive of how much exactly since it seems to vary. I'm assuming it's percentage-based. This skill is pretty useful overall, especially on a first playthrough. It also helps that it's obtainable as soon as you start Hiro's FTEs. It's not essential by any means but it can help you out if you've been finding yourself having a hard time with the Nonstop Debates.\nBreathing Technique:\nThe Focus Gauge recovers more quickly. Effective juring the Nonstop Debate, the Hangman's Gambit, and the Bullet Time Battle. Costs 4 SP.\n-This skill came from Sakura. When you use the Focus Gauge, its stars will recover faster. It's actually a very useful skill if you find yourself using the Focus Gauge a lot. It also pairs pretty well with another skill we can't get at this point that heals you while Focusing.\n3-Narration.png\n: More importantly, we got 3 more Skill Points during this chapter. I'm going to use them to re-equip Cool and Composed. I don't really need the time extension from Lost in Thought, and while I'd potentially like to use Breathing Technique, I just don't have the open SP for it right now. Maybe in time for Trial 5. This means I've equipped\nAlgorithm, Upshift, Cool and Composed, Robot Jock, Melodious Voice and Handiwork\nfor this trial with 15/16 SP used.\n3-Narration.png\n: Next, our Truth Bullets. There were a lot of them this time.\n94-Tutorial.png\n: ...blow to the victim's head. No other injuries were noted; however, it seems that at some point, the victim suffered from violent vomiting of blood.\n94-Tutorial.png\n: ...would have vomited blood.\n94-Tutorial.png\n: ...so far away from where the victim was found.\n94-Tutorial.png\n: ...\"monopolized\" this candy as soon as it had become available, so obtaining a piece would have been difficult to impossible.\n94-Tutorial.png\n: ...bottles.\n94-Tutorial.png\n: ...around and underneath the container.\n94-Tutorial.png\n: ...they arrived.\n94-Tutorial.png\n: ...finger to do so.\n94-Tutorial.png\n: ...section A of the shelf.\n94-Tutorial.png\n: ...spilled after the incident took place.\n94-Tutorial.png\n: ...business in this area.\n3-Narration.png\n: And with that, join me again next time for Trial 4.\n",
    "court_record": {
        "evidence_objects": [
            {
                "name": "Monokuma File #4",
                "description": "The victim was Sakura Ogami. The time of death is estimated to be around 12 noon. The body was discovered in the rec room, on the 3rd floor of the school. There is evidence of a strong blow to the victim's head. No other injuries were noted; however, it seems that at some point, the victim suffered from violent vomiting of blood."
            },
            {
                "name": "Rec Room Door",
                "description": "A chair had been jammed against the door within the rec room, blocking access from the outside. It is believed that the killer did this to create a \"locked room\" scenario."
            },
            {
                "name": "Status of Sakura's Body",
                "description": "Sakura was found dead seated in a chair, slumping forward. Traces of blood were found around her mouth, presumably from when she vomited blood. However, there was no injury or indication as to why she would have vomited blood."
            },
            {
                "name": "Magazine Shelf Bloodstain",
                "description": "A bloodstain was found in front of the shelf of magazines. The blood is presumed to be Sakura's. There is currently no explanation for how a bloodstain would have appeared so far away from where the victim was found."
            },
            {
                "name": "Polka Dot Candy Wrapper",
                "description": "At one point Aoi had been injured and taken to the nurse's office. After she was taken care of, she gave a piece of candy to Sakura which had this type of wrapper. According to Aoi, she had \"monopolized\" this candy as soon as it had become available, so obtaining a piece would have been difficult to impossible."
            },
            {
                "name": "Glass Shards on the Floor",
                "description": "There were pieces of red glass scattered near the table in the rec room. After finding the top and bottom pieces, it was concluded that the shards must have come from a bottle."
            },
            {
                "name": "Figure on the Floor",
                "description": "A Monokuma figure was found laying on the rec room floor. It would fit roughly in the palm of your hand."
            },
            {
                "name": "Monokuma Bottles",
                "description": "There are a number of red bottles on a shelf in the rec room. Inside each bottle is a Monokuma figure."
            },
            {
                "name": "Empty Protein Drink",
                "description": "An empty protein drink was found near the rec room door. The container had a label reading CHEM A-2. The shards of glass from the window that was broken to get into the room were found both around and underneath the container."
            },
            {
                "name": "Locker Handprint",
                "description": "A fresh handprint was found inside the rec room's open locker. Since the locker was open before they opened the \"locked room,\" there's no way someone was hiding in there before they arrived."
            },
            {
                "name": "Aoi's Account",
                "description": "Sakura had written notes to Toko, Byakuya, and Yasuhiro asking them to meet her in the rec room by noon. She had slid these notes underneath each person's room door."
            },
            {
                "name": "Byakuya's Account",
                "description": "Byakuya confirmed that he received Sakura's note, but also claimed that he never went to see her, and in fact had not seen her at all that day."
            },
            {
                "name": "Toko's Account",
                "description": "Toko confirmed that she received Sakura's note, but also claimed that she never went to see her."
            },
            {
                "name": "Pocket Trash",
                "description": "A small bit of garbage accidentally fell out of Yasuhiro's pocket. It was a piece of paper with red polka dots on it."
            },
            {
                "name": "Yellow Powder",
                "description": "Yellow powder was found on the instep of Sakura's foot."
            },
            {
                "name": "Kyoko Examination Summary",
                "description": "Sakura suffered two blows to the head, not one. No blood was found on either of her hands."
            },
            {
                "name": "Monokuma Bottle Experiment",
                "description": "All of the Monokuma Bottles appear to be roughly the same weight. However, when the bottle shards were weighed against an intact bottle, the shards were found to be heavier."
            },
            {
                "name": "Magazine Dying Message",
                "description": "On the magazine shelf, one magazine had been put back upside down. Inside this magazine, Toko's name had been written in blood. It is assumed that whoever wrote it used their finger to do so."
            },
            {
                "name": "Chem Lab Shelf",
                "description": "On the shelf in the chem lab, section A contains supplements, section B contains reagents, and section C contains harmful chemicals. A bottle of poison labeled as section C had been placed in section A of the shelf."
            },
            {
                "name": "Source of the Powder",
                "description": "There was a broken bottle in front of the chem lab shelf, which was labeled CHEM C-4. The powder on the floor is assumed to have come from this. According to Byakuya, the powder would had to have been spilled after the incident took place."
            },
            {
                "name": "Footprints in the Powder",
                "description": "Someone had left footprints in the powder spilled in the chem lab. These footprints appeared only near the leftmost section of the shelf. From this it can be assumed that the suspect only had business in this area."
            }
        ]
    },
    "events": [
        {
            "category": "cross_examination",
            "newContext": "3-ClassTrialDawn.png\n4-Monokuma.png\n: Let's begin with a basic explanation of the class trial! So, your votes will determine the results. If you can figure out \"whodunnit\" then only they will receive punishment. But if you pick the wrong one... Then I'll punish everyone *besides* the blackened, and the one that deceived everyone else will graduate!\n5-Monokuma11.png\n: Now then...where to begin...?\n♪\n**\nMusic cuts out.\n♪\n7-Hina16.png\n: We already know who did it...!\n8-Monokuma4.png\n: Whoa! Deja vu!\n7-Hina16.png\n: The one who killed Sakura...\n10-ToSurvive.png\n11-Hina15.png\n: ...is one of the people that hated her! Byakuya, Toko or Hiro! It was one of you!\n12-Byakuya3.png\n: Hmph. Idiot.\n13-Toko5.png\n: I-I had nothing to d-do with it...\n14-Hiro5.png\n: Y-Yeah! I'd never kill someone, no way!\n7-Hina16.png\n: I don't wanna hear your stupid excuses!\nHina seems really sure that one of those three is the killer... But she must have some reason for believing that...\n",
            "testimonies": [
                {
                    "testimony": "It was one of you...",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "One of you killed Sakura!",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "And what reason do you have for saying so?",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "Because you all had a motive!",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "You ***hated her*** !",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "Is that it? That doesn't make any sense...",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "That's ***the only reason you have*** for accusing us?",
                    "person": "Hiro",
                    "present": [
                        "Aoi's Account"
                    ]
                },
                {
                    "testimony": "That's l-low... That's about as low a-as you can g-get!",
                    "person": "Toko",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "26-Makoto25.png\n: Another reason you suspect them is because\n**\nSakura wanted to meet with them\n, right?\n7-Hina16.png\n: Yeah! And that was\n**\nright before she died\n!\n11-Hina15.png\n: So there's no doubt about it! One of those three killed her!\nI can't disagree with Hina. There's good reason to suspect all three of them... Then does that mean...one of them did it?\n",
            "testimonies": [
                {
                    "testimony": "The fact that Sakura wanted to meet with all three of them... There's no way that's not suspicious!",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "One of you is absolutely guilty!",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "I don't deny that she wanted to meet with us, but... I ***never went*** to see her.",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": ": ***I-I didn't either*** ...",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "Yeah, same here! ***I never saw her*** ...!",
                    "person": "Hiro",
                    "present": [
                        "Pocket Trash"
                    ]
                },
                {
                    "testimony": "Come on! There's no way *none* of you went!",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "At least one of you is lying!",
                    "person": "Hina",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "35-ClassTrialTHESUN.png\n36-Makoto2.png\n: Hiro...when we were talking before, you dropped a\n**\nsmall piece of paper\n, remember? It was\n**\nwhite with red polka dots\n...\n37-Hiro8.png\n: Wh-What's that got to do with anything!?\n38-Hina11.png\n: Red polka dots...?\n7-Hina16.png\n: That's gotta be the\n**\nwrapper from the candy\nI gave Sakura!\n14-Hiro5.png\n: N-No, it's...it's, um...\n7-Hina16.png\n: Ever since we got into the warehouse, I totally monopolized that entire box of candy.\n11-Hina15.png\n: So there's no way a single one of them was left in the warehouse!\n40-Makoto28.png\n: In that case, Hiro...where *did* you get that piece of candy?\n11-Hina15.png\n: From Sakura! It's the only explanation!\n14-Hiro5.png\n: U-Umm... W-Well, I mean...yeah, sure I got it from her, but...\n42-Hiro16.png\n: But she gave it to me forever ago! It doesn't have anything to do with what happened to her!\n7-Hina16.png\n: When? When did she give it to you?\n36-Makoto2.png\n: The last time you saw Sakura was...when Hina had to go to the nurse's office, right?\n14-Hiro5.png\n: Y-Yeah, so I musta got it...some time before then.\nBut...what Hiro said can't be right. Because Sakura could only have gotten the candy *after* the incident in the nurse's office. And the reason I know that is...\n> When Sakura got that candy\n40-Makoto28.png\n: I'm not sure about that, Hiro... Hina didn't actually give Sakura the candy till\n**\nafter she left the nurse's office\n.\n45-Makoto29.png\n: So if that was the last time you saw her, there's no reason you should've had that candy!\n37-Hiro8.png\n: Dammit!\n♪\n**\nMusic fades out.\n♪\n46-Hiro6.png\n: Er, I mean...what I meant was, uh... ...\n48-BoysLifeofDespair.png\n42-Hiro16.png\n: Oh, that's right! I DID meet up with her in the rec room! You got a problem with that!?\n49-Toko7.png\n: Why the s-sudden hostility...?\n50-Hiro11.png\n: But we just talked, that's all! I didn't do anything! You gotta believe me!\n52-Toko12.png\n: Y-You're acting incredibly s-suspicious...\n42-Hiro16.png\n: YOU'RE acting incredibly suspicious!\n52-Toko12.png\n: More h-hostility...\n54-Hiro15.png\n: It's not just normal hostility! You're the real culprit! I even have proof!\n13-Toko5.png\n: Huh? P-Proof! What are you t-talking about?\n54-Hiro15.png\n: I'm talking about her\n**\nshining message\n!\nWhat would a shining message even be...?\n56-Hiro12.png\n: At the scene of the crime, she had written out \"\n**\nToko\n\" in\n**\nher own blood\n, right?\n57-Hiro2.png\n: It was her \"\n**\ndying message\n\"! Just like what you guys were talking about with Sayaka!\n58-Hina21.png\n: That's true! I saw it for myself!\n57-Hiro2.png\n: See? See!? Toko did it!\n13-Toko5.png\n: Wh-Wh-What are you saying!? No w-way! I didn't d-do it!\n42-Hiro16.png\n: You just don't know when you're beat, do ya!?\n60-Kyoko17.png\n: Hiro, hold on...\n61-Kyoko13.png\n: When did you see that dying message of hers?\n62-Hiro7.png\n: Huh...?\n14-Hiro5.png\n: W-Well, when we found Ogre's body. Duh...\n60-Kyoko17.png\n: But if you recall, Hina was very adamant about keeping you away from the scene of the crime. So it's hard to believe that's when you actually saw the message for yourself.\nHuh? Hold on... But when Kyoko found the magazine with the dying message in it, it was...\n> On the magazine shelf\n26-Makoto25.png\n: Kyoko, you found the magazine on the\n**\nmagazine shelf\n, right?\n66-Kyoko12.png\n: That's right. Looking through the shelf, I found the magazine with the dying message on it. I found it right there at the scene of the crime,\n**\nafter we'd started the investigation\n.\n26-Makoto25.png\n: If that's true, then what Hiro just said doesn't really make sense, does it?\n14-Hiro5.png\n: D-Doesn't make sense...?\n42-Hiro16.png\n: What doesn't make sense!? Everything I said makes perfect sense!\nNo, there's an obvious problem with what Hiro said before...!\n",
            "testimonies": [
                {
                    "testimony": "I can tell you exactly when I found the dying message: When ***Ogre's body was discovered*** !",
                    "person": "Hiro",
                    "present": [
                        "magazine shelf"
                    ]
                },
                {
                    "testimony": "And I can tell you when *I* found the dying message...",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "It was only after ***the investigation had begun*** . I found the magazine tucked away on the ***magazine shelf*** ...",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "When I pulled it out, I saw her final words...",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "What's your problem?",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "What I said makes total sense!",
                    "person": "Hiro",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "2-BTB.png\n4-Narration.png\n: So there are no new mechanics for this BTB. I don't really have anything to add other than I'm somehow getting better at doing these without proper audio sync.\n4-Narration.png\n: The key to finishing these fast is really just to lock on to multiple phrases before firing because you do extra damage by shooting more than one at a time.\n4-Narration.png\n: Hiro uses Negative Time here but like before you just need to counter with your own Focus Gauge. Not too bad overall.\n> Fire \"Kyoko's Examination Summary\"\n12-ClassTrialTHESUN.png\n13-Makoto28.png\n: I'm completely unconvinced that\n**\nSakura wrote that dying message\n. Because if you look at it, the message was almost certainly written using a\n**\nfinger\n, but...\n14-Makoto29.png\n: ...both of her hands were\n**\ncompletely free of blood\n.\n15-Hiro9.png\n: Say wh--!?\n16-Hina16.png\n: Then...who did write it...?\n17-Kyoko12.png\n: Hiro could very well have written it himself.\n18-Kyoko15.png\n: That would explain how he knew about the message in the first place.\n19-Hiro6.png\n: N-Ngh...grr...!\n21-ClassTrialDawn.png\n22-Hiro13.png\n: Yeah... Yeah, that's exactly what happened.\n23-Hina12.png\n: Ah! He admits it!\n24-Kyoko2.png\n: I figured as much.\n25-Makoto20.png\n: But...why would you write something like that?\n22-Hiro13.png\n: B-Because...\n27-DespairSyndrome2.png\n19-Hiro6.png\n: Because\n**\nI killed her\n!\nYou're...admitting to killing her?\n22-Hiro13.png\n: Please, just let me explain what happened... I got Ogre's note, and so I headed to the rec room right before noon, just like it said...\n28-Byakuya15.png\n: You just did exactly as the note asked? What a fool...\n22-Hiro13.png\n: And when I got there...\n29-Flashback.png\n31-Sakura4.png\n: Sorry, but do you mind waiting? I asked a couple of other people to meet, as well.\n32-Hiro5.png\n: O-Okay...\n33-Sakura3.png\n: Would you like a piece of candy? It might help give you some energy.\n32-Hiro5.png\n: O-Oh, sure... Thanks.\n22-Hiro13.png\n:\nAnd that's all she said. After that, we just stood around in awkward silence... Suddenly, I heard her mutter something...\n31-Sakura4.png\n: This is it... I'm going to end it today... I'm going to end...everything.\n22-Hiro13.png\n:\nAs soon as I heard that, I just knew... I knew she was gonna try and kill me! She was gonna kill me and make her escape! So of course I freaked out, and then...\n*SMASH!*\n22-Hiro13.png\n: I saw my only chance. I grabbed a Monokuma Bottle from the shelf, and smashed it across her head! I...I hit her from behind,\n**\nbefore she had any idea\nwhat was happening!\n29-Flashback.png\n22-Hiro13.png\n: Then she just...went limp. I didn't see her move again after that. Once it was over, I pulled myself together. I realized if I didn't do something, I'd be caught and executed. So I wrote\n**\nToko's name\nin blood across a magazine on the table, and...I ran away.\n37-Toko13.png\n: I-I can't believe you! You're the worst! I hope you d-die!\n22-Hiro13.png\n: Well, that's what happened. Go ahead, roast me, boil me, do whatever you want...\n39-BoysLifeofDespair.png\n16-Hina16.png\n: You're not gonna get off that easy. It's death...death for the one that killed Sakura!\n40-Hina15.png\n: We're ready to vote now, right!? We know who did it!\n42-Kyoko11.png\n: No, I think there's more to Hiro's story...\n43-Hina9.png\n: What are you talking about? What else could there be!?\n42-Kyoko11.png\n: There's one thing that Hiro's story just now doesn't explain. And until we figure that part out, we can't consider the case closed.\nSo what is it that Hiro did that doesn't make sense...?\n> Why the magazine was hidden\n46-Makoto25.png\n: That's true. Everything you just said...it doesn't explain why\n**\nthe magazine was hidden\n, does it?\n47-Hiro7.png\n: Huh...?\n48-Makoto2.png\n: By the time the body was discovered, the magazine had been picked up and put on the shelf... Why would you take the time to write that message, then stick it somewhere we might not find it?\n32-Hiro5.png\n: Oh. Well, uh... I didn't hide it. I'm sure I just left it sitting there on the table.\n50-Makoto33.png\n: ...Really?\n37-Toko13.png\n: H-He's lying! He's g-gotta be lying!\n52-Kyoko17.png\n: I don't see any reason he would lie now, after already confessing to the crime...\n16-Hina16.png\n: Then...he's *not* lying?\n53-Byakuya.png\n: Assuming he's telling the truth, someone else must have put the magazine back on the shelf.\n55-Byakuya2.png\n: In other words, at least one other person was in the rec room both before and after the incident.\n56-Kyoko.png\n: I don't think there's any question about that.\n57-Hina22.png\n: Th-Then...who was it?\n52-Kyoko17.png\n: If they went to the trouble of hiding the magazine, they\n**\nmust not have liked\nwhat was written on it.\nSomeone who wouldn't like what had been written. There's only one choice...\n> Toko\n48-Makoto2.png\n: It had to be\n**\nToko\n, right?\n60-ClassTrialChaos.png\n61-Toko5.png\n: Wh--?\n25-Makoto20.png\n: Who else would want to hide the magazine other than the person whose name was written on it?\n16-Hina16.png\n: Is he right, Toko? Did you really go to the rec room...?\n61-Toko5.png\n: Wh-Why would I have...? Wait, b-but more important...!\n63-Toko12.png\n: That doesn't even m-matter! We already know who d-did it, right!? Hiro just a-admitted it!\n22-Hiro13.png\n: That's right. I killed her.\n25-Makoto20.png\n: No, you didn't.\n63-Toko12.png\n: Wh-Who asked you!?\n46-Makoto25.png\n: I don't doubt Hiro attacked Sakura with the bottle. But that's not where this case ends.\n43-Hina9.png\n: What do you mean...?\n52-Kyoko17.png\n: What he means is that Hiro isn't the killer.\n37-Toko13.png\n: You can't be s-serious! That's just... I don't b-believe it!\n66-Kyoko13.png\n: Hiro, tell us what happened one more time. If we go through it once more, it should become clear he's not Sakura's killer.\n32-Hiro5.png\n: Um, so...what do you want me to do?\n56-Kyoko.png\n: Just tell us what happened one more time, when you\n**\nattacked Sakura\n.\n67-Hiro4.png\n: I don't really see why, but...okay!\nWe haven't reached the end of the case just yet. Hiro isn't the real killer... And I have to prove that!\n",
            "testimonies": [
                {
                    "testimony": "I didn't want to, but...I did it. I grabbed a Monokuma Bottle from the shelf nearby and ***I hit Ogre from behind*** before she could do anything!",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "You hit her from behind... And you only hit her once, is that right?",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "Yeah, ***just once*** ... After the first swing, the bottle shattered.",
                    "person": "Hiro",
                    "present": [
                        "Kyoko's Examination Summary"
                    ]
                },
                {
                    "testimony": "And...she went limp.",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "S-See? Isn't it obvious?",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "Hiro really is the k-killer!",
                    "person": "Toko",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "I was just sleeping peacefully...",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "And all of a sudden, Sakura was right there in front of me! I remember waking up right in front of the magazine shelf!",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "And you were taken by surprise when you saw ***Ogre covered in blood*** ...",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "So you smashed her head in with the Monokuma Bottle?",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "You got it! I smashed her good!",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "And where did the attack take place?",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "Right where I woke up! I killed her there ***in front of the shelf*** !",
                    "person": "Jill",
                    "present": [
                        "Status of Sakura's Body"
                    ]
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "16-ClassTrialTHESUN.png\n17-Makoto29.png\n: We found Sakura sitting upright in a chair... If the blow\n**\nby the shelf\nwas the cause of death, there's no explanation why she was in that chair...\n18-Byakuya3.png\n: So, you finally noticed.\n19-Hina15.png\n: That's just another lie from a bloodthirsty serial killer!\n7-Hiro15.png\n: Are you sure you didn't attack her while she was sitting in the chair?\n20-Byakuya9.png\n: No, I'm sure she's telling the truth. Anyone who saw the murder scene should think the same way.\nThat has to be it... The evidence that proves there was an attack in front of the magazine shelf...\n> Present Magazine Shelf Bloodstain\n23-Makoto25.png\n: Sakura was definitely attacked in front of the shelf. The\n**\nbloodstain\nby the magazines is proof of that.\n24-Hiro4.png\n: Then she must have moved the body after she killed her, right?\n7-Hiro15.png\n: All to make it look like I did it! Cuz when I hit her, she *was* sitting in the chair!\n26-Jill7.png\n: Hey, come on now. Look at me. I can't carry anything heavier than my own scissors!\n27-Jill8.png\n: There's no way I could move a muscle-bound heavyweight like that!\n28-Hiro5.png\n: Then...then what's the deal?\n18-Byakuya3.png\n: Well? Are you still convinced the case has come to an end?\n30-Hina16.png\n: B-But...!\n31-Kyoko11.png\n: Plus, the biggest mystery of all--the locked room--still has yet to be explained. Until we take care of that, we can't say this case has been properly settled.\n30-Hina16.png\n: Oh, that part's easy! After she killed Sakura, Toko just hid in the locker again!\n33-Hiro2.png\n: Huh! So she just hid in there till everyone showed up and opened the door? And while everything was all confused and hectic, she just snuck out of the locker into the group!\n34-Makoto2.png\n: No, I don't think that's possible.\nThe reason there's no way Toko was hiding in the locker is because...\n> I saw it for myself\n36-FlashT.png\n38-FlashB.png\n34-Makoto2.png\n: Even before we opened the door to the rec room, Hina and I both got a look inside. And at that point,\n**\nthe locker was already open\n. So obviously Toko couldn't have been hiding in there.\n24-Hiro4.png\n: Hrmm... Okay then, where *was* she hiding?\n4-Jill9.png\n: I dunno! What's this whole \"locked room\" thing about, anyway?\n40-Hiro16.png\n: How do you not know!? You killed her!\n41-Jill12.png\n: I think the fact that I don't know proves I DIDN'T kill her, thank you very much!\n19-Hina15.png\n: Y-You're lying!\n18-Byakuya3.png\n: No, she's not. I've been saying all along, there's still more to this case.\n28-Hiro5.png\n: But if Genocide Jill didn't do it, that means Ogre didn't die from the shot to the head...\n43-Byakuya7.png\n: And?\n44-Hina2.png\n: W-Well, I can't imagine what else could have killed her...\n18-Byakuya3.png\n: That's because you're overlooking vital information.\nCould we really be missing something so important...? If there's another possible explanation, maybe it's...\n",
            "testimonies": [
                {
                    "testimony": "What was it that killed Ogre? If it wasn't from ***Genocide Jill's attack*** ...",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "...then what was it?",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "There's no other possible cause. What killed Sakura...",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "I can't think of anything other than ***the shot to her head*** !",
                    "person": "Hina",
                    "present": [
                        "Monokuma File #4"
                    ]
                },
                {
                    "testimony": "So you're dead set on blaming me, huh!?",
                    "person": "Jill",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "First I went to section C... That's when ***I grabbed the poison*** .",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "And you spilled some of the powder on the ground in front of the shelf.",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "Yeah. When I grabbed the bottle, I dropped it...",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "Okay, and then...?",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "I moved ***from section C to section A*** ... And that's where I switched the powders. Once I was done switching them I put the bottle filled with the protein ***powder back in section A*** . Then I took the bottle with the poison in it and left the chem lab. That's all there is to it.",
                    "person": "Hina",
                    "present": [
                        "Footprints in the Powder"
                    ]
                },
                {
                    "testimony": "Honestly, that's enough. How much longer must we tolerate this?",
                    "person": "Byakuya",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "12-ClassTrialTHESUN.png\n13-Makoto31.png\n: You said you went to get the poison from section C, and that's where you spilled the powder, right?\n14-Hina9.png\n: Yeah...what about it?\n13-Makoto31.png\n: And after that, you said you moved from section C to section A to get the protein...\n15-FlashT.png\n17-FlashB.png\n13-Makoto31.png\n: But the\n**\nfootprints left at the scene\nwere *not* moving from section C to section A. That contradicts what you just said.\n19-Hina12.png\n: Wh--!?\n20-Hiro5.png\n: Then...maybe she moved in some weird direction on purpose to disguise her movements...?\n21-Makoto30.png\n: No, that can't be it. Remember what Hina just said?\n15-FlashT.png\n17-FlashB.png\n23-Hina15.png\n: I was just...nervous! So I didn't notice I'd left a footprint!\n25-Hina13.png\n: Ah--!\n26-Byakuya6.png\n: What the--? Hina, what's the meaning of this!?\n19-Hina12.png\n: U-Um, well...\n28-Kyoko13.png\n: You lied to us, plain and simple. If you look at the footprints, your movements in the chem lab are obvious. The powder had already been spilled when you came in, and you went straight to section A. So you never went to section C. Whatever you did there, it only involved section A.\n19-Hina12.png\n: W-Well, you see... ...\n29-Byakuya12.png\n: Wh-What the...?\n31-Byakuya11.png\n: What the hell? What's going on here!?\n32-Kyoko15.png\n: And the footprints aren't the only problem with her account.\n31-Byakuya11.png\n: What...?\n34-Kyoko14.png\n: Before I explain that part, I'd like to submit some\n**\nnew evidence\n.\n26-Byakuya6.png\n: New evidence!? Impossible! There can't be!\n32-Kyoko15.png\n: ...Are you sure? After all, you're the one that gave it to me.\n31-Byakuya11.png\n: I...did?\n36-Kyoko.png\n: It was hidden inside the bottle of poison you gave me.\n32-Kyoko15.png\n: I'm amazed you of all people would miss such a vital clue. A truly grave oversight...\n26-Byakuya6.png\n: ... Just say it, already! What is it you think you found!?\n28-Kyoko13.png\n: I found this.\nHuh? A piece of glass...?\n5-Kyoko11.png\n: It had sunk to the bottom of the bottle. And the hidden clue was exposed thanks to you ingesting the powder.\n32-Kyoko15.png\n: I couldn't have solved the mystery without you. So, thank you for that.\n31-Byakuya11.png\n: B-But...what is it?\n39-Kyoko17.png\n: Oh, you still don't realize? Well then...\n28-Kyoko13.png\n: Makoto, why don't you explain it?\n40-Makoto33.png\n: Huh? Me!?\n31-Byakuya11.png\n: ...\n26-Byakuya6.png\n: F-Fine! If you really do know, explain the meaning of that shard of glass!\nThe shard of light blue glass Kyoko found in the bottle of poison...\n> The rec room window\n21-Makoto30.png\n: It's...\n**\npart of the window\nfrom the rec room door, right?\n31-Byakuya11.png\n: The window...?\n15-FlashT.png\n17-FlashB.png\n21-Makoto30.png\n: The window we broke to get in was light blue, just like that. So I think that must be it.\n28-Kyoko13.png\n: You're right, it must be. Of course, that leads to another question... How did a shard of glass from the window get inside this bottle of poison?\n45-Jill2.png\n: What's so strange about that!?\n21-Makoto30.png\n: What's strange is that...according to\n**\nwhat Hina told us\n...\nWhere was it the bottle of poison should have been when I broke the rec room window? According to what Hina told us...\n> Section A of the shelf\n13-Makoto31.png\n: The bottle of poison was left\n**\non the shelf in the chem lab\n. That is what you said, right Hina?\n48-Hina3.png\n: Uh...umm...\n13-Makoto31.png\n: And yet, somehow a piece of glass from the rec room window made its way into the bottle...\n50-Hiro8.png\n: Then everything Hina told us was\n**\na lie\n!?\n13-Makoto31.png\n: In reality, that bottle of poison most definitely found its way to the\n**\nrec room\n. It was there at least until the window got broken. In other words, when the locked room was unlocked. There's no other way to explain the presence of that glass in that bottle.\n28-Kyoko13.png\n: And then, once the room was opened, the bottle somehow got moved back to the shelf in the chem lab. Meanwhile, the protein can we found at the crime scene was planted there.\n34-Kyoko14.png\n: That had to be after the locked room was opened. In other words, after Sakura died.\n31-Byakuya11.png\n: Wait, hold on... You're moving too fast!\n26-Byakuya6.png\n: I'll grant you, the bottle of poison may well have been in the rec room when it was locked, but how can you say the protein can was put there after the room was unlocked!? We already know she was given the protein can with the poison inside, right? If that can wasn't there when she died, how did she get poisoned!?\n39-Kyoko17.png\n: You're right. We do need to explain that. But before we do, there's something I'd like to confirm with everyone here.\n52-Hiro7.png\n: Huh...?\n5-Kyoko11.png\n: It has to do with the protein can. After Sakura's body was discovered, did anyone move it or trip over it or anything like that?\n26-Byakuya6.png\n: What are you talking about? Is this some kind of loaded question?\n39-Kyoko17.png\n: Not at all. Just answer to the best of your ability.\n26-Byakuya6.png\n: ...Well, no. Not that I remember.\n55-Makoto20.png\n: Yeah, me either.\n20-Hiro5.png\n: Not me.\n56-Jill9.png\n: Same here!\n14-Hina9.png\n: Y-Yeah, me either...\n32-Kyoko15.png\n: Okay then, that settles it. That proves that the protein can found its way to the murder scene *after* the room was opened.\n31-Byakuya11.png\n: Oh, come on! How can you say that!?\n26-Byakuya6.png\n: How can you know what I don't know!?\nThe reason she can say that is because there's evidence... There's proof that someone brought the protein can to the rec room *after* it was opened!\n",
            "testimonies": [
                {
                    "testimony": "When it comes to that protein can, there's not a doubt in my mind. Until ***the locked room was unlocked*** , it absolutely was not in there!",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "So you're saying...someone planted it there after we got the door open?",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "No...no, that's impossible... I-It had to have been in there the whole time! It had to be! It was in there before ***the rec room was unlocked*** !",
                    "person": "Byakuya",
                    "present": [
                        "Empty Protein Drink"
                    ]
                }
            ]
        }
    ]
}