{
  "currentChapter": "The First Turnabout",
  "characters": [],
  "evidence": [],
  "turns": [
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "fleeing subscriptions, selling subscriptions when I saw a man fleeing an apartment. selling subscriptions when I saw a man fleeing an apartment.",
          "contradiction": {}
        },
        {
          "testimony": "him! eh? I thought he must be in a hurry because he left the I thought he must be in a hurry because he left the  him!  because he... Eh...",
          "contradiction": {}
        },
        {
          "testimony": "Look, Thinking it strange,  I looked inside the apartment. Thinking it strange, I looked inside the apartment. apartment.  the apartment, apartment! inside the apartment Look... Think! apartment, Look,  Part,",
          "contradiction": {}
        },
        {
          "testimony": "(No...  here!) Lying? Then I saw her lying there... A woman...  not moving...  dead! Then, Then I saw her lying there...  A woman... not moving... dead! Then, no, no  lying there...  there no! there.  no!   man!  no, here,",
          "contradiction": {}
        },
        {
          "testimony": " right?  right!  Right! Right...  my I quailed in fright and found myself unable to go inside. right? I quailed in fright and found myself unable to go inside. Right,  right!",
          "contradiction": {}
        },
        {
          "testimony": "The, The,  to The   the THE  the  I thought to call the police immediately! I thought to call the police immediately! to... all,  police?  police...  to  to...  The... He...",
          "contradiction": {}
        },
        {
          "testimony": "in her apartment.  Ever. However, the phone in her apartment wasn't working. However, However, the phone in her apartment wasn't working. The phone in her apartment wasn't working?  how?  ever!",
          "contradiction": {}
        },
        {
          "testimony": "I went! I went to a nearby park and found a public phone. I went to a nearby park and found a public phone. k! on ",
          "contradiction": {}
        },
        {
          "testimony": "time.  remember? I remember the time exactly: I remember the time exactly: time... the time. the time... Ac  the time",
          "contradiction": {}
        },
        {
          "testimony": "Who...  the defendant the defendant...  defendant? The defendant?  defendant,  the defendant The man who ran was,  without a doubt,  the defendant sitting right over there. The man who ran was, without a doubt, the defendant sitting right over there. defendant, defendant,",
          "contradiction": {}
        }
      ]
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "you  see, you see. You see,  when I found the body,  I heard the time. You see, when I found the body, I heard the time. heard. the body, the body! I heard,   you!  You?  Yo,",
          "contradiction": {}
        },
        {
          "testimony": "There was a voice saying the  It was probably coming from the television. There was a voice saying the time... It was probably coming from the television. television  the television... television... Say,",
          "contradiction": {}
        },
        {
          "testimony": "Oh,  Oh, oh!) Oh! Oh,  but Oh,   but But,  Oh,  Oh, Oh,  but it was three hours off,  wasn't it? Oh, but it was three hours off, wasn't it? But  Oh, ff But,  but  but... But... Oh, Oh, Oh, Oh, Oh,",
          "contradiction": {}
        },
        {
          "testimony": "I guess the victim must have been watching  a video of a taped program! I guess the victim must have been watching a video of a taped program!  video? video!",
          "contradiction": {}
        },
        {
          "testimony": "it was That's...  that's It was 1:00 PM. Why, It was 1:00 PM.  I thought...  1:00 PM!  1:00 PM It was 1:00 PM, That's why I thought it was 1:00 PM! That's why I thought it was 1:00 PM! It... That's why   g was it was ",
          "contradiction": {}
        },
        {
          "testimony": "er,  Sorry,  er...  Sorry,  Sorry!  er, stand. Er... So,  Er...  in and  Er...  So,  And  So,  er...  er...   er... Terribly sorry about the misunderstanding...  Terribly sorry about the misunderstanding...  er, So   so, is   and...? So, So, (Sorry,  er... And... Er,",
          "contradiction": {}
        }
      ]
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "\" \" I did, Actually,  I didn't \"hear\"  I \"saw\" it! Actually, I didn't \"hear\" the time... I \"saw\" it!  Did \" Actually,",
          "contradiction": {}
        },
        {
          "testimony": " there was a   in the apartment?  there was There was a table clock in  wasn't there! There was a table clock in the apartment, wasn't there! table clock! table clock.  clock? clock, table clock ",
          "contradiction": {}
        },
        {
          "testimony": "victim the victim!?  use Use  Yeah, the murder,  Yeah!  Yeah! murder. the murder, Yeah,  the murder weapon! The killer used it to hit the victim! Yeah, the murder weapon! The killer used it to hit the victim!  murder weapon? ah! the murder... the murder...  the victim  yeah, Yeah, Yeah! yeah.",
          "contradiction": {}
        },
        {
          "testimony": "What!? I... I, What!?  I, a   What?!  that! that!  I...  I...  A... I,  a  I... That must have been what I saw. That must have been what I saw. Wh  I... that   a  That  I... I... That... I... I...  I  saw... Saw... that... ",
          "contradiction": {}
        }
      ]
    }
  ]
}