{
  "0":{
    "context": "Episode 1\nThe First Turnabout\n*gasp*... *gasp*... Dammit! ...Why me? I can't get caught... Not like this! I-I've gotta find someone to pin this on... Someone like... him! I'll make it look like HE did it!\n\nAugust 3, 9:47 AM\nDistrict Court\nDefendant Lobby No. 2\n\nPhoenix:\n(Boy am I nervous!)\n\nMia:\nWright!\n\nPhoenix:\nOh, h-hiya, Chief.\n\nMia:\nWhew, I'm glad I made it on time. Well, I have to say Phoenix, I'm impressed! Not everyone takes on a murder trial right off the bat like this. It says a lot about you... and your client as well.\n\nPhoenix:\nUm... thanks. Actually, it's because I owe him a favor.\n\nMia:\nA favor? You mean, you knew the defendant before this case?\n\nPhoenix:\nYes. Actually, I kind of owe my current job to him. He's one of the reasons I became an attorney.\n\nMia:\nWell, that's news to me!\n\nPhoenix:\nI want to help him out any way I can! I just... really want to help him, I owe him that much.\n\n???:\n(It's over! My life, everything, it's all over!)\n\nMia:\n... Isn't that your client screaming over there?\n\nPhoenix:\nYeah... that's him.\n\n???:\n(Death! Despair! Ohhhh! I'm gonna do it, I'm gonna die!!!)\n\nMia:\nIt sounds like he wants to die...\n\nPhoenix:\nUm, yeah. *sigh*\n\nButz:\nNick!!!\n\nPhoenix:\nHey. Hey there, Larry.\n\nButz:\nDude, I'm so guilty!! Tell them I'm guilty!!! Gimme the death sentence! I ain't afraid to die!\n\nPhoenix:\nWhat!? What's wrong, Larry?\n\nButz:\nOh, it's all over... I... I'm finished. Finished! I can't live in a world without her! I can't! Who... who took her away from me, Nick? Who did this!? Aww, Nick, ya gotta tell me! Who took my baby away!?\n\nPhoenix:\n(Hmm... The person responsible for your girlfriend's death? The newspapers say it was you...)\n\nPhoenix:\nMy name is Phoenix Wright. Here's the story: My first case is a fairly simple one. A young woman was killed in her apartment. The guy they arrested was the unlucky sap dating her: Larry Butz... my best friend since grade school. Our school had a saying: 'When something smells, it's usually the Butz.' In the 23 years I've known him, it's usually been true. He has a knack for getting himself in trouble. One thing I can say though: it's usually not his fault. He just has terrible luck. But I know better than anyone, that he's a good guy at heart. That and I owe him one. Which is why I took the case... to clear his name. And that's just what I'm going to do!\n\nAugust 3, 10:00 AM\nDistrict Court\nCourtroom No. 2\n\nJudge:\nThe court is now in session for the trial of Mr. Larry Butz.\n\nPayne:\nThe prosecution is ready, Your Honor.\n\nPhoenix:\nThe, um, defense is ready, Your Honor.\n\nJudge:\nAhem. Mr. Wright? This is your first trial, is it not?\n\nPhoenix:\nY-Yes, Your Honor. I'm, um, a little nervous.\n\nJudge:\nYour conduct during this trial will decide the fate of your client. Murder is a serious charge. For your client's sake, I hope you can control your nerves.\n\nPhoenix:\nThank... thank you, Your Honor.\n\nJudge:\n... Mr. Wright, given the circumstances... I think we should have a test to ascertain your readiness.\n\nPhoenix:\nY-Your Honor. (Gulp... Hands shaking... Eyesight... fading...)\n\nJudge:\nThis test will consist of a few simple questions. Answer them clearly and concisely. Please state the name of the defendant in this case.",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [
          {
            "name": "Attorney's Badge",
            "description": "No one would believe I was a defense attorney if I didn't carry this."
          },
          {
            "name": "Cindy's Autopsy Report",
            "description": "Time of death: 7/31, 4PM-5PM. Cause of death: loss of blood due to blunt trauma."
          }
        ],
        "people": [
          {
            "name": "Phoenix Wright",
            "description": "TODO"
          },
          {
            "name": "Mia Fey",
            "description": "TODO"
          },
          {
            "name": "Winston Payne",
            "description": "TODO"
          },
          {
            "name": "Larry Butz",
            "description": "TODO"
          },
          {
            "name": "Cindy Stone",
            "description": "TODO"
          }
		]
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Phoenix Wright",
        "is_correct": 0, 
        "response": "Phoenix:\nUm... the defendant... is me, right?\n\nMia:\nWright! Have you completely lost your mind? Focus! The defendant is the person on trial! You're his lawyer!\n\nPhoenix:\nUm, er, eh? Oh yeah, right! Eh heh heh.\n\nMia:\nThis is no laughing matter! You did pass the bar, didn't you?\n\nJudge:\nSorry, I couldn't hear your answer. I'll ask once more:\nPlease state the name of the defendant in this case."
      },
      {
        "choice": "Larry Butz",
        "is_correct": 1, 
        "response": ""
      },
      {
        "choice": "Mia Fey",
        "is_correct": 0, 
        "response": "Phoenix:\nThe, um, defendant? That's... er... Mia Fey?\n\nMia:\nWrong, Wright. Look, I have to leave. I have to go home. I'm... I'm expecting a delivery.\n\nPhoenix:\nAw, c'mon Chief. There's no need to be going so soon, is there?\n\nMia:\nWright! Listen: the defendant is the one on trial--your client! I mean, that's about as basic as you can get!\n\nPhoenix:\n(I've put my foot in it this time! I've got to relax!)\n\nJudge:\nSorry, I couldn't hear your answer. I'll ask once more:\nPlease state the name of the defendant in this case."
      }
    ]
  },
  "1":{
    "context": "Phoenix:\nThe defendant? Well, that's Larry Butz, Your Honor.\n\nJudge:\nCorrect. Just keep your wits about you and you'll do fine. Next question: This is a murder trial. Tell me, what's the victim's name?\n\nPhoenix:\n(Whew, I know this one! Glad I read the case report cover to cover so many times. It's... wait... Uh-oh! No... no way! I forgot! I'm drawing a total blank here!)\n\nMia:\nPhoenix! Are you absolutely SURE you're up to this? You don't even know the victim's name!?\n\nPhoenix:\nOh, the victim! O-Of course I know the victim's name! I, um, just forgot. ... Temporarily.\n\nMia:\nI think I feel a migraine coming on. Look, the victim's name is listed in the Court Record. Just touch the Court Record button to check it at anytime, okay? Remember to check it often. Do it for me, please. I'm begging you.\n\nJudge:\nMr. Wright. Who is the victim in this case?",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Mia Fey",
        "is_correct": 0, 
        "response": "Phoenix:\nUm... Mia Fey?\n\nMia:\nW-W-What!? How can I be the victim!?\n\nPhoenix:\nOh! Right! Sorry! I, er, it was the first name that popped into my head, and--\n\nMia:\nThe Court Record button! Remember to use it when you are in a pinch.\n\nJudge:\nLet me ask that one again:\nLet's hear your answer. Who is the victim in this case?"
      },
      {
        "choice": "Cinder Block",
        "is_correct": 0, 
        "response": "Phoenix:\nOh, um, wasn't it Ms. Block? Ms. Cinder Block?\n\nJudge:\nThe person in question was a victim of murder, not ill-conceived naming, Mr. Wright.\n\nMia:\nWright? If you forget something, just touch the Court Record button to help you remember. A mistake in court could cost you the case.\n\nJudge:\nI ask you again:\nLet's hear your answer. Who is the victim in this case?"
      },
      {
        "choice": "Cindy Stone",
        "is_correct": 1, 
        "response": ""
      }
    ]
  },
  "2":{
    "context": "Phoenix:\nUm... the victim's name is Cindy Stone.\n\nJudge:\nCorrect. Now, tell me, what was the cause of death? She died because she was...?",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Poisoned",
        "is_correct": 0, 
        "response": "Phoenix:\nOh, right! Wasn't she, um, poisoned by er... poison?\n\nJudge:\nYou're asking me!?\n\nPhoenix:\nUm... Chief! Help me out!\n\nMia:\nCheck the court record. The Court Record button... remember?\n\nPhoenix:\n(Geez. Give a guy a break!)\n\nJudge:\nLet me ask again.\nShe died because she was...?"
      },
      {
        "choice": "Hit with a blunt object",
        "is_correct": 1, 
        "response": ""
      },
      {
        "choice": "Strangled",
        "is_correct": 0, 
        "response": "Phoenix:\nRight... she was strangled, wasn't she?\n\nMia:\nPlease tell me that was you talking to yourself.\n\nJudge:\nIf you wish to hang yourself, Mr. Wright, you're welcome to, but not inside my courtroom. I suppose there's nothing to do but give you another try:\nShe died because she was...?"
      }
    ]
  },
  "3":{
    "context": "Phoenix:\nShe was struck once, by a blunt object.\n\nJudge:\nCorrect. You've answered all my questions. I see no reason why we shouldn't proceed. You seem much more relaxed, Mr. Wright. Good for you.\n\nPhoenix:\nThank you, Your Honor. (Because I don't FEEL relaxed, that's for sure.)\n\nJudge:\nWell, then... First, a question for the prosecution. Mr. Payne?\n\nPayne:\nYes, Your Honor?\n\nJudge:\nAs Mr. Wright just told us, the victim was struck with a blunt object. Would you explain to the court just what that 'object' was?\n\nPayne:\nThe murder weapon was this statue of 'The Thinker.' It was found lying on the floor, next to the victim.\n\nJudge:\nI see... the court accepts it into evidence.\n\nStatue added to the Court Record.\n\nMia:\nWright... Be sure to pay attention to any evidence added during the trial. That evidence is the only ammunition you have in court. Touch the Court Record button to check the Court Record frequently.\n\nJudge:\nMr. Payne, the prosecution may call its first witness.\n\nPayne:\nThe prosecution calls the defendant, Mr. Butz, to the stand.\n\nPhoenix:\nUm, Chief, what do I do now?\n\nMia:\nPay attention. You don't want to miss any information that might help your client's case. You'll get your chance to respond to the prosecution later, so be ready! Let's just hope he doesn't say anything... unfortunate.\n\nPhoenix:\n(Uh oh, Larry gets excited easily... this could be bad.)\n\nPayne:\nAhem. Mr. Butz. Is it not true that the victim had recently dumped you?\n\nButz:\nHey, watch it buddy! We were great together! We were Romeo and Juliet, Cleopatra and Mark Anthony!\n\nPhoenix:\n(Um... didn't they all die?)\n\nButz:\nI wasn't dumped! She just wasn't taking my phone calls. Or seeing me... Ever. WHAT'S IT TO YOU, ANYWAY!?\n\nPayne:\nMr. Butz, what you describe is generally what we mean by 'dumped.' In fact, she had completely abandoned you... and was seeing other men! She had just returned from overseas with one of them the day before the murder!\n\nButz:\nWhaddya mean, 'one of them'!? Lies! All of it, lies! I don't believe a word of it!\n\nPayne:\nYour Honor, the victim's passport. According to this, she was in Paris until the day before she died.\n\nPassport added to the Court Record.\n\nJudge:\nHmm... Indeed, she appears to have returned the day before the murder.\n\nButz:\nDude... no way...\n\nPayne:\nThe victim was a model, but did not have a large income. It appears that she had several 'Sugar Daddies.'\n\nButz:\nDaddies? Sugar?\n\nPayne:\nYes. Older men, who gave her money and gifts. She took their money and used it to support her lifestyle.\n\nButz:\nDuuude!\n\nPayne:\nWe can clearly see what kind of woman this Ms. Stone was. Tell me, Mr. Butz, what do you think of her now?\n\nMia:\nWright... I don't think you want him to answer that question.\n\nPhoenix:\n(Yeah... Larry has a way of running his mouth in all the wrong directions. Should I...?)",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [
          {
            "name": "Statue",
            "description": "A statue in the shape of The Thinker'. It's rather heavy."
          },
          {
            "name": "Passport",
            "description": "The victim apparently arrived home from Paris on 7/30, the day before the murder."
          }
		],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Wait and see what happens",
        "is_correct": 1, 
        "response": "Phoenix:\n(Might be better not to get involved in this one...)\n\nPayne:\nWell, Mr. Butz?\n\nButz:\nDude, no way! That cheatin' she-dog!"
      },
      {
        "choice": "Stop him from answering",
        "is_correct": 1, 
        "response": "Phoenix:\nMy client had no idea the victim was seeing other men! That question is irrelevant to this case!\n\nPayne:\nOof! *wince*\n\nButz:\nDude! Nick! Whaddya mean, 'irrelevant'!? That cheatin' she-dog!"
      }
    ]
  },
  "4":{
    "context": "Butz:\nI'm gonna die. I'm just gonna drop dead! Yeah, and when I meet her in the afterlife... I'm going to get to the bottom of this!\n\nJudge:\nLet's continue with the trial, shall we?\n\nPayne:\nI believe the accused's motive is clear to everyone.\n\nJudge:\nYes, quite.\n\nPhoenix:\n(Oh boy. This is so not looking good.)\n\nPayne:\nNext question! You went to the victim's apartment on the day of the murder, did you not?\n\nButz:\nGulp!\n\nPayne:\nWell, did you, or did you not?\n\nButz:\nHeh? Heh heh. Well, maybe I did, and maybe I didn't!\n\nPhoenix:\n(Uh oh. He went. What do I do?)",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Have him answer honestly",
        "is_correct": 1, 
        "response": "Phoenix:\n(I know! I'll send him a signal...)\n\n(TELL THE TRUTH)\n\nButz:\nEr... Yeah! Yeah! I was there! I went!\n\nJudge:\nOrder! Well, Mr. Butz?\n\nButz:\nDude, chill! She wasn't home, man... So, like, I didn't see her.\n\nPayne:\nObjection\n\nPayne:\nYour Honor, the defendant is lying.\n\nJudge:\nLying?\n\nPayne:\nThe prosecution would like to call a witness who can prove Mr. Butz is lying."
      },
      {
        "choice": "Stop him from answering",
        "is_correct": 1, 
        "response": "Phoenix:\n(I'll send him a signal...)\n\n(LIE LIKE A DOG)\n\nButz:\nUm, well, see, it's like this: I don't remember.\n\nPayne:\nYou 'don't remember'? Well then, we'll just have to remind you!\n\nPhoenix:\n(I got a bad feeling about this...)\n\nPayne:\nWe have a witness that can prove he DID go to the victim's apartment that day!"
      }
    ]
  },
  "5":{
    "context": "Judge:\nWell, that simplifies matters. Who is your witness?\n\nPayne:\nThe man who found the victim's body. Just before making the gruesome discovery... He saw the defendant fleeing the scene of the crime!\n\nJudge:\nOrder! Order in the court! Mr. Payne, the prosecution may call its witness.\n\nPayne:\nYes, Your Honor.\n\nPhoenix:\n(This is bad...)\n\nPayne:\nOn the day of the murder, my witness was selling newspapers at the victim's building. Please bring Mr. Frank Sahwit to the stand!\n\nPayne:\nMr. Sahwit, you sell newspaper subscriptions, is this correct?\n\nSahwit:\nOh, oh yes! Newspapers, yes!\n\nJudge:\nMr. Sahwit, you may proceed with your testimony. Please tell the court what you saw on the day of the murder.\n\nWitness Testimony\n-- Witness's Account --\nSahwit:\nI was going door-to-door, selling subscriptions when I saw a man fleeing an apartment.\nI thought he must be in a hurry because he left the door half-open behind him.\nThinking it strange, I looked inside the apartment.\nThen I saw her lying there... A woman... not moving... dead!\nI quailed in fright and found myself unable to go inside.\nI thought to call the police immediately!\nHowever, the phone in her apartment wasn't working.\nI went to a nearby park and found a public phone.\nI remember the time exactly: It was 1:00 PM.\nThe man who ran was, without a doubt, the defendant sitting right over there.\n\nJudge:\nHmm...\n\nPhoenix:\n(Larry! Why didn't you tell the truth? I can't defend you against a testimony like that!)\n\nJudge:\nIncidentally, why wasn't the phone in the victim's apartment working?\n\nPayne:\nYour Honor, at the time of the murder, there was a blackout in the building.\n\nJudge:\nAren't phones supposed to work during a blackout?\n\nPayne:\nYes, Your Honor... However, some cordless phones do not function normally. The phone that Mr. Sahwit used was one of those. Your Honor... I have a record of the blackout, for your perusal.\n\nBlackout Record added to the Court Record.\n\nJudge:\nNow, Mr. Wright...\n\nPhoenix:\nYes! Er... yes, Your Honor?\n\nJudge:\nYou may begin your cross-examination.\n\nPhoenix:\nC-Cross-examination, Your Honor?\n\nMia:\nAlright, Wright, this is it. The real deal!\n\nPhoenix:\nUh... what exactly am I supposed to do?\n\nMia:\nWhy, you expose the lies in the testimony the witness just gave!\n\nPhoenix:\nLies! What?! He was lying!?\n\nMia:\nYour client is innocent, right? Then that witness must have lied in his testimony! Or is your client really... guilty?\n\nPhoenix:\n!!! How do I prove he's not?\n\nMia:\nYou hold the key! It's in the evidence! Compare the witness's testimony to the evidence at hand. There's bound to be a contradiction in there! First, find contradictions between the Court Record and the witness's testimony. Then, once you've found the contradicting evidence... present it and rub it in the witness's face!\n\nPhoenix:\nUm... okay.\n\nMia:\nTouch the Court Record button and point out contradictions in the testimony!",
    "category": "cross_examination",
    "court_record": {
      "add": {
        "objects": [
          {
            "name": "Blackout Record",
            "description": "Electricity to Ms. Stone's building was out from noon to 6 PM on the day of the crime."
          }
		],
        "people": [
		  {
            "name": "Frank Sahwit",
            "description": "TODO"
		  }
		]
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "testimonies": [
      {
        "testimony": "I was going door-to-door, selling subscriptions when I saw a man fleeing an apartment.",
        "critical_press": 0, 
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nIsn't a man leaving an apartment a common sight? I find it odd you would take notice of him...\n\nSahwit:\nEr... heh. I don't know. He just seemed strange to me, that's all. Like he was mad, and yet frightened at the same time. Just like... a criminal fleeing the scene of a crime!\n\nPhoenix:\nThe defense requests that the witness refrain from conjecture!\n\nPayne:\nOf course. What the witness means is that the man he saw looked suspicious. So, what happened next?"
      },
      {
        "testimony": "I thought he must be in a hurry because he left the door half-open behind him.",
        "critical_press": 0, 
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nHalf-open... you say?\n\nSahwit:\nYes, yes, the door was open halfway. Yes. I watched for a moment, but no one came to close the door. 'That's odd, in a big city like this,' I thought...\n\nPayne:\nI see. And what happened next?"
      },
      {
        "testimony": "Thinking it strange, I looked inside the apartment.",
        "critical_press": 0, 
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nWhat gave you the idea to do that?\n\nSahwit:\nWell, the door was half-open, you see. Isn't it only human to want to... peek? We climb mountains because they are there! It's the same thing.\n\nPayne:\nTruer words have never been spoken! Anyone would look inside!\n\nPhoenix:\n(Hmm... why did Payne cut him off so quickly?)\n\nPayne:\nSo you looked into the apartment. What happened then?"
      },
      {
        "testimony": "Then I saw her lying there... A woman... not moving... dead!",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nAre you sure she was dead?\n\nSahwit:\nW-Well, no, I guess I wasn't. But, she wasn't moving at all, and there was blood everywhere.\n\nPhoenix:\n(I guess that would look fatal to anyone...) Very well, what happened next?"
      },
      {
        "testimony": "I quailed in fright and found myself unable to go inside.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nSo, you didn't touch ANYTHING in the apartment?\n\nSahwit:\nUm, yes. I mean no! Nothing.\n\nPhoenix:\nOkay. What happened next?"
      },
      {
        "testimony": "I thought to call the police immediately!",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nYou 'thought' to call the police? Does that mean you didn't actually call them!?\n\nPayne:\nPlease, please... Listen to the rest of the testimony. You thought to call the police... What happened next?"
      },
      {
        "testimony": "However, the phone in her apartment wasn't working.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nThe phone in her apartment wasn't working?\n\nSahwit:\nYes. I mean, no, no it wasn't. Right.\n\nPhoenix:\nBut you said you didn't go into the apartment... or did you!?\n\nSahwit:\nOh, oh, that? I can explain that! There was a cordless phone on a shelf in the entranceway. I reached inside and tried using that to call...\n\nPayne:\nAnd the phone wasn't working, correct? What happened next?"
      },
      {
        "testimony": "I went to a nearby park and found a public phone.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nWhy use a public phone?\n\nSahwit:\nWell, you see, I don't have a cell phone. And, being the middle of the afternoon, there was no answer at the nearby apartments.\n\nPhoenix:\nAh, right... what time did you call again?"
      },
      {
        "testimony": "I remember the time exactly: It was 1:00 PM.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\n1:00 PM! Are you certain?\n\nSahwit:\nYes. Absolutely.\n\nPhoenix:\n(Hmm... He seems really confident.)\n\nMia:\n1:00 PM? Wright. Doesn't that seem strange to you? Present some evidence to contradict him!",
		"correct_present": ["Cindy's Autopsy Report"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "The man who ran was, without a doubt, the defendant sitting right over there.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nAre you absolutely, 100% positive?\n\nSahwit:\nYes, it was him. No mistake about it.\n\nPayne:\nThe witness says he's certain!"
      }
    ]
  },
  "6":{
    "context": "Phoenix:\nYou found the body at 1:00 PM. You're sure?\n\nSahwit:\nYes. It was 1:00 PM, for certain.\n\nPhoenix:\nFrankly, I find that hard to believe! Your statement directly contradicts the autopsy report. The autopsy notes the time of death at sometime after 4PM. There was nobody to... er... no 'body' to find at 1:00 PM! How do you explain this three-hour gap?\n\nSahwit:\n!!! Oh, that! Oh, er...\n\nPayne:\nObjection\n\nPayne:\nThis is trivial! The witness merely forgot the time!\n\nJudge:\nAfter his testimony, I find that hard to believe. Mr. Sahwit... Why were you so certain that you found the body at 1:00 PM?\n\nSahwit:\nI.. er... well, I... Gee, that's a really good question!\n\nMia:\nGreat job, Wright! Way to put him on the spot! That's all you have to do: point out contradictions! Lies always beget more lies! See through one, and their whole story falls apart!\n\nSahwit:\nWait! I remember now!\n\nJudge:\nWould you care to give your testimony again?\n\nWitness Testimony\n-- The Time of Discovery --\nSahwit:\nYou see, when I found the body, I heard the time.\nThere was a voice saying the time... It was probably coming from the television.\nOh, but it was three hours off, wasn't it?\nI guess the victim must have been watching a video of a taped program!\nThat's why I thought it was 1:00 PM!\nTerribly sorry about the misunderstanding...\n\nJudge:\nHmm... I see. You heard a voice saying the time on a taped program. Mr. Wright, you may cross-examine the witness.\n\nMia:\nWright! You know what to do!\n\nPhoenix:\nI've got this one.",
    "category": "cross_examination",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "testimonies": [
      {
        "testimony": "You see, when I found the body, I heard the time.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nYou said 'heard'... Not 'saw'?\n\nSahwit:\nYes, heard. All I saw was the body lying there... I didn't think to look at anything else, least of all my watch.\n\nPhoenix:\nHmm... Isn't that a little strange? So you're saying you 'heard' something. But if you were so shocked by the body, you wouldn't hear anything at all!\n\nPayne:\nObjection\n\nPayne:\nThe witness did say he actually heard the time. It's ludicrous to suggest he 'wouldn't hear anything'!\n\nJudge:\nHmm... I have to agree with the prosecution. Witness, continue your testimony.",
		"correct_present": ["Blackout Record"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "There was a voice saying the time... It was probably coming from the television.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nAre you sure it was a television and not... a radio?\n\nSahwit:\nWell, no, I guess it might have been a radio.\n\nPayne:\nIncidentally, there was no radio on the premises. There was only one large television.\n\nMia:\nWright! I can't put my finger on it, but something about this seems fishy. Something about 'hearing' the television...\n\nPayne:\nThe witness has testified. He heard the time.",
		"correct_present": ["Blackout Record"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "Oh, but it was three hours off, wasn't it?",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nHow do you explain the gap!\n\nJudge:\nWell, witness? Can you explain this?",
		"correct_present": ["Blackout Record"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "I guess the victim must have been watching a video of a taped program!",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nA.. video?\n\nSahwit:\nYes, that would explain why the time was wrong!\n\nPhoenix:\nTrue, true...\n\nMia:\nWright! I think the problem lies someplace else...\n\nJudge:\nWe're agreed that you heard the time at the scene, then.",
		"correct_present": ["Blackout Record"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "That's why I thought it was 1:00 PM!",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nAre you sure the voice you heard said it was 1:00 PM?\n\nSahwit:\nYes, I can practically hear it now. It was quite clear.\n\nJudge:\nMr. Payne, has the prosecution verified this testimony?\n\nPayne:\nMy apologies, Your Honor. I, too, have only just learned that the witness 'heard' the time.\n\nSahwit:\nOh, I'm really sorry. I only remembered it just now.",
		"correct_present": ["Blackout Record"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "Terribly sorry about the misunderstanding...",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nWell, you just watch it! (Hmm... Not much point pressing him on that one, was there?)"
      }
    ]
  },
  "7":{
    "context": "Phoenix:\nHold it right there! The prosecution has said there was a blackout at the time of the discovery! And this record proves it!\n\nSahwit:\n...!\n\nPhoenix:\nYou couldn't have heard a television... or a video!\n\nSahwit:\nGah!!! I... well... urk!\n\nJudge:\nThe defense has a point. Do you have an explanation for this, Mr. Sahwit?\n\nSahwit:\nNo, I... I find it quite puzzling myself! Quite! ... Aah! W-wait! I remember now!\n\nJudge:\nMr. Sahwit? The court would prefer to hear an accurate testimony from the very beginning. These constant corrections are harming your credibility. That, and you seem rather... distraught.\n\nSahwit:\n...! M-my apologies, Your Honor! It... er, it must have been the shock of finding the body!\n\nJudge:\nVery well, Mr. Sahwit. Let's hear your testimony once more please.\n\nWitness Testimony\n-- Hearing the Time --\nSahwit:\nActually, I didn't 'hear' the time... I 'saw' it!\nThere was a table clock in the apartment, wasn't there!\nYeah, the murder weapon! The killer used it to hit the victim!\nThat must have been what I saw.\n\nJudge:\nYou saw a clock? I guess that would explain it. The defense may cross-examine the witness.\n\nPhoenix:\nGladly.\n\n",
    "category": "cross_examination",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "actions": [
      {
        "testimony": "Actually, I didn't 'hear' the time... I 'saw' it!",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nThat strikes me as a very suspicious mistake.\n\nSahwit:\nYes, I can see how you'd be a little doubtful... I'm really sorry. I only just remembered that table clock!\n\nJudge:\nA 'table clock'?"
      },
      {
        "testimony": "There was a table clock in the apartment, wasn't there!",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nA 'table clock'? Was there a clock at the scene?\n\nJudge:\nThis is the first I've heard of it!",
		"correct_present": ["Statue"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "Yeah, the murder weapon! The killer used it to hit the victim!",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nThe... murder weapon?\n\nSahwit:\nYes, the table clock that was used as a weapon! That's what I just said. Did you doze off in the middle of my testimony or something?\n\nPhoenix:\n(Something's fishy here...)",
		"correct_present": ["Statue"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "That must have been what I saw.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nWhy didn't you tell us that in the first place?\n\nSahwit:\nI guess it just slipped my mind! I'm not really sure how it happened myself...\n\nPayne:\nThe witness says he saw the table clock. End of story.",
		"correct_present": ["Statue"],
		"present_response": "Phoenix:\nObjection!"
      }
    ]
  },
  "8":{
    "context": "Phoenix:\nWait just a moment! The murder weapon wasn't a clock. It was this statue! Now how is this supposed to be a clock?\n\nSahwit:\nWhaa!? Y-you with your 'objections,' and your 'evidence'... Just who do you think you are!?\n\nPhoenix:\nJust answer the question, Mr. Sahwit.\n\nSahwit:\nHey, I... I saw it there, okay! That's a clock!\n\nPayne:\nYour Honor! If I may...\n\nJudge:\nYes, Mr. Payne?\n\nPayne:\nAs the witness stated, this statue is indeed a clock. The neck is a switch. You just tilt it, and it says the time out loud. As it doesn't look like a clock, I submitted it as a statue. My apologies.\n\nJudge:\nI see. So the murder weapon was a table clock after all. Well, Mr. Wright? It appears that the witness's testimony was correct. This is a clock. Do you have any problems with his testimony now?",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "No",
        "is_correct": 1, 
        "response": "Phoenix:\nI guess not. There was a clock on the scene, so, no problem.\n\nMia:\nWright! Are you out of your mind!? That clock doesn't look like a clock at all! The witness couldn't have possibly known it was a clock just by seeing it! He said himself, he never entered the apartment! It was in his testimony!\n\nPhoenix:\nHey! You're right!\n\nJudge:\nIs something the matter? Does the defense have anything to add?\n\nPhoenix:\nYes... Yes I do!"
      },
      {
        "choice": "Yes",
        "is_correct": 1, 
        "response": "Phoenix:\nYour Honor, there is a gaping hole in the witness's testimony!"
      }
    ]
  },
  "9":{
    "context": "Phoenix:\nThe only way he could have known the weapon was a clock is to hold it in his hand. Yet the witness testified that he never entered the apartment! Clearly, a contradiction!\n\nJudge:\nHmm... indeed!\n\nPhoenix:\nThe witness knew it was a clock, because he...",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Went into the apartment",
        "is_correct": 1, 
        "response": ""
      },
      {
        "choice": "Knew the victim",
        "is_correct": 0, 
        "response": "Phoenix:\nTell me, isn't it true that you knew the victim? In fact, you were one of her 'sugar daddies'! Be frank with us, Mr. Sahwit!\n\nSahwit:\nHmph. 'Frank'? I'm always 'Frank'!\n\nPayne:\nYour Honor. We have complete records of the victim's relationships. Mr. Frank Sahwit does not appear anywhere.\n\nPhoenix:\nHuh? Oh, really?\n\nJudge:\nPlease, Mr. Wright... Is 'Huh' the best response you can muster up? Try to refrain from making off-the-cuff accusations in the future.\n\nPhoenix:\nY-yes, Your Honor. Let me think this over.\nThe witness knew it was a clock, because he..."
      }
    ]
  },
  "10":{
    "context": "Phoenix:\nYou're lying! You were inside the apartment on the day of the murder!\n\nSahwit:\nOh yeah? Prove it! Prove I went in there!\n\nPhoenix:\nI'll do better than that! I can prove you were the one who killed her! You struck her with the clock, and the shock of the blow triggered the clock's voice! That was the sound you heard!\n\nJudge:\nOrder in the court! Intriguing. Please continue, Mr. Wright.\n\nPhoenix:\nYes, Your Honor. Mr. Sahwit. The sound must have left quite an impression on you. Understandable, since the murder weapon spoke just as you hit the victim! That voice was burned into your mind. That's why you were so certain about the time!\n\nPayne:\nObjection\n\nPayne:\nW-w-what's the meaning of this? This is all baseless conjecture!\n\nPhoenix:\nBaseless...? Just look at the witness's face!\n\nSahwit:\nNgh... grrrah!\n\nJudge:\nWould the witness care to elaborate? Did you strike the victim with the clock?\n\nSahwit:\nI... I...! That... that day... I... I never! Look... I... the clock... I heard, no! I mean, I saw...Saw... nggg! Gwaaaaaaaaaaaaah! Shutupshutupshutup! I hate you! I-it was him, I tell you! I saw him! H-he killed her and he should burn! Burn! Give him death!\n\nJudge:\nOrder! Order in the court I say!\n\nPayne:\nYour Honor, a-a moment please! There isn't a shred of evidence supporting the defense's claims!\n\nJudge:\nMr. Wright!\n\nPhoenix:\nYour Honor?\n\nJudge:\nYou claim the sound the witness heard came from the clock... Do you have any evidence?\n\nPhoenix:\n(The whole case is riding on this! I'd better think it through carefully!) Yes, Your Honor. The sound Mr. Sahwit heard was definitely this clock. A fact which is clear if you simply...",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Examine the clock's batteries",
        "is_correct": 0, 
        "response": "Phoenix:\nAll you have to do is examine the batteries!\n\nJudge:\nIndeed? The batteries are... in the right way. The clock seems to be working fine. What exactly did you mean, Mr. Wright?\n\nPhoenix:\nYes, the clock was working fine!\n\nPayne:\nYes, and...?\n\nPhoenix:\n... Umm, I'm sorry, I think I got confused back there with all those testimonies.\n\nJudge:\nMr. Wright! I expect more from a lawyer in this court. Even if it is your first day. I'm afraid I have to penalize you! Try to think things through more carefully.\n\nPhoenix:\nY-yes, Your Honor. As I was saying...\n(The whole case is riding on this! I'd better think it through carefully!) Yes, Your Honor. The sound Mr. Sahwit heard was definitely this clock. A fact which is clear if you simply..."
      },
      {
        "choice": "Ask the neighbors",
        "is_correct": 0, 
        "response": "Phoenix:\nAll you have to do is talk to the victim's neighbors!\n\nJudge:\nTalk to the neighbors...?\n\nPhoenix:\nI'm sure one of them heard the clock tell the time when the incident occurred!\n\nJudge:\nI see... Does the prosecution have anything to say, Mr. Payne?\n\nPayne:\nWe have already made all the necessary inquiries. Everyone living near the victim's apartment was out at the time of the murder. Furthermore, even if a neighbor had heard the clock, that would not prove that Mr. Sahwit had heard anything.\n\nJudge:\nHmm... That is true. I believe you may be wrong, Mr. Wright. You'll receive a penalty for that, unfortunately.\n\nPhoenix:\nI-I'm sorry, Your Honor! Let me think about it again!\n(The whole case is riding on this! I'd better think it through carefully!) Yes, Your Honor. The sound Mr. Sahwit heard was definitely this clock. A fact which is clear if you simply..."
      },
      {
        "choice": "Try sounding the clock",
        "is_correct": 1, 
        "response": ""
      }
    ]
  },
  "11":{
    "context": "Phoenix:\nLet's sound the clock now, here in this court. Your Honor, may I have the clock? I ask the court to listen very carefully...\n\n...*beep*...\n[I think it's 8:25.]\n\nJudge:\nThat certainly is a strange way to announce the time.\n\nPhoenix:\nWell, he is 'The Thinker,' after all.\n\nJudge:\nSo, we've heard the clock. What are your conclusions, Mr. Wright?\n\nPhoenix:\nMr. Payne... can you tell me what time it is now?\n\nPayne:\nIt's 11:25... Ack!\n\nPhoenix:\nAs you can see, this clock is exactly three hours slow! Precisely the discrepancy between what Mr. Sahwit heard and the actual time of death! So, Mr. Sahwit... Try to talk your way out of this one!\n\nSahwit:\n... ...Hah! Hah hah! You forgot one thing!\n\nPhoenix:\n(Uh oh... what's he talking about...?)\n\nSahwit:\nWhile it may seem like that clock IS running three hours slow... It proves nothing! How do you know it was running three days slow on the day of the murder!? If you can't prove that, you don't have a case!\n\nPhoenix:\n...! (He's right! How am I going to prove that!? Dammit! I was so close!)\n\nJudge:\nMr. Wright? It seems you lack the critical evidence to support your claim.\n\nPhoenix:\n...! Yes, Your Honor.\n\nJudge:\nThis means I cannot let you indict the witness. Unfortunately... This ends the cross-examination of Mr. Frank Sahwit.\n\nSahwit:\nI come all the way down here to testify, and look what happens! You treat me like a criminal! A criminal! You lawyers are all slime!\n\nPhoenix:\n(Grr! I almost had him! Sorry, Larry... I failed you. There's nothing I can do about it now...)\n\nMia:\nNot so fast, Mr. Sahwit!\n\nPhoenix:\nMia! I mean, Chief!\n\nMia:\nListen up, Wright! Don't throw this one away, not like this! Think!\n\nPhoenix:\nBut, Chief, it's over. I can't prove the clock was slow the day of the murder! Nobody can prove that!\n\nMia:\nUm... well, yes. But that doesn't mean you can't still win! Try thinking out of the box! Don't waste time doubting the facts. Assume the clock was three hours slow and... Think through it! Ask yourself, 'Why was the clock three hours slow'? Figure out the reason, and you'll have your proof! Right, Wright? Can you think of a reason as to why the clock would be three hours slow?",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Yes",
        "is_correct": 1, 
        "response": "Phoenix:\n... Wait! Maybe I can prove it!\n\nMia:\nYou must have evidence somewhere that can prove it, Wright! Find it and let them have it!\n\nJudge:\nWell, Mr. Wright? You say the clock was already running slow on the day of the murder... Have you found evidence to support this claim?\n\nPhoenix:\nOf course. There is a piece of evidence in the Court Record that can prove my claim beyond a doubt!\n\nSahwit:\nHah! Tough words! Let's see you pull this one off!"
      },
      {
        "choice": "No",
        "is_correct": 1, 
        "response": "Phoenix:\nH-how am I supposed to know that!?\n\nMia:\nI know you can figure it out! There must be some evidence in the Court Record... Something that can show why that clock was three hours slow! Find it, and he won't have a foot to stand on!\n\nJudge:\nMr. Wright?\n\nPhoenix:\nY-y-yes, Your Honor!\n\nJudge:\nYou say the clock was already running slow on the day of the murder... Do you have evidence to prove this?\n\nPhoenix:\n(This is it... all or nothing!) Yes, Your Honor. I believe I have the evidence that can prove my claim!\n\nSahwit:\nHah hah! I'd like to see THAT!"
      }
    ]
  },
  "12":{
    "context": "Judge:\nLet's see this evidence that proves why the clock was running slow!",
    "category": "present",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "present": 
	  {
		"correct_present": ["Passport"],
		"correct_present_response": "Phoenix:\nTakethat",
		"wrong_present_response": "Phoenix:\nTakethat\n\nJudge:\nUm, excuse me. This proves your claim... how? I can't see what that evidence has to do with the clock.\n\nPhoenix:\n(D'oh! That wasn't it!) One more chance... Give me just one more chance!\n\nJudge:\nAlright, Mr. Wright, but time is not on your side. Be quick about it."
	  }
  },
  "13":{
    "context": "Phoenix:\nThe victim had just returned home from abroad the day before the murder. As we all know, the time difference between here and Paris is nine hours! When it's 4:00 PM here, it's 1:00 AM the next day there. The clock wasn't three hours slow, it was nine hours fast! The victim hadn't reset her clock since returning home! That's why the time you heard when you struck her dead in her apartment was wrong! Proof enough for you, Mr. Sahwit? Or should I say... Mr. Did It!\n\nSahwit:\nNgh! ...!\n\nJudge:\nO-order! Order, I say!\n\nJudge:\nWell... This case has certainly turned out differently than we all expected. Mr. Payne... your witness?\n\nPayne:\nHe... er... he was arrested and has been taken away, Your Honor.\n\nJudge:\nVery well. Mr. Wright?\n\nPhoenix:\nYes, Your Honor.\n\nJudge:\nI have to say, I'm impressed. I don't think I've ever seen someone complete a defense so quickly... and find the true culprit at the same time!\n\nPhoenix:\nThank you, Your Honor.\n\nJudge:\nAt this point, this is only a formality, but... This court finds the defendant, Mr. Larry Butz...\n\nNot Guilty\n\nJudge:\nAnd with that... The court is adjourned.\n\nPhoenix:\nIt turns out that Frank Sahwit was a common burglar! He posed as a newspaper sales-man to check and see when people were out of the house! That day... When Larry went to her apartment, the victim wasn't home. After he left, Mr. Sahwit let himself in to do his dirty work! While he was searching her place, the victim returned! Flustered, Mr. Sahwit grabbed the nearest blunt object he could find...\n\nAugust 3, 2:32 PM\nDistrict Court\nDefendant Lobby No. 2\n\nPhoenix:\n(Whew... I still can't believe we won!)\n\nMia:\nWright! Good job in there! Congratulations!\n\nPhoenix:\nTh-thanks, Chief. I owe it all to you.\n\nMia:\nNot at all, not at all! You fought your own battles in there. It's been a while since I've seen a trial end on such a satisfying note!\n\nPhoenix:\n(I've never seen the chief looking this happy... If she's this glad, imagine how Larry must feel!)\n\nButz:\nMy life is over...\n\nPhoenix:\nLarry! You're supposed to be happy! What's wrong now!?\n\nButz:\nAww, Nick... Don't worry 'bout me! I'll be dead and gone soon!\n\nPhoenix:\nGood! Wait, no! I mean... Bad! Bad bad bad! Larry, you're innocent! The case is closed.\n\nButz:\n... But... but my Cindy-windy's gone, man! Gone forever!\n\nPhoenix:\n(Larry, she was a... Nah... Never mind.)\n\nMia:\nCongratulations, Harry!\n\nButz:\nH-Harry...?\n\nMia:\nYes, you! I can practically see the headlines now: 'Harry Butz, Innocent!'\n\nButz:\nHeh... um... thanks! I really owe you one. I won't forget this, ever! Let's celebrate! Dinner? Movie? My treat!\n\nMia:\nOh, no, I couldn't.\n\nPhoenix:\n(Hey, I was the one who got you off the hook!)\n\nButz:\nOh, hey! H-here, take this! It's a present!\n\nMia:\nA present? For me? Wait... Wasn't this the evidence that...\n\nButz:\nActually, I made this clock for her! I made one for her and one for me.\n\nMia:\nR-really? You? You made this? ... Well, thank you. I'll keep it as a memento.\n\nButz:\nYo, Nick... Can you believe it? I was so into that chick... And... and she was just playing me for a fool! Don't that make you wanna just cry? *sob*\n\nPhoenix:\nLarry...\n\nMia:\n... Are you so sure?\n\nButz:\nEx-squeeze me?\n\nMia:\nI think she thought quite a lot of you, in her own way.\n\nButz:\nNah, you don't gotta sympathize with me, 'sokay.\n\nMia:\nOh, I'm not just sympathizing, really. Isn't that right, Wright? Don't you have something to show your friend? Something that proves how she felt about him?\n\nPhoenix:\nH-huh? Oh, yeah, right! (What the heck is she talking about?)",
    "category": "present",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "present": 
	  {
		"correct_present": ["Statue"],
		"correct_present_response": "Phoenix:\nTakethat\n\nPhoenix:\nCheck this out, Larry. Proof Positive you weren't just some chump to her.\n\nButz:\nHuh...? What about that clock?\n\nPhoenix:\nThis is the clock YOU made for her, Larry! And she took it with her when she traveled.\n\nButz:\nWhatever. She probably just needed a clock, that's all.\n\nPhoenix:\nYou think so? It's a pretty heavy clock to take traveling.\n\nButz:\n...\n\nPhoenix:\nWell, make of it what you will.\n\nButz:\n... Hey, Nick. I'm glad I asked you to be my lawyer. Really, I am. Thanks.\n\nPhoenix:\n(Hope that made him feel a little better...)",
		"wrong_present_response": "Phoenix:\nTakethat\n\nPhoenix:\nHere you go, Larry. Proof.\n\nButz:\n... Eh... heh heh? It's okay, Nick. Don't worry about me. I'll forget about her soon enough. Look, I'm gonna head home. Thanks a ton, eh?\n\nPhoenix:\n(Guess that wasn't the right thing to show him...)"
	  }
  },
  "14":{
    "context": "Mia:\nWright? I hope you see the importance of evidence now. Also, hopefully you realize, things change depending on how you look at them. People, too. We never really know if our clients are guilty or innocent. All we can do is believe in them. And in order to believe in them, you have to believe in yourself. Wright... Listen. Learn. Grow strong. Never let go of what you believe in. Never.\n\nMia:\nWell, I think our work here is done! Shall we be off?\n\nPhoenix:\nYeah, I guess so!\n\nMia:\nSay, how about dinner. On me? We'll drink a toast to innocent Butz!\n\nPhoenix:\nYeah!\n\nMia:\nOh, speaking of Harry... You were saying part of why you became a lawyer was because of him.\n\nPhoenix:\nEr, yeah. Part, at least.\n\nMia:\nYou'll have to tell me more about it sometime! Maybe... over drinks?\n\nPhoenix:\nAnd so, my first trial came to a close. Larry slapped me on the back and said, 'Gee, Nick, it's good to have friends!' But I'm pretty sure he's not going to pay us. Unless you count the clock he gave Mia. ... I didn't know it then... but that clock was soon going to be at the center of another incident. And my promise to tell the chief about me and Larry... would be one promise that I wouldn't be able to keep.",
    "category": "fin",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "actions": []
  }
}