[
  {
    "chapter": "Turnabout Trigger",
    "evidences": [
      {
        "currentChapter": "Turnabout Trigger",
        "name": "Prosecutor's Badge",
        "description1": "Proof of my profession. However, I prefer to keep it in my pocket."
      },
      {
        "currentChapter": "Turnabout Trigger",
        "name": "Newspaper Article",
        "description1": "A special report about President Di-Jun Wang. Click here for details."
      },
      {
        "currentChapter": "Turnabout Trigger",
        "name": "Steel Samurai Balloon",
        "description1": "Started out floating to the right of the lakeside stage, but has since been popped."
      },
      {
        "currentChapter": "Turnabout Trigger",
        "name": "Ms. Lloyd's Tape",
        "description1": "A recording of the president's speech. Two gunshots can clearly be heard."
      },
      {
        "currentChapter": "Turnabout Trigger",
        "name": "Bullet Trajectory",
        "description1": "Extrapolations from bullet trajectories suggest that the two shots were fired from the left side of the spectator area.",
        "description2": "Extrapolations from bullet trajectories suggest that Knight fired the shots that popped the balloon."
      },
      {
        "currentChapter": "Turnabout Trigger",
        "name": "Security Plan",
        "description1": "A diagram of the president's security arrangements. Almost certainly classified.",
        "description2": "A diagram of the president's security arrangements, which were changed only yesterday."
      },
      {
        "currentChapter": "Turnabout Trigger",
        "name": "Revolver → Assassin's Revolver → Mr. Knight's Revolver",
        "description1": "Found in a trash can on the left side of the spectator area. Fitted with a laser sight. Two spent bullets.",
        "description2": "Found in a trash can on the left side of the spectator area. Fitted with a laser sight. Two spent bullets. Used in the attempt.",
        "description3": "Found in a trash can on the left side of the spectator area. Two spent bullets. Same model as the victim's.",
        "description4": "Switched for the one found in the spectator area. Bullet markings match those of the bullet fired in the incident"
      },
      {
        "currentChapter": "Turnabout Trigger",
        "name": "Kay's Photograph → Kay's Photographs",
        "description1": "A photograph of the president at the exact moment the incident occurred. Click here for details.",
        "description2": "Three photographs taken before, during and after the shooting."
      },
      {
        "currentChapter": "Turnabout Trigger",
        "name": "Red Raincoat",
        "description1": "Seemingly discarded by the person in the red hood. Found under the Samurai Dog stand.",
        "description2": "Missing a button from the right sleeve. Its wearer has an injury on the left side of their body.",
        "description3": "There's blood on the inside. The person who was wearing it must have an injured left arm."
      },
      {
        "currentChapter": "Turnabout Trigger",
        "name": "Security Monitors",
        "description1": "Screens showing footage from in and around the aircraft. One monitor is missing."
      },
      {
        "currentChapter": "Turnabout Trigger",
        "name": "Bulletproof Attaché Case",
        "description1": "Designed to provide protection from gunfire. Knight and Rook were each issued one."
      },
      {
        "currentChapter": "Turnabout Trigger",
        "name": "Crime Scene Notes",
        "description1": "The victim bled to death from a gunshot wound to the torso. The bullet passed clean through his body."
      },
      {
        "currentChapter": "Turnabout Trigger",
        "name": "Bulletproof Vest",
        "description1": "Stopped the bullet that passed through the victim. The bullet itself was crushed flat by the impact.",
        "description2": "A prop used in the staged assassination attempt. The flattened bullet was also planted ahead of time."
      },
      {
        "currentChapter": "Turnabout Trigger",
        "name": "Calling Card",
        "description1": "Left behind by the assassin Shelly de Killer when he made his escape. Adorned with his distinctive seashell emblem."
      },
      {
        "currentChapter": "Turnabout Trigger",
        "name": "Bloody Bullet",
        "description1": "Found in a security monitor. This seems to be the bullet that killed Rook."
      }
    ]
  },
  {
    "chapter": "The Captive Turnabout",
    "evidences": [
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Prosecutor's Badge",
        "description1": "Proof of my profession. However, I prefer to keep it in my pocket."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Building Layout",
        "description1": "A map of the facility, including the detention center and the prison proper."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Mr. Knight's Body",
        "description1": "Cause of death: Stab wound to the throat. Death would have been instant. There is also a small cut on his scalp from when he suffered a blow to the head.",
        "description2": "Killed instantly by a stab wound to the throat. The body is covered in dirt. There is also a small cut on his scalp from when he suffered a blow to the head.",
        "description3": "Killed instantly by a stab wound to the throat. There is also a small cut on his scalp from when he suffered a blow to the head. A sweet scent can be detected."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Pocket Chess Set",
        "description1": "A folding chessboard with the pieces stored inside. It appears to have belonged to the victim.",
        "description2": "A folding chessboard with the pieces stored inside. It belonged to Knight, and was brought to him at his request by Saint.",
        "description3": "Portable folding chessboard. Belonged to Knight. There is a hidden space inside the chessboard.",
        "description4": "Knight hid a chisel in here to prevent it from being found by the prison staff."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Rubber Glove",
        "description1": "Only one glove was found at the crime scene. Prison-issued equipment for working inmates. Stained with blood and mud.",
        "description2": "Found in Workshop A. Used by Sahwit when he was doing his animal styling training. Stained with blood and mud.",
        "description3": "Found in Workshop A. Sullied after being worn by Sahwit when administering a dark mudpack treatment. Also bloodstained."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Rope",
        "description1": "Discovered on top of Knight's body. Does this mean the victim was tied up?"
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Bloodstained Sheet",
        "description1": "Colorful tarp found by the victim's body. Some of these were being stored in Workshop A."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Door Sensors",
        "description1": "Fitted to each workshop's door, they detect and react to the prisoners' bracelets by raising the alarm.",
        "description2": "They open the doors if an animal is detected, but raise the alarm if an inmate's bracelet is detected. Prisoners are not allowed to move about freely."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Prison Roll Call",
        "description1": "Held three times a day: 7 AM, noon, and 9 PM. The victim's body had not been found at the time of the 7 AM roll call."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Black Dog",
        "description1": "Sahwit claims to have seen this dog biting the victim's throat. He doesn't seem to like me very much."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Sahwit's Bracelet",
        "description1": "Sahwit's bracelet is broken, and can no longer be detected by the prison's sensors.",
        "description2": "Sahwit's bracelet wasn't working at the time of the incident, and could not be detected by the sensors."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Dog Chess Piece",
        "description1": "Carved for fun by Kanis. He also seems to be engaged in correspondence chess via postal mail."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Prison Search",
        "description1": "Winner, Gavèlle and the warden searched the prison for the murder weapon, but couldn't find anything."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Wiped Floor",
        "description1": "There are signs that the floor in the victim's detention center cell was wiped clean.",
        "description2": "There are signs that the floor in the victim's cell was wiped clean. I've ordered a test to see if it was blood.",
        "description3": "There are signs that blood was wiped from the floor of the victim's cell. We're currently checking whose blood it is.",
        "description4": "There are signs that blood was wiped from the floor of the victim's cell. The blood has been confirmed as Knight's."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Chess Diagram",
        "description1": "The positions of the pieces match those on the board in Kanis's cell.",
        "description2": "Knight was playing correspondence chess against Kanis. Did the two have some sort of connection?"
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Security Camera Footage",
        "description1": "Footage of a detention center holding cell showing the victim being attacked by a dark form.",
        "description2": "The time stamp is off due to a three-hour gap in the footage. This was actually recorded around 9 AM."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Missing Guard Uniform",
        "description1": "Stolen from a guard's locker in the detention center corridor on March 26th."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Mr. Knight's Cell Key",
        "description1": "A guard was attacked and his keys, including the one to Knight's cell, were stolen. They have yet to be recovered.",
        "description2": "A guard was attacked the day before the murder, and his keys were stolen. They were found in Carcerato's possession."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Security Gates",
        "description1": "Deployed at the entrances to both the detention center and the prison proper. Capable of detecting items made of metal."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Tunnel Prints",
        "description1": "A photo of the tunnel between the prison and the detention center. It seems to depict the paw prints of a dog.",
        "description2": "A photo of the tunnel between the prison and the detention center. Shows paw prints made by a bear."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Autopsy Report",
        "description1": "The interim report suggests that the cause of death was a stab wound to the neck, inflicted by a sharp blade. Death was instantaneous.",
        "description2": "Estimated time of death is between 3 AM and 6 AM on the 27th. Instant death from a stab wound to the neck."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Chisel",
        "description1": "Contains traces of blood. Hidden by Kanis inside his dog's mouth. Has a small bell attached to it.",
        "description2": "Belonged to Knight. Hidden by Kanis in Helmut's mouth in order to avoid suspicion."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Mr. Kanis's Bells",
        "description1": "Only two such bells exist. One is attached to Helmut the dog, the other to Kanis's knife, which was seized by the police during his arrest."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Mr. Saint's Trick",
        "description1": "A contraption that used the well, a very heavy weight, three pulleys, and two lengths of rope to send Saint flying during the show.",
        "description2": "Used during the show to send Saint flying. The weights were replaced with the victim's body by someone."
      },
      {
        "currentChapter": "The Captive Turnabout",
        "name": "Breakers",
        "description1": "Located in the power room, just off the prison yard. Were they tampered with the night before the body was found?"
      }
    ]
  },
  {
    "chapter": "Turnabout Legacy",
    "evidences": [
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Attorney's Badge",
        "description1": "Proof of my profession. Polishing it every day has become just another part of my daily routine."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Seal",
        "description1": "A seal that was found near the body when it was discovered. What could the design signify?"
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Crime Scene Notes",
        "description1": "Notes about the crime scene. The police have taken custody of the body."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Mr. Tangaroa's Teapot",
        "description1": "A Paul Halique piece with Tangaroa's fingerprints on it."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Contest Rules",
        "description1": "A piece of paper listing the rules for the contest."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Frame Finger Marks",
        "description1": "Someone left finger marks on the chocolate frame, but didn't leave any prints."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Mansion Key",
        "description1": "The one and only key that unlocks every door in the mansion. Tangaroa was in possession of it the entire time."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Salt Lamp",
        "description1": "Salt lamp found in Scone's room. Stained with the victim's blood."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Fake Confections",
        "description1": "Ms. Scone's so-called creations were all fake plastic models, covered in a thick layer of whipped cream."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Luminous Cloth",
        "description1": "Special color-changing cloth belonging to Scone. She has lost a roll of it, along with the device that powers it."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Chocolates",
        "description1": "Tangaroa's favorite, handmade by Bound. Rather misshapened, and incredibly sweet."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Instant Camera",
        "description1": "Takes photos that develop instantly. A new film cartridge has twenty exposures, but there are only three remaining."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Mr. Frost's Room",
        "description1": "A photo of Frost's sculptures, taken by Judy Bound.",
        "description2": "Two photos, one from Bound and one from Detective Badd."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Ms. Scone's Statement",
        "description1": "Frost's sculptures were \"scrumptious\", except for the lyre, which was salty."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Semifinal Entries",
        "description1": "Frost's and Gusto's creations had different designs, but tasted the same."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Ultimate Cookbook",
        "description1": "A book containing formulas for creating a cure for taste disorders and other chemical and pharmaceutical items."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Victim's Blood",
        "description1": "Frost's blood was found in the fountain, but not at the scene of the crime."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Family Photo",
        "description1": "A photo of Frost, Gusto, and their sons. Gusto's son visited his father daily up through the semifinal."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Prosecutor's Badge",
        "description1": "Proof of my profession. However, I prefer to keep it in my pocket."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "IS-7 Incident Case File",
        "description1": "Documents providing an overview of the IS-7 Incident.",
        "description2": "Documents received from Fender, including his comments in red."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Gallery Pamphlet",
        "description1": "A pamphlet received upon entry to the gallery."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Winter Wing Photo",
        "description1": "Statues matching those made by the victim eighteen years ago."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Pisces Statue Sketch",
        "description1": "A sketch by Larry depicting the Pisces statue exactly as he saw it."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Used Blowtorch",
        "description1": "There are signs it was used just before the police arrived. Possibly to heat something?"
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Luminous Cloth",
        "description1": "Cloth that glows when connected to a full-spectrum light-emitting device.",
        "description2": "Delicia Scone's property. One of these was lost eighteen years ago.",
        "description3": "Given to Bound by Scone. Lost eighteen years ago, only to be rediscovered floating in the fountain."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Poison Gas Ingredients",
        "description1": "The gas was produced when bright red Ubiquium and pure white Asphyxion were mixed together."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Ultimate Cookbook",
        "description1": "A book containing formulas for creating a cure for taste disorders and other chemical and pharmaceutical items."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Frame Finger Marks",
        "description1": "Finger marks left by someone in Tangaroa's room. No accompanying prints."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Salt Lamp",
        "description1": "A photograph of the murder weapon from the IS-7 Incident. It's a salt lamp stained with Frost's blood."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Family Photo",
        "description1": "A photo of Frost, Gusto, and their sons. Gusto's son visited his father daily up through the semifinal."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Teapot",
        "description1": "Designed by Paul Halique. One of Judy Bound's prize possessions."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Ceramic Fragment",
        "description1": "Found in a puddle of tea. The design looks familiar."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Lift Cart",
        "description1": "Used by Frost to transport ice eighteen years ago. The top of the platform is wet."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Larry's Sketches",
        "description1": "Sketches depicting exactly what Larry saw."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Gemini Case Analysis Results",
        "description1": "Results of the analysis conducted on the melted contents of the Gemini case."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Chocolates",
        "description1": "Handmade by Bound. Slightly melted after being kept in her pocket."
      },
      {
        "currentChapter": "Turnabout Legacy",
        "name": "Statute of Limitations",
        "description1": "A book explaining the statutes of limitations of various crimes."
      }
    ]
  },
  {
    "chapter": "A Turnabout Forsaken",
    "evidences": [
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Prosecutor's Badge",
        "description1": "Proof of my profession. However, I prefer to keep it in my pocket."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Yatagarasu Pin",
        "description1": "The Yatagarasu pin that Kay always wears."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Jammin' Ninja Mask",
        "description1": "A mask modeled on the Jammin' Ninja's face. Made of cheap plastic."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Letter",
        "description1": "A letter Kay was carrying. It is addressed to her."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Promise Notebook",
        "description1": "A book of promises Kay made to her father when she was a little girl. What was it doing in the Committee chamber?"
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Ticket Stub",
        "description1": "Stub from a ticket granting entry to the viewing platform on top of the Bigg Building."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Magenta Flower",
        "description1": "A magenta flower made of fabric that is usually worn on the chest as a decoration. Also known as a corsage.",
        "description2": "A magenta flower made of fabric that is usually worn on the chest as a decoration. Torn from the victim's clothes."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Bigg Building Pamphlet",
        "description1": "Contains a cross-section of the building and a plan of the viewing platform."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Kay's Recollections",
        "description1": "Kay remembers a person coming from beyond the concession stand and pushing her off of the building."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Candelabrum",
        "description1": "A three-armed candle holder that may have been the murder weapon, judging by the wounds to the the victim's chest.",
        "description2": "A three-armed candle holder found by the victim's body. Made to look like the murder weapon."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Keycard",
        "description1": "A keycard that grants entry to the Committee chamber. Found in the victim's hand."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Coroner's Findings → Autopsy Report",
        "description1": "Initial findings of Dr. Hilda Hertz. Cause of death: Stab wounds to chest. Head injury sustained post mortem.",
        "description2": "Death occurred as a result of a heavy blow to the head with a circular object. Chest wounds inflicted post-mortem."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Keycard Record",
        "description1": "Record of keycards used to enter the Committee chamber."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Victim's Letter",
        "description1": "A letter that appears to have been written to the victim by Kay."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Broken Plushie",
        "description1": "The stuffed animal we originally found in the Zheng Fa presidential plane. Missing its left horn.",
        "description2": "Fitted with a recording device that captured part of a conversation. One of the people recorded had a prominent burn."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Masks",
        "description1": "A selection of various masks was kept on a rack. Each participant in the auction wore one."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Ringleader's Appearance",
        "description1": "Ringleader wore a white jacket, white gloves, a magenta flower, and a mask. Age and gender could not be discerned.",
        "description2": "Ringleader wore a white jacket, white gloves, a magenta flower, and a mask. Also had a tattoo on the part of their face the mask didn't cover."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Ms. Hart's Picture",
        "description1": "A photograph of the mysterious figure in the red raincoat. Click here for details."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Ms. Hart's Statement",
        "description1": "Ms. Hart's observations about what happened during the mysterious auction."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Elevator Blood",
        "description1": "Blood was detected on the secret elevator. It looks like it dripped through to the floor below."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Clothes Box",
        "description1": "Box in which the killer hid the body. Traces of blood were detected inside."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Committee Chamber Blood",
        "description1": "Blood found in the Committee chamber. Was it placed there to hide the existence of the storeroom?"
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Red Raincoat",
        "description1": "Worn by the victim, whose fingerprints and blood were found on the hood."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "Nurse Niedler's Statement",
        "description1": "Niedler's description of how she swapped places with Rosie Ringer."
      },
      {
        "currentChapter": "A Turnabout Forsaken",
        "name": "IS-7 Incident Case File",
        "description1": "Details of a murder case from eighteen years ago."
      }
    ]
  },
  {
    "chapter": "Turnabout for the Ages",
    "evidences": [
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Yatagarasu Pin",
        "description1": "The Yatagarasu pin that Kay always wears.",
        "description2": "The Yatagarasu pin that Kay always wears. There was a bug hidden inside."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Forged Letter",
        "description1": "A letter written by an unknown person claiming to be Kay. Touch the Check Button for details."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Bigg Building",
        "description1": "Site of the underground auctions. There is an entrance to the hidden fifty-first floor on the roof."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Creature Feature Flyer",
        "description1": "Latest in the series after a twelve-year hiatus: \"Taurusaurus Vs. Gourdy\"."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Movie Set Locks",
        "description1": "The combination lock on the front gate was left untouched, while the side gate's chain was cut sometime last night."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Crime Scene Notes → President Wang's Autopsy Report",
        "description1": "Surrounded by shards of concrete. Flecks of something yellow stuck to clothes. Touch the Check Button for details."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Monster Footprints",
        "description1": "The concrete was broken and the earth exposed. But are they really footprints?",
        "description2": "The concrete was broken and the earth exposed. Did Excelsius Winner dig up the ransom money?",
        "description3": "The concrete was broken and the earth exposed after Excelsius Winner dug up President Wang's corpse."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Taurusaurus Head",
        "description1": "Modeled on the first generation Taurusaurus design. Seems like it fell from the roof of the on-set production trailer last night."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Taurusaurus Plushie",
        "description1": "Belonged to President Wang. It can record and play back sound."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Behind-the-Scenes Photo",
        "description1": "Photo taken yesterday. No monster footprints and no body were visible at that point."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Security Camera Footage",
        "description1": "Shows President Wang and Judge Gavèlle in front of the elevator on the roof of the Bigg Building.",
        "description2": "Shows President Wang and Judge Gavèlle arriving on the roof of the Bigg Building. There's no footage of the president riding the elevator down to leave."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Ms. Hart's Statement",
        "description1": "Ms. Hart was in the 51st-floor storeroom the night before last, but didn't see the president pass through."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Shaun's Rehearsal Tape",
        "description1": "Filmed yesterday evening. Shows Shaun rehearsing by a monster footprint."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Blue Truck",
        "description1": "Parked in front of the Bigg Building. Driver is nowhere to be found."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Mechanic's Gloves",
        "description1": "Meant for motorcycle maintenance, but currently covered in dirt for some reason.",
        "description2": "Excelsius Winner wore these when digging the monster footprints."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "IS-7 Incident Case File",
        "description1": "Details of a murder case from eighteen years ago. Touch the Check Button for details."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Report on Knight",
        "description1": "A report from Warden Laguarde to Chairman Winner about the connection between Knight and Kanis."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Knight's Possessions",
        "description1": "A pocket chess set and a ring. Found in the safe in the auction storeroom.",
        "description2": "A pocket chess set and a ring Knight made from his father's signature stamp."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Bug",
        "description1": "The person in the red raincoat planted this inside Kay's Yatagarasu pin."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Ms. Lloyd's Tape",
        "description1": "A recording of signals that were intercepted from the bug that was planted in Kay's pin."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Bouquet",
        "description1": "A bouquet of lion lilies given to President Wang by Judge Gavèlle. Recovered from on top of his body by Shaun."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Sedative",
        "description1": "Used on both Kay and Shaun during their kidnapping. Brand name is \"3 Zs\"."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "SS-5 Incident Case File",
        "description1": "12-year-old incident in which President Wang was kidnapped and the sole witness was murdered. Touch the Check Button for details."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Fire",
        "description1": "One of the children set the orphanage yard on fire as a prank sometime during the evening before the incident."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Mr. Aldown's Autopsy Report",
        "description1": "Victim was struck on the head and died at around 1 AM on February 10th."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Mr. Aldown's Final Call",
        "description1": "Message left on Rosie Ringer's phone detailing what Aldown saw."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Bloody Button",
        "description1": "Found clutched in Aldown's right hand. The blood is his."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Mr. Aldown's Photograph",
        "description1": "Shows the president being kidnapped. Only one picture was taken. Touch the Check Button for details.",
        "description2": "Staged photograph taken after Aldown was killed. Touch the Check Button for details."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Victim's Shoes",
        "description1": "Not actually Aldown's shoes. They appear to have been placed on his feet by the culprit after the murder took place."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Mysterious Blood Stain",
        "description1": "Left on the scene of the murder 12 years ago. The blood wasn't Aldown's."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Child's Drawing",
        "description1": "A picture drawn by the child who caused the fire during the incident 12 years ago. It depicts what he saw the night of the incident."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Correspondence Chess Diagram",
        "description1": "Sent to Bronco Knight by Bodhidharma Kanis. Printed rather than hand-written.",
        "description2": "Letter from Kanis retyped by the mastermind, and then sent on to Bronco Knight."
      },
      {
        "currentChapter": "Turnabout for the Ages",
        "name": "Lion Hot Air Balloon",
        "description1": "Smaller balloon used for promotional purposes. Saint is in charge of it and drives it around on the back of a truck."
      }
    ]
  }
]