{
  "previousContext": "Recipe for Turnabout\nTranscript\nPart 1\nPart 2\nPart 3\nPart 4\nEpisode 3Recipe for Turnabout\nJudge:\nThat's enough! This court sees no reason to further prolong the trial. This case is extremely clear. I see no room for misinterpretation of the facts.\nI-It wasn't me! I swear it wasn't me!\nJudge:\nThe evidence and testimony we have seen and heard are conclusive! The victim was alone at his table when he drank from that poisoned cup of coffee.\nNo! You're wrong! I know what I saw...! I saw... I saw...! I saw someone else there! A man. He's the real killer! Why won't anyone believe me?\nPayne:\nWell... I'd say that pretty much wraps this case up, wouldn't you... ...Mr. Wright!?\nJudge:\nThis court finds the defendant...\nGuilty\nJudge:\nThe court is adjourned.\nJanuary 6, 10:03 AMWright & Co. Law Offices\nMaya:\nAhh! The start of the new year always makes me feel like I can take on the whole world!\nPhoenix:\nI bet it does, Maya.\nMaya:\nSo! I've decided that our resolution should be... Zvarri! \"Take on the world!\" What do you think?\nPhoenix:\nSure, whatever, Maya... But I think maybe you've had more than enough mistletoe cake.\nMaya:\nNever! You've got to eat a lot of cake during New Year's! It's practically a tradition! Like watching the fireworks on TV or playing a board game.\n???:\nHEY, PAL!\nPhoenix:\nDetective Gumshoe...\nMaya:\nHappy New Year, Detective!\nGumshoe:\nUh... likewise... NOW LISTEN UP, WRIGHT! I WANNA...\nMaya:\nHere's to another fruitful year of lawyer-police cooperation!\nGumshoe:\nUm... Yeah... Me too... ALRIGHT, PAL! YOU'VE GOT SOME EXPLAINING TO...\nMaya:\nHave you got a holiday present for me, Detective?\nGumshoe:\nA what? Well... I, um... Here, have this. It-It's really nothing much, but...\nMaya:\nYay! Thanks!\nGumshoe:\nLOOK, PAL, WE NEED TO HAVE A TALK. TAKE A SEAT!\nMaya:\nHey! What about Pearly? You haven't forgotten her present, have you?\nGumshoe:\nAh... N-No... I mean, yes... I mean, no... Are you doing this on purpose?\nMaya:\nHa ha, guess I'm busted. How did you like my first practical joke of the year?\nGumshoe:\nVery funny, pal. Now let's see how funny you think it is when I show you this!\nPhoenix:\nWhat is it? A magazine?\nMaya:\nHey, I wanna see! \"Deadly Poisoning Brings Guilty Verdict. Defense Attorney Wright Trounced.\"\nPhoenix:\nTr-Trounced!? Let me see that! \"The defense attorney gave an almost childishly amateur performance yesterday...\" What the heck is this!?\nGumshoe:\nIt's a report, pal. About you!\nMaya:\nListen to this! \"Mr. Wright must take full responsibility for the ruling in this case.\"\nGumshoe:\nWELL!? And don't tell me you don't remember anything about it!\nPhoenix:\nBut I don't remember anything about it! When was that issue from anyway?\nGumshoe:\nUmm... December of last year, which I guess makes it last month.\nMaya:\nWhich makes it old news, you mean.\nPhoenix:\nBut I wasn't involved in a poisoning case in December!\nMaya:\nHmm, so what do you think this is all about, Nick?\nGumshoe:\nIf it wasn't you, pal, then that leaves only one possibility...\nMaya:\nNo way. You don't mean...\nPhoenix:\nA pho...\nMaya:\nA phony Nick!?\nPhoenix:\n(This must be Gumshoe's idea of a joke. Guess he's starting off the year with one, too...)\nMagazine Clipping added to the Court Record.\nGumshoe:\nSO!? What are you gonna do about it, pal!?\nPhoenix:\nWhat do you mean, what am I going to do about it?\nMaya:\nWell, it's your fault that the judge found the defendant guilty in this case!\nPhoenix:\nMy fault!? How do you figure that?\nMaya:\nBecause THE Phoenix Wright is super famous now! Well, maybe only sort of...\nGumshoe:\nYeah. See what happens when you hotshots start getting too full of yourselves?\nPhoenix:\n(But I didn't do anything wrong! ...At least, not that I can remember...)\nGumshoe:\nYou better make this right, pal. Now! And that means taking the case back to court. Got it?\nMaya:\nSounds like we've got our first case of the new year! Let's tackle it with gusto!\nPhoenix:\nI don't know... The judge already issued a guilty verdict once in this case. It's not going to be easy to get it overturned.\nMaya:\n... I guess that New Year's resolution is going to have to wait until next year.\nGumshoe:\nSo you're taking the case, right!? Good! I'm gonna head over to the courthouse then. After that, I'll go back to the precinct. Drop by if you need something, OK pal!?\nPhoenix:\n(I guess people are starting to know the name \"Phoenix Wright\". If a client entrusted a case to me based on my reputation... I guess I am kind of responsible. But why would someone want to impersonate me? What sort of a guy would do that?)\nExamine\nBookshelf\nPhoenix:\nDifficult-looking legal books stand in a formidable row. They mock me. ...Actually, I've neglected them for so long that they're covered in a layer of dust. I guess I should at least pretend to read them once in a while.\nCharley the plant\nPhoenix:\nCharley. A quite decorative plant. He's sort of a keepsake... something to remember Mia by. Sure, the office is a mess, but I never forget to water this little fella.\nDesk\nPhoenix:\nIt's my desk. I don't get to use it much, so it's still super neat and tidy from when Pearls cleaned it.\nMovie poster\nPhoenix:\nAn old movie poster. Apparently, this was the first movie that made Mia cry when she saw it, a long time ago. Maya watched it recently, and said she cried all night, too! ...Which, I guess, is why it's back up on the wall. I have to check it out one of these days.\nWindow\nPhoenix:\nThere is a giant building just outside the window. It's the Gatewater Hotel, a high-class, luxury hotel. The chain is getting so rich that they bought a whole chunk of the next town over... ...and started building a huge theme park. It's going to be called \"Gatewater Land\". ...I wonder if that bellboy is going to send me a greeting card this year, too?\nTalk\nWhat to do\nMaya:\nSo, what's our first move?\nPhoenix:\nI guess we go down to the detention center and talk--\nMaya:\nWait a sec, Nick. This person's behind bars because of you. Whoever it is isn't going to be jumping at the chance to meet you, right?\nPhoenix:\nHey, hey! Let's get one thing straight. It wasn't me, it was a fake me that did this!\nMaya:\nHmm, I wonder if he looks exactly like you... Your phony, Xin Eohp, I mean.\nPhoenix:\n(I hope not. *shudder* ...And what kind of name for an evil double is Xin Eohp anyway!?)\nMaya:\nAh! Nick! I've got it!\nPhoenix:\nIf you're going to ask whether I've got a twin brother, the answer is no.\nMaya:\n...Spoilsport.\nAny ideas\nMaya:\nDid you notice Gumshoe was acting weirder than usual, or was it just me?\nPhoenix:\nWhat do you mean?\nMaya:\nI mean, he was really worked up. Like a guy who's just found out he's going to be a dad or something.\nPhoenix:\nYeah, I guess he was acting kind of strange.\nMaya:\nMaybe he realized he's got strong feelings for you, Nick!\nPhoenix:\n... Considering how we interact, I seriously doubt that, Maya...\nMaya:\nWell, if he wasn't nervous because of you...\nPhoenix:\n...then maybe it's because of our new guilty client?\nPresent\nAttorney's Badge\nMaya:\nSo you've still got that badge, I see.\nPhoenix:\nHuh!? Well, I'm a lawyer, aren't I?\nMaya:\nYeah, but I guess I just didn't think you'd keep on being one for this long. You have to admit, you've had some close brushes with death because of your job.\nPhoenix:\n(...I fail to see how being a lawyer is more dangerous than channeling dead people.)\nMagazine Clipping\nMaya:\nI can't believe you've got an impersonator.\nPhoenix:\nI can't either. *sigh*\nMaya:\nAww, but look on the bright side. Only famous stars have people impersonating them!\nPhoenix:\nThis isn't funny, Maya. It's not just an impersonation. This guy stole my identity! And someone may have been wrongly convicted as a result.\nMaya:\n...Guess you should've gone into showbiz, huh, Nick?\nPhoenix:\n(...*sigh* I will never understand how your mind works, Maya.)\nMaya Fey profile\nPhoenix:\nSo? How's your spirit medium training going?\nMaya:\nWell... I stand under the rushing waters of the shower head every day.\nPhoenix:\n...That's called \"taking a shower\". What happened to the rushing waters of a waterfall?\nMaya:\nWell, I'm kind of taking a break... I'm having a bit of trouble right now, you know?\nPhoenix:\n(Last year's incident must still be on her mind... I haven't seen Maya train at all since that time. I think Mia said it's because Maya's at a loss these days...)\nMia Fey profile\nPhoenix:\nMia helped me out in court again last time.\nMaya:\nIt's so cool that you get to meet my sis like that.\nPhoenix:\nYeah...\nMaya:\nWe mediums lose consciousness when we're channeling, so I don't get to see my sis...\nPhoenix:\n...I never really thought about it that way. Hey! If you want to meet Mia... ...why don't we just have Pearls call her?\nMaya:\nNo... I couldn't do that. I'd be too worried about her.\nPhoenix:\n(I guess Maya's got all sorts of things to think about, too. ...Despite her immaturity saying otherwise.)\nGodot profile\nMaya:\nSo you still can't remember anything about Godot, huh?\nPhoenix:\nI already told you. I have no idea who he is, let alone why he dislikes me so much.\nMaya:\nWell he sure seems to have a problem with you for some reason. You'd better watch your back, Nick. Coffee lovers can be quite bitter.\nPhoenix:\nYou're just making that up, Maya!\nDick Gumshoe profile\nMaya:\nDigging up an old case that's already been ruled on... That's not like Gumshoe, is it?\nPhoenix:\nNo. He barely manages to stay on top of the cases in front of him.\nMaya:\nYeah, he's always busy, and gets dirt pay. I mean, look at that dusty old coat he wears!\nPhoenix:\n(Did you mean he \"gets paid dirt\" or do you really think they pay him in gravel?)\nAny other evidence\nPhoenix:\nDo you know anything about this, Maya?\nMaya:\nHmm... Even someone as worldly-wise as me doesn't know everything about everything, Nick. So I, the great Maya, am sad to say I can't tell you much about this object.\nPhoenix:\n(A simple yes or no, Maya... It's not as if you had to give me a dissertation...)\nAny other profile\nPhoenix:\nDo you know anything about this person?\nMaya:\nHmm... Even someone as worldly-wise as me doesn't know everything about everyone, Nick. So I, the great Maya, am sad to say I can't tell you much about this individual.\nPhoenix:\n(A simple yes or no, Maya... It's not as if you had to give me a dissertation...)\nJanuary 6Police StationCriminal Affairs Dept.\nMaya:\nIt's been ages since we came down to the precinct, huh, Nick?\nPhoenix:\nLooks like Gumshoe isn't around.\nMaya:\nHe's got it so easy, leaving everyone else to do the work!\nPhoenix:\nNo, he's been out there somewhere. My bet is on the courthouse. He's probably trying to arrange the retrial of this case.\nMaya:\nGuess that means we should go to the detention center and chat with our killer, huh?\nPhoenix:\nAfter being convicted without a fair trial, I'm not sure killer is the right label...\nExamine\nDetective on left\nPhoenix:\nThat must be one of the detectives. He's mumbling something to himself.\nDetective:\n\"Don't die running a red light. Die the old-fashioned way -- of old age!\" We have a winner! Inject a bit of humor, that's the key.\nPhoenix:\n... He must be coming up with slogans for a safety campaign. ...I guess?\nDesks\nPhoenix:\nThese are the detectives' desks. There are computers and files on each one. Funny, they're a lot tidier than I expected. I guess the detectives don't spend a lot of time at their desks.\nPoster\nPhoenix:\nA poster of a female police officer... Wait, no. That's the latest \"Babes in Uniform\" calendar. My bad.\nChief\nPhoenix:\nThis must be the chief of the detectives here. He's glued to his computer screen.\nChief:\nWHAT! Mask☆DeMasque turned up at the bank? What's he doing!? \"Hands up, you scalawags!\" \"You're under arrest!\" Hey! That's our job!\nPhoenix:\n(Looks like Ron DeLite's opted for a new career.)\nDetective:\nQuit surfing the net, Chief!\nChief:\nS-Sorry... I was just, um...\nPhoenix:\n(Things feel pretty tense in here...)\nBadgers\nMaya:\nHey, that's the police mascot, isn't it? It's so cute!\nChief:\nThat's the \"Blue Badger\". It was my idea! I made it! And now, it's the national symbol of the police force!\nPhoenix:\nSo what's with the pink one? It's new, right?\nMaya:\nShe's not an \"it\", Nick. She's a \"she\", right Chief?\nChief:\nYup. Meet the \"Pink Badger\".\nMaya:\nSo one's called \"Blue\", and the other's called \"Pink\", but they're both called \"Badger\"?\nChief:\nYou got it! They're both married.\nMaya:\nUmm... Mr. & Mrs. Badger seem to be cuffed together, Chief.\nChief:\nYou got it! That's marriage for you!\nPhoenix:\n(Whoa... A mascot that's deeper than the deepest of deep oceans...)\nJanuary 6Detention CenterVisitor's Room\nMaya:\nThis is so nerve-wracking, waiting to meet our new client. I wonder just what kind of person you tricked and got found guilty...?\nPhoenix:\nK-Keep it down, Maya! That kind of talk could ruin me!\n???:\nAaaaaaaah! How could you, Mr. Wright!? How could you do this to me!? They put me in solitary! I haven't been able to stop crying.\nPhoenix:\nA-Aren't... you...\n???:\nYes, I am! I am totally and utterly let down!\nMaya:\nAah! You're... Are you...?\n???\nDon't pretend you don't know me! It's me, Maggey, remember!? Maggey Byrde!\nPhoenix:\nMaggey Byrde... Ah! (Maggey Byrde... She's the policewoman I defended that one time. She was accused of murdering her lover. He was a cop, too.) What are you doing in here!? Didn't I get you acquitt--\nByrde:\nOh, sure! Very funny! After that fifth-rate defense job, you come in here and start making jokes!?\nMaya:\nYou better hurry up and tell her what happened, Nick.\nByrde:\nO-Oh... I see...\nPhoenix:\nSo that's where we stand right now.\nMaya:\nI'm sorry you've been caught up in another murder...\nByrde:\nMy whole life has been nothing but a whirlwind of bad luck and failures.\nPhoenix:\n(I vaguely remember her saying the exact same thing last time...)\nByrde:\nBut I don't mind! What's one more disaster in my life? At least now the real Mr. Wright is here with me. I won't let the world keep me down, sir!\nExamine\nSurveillance camera\nPhoenix:\nSmile, you're on candid camera.\nGuard\nPhoenix:\nThis guard monitors the visitor's room. I bet they don't get too many waitresses in here. He looks like he's getting a bit restless.\nTalk\nMaggey Byrde\nMaya:\nSo, how come you're dressed like that, Maggey? Last year you looked so sharp in that police uniform.\nByrde:\nHmph. I was fired after that... incident last year.\nMaya:\nOh. I'm sorry.\nByrde:\nIt's OK. I don't mind one bit. I enjoyed being on the force, but I think it was time for me to move on.\nMaya:\nSo, what do you do now?\nByrde:\nIn the second act of \"The Life of Maggey Byrde\", I'm playing the role of a waitress!\nMaya:\nA waitress!?\nByrde:\nYes. In a French restaurant. It's a small place, but it's quite fashionable. My charming smile and shapely figure came through for me. And the owner, Mr. Armstrong, hired me straight away, sir.\nPhoenix:\nAnd then you got into this mess straight away, right?\nByrde:\nYeah, you could put it that way...\nWhat happened\nByrde:\nThis whole mess started on the 3rd of last month... And it happened at Trés Bien.\nMaya:\n\"Treh Bee-an\"...?\nByrde:\nYes. It's a restaurant where good service and a friendly smile are always included!\nMaya:\nOh...\nByrde:\nThere were two men at the table, both drinking coffee. And then... One of the men slipped some poison into the victim's cup! The victim took just one sip and was gasping for air! I was so shocked, I passed out.\nMaya:\nHey, hold on there, Maggey.\nByrde:\nWhat?\nMaya:\nYou keep calling the guy, \"the victim\". Didn't you know the guy who was killed?\nByrde:\nNot at all! I'd never even seen the guy before!\nMaya:\nOh...\nPhoenix:\n(So she wouldn't have a motive to kill him then, I guess...) And the other man, the killer. You saw him, right?\nByrde:\nOf course! A good waitress must be attentive to the clientele.\nPhoenix:\nSo, you saw the killer, but you were found guilty of the crime anyway? How come?\nByrde:\n......... You tell me, Mr. Wright!\nPhoenix:\nAck! (Guess the answer to my question is \"my phony\"... Anyway, she saw the killer. Better see if I can get a description of the guy.)\nGuilty verdict (appears after \"What happened\")\nMaya:\nSo, if you saw the murderer, why were you still convicted?\nByrde:\nBecause no one else saw.\nMaya:\nSaw what?\nByrde:\nThe other man. The one who put the poison in the victim's coffee. Everyone testified that way. Mr. Armstrong, the customer... Everyone. \"The victim was sitting alone at his table the whole time.\"\nPhoenix:\nBut how's that possible?\nByrde:\nI don't know. But nobody, not one person, would believe me, sir. Even Phoenix Wright, my one last hope for a fair trial, failed me. What a pathetic defense! My granny could've done a better job!\nPhoenix:\nLook! That wasn't me, OK?\nByrde:\nAnd then! ...They found something a bit incriminating in my apron pocket.\nMaya:\nWhat?\nByrde:\nA small bottle... of poison.\nMaya:\nWHAT!? P-Poison!? It was in your pocket!?\nByrde:\nWell, I passed out when the victim collapsed. The killer must've slipped the poison into my pocket when I was unconscious.\nPhoenix:\nAnd no one else saw this other guy?\nByrde:\nNo, sir. That's what everyone said. But I don't see how they could've missed him...\nThe other guy (appears after \"Guilty verdict\")\nByrde:\nI was the one who took the coffee to the two men.\nPhoenix:\nO-Oh...? And what was your impression of them?\nByrde:\nWell... When I first saw them, I kind of thought they might be in the music industry.\nMaya:\nIn music? How come?\nByrde:\nWell, one of them had some sort of earpiece, and an emo musician's look about him. And there was a sample CD on the table, sir.\nMaya:\nAn earpiece and a sample CD, huh? Did you get a look at the CD at all?\nByrde:\nIt had a band's name written on it. I think it was \"MC\"-something. They must've been preparing for their debut, I guess.\nPhoenix:\nSo it was a band's CD. Maybe a promo disc?\nMaya:\nMaybe it was \"MC Screwdriver\"!\nPhoenix:\nGet serious, Maya. Would you buy the CD of a group named that?\nByrde:\nNngh... What was the name of that group again...? \"MC Hacksaw...\"? No... \"MC...\"\nMaya:\nAnd what about the killer? What did he look like?\nByrde:\nWell, I, um... I don't really remember. Only that he was a young man. Well-built like the victim, really.\nPresent\nAttorney's Badge\nByrde:\nThat badge! Is it real?\nPhoenix:\nOf course it's real!\nByrde:\nThat's what they all say. But I've been duped before. Give it to me for a sec!\nPhoenix:\nAh...!\n...*chomp!*\nMaya:\nShe... She bit into it...\nByrde:\nAnd I left a few teeth marks, too!\nPhoenix:\nI can see that...\nByrde:\nI just wish I could remember if that means it's real or a fake.\nPhoenix:\n*sigh* (I said it was real!)\nMagazine Clipping\nPhoenix:\nOh, yeah. I need to ask you about this...\nByrde:\nHey! This article's about my case!\nPhoenix:\nCan you tell me anything about the guy who was pretending to be me?\nByrde:\nYes, sir! It was the morning after I'd been arrested... I met you in the visitor's room here. You were wearing one of your super-sharp suits.\nPhoenix:\nMe?\nByrde:\nYes, you, Mr. Wright.\nPhoenix:\nArgh...\nMaya:\nHey, Maggey! Was my evil double Ayam here, too?\nByrde:\nNo. I don't remember a phony you, Maya.\nMaya:\nOh... *sigh* It would've been so cool...\nByrde:\nThen you got really worked up and passionate. \"I'm gonna get you' cleared'a dis crime!\" you said. (Changed from ['I'm gonna get you cleared of this crime!' you said.] in the original release)\nPhoenix:\nOK, I get the picture. But you've met me in person before... So how come you didn't realize that guy wasn't the real me?\nByrde:\n... I guess, looking back now, it was a little strange...\nPhoenix:\nOnly a little?\nByrde:\nWell, OK, so you were a bit taller than normal. And you looked a bit shady. And your voice was a bit weird. Oh, and you had this funny accent. And...\nPhoenix:\nSo the guy was nothing like me, then!?\nByrde:\nBut he had your spiky hair and blue suit.\nPhoenix:\n(... Is that all it takes for someone to imitate me...?)\nMaya:\nHow about everyone else in the courtroom, like the judge and the observers...? Didn't they realize he was an imposter?\nByrde:\nEveryone had these big question marks on their faces... But it seemed that no one wanted to say anything, sir.\nMaya:\nThis case just keeps getting weirder and weirder...\nMaya Fey profile\nByrde:\nThanks for your help last year!\nMaya:\nAw, it was nothing. I'm glad we got you off the hook.\nByrde:\nI hope you can help me out this year, too!\nMaya:\nYeah, me too. It's be sweet if we could get that verdict overturned.\nDick Gumshoe profile\nByrde:\nOh, Detective Gumshoe! He really looked out for me when I was on the force!\nPhoenix:\nHave you seen him recently?\nByrde:\nNo. He's never been to the restaurant.\nMaya:\nGuess he's not a fan of French cuisine, huh? He's an instant noodle type of guy, after all.\nByrde:\nYeah, he prefers the simple things in life.\nPhoenix:\n(...Or he's just simply too poor to afford anything else.)\nMaggey Byrde profile\nByrde:\nNo matter what happens, I never let anything get me down!\nMaya:\nYou're always so positive, aren't you, Maggey?\nByrde:\nMacho Maggey Byrde, they say! The early Byrde catches the worm! A Byrde in the hand!\nMaya:\nWow! All those phrases are named after you?\nByrde:\nAnd I never turn my back on anything!\nMaya:\nYou're always so strong, aren't you, Maggey?\nByrde:\nMacho Maggey Byrde, they say! I'm a tough old Byrde!\nMaya:\n\"Tough old byrde\", Nick! Hee hee! Do you get it?\nPhoenix:\n...Yeah, I get it.\nAnything else\nByrde:\nI know I used to be on the police force, sir. But I'm incarcerated, now. So I can't use my connections to help you. All I can tell you about now is info about ex-cons or the clientele of Trés Bien, sir...\nMaya:\nAww, don't let it get you down, Maggey!\nAfter clearing all Talk options and presenting Magazine Clipping:\nByrde:\nMr. Wright... Do you think it's possible to get a retrial?\nPhoenix:\nProbably. The court ruled in the absence of a genuine defense attorney. So we should be able to get a retrial.\nByrde:\nUm... Mr. Wright...?\nPhoenix:\n?\nByrde:\nDo you think we'll win next time? ...Sir?\nPhoenix:\n...!\nByrde:\nMy life has been a full course meal of bad luck, complete with defeat for dessert. Since I was 6 months old, when I fell from the 9th floor of my apartment building... ...I've been hit by all sorts of vehicles, gotten sick from all sorts of foods... ...failed at almost every test I've taken, experienced almost every kind of disaster... I even landed a phony lawyer when I had the misfortune of being accused of murder. But! I will survive! Because Maggey Byrde always lives to fight another day! And one day, I'll find it! Just you wait and see, sir! I'll find that one, single moment of good luck!\nMaya:\nArgh, Xin Eohp is really gonna pay for this!\nPhoenix:\nWh-What are you staring at me like that for...? (But Maya's right... Whoever it is that thought it was a good idea to use my name... ...and get an innocent girl convicted of murder had better watch out!)\nMaya:\nWe'll find him! Don't you worry. We'll get Xin Eohp for you!\nByrde:\nThank you! Oh! I'll tell you where Trés Bien is then!\nPhoenix:\nTrés... Ah, right. The restaurant where the murder took place.\nByrde:\nYes, sir. When you go, please tell Mr. Armstrong I said hi!\nMaya:\nSure! Alright, Nick! Let's go check out this restaurant and its food!\nJanuary 6Trés Bien\nMaya:\nWow! Look at this place.\nPhoenix:\n\"Look\"? More like \"smell\"... What is with the suffocating scent of flowers in here...? Then again, girls like that sort of thing, right?\nMaya:\nActually, I'm not all that into it...\nPhoenix:\n...\nMaya:\n... No one's coming to seat us. Maybe there's no one here.\nPhoenix:\nDon't be silly, Maya. This is a restaurant, and it's open for business. HELLO! ANYONE HERE? ... I don't believe it! There really isn't anyone here!\nMaya:\nPerfect! Let's get intrusive! If there's no one here, we can take anything we want!\nPhoenix:\n(Yeah, I suppose we can...)\nExamine\nCash register\nMaya:\nLook, it's one of those magical boxes that spits out money.\nPhoenix:\nYou know, you're the only person who would ever describe a cash register in that way!\nTrinkets\nMaya:\nLook at all the little trinkets tucked away in here.\nPhoenix:\nI bet Mr. Armstrong collected all of these personally. Let's see... A bouquet of flowers, some potpourri, and look! Fine bone china cups!\nMaya:\n... I never knew you were so... cultured.\nPhoenix:\nCome on, Maya! This is common knowledge! Any Joe Schmoe knows this much!\nFront entrance\nPhoenix:\nIt's the restaurant's front entrance. There's a sign hanging on the door written in French. It probably says, \"Open\" or \"Closed\". It must be one or the other, but I don't know which since I dunno Jacques about French.\nMagazine rack\nMaya:\nIt's a rack full of fashion magazines. And they're all in French.\nPhoenix:\nWhy don't you try wearing something a bit more \"chic\" something, huh, Maya?\nMaya:\nYeah. I guess I could. I'm always in my acolyte clothes, aren't I? It'd be fun to wear normal clothes every now and then.\nPhoenix:\nHm? There's something stuffed in behind the rack.\nMaya:\n...Looks like a sports paper to me. Hey, and look at this! Someone's scribbled a little doodle on one of the pages. \"MC Bomber\", and one, two, three, four, five zeros... A-A hundred thousand... dollars... maybe?\nPhoenix:\nI wonder what \"MC Bomber\" is supposed to be...? ! (This paper! It's from December 3rd...) This paper's from the day of the poisoning!\nMaya:\nWHAT!?\nSports Paper added to the Court Record.\nPhoenix:\n(A paper from the day of the murder... This has got to be a clue! I should see if I can find out some more about this paper...)\nMagazine rack (subsequent times)\nMaya:\nIt's a rack full of fashion magazines. And they're all in French.\nPhoenix:\nLooks like Mr. Armstrong doesn't get any newspapers.\nMaya:\nWell, it wouldn't exactly suit the feel of the place, would it?\nPhoenix:\nWhy don't you try wearing something a bit more \"chic\" like in these mags, Maya?\nMaya:\nYeah. I'd look stunning in some of those Parisian frocks, huh?\nPhoenix:\n(We found that sports paper behind this magazine rack earlier... I'd better try to find out everything I can about it...)\nTable\nPhoenix:\nThis table's set nicely. It just needs a customer.\nMaya:\nWhat do you think this flower is, Nick?\nPhoenix:\nLet's see... Well, it doesn't look like a tulip, and it's not a sunflower, I don't think...\nMaya:\nDuh. Even I could've told you that.\nPhoenix:\nWell, those are the only kinds of flowers I know. Dagnabit, I'm a lawyer, not a botanist!\nWindows\nPhoenix:\nWow! It's a beautiful winter wonderland out there.\nMaya:\nReally!? Cool! I love snow! Let me see! Huh? It's not white. It's not even snowing.\nPhoenix:\nGot you! I was only kidding, Maya.\nMaya:\nNick! There are lies that are OK to tell, and lies that definitely aren't.\nPhoenix:\n(...All I did was tell an itty-bitty white lie about nonexistent white snow.)\nPartition\nPhoenix:\nThis restaurant has partitions that separate the tables. When you're seated at a table, you can only see the tables to your right or left.\nCrime scene\nPhoenix:\nThis must be the table where the murder occurred.\nMaya:\nI guess so, with all this police tape all around it.\nPhoenix:\nAnd that stain must be from the poisoned coffee. Don't go licking the tablecloth, OK, Maya?\nMaya:\nWhy would I lick it? I'm not a cat, you know!\nPhoenix:\n(Then why can I picture you doing just that?)\nWright & Co. Law Offices\nPresent\nSports Paper\nMaya:\nHmm... \"MC Bomber\"...\nPhoenix:\nAnd don't forget the \"100,000\", too.\nMaya:\nThere's something about that name, \"MC Bomber\".\nPhoenix:\nYeah, It's a pretty unusual name.\nPhoenix:\nAnd don't forget the \"100,000\", too.\nMaya:\nEveryone's worried about bombs these days, I guess.\nPhoenix:\nI'm not sure that has any bearing on anything related to this case...)\nMaya:\nAnyway, we should really look into this some more!\nMaggey Byrde profile\nMaya:\nThis is Maggey's second time as a murder suspect, huh?\nPhoenix:\nYeah. The first time was a little over a year ago... She was on the police force back then.\nMaya:\nWasn't she working under Gumshoe? That does it, Nick! We're gonna get her off the hook or I'll give up hamburgers!\nDetention Center\nPresent\nSports Paper\nByrde:\nOh! A sports paper. Let's see, let's see... Did Gutsen Brawn manage to defend his heavyweight title?\nPhoenix:\nSorry, Maggey. That paper is actually a month old... It's from the day of the murder...\nMaya:\nAnd Gutsen got knocked out yesterday, I'm afraid.\nByrde:\nOh, no...\nPhoenix:\nI found this paper in the magazine rack at Trés Bien.\nByrde:\nReally? That's strange... Trés Bien doesn't get newspapers. Mr. Armstrong says he's not really fond of them.\nMaya:\nThen maybe one of the customers left it behind?\nPhoenix:\nAnyway, what I want you to take a look at is this scribble here.\nByrde:\nAh-ha! That's it, sir! \"MC Bomber\"! That was the name that was written on the CD!\nPhoenix:\n(Just as I thought...)\nMaya:\nI guess it wasn't \"MC Screwdriver\" after all, huh...\nByrde:\nSo, that $100,000 must be a down payment for a record deal, right?\nMaya:\nIf someone gave me $100,000, I'd sing for sure! \"The Master of Kurain\" or \"The Spirit Song\" or even \"Maya's Theme\"!\nPhoenix:\nUm, OK, Maya... So, if the sample CD was on the victim's table... That means this newspaper may have belonged to the victim!\nMaya:\nYou're right!\nPhoenix:\n(So the victim left this behind on the day of the murder, huh...)\nMaya:\nI think we better step up the investigation, don't you Nick?\nAfter presenting Sports Paper in Detention Center - Visitor's Room:\nJanuary 6Trés Bien\n???:\nOh là là! Bon-JOUR! Welcome to la Trés Bien!\nMaya:\nOh! Hel... lo... ...\nPhoenix:\n(What happened to Maya? She's frozen stiff...)\n???:\nBienvenue! Welcome to my petite restauranté!\nMaya:\nHuh? \"Bee Avenue\"?\n???:\nOh, non, my petite chulip!\nMaya:\nHuh? Me?\n???:\nLook at z'is face! Like la kitten rejected by its own mother. You are fatigued, non? Alors! You need z'is! An aromatic bath oil mélange of la néroli and la rose. My personal recommendation!\nMaya:\nYou think I need what...?\n???:\nOui, oui! Just add a couple of drops of z'is mixture to la bath water, and voilá! It will soothe your body and your mind. It's simply fantastique!\nMaya:\nReally?\n???:\nAnd for la monsieur!\nPhoenix:\nWho? Me?\n???:\nLook at z'at face! Like la puppy rejected by life itself! You are fatigued, non? For you, monsieur, I recommend z'is! Oil of bergamot. And maybe a 'int of... Oui, oui! I will add la peppermint and la clary sage for a fragrance exceptionnel! Such an invigorating recipe will bring out your delicious beauty, monsieur!\nPhoenix:\nM-My beauty!?\n???:\nAlors. If you will be seated, I will bring you la special menu of z'e day!\nPhoenix:\nActually, we're not here to eat. We're lawyers.\n???:\nMais bien sûr! I know z'is already, monsieur. You are la Phoenix Wright, non?\nPhoenix:\nUm, yes... You know me?\n???:\nMais, oui oui! I never forget a man who flirts wiz me! Especially in court!\nMaya:\nI guess he was cross-examined by our mysterious Xin Eohp...\nPhoenix:\nIt looks like everyone to do with this case knows who \"I\" am already.\nMaya:\nI wonder what sort of impression Xin Eohp's been leaving on people, don't you?\nArmstrong:\nAllow me to introduce myself to you again. I am Jean Armstrong. Enchanté!\nTalk\nTrés Bien\nMaya:\nSo what does \"Trés Bien\" mean? I know \"trés\". That means \"three\", right?\nArmstrong:\nNon, non, non! \"Trés Bien\" is Français! In English, you would say, \"Very Good\".\nMaya:\nOh. Very good...\nArmstrong:\nOui, exactement! La atmosphere is trés bien, and la cuisine is trés bien!\nPhoenix:\n(If the food's good, why aren't there any customers in here?)\nArmstrong:\nMy cuisine is not for all. Some people, z'ey do not appreciate la haute cuisine.\nPhoenix:\n(I thought everyone liked hot cuisine...)\nArmstrong:\nSince I 'ave lost Maggey, I do not 'ave enough 'ands.\nPhoenix:\nSo, you're running this place on your own now?\nArmstrong:\nOui. For la moment. No one 'as answered my advertisement. Oh, poor moi!\nPhoenix:\n(... Please don't eyeball me while you say that.)\nArmstrong:\nI am la chef. I am la manager. I am also a trained aromatherapist.\nMaya:\nA roaming what?\nArmstrong:\nA practitioner d'aromatherapy. La art of soothing la soul wiz z'e delicate floral aromas.\nPhoenix:\n(Delicate? The smell coming from that bottle earlier was anything but...)\nWhat happened\nPhoenix:\nSo, could you tell me what you know about the incident?\nArmstrong:\nBien. It makes me sad to remember it, yet I remember it so well. More z'an a month 'as passed since it 'appened.\nPhoenix:\n(Yeah, I guess it's been about a month since Maggey's sentencing...)\nArmstrong:\nSo. It was z'e third of last month. Just after one in z'e afternoon. A man who was in 'ere for a coffee suddenly became ill.\nPhoenix:\nBecause of the poison in his coffee?\nArmstrong:\nZ'at is la truth as I know it. It was Maggey who took 'is drink to 'im. I was in la kitchen. I 'eard z'e sound of someone collapsing. When I came out to see what it was, 'e was already slumped in 'is chair.\nMaya:\nHe was dead?\nArmstrong:\nMon dieu! Oui! 'E was dead! Maggey 'ad passed out also.\nPhoenix:\nAnd this man who died... Was he alone?\nArmstrong:\nOui, monsieur. All alone. I know z'at Maggey said z'ere was someone else, but...\nMaya:\nI see...\nArmstrong:\nLa police, z'ey asked me many times. \"Are you sure z'ere was no one else at z'e table?\" z'ey asked. But I am not z'e only one. La old man said z'e same thing.\nPhoenix:\nOld man? What old man?\nOld man (appears after \"What happened\")\nPhoenix:\nUm... So who is the old man that you mentioned?\nArmstrong:\nAt z'e time of la murder, z'ere was another customer in 'ere.\nMaya:\nWhat!? Someone else saw it?\nArmstrong:\nMais, oui! As usual, 'e came alone z'at day. At z'e time of la murder, 'e was 'ere. 'E saw it, too. But 'e said z'e same thing, z'at z'ere was no one else at la victim's table.\nMaya:\nBut Maggey swears there were two people!\nArmstrong:\nMais, mademoiselle. La lawyer, 'e could not prove z'is, non?\nPhoenix:\nAbout the lawyer. That was me, I suppose?\nArmstrong:\nMais bien sûr!\nPhoenix:\n... Wow! He's the first person who's said it wasn't me.\nMaya:\nDon't kid yourself, Nick! Hmph. Now who's the one making stuff up!?\nMaggey's motive (appears after presenting Maggey Byrde profile)\nPhoenix:\nWhen Maggey took the coffee over to the victim... ...did anything happen?\nArmstrong:\nOu... Oui. I-I suppose you could say so.\nPhoenix:\nSo what happened?\nArmstrong:\nNon. It was, er... It was nothing.\nMaya:\nLook, Maggey says she didn't even know the guy! But she's still been indicted for murder! The prosecution must have come up with some kind of motive!\nArmstrong:\nOui. It is true.\nPhoenix:\nIf there was anything at all between Maggey and the victim, it could be relevant.\nMaya:\nSo please! Tell us anything you know.\n3 PSYCHE-LOCKS\nPhoenix:\n(Psyche-Locks!?) (Changed from [A Psyche-Lock!?] in the original release)\nMaya:\nNo way! What are we going to do, Nick?\nPhoenix:\nWe'll just have to remov... WHAT THE!?\nMaya:\nWh-What's wrong?\nPhoenix:\nThe Magatama... It's gone!\nMaya:\nHuh?\nPhoenix:\nI had it in my pocket, but... It has vanished into thin air!\nMaya:\nWHAT!?\nPhoenix:\n(But I could see the Psyche-Locks. (Changed from [But I could see the Psyche-Lock.] in the original release) Maybe that means the Magatama's nearby...?)\nMaggey's motive (subsequent times)\nPhoenix:\nMaggey wouldn't just have put poison in the coffee of some guy she didn't even know. If she's really guilty, there must have been something between her and the victim.\n3 PSYCHE LOCKS\nArmstrong:\nN-Non. It was nothing. I am sure. Qué será, será. Perhaps Maggey 'ad another reason.\nPhoenix:\n(What's Maggey's motive got to do with this chef? Why is he hiding things from me? And another thing... Where did I drop the Magatama? The fact that I can see the lock [sic] must mean it's nearby.)\nMaya:\nI only loaned it to you, you know. So you better find it, Nick! OK?\nPhoenix:\n(...And here I thought it was mine to keep!)\nPresent\nAttorney's Badge\nArmstrong:\nPlease, monsieur. Z'ere is no need to show me z'at. You are Mon. Phoenix Wright, z'e worst defense lawyer in town.\nPhoenix:\n(I think I can imagine how he formed this completely wrong impression of me...) Um, the last time we met, did I show you this badge?\nArmstrong:\nOui. You flashed it to everyone in la restaurant!\nMaya:\nLooks like Xin Eohp is a bigger fan of flashing stuff than you are, Nick!\nMagazine Clipping\nArmstrong:\nI am not a lawyer myself. I do not wish to speak out of turn. But your defense in court z'at day was a little, how you say, \"lacking\", per'aps?\nPhoenix:\n*sigh*\nArmstrong:\nEven a Frenchman who cannot speak any English could 'ave done a better job! You were very cool, though. Oh, oui, oui! So 'andsome.\nMaya:\nWow, I wonder just how bad the defense could've been...\nArmstrong:\nEvery time you opened your mouth, z'e 'ole courthouse stirred.\nPhoenix:\n(Oh, man. That is something I don't want to imagine...)\nSports Paper\nPhoenix:\nWe found this sports paper in the magazine rack here.\nArmstrong:\nOne of my customers must 'ave left it behind.\nMaya:\nDo you have any idea which customer it was?\nArmstrong:\nZ'e only ideas I 'ave, mademoiselle, I save for my kitchen!\nMaya Fey profile\nArmstrong:\nOh là, là! You 'ave such a pretty smile, my petite chulip!\nMaya:\nWho, me?\nArmstrong:\nOui. La smile is the most important thing for us girls, n'est-ce pas?\nMaya:\nUm... Sure!\nArmstrong:\nIf you want a job 'ere, it is yours, precious!\nMia Fey profile\nArmstrong:\nMon dieu! What beauty!\nMaya:\nThat's my sister!\nArmstrong:\nAh, oui? Another delight! But you 'ave a certain je ne sais quois z'at I do not sense from your sister.\nMaya:\nI do?\nArmstrong:\nSo throw your head 'ead 'igh! Thrust out your feminine features! Do not lose 'eart, ma fille! You are a woman! A woman extraordinaire!\nMaya:\nDo I look like I need cheering up or something?\nMaggey Byrde profile\nArmstrong:\nMaggey was a policewoman once, n'est-ce pas?\nPhoenix:\nYes. But she had to quit for, um, reasons beyond her control.\nArmstrong:\nOui, oui. She was la suspect in la murder investigation, non?\nMaya:\nOh... You know about that?\nArmstrong:\nZ'at is why I gave to 'er la perfume for la 'appiness.\nPhoenix:\nHappiness perfume?\nArmstrong:\nOui. Blended from bergamot, like I 'ave given to you before.\nPhoenix:\nBut she's been arrested again. And found guilty this time.\nArmstrong:\nZ'is is true. 'Er natural aroma of un'appiness must 'ave been very strong.\nPhoenix:\n(Just admit it! Your perfume doesn't work!)\nArmstrong:\nI am not surprised she was la prime suspect. After something like z'at took place before my very eyes.\nMaya:\nSomething like what?\nPhoenix:\n(What's this guy talking about!?)\nMaya:\nDoes this mean... Maggey did have a motive?\nPhoenix:\nWe've got to ask this guy for more info, stat!\nJean Armstrong profile\nArmstrong:\nIt is 'ard to imagine, I know, but I was an apprentice for five years in la gay Paris.\nMaya:\nWow! In Paris!?\nArmstrong:\nIt was something la chef z'ere said to me z'at made me decide to open my own restaurant.\nPhoenix:\nWhat was it?\nArmstrong:\nZ'at awful man said to me, \"You must train for another ten years!\" Oh! It was such a shock! So unexpected! But you would 'ave to be a fool to do z'is, non?\nAnything else\nPhoenix:\nUm, about this...\nArmstrong:\nFélicitations! Mais... qu'est-ce que c'est?\nPhoenix:\nAck! Um... Je... Je no comprehend...\nMaya:\nNick! Don't just make something up!\nAfter clearing all Talk options:\nPhoenix:\nUm, Mr. Armstrong... Could I just confirm something with you again? The table where the victim was sitting... Was anyone else sitting there?\nArmstrong:\n... Z'at is a question you will 'ave to ask 'im yourselves.\nMaya:\nHuh? \"'Im\"?\nArmstrong:\nLa old man spends all of 'is time dans la parc.\nPhoenix:\nLa p-parc? Oh, a park? What park's that?\nArmstrong:\nBehind la restaurant. It is called, \"Vitamin Square\".\nMaya:\nThank you!\nArmstrong:\nJe vous en prie, my dear!\nMaya:\nLet's go check out this Vitamin Square right now, Nick!\nJanuary 6Vitamin Square\nMaya:\nSo this is Vitamin Square.\nPhoenix:\nYeah. I see where they get the name from now. The fruits scream \"VITAMINS!\" at you.\nMaya:\nHey, Nick! That's the guy, right? Isn't that the old man Mr. Armstrong was talking about?\nPhoenix:\nThat grouchy-looking grandpa?\nMaya:\nHe's throwing seeds out for the pigeons.\nPhoenix:\nMaya, he's not throwing seeds for them, he's throwing seeds AT them!\nOld Man:\n...\nPhoenix:\n(Ugh... My grumpiness-threat level has just been raised to red...)\nExamine\nSandbox\nMaya:\nI used to love sandboxes like you wouldn't believe!\nPhoenix:\nReally? You?\nMaya:\nSure. Finding iron filings in the sand with a magnet was my favorite thing to do.\nPhoenix:\nIron filings? Wow... That's too exciting for words.\nMaya:\nIt was my ambition to collect every single shred of iron in the sandbox. I was such a kid back then!\nPhoenix:\nSo, did you manage to get all the iron?\nMaya:\nNo, I never did. I think I came close, though. Come to think of it, I still have all the iron filings I found way back when. You want them?\nPhoenix:\nNo.\nFruit attractions\nMaya:\nThis place is so fruity!\nPhoenix:\nThat's not a bad thing. Besides, I love apples. They're among my favorites.\nMaya:\nThen that apple slide is perfect for you!\nPhoenix:\n... And what is so \"perfect\" about it?\nMaya:\nOh come on. Don't be a stick in the mud! Slide down it a few times. Go on! Woo!\nPhoenix:\nNo way! I'd get covered in sand if I slid down that slide. Anyone can see that.\nMaya:\nYeah, you're right. Otherwise, I'd give it a try, too.\nPigeons\nMaya:\nHey, look. Pigeons!\nPhoenix:\nYeah. And heaps of them, too.\nMaya:\nDid you know that pigeons are a symbol of peace?\nPhoenix:\nThat's a dove, not a pigeon.\nMaya:\n... Poor things. Just because they're gray means they can't be symbols of peace and harmony?\nPhoenix:\nYou're over-thinking this one by just a smidge, Maya.\nMagazine on orange-themed seat\nMaya:\nOoh, there's a magazine here.\nPhoenix:\nIt's a magazine full of job listings.\nOld Man:\nYou disgusting rogue, picking up something someone else threw away!\nPhoenix:\n\"Threw away\"? Did you throw this away? Are you looking for a job?\nOld Man:\nKah! That's none of your business!\nPhoenix:\nSorry! I guess I'll take the magazine with me then.\nOld Man:\nI don't want anyone else having it! Give it back!\nPhoenix:\n(Too bad. Now that you want it so bad, I don't want to give it up!)\nJob Listings added to the Court Record.\nOld Man:\nHey! That's mine!\nCloser orange-themed seat (after examining magazine on orange-themed seat)\nMaya:\nLooking at this orange reminds me...\nPhoenix:\nOf what?\nMaya:\nThat you're supposed to eat a lot of them to ward off colds in the winter. You can't have fun during the holidays if you're sick in bed, you know.\nPhoenix:\nYou don't have to tell me twice.\nTalk\nWhat you saw\nPhoenix:\nUm... Excuse me.\nOld Man:\n...\nPhoenix:\nWould you mind if I had a word with you?\nOld Man:\nYes!\nPhoenix:\nI just want to ask you a couple of questions...\nOld Man:\nWhat's the matter with you!? Can't you see I'm busy? So you don't like my seeds, eh, pigeons!?\nPhoenix:\n(He's really chucking those seeds at them! That's got to hurt!)\nOld Man:\nGo on! Eat this!\nPhoenix:\n(*sigh*)\nMaggey Byrde\nPhoenix:\nExcuse me, sir. Can I ask you about Maggey Byrde?\nOld Man:\nI don't know any Maggey Byrde!\nMaya:\nYes, you do. Maggey. The waitress at Trés Bien.\nOld Man:\nKah! It's a disgrace, I tell you. An utter disgrace!\nMaya:\nA disgrace?\nOld Man:\nAn innocent young girl revealing herself like that!\nPhoenix:\nRevealing!? You mean her uniform?\nOld Man:\nThe youth of today! They don't have any shame! No shame, I tell you! Not one ounce! Whatever happened to the old bushido values of Japan, like honor and modesty?\nMaya:\nWhat about me? I'm not wearing anything revealing.\nOld Man:\nYou!? Your problem is you lack any sense of grace!\nMaya:\nTalk about hitting a girl where it hurts...\nTrés Bien\nPhoenix:\nDo you go to Trés Bien a lot?\nOld Man:\nHmph! That miserable excuse for a restaurant? That garbage they serve in there's not food. Where's the sushi? The tempura? The rice!?\nPhoenix:\nTrés Bien is a French restaurant, sir...\nOld Man:\nWhere do you think we are, boy? In Paris!? I want real food, not those snooty snacks! And what about those shameless girls!?\nPhoenix:\nYou mean the waitresses?\nOld Man:\nYou can see all the way up to their... their... Yes! The waitresses! They're practically naked! It's a disgrace, isn't it? Well, isn't it!?\nPhoenix:\nListen, it's not my restaurant.\nOld Man:\nKah! It's a miserable excuse for a restaurant, that place! Miserable!\nPhoenix:\n(He certainly knows the place. He must be a regular! But if he hates it so much, why does he keep going?)\nTrés Bien regular (appears after \"Trés Bien\")\nMaya:\nAre you a regular at that restaurant, sir?\nOld Man:\n...\nMaya:\nIt's just, if you dislike it so much, why would you keep going there?\nOld Man:\n...\nPhoenix:\nSir?\nOld Man:\nThere you are, you filthy pigeons! You want food? Ha-ha! Take that!\nMaya:\nHe must be hiding something, right?\nPhoenix:\nIf he is, I should be able to see a Psyche-Lock... Oh, wait... I don't exactly have the Magatama right now, huh...\nMaya:\nRemember, Nick. That Magatama is only on loan. You better find it or else!\nPhoenix:\n(If Pearls ever gets wind of this, I'm going to be in a world of pain...)\nPresent\nAnything\nPhoenix:\nUm, excuse me, sir. Could I just ask you about this...\nOld Man:\n... Hmm, ha-hmm, hmm...\nPhoenix:\nSir?\nOld Man:\nHere you go, boy! How does some pigeon feed sound to you!?\nPhoenix:\n(This wasn't exactly what I was hoping to get out of this guy...)\nDetention Center\nPresent\nJob Listings\nMaya:\nUm, Maggey...\nByrde:\nOh, are you looking for some part-time work, Maya? Why don't you take a job at the restaurant? I bet Mr. Armstrong would hire you.\nMaya:\nReally? Me?\nByrde:\nIt's pretty cool being a waitress, you know. And in the kitchen, you'll get to see all of the chef's greatest secrets!\nMaya:\nWhat secrets...?\nByrde:\nYou can't make it obvious, but just spy on him for a bit. You'll see. It's interesting.\nMaya:\nWow! I can't wait to get my apron on now!\nPhoenix:\nYeah, he has a pretty intense aroma, too.\nMaya:\nSo did Mr. Armstrong really not see the killer...?\nByrde:\nApparently not. Well, he's in the kitchen all the time, so I guess it's possible that he didn't.\nJean Armstrong profile\nByrde:\nOh, so you met the owner, Mr. Armstrong!\nPhoenix:\nHe's, um... Oh, how can I put this... pretty unique, huh?\nByrde:\nHe has a really intense aura. As a chef and as a person.\nPhoenix:\nYeah, he has a pretty intense aroma, too.\nMaya:\nSo did Mr. Armstrong really not see the killer...?\nByrde:\nApparently not. Well, he's in the kitchen all the time, so I guess it's possible that he didn't.\nTrés Bien\nExamine\nCash register (after presenting Job Listings)\nPhoenix:\nIt's really tight behind the cash register counter. Can Mr. Armstrong even get in there? And if he got in... could he get out again?\nTrinkets (after presenting Job Listings)\nPhoenix:\nThere's a bunch of little trinkets on a shelf by the door. I bet Mr. Armstrong collected all of these personally.\nMagazine rack (after presenting Job Listings)\nPhoenix:\nIt's a rack full of fashion magazines. And they're all in French. Ugh. All the clothes in these are absolutely atrocious! ...Some of them have been circled in red. ... I really hope Mr. Armstrong is not thinking of buying those.\nTable (after presenting Job Listings)\nPhoenix:\nMr. Armstrong must be a pretty big neat-freak. He already has this table ready to go. Now if only the food in this place was edible...\nWindows (after presenting Job Listings)\nPhoenix:\nIt looks pretty cold out there on the streets. Peaceful, though. It's nice that people can take it easy after the holiday rush.\nCrime scene (after presenting Job Listings)\nPhoenix:\nThis must be the table where the poisoning occurred. The stain tells the story well. The whole area is still cordoned off with police tape. I guess it must still be under investigation.\nPresent\nJob Listings\nArmstrong:\nMademoiselle!\nMaya:\nY-Yes?\nArmstrong:\nAre you looking for la job?\nMaya:\nWhat!? N-No, no. I was just...\nArmstrong:\nLet me see. Your style is un peu différent, but you 'ave a good face.\nMaya:\n...Different?\nArmstrong:\nFélicitations! You 'ave passed! I will 'ire you! Bien! Come wiz me. I will teach you everyz'ing I know!\nMaya:\nN-Nick! HEEEEEELP!\nPhoenix:\n(I don't know whether to laugh or feel bad for Maya... Maybe I should do both...?)\nVitamin Square\nExamine\nSandbox\nPhoenix:\nWhen I think back to when I was young... ...I wonder what I found so great about playing in a sandbox. Maybe I'll come back here in the middle of the night one of these days to relive it. ... On second thought, being arrested by Gumshoe would be too embarrassing to bear.\nFruit attractions\nPhoenix:\nYou don't see many parks like this anymore. What a great place for kids to play. But that old man's the only one here, chucking his seeds at the pigeons.\nPigeons\nPhoenix:\nThe pigeons are so busy pecking at the seeds, they don't notice anything else. Seeing those birds eat with such intense focus... ...reminds me of Maya when she's scarfing down a burger.\nCloser orange-themed seat\nPhoenix:\nThis is where I found that job listings magazine before. A guy like me carrying around a magazine like that kind of gives the wrong impression. I guess I better give it back to that old man once this investigation's over.\nTalk\nMaggey Byrde\nPhoenix:\nExcuse me, sir. Can I ask you about Maggey Byrde?\nOld Man:\nI don't know any Maggey Byrde!\nPhoenix:\nYes, you do. You know, the waitress at Trés Bien.\nOld Man:\nHmph! If you ask me It's a disgrace! Th-That's what it is! An innocent young girl revealing herself like that!\nPhoenix:\nSo, you didn't like that kind of thing, then?\nOld Man:\n... Wh-What are you trying to say about me, boy!? Explain yourself!\nPhoenix:\nUm, nothing! I'm not saying anything about you...\nOld Man:\nI know your kind! You young ones with your spiky hair and your fancy suits! That heads of yours is over-flowing with filthy ideas!\nPhoenix:\n(...I know someone who needs to learn some stress management.)\nOld Man:\nGet out of here, you young brat!\nTrés Bien regular\nPhoenix:\nSo, you are a regular at that restaurant, right, sir?\nOld Man:\n...\nPhoenix:\nYou're always complaining about the place, so why do you go there?\nOld Man:\n...\nPhoenix:\nSir?\nOld Man:\nThere you are, you filthy pigeons! You want food? Ha-ha! Take that!\nPhoenix:\n(Something's not right about this guy... But If he's hiding something, I should be able to see a Psyche-Lock.) Oh, wait... (I don't exactly have the Magatama right now, huh... I need to find it before I can get anywhere with this old man.)\nAfter presenting Job Listings in Trés Bien:\nJanuary 6Detention CenterVisitor's Room\nPhoenix:\nLooks like they have Maggey in questioning. I guess I've asked her pretty much everything... I'll come back if there's anything else I need to ask her later.\nExamine\nGuard\nPhoenix:\nThis guard monitors the visitor's room. There's nothing for him to do right now, so he's catching some vertical z's.\nAfter presenting Job Listings in Trés Bien:\nJanuary 6Wright & Co. Law Offices\nPhoenix:\nPoor Maya. It looks like Mr. Armstrong's really taken a shine to her. I suppose I'll just have to let her work at the restaurant for a while. I'll go pick her up from Trés Bien once things have cooled off.\nAfter presenting Job Listings in Trés Bien:\nJanuary 6Police StationCriminal Affairs Dept.\nGumshoe:\nWell, pal!? Have you found the evidence yet!? The one that's gonna find her innocent!?\nPhoenix:\nUm, no. Not yet. We've only just started our investigation.\nGumshoe:\nWell, whatever you need to know, I'll give you the dirt on it. I'm putting off all my other cases for now, pal!\nPhoenix:\n(Gumshoe's really fired up about this...)\nGumshoe:\nOh, yeah! One more thing! The retrial's been approved. Court's sitting at 10 AM tomorrow. And Godot's gonna be the prosecutor...\nPhoenix:\n(Oh. ... Him.)\nGumshoe:\nNow, listen up, pal! If Maggey's found guilty again...\nPhoenix:\nY-Yes...?\nGumshoe:\nUm... I'll... I'll make sure you get locked up good for it, got it!?\nExamine\nDetective on left\nPhoenix:\nThat must be one of the detectives. He's mumbling something to himself.\nDetective:\n\"Hitting the gas is like hitting the fast-forward button on your life.\" No. That's too obscure. You don't really get the \"you'll die before your time\" idea. I need something more direct. Something a bit more light-hearted. Something like, \"Hitting the gas is your passport to paradise!\"\nPhoenix:\n... He must be coming up with slogans for a safety campaign. ...I guess?\nChief\nPhoenix:\nThis must be the chief of the detectives here. He's glued to his computer screen.\nChief:\nWHAT!? Poisoned coffee waitress gets a retrial!? I knew it! I knew there was something funny about the taste of this coffee! OK! Who brought me this coffee today? Hands up!\nPhoenix:\n(Yeesh! Have a little faith in your subordinates!)\nDetective:\nQuit surfing the net, Chief!\nChief:\nS-Sorry... I was just, um...\nPhoenix:\n(Things feel pretty tense in here...)\nBadgers\nPhoenix:\nNo matter what, whenever I come here, that mascot's there to greet me.\nChief:\nYou got that right. That's the \"Blue Badger\". It was my idea! I made it! And now, it's the national symbol of the police force!\nPhoenix:\nSo what's with the pink one? It's new, right?\nChief:\nYup. Meet the \"Pink Badger\".\nPhoenix:\nSo one's called \"Blue\", and the other's called \"Pink\", but they're both called \"Badger\"?\nChief:\nYou got it! They're married.\nPhoenix:\n(So should I expect to see Baby Badger next time I'm here...?)\nTalk\nMaggey Byrde\nPhoenix:\nSo the guilty party was Maggey Byrde, huh?\nGumshoe:\nYeah...\nPhoenix:\nBack when she was on the police force... ...you were her mentor when she was a rookie, right?\nGumshoe:\nYeah, I kept a close eye on her. I-I mean, not too close. You know.\nPhoenix:\n...\nGumshoe:\n...... ......... Hey, what's with the funny looks, pal? I was with her... It wasn't anything like... Look! Sure, I was her boss when she was doing her training. But that was it. Nothing happened.\nPhoenix:\n(Gumshoe sure is sweating up a storm over nothing... ...Ah, so that's it! Our big ol' Gumshoe has a little ol' crush on Maggey!)\nGumshoe:\nI... I don't like her or anything! I... I was... Aaaargh!\nPhoenix:\n(Note to self: Gossip with Maya about this later!)\nGumshoe:\nLook, pal! Don't tell anyone, OK!? You've gotta keep it a secret, got it!?\nPhoenix:\nS-Sure... And would you mind not guessing what I'm thinking all the time?\nGumshoe:\nHey, tell your face, pal, not me. You'd have to be blind not to see what's on your mind.\nThe victim\nPhoenix:\nSo I was wondering... Could you fill me in on the victim?\nGumshoe:\nGlen Elg, he was a computer programmer.\nPhoenix:\nI see. A programmer...\nGumshoe:\nHe was just a regular Joe working for a small-time computer firm. Maggey never had any contact with the guy before that day. ...And all she did was take him his coffee on the day of the murder, pal.\nPhoenix:\n(Yeah, Maggey also claimed to have never seen the guy before...) Did the victim go to the restaurant often?\nGumshoe:\nNot according to the chef. Said it was the first time he'd seen the guy.\nPhoenix:\n(A programmer... and a first-time customer at that...) (Changed from [A programmer... and a first-time customer...] in the original release) What possible reason could Maggey have had to kill a guy like that?\nGumshoe:\nThat's what I thought. But a motive was still somehow established in her trial.\nPhoenix:\nYou're kidding! What was her supposed \"motive\"?\nGumshoe:\nSorry, pal. I'm real busy. I haven't even got enough time to sift through these papers. Look into it yourself, OK?\nPhoenix:\n(What could this motive have been...?)\nThe investigation\nGumshoe:\nThis isn't really a proper investigation. I'm kind of working on it by myself.\nPhoenix:\nO-Oh, that's right...\nGumshoe:\nThe judge already ruled on the case, and all the evidence is in already. The only problem is with Maggey's testimony.\nPhoenix:\nYeah... Doesn't sound very good for us, huh?\nGumshoe:\nLook, pal. I've got a mountain of papers on this case to look over before tomorrow. So I'm just gonna say this... Maggey Byrde's no liar. She's... She's... OK, so she's a bit out there, and a bit off base sometimes. But she was a good cop.\nPhoenix:\n(That's not exactly complimentary, you know!) So what do you think really happened? And just how contradictory is her testimony?\nContradictions (appears after \"The investigation\")\nGumshoe:\nThe biggest problem with Maggey's testimony is the number of people at the table.\nPhoenix:\nYeah. My thoughts exactly. Maggey still insists there was another guy sitting with the victim.\nGumshoe:\nRight. But get this... Everyone else in the place says the guy was alone. Even the chef. And then there's that CD...\nPhoenix:\n(CD? Oh, yeah. She did mention something about a CD...)\nByrde:\nAnd there was a sample CD on the table, sir.\nGumshoe:\nBut our guys turned that place upside down. There was no CD.\nPhoenix:\nWhat?\nGumshoe:\nNot on the table. Not anywhere in the whole restaurant, pal.\nPhoenix:\nBut didn't Maggey say the victim was wearing an earpiece, too?\nGumshoe:\nYeah, but that was for the portable radio in the front pocket of his hoodie.\nPhoenix:\nA radio? He didn't have a CD player?\nGumshoe:\nYou got it. Your phony never explained that contradiction at all.\nPhoenix:\n(Come to think of it... The owner of Trés Bien didn't mention that CD either. I don't know why, but I get the feeling Mr. Armstrong's got something to hide...)\nThe charming chef (appears after presenting Jean Armstrong profile)\nPhoenix:\nSo what exactly is it that caught your attention about the chef at Trés Bien?\nGumshoe:\nIt's, um... kind of hard to say... The guy's probably not even connected with the case anyway...\nPhoenix:\nHey, come on, Detective. Didn't you say you'd give me the dirt on anything?\nGumshoe:\nWell, this sort of stuff is kinda... unimportant, gossipy stuff, you know pal? Look, how about this? You go to Trés Bien and investigate the place yourself. And if you find out anything suspicious about the guy... you report back to me, OK?\nPhoenix:\nUm... Don't suppose I get a choice in this, huh? (Guess I better find out more about the chef and Trés Bien; then report back to Gumshoe.)\nPresent\nAttorney's Badge\nGumshoe:\nIs that thing real, pal?\nPhoenix:\nWhy does everybody keep asking me that?\nGumshoe:\nI wonder what this phony of yours is like...\nPhoenix:\nHe had Maggey found guilty of murder. Doesn't that tell you? (I've got to track this creep down!)\nMagazine Clipping\nGumshoe:\nI wasn't at the trial myself. But I asked this one detective I know how your defense was.\nPhoenix:\nAnd what did he say?\nGumshoe:\nHe started off by saying, \"I'm at a complete loss for words...\" But he must have found some quick because he went on about how bad you were for an hour.\nPhoenix:\nBut...\nGumshoe:\nHe said you sucked so much, it seemed like you were trying to get Maggey found guilty!\nPhoenix:\n(It looked like I was \"trying to get Maggey found guilty\"...?)\nSports Paper\nGumshoe:\nWhat's that? A sports paper?\nPhoenix:\nYeah. I found it in the magazine rack at Trés Bien.\nGumshoe:\nIt's dated the same day as the murder. You may be onto something here.\nPhoenix:\nAnd take a look at this. See this writing here?\nGumshoe:\n\"MC Bomber\"... Hey!\nPhoenix:\nWhat is it?\nGumshoe:\nI've heard that name somewhere before. Yeah, \"MC Bomber\"...\nPhoenix:\n(Wow, he actually seems to be thinking for once!)\nGumshoe:\nAck, it's no good. I can't remember...\nPhoenix:\n(...And he goes back to being the Gumshoe we all know and love.)\nGumshoe:\nHey, pal. I'm gonna borrow this paper for a bit, OK? I wanna get a handwriting analysis done on this scribble.\nPhoenix:\n(Handwriting, huh? It'd be good to know more about that, in any case...)\nGumshoe:\nThanks, pal! I bet this'll turn out to be interesting clue!\nSports Paper given to Detective Gumshoe.\nMaya Fey profile\nGumshoe:\nHey! So how come she's not with you today?\nPhoenix:\nShe's working down at the restaurant right now.\nGumshoe:\nWorking, huh? Yeah, it's tough being broke. I would know.\nPhoenix:\nUm... OK...?\nGumshoe:\nNext time I see her, I'll show her how to make the world's best instant noodles. We low earners have to stick together! It's the only way!\nPhoenix:\n(Um... Why is he shaking my hand with such enthusiasm...?)\nMia Fey profile\nGumshoe:\nShe cross-examined me once, you know.\nPhoenix:\nWhat? Mia did?\nGumshoe:\nYeah. That was us. The big guns locking horns. Witness versus lawyer! It was a battle of cunning tactics and tricks.\nPhoenix:\n(But the witness isn't supposed to play any tricks...)\nGumshoe:\nI can't believe she's gone...\nGodot profile\nGumshoe:\nThat's the guy who's gonna be the prosecutor in Maggey's retrial tomorrow.\nPhoenix:\nO-Oh, really?\nGumshoe:\nHe was working on a bunch of more important cases at the moment... ...but he canceled them all just so he could take you on, pal.\nPhoenix:\n(Why's that guy so determined to see me fail?)\nGumshoe:\nYou sure attract a lot of attention, huh? Too bad it's all the wrong kind.\nDick Gumshoe profile\nGumshoe:\nI'm such a loser. I had high hopes for Maggey. I was gonna make her the best detective there ever was. But then all the sudden she was charged with murder and arrested. I never saw it coming. I never imagined they'd find her guilty. I hate myself for not being able to do anything.\nPhoenix:\nIt's OK, Detective Gumshoe. We still have a chance to make this right.\nGumshoe:\n... You know what? You're not such a bad guy after all, pal.\nMaggey Byrde profile\nPhoenix:\nHave you gone to see Maggey?\nGumshoe:\nOf course I have! But I... I wasn't much good at consoling her. I'm... I'm not very good with words.\nPhoenix:\nOh...\nGumshoe:\nYeah. I guess I must've looked a bit down. Maggey was really supportive of me. It was great to have someone to talk to.\nPhoenix:\n(Did he go for her, or for himself...?)\nJean Armstrong profile\nGumshoe:\nThe chef of Trés Bien, huh? You know what that chef said to me? \"Oh là là! Your body is full of la toxins.\" And then he gave me this bottle.\nPhoenix:\nWhat's in it?\nGumshoe:\nI don't know. The label says, \"Juniper\". I'm under orders to put a few drops of it in my bath every day.\nPhoenix:\nUnder orders?\nOld Man:\nYeah. You know, there's something about the lady... I mean, guy.\nPhoenix:\nHuh!? You can't stop thinking about him!?\nGumshoe:\nNot like that, pal! Gimme a break! He's not my type. I mean, I can't stop thinking that he's involved with this case somehow!\nPhoenix:\n(Sounds like he knows a little something more about our charming chef.)\nAnything else\nPhoenix:\nWhat do you make of this...?\nGumshoe:\nSorry, pal. All I can think about is Maggey at the moment. ... ...... N-No! I didn't mean it like that! I meant...\nPhoenix:\n(You don't have to explain... Really...)\nAfter clearing all Talk options and presenting Sports Paper in Police Station - Criminal Affairs Dept.:\nJanuary 6Trés Bien\nPhoenix:\nThe scent of flowers sure is strong. It's almost making me dizzy... Oh, um... Hello. (Who was that just now? A customer? She had sort of a dark aura about her...)\n???:\nAh! Welcome! Bee avenue!\nPhoenix:\n(Wow. What a cute voice.)\nMaya:\nOh, it's just you, Nick.\nPhoenix:\nM-Maya!\nMaya:\nWell? How do I look?\nPhoenix:\n... Maybe you should quit being a spirit medium...\nMaya:\nMaybe. But it's kind of boring being a waitress. I mean, you're my first ever customer.\nPhoenix:\n(Then who was that woman I just saw?)\nMaya:\nOh, oh! Since you're here, you might as well have something to eat!\nPhoenix:\n... I am kind of hungry, actually.\nTalk\nWaitress\nPhoenix:\nSo, how do you like your new job, Maya?\nMaya:\nI never knew there was so much for a waitress to do! Take people's orders, bringing them their food, make coffee, work the cash register... Of course, we need a customer before I can do any of that.\nPhoenix:\nYeah, it's a nice-looking restaurant. It's a shame more people don't come.\nMaya:\nDon't forget about the ultra cute waitress! Check out my \"gimme a tip\" smile!\nLunch special\nMaya:\nHey, Nick! Why don't you order something? The chef's preparing a tasty lunch set at the moment. Or so he says.\nPhoenix:\nHow much is it?\nMaya:\nIt's the Twin-T set. So it's 20 dollars, of course.\nPhoenix:\nThe Twin-T set? I believe I'll be taking a pass. It's kind of expensive.\nMaya:\nWhat!? But you can't! Come on, Nick! It's not every day I get to be a waitress! I want to try carrying plates and working the cash register!\nPhoenix:\nHow about cleaning the toilets? That should keep you busy.\nMaya:\nYeah, right! Maybe later.\nPresent\nAnything\nPhoenix:\nAbout this...\nMaya:\nSorry, Nick! I'm a waitress now. I've got a pile of work waiting for little ol' me.\nAfter clearing all Talk options:\nPhoenix:\nUm... About the lunch...\nMaya:\nOh! A fine choice, sir.\nPhoenix:\nNo. I, um...\nMaya:\nKITCHEN! A LUNCH SPECIAL, PLEASE! WITH ALL THE EXTRAS: DRINK, SIDE SALAD, DESSERT, AND GIFT!\nPhoenix:\nI don't need any of that!\nMaya:\nJust a moment, please, sir.\nPhoenix:\n(Maya's really getting into this! So how much is this set lunch, then? 20 dollars, huh? But with the drink, side salad, and dessert, it's... 45 dollars!?) Hey, wait a sec! Maya!\nMaya:\nSorry to keep you waiting, sir! Here you are, our deluxe Fortify lunch set!\nPhoenix:\nWhoa!\nMaya:\nA dish inspired by lobster and abalone fricassée with balsamic vinaigrette. Bon appétit!\nPhoenix:\nUm, thanks...?\nMaya:\nCome on, Nick! Hurry up and try it already!\nPhoenix:\n(Lobster, huh? Alright... Down the hatch it goes...) ... Urp!\nMaya:\nWell?\nPhoenix:\nAre you hungry, Maya?\nMaya:\nI'm starving!\nPhoenix:\nHere. It's yours.\nMaya:\nReally!? ... Urp!\nPhoenix:\nRemember, Maya. My wallet doesn't print money, so you'd better polish off that plate!\nMaya:\n... I-I've just remembered! I've got to clean the toilets!\nPhoenix:\nHey! (You can't be in that much of a hurry to clean the toilets!)\nTrés Bien Lunch Special added to the Court Record.\nPhoenix:\nHow does that guy manage to make good food taste so bad?\nMaya:\nHey, Nick... You want to take a peek at the kitchen?\nPhoenix:\n(The kitchen, huh? Not a bad idea.)\nTalk\nKitchen\nPhoenix:\nHmm, now what was it that Maggey said again? \"In the kitchen, you'll get to see all of the chef's greatest secrets!\"\nMaya:\nIn the kitchen? Mmm. That sounds tasty!\nPhoenix:\nHey, wait up! Maya!\nMaya:\nWhat is it? I'm pretty busy right now.\nPhoenix:\nWeren't you going to show me around?\nMaya:\nTsk. There goes my plan to find some cool clue and show it off in your face...\nPhoenix:\n(I'd better conduct the search in the kitchen myself!)\nAfter clearing \"Kitchen\" Talk option in Trés Bien:\nJanuary 6Trés BienKitchen\nMaya:\nAnd here it is! The famous Trés Bien kitchen! It's my first time in here too, actually.\nPhoenix:\n... There is a weird atmosphere in here, that's for sure.\nMaya:\nMr. Armstrong will be back soon, so we'd better search quickly! Chop, chop!\nExamine\nMirror\nMaya:\nNow THIS is one large mirror! I bet this is where he makes himself look pretty.\nPhoenix:\nThere's a book on the dresser. \"Claurice Armstrong's Bedtime Literature\".\nMaya:\nNot exactly Pulitzer Prize material, is it?\nPhoenix:\nIt looks like a collection of poems he's written.\nMaya:\nPoems? Cool! Read one out! And say it in your best French accent... with intensity! OK?\nPhoenix:\nOK, um... Here's one. Ahem! It's called, \"Printemps\". \"Zee two of zem, like actors from a film. Zee coffee still undrunk. Sweet nothings over too soon, on zat sad Sunday morning. Zee foolish cocktail so delicious. Take zee last sip of your tea and I know what I will do. I must lie to you. I must.\"\nMaya:\nHuh? That's it!?\nPhoenix:\nYup. That's a poem for you.\nOil bottles\nPhoenix:\nWhat's this? It looks like a treasure chest or something.\nMaya:\nWow! Look at all these little bottles!\nPhoenix:\nOh! They're aromatherapy oils! He's got so many, they're overflowing onto the floor...\nMaya:\nLet's see... 1, 2, 3... ...98, 99, 100! They're all the same, too. Hey, wait a minute...\nPhoenix:\nWhat is it?\nMaya:\nThere's one bottle that's different from all the others.\nPhoenix:\nWell what do you know. And it doesn't have a label either.\nMaya:\nAnd... *sniff* It doesn't smell.\nPhoenix:\n(So what's that liquid inside then, I wonder?)\nMaya:\nHey, Nick, we should borrow this. I mean, look how many bottles he's got. He won't miss one, will he?\nSmall Bottle added to the Court Record.\nOil bottles (subsequent times)\nPhoenix:\nWhat's this? It looks like a treasure chest or something.\nMaya:\nWow! Look at all these little bottles!\nPhoenix:\nOh! They're aromatherapy oils! He's got so many, they're overflowing onto the floor...\nMaya:\nLet's see... 1, 2, 3... ...98, 99, 100! They're all the same, too.\nLace curtains\nPhoenix:\nWhat are these lace curtains for?\nMaya:\nI don't know. But they give the place a real homey feel, don't they? Hmm... Lace curtains... You know, if I was a cooking pot, I'd be perfectly happy to sit on a shelf under those.\nPhoenix:\n(How do you respond to something like that!?)\nTable\nMaya:\nNow I know for sure I'm in a French restaurant. I've never heard of most of these seasonings. Hey, Nick! This container has... oyster sauce? What's that?\nPhoenix:\n(Isn't that used in Chinese food...?) Ack! Look! Right there on the counter!\nMaya:\nMy Magatama! What's it doing there!?\nPhoenix:\n(What indeed...)\nMagatama put into pocket.\nTable (subsequent times)\nMaya:\nNow I know for sure I'm in a French restaurant. I've never heard of most of these seasonings. Hey, Nick! This container has... oyster sauce? What's that?\nPhoenix:\n(Isn't that used in Chinese food...?)\nMaya:\nAnd look at these knives. They look really sharp!\nPhoenix:\nI'd like to see how one of those slices through a cheesecake.\nMaya:\nA cheesecake? You don't exactly need a sharp knife for one of those, Nick.\nStove\nMaya:\nMmm. That smells good. Something's bubbling away nicely in that pot. It must be the lobster and abalone fricassée with balsamic vinaigrette.\nPhoenix:\nIsn't that what I just ate for lunch?\nMaya:\nMaybe... What you ate is the only French dish I know the name of.\nAfter examining oil bottles in Trés Bien - Kitchen:\nJanuary 6Police StationCriminal Affairs Dept.\nGumshoe:\nHey, you're just in time!\nPhoenix:\nWhat is it, Detective Gumshoe?\nGumshoe:\nThe lab got back to me about that newspaper you gave me.\nPhoenix:\n(He must mean this sports paper with the memo scribbled on it...) So? What did they say? Did the analysis turn up anything?\nGumshoe:\nThey said the doodle was written by the victim, Glen Elg. No doubt about it.\nPhoenix:\n(I expected as much...)\nGumshoe:\nThe victim took the paper with him to the restaurant on the day of the murder. That's our best interpretation of the facts at the moment.\nSports Paper refiled into the Court Record.\nGumshoe:\n\"MC Bomber\"... I get the feeling I've heard that name somewhere before... Oh, well. I guess it'll come back to me. Don't forget to report back to me with whatever you find in the restaurant, OK, pal?\nPhoenix:\n(Since when did I start taking orders from Gumshoe...? Although... I get the feeling there's something I need to show him...)\nTalk\nArmstrong's secret (appears after presenting Small Bottle)\nPhoenix:\nSo what's Mr. Armstrong's secret?\nGumshoe:\nYou ever had lunch at Trés Bien, pal?\nPhoenix:\nUm... Yes...\nGumshoe:\nSo, how was it?\nPhoenix:\nTo put it nicely... it was inedible.\nGumshoe:\nHey, don't worry about being nice around me, pal. You and I both know the reason that place is so empty is because of the food. I mean, the place is clean, and he's got a girl like Maggey as a waitress, so...\nPhoenix:\nYeah... I guess it's probably the food.\nGumshoe:\nThe real scoop on the guy is he's up to his ears in debt.\nPhoenix:\nReally? How much does he owe?\nGumshoe:\nThis is a copy of his loan contract. He's about half a million in the red.\nPhoenix:\nH-Half a million? Are we talking dollars?\nGumshoe:\nYeah. Hey, if it was Sterling, he'd really be in trouble!\nPhoenix:\nSorry. That figure just took me by surprise.\nGumshoe:\nYeah, this case is full of surprises. And I'd be willing to bet that chef's got something to do with most of them. That's my hunch.\nJean's Loan Contract added to the Court Record.\nArmstrong's secret (subsequent times)\nPhoenix:\nSo what's Mr. Armstrong's secret?\nGumshoe:\nYou ever had lunch at Trés Bien, pal?\nPhoenix:\nUm... Yes...\nGumshoe:\nSo, how was it?\nPhoenix:\nTo put it nicely... it was inedible.\nGumshoe:\nHey, don't worry about being nice around me, pal. You and I both know the reason that place is so empty is because of the food. I mean, the place is clean, and he's got a girl like Maggey as a waitress, so...\nPhoenix:\nYeah... I guess it's probably the food.\nGumshoe:\nThe real scoop on the guy is he's up to his ears in debt.\nPhoenix:\nReally? How much does he owe?\nGumshoe:\nThis is a copy of his loan contract. He's about half a million in the red.\nPhoenix:\nH-Half a million? Are we talking dollars?\nGumshoe:\nYeah. Hey, if it was Sterling, he'd really be in trouble!\nPhoenix:\nSorry. That figure just took me by surprise.\nGumshoe:\nYeah, this case is full of surprises. And I'd be willing to bet that chef's got something to do with most of them. That's my hunch.\nPresent\nSports Paper\nGumshoe:\nSo according to the boys down at the lab, the doodles were probably made by the victim.\nPhoenix:\nProbably?\nGumshoe:\nAnalyzing this kind of writing is difficult since it's done with a fiber-tipped pen. But don't worry! I'll vouch for it.\nPhoenix:\n(Why would Gumshoe have to vouch for it? Can't it stand on its own?)\nSmall Bottle\nGumshoe:\nYou got one of those aroma bottles too, huh?\nPhoenix:\nOnly this one doesn't smell.\nGumshoe:\nHuh? I don't get you...\nPhoenix:\nThis was mixed in with all the other aromatherapy bottles, but it's not the same. It doesn't even look the same, wouldn't you agree?\nGumshoe:\nA cologne bottle that doesn't smell, huh? Smells like a skunk to me, pal! Mind letting me borrow that bottle for a while? I wanna send it to the lab for analysis.\nPhoenix:\n(The victim was poisoned, so the contents of this bottle are pretty important...)\nSmall Bottle given to Detective Gumshoe.\nGumshoe:\nI had a lunch there was something funny about that chef.\nPhoenix:\nYou suspect Jean Armstrong?\nGumshoe:\nI've got that guy's number. I know what his secret is.\nPhoenix:\n(That must be the same secret Gumshoe was talking about before.)\nGumshoe:\nI guess I'd better fill you in on the details. About this Armstrong guy's secret, I mean...\nJean's Loan Contract\nGumshoe:\nIt's for half a million dollars, pal! That's... um... half a million dollar bills!\nPhoenix:\n(What was the \"um\" in there for!?) Is there really that much money tied up in this case?\nGumshoe:\nI can't give you an answer on that, pal. Not without the case file in front of me. But I'll tell you this... That Armstrong guy would've done anything for cash. He was desperate, you know?\nPhoenix:\nNo, I don't. But I think I sort of get the picture.\nAfter examining table in Trés Bien - Kitchen:\nJanuary 6Vitamin Square\nPhoenix:\nHmm, the old guy's not here anymore. (Drat. And I still have some unanswered questions for him.)\nExamine\nMotor scooter\nLeads to:\n\"A scooter, huh?\"\nPhoenix:\nA scooter, huh? Who'd leave it right in the middle of the park like this? The wheel guard and the light are busted... I guess it must have been in an accident. It's totally wrecked.\n???:\nGwoaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaar! Hey! Whad'youse think youse doin' wit my bike!?\nPhoenix:\nN-No! I was just...\n???:\nGwoaaaaaaaaaaaar! Youse been messin' with my new ride? Is that what youse been doin'!?\nPhoenix:\nN-New ride? Isn't that kind of an old model?\n???:\nGwoar! Youse gonna pay for dis!\nPhoenix:\nIt-It wasn't me! I was just passing by.\n???:\nEy! Den who'z de one tat covered my saddle in crap!? Huh? Gwoar! Youse gonna pay, you' catch my drift!?\nPhoenix:\nNo! Wait a sec! I'm not a pigeon! So I couldn't have done it!\n???:\nA wise guy, eh? I atta beat you so hard, it'll feel like youse were smoochin' the express train!\nPhoenix:\n(Uh-oh!)\n???:\nYouse better watch your back! This ain't over! I'm gonna round up a group of lawyers and den youse gonna pay!\nPhoenix:\nUm... Actually... I'm a lawyer myself...\n???:\nWhad'youse say?\nPhoenix:\nI'm Phoenix Wright, attorney at law.\n???:\nGwoaaaaaaaah ha ha ha hah! Ha ha ha ha hah! Phoenix Wright? Youse sayin' YOU' Phoenix Wright?\nPhoenix:\nUm, yeah... I am.\n???:\nSo you' a wiseguy too, huh? Cause I'M Phoenix Wright. The one and only!\nPhoenix:\nWHAT!?\n???:\nOutta my way! I gotta cruise.\nPhoenix:\n(H-He's gone...) Surely that guy wasn't my phony... was he...? ... He wasn't anything like me!! (Guess I better make a note of the scooter...)\nScooter added to the Court Record.\n???:\nKah! Pathetic!\nPhoenix:\nOh, it's you.\nOld Man:\nA few threats from a little brat like that... ...and you look like a pigeon that's got seeds in its eyes.\nPhoenix:\nHave you been here the whole time then?\nOld Man:\nI was in that strawberry. I had some thinking to do.\nPhoenix:\n(More like you had some cowering to do!)\nTalk\nTrés Bien regular\nPhoenix:\nAre you a regular at that restaurant, sir?\nOld Man:\n...\nPhoenix:\nIt's just if you dislike it so much, why would you keep going there?\nOld Man:\n...\nPhoenix:\nSir?\nOld Man:\nThere you are, you filthy pigeons! You want food? Ha-ha! Take that!\n3 PSYCHE-LOCKS\nPhoenix:\n(I knew it... This old guy has got something to hide. But what could it be?)\nTrés Bien regular (subsequent times, before breaking Psyche-Locks)\nPhoenix:\nWhy are you a regular at a restaurant that you clearly hate, sir?\nOld Man:\nTake that, pigeons! See how you like these seeds!\n3 PSYCHE-LOCKS\nPhoenix:\n(It's no good. I'm gonna have to break his Psyche-Lock. I just can't figure out what he would be hiding. I mean, I'm only asking him why he goes to a particular restaurant.)\nTrés Bien regular (after breaking Psyche-Locks)\nPhoenix:\nUm... Sir...\nOld Man:\nYes, it's true! I was there for the young girl. Fine, so I'm a dirty, wicked, sinful old devil!\nPhoenix:\nNo, no... I didn't mean it like that...\nOld Man:\nI even get one of those lousy cups of javaccino every time. For 8 dollars! All because of the serving girl! Punish me! Lock me up!\nPhoenix:\nReally, that's not what I'm here for.\nOld Man:\nYou'll be the same! Another 20 years and you'll understand what it's like! You'll know how painful it is to be an old man like me!\nPhoenix:\nNo, really. Listen, sir...\nOld Man:\nStop calling me that! I have a name you know, boy! So show some respect, hmm!? I'm Victor Kudo.\nPhoenix:\nS-Sorry... Mr. Kudo.\nKudo:\nYou young ones think you know it all, don't you? Well, I'm not saying another word! I won't tell you anything more!\nPhoenix:\n(This guy was in the restaurant at the time of the incident. Which means I have to hear his testimony, one way or another!)\nKudo:\nHmph!\nPhoenix:\n(I don't believe this... I even broke his Psyche-Locks and everything... (Changed from [I don't believe this... I even broke his Psyche-Lock and everything...] in the original release) I guess I'll have to try to get him when he's in a better mood.)\nAny option (after breaking Psyche-Locks, then clearing \"Trés Bien regular\" Talk option)\nPhoenix:\nMr. Kudo! Please! This is really important.\nKudo:\nHmm, ha-hmm, hmm... Hmm, pi-pi-pigeon, hmm... Kah!\nPhoenix:\n(Ack. He's really giving me the cold shoulder now. But this guy's an important witness. I can't afford to lose his testimony. There must be a way to soften him up...)\nPresent\nMagatama (after clearing \"Trés Bien regular\" Talk option)\nPhoenix:\n3 PSYCHE-LOCKS\n-- Trés Bien regular --\nPhoenix:\nIt's time you told me the truth. Why are you a regular at a restaurant that you dislike so much?\nOld Man:\nIsn't it obvious!? People only have one reason to go to restaurants. To eat!\nPhoenix:\nTo eat? Is that the whole truth?\nOld Man:\nWh-What do you mean!?\nPhoenix:\nI don't think you go to that restaurant for the food at all.\nOld Man:\nYou insolent brat! How dare you accuse me! What proof have you got!?\nPhoenix:\nI can tell that not you nor anyone else in the world would go to that place for its food.\nPresent Lunch Special\nPhoenix:\nLeads to:\n\"The proof is in the pudding. Or in this case, the lunch menu.\"\nPresent anything else\nPhoenix:\nPhoenix:\nWell?\nOld Man:\nTake this!\nPhoenix:\nArgh!\nOld Man:\nYou're a disgrace! An idiot! A clot! A fool! You're only worthy of this pigeon feed!\nPhoenix:\nOw! (Looks like that evidence wasn't it!) L-Listen...\nLeads back to:\n\"I don't think you go to that restaurant for the food at all.\"\nPhoenix:\nThe proof is in the pudding. Or in this case, the lunch menu.\nOld Man:\nThat's the Twin-T set!\nPhoenix:\nThe food at Trés Bien is terrible. And expensive.\nOld Man:\nYou're wrong. It's cheap.\nPhoenix:\nHuh?\nOld Man:\nI'm rich. I inherited money when I was a boy. Yes, I'm stinking rich! I haven't done a jot of work since I was born. Other than feeding the pigeons.\nPhoenix:\n(What a load of crock!)\nOld Man:\nThe taste's another story, but the price... It's nothing to me.\nPhoenix:\nSo, you're saying that you go there because you've got money to burn?\nOld Man:\nExactly! I have so much cash, I go for a swim in my money vault every day!\nPhoenix:\nUnfortunately, that's a lie.\nOld Man:\nWhat!?\nPhoenix:\nYou don't have money to burn. You're flat broke!\nPresent Job Listings\nPhoenix:\nLeads to:\n\"This is yours, right?\"\nPresent anything else\nPhoenix:\nOld Man:\nDisrespectful youth!\nPhoenix:\nUh?\nOld Man:\nTake this! The finest seeds money can buy! Ha-ha!\nPhoenix:\nOuuuch! (These seeds really hurt when they land in your eyes!)\nOld Man:\nI'm rich, I tell you! Never worked in my life! As rich as they come!\nPhoenix:\nI don't believe you. You're lying to me.\nLeads back to:\n\"What!?\"\nPhoenix:\nThis is yours, right?\nOld Man:\nMy magazine!\nPhoenix:\nWhy would a rich retiree be looking for a job?\nOld Man:\nI-I-I was... Argh! So what!?\n1 LOCK BROKEN\nOld Man:\nSo I was looking for a job! I'm buying a lot at the moment. I need spending money.\nPhoenix:\nOh?\nOld Man:\nI don't go to that restaurant for food. I just go for the javaccino.\nPhoenix:\nYeah... I think you mean a cappuccino. Anyway, how much does a cappuccino cost there?\nOld Man:\nEight dollars.\nPhoenix:\n(Those had better be some golden beans!)\nOld Man:\nWhat's your problem? You think a poor man would be better off drinking dishwater, do you? Is that it!?\nPhoenix:\nN-No. I wasn't thinking that. I was wondering if the coffee there is really that great...\nOld Man:\nNo, it's not. But... But anyway! Yes! That place has free newspapers to read every day.\nPhoenix:\nNewspapers?\nOld Man:\nExactly. They don't want me hanging around at home, so I go there.\nPhoenix:\nI'm sorry, sir... But there are no free papers to read at Trés Bien!\nPresent Sports Paper\nPhoenix:\nLeads to:\n\"Take a look at this.\"\nPresent anything else\nPhoenix:\nPhoenix:\nWell?\nOld Man:\nYou like seeds, do you, boy?\nPhoenix:\nSorry?\nOld Man:\nIf you like them so much, then how about them seeds!? Now eat up, boy! You heard me!\nPhoenix:\nOw! Oooow! (Well, oww! That was no good... Oww!)\nOld Man:\nWell, boy? How do you like them seeds, hmm?\nLeads back to:\n\"But anyway! Yes! That place has free newspapers to read every day.\"\nPhoenix:\nTake a look at this.\nOld Man:\nWhat is it?\nPhoenix:\nIt's a newspaper I found behind the magazine rack at Trés Bien.\nOld Man:\nSo? What of it?\nPhoenix:\nThis was the only paper there. And it's dated more than one month ago!\nOld Man:\nWh-What!?\nPhoenix:\nDo you see what I'm getting at here? That restaurant doesn't get newspapers. This is just one that a customer happened to leave behind!\nOld Man:\nAh... Aaaaaargh!\n1 LOCK BROKEN\nPhoenix:\nTell me, why are you so determined to hide the truth?\nOld Man:\nI-I'm not hiding anything!\nPhoenix:\n(I'm going to have to put this guy out of his misery.) Listen... The real reason why you go so much to Trés Bien is...\nPresent Maya Fey or Maggey Byrde profile\nPhoenix:\nLeads to:\n\"Wh-What are you asking me about that girl for?\"\nPresent anything else\nPhoenix:\nPhoenix:\nWell?\nOld Man:\nAh ha ha! You're wrong, you're wrong!\nPhoenix:\nUh-oh. He's gone silly.\nOld Man:\nYou're so stupid! Ha ha ha!\nPhoenix:\n(It's not the food, it's not the coffee, and it's not the newspapers... What else is there?)\nLeads back to:\n\"Tell me, why are you so determined to hide the truth?\"\nOld Man:\nWh-What are you asking me about that girl for?\nPhoenix:\nShe was the waitress at Trés Bien.\nOld Man:\nAh!\nPhoenix:\nTherefore, the answer to the mystery... ...of why an old man would drink expensive coffee at a terrible restaurant... ...is the waitress!\nOld Man:\nArgh! B-But I don't recognize that face!\nPhoenix:\nAnd you are probably telling the truth here. Because you weren't looking at the girl's face... But at her outfit!\nOld Man:\n*gulp*\nPhoenix:\nThat's the truth, isn't it? You became a regular at the restaurant because of the waitress's uniform! That uniform is all you can think about, isn't it?\nOld Man:\nUh... uh... I-I can't take it...\nPhoenix:\nTo you, that waitress was your...\nOld Man:\nEnough! Please! No more! Stop saying that word! Stop saying, \"waitress\"! Stop it, stop it, stop it!\n1 LOCK BROKEN\nUnlock Successful\nCriminal Affairs Dept.\nPresent\nVictor Kudo profile\nGumshoe:\nHe looks like one of those grouchy old man types.\nPhoenix:\nYeah.\nGumshoe:\nIt's OK, though. I don't mind guys like that. But, if he's involved with this case somehow, that's a different story.\nPhoenix:\nUm... sure.\nGumshoe:\nHere's a tip for you, pal. If you wanna get information out of a guy like that... ...you're gonna have to find his weakness and try to get under his skin.\nPhoenix:\n(His weakness? I wonder what that might be...)\nTrés Bien\nPresent\nVictor Kudo profile\nLeads to:\n\"Oh, it's that old man... Is he still feeding the pigeons?\"\nMaya:\nOh, it's that old man... Is he still feeding the pigeons?\nPhoenix:\nYeah. He \"fed\" me as well. I got a bunch of those seeds in my eyes.\nMaya:\nOoh, ouch!\nPhoenix:\nHey, Maya. Would you mind coming with me for a while?\nMaya:\nHuh? Me? Why?\nPhoenix:\nThere's something I really want to ask that old man.\nMaya:\nSure, OK. I'll just get changed.\nPhoenix:\nNo, hang on! Can't you... go like that?\nMaya:\n... I guess...?\nVitamin Square\nPhoenix:\nUm, sir...\nKudo:\nHmph! You again? ...\nMaya:\n?\nKudo:\nHmm... Well, well... I see...\nMaya:\nUh, Nick. His eyes are burning into me!\nPhoenix:\nIt's OK. I think it's going pretty well.\nKudo:\n... Kah!\nPhoenix:\nHuh?\nKudo:\nYou're still just a little child! Run along and play on the slide, alright?\nMaya:\nP-Play on the slide?\nPhoenix:\n(Argh! We were so close! Just a little more and he would've spilled...)\nKudo:\nHmm, ha-hmm, hmm... Hmm, pi-pi-pigeon, hmm... Kah!\nPhoenix:\n(How can we crack this guy?)\n???:\nUm, excuse me please, sir...\nKudo:\nQuiet! Can't you see I'm feeding... the... pige...\nPhoenix:\nMia!?\nKudo:\nWell...\nMia:\nIf you don't mind, sir... I'd really love to talk with you.\nKudo:\nYes. Yes, yes. Of course. Certainly. I'm Victor. Victor Kudo.\nPhoenix:\n(Even from beyond the grave... Wow...)\nTalk\nWhat you saw\nMia:\nAbout the incident...\nKudo:\nYou mean, the man who died after drinking the javaccino?\nPhoenix:\n(It's like he's a different person...)\nKudo:\nIt was quite a shock! Even for me. He was a strange-looking boy. The girl took the javaccino over to him, you see.\nMia:\nAnd... was the customer alone?\nKudo:\nDefinitely! He was the only person at the table. Then he took one sip of his javaccino, and...\nMia:\nAnd?\nKudo:\nAnd he said something like, \"Uaaaargh!\" and then collapsed. Dead.\nMia:\nOh, how terrifying!\nKudo:\nYou're so good at listening, aren't you? I'll tell you anything. Whatever you want to know! Hee hee hee.\nPhoenix:\n(He certainly seems to be telling the truth now. But it looks like Mr. Kudo didn't see this other man, either.)\nTrés Bien\nMia:\nDo you like the food at Trés Bien?\nKudo:\nWell, of course! I'm really quite a sophisticated man. I was a young businessman once, you know. I set up a casino in London!\nMia:\nReally? How interesting!\nKudo:\nEating the food at that restaurant really takes me back to my days in France.\nMia:\nWhat a lovely story.\nPhoenix:\n(London's in England, not France!)\nKudo:\nOh, yes! France is wonderful. I'd love to show you around the city some time! It-It's too much! I can't take it! I want... France!\nMia:\nHa ha ha!\nPhoenix:\n(I can't believe Mia's laughing at the guy... *sigh*)\nTrés Bien regular\nMia:\nYou visit Trés Bien a lot, don't you?\nKudo:\nOf course! I mean, yes. I'd like to come and see you there. Heh heh heh.\nMia:\nReally? Oh, you flatter me so! (Changed from [Really? Oh, you're so flattering!] in the original release) The owner would be delighted to welcome you, I'm sure.\nKudo:\nBe careful of that chef, my dear!\nPhoenix:\nThe chef? You mean Mr. Armstrong?\nKudo:\nThat's right. The man's an ex-con.\nPhoenix:\nHe... He's an ex-con!?\nArmstrong's record (appears after \"Trés Bien regular\")\nLeads to:\n\"Whatever did Mr. Armstrong do!?\"\nMia:\nWhatever did Mr. Armstrong do!?\nKudo:\nOh, no! Those eyes! I can't take this!\nPhoenix:\n(Mia's really got this guy eating out of her hand...)\nKudo:\nHe steals things. From his customers.\nPhoenix:\nFrom his customers?\nKudo:\nGloves, handkerchiefs... Little things, mainly. He's a pilferer! So you be careful around him, my dear.\nMia:\nAre you sure about this?\nKudo:\nOf course! He was arrested for it once. I was there when it happened, having my javaccino.\nPhoenix:\n(He really is a regular!)\nKudo:\nLet me write you a little haiku about it.\nPhoenix:\nA haiku?\nKudo:\nA Japanese poem. It'll explain all you need to know about that chef.\nVictor's Note added to the Court Record.\nKudo:\nIf he takes anything again, you let me know! If it's not too expensive, I'll buy you a replacement!\nPhoenix:\n(Poor guy. He couldn't do enough for Mia.)\nMia:\nOK, Phoenix. That's about as much as I can do to help.\nPhoenix:\nThanks, Mia. We got some really important information thanks to you.\nMia:\nHonestly! I can't believe Maya called me for something like this!\nCriminal Affairs Dept.\nPresent\nMaya Fey profile\nGumshoe:\nYou're looking upbeat, as usual.\nMaya:\nAnd you're looking tired as usual, Detective Gumshoe!\nGumshoe:\nYeah. That's life, huh? One guy's got it all, and one guy's got squat.\nMaya:\nIs it just me or did the room get darker all of a sudden...? You know, Detective. This is the year of the, um... gum!\nGumshoe:\nI-It is?\nMaya:\nYeah. ...I think.\nGumshoe:\nGum, huh? This is gonna be a great year for this ol' Gumshoe then, right?\nMaya:\nLook at that. He perked up in no time!\nPhoenix:\nMaya... Don't mess with him like that.\nAfter clearing \"Armstrong's secret\" Talk option in Police Station - Criminal Affairs Dept. and clearing \"Armstrong's record\" Talk option in Vitamin Square:\nJanuary 6Trés Bien\nMaya:\nI guess it's about time to wrap up today's investigation.\nPhoenix:\nHad enough of being a waitress?\nMaya:\nYeah. Plus, no one came to the restaurant...\nArmstrong:\nOh là là! Mademoiselle Maya! Non! 'Ow can you leave like z'is!?\nMaya:\nI-I'm sorry...\nPhoenix:\n(That reminds me. Mr. Armstrong had a Psyche-Lock or three, didn't he? I'm going to have to break those...) Mr. Armstrong. I hope you won't mind, but I'd like to have another word with you...\nArmstrong:\nVolontiers! Of course!\nTalk\nMaggey's motive\nPhoenix:\nWhen Maggey took the coffee over to the victim... ...did anything happen?\nArmstrong:\nM-Monsieur... I cannot...\nPhoenix:\nMaggey wouldn't just have put poison in the coffee of some guy she didn't even know. If she's really guilty, there must have been something between her and the victim.\n3 PSYCHE-LOCKS\nArmstrong:\nN-Non. It was nothing. I am sure.\nPhoenix:\n(Somehow... I've gotta get this guy to spill the beans on everything he knows.)\nMaggey's motive (after breaking Psyche-Locks)\nPhoenix:\nMr. Armstrong. You said that the victim had a winning lottery ticket for half a million dollars. How did you know he had something like that in the first place?\nArmstrong:\nZ'e man... 'E was listening to la radio wi'z 'is earpiece.\nPhoenix:\n(Hmm, Maggey said something about that, too.)\nArmstrong:\nLa winning number was announced on la news, I think. All of a sudden, 'e exploded! \"Yes! 'Alf a million!\" 'e shouted.\nPhoenix:\nAnd the ticket?\nArmstrong:\nOui. 'E 'ad all of 'is tickets spread out on la table. I... I was so desperately in need of money, so I...\nPhoenix:\nPut the poison in his coffee?\nArmstrong:\nNon, non, non, non, non! Oh, non, you naughty man! I simply 'elped myself to one of 'is tickets.\nMaya:\nWhat?\nArmstrong:\nLa victim collapsed, and Maggey passed out. I thought to myself, \"Pourquoi pas?\" 'E 'ad so many of zem.\nPhoenix:\n(Yeah, but only one of them was the winning ticket, right?)\nMaya:\nHow could you do that, Mr. Armstrong!? Maggey was arrested because of you!\nArmstrong:\nNon! Z'is is not true!\nWinning ticket (appears after \"Maggey's motive\")\nLeads to:\n\"I did not take it! La ticket for 'alf a million, I mean.\"\nPresent\nJob Listings\nArmstrong:\nOh lá lá! You are looking for la job also?\nPhoenix:\nN-No!\nArmstrong:\nOui, oui. Your looks are un peu, unusual, shall we say? But I love your style!\nPhoenix:\nI look \"unusual\"?\nArmstrong:\nIt will suit you perfectly, la uniform of la waitress!\nPhoenix:\n(I just knew it...)\nLunch Special\nArmstrong:\nOh lá lá! So you 'ave eaten my lunch, oui? Tell me, monsieur. Did you enjoy la lunch I prepared for you?\nPhoenix:\nIt was a... unique and... wild mixture of flavors.\nMaya:\nThat was the first time I ever had lobster, you know!\nArmstrong:\nLobster? Z'ere was no lobster in my lunch...\nMaya:\nHuh? But, it said, \"lobster\" right on the menu.\nArmstrong:\nMademoiselle Maya. Please, you must read la menu more carefully. It says, \"A dish inspired by lobster and abalone fricassée with a balsamic vinaigrette.\nMaya:\nOh. It's only inspired, is it?\nArmstrong:\nOui. Inspired by z'ese ingredients, but not per'aps made from z'em, n'est-ce pas?\nMaya:\nWell, guess that's the way the cookie crumbles, Nick.\nPhoenix:\n(The way the lunch tasted, it's probably 99% perspiration and 1% inspiration.)\nMagatama\nPhoenix:\n3 PSYCHE-LOCKS\n-- Maggey's Motive --\nArmstrong:\nWh-What is 'appening? I do not like zis 'orrible feeling.\nPhoenix:\nI have to know the truth. What happened that day?\nArmstrong:\n... Alors, alors! I will confess everything! Just don't 'urt me!\nPhoenix:\nHuh? (Well that was a new world record!)\nArmstrong:\nIt was a lottery ticket.\nPhoenix:\nA lottery ticket?\nArmstrong:\nLa man who died 'ere 'ad a lottery ticket. For 'alf a million dollars!\nPhoenix:\nH-HALF A MILLION!?\nArmstrong:\nOui. But after la incident, z'is ticket... It disappeared!\nPhoenix:\n(The ticket disappeared...?)\nArmstrong:\nZ'is was la motive z'at la prosecution gave for Maggey. Z'ey said z'at she poisoned the man to get ze 'alf a million dollar lottery ticket.\nPhoenix:\nWhy didn't you tell me about this sooner?\nArmstrong:\nMais, alors...\nPhoenix:\nYou've been trying to hide this information about the lottery ticket from me. And I want to know the reason why!\nArmstrong:\nNon, monsieur! You doubt me? But I 'ave confessed to you everything I know!\nPhoenix:\nMr. Armstrong. The half a million dollar lottery ticket... I think I know who took it. I think the winning ticket was stolen by this person.\nPresent Jean Armstrong profile\nPhoenix:\nLeads to:\n\"Mr. Armstrong! I believe there is a very high probability that it was you.\"\nPresent anything else\nPhoenix:\nPhoenix:\nWell? How about it?\nArmstrong:\nÇa va?\nPhoenix:\nExcuse me?\nArmstrong:\nIt means, \"'Ow are you?\"\nPhoenix:\nOh. Um... I'm fine, thanks.\nArmstrong:\nBien. I am 'appy to 'ear it.\nPhoenix:\n... (Doesn't sound like I'm doing so fine with this Psyche-Lock though...)\nArmstrong:\nPoor Maggey, she was tempted by la evil, non?\nPhoenix:\n(No! If it was really Maggey, then you'd have no reason to hide the facts from me!)\nLeads back to:\n\"Mr. Armstrong.\"\nPhoenix:\nMr. Armstrong! I believe there is a very high probability that it was you.\nArmstrong:\nAaaaaaaaaaaaaaaah!\n1 LOCK BROKEN\nPhoenix:\n(Wow! That is one piercing scream, even for a man like him...)\nArmstrong:\nMais pourquoi moi!? Why!? You 'ave no evidence! I am not Mask☆DeMasque! I'm not z'e kind of person who steals z'e property of others.\nPhoenix:\nSorry to disappoint you, Mr. Armstrong, but I have evidence to the contrary. I present to you, proof that you have stolen from others in the past!\nPresent Victor's Note\nPhoenix:\nLeads to:\n\"What is z'is!? A poem? Oh, monsieur, you know me so well! I adore poems!\"\nPresent anything else\nPhoenix:\nArmstrong:\nOui. Per'aps duck would be nice. A terrine, maybe?\nPhoenix:\nSorry?\nArmstrong:\nI was just thinking about my lunch menu. Terrine de canard. What do you think?\nPhoenix:\nTh-That sounds lovely...\nArmstrong:\nAlors, Au revoir, monsieur. I must go to buy la ingredients.\nPhoenix:\n(I guess my evidence is a bit of a lame duck...)\nLeads back to:\n\"I am not Mask☆DeMasque! I'm not z'e kind of person who steals z'e property of others.\"\nArmstrong:\nWhat is z'is!? A poem? Oh, monsieur, you know me so well! I adore poems!\nPhoenix:\nPlease, read it. And put some feeling into it.\nArmstrong:\n\"Convicted before, a wicked man... or woman, repeat offender\"...\nPhoenix:\nI'm sorry to have to bring it up, Mr. Armstrong... ...but you have been arrested for stealing from your customers before, haven't you?\nArmstrong:\nMon dieu! Le mensonge! You are z'e liar!\nPhoenix:\nYou deny it?\nArmstrong:\nDo not make la false accusations, s'il vous plaît! So do you 'ave any proof? I want to see la incontestable proof that I 'ave ever stolen from one of my customers!\nPresent Magatama\nPhoenix:\nLeads to:\n\"It seems old habits die hard, Mr. Armstrong.\"\nPresent anything else\nPhoenix:\nArmstrong:\n♪Im~bécile, im~bécile, U ar an im~bécile...♪\nPhoenix:\nWh-What are you singing?\nArmstrong:\nJust one of my favorite chansons. It is called, \"Imbécile\". It is French. Come, monsieur. Sing together w'iz me. ♪Im~bécile, im~bécile, U ar an im~bécile...♪\nPhoenix:\n(Armstrong's definitely stolen from his customers before... I just need to find the right evidence to prove it...)\nLeads back to:\n\"So do you 'ave any proof?\"\nPhoenix:\nIt seems old habits die hard, Mr. Armstrong.\nArmstrong:\nWh-What is z'at?\nPhoenix:\nThis is my Magatama. And I found it in your kitchen.\nArmstrong:\nNooooon!\n1 LOCK BROKEN\nPhoenix:\n(Wow, that scream just about broke some windows...)\nArmstrong:\nOui... oui... I-I 'ave a weakness for la little trinkets and la figurines. My 'and, it just slips out. I cannot stop it.\nPhoenix:\nYou've stolen handkerchiefs, gloves, and other things from your customers, right?\nArmstrong:\nOui! It is la truth! I am just a timid little girl inside, monsieur. A timid little girl! Besides, z'is time, it was not la small trinket, oui? It was 500,000 dollars! Mais, non! Why would I steal it? I 'ave no need for such money.\nPhoenix:\nReally now?\nArmstrong:\nOh, monsieur. What is it?\nPhoenix:\nIsn't it true that you're in some pretty serious trouble? And that you are in desperate need of a large amount of cash?\nPresent Jean's Loan Contract\nPhoenix:\nLeads to:\n\"This restaurant is deep in the red, isn't it?\"\nPresent anything else\nPhoenix:\nPhoenix:\nWell, Mr. Armstrong!?\nArmstrong:\nMais, monsieur. It is not I who is in trouble. Is it you, non?\nPhoenix:\nHuh?\nArmstrong:\nUne petite question...\nPhoenix:\nWh-What?\nArmstrong:\nIt means, \"a little question\". Together now, w'iz me! Une petite question.\nPhoenix:\nOon put it keschon.\nArmstrong:\nBravo, monsieur! Oh, you are a dream! Excellent!\nPhoenix:\n(We're definitely not on the same page here... let alone book...)\nArmstrong:\nIs z'at all...?\nLeads back to:\n\"Besides, z'is time, it was not la small trinket, oui? It was 500,000 dollars!\"\nPhoenix:\nThis restaurant is deep in the red, isn't it?\nArmstrong:\nAh!\nPhoenix:\nYou have a loan... to the tune of half a million dollars! That lottery ticket would have wiped out your debts.\nArmstrong:\nGnnngh...\nPhoenix:\nWell, Mr. Armstrong!? What do you have to say for yourself now!?\nArmstrong:\nAh... Aaaaaaaah!\n1 LOCK BROKEN\nUnlock Successful\nJean's Loan Contract or Victor's Note\nArmstrong:\nPardon, pardon. W'izout my reading glasses, I cannot see z'is. I do not read English well.\nMaya:\nHe's not even looking at it.\nPhoenix:\n(We better find a way to make him look, then.)\nMaya Fey profile\nArmstrong:\nMademoiselle Maya! 'Ow are you finding my restaurant?\nMaya:\nI think I've got the hang of it now... But I think it's time for me to...\nArmstrong:\nOh lá lá, non! You are quitting already? It will be a new record for z'e shortest period of employment ever!\nGlen Elg profile\nArmstrong:\nAh, la dead man. 'E was la first in my restaurant.\nMaya:\nNo way! You mean, the first customer you ever had!?\nArmstrong:\nNon, non, non. It was z'e first time I've 'ad a dead man in my restaurant. Such a s'ame to lose a customer after only 'is first meal 'ere!\nVictor Kudo profile\nArmstrong:\nAh, z'is old man. 'E is a regular 'ere. My specialty of cappuccino and cold water is one of 'is favorites.\nPhoenix:\nWas he here at the time of the incident?\nArmstrong:\nOui. 'E was 'ere. I am sure of it. When la incident 'appened, z'e old man was 'ere.\nMaya:\n...?\nArmstrong:\nI did not take it! La ticket for 'alf a million, I mean.\nMaya:\nBut you just told us you did! You said you took a ticket!\nArmstrong:\nMais non, ma fille! It was not...\n???:\nThat's enough.\nMaya:\nHuh? AAAAAAAAAH! Mr. Godot!\nPhoenix:\nWhat in the heck are you doing here!?\nGodot:\nUrgh! This is without doubt... the worst coffee I have ever tasted, Mr. Armstrong.\nPhoenix:\n(He came in here for coffee!? Does his craving for coffee know no bounds!?)\nGodot:\nPerhaps Mr. Armstrong stole one of the victim's tickets on the day in question.\nArmstrong:\nI am la air'ead, non? Just a pretty little girl who everyone is laughing at.\nMaya:\nBut, in that case, Maggey shouldn't be the only one under suspicion...\nGodot:\nHe had the wrong ticket.\nPhoenix:\n...What?\nGodot:\nMr. Armstrong made off with the winning ticket's pretty neighbor.\nMaya:\nSo... the ticket he took was worthless?\nGodot:\nNot quite. He did win something. A dollar.\nArmstrong:\nYou see! I am just a pretty face! W'izout my looks, I 'ave nothing!\nPhoenix:\nSo... What happened to the winning ticket, then? The one he meant to steal.\nGodot:\nIndeed. What did happen to it? I don't like spoiling myself by watching trailers, so... ...we'll just wait and see how the movie turns out tomorrow, won't we?\nMaya:\nNngh...\nArmstrong:\nVoilà! You two! Time to laugh at la pretty little air'ead!\nPhoenix:\n(Looks like I won't be needing this note anymore.)\nVictor's Note thrown into the trash.\nPhoenix:\nLooks like we've got a new mystery now. Namely, where did the winning ticket go?\nMaya:\nI've got a bad feeling about this.\nPhoenix:\nWell, anyway. We can't let Maggey suffer any longer for this. And certainly not again.\nTo be continued.\nNothing to examine during investigation\nPhoenix:\nNo clues here.\nExit Magatama session\nPhoenix:\n(I don't think I have enough evidence yet... I should investigate and gather some more clues before I try again...)\nToo many errors during Magatama session\n...Mr. Nick... ...If you push yourself any more, your soul will shatter... ...Please calm down, collect your thoughts, and try again...\nPhoenix:\n(Nnrgh! I've made too many mistakes!)",
  "characters": [
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Maya Fey",
      "age": "19",
      "gender": "Female",
      "description1": "My assistant and a disciple in the Kurain Tradition of spirit channeling."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Mia Fey",
      "age": "deceased",
      "gender": "Female",
      "description1": "Maya's older sister and my eternal mentor in life and law. Passed away 2 years ago."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Godot",
      "age": "???",
      "gender": "Male",
      "description1": "A prosecutor who is shrouded in mystery. He seems to know me somehow."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Dick Gumshoe",
      "age": "32",
      "gender": "Male",
      "description1": "Homicide detective at the local precinct. In charge of the initial investigation."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Maggey Byrde",
      "age": "23",
      "gender": "Female",
      "description1": "A waitress at Trés Bien. Was found guilty of murder thanks to the phony me."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Jean Armstrong",
      "age": "39",
      "gender": "Male",
      "description1": "Trés Bien's owner and chef. A witness in the case who is also into aromatherapy.",
      "description2": "Trés Bien's owner and chef. Has a long debt and prior convictions for theft."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Glen Elg",
      "age": "28",
      "gender": "Male",
      "description1": "The victim. Was a programmer. Maggey had apparently never even seen him before.",
      "description2": "The victim. Was a programmer. His left eardrum was broken the day before the incident.",
      "description3": "The victim. Was a programmer. Wore an HMD over left eye. Left eardrum was ruptured."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Victor Kudo",
      "age": "68",
      "gender": "Male",
      "description1": "Was in Trés Bien at the time of the incident. Has a thing for waitresses.",
      "description2": "Was in Trés Bien at the time of the incident. Called the police by pay phone."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Lisa Basil",
      "age": "???",
      "gender": "Female",
      "description1": "The CEO of Blue Screens, Inc., and Glen Elg's boss. Absolutely not a robot."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Violetta → Viola Cadaverini",
      "age": "??? → 25",
      "gender": "Female",
      "description1": "Possibly part of the staff at Tender Lender? A thoroughly bitter person.",
      "description2": "The granddaughter of crime boss Bruto Cadaverini. A thoroughly bitter person."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Furio Tigre",
      "age": "42",
      "gender": "Male",
      "description1": "The head of Tender Lender loan company. Also known as \"The Tiger\"."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Bruto Cadaverini",
      "age": "78",
      "gender": "Male",
      "description1": "The head of the Cadaverini Family crime syndicate. Seems to live for his granddaughter."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "It's my all-important badge. It shows that I am a defense attorney."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Maya's Magatama",
      "type": "Other",
      "obtained": "Received from Maya Fey.  → Found in the Kitchen.",
      "description1": "A present from Maya. It reacts to people who have secrets in their hearts.",
      "description2": "On loan from Maya. Recovered in the kitchen of Trés Bien."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Magazine Clipping",
      "type": "Other",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "An article from December 5th. Says I was trounced and my client was found guilty."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Sports Paper",
      "type": "Other",
      "obtained": "Obtained at Trés Bien.",
      "description1": "Dates from December 3rd, the day of the incident. On it is a doodle that said 'MC Bomber' with an arrow pointing to '100,000' that was crossed out. 'Ahahahaha' and a laughing face are written next to it.",
      "description2": "Left by a costumer in Trés Bien on Dec. 3rd. Click here for details.",
      "description3": "Left by the victim. Doodle is in victim's handwriting. Click here for details."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Job Listings",
      "type": "Other",
      "obtained": "Found at Vitamin Square.",
      "description1": "Picked up from a bench in Vitamin Square. Thrown away by the old man."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Lunch Special",
      "type": "Other",
      "obtained": "Obtained at Trés Bien.",
      "description1": "Trés Bien lunch special. Costs 20 dollars despite how unbelievably bad it tastes."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Small Bottle",
      "type": "Other",
      "obtained": "Found in the Kitchen.",
      "description1": "Found in the kitchen. Shape is different from the others bottles. Contents unknown.",
      "description2": "The victim's ear medicine. Found covered in unidentified fingerprints in the kitchen.",
      "description3": "The victim's ear medicine. Covered in Furio Tigre's fingerprints."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Scooter",
      "type": "Other",
      "obtained": "Found at Vitamin Square.",
      "description1": "Ridden by my phony. The wheel guard is all smashed up."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Jean's Loan Contract",
      "type": "Documents",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "Jean's debt is half a million dollars. The owner of the loan is Tender Lender."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Victor's Note",
      "type": "Documents",
      "obtained": "Received from Victor Kudo.",
      "description1": "\"Convicted before, a wicked man or woman, repeat offender -- Victor Kudo\""
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Glen's Autopsy Report",
      "type": "Reports",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Died of potassium cyanide poisoning. Time of death was between 1:30 and 2:30 PM."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Trés Bien Floor Plans",
      "type": "Maps",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Blueprints of the crime scene. Click here for details. X = victim's seat."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Crime Photo",
      "type": "Photographs",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "A photo of the scene taken from near the kitchen. Two dining tables are separated by a folding screen. The one closer to the camera is empty. The other one is where the victim collapse on the table. There is an intact vase on each table. A coffee cup is knocked over and the the table cloth is stained by coffee. Near the coffee table are some pieces of papers. No one is sitting across from the victim."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Coffee Cup",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Godot.",
      "description1": "The coffee contained potassium cyanide. Covered in the victim and Maggey's fingerprints. Facing the cup, one can see a lip stain on the front, and a floral looking handle to the right."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Victim's Lottery Ticket",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Godot.",
      "description1": "A winning ticket for half a million dollars. Found during a body search of Maggey."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Apron",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Godot.",
      "description1": "Worn by Maggey at the time of the incident. Has small pockets but big stains."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Potassium Cyanide",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Godot.",
      "description1": "A deadly powdery poison. Bears Maggey's fingerprints. Found in her apron pocket."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Victim's Prescription Bag",
      "type": "Other",
      "obtained": "Submitted as evidence during the trial.",
      "description1": "The victim got this from the doctor before going to Trés Bien. The bag is empty."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Victor's Testimony",
      "type": "Documents",
      "obtained": "Received from the Judge.",
      "description1": "\"When the incident occurred, I broke the vase at my seat. I'm sorry.\""
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Millionaire Radio Flyer",
      "type": "Other",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "Experience the most thrilling ten minutes of your life every Monday at 1:30 PM!"
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Glen's Calendar",
      "type": "Other",
      "obtained": "Found at Blue Screens, Inc.",
      "description1": "On Dec. 3rd, the day of the incident, there is a note saying, \"Meet with The Tiger\"."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Losing Horse Racing Tickets",
      "type": "Other",
      "obtained": "Found at Blue Screens, Inc.",
      "description1": "Horse racing betting tickets. Found in Glen Elg's desk. There's over 500 of them!"
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Gumshoe's Lunchbox",
      "type": "Other",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "A tenderly handmade lunchbox. Fills the stomach with love and plenty of weenies."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "MC Bomber",
      "type": "Other",
      "obtained": "Found at Tender Lender.",
      "description1": "Found at Tender Lender. A sample disc with the name written in marker.",
      "description2": "Found at Tender Lender. Contains a computer virus program.",
      "description3": "A computer virus made by Glen Elg. Potentially worth million of dollars."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Trés Bien Matches",
      "type": "Other",
      "obtained": "Found at Tender Lender.",
      "description1": "Matches used for advertising. Found lying in Tender Lender."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Repair Bill",
      "type": "Documents",
      "obtained": "Found at Tender Lender.",
      "description1": "A car repair bill for $15,000. Paid by Tigre to the Cadaverini Family."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Paper Badge",
      "type": "Other",
      "obtained": "Found at Tender Lender.",
      "description1": "Found at Tender Lender. Made of cardboard and painted to look authentic."
    },
    {
      "currentChapter": "Recipe for Turnabout",
      "name": "Viola's Medical Papers",
      "type": "Documents",
      "obtained": "Received from Viola Cadaverini.",
      "description1": "A 1 million dollar bill for cranial surgery. Payment was due last year."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "Recipe for Turnabout\n\n\n\n\n\n\n\n\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 4January 7, 9:48 AMDistrict CourtDefendant Lobby No. 1Byrde:\nOh... I see... I guess I should've expected this. Nobody saw the other guy, huh? But he was there when I took the coffee over, sir. Scout's honor!???:\nMaggey!Byrde:\nAck! D-Detective Gumshoe!Gumshoe:\nA-Are you doing alright!? How're you feeling!?Byrde:\n...As if you need to ask either question, sir.Gumshoe:\nDon't let 'em get you down, Maggey. And don't forget to eat well, OK?Byrde:\nRoger!Gumshoe:\nAnd you!Phoenix:\nY-Yes?Gumshoe:\nYou'd better square this case away, got it pal!? Maggey's innocent, you hear!? If you screw up, then I'll be doing some squaring away myself. Squaring away some paperwork for your arrest!Phoenix:\n(I-I think he's serious!)Maya:\nHey, Detective! You're on our side for once, right?Gumshoe:\nYup.Maya:\nSo you'll be able to help Maggey out, right?Byrde:\nReally? Can you, sir!?Gumshoe:\nO... Of course! I've got the simulation under control! I'm gonna be the first witness on the stand today. If something I say doesn't mesh with the facts, make sure you point it out, alright?Phoenix:\nS-Sure.Gumshoe:\nOK. We're forming a united front today, pal. You get me!?Byrde:\nI can't tell you how grateful I am, sir! I've always admired you so much, Detective. I know I can count on you.Maya:\nLooks like it should all go pretty smoothly today, huh?Phoenix:\n(I can only wish...)January 7, 10:00 AMDistrict CourtCourtroom No. 4Judge:\nCourt is now in session for the trial of Maggey Byrde.Phoenix:\nThe defense is ready, Your Honor.Godot:\n... Aaah, bitter!Judge:\nMr... Um... Mr. Wright.Phoenix:\nY-Yes, Your Honor?Judge:\nAaaah!Phoenix:\nWh-What's wrong!?Judge:\nNothing. It's just whenever I addressed you in the previous trial, your response was... \"Youse talkin' to me!?\" It was a little, well... intimidating.Phoenix:\nNo, no! That wasn't me. That was the phony Phoenix.Judge:\nI see. So our trusty Phoenix Wright is back with us now, is he?Phoenix:\n(\"Our trusty\"...?)Judge:\nSo, Mr. Godot. Your opening statement, please.Godot:\nMr. Trite... Whether you're a fake or the real deal... We will find out soon enough through this trial today.Phoenix:\nBut I can already tell you! I'm the real Phoenix Wright!Godot:\nI wasn't questioning whether you are Phoenix Wright or not. I was questioning whether you had studied law or not. That's what I intend to find out.Phoenix:\n(There's no denying it. Behind that mask is a man who really hates me for some reason or another!)Judge:\nAs everyone is aware, the court has already given its verdict on this case once. Therefore, I won't stand for irrelevant testimony during this retrial. Nor will I stand for a simple repetition of the evidence presented in the last trial.Phoenix:\n(I'm not planning on repeating anything that phony me said! Trust me!)Judge:\nNow then. Mr. Godot, please summon your first witness.Godot:\nLet's start with the formalities, shall we? Name and occupation?Gumshoe:\n...Judge:\nWitness! State your name for the court!Gumshoe:\nHuh? Oh, sorry, sir! The name's Police Department Detective. Occupation, Dick Gumshoe.Godot:\nOther way around, Detective.Gumshoe:\nHuh? Oh! Sorry. Anyway, I'm the officer in charge of this case since yesterday. Sir!Judge:\nSince yesterday?Gumshoe:\nYeah. The guy who was on the initial investigation's tied up with another case now.Maya:\nI hope Gumshoe's really got everything under control... For everyone's sake.Judge:\nI see. So, Detective Gumshoe... Would you outline for the court the basic facts of the case?Gumshoe:\nY-Y-Yes, sir. The victim's name was Glen Elg. He was a professional programmer. He was on the payroll of Blue Screens Inc., a local company. This is the victim's autopsy report.Judge:\nThe court accepts this into evidence.Glen's Autopsy Report added to the Court Record.Gumshoe:\nUm... And here are the floor plans of the restaurant. When the incident took place, the victim was sitting right here. The poisoned coffee was brought over to him by the, um... By the waitress.Judge:\nThe waitress being the accused?Gumshoe:\nYeah... The victim died from poisoning almost immediately after he took a sip of the coffee. At the time of the incident, there were two other people in the restaurant. Mr. Jean Armstrong, the owner and chef. And a regular by the name of Mr. Victor Kudo.Judge:\nHmm... It still seems to be a very straightforward case to me.Trés Bien Floor Plans added to the Court Record.Godot:\nCome, Detective. Take up this hammer. And nail the defendant's coffin shut with your own two hands.Judge:\nNow then, Detective Gumshoe. Let's have your testimony.Gumshoe:\nUmm... Yes, sir...Witness Testimony-- The Incident --Gumshoe:\nWhen the incident took place, the victim was alone at his table, sir.\nWe understand that the guy, Glen Elg, was listening to the radio at the time.\nTraces of poison were found in his coffee cup.\nAnd what we found was potassium cyanide. That stuff really packs a punch!\nAnd, um... it looks like Ms. Byrde might've had, well... some kind of a motive.Judge:\nHmm...Godot:\nUsing the dark, aromatic depths of coffee to conceal the poison... Classy lady!Judge:\nThe facts of this case seem to be ironclad. Mr. Wright. I would ask you to begin your cross-examination, but...Phoenix:\nYes?Judge:\nPlease, no intimidation tricks this time around. Is that understood?Phoenix:\nI already told you! That wasn't me!Cross ExaminationCross Examination-- The Incident --Gumshoe:\nWhen the incident took place, the victim was alone at his table, sir.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nCan I stop you for just a minute?\nGumshoe:\nHuh? What is it? Did I say something that contradicts the evidence?\nPhoenix:\n(He'd so desperate for that to be true, he's practically crying!) Your testimony just now doesn't match the testimony given by Ms. Byrde. She claims that there was another man at the victim's table.\nGumshoe:\nYeah, that's what she said. And I--\nGodot:\n\nGodot:\nWhat killer wouldn't say that when faced with a homicide conviction?\nPhoenix:\nHey!\nGodot:\nSadly, her testimony isn't supported by the owner or the other customer. Isn't that right, Detective Gumshoe?\nGumshoe:\nYeah, it's true. Their two testimonies tie up on that. They both said there was no other guy at the table.\nJudge:\nHmm...\nPhoenix:\n(What should I do? Should I press on this point a little harder or not?)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(No, I should leave it alone. I've got a bad feeling about where this is going.)\nMaya:\nIf you got a bad feeling about this, then maybe you should leave it alone. I once had a bad feeling that I was about to have a bad feeling. It was really bad.\nPhoenix:\n...Maybe I should move on to another part of his testimony.\nLeads back to cross-examination\n\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nWell, maybe the other witnesses just missed him! Perhaps their view of the victim's table was obscured in some way.\nGodot:\nHa...! That argument is as weak as the coffee at Trés Bien, Trite!\nPhoenix:\n...!\nGodot:\nI have here in my possession a ticket.\nPhoenix:\nA ticket? (Looks more like a photo to me.)\nGodot:\nYes. A one-way ticket to guilty-ville! Population: the defendant! This is a photograph taken from near the entrance to the kitchen.\nJudge:\nThis is the scene as witnessed by the chef, moments after the poisoning took place, correct?\nGodot:\nI think the court will agree that with such a clear view of the scene of the crime... ...how, Mr. Trite, could anyone have overlooked a second person at the table?\nPhoenix:\nUrk!\nJudge:\nIt certainly seems to show the victim's table extremely clearly.\nCrime Photo added to the Court Record.\nLeads back to cross-examinationPress (after Crime Photo is added to the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nCan I stop you for just a minute?\nGumshoe:\nHuh? What is it? Did I say something that contradicts the evidence?\nPhoenix:\n(He'd so desperate for that to be true, he's practically crying!) Your testimony just now doesn't match the testimony given by Ms. Byrde. She claims that there was another man at the victim's table.\nGumshoe:\nYeah, that's what she said. And I--\nGodot:\n\nGodot:\nWhat killer wouldn't say that when faced with a homicide conviction?\nPhoenix:\nHey!\nGodot:\nSadly, her testimony isn't supported by the owner or the other customer. Isn't that right, Detective Gumshoe?\nGumshoe:\nYeah, it's true. Their two testimonies tie up on that. They both said there was no other guy at the table.\nJudge:\nHmm...Gumshoe:\nWe understand that the guy, Glen Elg, was listening to the radio at the time.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHe was listening to his radio, you say?\nGumshoe:\nYeah. He had a portable radio in his chest pocket.\nMaya:\nMaggey told us that too, didn't she? Something about how \"one of them had some sort of earpiece\".\nPhoenix:\n(What should I do? Should I press on this point a little harder or not?)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(No, I should leave it alone. I've got a bad feeling about where this is going.)\nMaya:\nIf you got a bad feeling about this, then maybe you should leave it alone. I once had a bad feeling that I was about to have a bad feeling. It was really bad.\nPhoenix:\n...Maybe I should move on to another part of his testimony.\nLeads back to cross-examination\n\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nAnd what was it that the victim was listening to on the radio, Detective Gumshoe?\nGumshoe:\nHuh? How should I know?\nPhoenix:\n(Thanks a lot... We're now one step closer to the middle of nowhere.)\nMaya:\nThis isn't going very well, is it...?\nJudge:\nHmm... Detective. Could you perhaps tell us about the poison and how it was used?\nLeads back to cross-examinationGumshoe:\nTraces of poison were found in his coffee cup.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo, traces of the poison were found in the coffee cup and nowhere else?\nGumshoe:\nNot sure I get you, pal.\nPhoenix:\nWas the poison a liquid? Or was it a powder?\nGumshoe:\nIf I had to put it in layman's terms, I'd say it was a powdery substance.\nPhoenix:\nSo the poison could've been in anything that was on the table. Sugar, salt, pepper...\nGodot:\n\nGodot:\nHa...! Do you put salt and pepper in your coffee, Trite?\nGumshoe:\nThe victim took his coffee black, with no sugar.\nPhoenix:\nNngh...\nJudge:\nIt seems that the poison could only have been in the coffee.\nPhoenix:\n(What should I do? Should I press on this point a little harder or not?)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(No, I should leave it alone. I've got a bad feeling about where this is going.)\nMaya:\nIf you got a bad feeling about this, then maybe you should leave it alone. I once had a bad feeling that I was about to have a bad feeling. It was really bad.\nPhoenix:\n...Maybe I should move on to another part of his testimony.\nLeads back to cross-examination\n\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nAre you absolutely certain that the victim even drank any of his coffee?\nGumshoe:\nHuh!? What do you mean?\nPhoenix:\nAccording to this file, \"the poison was found in the victim's coffee cup.\" But what proof is there that the victim ever drank any of it!?\nGumshoe:\nOh, hey! You're right! That's what I was think--\nGodot:\n\nGodot:\nIn case you were wondering, that last objection was for the detective there.\nGumshoe:\nHuh? For me?\nGodot:\n\"Oh, hey! You're right!\"? You may be fooling the court, but I'm not falling for it. If you have the time to waste, you have the time to present that piece of evidence.\nGumshoe:\nTh... THAT piece... sir?\nGodot:\nYes. THAT piece.\nGumshoe:\n... Um... Aheh heh heh! Wh-What piece was it again?\nGodot:\nThis!\nPhoenix:\n(Should I be grateful this coffee's only hot enough to give me 1st degree burns...?)\nGumshoe:\nOh. Now I remember! Um... This is the, uh... victim's coffee cup.\nGodot:\nYes, the victim's cup. Take a good look at the rim.\nJudge:\nOh, yes. It's unmistakable. There is clearly a coffee stain on it.\nGodot:\nConclusive proof that the victim did drink the poisoned coffee that was in this cup. The victim gulped down the bitter death that the waitress brought to him... like this!\nPhoenix:\nUuuurgh!\nGumshoe:\nFor the record, the only prints on the cup were the victim's and the defendant's.\nCoffee Cup added to the Court Record.\nGumshoe:\nUpon further investigation of this cup... we found a certain chemical substance...\nLeads back to cross-examinationPress (after Coffee Cup is added to the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo, traces of the poison were found in the coffee cup and nowhere else?\nGumshoe:\nNot sure I get you, pal.\nPhoenix:\nWas the poison a liquid? Or was it a powder?\nGumshoe:\nIf I had to put it in layman's terms, I'd say it was a powdery substance.\nPhoenix:\nSo the poison could've been in anything that was on the table. Sugar, salt, pepper...\nGodot:\n\nGodot:\nHa...! Do you put salt and pepper in your coffee, Trite?\nGumshoe:\nThe victim took his coffee black, with no sugar.\nPhoenix:\nNngh...\nJudge:\nIt seems that the poison could only have been in the coffee.Gumshoe:\nAnd what we found was potassium cyanide. That stuff really packs a punch!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n(Potassium cyanide? I've heard of that chemical before...) Exactly how strong is this poison, Detective Gumshoe?\nGumshoe:\nIt's... Well... That stuff's lethal! Eat too much, and you're history.\nMaya:\nHow much is too much?\nGodot:\nA lethal dose is 0.2 grams. That's about enough to finish anyone off.\nMaya:\n0.2 grams? How much is that?\nGumshoe:\nYou know when you swab your ears for earwax? Yeah, about that much.\nPhoenix:\n(Earwax, huh? Sounds like something Gumshoe's got an abundance of...)\nJudge:\nHmm... Such a small quantity of poison could have been concealed anywhere.Gumshoe:\nAnd, um... it looks like Ms. Byrde might've had, well... some kind of a motive.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n\"Some kind of a motive\"?\nGumshoe:\nYeah. But if you ask me, it's been blown way out of proportion.\nGodot:\n\nGodot:\nYou know what my golden rule is, Detective? Chuck out a bad cup of coffee. You can always get another.\nGumshoe:\nHuh? I don't get it.\nGodot:\nI'm saying, we can always get another witness on the stand, if we have to chuck you out.\nGumshoe:\n*gulp*\nGodot:\nSo stick to the facts, Detective. Now then, what was Ms. Byrde's motive?\nPhoenix:\n(Come on, Gumshoe...)\nGumshoe:\nShe was... They said she wanted to steal a lottery ticket.\nPhoenix:\nI knew it... (That's what we heard yesterday, too.)\nGumshoe:\nIt disappeared from the scene of the crime.\nGodot:\nAnd it wasn't just any lottery ticket. It was a winning ticket for half a million!\nMaya:\nMr. Armstrong knew about the ticket too, didn't he? But he stole the wrong one...\nPhoenix:\n(Then is it possible Maggey stole the winning one? What should I do? Should I press on this point a little harder or not?)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(No, I should leave it alone. I've got a bad feeling about where this is going.)\nMaya:\nIf you got a bad feeling about this, then maybe you should leave it alone. I once had a bad feeling that I was about to have a bad feeling. It was really bad.\nPhoenix:\n...Maybe I should move on to another part of his testimony.\nLeads back to cross-examination\n\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nWait a minute! The mere fact that the lottery ticket disappeared in no way implicates my client!\nGodot:\nHa...! I have here in my hand... the very ticket in question!\nJudge:\nTh-That's the half a million dollar lottery ticket...?\nGumshoe:\nOne of the female police officers found it when she was conducting a search... ...of the defendant.\nPhoenix:\nWH-WHAAAAAT!?\nJudge:\nOrder! Order!\nGodot:\nHa...! She's quite a lucky bird, our little waitress.\nJudge:\nY-You will submit that ticket as evidence to the court! Immediately!\nPhoenix:\n(Hmm, I'd better keep an eye on that ticket. The way the judge's voice is quivering...)\nVictim's Lottery Ticket added to the Court Record.\nJudge:\nThe ticket was presented to the court in the previous trial, too. But it feels heavier now somehow. H-Half a million dollars, you say...?\nGodot:\nIt's just a scrap of paper. What matters is where it was found, Your Honor.\nPhoenix:\n(And that's on Maggey's person, unfortunately...) (Changed from [I bet he wants to say it was found on Maggey's person...] in the original release)\nLeads back to cross-examinationPress (after Victim's Lottery Ticket is added to the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n\"Some kind of a motive\"?\nGumshoe:\nYeah. But if you ask me, it's been blown way out of proportion.\nGodot:\n\nGodot:\nYou know what my golden rule is, Detective? Chuck out a bad cup of coffee. You can always get another.\nGumshoe:\nHuh? I don't get it.\nGodot:\nI'm saying, we can always get another witness on the stand, if we have to chuck you out.\nGumshoe:\n*gulp*\nGodot:\nSo stick to the facts, Detective. Now then, what was Ms. Byrde's motive?\nPhoenix:\n(Come on, Gumshoe...)\nGumshoe:\nShe was... They said she wanted to steal a lottery ticket.\nPhoenix:\nI knew it... (That's what we heard yesterday, too.)\nGumshoe:\nIt disappeared from the scene of the crime.\nGodot:\nAnd it wasn't just any lottery ticket. It was a winning ticket for half a million!\nMaya:\nMr. Armstrong knew about the ticket too, didn't he? But he stole the wrong one...\nPhoenix:\n(Then is it possible Maggey stole the winning one?)Maya:\nYou really think there are any contradictions in this testimony?Phoenix:\nTo be honest, I don't know.Maya:\nBut Gumshoe told us out in the lobby. He said we'd be forming a united front, right? How will we win the case if he doesn't throw us a line?Phoenix:\n(I don't have a whole lot of options right now... The best I can do is gather the facts together, I guess.)",
      "testimonies": [
        {
          "testimony": "When the incident took place, the victim was alone at his table, sir.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "We understand that the guy, Glen Elg, was listening to the radio at the time.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "Traces of poison were found in his coffee cup.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "And what we found was potassium cyanide. That stuff really packs a punch!",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "And, um... it looks like Ms. Byrde might've had, well... some kind of a motive.",
          "person": "Gumshoe",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Incident --Gumshoe:\nWhen the incident took place, the victim was alone at his table, sir.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nCan I stop you for just a minute?\nGumshoe:\nHuh? What is it? Did I say something that contradicts the evidence?\nPhoenix:\n(He'd so desperate for that to be true, he's practically crying!) Your testimony just now doesn't match the testimony given by Ms. Byrde. She claims that there was another man at the victim's table.\nGumshoe:\nYeah, that's what she said. And I--\nGodot:\n\nGodot:\nWhat killer wouldn't say that when faced with a homicide conviction?\nPhoenix:\nHey!\nGodot:\nSadly, her testimony isn't supported by the owner or the other customer. Isn't that right, Detective Gumshoe?\nGumshoe:\nYeah, it's true. Their two testimonies tie up on that. They both said there was no other guy at the table.\nJudge:\nHmm...\nPhoenix:\n(What should I do? Should I press on this point a little harder or not?)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(No, I should leave it alone. I've got a bad feeling about where this is going.)\nMaya:\nIf you got a bad feeling about this, then maybe you should leave it alone. I once had a bad feeling that I was about to have a bad feeling. It was really bad.\nPhoenix:\n...Maybe I should move on to another part of his testimony.\nLeads back to cross-examination\n\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nWell, maybe the other witnesses just missed him! Perhaps their view of the victim's table was obscured in some way.\nGodot:\nHa...! That argument is as weak as the coffee at Trés Bien, Trite!\nPhoenix:\n...!\nGodot:\nI have here in my possession a ticket.\nPhoenix:\nA ticket? (Looks more like a photo to me.)\nGodot:\nYes. A one-way ticket to guilty-ville! Population: the defendant! This is a photograph taken from near the entrance to the kitchen.\nJudge:\nThis is the scene as witnessed by the chef, moments after the poisoning took place, correct?\nGodot:\nI think the court will agree that with such a clear view of the scene of the crime... ...how, Mr. Trite, could anyone have overlooked a second person at the table?\nPhoenix:\nUrk!\nJudge:\nIt certainly seems to show the victim's table extremely clearly.\nCrime Photo added to the Court Record.\nLeads back to cross-examinationPress (after Crime Photo is added to the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nCan I stop you for just a minute?\nGumshoe:\nHuh? What is it? Did I say something that contradicts the evidence?\nPhoenix:\n(He'd so desperate for that to be true, he's practically crying!) Your testimony just now doesn't match the testimony given by Ms. Byrde. She claims that there was another man at the victim's table.\nGumshoe:\nYeah, that's what she said. And I--\nGodot:\n\nGodot:\nWhat killer wouldn't say that when faced with a homicide conviction?\nPhoenix:\nHey!\nGodot:\nSadly, her testimony isn't supported by the owner or the other customer. Isn't that right, Detective Gumshoe?\nGumshoe:\nYeah, it's true. Their two testimonies tie up on that. They both said there was no other guy at the table.\nJudge:\nHmm...Gumshoe:\nWe understand that the guy, Glen Elg, was listening to the radio at the time.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHe was listening to his radio, you say?\nGumshoe:\nYeah. He had a portable radio in his chest pocket.\nMaya:\nMaggey told us that too, didn't she? Something about how \"one of them had some sort of earpiece\".\nPhoenix:\n(What should I do? Should I press on this point a little harder or not?)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(No, I should leave it alone. I've got a bad feeling about where this is going.)\nMaya:\nIf you got a bad feeling about this, then maybe you should leave it alone. I once had a bad feeling that I was about to have a bad feeling. It was really bad.\nPhoenix:\n...Maybe I should move on to another part of his testimony.\nLeads back to cross-examination\n\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nAnd what was it that the victim was listening to on the radio, Detective Gumshoe?\nGumshoe:\nHuh? How should I know?\nPhoenix:\n(Thanks a lot... We're now one step closer to the middle of nowhere.)\nMaya:\nThis isn't going very well, is it...?\nJudge:\nHmm... Detective. Could you perhaps tell us about the poison and how it was used?\nLeads back to cross-examinationGumshoe:\nTraces of poison were found in his coffee cup.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo, traces of the poison were found in the coffee cup and nowhere else?\nGumshoe:\nNot sure I get you, pal.\nPhoenix:\nWas the poison a liquid? Or was it a powder?\nGumshoe:\nIf I had to put it in layman's terms, I'd say it was a powdery substance.\nPhoenix:\nSo the poison could've been in anything that was on the table. Sugar, salt, pepper...\nGodot:\n\nGodot:\nHa...! Do you put salt and pepper in your coffee, Trite?\nGumshoe:\nThe victim took his coffee black, with no sugar.\nPhoenix:\nNngh...\nJudge:\nIt seems that the poison could only have been in the coffee.\nPhoenix:\n(What should I do? Should I press on this point a little harder or not?)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(No, I should leave it alone. I've got a bad feeling about where this is going.)\nMaya:\nIf you got a bad feeling about this, then maybe you should leave it alone. I once had a bad feeling that I was about to have a bad feeling. It was really bad.\nPhoenix:\n...Maybe I should move on to another part of his testimony.\nLeads back to cross-examination\n\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nAre you absolutely certain that the victim even drank any of his coffee?\nGumshoe:\nHuh!? What do you mean?\nPhoenix:\nAccording to this file, \"the poison was found in the victim's coffee cup.\" But what proof is there that the victim ever drank any of it!?\nGumshoe:\nOh, hey! You're right! That's what I was think--\nGodot:\n\nGodot:\nIn case you were wondering, that last objection was for the detective there.\nGumshoe:\nHuh? For me?\nGodot:\n\"Oh, hey! You're right!\"? You may be fooling the court, but I'm not falling for it. If you have the time to waste, you have the time to present that piece of evidence.\nGumshoe:\nTh... THAT piece... sir?\nGodot:\nYes. THAT piece.\nGumshoe:\n... Um... Aheh heh heh! Wh-What piece was it again?\nGodot:\nThis!\nPhoenix:\n(Should I be grateful this coffee's only hot enough to give me 1st degree burns...?)\nGumshoe:\nOh. Now I remember! Um... This is the, uh... victim's coffee cup.\nGodot:\nYes, the victim's cup. Take a good look at the rim.\nJudge:\nOh, yes. It's unmistakable. There is clearly a coffee stain on it.\nGodot:\nConclusive proof that the victim did drink the poisoned coffee that was in this cup. The victim gulped down the bitter death that the waitress brought to him... like this!\nPhoenix:\nUuuurgh!\nGumshoe:\nFor the record, the only prints on the cup were the victim's and the defendant's.\nCoffee Cup added to the Court Record.\nGumshoe:\nUpon further investigation of this cup... we found a certain chemical substance...\nLeads back to cross-examinationPress (after Coffee Cup is added to the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo, traces of the poison were found in the coffee cup and nowhere else?\nGumshoe:\nNot sure I get you, pal.\nPhoenix:\nWas the poison a liquid? Or was it a powder?\nGumshoe:\nIf I had to put it in layman's terms, I'd say it was a powdery substance.\nPhoenix:\nSo the poison could've been in anything that was on the table. Sugar, salt, pepper...\nGodot:\n\nGodot:\nHa...! Do you put salt and pepper in your coffee, Trite?\nGumshoe:\nThe victim took his coffee black, with no sugar.\nPhoenix:\nNngh...\nJudge:\nIt seems that the poison could only have been in the coffee.Gumshoe:\nAnd what we found was potassium cyanide. That stuff really packs a punch!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n(Potassium cyanide? I've heard of that chemical before...) Exactly how strong is this poison, Detective Gumshoe?\nGumshoe:\nIt's... Well... That stuff's lethal! Eat too much, and you're history.\nMaya:\nHow much is too much?\nGodot:\nA lethal dose is 0.2 grams. That's about enough to finish anyone off.\nMaya:\n0.2 grams? How much is that?\nGumshoe:\nYou know when you swab your ears for earwax? Yeah, about that much.\nPhoenix:\n(Earwax, huh? Sounds like something Gumshoe's got an abundance of...)\nJudge:\nHmm... Such a small quantity of poison could have been concealed anywhere.Gumshoe:\nAnd, um... it looks like Ms. Byrde might've had, well... some kind of a motive.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n\"Some kind of a motive\"?\nGumshoe:\nYeah. But if you ask me, it's been blown way out of proportion.\nGodot:\n\nGodot:\nYou know what my golden rule is, Detective? Chuck out a bad cup of coffee. You can always get another.\nGumshoe:\nHuh? I don't get it.\nGodot:\nI'm saying, we can always get another witness on the stand, if we have to chuck you out.\nGumshoe:\n*gulp*\nGodot:\nSo stick to the facts, Detective. Now then, what was Ms. Byrde's motive?\nPhoenix:\n(Come on, Gumshoe...)\nGumshoe:\nShe was... They said she wanted to steal a lottery ticket.\nPhoenix:\nI knew it... (That's what we heard yesterday, too.)\nGumshoe:\nIt disappeared from the scene of the crime.\nGodot:\nAnd it wasn't just any lottery ticket. It was a winning ticket for half a million!\nMaya:\nMr. Armstrong knew about the ticket too, didn't he? But he stole the wrong one...\nPhoenix:\n(Then is it possible Maggey stole the winning one? What should I do? Should I press on this point a little harder or not?)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(No, I should leave it alone. I've got a bad feeling about where this is going.)\nMaya:\nIf you got a bad feeling about this, then maybe you should leave it alone. I once had a bad feeling that I was about to have a bad feeling. It was really bad.\nPhoenix:\n...Maybe I should move on to another part of his testimony.\nLeads back to cross-examination\n\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nWait a minute! The mere fact that the lottery ticket disappeared in no way implicates my client!\nGodot:\nHa...! I have here in my hand... the very ticket in question!\nJudge:\nTh-That's the half a million dollar lottery ticket...?\nGumshoe:\nOne of the female police officers found it when she was conducting a search... ...of the defendant.\nPhoenix:\nWH-WHAAAAAT!?\nJudge:\nOrder! Order!\nGodot:\nHa...! She's quite a lucky bird, our little waitress.\nJudge:\nY-You will submit that ticket as evidence to the court! Immediately!\nPhoenix:\n(Hmm, I'd better keep an eye on that ticket. The way the judge's voice is quivering...)\nVictim's Lottery Ticket added to the Court Record.\nJudge:\nThe ticket was presented to the court in the previous trial, too. But it feels heavier now somehow. H-Half a million dollars, you say...?\nGodot:\nIt's just a scrap of paper. What matters is where it was found, Your Honor.\nPhoenix:\n(And that's on Maggey's person, unfortunately...) (Changed from [I bet he wants to say it was found on Maggey's person...] in the original release)\nLeads back to cross-examinationPress (after Victim's Lottery Ticket is added to the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n\"Some kind of a motive\"?\nGumshoe:\nYeah. But if you ask me, it's been blown way out of proportion.\nGodot:\n\nGodot:\nYou know what my golden rule is, Detective? Chuck out a bad cup of coffee. You can always get another.\nGumshoe:\nHuh? I don't get it.\nGodot:\nI'm saying, we can always get another witness on the stand, if we have to chuck you out.\nGumshoe:\n*gulp*\nGodot:\nSo stick to the facts, Detective. Now then, what was Ms. Byrde's motive?\nPhoenix:\n(Come on, Gumshoe...)\nGumshoe:\nShe was... They said she wanted to steal a lottery ticket.\nPhoenix:\nI knew it... (That's what we heard yesterday, too.)\nGumshoe:\nIt disappeared from the scene of the crime.\nGodot:\nAnd it wasn't just any lottery ticket. It was a winning ticket for half a million!\nMaya:\nMr. Armstrong knew about the ticket too, didn't he? But he stole the wrong one...\nPhoenix:\n(Then is it possible Maggey stole the winning one?)Maya:\nYou really think there are any contradictions in this testimony?Phoenix:\nTo be honest, I don't know.Maya:\nBut Gumshoe told us out in the lobby. He said we'd be forming a united front, right? How will we win the case if he doesn't throw us a line?Phoenix:\n(I don't have a whole lot of options right now... The best I can do is gather the facts together, I guess.)After selecting \"Press harder\" upon pressing first, third, and fifth statements:Judge:\nThat's enough! The facts of this case seem overwhelmingly clear to me. The defendant had ample opportunity to commit the crime of which she is charged. Furthermore, it seems beyond reasonable doubt that she did indeed commit this crime.Godot:\nI like an old man who knows the score.Judge:\nThere is also the matter of the half a million dollar lottery ticket. That alone provides a very credible motive. I mean, for that sum of money even I might be tempted to bend the rules!Godot:\nI don't mind an old man who is weak to the siren call of money.Maya:\nNot good, Nick... The evidence against Maggey is starting to pile up fast.Phoenix:\nYeah, that's because the court has ruled guilty once already.Godot:\nI'd say it's about time to wrap up this repeat performance... ...with one final, decisive piece of evidence.Phoenix:\n(He's got more evidence against Maggey!?)Godot:\nThis is the apron the delightful Ms. Byrde was wearing at the time.Maya:\nWow... That's not the cleanest apron I've seen...Phoenix:\nTh-That stain looks like...! (It can't be... blood, can it!?)Godot:\nHa...! It seems the star of our play was a little flustered... And somehow spilled coffee on herself.Phoenix:\nThe coffee!? That's not exactly the first thing that caught my eye...Godot:\nOf course. The coffee stain isn't the most interesting thing about this apron. No, there's something else that stands out even more.Judge:\nSomething else? I presume you mean...Godot:\nOf course. I'm referring to the pocket.Phoenix:\nThe... pocket?Godot:\nA search carried out right after the incident uncovered this... Potassium cyanide. The very poison used by the killer, was in her apron pocket!Phoenix:\nA bottle of poison... In Maggey's pocket?Gumshoe:\nYeah. And Maggey's prints were the only ones on it.Phoenix:\nWHAAAT!?Judge:\nOrder! Order! Order! The court will accept these items into evidence.Apron added to the Court Record.Potassium Cyanide added to the Court Record.Judge:\nThere's something still bothering me, Mr. Godot. Why have you not explained the bloodstain to the court?Godot:\nBloodstain? What bloodstain would that be?Judge:\nDon't play games, prosecutor! The blood-colored stain that's smeared all over the apron!Godot:\nThat's ridiculous! No one told me anything about a bloodstain!Phoenix:\n(You don't need to be told! Just look at it!)Godot:\nWell, Detective!? Could this stain really be... BLOOD!?Gumshoe:\nN-No way, sir! That's... It's just ketchup. Sir.Phoenix:\nKetchup!?Gumshoe:\nShe must've gotten some on her an apron while taking someone their breakfast that day.Judge:\n... You could have spoken up a little sooner, Detective Gumshoe!Godot:\nPull a stunt like that again, and I'll have you drink 17 cups of ketchup, witness!Gumshoe:\nUnnngh... I thought everyone knew what it was already.Judge:\nHmm... I haven't seen anything yet to make me doubt the last verdict I ruled on this case.Phoenix:\n...!Judge:\nThe motive, the opportunity, and the supporting evidence... They have all been clearly established.Godot:\nWell, Trite... It seems you really are a phony after all.Phoenix:\n(Argh! You really know how to drive a man nuts!)Judge:\nWitness, please continue with your testimony. Describe for the court the crime scene and the findings of your investigation there.Witness Testimony-- The Investigation --Gumshoe:\nThe crime was reported at 2:25 PM by a kind of scary old man, sir.\nPoor Maggey had passed out from the shock. It must've been real tough for her.\nThe victim didn't have any identification on him.\nBut we figured out who he was pretty quick, and then the investigation went smoothly.\nWhen Maggey was searched, we found the lottery ticket and the bottle of poison.\nAnd that was it. There was nothing else missing from the crime scene.Judge:\nHmm... You identified the victim and secured your prime suspect... Very good.Godot:\nLast chance to convince the court you're a real lawyer, Trite!Phoenix:\n...!Godot:\nDon't court on any more cross-examinations after this one! So, let the fun begin!Cross ExaminationCross Examination-- The Investigation --Gumshoe:\nThe crime was reported at 2:25 PM by a kind of scary old man, sir.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n\"Scary old man\", Detective Gumshoe?\nGumshoe:\nThere's an old man who's a regular at the restaurant where the incident happened.\nPhoenix:\n(Ah, we're obviously talking about the same old man...)\nGumshoe:\nOfficers were dispatched right after the report came in, but the old guy still made a fuss. \"What took you so long!?\" Then he hurled abuse at them. And seeds...\nJudge:\nHmm... Seeds...\nGodot:\nHa...! It was nothing! I caught each one with my teeth.\nPhoenix:\n(I guess not even the mighty Godot can avoid being attacked by that guy...)\nGodot:\nThe old man was only other customer in the place at the time. He took his time finding a pay phone apparently, so he was late reporting the crime.Gumshoe:\nPoor Maggey had passed out from the shock. It must've been real tough for her.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHow long was the defendant unconscious for?\nGumshoe:\nThe officers got to the crime scene at around 2:40. Maggey was still out cold in the kitchen at that time. It took another 10 minutes or so before she came to. I woulda liked to have been on the scene myself.\nPhoenix:\n(I bet you would've liked to have carried out the search, too...)\nGumshoe:\nI woulda loved to see Maggey asleep like that, all pretty and peaceful.\nPhoenix:\n(You're a professional detective, Gumshoe. Not a professional bird watcher!)\nGodot:\nSave the romantics for your own time, Detective. All we need to know about is the investigation.\nGumshoe:\nOops! I guess I'm pretty red right now, aren't I?Gumshoe:\nThe victim didn't have any identification on him.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHe didn't have any? Are you saying that it was stolen, then?\nGumshoe:\nNo, I don't think so. The victim didn't have a driver's license or even a credit card on him, pal. All he had was 58 cents in his wallet.\nPhoenix:\nFifty-eight cents...?\nGumshoe:\nYeah. I can't believe I found someone with less in their wallet than me, pal!\nJudge:\nThe victim sounds like he was a thoroughly miserable young man.\nGodot:\nOr some kind of outlaw... Why not give him a bit of an edge?\nPhoenix:\n(I think I'm on to something here...)Gumshoe:\nBut we figured out who he was pretty quick, and then the investigation went smoothly.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWait a sec!\nGumshoe:\nHuh? D-Did I say something dumb again!?\nPhoenix:\nLet me paraphrase what you just testified to this court. \"The victim didn't have any form of ID on him.\" That's basically what you said, yes?\nGumshoe:\nYeah, basically.\nPhoenix:\nIn that case, how were you able to identify the victim so quickly?\nGumshoe:\n... Oh... That.\nPhoenix:\n(He's so let down, he's got the whole sagging shoulders and puppy eyes thing going...)\nGumshoe:\nThere was a prescription bag on the victim's table along with the lottery ticket.\nGodot:\nIt seems Mr. Glen Elg visited his doctor before he went to Trés Bien.\nGumshoe:\nWe got the victim's name from the medical records of the doc who prescribed the meds.\nJudge:\nHmm... That's a reliable enough source for the court.\nPhoenix:\n(What should I do? Should I leave this alone or ask to hear more?)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(I guess it doesn't really matter how they figured out who the victim was. There are more important avenues to explore.)\nLeads back to cross-examination\n\n\n\n\nAsk about the prescription bag\n\n\n\n\n\n\n\nPhoenix:\nSo what sort of medicine was in the bag?\nGumshoe:\nWell... Actually, the bag we found was empty.\nPhoenix:\nHuh?\nGumshoe:\nYeah. Completely empty.\nPhoenix:\n(It was completely empty...?)\nVictim's Prescription Bag added to the Court Record.\nGodot:\nHa...! You're entering an empty paper bag as evidence? Desperate, are you, Trite?\nPhoenix:\n...!\nGodot:\nNow, what happened with the investigation after that, Detective?\nLeads back to cross-examination\n\n\n\n\nAsk about his health insurance\n\n\n\n\n\n\n\nPhoenix:\nSo, the victim had no form of identification on him, correct?\nGumshoe:\nYeah.\nPhoenix:\nAnd yet, before arriving at the restaurant, he went to see a doctor. Which means... He must've had his medical insurance card with him!\nJudge:\nOh! That is very true!\nPhoenix:\nThe fact that it hasn't been found points to only one obvious conclusion. The victim's medical card was stolen!\nGodot:\nHa...! True, the victim didn't have a medical insurance card. But why? Because Mr. Glen Elg didn't have medical insurance to begin with!\nPhoenix:\nHuh?\nJudge:\nHmm... As I thought, a thoroughly miserable young man.\nGodot:\nOr some kind of outlaw... A bit of an edge never hurt anyone.\nMaya:\nLooks like we're off course again, Nick.\nJudge:\nWitness. Please continue with your testimony. Explain for the court the events following the preliminary investigation.\nLeads back to cross-examinationPress (after Victim's Prescription Bag is added to the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWait a sec!\nGumshoe:\nHuh? D-Did I say something dumb again!?\nPhoenix:\nLet me paraphrase what you just testified to this court. \"The victim didn't have any form of ID on him.\" That's basically what you said, yes?\nGumshoe:\nYeah, basically.\nPhoenix:\nIn that case, how were you able to identify the victim so quickly?\nGumshoe:\n... Oh... That.\nPhoenix:\n(He's so let down, he's got the whole sagging shoulders and puppy eyes thing going...)\nGumshoe:\nThere was a prescription bag on the victim's table along with the lottery ticket.\nGodot:\nIt seems Mr. Glen Elg visited his doctor before he went to Trés Bien.\nGumshoe:\nWe got the victim's name from the medical records of the doc who prescribed the meds.\nJudge:\nHmm... That's a reliable enough source for the court.Gumshoe:\nWhen Maggey was searched, we found the lottery ticket and the bottle of poison.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nBut the defendant had been passed out for a while, correct? In that case... Isn't it possible someone planted the evidence in Maggey's pocket!?\nGumshoe:\nHey! Y-Yeah! You've nailed it, pal!\nJudge:\nHmm...\nGumshoe:\nIt happens to me all the time! We had a department party the other day, and when I got home... ...I was wearing the boss's shoes!\nGodot:\n\nGodot:\nKeep up this crazy testimony, Detective, and those shoes will end up down your throat!\nGumshoe:\nSorry...\nGodot:\nSo, Trite. \"Someone planted the evidence in Maggey's pocket\"...? That's a pretty bold statement. Care to back it up with some evidence?\nPhoenix:\nUm... Well... (I'd love to, if I had any...)\nJudge:\nIt appears you have no evidence to support your theory, Mr. Wright. Continue with your testimony, witness.Gumshoe:\nAnd that was it. There was nothing else missing from the crime scene.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo the half a million dollar lottery ticket and the bottle of poison were accounted for.\nGumshoe:\nYeah.\nPhoenix:\nInteresting... It's true that those two items are accounted for... ..but wasn't there another lottery ticket that was stolen that day?\nGumshoe:\nOh, yeah. The one the restaurant owner took. He won a whole dollar with it. What a lucky guy, huh?\nPhoenix:\n(And they're just going to let him get away with it...?)\nJudge:\nIt was just one dollar, Detective.\nMaya:\nI guess no one cares when it's that little... Unless it's Gumshoe.Present Victim's Prescription Bag\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Detective Gumshoe. I think I should point something out to you.\"Phoenix:\nIf I don't find a hole in this testimony, the judge is going to hand down his verdict!Maya:\nGumshoe isn't giving us anything to work with... And we can't find any contradictions if he doesn't give us something!Phoenix:\nYeah, that's true... But Maggey and Gumshoe are like dumb and dumber. Our only hope is that they were so dumb, they missed something obvious.Maya:\nCome on, Gumshoe! Be the dumbest you've ever been!",
      "testimonies": [
        {
          "testimony": "The crime was reported at 2:25 PM by a kind of scary old man, sir.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "Poor Maggey had passed out from the shock. It must've been real tough for her.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "The victim didn't have any identification on him.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "But we figured out who he was pretty quick, and then the investigation went smoothly.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "When Maggey was searched, we found the lottery ticket and the bottle of poison.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "And that was it. There was nothing else missing from the crime scene.",
          "person": "Gumshoe",
          "present": [
            "Victim's Prescription Bag"
          ],
          "source": {
            "evidence_span": "The bag is empty.",
            "testimony_span": "There was nothing else missing from the crime scene.",
            "explanation": "Since the prescription bag is empty, someone must have taken out the content, so there is something missing.",
            "is_self_contained": "no",
            "context_span": "There was a prescription bag on the victim's table along with the lottery ticket."
          }
        }
      ],
      "noPresent": false,
      "summarizedContext": "Detective Gunshoe is describing what the police found at the crime scene.",
      "labels": [
        "physical",
        "causal"
      ],
      "reasoning": [
        "Fact 1: The witness claims nothing but the lottery ticket and poison was missing from the crime scene.",
        "Fact 2: The evidence suggests the perscription bag was empty.",
        "Fact 3: The context suggests that there was a prescription bag at the crime scene.",
        "Prop 1: If a bag is empty after a crime scene, its contents are likely missing."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Investigation --Gumshoe:\nThe crime was reported at 2:25 PM by a kind of scary old man, sir.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n\"Scary old man\", Detective Gumshoe?\nGumshoe:\nThere's an old man who's a regular at the restaurant where the incident happened.\nPhoenix:\n(Ah, we're obviously talking about the same old man...)\nGumshoe:\nOfficers were dispatched right after the report came in, but the old guy still made a fuss. \"What took you so long!?\" Then he hurled abuse at them. And seeds...\nJudge:\nHmm... Seeds...\nGodot:\nHa...! It was nothing! I caught each one with my teeth.\nPhoenix:\n(I guess not even the mighty Godot can avoid being attacked by that guy...)\nGodot:\nThe old man was only other customer in the place at the time. He took his time finding a pay phone apparently, so he was late reporting the crime.Gumshoe:\nPoor Maggey had passed out from the shock. It must've been real tough for her.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHow long was the defendant unconscious for?\nGumshoe:\nThe officers got to the crime scene at around 2:40. Maggey was still out cold in the kitchen at that time. It took another 10 minutes or so before she came to. I woulda liked to have been on the scene myself.\nPhoenix:\n(I bet you would've liked to have carried out the search, too...)\nGumshoe:\nI woulda loved to see Maggey asleep like that, all pretty and peaceful.\nPhoenix:\n(You're a professional detective, Gumshoe. Not a professional bird watcher!)\nGodot:\nSave the romantics for your own time, Detective. All we need to know about is the investigation.\nGumshoe:\nOops! I guess I'm pretty red right now, aren't I?Gumshoe:\nThe victim didn't have any identification on him.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHe didn't have any? Are you saying that it was stolen, then?\nGumshoe:\nNo, I don't think so. The victim didn't have a driver's license or even a credit card on him, pal. All he had was 58 cents in his wallet.\nPhoenix:\nFifty-eight cents...?\nGumshoe:\nYeah. I can't believe I found someone with less in their wallet than me, pal!\nJudge:\nThe victim sounds like he was a thoroughly miserable young man.\nGodot:\nOr some kind of outlaw... Why not give him a bit of an edge?\nPhoenix:\n(I think I'm on to something here...)Gumshoe:\nBut we figured out who he was pretty quick, and then the investigation went smoothly.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWait a sec!\nGumshoe:\nHuh? D-Did I say something dumb again!?\nPhoenix:\nLet me paraphrase what you just testified to this court. \"The victim didn't have any form of ID on him.\" That's basically what you said, yes?\nGumshoe:\nYeah, basically.\nPhoenix:\nIn that case, how were you able to identify the victim so quickly?\nGumshoe:\n... Oh... That.\nPhoenix:\n(He's so let down, he's got the whole sagging shoulders and puppy eyes thing going...)\nGumshoe:\nThere was a prescription bag on the victim's table along with the lottery ticket.\nGodot:\nIt seems Mr. Glen Elg visited his doctor before he went to Trés Bien.\nGumshoe:\nWe got the victim's name from the medical records of the doc who prescribed the meds.\nJudge:\nHmm... That's a reliable enough source for the court.\nPhoenix:\n(What should I do? Should I leave this alone or ask to hear more?)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(I guess it doesn't really matter how they figured out who the victim was. There are more important avenues to explore.)\nLeads back to cross-examination\n\n\n\n\nAsk about the prescription bag\n\n\n\n\n\n\n\nPhoenix:\nSo what sort of medicine was in the bag?\nGumshoe:\nWell... Actually, the bag we found was empty.\nPhoenix:\nHuh?\nGumshoe:\nYeah. Completely empty.\nPhoenix:\n(It was completely empty...?)\nVictim's Prescription Bag added to the Court Record.\nGodot:\nHa...! You're entering an empty paper bag as evidence? Desperate, are you, Trite?\nPhoenix:\n...!\nGodot:\nNow, what happened with the investigation after that, Detective?\nLeads back to cross-examination\n\n\n\n\nAsk about his health insurance\n\n\n\n\n\n\n\nPhoenix:\nSo, the victim had no form of identification on him, correct?\nGumshoe:\nYeah.\nPhoenix:\nAnd yet, before arriving at the restaurant, he went to see a doctor. Which means... He must've had his medical insurance card with him!\nJudge:\nOh! That is very true!\nPhoenix:\nThe fact that it hasn't been found points to only one obvious conclusion. The victim's medical card was stolen!\nGodot:\nHa...! True, the victim didn't have a medical insurance card. But why? Because Mr. Glen Elg didn't have medical insurance to begin with!\nPhoenix:\nHuh?\nJudge:\nHmm... As I thought, a thoroughly miserable young man.\nGodot:\nOr some kind of outlaw... A bit of an edge never hurt anyone.\nMaya:\nLooks like we're off course again, Nick.\nJudge:\nWitness. Please continue with your testimony. Explain for the court the events following the preliminary investigation.\nLeads back to cross-examinationPress (after Victim's Prescription Bag is added to the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWait a sec!\nGumshoe:\nHuh? D-Did I say something dumb again!?\nPhoenix:\nLet me paraphrase what you just testified to this court. \"The victim didn't have any form of ID on him.\" That's basically what you said, yes?\nGumshoe:\nYeah, basically.\nPhoenix:\nIn that case, how were you able to identify the victim so quickly?\nGumshoe:\n... Oh... That.\nPhoenix:\n(He's so let down, he's got the whole sagging shoulders and puppy eyes thing going...)\nGumshoe:\nThere was a prescription bag on the victim's table along with the lottery ticket.\nGodot:\nIt seems Mr. Glen Elg visited his doctor before he went to Trés Bien.\nGumshoe:\nWe got the victim's name from the medical records of the doc who prescribed the meds.\nJudge:\nHmm... That's a reliable enough source for the court.Gumshoe:\nWhen Maggey was searched, we found the lottery ticket and the bottle of poison.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nBut the defendant had been passed out for a while, correct? In that case... Isn't it possible someone planted the evidence in Maggey's pocket!?\nGumshoe:\nHey! Y-Yeah! You've nailed it, pal!\nJudge:\nHmm...\nGumshoe:\nIt happens to me all the time! We had a department party the other day, and when I got home... ...I was wearing the boss's shoes!\nGodot:\n\nGodot:\nKeep up this crazy testimony, Detective, and those shoes will end up down your throat!\nGumshoe:\nSorry...\nGodot:\nSo, Trite. \"Someone planted the evidence in Maggey's pocket\"...? That's a pretty bold statement. Care to back it up with some evidence?\nPhoenix:\nUm... Well... (I'd love to, if I had any...)\nJudge:\nIt appears you have no evidence to support your theory, Mr. Wright. Continue with your testimony, witness.Gumshoe:\nAnd that was it. There was nothing else missing from the crime scene.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo the half a million dollar lottery ticket and the bottle of poison were accounted for.\nGumshoe:\nYeah.\nPhoenix:\nInteresting... It's true that those two items are accounted for... ..but wasn't there another lottery ticket that was stolen that day?\nGumshoe:\nOh, yeah. The one the restaurant owner took. He won a whole dollar with it. What a lucky guy, huh?\nPhoenix:\n(And they're just going to let him get away with it...?)\nJudge:\nIt was just one dollar, Detective.\nMaya:\nI guess no one cares when it's that little... Unless it's Gumshoe.Present Victim's Prescription Bag\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Detective Gumshoe. I think I should point something out to you.\"Phoenix:\nIf I don't find a hole in this testimony, the judge is going to hand down his verdict!Maya:\nGumshoe isn't giving us anything to work with... And we can't find any contradictions if he doesn't give us something!Phoenix:\nYeah, that's true... But Maggey and Gumshoe are like dumb and dumber. Our only hope is that they were so dumb, they missed something obvious.Maya:\nCome on, Gumshoe! Be the dumbest you've ever been!Phoenix:\nDetective Gumshoe. I think I should point something out to you. There is just one small contradiction in your testimony.Gumshoe:\nOho! Finally! I'm getting all anxious just waiting, so hurry up, will you?Phoenix:\nYou testified that, \"nothing else was missing from the crime scene.\" However! The prescription bag you mentioned was empty! Did the officers recover the medicine from the scene of the crime later?Gumshoe:\nUm, no. They didn't.Phoenix:\nThe victim was given a prescription right before going to Trés Bien. Where, then, did the medicine disappear to!?Gumshoe:\nY-You... ...are toooooo coool, pal!!Judge:\nI-Indeed! Due consideration wasn't given to the victim's prescription in the previous trial. Witness! Why do you always overlook such vital pieces of evidence!?Gumshoe:\nI, er... I guess that's the most careless thing I've done so far, huh?Phoenix:\nThe victim was killed by poison! And the victim's \"medicine\" mysteriously disappeared! The victim's own prescription could have been the lethal poison itself!Judge:\nO-Order! Order! Well, Mr. Godot? What do you have to say to that?Godot:\nHa...! That's all.Phoenix:\nWhat!?Godot:\nRead for the court the name of the clinic on the prescription bag, if you will.Phoenix:\nWhat's the clinic's name got to do with anything...? \"New Ear Otolaryngological Clinic\" O-Otolaryngological?Judge:\nJust what kind of illness was the victim suffering from, Mr. Godot?Godot:\nHardly an illness, Your Honor. More like a bitter war wound, you could say.Judge:\nA war wound?Godot:\nThe day before the incident, Mr. Elg found himself in a fight. He took a blow to the side of the head, and ruptured his eardrum.Phoenix:\nHe ruptured his eardrum!?Judge:\nThen what on earth was the prescription he was given?Godot:\nIt was a cream that was to be applied topically inside his ear canal, not to be ingested!Phoenix:\nWhat!?Godot:\nIt's mentioned in the autopsy report, if you read the fine print. They found traces of the medication in the victim's left ear.Judge:\nYes. Here it is. In very, very fine print.Godot:\nIt seems Mr. Elg correctly applied some of his medication while he was at Trés Bien. Therefore, it would be absurd to believe that he would have eaten his medication.Phoenix:\nUuurgh...Judge:\nIt seems that this medication is irrelevant to the case after all.Phoenix:\nN-No...Maya:\nNick! If you don't think of something quick, it'll all be over!Phoenix:\n(She's right. But I can't get away with any old weak objection. What should I do...?)Push the medication issue\n\n\n\n\n\n\n\nLeads to:\n\"Only moments ago, Mr. Godot made the following statement.\"Leave it\n\n\n\n\n\n\n\nPhoenix:\nIt does seem as it the medication isn't connected to the case.\nGodot:\nHa...! Maybe the last Mr. Trite was the real one. At least he didn't waste time.\nJudge:\nIndeed... If you have nothing further to add to this medication issue... ...the facts of this case seem no different to those presented on the last trial. I would therefore have no choice but to hand down my verdict.\nPhoenix:\nUh... Umm...!\nMaya:\nNick! Don't let him to do this! You've got to stand your ground!\nJudge:\nNow then...\nPhoenix:\n\nPhoenix:\nWait, Your Honor! Actually, this prescription... is absolutely pivotal to the case!\nJudge:\nMr. Wright! Did you not just say the exact opposite only moments ago!?\nPhoenix:\n(Gotta lose a few battles in order to win the war, I suppose.)\nLeads to:\n\"Only moments ago, Mr. Godot made the following statement.\"Phoenix:\nOnly moments ago, Mr. Godot made the following statement. \"It seems Mr. Elg correctly applied some of his medication while he was at Trés Bien.\" If that's the case, then why was the medication not found at the scene of the crime!?Godot:\n...!Judge:\nBut the medication in question was for topical use inside the ear canal!Phoenix:Phoenix:\nThat doesn't change the fact that it could not be found at the crime scene! However insignificant it may seem, it's a lawyer's duty to pursue the truth!Godot:Godot:\nYou know as well as I do that the medication is irrelevant. It hardly seems likely that a prescription drug would contain potassium cyanide.Phoenix:Phoenix:\nIt hardly seems likely that the coffee the waitress served would contain it, either! But it did! The possibility is undeniable!Godot:\nAaargh!Judge:\nThat's enough. Mr. Godot. Is the detective the only witness the prosecution wishes to call?Godot:\n...Judge:\nMr. Godot...?Godot:\n...Gumshoe:\nUm... I, ah... I've got my own witness I'd like to call, sir. It's the old man who was there in the restaurant on the day of the murder.Phoenix:\n(Victor Kudo? The pigeon-hater?)Judge:\nVery well. The matter of the disappearing medication seems little more than trivial at best. However! It wasn't explored at all in the previous trial. And that is something that bothers me.Maya:\nYay! Good job, Nick!Judge:\nThe court will adjourn for a 10 minute recess. After which we will hear the prosecution's next witness.Godot:\nHa...! I suppose this means I'll just have to finish you off in my last 6 cups.Judge:\nCourt is adjourned for recess!January 7, 11:03 AMDistrict CourtDefendant Lobby No. 1Maya:\nPhew! That was close!Phoenix:\nTell me about it... I nearly died in there!Byrde:\nThat's my line, sir!Maya:\nNo! It's my line! I think I really did die a little bit.Byrde:\nLooks like we all nearly died in there... I can't believe Detective Gumshoe! How could he betray us like that!?Maya:\nHuh?Byrde:\nHe said he'd help me. But he totally set me up!Phoenix:\nI don't think he meant to do that, Maggey. He was backed into a corner. I mean, the guy's got to do his job, right?Byrde:\nIt's OK. I know all about lies and betrayal. I've had them my whole life. But it really hurt this time. It felt like someone punched me hard in the stomach! I hate that guy! I don't ever want to see him again!Phoenix:\n(Poor Gumshoe...)Maya:\nSo the next witness is going to be that old guy from the park, right?Phoenix:\nYeah. Mr. Kudo. Lover of waitress outfits and projectile seeds!Byrde:\nI bet he's gonna be really stubborn. I mean, he's pretty set in his ways, you know?Maya:\nYeah, he's a big old grouch. Are you going to be able to handle him, Nick?Phoenix:\nYeah, I can take whatever he throws at me. Even those never-ending bird seeds!January 7, 11:15 AMDistrict CourtCourtroom No. 4Judge:\nCourt will now reconvene for the trial of Maggey Byrde. Mr. Godot. Your next witness, please.Godot:\nThe prosecution calls the lucky old-timer who caught the show over a cup of coffee. Will the witness please take the stand.Godot:\nName and occupation, if you don't mind.Kudo:\nThe name is Victor Kudo. Born and bred in the Land of the Rising Sun! Honor and duty are what make me. Mind you, I can be quite emotional at times, too.Phoenix:\nWe don't need to hear about that, Mr. Kudo. Just tell the court your occupation.Kudo:\nMy occupation? Kah! Listen, young'un! How much call d'you think there is for kimono embroidery here!?Phoenix:\nKimono embroidery?Kudo:\nThat's what I do! Or did, back in Japan. I embroidered family crests on kimonos! My ancestors were embroidering kimonos before this country even existed!Maya:\nWow, a real craftsman! They're a dying breed! Hey! Maybe he could embroider my costume sometime.Kudo:\nAnyway, like I said. There's not much demand for that kind of thing here. So I had to take a job working the cash register at a burger joint... pretending to smile!Phoenix:\n(That burger joint would've been better off putting him in the kitchen...)Judge:\nNow then, witness. Were you in the restaurant at the time of the incident?Kudo:\nOh, yes! I was eating some seeds over a cup of javaccino.Judge:\nSeeds?Kudo:\nWhat do you think these are, hmm!?Judge:\nI-I see...Godot:\nSo you saw everything that happened, gramps?Kudo:\nDid I!? Oh, yes! Oh, yes I did! I saw it all!Godot:\nThen please, tell the court. We're all ears.Kudo:\nSure, sure. I'll tell you. I'll tell you every last detail!Phoenix:\n(He's really getting into this...)Witness Testimony-- What I Witnessed --Kudo:\nThe young man was reading the sports paper.\nThe serving girl brought him a javaccino... But she put something in it!\nThe man took one sip of it, looked like he was in terrible pain, and then collapsed.\nThat's the serving girl, right there in the defendant's chair. I remember her well!Judge:\nMr. Kudo. she is not a \"serving girl\". Please refer to her as a waitress.Kudo:\nKah! You're as bad as the rest of them! All these newfangled words! What's wrong with old-fashioned ones, hmm!?Judge:\nN-Newfangled?Kudo:\nAll this talk of \"radios\" and \"glasses\"! It's \"wireless\" and \"spectacles\", I tell you!Judge:\nE-Excuse me...Kudo:\nListen to me, everyone! Don't forget the old values! Don't let the good old days slip away!Judge:\nWell, um... I think it's time to begin the cross-examination, Mr. Wright.Phoenix:\nY-Yes, Your Honor.Cross ExaminationCross Examination-- What I Witnessed --Kudo:\nThe young man was reading the sports paper.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo you saw the victim, then? You saw Mr. Glen Elg?\nKudo:\nI wanted to know if Gusten Brawn retained his championship or not.\nPhoenix:\n(So he was looking at the sports paper the victim was reading, huh...) And at the location in question... ...there are partitions between tables on the same side of the restaurant, right?\nKudo:\nSo what if there are?\nPhoenix:\nIf you say that you could see the victim... ...that means you were sitting at a table on the other side of the restaurant, correct?\nKudo:\nKah! I go to that place to drink javaccino! I don't go to sit! I don't remember what table I was sitting at!\nPhoenix:\n(You mean you go there to eye the waitress!)Kudo:\nThe serving girl brought him a javaccino... But she put something in it!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nMr. Kudo. That is a very grave accusation. Are you sure about what you saw?\nKudo:\nVictor Kudo never makes mistakes! I dot every t and cross every i!\nPhoenix:\nI see...\nKudo:\nMy eyesight's fine. The doctor said I only need spectacles for reading and driving.\nPhoenix:\n(...I bet his eyes are only really \"fine\" when he's scoping out a waitress.)\nKudo:\nAnd I saw what the serving girl put into the javaccino as well!\nPhoenix:\n(I bet I know what's coming up and something tells me I'm not going to like it...)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(It'd be dangerous to press this too much. I'd better ignore it for now.) So, what happened next?\nLeads back to cross-examination\n\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nYour Honor. We need more clarification on what was put into the victim's coffee. I'd like to ask that the witness add what he knows about this to his testimony.\nJudge:\nHmm... I agree. Witness, will you enlighten us, please?\nKudo:\nSure, sure.\nAdds statement \"There's no question about it! She very conspicuously put some white powder in there.\"Press (after adding statement \"There's no question about it! She very conspicuously put some white powder in there.\")\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nMr. Kudo. That is a very grave accusation. Are you sure about what you saw?\nKudo:\nVictor Kudo never makes mistakes! I dot every t and cross every i!\nPhoenix:\nI see...\nKudo:\nMy eyesight's fine. The doctor said I only need spectacles for reading and driving.\nPhoenix:\n(...I bet his eyes are only really \"fine\" when he's scoping out a waitress.)\nKudo:\nAnd I saw what the serving girl put into the javaccino as well!Kudo:\nThere's no question about it! She very conspicuously put some white powder in there.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nD-Did she really put that into the coffee?\nKudo:\nYou doubt me, boy!? She too some out of a small, brown bottle and sprinkled it in.\nPhoenix:\nCouldn't she have been adding sugar?\nKudo:\nSugar!? In a small, brown bottle like that!?\nJudge:\n\"Like that\"? Witness, could you please describe the bottle in more concrete terms?\nGodot:\nHa...! A bottle like this, perhaps?\nKudo:\nOh, there it is! That's the one!\nJudge:\nThat's the bottle of potassium cyanide, I presume?\nGodot:\nSo what did the accused put into the coffee? I think it's clear, don't you?\nPhoenix:\nArgh...Kudo:\nThe man took one sip of it, looked like he was in terrible pain, and then collapsed.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHe took just one sip?\nKudo:\nYou young'uns! You waste everything! Those javaccinos cost 8 dollars! In the good old days, we would have drank every last drop, eaten the cup, and then died!\nPhoenix:\n(Congratulations. You have earned the title of Battiest Man To Grace A Courtroom.)\nGodot:\nSo it was an immediate death? Well, with potassium cyanide, I suppose that is possible.\nKudo:\nOh, yes. He slumped over without so much as a twitch! I felt the javaccino I'd just drank turn sour in my stomach.\nGodot:\nOh, yes. I know that feeling.\nJudge:\nAnd the waitress? I presume she is...?Kudo:\nThat's the serving girl, right there in the defendant's chair. I remember her well!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou said, \"I remember her well\" in reference to the waitress... Did she have any particular features that you can identify her by?\nKudo:\nParticular features!? It's a disgrace, that's what it is!\nPhoenix:\nSorry?\nKudo:\nYou can see all the way up to her... her... You know! She's practically naked in that uniform!\nPhoenix:\n\nPhoenix:\nSo the particular feature you recognize about the waitress is... her outfit!? But anyone could wear just such an [sic] uniform! Even me!\nJudge:\nMr. Wright! Please spare the court of any further mental anguish from that image.\nMaya:\nDon't get all excited, Nick! You've gotta keep yourself together!\nPhoenix:\n(I-I guess I got a bit carried away...)\nKudo:\nKah! There are other things I recognize about her, too.\nPhoenix:\n(He seems pretty sure of himself. What should I do?)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(There's got to be a better line of attack than this. That's what I should be looking for now...)\nLeads back to cross-examination\n\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nSure, you saw a waitress take the coffee over to the victim. But what matters is whether that waitress was Maggey Byrde or not.\nJudge:\nQuite right. Mr. Kudo. These other \"features\" that you recognize about the defendant... I would ask you to add them to your testimony.\nKudo:\nSure, sure.\nAdds statement \"There was a ribbon in her hair, and her apron's straps were loose.\"Press (after adding statement \"There was a ribbon in her hair, and her apron's straps were loose.\")\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou said, \"I remember her well\" in reference to the waitress... Did she have any particular features that you can identify her by?\nKudo:\nParticular features!? It's a disgrace, that's what it is!\nPhoenix:\nSorry?\nKudo:\nYou can see all the way up to her... her... You know! She's practically naked in that uniform!\nPhoenix:\n\nPhoenix:\nSo the particular feature you recognize about the waitress is... her outfit!? But anyone could wear just such an [sic] uniform! Even me!\nJudge:\nMr. Wright! Please spare the court of any further mental anguish from that image.\nMaya:\nDon't get all excited, Nick! You've gotta keep yourself together!\nPhoenix:\n(I-I guess I got a bit carried away...)\nKudo:\nKah! There are other things I recognize about her, too.Kudo:\nThere was a ribbon in her hair, and her apron's straps were loose.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou do seem to remember several details about her appearance. But what about the most crucial detail of all... her face?\nKudo:\nKah! As if I wouldn't remember that!\nGodot:\n\nGodot:\nThe witness noticed the straps on the accused's apron. He'd unlikely to make a mistake about her face.\nKudo:\nThat's right! I can even tell you the color of the ribbon in her hair. It was red!\nGodot:\nSo you see, there's nothing wrong with the witness's eyesight.\nJudge:\nHmm...\nPhoenix:\n(There's no doubt he remembers the waitress pretty well. What should I do? I get the feeling there's something more to this somehow...)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(No, I must be imagining it. I need to find another angle with this guy.)\nLeads back to cross-examination\n\n\n\n\nAsk about the straps\n\n\n\n\n\n\n\nPhoenix:\nMr. Kudo. You seem especially interested in straps. Why is that?\nKudo:\nWh-What?\nPhoenix:\nThe ribbon in her hair, the straps on her apron. What's the fascination?\nKudo:\nF-Fascination?\nGodot:\n\nGodot:\nPeople have all kinds of fetishes, Trite. We don't need to embarrass the witness.\nKudo:\nListen, you young upstarts! I haven't got some sick strap fetish!\nJudge:\nHmm... Is there any relevance to the witness's unusual love of straps, Mr. Wright?\nPhoenix:\nI was just curious as to why he was so fixated on the waitress's straps...\nKudo:\nI said I haven't got a strap fetish! How many times do I have to repeat myself!?\nJudge:\nVery well. Continue with your testimony, Mr. Kudo. And make it strapless.\nKudo:\n*grumble grumble*\nLeads back to cross-examination\n\n\n\n\nAsk about the waitress's back\n\n\n\n\n\n\n\nPhoenix:\nThe identifying \"features\" you described are all things you would see from the back.\nKudo:\nSo what?\nPhoenix:\nIs it possible that... ...you never saw the waitress from the front at all!?\nGodot:\n\nGodot:\nHa...! He's got you there, gramps!\nPhoenix:\nPeople normally talk about facial features when they're asked to describe someone. But this witness's testimony is nothing but straps and ribbons!\nKudo:\nTh-This is harassment! I tell you I'm not obsessed with straps or ribbons! I'm just telling you what I saw!\nJudge:\nMr. Kudo, the court requests that you add details about any identifying features... Features you observed from the front, that is, to your testimony.\nKudo:\nSure, sure.\nMaya:\nThe old man's testimony is getting longer and longer!\nPhoenix:\nAnd if I can't find a hole in it soon, it'll get even longer, I bet.\nAdds statement \"There wasn't anything that caught my interest about her when I saw her from the front.\"Press (after adding statement \"There wasn't anything that caught my interest about her when I saw her from the front.\")\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou do seem to remember several details about her appearance. But what about the most crucial detail of all... her face?\nKudo:\nKah! As if I wouldn't remember that!\nGodot:\n\nGodot:\nThe witness noticed the straps on the accused's apron. He'd unlikely to make a mistake about her face.\nKudo:\nThat's right! I can even tell you the color of the ribbon in her hair. It was red!\nGodot:\nSo you see, there's nothing wrong with the witness's eyesight.\nJudge:\nHmm...Kudo:\nThere wasn't anything that caught my interest about her when I saw her from the front.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou didn't find anything to be distinct, but you did clearly see the witness's face, yes?\nKudo:\nNo question about it! I didn't come this far to back down now! Victor Kudo never backs down!\nPhoenix:\n(That's not the answer I was looking for, but OK...)\nMaya:\nThis has turned into a matter of pride for Old Seedy now, I guess... I wonder if he really did see Maggey's face or not...\nPhoenix:\n(Like I thought, we need some concrete proof of this. Proof that the old guy didn't see the waitress clearly from the front.)Present Apron\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Mr. Kudo. I would like you to please take a look at this.\"Maya:\nDo you think Old Seedy really saw Maggey do it?Phoenix:\nWell, he probably had his eye on the waitress the whole time. That's why he was there.Maya:\nBut he was there for the cute outfits, right? Not the waitress...Phoenix:\nI-I guess... (Hmm, she makes a good point though...)Maya:\nHey! Did I just say something clever?Phoenix:\nI wonder if the waitress Mr. Kudo saw really was Maggey...Maya:\nThat's what we have to figure out, Nick!",
      "testimonies": [
        {
          "testimony": "The young man was reading the sports paper.",
          "person": "Kudo",
          "present": []
        },
        {
          "testimony": "The serving girl brought him a javaccino... But she put something in it!",
          "person": "Kudo",
          "present": []
        },
        {
          "testimony": "There's no question about it! She very conspicuously put some white powder in there.",
          "person": "Kudo",
          "present": []
        },
        {
          "testimony": "The man took one sip of it, looked like he was in terrible pain, and then collapsed.",
          "person": "Kudo",
          "present": []
        },
        {
          "testimony": "That's the serving girl, right there in the defendant's chair. I remember her well!",
          "person": "Kudo",
          "present": []
        },
        {
          "testimony": "There was a ribbon in her hair, and her apron's straps were loose.",
          "person": "Kudo",
          "present": []
        },
        {
          "testimony": "There wasn't anything that caught my interest about her when I saw her from the front.",
          "person": "Kudo",
          "present": [
            "Apron"
          ],
          "source": {
            "evidence_span": "Worn by Maggey at the time of the incident. Has small pockets but big stains.",
            "testimony_span": "There wasn't anything that caught my interest about her when I saw her from the front.",
            "explanation": "The heavily stained apron worn by the waitress must have caught the witness' attention, so the witness could not have seen the waitress from the front.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        }
      ],
      "noPresent": false,
      "labels": [
        "physical"
      ],
      "reasoning": [
        "Fact 1: The witness claims nothing about Maggey caught his interest.",
        "Fact 2: The evidence suggests Maggey was wearing a heavily stained apron.",
        "Prop 1: If a clothing is heavily stained, it is likely to catch someone's interest."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- What I Witnessed --Kudo:\nThe young man was reading the sports paper.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo you saw the victim, then? You saw Mr. Glen Elg?\nKudo:\nI wanted to know if Gusten Brawn retained his championship or not.\nPhoenix:\n(So he was looking at the sports paper the victim was reading, huh...) And at the location in question... ...there are partitions between tables on the same side of the restaurant, right?\nKudo:\nSo what if there are?\nPhoenix:\nIf you say that you could see the victim... ...that means you were sitting at a table on the other side of the restaurant, correct?\nKudo:\nKah! I go to that place to drink javaccino! I don't go to sit! I don't remember what table I was sitting at!\nPhoenix:\n(You mean you go there to eye the waitress!)Kudo:\nThe serving girl brought him a javaccino... But she put something in it!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nMr. Kudo. That is a very grave accusation. Are you sure about what you saw?\nKudo:\nVictor Kudo never makes mistakes! I dot every t and cross every i!\nPhoenix:\nI see...\nKudo:\nMy eyesight's fine. The doctor said I only need spectacles for reading and driving.\nPhoenix:\n(...I bet his eyes are only really \"fine\" when he's scoping out a waitress.)\nKudo:\nAnd I saw what the serving girl put into the javaccino as well!\nPhoenix:\n(I bet I know what's coming up and something tells me I'm not going to like it...)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(It'd be dangerous to press this too much. I'd better ignore it for now.) So, what happened next?\nLeads back to cross-examination\n\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nYour Honor. We need more clarification on what was put into the victim's coffee. I'd like to ask that the witness add what he knows about this to his testimony.\nJudge:\nHmm... I agree. Witness, will you enlighten us, please?\nKudo:\nSure, sure.\nAdds statement \"There's no question about it! She very conspicuously put some white powder in there.\"Press (after adding statement \"There's no question about it! She very conspicuously put some white powder in there.\")\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nMr. Kudo. That is a very grave accusation. Are you sure about what you saw?\nKudo:\nVictor Kudo never makes mistakes! I dot every t and cross every i!\nPhoenix:\nI see...\nKudo:\nMy eyesight's fine. The doctor said I only need spectacles for reading and driving.\nPhoenix:\n(...I bet his eyes are only really \"fine\" when he's scoping out a waitress.)\nKudo:\nAnd I saw what the serving girl put into the javaccino as well!Kudo:\nThere's no question about it! She very conspicuously put some white powder in there.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nD-Did she really put that into the coffee?\nKudo:\nYou doubt me, boy!? She too some out of a small, brown bottle and sprinkled it in.\nPhoenix:\nCouldn't she have been adding sugar?\nKudo:\nSugar!? In a small, brown bottle like that!?\nJudge:\n\"Like that\"? Witness, could you please describe the bottle in more concrete terms?\nGodot:\nHa...! A bottle like this, perhaps?\nKudo:\nOh, there it is! That's the one!\nJudge:\nThat's the bottle of potassium cyanide, I presume?\nGodot:\nSo what did the accused put into the coffee? I think it's clear, don't you?\nPhoenix:\nArgh...Kudo:\nThe man took one sip of it, looked like he was in terrible pain, and then collapsed.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHe took just one sip?\nKudo:\nYou young'uns! You waste everything! Those javaccinos cost 8 dollars! In the good old days, we would have drank every last drop, eaten the cup, and then died!\nPhoenix:\n(Congratulations. You have earned the title of Battiest Man To Grace A Courtroom.)\nGodot:\nSo it was an immediate death? Well, with potassium cyanide, I suppose that is possible.\nKudo:\nOh, yes. He slumped over without so much as a twitch! I felt the javaccino I'd just drank turn sour in my stomach.\nGodot:\nOh, yes. I know that feeling.\nJudge:\nAnd the waitress? I presume she is...?Kudo:\nThat's the serving girl, right there in the defendant's chair. I remember her well!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou said, \"I remember her well\" in reference to the waitress... Did she have any particular features that you can identify her by?\nKudo:\nParticular features!? It's a disgrace, that's what it is!\nPhoenix:\nSorry?\nKudo:\nYou can see all the way up to her... her... You know! She's practically naked in that uniform!\nPhoenix:\n\nPhoenix:\nSo the particular feature you recognize about the waitress is... her outfit!? But anyone could wear just such an [sic] uniform! Even me!\nJudge:\nMr. Wright! Please spare the court of any further mental anguish from that image.\nMaya:\nDon't get all excited, Nick! You've gotta keep yourself together!\nPhoenix:\n(I-I guess I got a bit carried away...)\nKudo:\nKah! There are other things I recognize about her, too.\nPhoenix:\n(He seems pretty sure of himself. What should I do?)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(There's got to be a better line of attack than this. That's what I should be looking for now...)\nLeads back to cross-examination\n\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nSure, you saw a waitress take the coffee over to the victim. But what matters is whether that waitress was Maggey Byrde or not.\nJudge:\nQuite right. Mr. Kudo. These other \"features\" that you recognize about the defendant... I would ask you to add them to your testimony.\nKudo:\nSure, sure.\nAdds statement \"There was a ribbon in her hair, and her apron's straps were loose.\"Press (after adding statement \"There was a ribbon in her hair, and her apron's straps were loose.\")\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou said, \"I remember her well\" in reference to the waitress... Did she have any particular features that you can identify her by?\nKudo:\nParticular features!? It's a disgrace, that's what it is!\nPhoenix:\nSorry?\nKudo:\nYou can see all the way up to her... her... You know! She's practically naked in that uniform!\nPhoenix:\n\nPhoenix:\nSo the particular feature you recognize about the waitress is... her outfit!? But anyone could wear just such an [sic] uniform! Even me!\nJudge:\nMr. Wright! Please spare the court of any further mental anguish from that image.\nMaya:\nDon't get all excited, Nick! You've gotta keep yourself together!\nPhoenix:\n(I-I guess I got a bit carried away...)\nKudo:\nKah! There are other things I recognize about her, too.Kudo:\nThere was a ribbon in her hair, and her apron's straps were loose.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou do seem to remember several details about her appearance. But what about the most crucial detail of all... her face?\nKudo:\nKah! As if I wouldn't remember that!\nGodot:\n\nGodot:\nThe witness noticed the straps on the accused's apron. He'd unlikely to make a mistake about her face.\nKudo:\nThat's right! I can even tell you the color of the ribbon in her hair. It was red!\nGodot:\nSo you see, there's nothing wrong with the witness's eyesight.\nJudge:\nHmm...\nPhoenix:\n(There's no doubt he remembers the waitress pretty well. What should I do? I get the feeling there's something more to this somehow...)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(No, I must be imagining it. I need to find another angle with this guy.)\nLeads back to cross-examination\n\n\n\n\nAsk about the straps\n\n\n\n\n\n\n\nPhoenix:\nMr. Kudo. You seem especially interested in straps. Why is that?\nKudo:\nWh-What?\nPhoenix:\nThe ribbon in her hair, the straps on her apron. What's the fascination?\nKudo:\nF-Fascination?\nGodot:\n\nGodot:\nPeople have all kinds of fetishes, Trite. We don't need to embarrass the witness.\nKudo:\nListen, you young upstarts! I haven't got some sick strap fetish!\nJudge:\nHmm... Is there any relevance to the witness's unusual love of straps, Mr. Wright?\nPhoenix:\nI was just curious as to why he was so fixated on the waitress's straps...\nKudo:\nI said I haven't got a strap fetish! How many times do I have to repeat myself!?\nJudge:\nVery well. Continue with your testimony, Mr. Kudo. And make it strapless.\nKudo:\n*grumble grumble*\nLeads back to cross-examination\n\n\n\n\nAsk about the waitress's back\n\n\n\n\n\n\n\nPhoenix:\nThe identifying \"features\" you described are all things you would see from the back.\nKudo:\nSo what?\nPhoenix:\nIs it possible that... ...you never saw the waitress from the front at all!?\nGodot:\n\nGodot:\nHa...! He's got you there, gramps!\nPhoenix:\nPeople normally talk about facial features when they're asked to describe someone. But this witness's testimony is nothing but straps and ribbons!\nKudo:\nTh-This is harassment! I tell you I'm not obsessed with straps or ribbons! I'm just telling you what I saw!\nJudge:\nMr. Kudo, the court requests that you add details about any identifying features... Features you observed from the front, that is, to your testimony.\nKudo:\nSure, sure.\nMaya:\nThe old man's testimony is getting longer and longer!\nPhoenix:\nAnd if I can't find a hole in it soon, it'll get even longer, I bet.\nAdds statement \"There wasn't anything that caught my interest about her when I saw her from the front.\"Press (after adding statement \"There wasn't anything that caught my interest about her when I saw her from the front.\")\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou do seem to remember several details about her appearance. But what about the most crucial detail of all... her face?\nKudo:\nKah! As if I wouldn't remember that!\nGodot:\n\nGodot:\nThe witness noticed the straps on the accused's apron. He'd unlikely to make a mistake about her face.\nKudo:\nThat's right! I can even tell you the color of the ribbon in her hair. It was red!\nGodot:\nSo you see, there's nothing wrong with the witness's eyesight.\nJudge:\nHmm...Kudo:\nThere wasn't anything that caught my interest about her when I saw her from the front.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou didn't find anything to be distinct, but you did clearly see the witness's face, yes?\nKudo:\nNo question about it! I didn't come this far to back down now! Victor Kudo never backs down!\nPhoenix:\n(That's not the answer I was looking for, but OK...)\nMaya:\nThis has turned into a matter of pride for Old Seedy now, I guess... I wonder if he really did see Maggey's face or not...\nPhoenix:\n(Like I thought, we need some concrete proof of this. Proof that the old guy didn't see the waitress clearly from the front.)Present Apron\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Mr. Kudo. I would like you to please take a look at this.\"Maya:\nDo you think Old Seedy really saw Maggey do it?Phoenix:\nWell, he probably had his eye on the waitress the whole time. That's why he was there.Maya:\nBut he was there for the cute outfits, right? Not the waitress...Phoenix:\nI-I guess... (Hmm, she makes a good point though...)Maya:\nHey! Did I just say something clever?Phoenix:\nI wonder if the waitress Mr. Kudo saw really was Maggey...Maya:\nThat's what we have to figure out, Nick!Phoenix:\nMr. Kudo. I would like you to please take a look at this.Kudo:\nKah! That filthy thing would suit filth like you just perfectly. Actually, it reminds me of what my grandson looks like, just after he's done eating.Phoenix:\nHave you ever seen this before?Kudo:\nOf course I haven't! Do you think I'd forget something as dirty as that!? Hmm? Well? You half-witted clot!?Phoenix:\n...Judge:\n............Kudo:\nWh-What!? What is it!? Ever since I said, \"you half-witted clot\", there's been an eerie silence in here.Phoenix:\nMr. Kudo. This apron... ...is the apron worn by the defendant on the day of the poisoning!Kudo:\nUh?Phoenix:\nAnd as you just said yourself... ...you wouldn't forget something like this. Which means, is you had really seen this apron before...Kudo:\nEr...Phoenix:\nYes, you know what I'm getting at! You couldn't have possibly seen the waitress from the front!Kudo:\n... Oops!Judge:\nWitness! You can't just \"oops\" your way out of this!Godot:\nHa...! Well, well... Looks like we finally have a genuine trial on our hands.Phoenix:\n...Godot:\nListen, Trite. Here are the facts. On the day of the incident, there was only one waitress in the restaurant.Judge:\nThat being the defendant, Ms. Maggey Byrde?Godot:\nExactly. And when that one waitress put the poison into the coffee cup... ...this old guy was watching!Judge:\nHmm... I hope you understand the gravity of the situation, Mr. Kudo. The fate of the defendant may rest on what you say you remember seeing.Godot:\nJust tell the court exactly what you saw, gramps.Kudo:\nYou can rely on me, Captain! My noggin's in perfect working order. I can't remember a single occasion when I forgot what burger a customer wanted!Maya:\nHe can't remember? Probably more like he messes up so many times, he's blocking it out...Judge:\nVery well. Let's test just how good your memory and attention to detail is, Mr. Kudo. Tell us what you remember about the victim.Witness Testimony-- About the Victim --Kudo:\nHe was another of those pesky young types, wearing a broken pair of spectacles.\nHe had a newspaper in his right hand, and the noisy brat kept rustling its pages!\nThe young man was listening to the wireless. I remember that well.\nThen the serving girl in question brought over the javaccino.\nThe little fidget picked up the cup with his free hand and took a sip.Judge:\nThe testimony we have just heard was to test how credible the witness's memory is. It seems to me that he remembers the victim in a great deal of detail.Kudo:\nOh, yes! I hate those you-know-what types who are so vague about everything!Maya:\nHow are we going to handle this, Nick?Phoenix:\nWe only need to do one thing. We just need to prove that the old man's memory is shot.Maya:\nJust trip him up, you mean? Isn't that kind of cruel?Phoenix:\n(I suppose... But it's what I do best.)Cross ExaminationCross Examination-- About the Victim --Kudo:\nHe was another of those pesky young types, wearing a broken pair of spectacles.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSpectacles?\nKudo:\nDark glasses to you! One of the lenses was green, but the other was broken. Newfangled rubbish! That's why I remember him so well.\nPhoenix:\n(He did have some kind of lens over his left eye... But I wouldn't have called it a pair of glasses.)\nJudge:\nHmm... He seems to have been wearing some rather modern-looking shades. Perhaps I should take to wearing some, and rival Mr. Godot's sharp appearance.\nMaya:\nAh! We better come up with something sharp, and quick!\nPhoenix:\n(Guess I'll wait and see if I should challenge him about the \"spectacles\"...)Kudo:\nHe had a newspaper in his right hand, and the noisy brat kept rustling its pages!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe newspaper was a sports paper, was it?\nKudo:\nThat young hooligan! I nearly asked him, \"Can't you even read without fidgeting, hmm!?\" How was I supposed to be able to read the back page with all that rustling going on!? I needed to find out if Gusten Brawn retained his championship title!\nPhoenix:\n(It was his paper, not yours! If you wanted to know so bad, why didn't you buy your own!?)\nKudo:\nWhat are looking [sic] at me like that for, hmm!? How dare you judge me!\nPhoenix:\nOw! Ooow!\nMaya:\nGusten Brawn got beaten yesterday, by the way. Anyway...Kudo:\nThe young man was listening to the wireless. I remember that well.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe wireless?\nKudo:\nThe decadent young rascal! In my day, it was one or the other! Read the paper, or listen to the wireless!\nPhoenix:\n(...Oh boy.)\nKudo:\nAnd using an earpiece! It's selfish, that's what it is! I was straining my ears, but I couldn't catch any of it.\nPhoenix:\n(Was he that desperate to listen to the radio...?)\nKudo:\nWhat are looking [sic] at me like that for, hmm!? 2 you feel sorry for me!\nPhoenix:\nOw! Oooow!Kudo:\nThen the serving girl in question brought over the javaccino.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou mean the waitress, who you only saw from behind, right?\nKudo:\nYou're one of those, are you? You never let anything go, isn't that right?\nPhoenix:\n...Maybe.\nKudo:\nWhat does it matter if I saw her from the front or from behind!? My eyes don't lie!\nPhoenix:\nOw! Oooow! (I better not push it until I've got some hard evidence.)Kudo:\nThe little fidget picked up the cup with his free hand and took a sip.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n\"His free hand\"?\nKudo:\nYes.\nPhoenix:\nWhich hand was that?\nKudo:\nWeren't you listening before, cloth-ears!? I said he was rustling the newspaper with his right hand, didn't I? If his free hand wasn't his right hand, then which hand was it, you moron!\nPhoenix:\nOw! Oooow!\nGodot:\nHa...! Perhaps the great Mr. Trite has three hands!\nPhoenix:\n(Yeesh! I was only asking! No need to gang up on me and treat me like a freak!)Present Coffee Cup\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Mr. Kudo. Do you remember what you were told at the start of this testimony?\"Phoenix:\n(The whole point of this cross-examination is to establish just one thing... That this old guy's memory has more holes than a slice of Swiss.)Maya:\nI guess we just need to find a contradiction in his testimony somewhere, huh?Phoenix:\n(Anything will do. Even the smallest detail. We just need one mistake, and he's ours!)",
      "testimonies": [
        {
          "testimony": "He was another of those pesky young types, wearing a broken pair of spectacles.",
          "person": "Kudo",
          "present": []
        },
        {
          "testimony": "He had a newspaper in his right hand, and the noisy brat kept rustling its pages!",
          "person": "Kudo",
          "present": []
        },
        {
          "testimony": "The young man was listening to the wireless. I remember that well.",
          "person": "Kudo",
          "present": []
        },
        {
          "testimony": "Then the serving girl in question brought over the javaccino.",
          "person": "Kudo",
          "present": []
        },
        {
          "testimony": "The little fidget picked up the cup with his free hand and took a sip.",
          "person": "Kudo",
          "present": [
            "Coffee Cup"
          ],
          "source": {
            "evidence_span": "Facing the cup, one can see a lip stain on the front, and a floral looking handle to the right.",
            "testimony_span": "The little fidget picked up the cup with his free hand and took a sip.",
            "explanation": "Since the victim was holding the paper in his right hand, his free hand would be his left. However, the photo shows that the user of the coffee up used their right hand based on the relative position of the handle and the stain.",
            "is_self_contained": "no",
            "context_span": "He had a newspaper in his right hand"
          }
        }
      ],
      "noPresent": false,
      "labels": [
        "spatial",
        "behavioral",
        "causal"
      ],
      "reasoning": [
        "Fact 1: The witness claims the victim held the cup with his free hand.",
        "Fact 2: The evidence suggests the handle of cup is to the right of the lip stain.",
        "Fact 3: The context suggests the victim was holding the paper in his right hand.",
        "Prop 1: If someone is holding something in their right hand, their free hand would be their left hand.",
        "Prop 2: If the handle of cup is to the right of the lip stain, the user of the cup used their right hand."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- About the Victim --Kudo:\nHe was another of those pesky young types, wearing a broken pair of spectacles.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSpectacles?\nKudo:\nDark glasses to you! One of the lenses was green, but the other was broken. Newfangled rubbish! That's why I remember him so well.\nPhoenix:\n(He did have some kind of lens over his left eye... But I wouldn't have called it a pair of glasses.)\nJudge:\nHmm... He seems to have been wearing some rather modern-looking shades. Perhaps I should take to wearing some, and rival Mr. Godot's sharp appearance.\nMaya:\nAh! We better come up with something sharp, and quick!\nPhoenix:\n(Guess I'll wait and see if I should challenge him about the \"spectacles\"...)Kudo:\nHe had a newspaper in his right hand, and the noisy brat kept rustling its pages!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe newspaper was a sports paper, was it?\nKudo:\nThat young hooligan! I nearly asked him, \"Can't you even read without fidgeting, hmm!?\" How was I supposed to be able to read the back page with all that rustling going on!? I needed to find out if Gusten Brawn retained his championship title!\nPhoenix:\n(It was his paper, not yours! If you wanted to know so bad, why didn't you buy your own!?)\nKudo:\nWhat are looking [sic] at me like that for, hmm!? How dare you judge me!\nPhoenix:\nOw! Ooow!\nMaya:\nGusten Brawn got beaten yesterday, by the way. Anyway...Kudo:\nThe young man was listening to the wireless. I remember that well.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe wireless?\nKudo:\nThe decadent young rascal! In my day, it was one or the other! Read the paper, or listen to the wireless!\nPhoenix:\n(...Oh boy.)\nKudo:\nAnd using an earpiece! It's selfish, that's what it is! I was straining my ears, but I couldn't catch any of it.\nPhoenix:\n(Was he that desperate to listen to the radio...?)\nKudo:\nWhat are looking [sic] at me like that for, hmm!? 2 you feel sorry for me!\nPhoenix:\nOw! Oooow!Kudo:\nThen the serving girl in question brought over the javaccino.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou mean the waitress, who you only saw from behind, right?\nKudo:\nYou're one of those, are you? You never let anything go, isn't that right?\nPhoenix:\n...Maybe.\nKudo:\nWhat does it matter if I saw her from the front or from behind!? My eyes don't lie!\nPhoenix:\nOw! Oooow! (I better not push it until I've got some hard evidence.)Kudo:\nThe little fidget picked up the cup with his free hand and took a sip.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n\"His free hand\"?\nKudo:\nYes.\nPhoenix:\nWhich hand was that?\nKudo:\nWeren't you listening before, cloth-ears!? I said he was rustling the newspaper with his right hand, didn't I? If his free hand wasn't his right hand, then which hand was it, you moron!\nPhoenix:\nOw! Oooow!\nGodot:\nHa...! Perhaps the great Mr. Trite has three hands!\nPhoenix:\n(Yeesh! I was only asking! No need to gang up on me and treat me like a freak!)Present Coffee Cup\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Mr. Kudo. Do you remember what you were told at the start of this testimony?\"Phoenix:\n(The whole point of this cross-examination is to establish just one thing... That this old guy's memory has more holes than a slice of Swiss.)Maya:\nI guess we just need to find a contradiction in his testimony somewhere, huh?Phoenix:\n(Anything will do. Even the smallest detail. We just need one mistake, and he's ours!)Phoenix:\nMr. Kudo. Do you remember what you were told at the start of this testimony? That this was a way of testing the credibility of your memory?Kudo:\nI know, I know! There's nothing wrong with my memory, I tell you! Nothing! If I got anything wrong, I'll eat these seeds and sing the pigeon song!Godot:\nCare to tell us where this is going, Trite?Phoenix:\nAccording to Mr. Kudo, the victim was holding the paper in his right hand... ...while drinking coffee with his free hand, which would make that his left.Kudo:\nKah! What is this? Kindergarten?Phoenix:\nBut I would like the court to please take a look at this.Judge:\nThat's the cup victim used, correct?Phoenix:\nYes, and on the rim, you'll notice the mark left by the victim's lips.Judge:\nYes. There is a stain left by the coffee.Phoenix:\nIf you consider where that stain is, you'll clearly see... ...that the victim was holding the cup in his right hand!Kudo:\nBut how...?Phoenix:\nWell, Mr. Kudo. The court is waiting for your epic performance! You said you'd eat those seeds and sing the pigeon song!Kudo:\nAaaargh!Judge:\nMr. Kudo... I'm afraid this is simply not acceptable. I think the witness had better go back to the park where he came from.Kudo:\nWAAAAIT! If you think I'm going to stand here and listen to you tell me I'm mad, you're wrong! I don't care about that dirty coffee cup! I know what I saw!Judge:\nY-You still insist on your testimony?Kudo:\nThat young brat was holding the cup in his left hand! Oh, yes. No question! I'm a good, law-abiding citizen, I am. It's that dead young hotbot and you, you spikey-haired yahoo, who are at fault!Phoenix:\n(Who, me!?)Judge:\nTh-Thank you, old man. We've heard quite enough from you already.Kudo:\nDon't call me \"old man\", old man! Been around for 68 years, I have. You can't ignore me! LISTEN TO WHAT I'VE GOT TO SAAAAY!Judge:\nI'm sorry, Mr. Kudo, but...Godot:\nSure, why not hear a little more?Judge:\nM-Mr. Godot!Godot:\nBut this is my 16th cup of coffee... So this is your final stand.Kudo:\nThank you, Captain! You can rely on Victor!Witness Testimony-- Left Hand or Right Hand --Kudo:\nThe boy was wearing the earpiece on the same side as the green lens of his specs.\nHe kept fiddling with it all the time.\nHe was fiddling with it just before he picked up the cup, too.\nAnd then he used the same hand to pick up the cup. His left hand!Judge:\nWe know that the victim was wearing an unusual monocle over his left eye.Godot:\nIt wasn't a monocle, Your Honor. It was a small computer monitor often used by programmers.Judge:\nA monitor? You mean, like a television screen!?Godot:\nThe inside of the lens is a screen that displays computer data. It's called an HMD. It's a common tool in the victim's line of work.Kudo:\nHDTV, DVD, CD... All these newfangled letters drive me mad! But they don't matter. I know what I saw, and I'm telling the truth!Phoenix:\n(It's true... He doesn't seem to be lying.)Kudo:\nAnd those are the facts, in good old black and white!Cross ExaminationCross Examination-- Left Hand or Right Hand --Kudo:\nThe boy was wearing the earpiece on the same side as the green lens of his specs.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo the victim was wearing an HMD.\nKudo:\nHDTV, CD, DVD... What does it matter!?\nPhoenix:\n(It was none of them actually, but anyway...) And you're sure that he was wearing the earpiece on the same side?\nKudo:\nNo question! I could only see that side of his head from where I was sitting.\nPhoenix:\n(Yeah. That's pretty obvious if you look at the floor plans. From the opposite table, he'd only have a view of the side of the victim's head.)Present Victim's Prescription Bag or Glen Elg profile\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"I'm not sure what the relevance of this is, but...\"Kudo:\nHe kept fiddling with it all the time.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nIt seems you kept an eye on Mr. Glen Elg.\nKudo:\nHe was getting on my nerves! Rustling that newspaper and fiddling with his earpiece all the time! And then he went and made all that fuss dying from one sip of javaccino! I wanted to say to him, \"Calm down, you young brat!\" Just looking at him made me suddenly speed up my seed eating! I could've chocked!\nPhoenix:\n(So I take it the victim was a walking ball of nervous energy...)Kudo:\nHe was fiddling with it just before he picked up the cup, too.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe earpiece you mentioned... Which hand did the victim touch it with?\nKudo:\n... You're one of those people! One of those people who uses his left hand to get things out of his right pocket. Or fastens his left cuff with his right hand? And when the tour guide says, \"On your right side, you'll see the famous blah-blah\"... ...you're the only one who deliberately looks left! Well? Aren't you?\nPhoenix:\nN-No! I didn't mean...\nKudo:\nObviously he used the hand on the same side of his body that the earpiece was in!\nPhoenix:\nOw! Oooow! Ow! (So, if he had the HMD on his left side, then it was his left hand, I guess...)Kudo:\nAnd then he used the same hand to pick up the cup. His left hand!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou seem very sure of yourself, Mr. Kudo.\nKudo:\nThat's because I know what I saw, no matter what tricks you try to play on me!\nPhoenix:\n(It looks like he really did see the guy picking the cup up with his left hand. This is a dead end!)Maya:\nWell, Nick? What do you think?Phoenix:\nI think the guy's telling the truth. But even so... Something's not quite right.Maya:\nThen chuck evidence at him until he breaks!Phoenix:\n(But if he's not lying, there wouldn't be any contradictions in his testimony, right?)",
      "testimonies": [
        {
          "testimony": "The boy was wearing the earpiece on the same side as the green lens of his specs.",
          "person": "Kudo",
          "present": [
            "Victim's Prescription Bag",
            "Glen Elg"
          ],
          "source": {
            "evidence_span": [
              "Wore an HMD over left eye.",
              "Left eardrum was ruptured."
            ],
            "testimony_span": "The boy was wearing the earpiece on the same side as the green lens of his specs.",
            "explanation": "Since the victim wears the HMD on the left, the witness claims that he also wears the earpiece on the left. However, this could not have been possible because the victim couldn't hear with his left ear.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "He kept fiddling with it all the time.",
          "person": "Kudo",
          "present": []
        },
        {
          "testimony": "He was fiddling with it just before he picked up the cup, too.",
          "person": "Kudo",
          "present": []
        },
        {
          "testimony": "And then he used the same hand to pick up the cup. His left hand!",
          "person": "Kudo",
          "present": []
        }
      ],
      "noPresent": true,
      "labels": [
        "spatial",
        "behavioral",
        "causal"
      ],
      "reasoning": [
        "Fact 1: The witness claims the victim was wearing the earpiece on the same side as the lens.",
        "Fact 2: The first evidence suggests the victim was wearing the lens on the left side.",
        "Fact 3: The second evidence suggests the victim's left eardrum was ruptured.",
        "Prop 1: If someone's eardrum was ruptured, they wouldn't be able to hear with that ear.",
        "Prop 2: If someone cannot hear with an ear, they will not wear an earpiece in that ear."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- Left Hand or Right Hand --Kudo:\nThe boy was wearing the earpiece on the same side as the green lens of his specs.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo the victim was wearing an HMD.\nKudo:\nHDTV, CD, DVD... What does it matter!?\nPhoenix:\n(It was none of them actually, but anyway...) And you're sure that he was wearing the earpiece on the same side?\nKudo:\nNo question! I could only see that side of his head from where I was sitting.\nPhoenix:\n(Yeah. That's pretty obvious if you look at the floor plans. From the opposite table, he'd only have a view of the side of the victim's head.)Present Victim's Prescription Bag or Glen Elg profile\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"I'm not sure what the relevance of this is, but...\"Kudo:\nHe kept fiddling with it all the time.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nIt seems you kept an eye on Mr. Glen Elg.\nKudo:\nHe was getting on my nerves! Rustling that newspaper and fiddling with his earpiece all the time! And then he went and made all that fuss dying from one sip of javaccino! I wanted to say to him, \"Calm down, you young brat!\" Just looking at him made me suddenly speed up my seed eating! I could've chocked!\nPhoenix:\n(So I take it the victim was a walking ball of nervous energy...)Kudo:\nHe was fiddling with it just before he picked up the cup, too.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe earpiece you mentioned... Which hand did the victim touch it with?\nKudo:\n... You're one of those people! One of those people who uses his left hand to get things out of his right pocket. Or fastens his left cuff with his right hand? And when the tour guide says, \"On your right side, you'll see the famous blah-blah\"... ...you're the only one who deliberately looks left! Well? Aren't you?\nPhoenix:\nN-No! I didn't mean...\nKudo:\nObviously he used the hand on the same side of his body that the earpiece was in!\nPhoenix:\nOw! Oooow! Ow! (So, if he had the HMD on his left side, then it was his left hand, I guess...)Kudo:\nAnd then he used the same hand to pick up the cup. His left hand!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou seem very sure of yourself, Mr. Kudo.\nKudo:\nThat's because I know what I saw, no matter what tricks you try to play on me!\nPhoenix:\n(It looks like he really did see the guy picking the cup up with his left hand. This is a dead end!)Maya:\nWell, Nick? What do you think?Phoenix:\nI think the guy's telling the truth. But even so... Something's not quite right.Maya:\nThen chuck evidence at him until he breaks!Phoenix:\n(But if he's not lying, there wouldn't be any contradictions in his testimony, right?)Phoenix:\nI'm not sure what the relevance of this is, but... Mr. Kudo! There is something very strange about your observations of the victim.Kudo:\nWhat!?Phoenix:\nYou say he was wearing the earpiece on the same side as the HMD.Kudo:\nNo question! You can lock me up if I'm wrong! It was his left ear, without a doubt! I could only see that side of his head from where I was sitting.Phoenix:\nI don't think so.Kudo:\nWh-What did you say!?Phoenix:\nYou're no doubt unaware of this fact, Mr. Kudo. But the victim couldn't hear with his left ear! His eardrum was ruptured!Kudo:\nEh?Phoenix:\nTraces of medication for his condition were found in his ear canal. That's right! It's impossible that the victim was wearing his earpiece in his left ear. Because he couldn't even hear in that ear!Kudo:\n... Is that true, Captain?Godot:\n...It is.Kudo:\n...Pi... Pi-Pi-Pigeon! Hm-hm-hmm... Pretty pigeon! Hm-hm-hmm...Judge:\nOrder! Order! Order!Phoenix:\nThis witness's testimony is completely unreliable! He only saw the witness from behind. And he claims the victim was wearing an earpiece when we know his eardrum was ruptured! Well, Mr. Godot!?Godot:\nAaaargh! A single drop of milk is all it takes to destroy the pure black magic in the cup! The old man... ...is my drop of milk!Kudo:\nCaptain! Are you calling me a drip!?Judge:\nThis is the victim's coffee cup in which the potassium cyanide was found. The mark on the rim clearly shows that the victim picked it up with his right hand!Kudo:\nI'll never back down! I know I'm right! The lad drank his javaccino with his left hand!Godot:\nLet me put you out of your misery... Clearly, the victim used both hands. He took a sip with the cup held in his right hand, and then switched to his left... That's what the old man saw!Phoenix:Phoenix:\nImpossible! The witness has already testified on numerous occasions... ...that the victim died immediately after taking just one sip of the coffee.Godot:Godot:\nWhich hand the victim used to pick up his cup is irrelevant, Your Honor. The facts still stand! With one hand or the other, Mr. Elg drank the poisoned coffee... ...Like this!Phoenix:Phoenix:\nSadly, Mr. Godot, that doesn't wash! The point of this testimony was to establish whether the witness's memory was credible. And the results are clear! The testimony given by this witness is useless!Godot:\nPuuuurgh!Judge:\nI believe it is time to conclude today's proceedings. I am satisfied that the witness is not deceiving the court. But to be frank, his testimony is a farce!Kudo:\nD-Did you have to be so frank!? Take that, you pompous old fogey!Judge:\nI'm sorry, Mr. Kudo. You can't reach me from there. I'm ordering the defense and the prosecution to investigate this case further. That is all for now. This court is adjourned!???:Kudo:\nWAAAAIT! If we stop now, where does that leave me?Judge:\nLeave you, Mr. Kudo?Kudo:\nThanks to that blue-suited young upstart over there... ...I'm just a bumbling old man who can't even dot his t's or cross his i's now!Phoenix:\n(How is your bad memory my fault!?)Judge:\nI'm sorry, Mr. Kudo, but there's nothing I can do.Kudo:\nI've kept my mouth shut until now... ...but there's something else the court should know!Godot:\nWhat!?Phoenix:\nThere's more?Kudo:\nTo be perfectly honest, it might not be anything. But I want another chance! I want another crack at you, you young shark!Phoenix:\nM-Me? (He's looking at me like I'm some sort of evil Shogun...)Kudo:\nWell, everyone? What do you say to one final showdown? The final chapter in this eccentric old man's scrapbook!Godot:\nSorry, gramps... I've already had my 17th cup of coffee.Kudo:\nWhat have you got to lose, Captain? I'll give you all the javaccino you want if you come to my house after the trial. (Changed from [I'll give you all the coffee you want if you come to my house after the trial.] in the original release) I may be 68 years old, but Victor Kudo is still a man!Judge:\nThat's enough, witness. I believe it will be quicker for the court to just hear your testimony.Kudo:\nYou bet! Much, much quicker!Maya:\nI can't believe this is happening...Kudo:\nHa ha ha! You better get ready, youngster!Phoenix:\nI get the picture! Just quit throwing those seeds at me, would you!? (He's gotta be using some sort of infinite ammo code with that box of seeds...)Witness Testimony-- The Final Showdown --Kudo:\nFirst of all, I want to stress that this might be nothing. I'm not too sure of myself.\nThe young boy slumped over the table as soon as he took one sip of his javaccino...\nWell, the clumsy idiot upset the vase. He knocked it right over.\nIt broke, and the strip of cloth covering the table got completely soaked!\nWell!? How about that? Turned things upside-down, hmm?Judge:\n... Um... Is that all?Kudo:\nYes, that's all. I remember it perfectly. Eh!? You're doubting me again? You're doubting a poor, defenseless old man!?Judge:\nN-No. We are not doubting you, Mr. Kudo.Maya:\nDon't you get the feeling there's a question hanging on everyone's lips, Nick?Phoenix:\nYeah. \"So what?\" probably! That's all I can think of, and I have to cross-examine this guy!Kudo:\nYou're a birdbrain, that's why that's all you can think of!Judge:\nVery well... Mr. Wright. Your final cross-examination, please.Cross ExaminationCross Examination-- The Final Showdown --Kudo:\nFirst of all, I want to stress that this might be nothing. I'm not too sure of myself.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nUm... The court generally prefers if witnesses are sure of themselves, Mr. Kudo.\nKudo:\nNoisy brat! I'm warning you, I'm more savage than a macho man right now! You won't beat me with this testimony! This is the final battle!\nPhoenix:\nOw! Oooow! (He's chucking those seeds harder than ever! I better be careful...)\nMaya:\nCome on, Nick! Nail him!Kudo:\nThe young boy slumped over the table as soon as he took one sip of his javaccino...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe court has already heard that testimony, Mr. Kudo...\nKudo:\nI know that! I was just setting the mood. How else am I supposed to build up the suspense, hmm!?\nPhoenix:\nThe suspense?\nKudo:\nIsn't it enough? Should I work the audience a bit more?\nJudge:\nNo, no! Please continue, Mr. Kudo. As quickly as possible!\nKudo:\nAlright. Now where was I...? ...Ah yes. The young boy slumped over the table, and...Kudo:\nWell, the clumsy idiot upset the vase. He knocked it right over.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nA vase, you say?\nKudo:\nYes. There are vases on all the tables in that place. They're accidents waiting to happen! They're practically begging to be knocked over!\nPhoenix:\n(Well, he's right about there being vases. I do remember seeing them, too... There was a vase on the table when I ate munch there.) And you saw the moment when the victim actually knocked over the vase?\nKudo:\nWell... it's hard to say... It's a bit unclear... How do you really define...\nPhoenix:\nOK, I get it.\nKudo:\nI heard it break! And the sight of it is burned into my memory as clear as day!Present Crime Photo\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Mr. Kudo. This is a photograph of the crime scene.\"Kudo:\nIt broke, and the strip of cloth covering the table got completely soaked!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSoaked in water, you mean?\nKudo:\nYes. It splashed me on the knee as well.\nPhoenix:\nYou said you were sitting at a table across the room from the victim, correct? And yet, the water still managed to splash onto you?\nKudo:\n... It was cold! I clearly remember it splashing me!\nPhoenix:\n(Could the water really make it all the way across to the other side of the room...?)Present Crime Photo\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Mr. Kudo. This is a photograph of the crime scene.\"Kudo:\nWell!? How about that? Turned things upside-down, hmm?Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou mean, the vase on the victim's table falling upside-down and breaking?\nKudo:\nThe vase turned upside-down, and my testimony's turning this case upside-down... It's a joke! I just wanted everyone to hear it! What do you think, Captain!?\nGodot:\n...I'm impressed. By your ability to waste time.\nPhoenix:\n(Godot hasn't raised any objections for a while now...)\nKudo:\nSo, you young show-off! With that scrap of information, I'm throwing down the gauntlet! If I lose this one, I'll take it like a man and admit defeat!Phoenix:\nHe's really giving you the evil eye, Maya.Maya:\nIt's you he's looking at, Nick, not me! It's like he's saying, \"I triple dog dare you to find a contradiction, young'un!\"Phoenix:\nI guess I'll just have to rise to the challenge then...",
      "testimonies": [
        {
          "testimony": "First of all, I want to stress that this might be nothing. I'm not too sure of myself.",
          "person": "Kudo",
          "present": []
        },
        {
          "testimony": "The young boy slumped over the table as soon as he took one sip of his javaccino...",
          "person": "Kudo",
          "present": []
        },
        {
          "testimony": "Well, the clumsy idiot upset the vase. He knocked it right over.",
          "person": "Kudo",
          "present": [
            "Crime Photo"
          ],
          "source": {
            "evidence_span": "There is an intact vase on each table.",
            "testimony_span": "the clumsy idiot upset the vase",
            "explanation": "The intact vase in the picture shows that the victim did not upset and broke the vase.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "It broke, and the strip of cloth covering the table got completely soaked!",
          "person": "Kudo",
          "present": [
            "Crime Photo"
          ],
          "source": {
            "evidence_span": "There is an intact vase on each table.",
            "testimony_span": "It broke",
            "explanation": "The intact vase in the picture shows that the victim did not upset and broke the vase.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "Well!? How about that? Turned things upside-down, hmm?",
          "person": "Kudo",
          "present": []
        }
      ],
      "noPresent": false,
      "labels": [
        "physical"
      ],
      "reasoning": [
        "Fact 1: The witness claims a vase was broken.",
        "Fact 2: The evidence suggests all vases are intact.",
        "Prop 1: If everything is intact, then nothing is broken."
      ]
    }
  ]
}