{
  "previousContext": "The Cosmic Turnabout\nImage Gallery\nTranscript\nPart 1\nPart 2\nPart 3\nApollo:\nThe courtroom bombing incident -- a terrible attack launched by the will of a madman. That incident perfectly symbolized the state of the legal world in this dark age of the law. Mr. Wright brought it to a resolution... of sorts. Ted Tonate was discovered to be the one responsible for the bombing. ............If only it were that simple. Somehow, I can't help but think... ...that there's a darker influence at work -- one that's lurking in the shadows, waiting... That's why I want to review the trial that was taking place when the bombing occurred. After all, I've got more than a few personal stakes in it...\nEpisode 4The Cosmic Turnabout\nAnime cutscene\nOperator:\nOne hour remaining until launch. Please begin your final equipment check.\nAstronaut:\nCheck complete! Everything's A-OK. We're ready here whenever you are!\nOperator:\nCome in HAT-2! Come in! Do you copy?!\nDecember 16, 9:12 AMDistrict Court - Defendant Lobby No. 5\nApollo:\n(Time for another trial to begin... But this one is different.) ............\n???:\nUmm.. Sorry to bother you, but...\nWoods:\nAre you all right, Apollo?\nApollo:\n(Ack! Was I making a scary face just now?!) Oh, hi, Juniper! Yes, I'm fine! I was just doing my Chords of Steel exercises. Now I'm all ready to go!\nWoods:\nYes, knowing you, I'm sure you will be just fine! Oh! I brought you a present from my garden.\nApollo:\nIs this... a lotus root?\nWoods:\nThat's right. My grandma says lotus root is good for your eyes. She says that if you look through the holes, it can help you see into the future! It's for good luck! Maybe later, you can cook it and--\nApollo:\nThanks for this! I'm gonna have some right now!\nWoods:\nOh, my!\nApollo:\n............Mmm. *crunch* Kinda tough, though...\nWoods:\nHee hee! You can't eat it raw! But... thank you for the enthusiastic try.\nApollo:\n(Oops! If she didn't think me weird before, she will now! I've gotta calm down!)\nAthena:\nApollo! I'm sorry I'm late!\nWoods:\nHi, Thena!\nAthena:\nJunie! I didn't know you were coming today. Did you come to cheer Apollo on? Oh, I get it. You sly little thing, you! Ha ha ha!\nWoods:\nTh-Thena, stop!\nApollo:\nQuit kidding around, Athena. The trial's about to start any second. Is everything all set?\nAthena:\nOh, Apollo, Apollo... When will you ever figure it out?\nApollo:\nFigure out what?\n???:\n............Haaaaaaaaaaaaaaaaaaaaaaaaangh...\nApollo:\n(Wow. That was the longest sigh I've ever heard.)\n???:\nHaaaaangh... This is it. It's all over for me... They're gonna find me guilty.\nApollo:\n(This is our client, one Mr. Solomon \"Sol\" Starbuck. He's a very famous astronaut, who happens to be an acquaintance of mine. You wouldn't know it right now, but he's usually a very upbeat and driven person. The scene of the crime this time happened to be the Cosmos Space Center. Back in high school, my best friend and I went there almost a little too much... ...but that's where we met Mr. Starbuck. We'd ask about space travel and he'd launch into story after story with so much passion... Back in those days, the man was one hundred percent my hero.)\nStarbuck:\nAre... you sure you're okay with being my lawyer, Apollo...?\nApollo:\nOf course I'm sure. I know you, Mr. Starbuck. I know you're not the type to commit murder.\nStarbuck:\nThanks, but......... Haaaaaaaaaaaaaaaangh... I was supposed to be in space right about now... Haaaaaaaaaaaaaaaangh... Haaaaaaaaaaaaaaaangh...\nApollo:\n(He's so depressed, it almost seems like an act. The launch getting called off must've been a huge shock.)\nStarbuck:\nI'll probably never get the chance to go into space again.\nApollo:\nDon't say that! Don't stop believing! Besides, you just have to go into space again!\nStarbuck:\nYeah... I don't think I could face Clay in the afterlife if I just rotted away in a cell.\nAthena:\nClay Terran... I can't believe he was murdered. I mean, he was such a promising astronaut under your command...\nStarbuck:\nYeah... He was a good guy -- always there to pick me up when I was down. No one loved life as much as him, that's for sure. He was always so full of energy, telling me, \"You're fine, Mr. Starbuck!\"... ...Haaaaaaaaaaaaaaaaaaaaaaaaangh... How could something like this happen to a guy like him, huh?\nApollo:\n(I've never seen Mr. Starbuck so down...)\nStarbuck:\n...Haaaaaaaaaaaaaaaaaaaaaaaaangh... Clay's gone, and I'm going to prison... I wish I could burn up like a shooting star right now.\nApollo:\n...Mr. Starbuck! You'll be fine!\nStarbuck:\nAh! Wh-What is it?! What's with the yelling?!\nApollo:\nI'll get to the bottom of this today! You'll see! And in exchange, I want you to go back into space for you and Clay! Promise?!\nStarbuck:\n...Does that mean you have lots of evidence to prove my innocence?\nApollo:\nOh! Umm... Well... About that... We... didn't get to investigate the area as much as I'd have liked, thanks to the police.\nStarbuck:\n............I'm done for. I'm a goner. Everybody thinks I did it. Thought I was gonna soar like a comet, but I'm just gonna crash like a meteorite.\nApollo:\nNo, don't say that, Mr. Starbuck!\nAthena:\nDon't count yourself out yet!\nApollo:\nI know it's hard to lose a teammate, but you've got to keep going.\nAthena:\n............And what about you, Apollo?\nApollo:\nWhat about me?\nAthena:\nI was just thinking, wasn't Clay your best friend?\nApollo:\n.........We need to focus on the trial right now. Are you all ready to go?\nAthena:\nApollo...\nBailiff:\nThe trial is about to begin. If the defense would please proceed into the courtroom!\nAthena:\nO-Okay! Here we go!\nApollo:\n(This is it. This is one trial I can't afford to lose! For Clay's sake and our client's, I WILL find Clay's killer!)\nDecember 16, 9:55 AMDistrict Court - Courtroom No. 4\nDay 1Court Is Now In SessionAll Rise\nJudge:\nCourt is now in session for the trial of Solomon Starbuck.\nApollo:\nThe defense is ready, Your Honor.\nJudge:\n............Excuse me, Mr. Justice?\nApollo:\nYes, Your Honor?\nJudge:\nWhat happened to your eye?\nApollo:\n...I'm fine! The defense is ready, Your Honor!\nJudge:\n............Are you sure? I don't--\nApollo:\nI'm fine, Your Honor! The defense is ready!\nAthena:\nI'm sorry, Your Honor. He's been like this since yesterday. He keeps insisting it's just a sty.\nJudge:\nHmm... I suppose it's something he doesn't want to discuss. Maybe he's entering a touchy age...\nApollo:\n............\nJudge:\nVery well. And the prosecution...?\nBlackquill:\n............\nJudge:\nThe prosecution appears to be ready as well.\nBlackquill:\nBlackquill:\n............ ............... ...Not yet. I'm... not quite ready yet.\nJudge:\nHmm?\nBlackquill:\nNgh... Graaaaaaagh!\nJudge:\nAaaaaaaaaaaaaaaaaaaaaaaagh!\nBlackquill:\nThe prosecution... is now ready.\nAthena:\nWell, it didn't take him long this time.\nApollo:\n............ (What's up with Blackquill?)\nJudge:\nN-N-Now, then. I-I-I shall give the opening statement...\nBlackquill:\nJudge:\n............\nBlackquill:\nI'll do it.\nJudge:\nYou will? Wh-What an unexpected surprise!\nBlackquill:\nThis time, I can't leave it to anyone else.\nJudge:\nI-I see... Hmm... Something is off with the two of you today. You both seem different somehow.\nAthena:\n............\nJudge:\nVery well, Prosecutor Blackquill. Your opening statement, if you would.\nBlackquill:\nIt was just yesterday. The crimes in question occurred at the Cosmos Space Center.\nJudge:\nAh, that famous federal research facility of all things related to astrology, right?\nBlackquill:\nAstronomy. It's astronomy. Anyway, a rocket was set to launch from there... ...but at 9:28 AM, before they could even move the rocket to the launch site... ...two explosive devices were detonated, and the launch was canceled.\nJudge:\nMy word! Two bombs? How dreadful...\nBlackquill:\nThe defendant in today's trial is charged with both the bombing and with murder... One Mr. Solomon Starbuck. For whatever inane reason, he detonated a bomb on the rocket he himself would be in.\nJudge:\nSolomon Starbuck? I recognize that name. Isn't he that famous astronaut?!\nBlackquill:\nCorrect, Your Baldness. Mr. Starbuck was the pilot of the HAT-1 rocket seven years ago. As you may recall, despite some interstellar trouble, his mission was a success. Some say it was a miracle he returned alive. I suppose you could say he's a living legend.\nJudge:\nOh, I remember now. He's become something of an international celebrity, right? They even turned that incident into a movie and everything! We've got a real space pioneer in court today!\nBlackquill:\nHmph. But even heroes tumble from their lofty heights. Returning to the subject at hand...\nJudge:\nAh, yes. The victim was one Mr. Clay Terran, a subordinate of the defendant.\nBlackquill:\nIndeed. A loyal disciple brutally stabbed to death by his mentor.\nJudge:\nStabbed to death, you say? You mean his death wasn't a result of the bombing?\nBlackquill:\nCorrect. Despite his lofty dreams, the victim was seen as an interloper by the defendant. And so, he was sent not into space, but to the universe which we mortals can not see.\nApollo:\n(Clay...)\nJudge:\nI think I've heard enough. The case seems pretty clear-cut at this point. However, there is one thing I'm curious about. That metal box next to the witness stand... What purpose does it serve, exactly?\nBlackquill:\nSince you asked so nicely... It's your coffin.\nJudge:\nAaaaaaaaaaaaaaaaaaaaaaaagh! Have mercy on meeeeeeeeeeee!\nBlackquill:\n............I jest. It's evidence. Due to its immense size, we've little choice but to lay it where it rests now. We shall get to the contents of the box in due time.\nJudge:\nPhew... I feel like I just lost fifty years off of my life.\nAthena:\n...Does he even HAVE fifty years left?\nApollo:\nInner monologue, Athena! Inner monologue!\nBlackquill:\nEnough jabbering.\nFulbright:\nBobby Fulbright's the name! In justice we trust!\nJudge:\nAh, Detective Fulbright! Very well, them. Please explain the details of this incident to the court, if you would.\nFulbright:\nOn it! First, take a look at this pamphlet from the Cosmos Space Center! In it, you'll find a diagram outlining the overall layout of the Space Center. Ah, here we are. For a more detailed look at what's on the left side of this building... ...take a look at this cross-section that we the police have created. See the launch pad and the main building?\nJudge:\nThe launch pad is the square building, and the rounded structure is the main building, right?\nFulbright:\nYou got it. The incidents took place in Launch Pad 1 and in the main building's Lounge. I'll be using this diagram during my testimony -- it'll make it easier to understand!\nSpace Center Diagram added to the Court Record.\nWitness Testimony\n-- Details of the Case --\nFulbright:\nJust before the rocket was set to launch, two bombs went off. BOOM! BOOM!\nOne on the second floor of the Space Center's main building and one in Launch Pad 1.\nThankfully, only the two astronauts were in Launch Pad 1 at the time.\nThe two of them managed to make it back as far as the boarding lounge...\n...but after the escape, one of the two was found stabbed to death!\nJudge:\nHmm... A murder on top of a bombing...? Detective, the victim was already dead by the time you arrived at the lounge, correct?\nFulbright:\nYup. Thinking he'd sabotage the bombing, the defendant killed him right there in the rocket. (Changed from [Yup. Thinking he'd sabotage the bombing, the defendant attacked and killed the victim.] in the original release) Just look at this tragic photo!\nJudge:\nOh, my! I-Is that a knife in the victim's chest?!\nFulbright:\nYes, Your Honor, it's the knife that cruelly ended this young man's dreams! We couldn't get any prints off of it, though, because the defendant was in his space suit.\nUtility Knife added to the Court Record.\nJudge:\nBy the way, Detective Fulbright... Why are the victim's helmet and right glove absent in this photograph?\nFulbright:\nWe had to remove them to identify him, Your Honor. I personally removed his glove during the investigation. We had to get his fingerprints to confirm his identity, after all.\nJudge:\nHmm... Yes, it would be very difficult to identify him without a face or fingerprints. Now, there's just one more thing I'd like to inquire about... What is this round thing next to the victim in this photo?\nBlackquill:\nSomething so important to the victim he took it with him as he escaped the launch pad. A capsule that apparently contains asteroid samples. While obviously valuable for research purposes, it has no relation to this case.\nJudge:\nHmm... I see.\nApollo:\nSo... we know that the bomb in the main building was on the second floor... ...but where was the bomb that was in Launch Pad 1 located?\nFulbright:\nHeh. That one was on the rocket itself. It was situated around the central part of the rocket. Apparently, the area around the launch pad's elevator was a sea of flames. I would like to submit this diagram and report into the record!\nBombing Report added to the Court Record.\nAthena:\nThe trial's just started and we're already in a bind.\nApollo:\nYou get used to it. Besides, that's what cross-examination is for, right? (What the two astronauts were doing during the bombing... That'll be the key!)\nCross Examination\n-- Details of the Case --\nFulbright:\nJust before the rocket was set to launch, two bombs went off. BOOM! BOOM!\nPress\nApollo:\nApollo:\nHow powerful were the explosions?\nFulbright:\nWell, the one in the main building wasn't strong enough to bring the place down... ...but the room it went off in was burned black! Thankfully, nobody was hurt. Due in large part, of course, to me stepping up to lead the evacuation!\nApollo:\nWait. What were you doing there in the first place, Detective Fulbright?\nFulbright:\nHa ha ha! I'm Bobby Fulbright, hero of justice! I'll be there, wherever and whenever people need my help! I'd go to the other side of the world, or even the edge of the universe!\nApollo:\n(I'm not sure he knows how far that actually is... But I guess I'll leave that one alone.)\nBlackquill:\nAdmirable decision, Justice-dono.\nFulbright:\nHuh? What'd he decide...?\nApollo:\nAnyway, could you describe what it was like at the Space Center at that time?\nFulbright:\nThe bomb cut the power to the central bank of elevators and the third floor lounge. It was pitch black in there, I tell you. However, the security cameras and whatnot were running on emergency backup.\nApollo:\nAnd how did the evacuation go?\nFulbright:\nI immediately and heroically whisked people down to the Space Center's basement shelter!\nJudge:\nThe basement shelter?\nFulbright:\nYes, there's an emergency shelter beneath the Space Center!\nAthena:\nAn emergency shelter, huh? Oh, here it is! It's at the bottom of the diagram. The Space Center's pretty impressive to have its own shelter!\nEvacuation Report added to the Court Record.\nApollo:\n(Hmm... The power outage and evacuation seem unrelated to the murder at this point. I guess I'll leave that aside for now.) So there were two explosions in total, correct?\nFulbright:\nYup. That's right!\nPress (subsequent times)\nApollo:\nApollo:\nHow powerful were the explosions?\nFulbright:\nWell, the one in the main building wasn't strong enough to bring the place down... ...but the room it went off in was burned black! Thankfully, nobody was hurt. Due in large part, of course, to me stepping up to lead the evacuation!\nApollo:\nWait. What were you doing there in the first place, Detective Fulbright?\nFulbright:\nHa ha ha! I'm Bobby Fulbright, hero of justice! I'll be there, wherever and whenever people need my help! I'd go to the other side of the world, or even the edge of the universe!\nApollo:\n(I'm not sure he knows how far that actually is... But I guess I'll leave that one alone.)\nBlackquill:\nAdmirable decision, Justice-dono.\nFulbright:\nHuh? What'd he decide...?\nApollo:\nAnyway, could you describe what it was like at the Space Center at that time?\nFulbright:\nThe bomb cut the power to the central bank of elevators and the third floor lounge. It was pitch black in there, I tell you. However, the security cameras and whatnot were running on emergency backup.\nApollo:\nAnd how did the evacuation go?\nFulbright:\nI immediately and heroically whisked people down to the Space Center's basement shelter!\nJudge:\nThe basement shelter?\nFulbright:\nYes, there's an emergency shelter beneath the Space Center!\nAthena:\nAn emergency shelter, huh? Oh, here it is! It's at the bottom of the diagram. The Space Center's pretty impressive to have its own shelter!\nApollo:\n(Hmm... The power outage and evacuation seem unrelated to the murder at this point. I guess I'll leave that aside for now.) So there were two explosions in total, correct?\nFulbright:\nYup. That's right!\nFulbright:\nOne on the second floor of the Space Center's main building and one in Launch Pad 1.\nPress\nApollo:\nApollo:\nLet me get this straight... Mr. Starbuck rigged a rocket he was going to board with explosives?\nFulbright:\nHuh? What are you talking about?\nApollo:\nIf the defendant really did plant the bomb on his own rocket... ...he'd get caught in the explosion as well!\nJudge:\nOh! I hadn't thought of that!\nBlackquill:\n...Hmph. Fine. A simpleton for a simpleton. Fool Bright. The motive.\nFulbright:\nUnderstood! The defendant actually had astrophobia.\nApollo:\nA... Astrophobia? What's that?\nFulbright:\nA fear of space, naturally. Just the thought of space can cause the afflicted to freeze up. And so, in his terror, the defendant found a way to stop the launch at the last minute!\nApollo:\nTh-That's absurd!\nFulbright:\nUnfortunately for you, we have evidence! Take a look at these!\nApollo:\n...What are they?\nFulbright:\nThese anti-anxiety tablets were found among the defendant's possessions! Apparently, he was taking them in secret to quell his fears.\nBlackquill:\nThere were a multitude of problems with the rocket Mr. Starbuck rode seven years ago. Rumor has it, it threatened to crash a number of times as well. That was, of course, very traumatic for Mr. Starbuck.\nApollo:\nApollo:\nBut that doesn't mean he'd go so far as to blow up his own ship!\nBlackquill:\nBlackquill:\nThe defendant couldn't bear to mar his good name, now could he? No, not after the media had branded him \"Sol Starbuck: space pioneer extraordinaire.\" Given these conditions, the defendant could hardly run away like some base mutt.\nApollo:\nWhat, so THAT'S why you think he resorted to the bombing?\nBlackquill:\nNaturally. He constructed this act of sabotage in an attempt to blow up the Space Center... ...which would effectively abort the launch, but spare his reputation.\nApollo:\n............Urgh!\nFulbright:\nNow I'm sure you understand why we have to bring justice down on this atrocious criminal!\nFulbright:\nThankfully, only the two astronauts were in Launch Pad 1 at the time.\nPress\nApollo:\nApollo:\nAre you sure it was only the two of them?!\nFulbright:\nIt was before the spaceship was set to launch, so of course it was only those two!\nApollo:\nUngh... Well, there could've been somebody else inside that rocket!\nBlackquill:\nBlackquill:\nThe notion of a third party in Launch Pad 1 is utterly absurd. Just to enter the area from the lounge... ...one must pass through a door guarded by a fingerprint recognition device. And allow me to state up front that there are precious few with the clearance to do so.\nJudge:\nA fingerprint recognition device? It sounds as futuristic and complex as a space center!\nFulbright:\nActually, it's not as amazing as you think, Your Honor. Take a look at this photo! This is the door in the lounge with the fingerprint lock. Only personnel whose fingerprints are registered can pass through.\nJudge:\nHmm, I see... That is very different from what I had in mind. And is there a record of the number of people that passed through that door yesterday?\nFulbright:\nYes, there were only three: the defendant, the victim, and... ...the director of the Space Center, Yuri Cosmos.\nApollo:\nThen doesn't that mean it's possible that the director is the one who did it?\nBlackquill:\nNot a chance. He was in the main building when the bombs exploded at 9:28... ...doing his job directing the launch. Besides having an alibi, he has no motive for committing these senseless acts.\nApollo:\n(He has a point... I guess the director can't be considered a suspect then.)\nLaunch Pad 1 Door Lock added to the Court Record.\nPress (subsequent times)\nApollo:\nApollo:\nAre you sure it was only the two of them?!\nFulbright:\nIt was before the spaceship was set to launch, so of course it was only those two!\nApollo:\nUngh... Well, there could've been somebody else inside that rocket!\nBlackquill:\nBlackquill:\nThe notion of a third party in Launch Pad 1 is utterly absurd. Just to enter the area from the lounge... ...one must pass through a door guarded by a fingerprint recognition device. And allow me to state up front that there are precious few with the clearance to do so.\nJudge:\nA fingerprint recognition device? It sounds as futuristic and complex as a space center!\nFulbright:\nActually, it's not as amazing as you think, Your Honor. Take a look at this photo! This is the door in the lounge with the fingerprint lock. Only personnel whose fingerprints are registered can pass through.\nJudge:\nHmm, I see... That is very different from what I had in mind. And is there a record of the number of people that passed through that door yesterday?\nFulbright:\nYes, there were only three: the defendant, the victim, and... ...the director of the Space Center, Yuri Cosmos.\nApollo:\nThen doesn't that mean it's possible that the director is the one who did it?\nBlackquill:\nNot a chance. He was in the main building when the bombs exploded at 9:28... ...doing his job directing the launch. Besides having an alibi, he has no motive for committing these senseless acts.\nApollo:\n(He has a point... I guess the director can't be considered a suspect then.)\nFulbright:\nThe two of them managed to make it back as far as the boarding lounge...\nPress\nApollo:\nApollo:\nSo, while it would appear that the pair barely escaped with their lives, in actuality... ...one of them had already been murdered inside the rocket. That's the angle the prosecution wants to push, correct?\nFulbright:\nYou got it! In fact, that's what I've been trying to say this whole time! If the victim had been alive, he would've for sure tried to stop the bombing.\nApollo:\nIs there any chance Mr. Terran could have been killed before he boarded the rocket?\nFulbright:\nThey were both alive and well at boarding time, and embarked under their own power! Their hearts full of hopes and dreams of space!\nApollo:\n(And then both of their hopes and dreams were dashed...)\nFulbright:\nIf I may continue my explanation! After the evacuation order was given... ...the defendant made his escape, carrying the victim to make it look like a rescue.\nFulbright:\n...but after the escape, one of the two was found stabbed to death!\nPress\nApollo:\nApollo:\nAnd who was the first to find the victim?\nFulbright:\nActually, there were two of them!\nBlackquill:\nThe Space Center director... ...Yuri Cosmos... ...and Detective Candice Arme.\nJudge:\nOne of them was a detective?!\nFulbright:\nYup. Detective Arme specializes in bombings, you see. She and the director were ordering the evacuation following the explosions. They were also worried about the astronauts, so they hurried over to the boarding lounge. That's when they discovered the victim along with the defendant!\nApollo:\n(Two witnesses, huh? And one of them is a detective! I doubt either one would have anything to say that would help me...)\nAthena:\nHmm... It's like he's trying to give us as little information as possible.\nApollo:\nMaybe Prosecutor Blackquill's got his tongue...\nAthena:\nWell, don't let that hold you back. Keep pressing until we get what we need!\nAfter pressing first, second, third, and fifth statements:\nJudge:\nI think that pretty much covers the details of the case. Only the victim and the defendant were on the launch pad when the former was killed. If this is the truth, then only Mr. Starbuck could have carried out this crime.\nApollo:\n(What little I could get out of him only hurt my case.)\nBlackquill:\nHmph. Justice-dono, foolish is the warrior who rushes headlong into battle. Preparation is an essential element of battle, so I advise you to take a gander at this.\nApollo:\nWhat is it...?\nBlackquill:\nFootage from a security camera. As the two astronauts emerged from the bowels of the Launch Pad 1 Corridor... ... the boarding lounge security camera captured their desperate escape. Now, I would direct your attention to what the defendant is shouldering... ...which you can see, is none other than... the lifeless body of the victim.\nApollo:\nWh..... Whaaaaaaaat?!\nJudge:\nOrder! Order I say! This... This lines up exactly with what the prosecution has been asserting!\nApollo:\nI should've known Blackquill would have something like this ready.\nSecurity Camera Video added to the Court Record.\nAthena:\nUm, Apollo...? How exactly did they determine that Clay was... already gone in that footage?\nApollo:\n.........Ah, I see what you mean! Whether Clay was still alive at that point IS pretty crucial. Your Honor! Please take another look at the footage. Isn't it possible that Mr. Terran was still alive here and that Mr. Starbuck was helping him?!\nJudge:\nWhy, I believe you're right. One man carrying the other to safety... What a beautiful expression of friendship...\nBlackquill:\nBlackquill:\nHmph. Perhaps that's what it looks like to a one-eyed hothead and a dotard... But it only makes sense if it's the victim's dead body.\nApollo:\nWhat do you mean?\nBlackquill:\n...Fool Bright, explain it to Justice-dono.\nFulbright:\nYou got it! Ready, kid? If the murder had occurred in the lounge, someone could've spotted it. Anyone can enter the lounge, after all. But doing it while they were alone in the spaceship? That's a horse of a different color!\nApollo:\nApollo:\nBut you can't deny that there's a possibility the murder could've happened in the lounge! All that video shows is a man helping his fellow astronaut out!\nBlackquill:\nBlackquill:\nYour assertion... is based on emotion. It's based in your belief that Mr. Starbuck would surely help his own disciple. But you have no logical explanation as to why the victim could still be alive.\nApollo:\nUrk!\nJudge:\nUnfortunately, Mr. Justice, the prosecution is right. Your argument is lacking in sound logic.\nApollo:\n(But it sounded perfectly logical to me...)\nJudge:\nWell, Mr. Justice? If you have no further objections... ...I believe it's time to bring this cross-examination to a close.\nApollo:\nObjections...? Well, I, uh...\nAthena:\nAthena:\nYour Honor! The defense requests a little time to think and regroup.\nJudge:\nHmm... Given the facts, I'm not sure I see the need...\nApollo:\nWhat is it, Athena?\nAthena:\nIt's just... There's something that's been bothering me.\nBlackquill:\nHmph. If it isn't the defense stalling for time, as always. ............Very well, I'm feeling generous. You may have a small measure of time.\nAthena:\nYes!\nBlackquill:\nYou have......... five seconds.\nAthena:\nF-FIVE SECONDS?!\nBlackquill:\nAfter that, I declare this cross-examination to be closed, and a verdict to be rendered. Your Baldness! Raise your gavel high. It's time for a countdown!\nJudge:\nOh... OH!\nBlackquill:\nReady?\nApollo:\nWe don't have time! Spit it out, Athena!\nJudge:\nOnly three more seconds!\nAthena:\nAck! L-Look! I don't think the prosecution's explanation is very complete.\nApollo:\nMeaning?!\nAthena:\nMeaning there's something missing -- like they conveniently left it unexplained...\nApollo:\nSomething they didn't explain... Something they didn't explain... .........Ah! You're right! I think I know what you're talking about!\nJudge:\nYour five seconds are up, Mr. Justice. Is there anything about the prosecution's argument that you'd like to rebut?\nApollo:\nY-Yes, Your Honor! Actually, there is! There is something the prosecution has yet to make clear to this court!\nJudge:\nHmm... Well, if you put it that way... What is it that the prosecution has failed to explain?\nThe motive for murder\nApollo:\nThe prosecution hasn't explained the defendant's motive yet, have they?\nJudge:\nHm? But didn't they just explain... ...that Mr. Terran was a threat to the success of the bombing, so he had to be disposed of?\nApollo:\nAh! No, wait! Time out, Your Honor!\nJudge:\n\"Time out,\" Mr. Justice? This is hardly a sporting event.\nApollo:\nAck. (That didn't score me any points... Time to put my game face on.)\nLeads back to:\n\"What is it that the prosecution has failed to explain?\"\nWhy the body was moved\nLeads to:\n\"They have failed to explain why Mr. Starbuck would bother bringing the body back at all.\"\nApollo:\nThey have failed to explain why Mr. Starbuck would bother bringing the body back at all. If the defendant wanted to kill the victim, why didn't he just leave the body in the rocket? Why go  through the trouble of bringing him all the way back to the boarding lounge?\nJudge:\nOh! That's true! I don't think we've heard the prosecution's thoughts on that yet.\nApollo:\nThat's because they have none, Your Honor. After all, how does one explain something so illogical?\nBlackquill:\n............\nApollo:\nThe prosecution is claiming that the defendant moved the victim's dead body. But what if the entire premise of that argument is wrong?\nJudge:\nThen let's hear your theory, Mr. Justice.\nApollo:\nThe defense proposes that the defendant didn't kill the victim! He was helping him! Aaaaack!\nBlackquill:\nFool Bright. Explain it for our sad friend here before I nod off to his monotone monologue. Inform him exactly why Space Boy moved the victim.\nApollo:\nHuh? (They've gotta be joking...)\nFulbright:\nIt's simple! Mr. Starbuck did what he did to direct suspicion away from himself! He wanted to create the impression he heroically risked his life to save his partner! That's why he made sure to make it to the security camera so there'd be a record!\nBlackquill:\nAt the very least, he appears to have achieved success with you and the old man.\nApollo:\nAh!\nJudge:\nOne man carrying the other to safety... What a beautiful expression of friendship...\nBlackquill:\nThe average person wearing a space suit weighs easily over two hundred pounds. (Changed from [The average person wearing a space suit weighs easily over 200 pounds.] in the original release) Saving the life of a partner who weighs as much, while trying to escape deadly flames... What a dramatic sob story fit for the silver screen.\nJudge:\nIndeed. I was completely taken in by the humanity of the story.\nBlackquill:\nYou see? Yet the true ending is that all traces of his hammy act were meant to be blown up. Yes, and now we arrive at the thrilling conclusion: the third explosion!\nAthena:\nAthena:\nWhat are you talking about? There was no third explosion!\nBlackquill:\nBlackquill:\nIndeed, you are correct. But that is thanks to Detective Arme. It was she who identified and secured the bomb. However, it doesn't change the fact that the third bomb was discovered in the lounge. The steel coffin beside the witness stand. That would be... a bomb transport case. We used that to transport the deactivated bomb here. It was found in the lounge... A bomb in the form of a most distasteful toy.\nAthena:\nWHAAAAAAAAAAAAAAAAAAAAAAT?!\nBlackquill:\nOne on the second floor of the main building, one on the launch pad, and one in the lounge. The defendant planned to set off three firework displays. Fortunately, the third one was discovered before it could be detonated, for had it not... ...the victim's body and other vital evidence would surely have been immolated.\nApollo:\nApollo:\nGaaagh!\nBlackquill:\nBefore you utter a word, know that the evidence supports me.\nApollo:\n(Ugh... It's like he's reading my mind...)\nBlackquill:\nAs it is still undergoing forensic investigation, I do not have the evidence on hand. However, know that a peculiar item was found in one of Mr. Starbuck's pockets. Specifically, a bomb detonation switch...\nApollo:\nYou found whaaaaaaaaaaaaaat?!\nBlackquill:\nI suspect the defendant had no time to destroy such damning evidence... ...when the Space Center director and Detective Arme stumbled across the murder. So he thought to hide it in his pocket... feeble-brained that he is.\nApollo:\nAaaaaaagh... No! Mr. Starbuck would never do anything like that! AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAGH!\nBlackquill:\nJustice-dono, open your eyes and see the truth.\nJudge:\nHmm, this appears to be irrefutable evidence that the accused set off the explosions.\nApollo:\n(No! There has to be some kind of mistake! This can't be the \"truth\"!)\nBlackquill:\nStill can't accept it? You'll believe in your client, come what may? ............Then why don't you cross-examine the defendant himself?\nApollo:\n(......This has got to be a trap.)\nAthena:\nIt's like Blackquill's controlling the entire game.\nApollo:\nYeah. It seemed like he was waiting for me to bring up the body moving issue.\nAthena:\nWhy do you say that?\nApollo:\nBecause he had just the right argument when I pointed it out... ...and to really rub it in, he had a decisive piece of evidence up his sleeve, too. He was trying to shake my faith in Mr. Starbuck and break me down!\nAthena:\nThen, making you cross-examine Mr. Starbuck at this point was part of his plan, too...? Totally underhanded, but I wouldn't expect anything less from him.\nBlackquill:\nNow, let us hear from the archvillain, the fiendish murderer himself. Famed astronaut, Solomon Starbuck!\nJudge:\nWitness, your name and occupation, please.\nStarbuck:\nSolomon Starbuck. Astronaut... Haaaaaaaaaaaaaaaangh... How did this happen?\nJudge:\nMr. Starbuck, you aren't looking very well. Will you be able to give testimony?\nStarbuck:\nHaaaaaaaaaaaaaaaangh............ No.\nJudge:\n............Well, unfortunately, \"no\" is not an option. You are being accused of the Space Center bombing and the murder of Clay Terran. Please testify to these allegations.\nStarbuck:\nHaaaaaaaaaaaaaaaangh... Umm... Mind if I take this suit off? It's getting really heavy...\nBlackquill:\nBlackquill:\nIt's not the weight of the suit that you feel, but of your sins. Prepare to carry that weight for the rest of your life...\nStarbuck:\n............Banish me to the moon... I don't care anymore...\nAthena:\nWow... That was super-negative... Is he going to be all right up there?\nApollo:\nH-He'll be fine! I think... (As long as he doesn't totally give up and say he did it, that is.)\nWitness Testimony\n-- I Didn't Kill Him --\nStarbuck:\nAll I did was support Clay over my shoulder and get us out of the rocket!\nLike always, I took the elevator down to the middle level and headed for the corridor.\nClay had passed out by the time we got the order to evacuate.\nI didn't kill Clay! I was trying to save him!\nJudge:\nHmm... So you assert you didn't set off the bombs or murder the victim?\nStarbuck:\nHa ha. Ha ha ha... But I bet you think I'm lying, right?\nJudge:\nI reserve all judgment until after I've heard your full testimony.\nStarbuck:\nHaaaaaaaaaaaaaaaangh... I'm sure you don't believe me. I bet you don't even believe I'm an astronaut.\nApollo:\n(I don't think the judge doubts THAT!)\nAthena:\nWho'd wear a suit like that EXCEPT an astronaut...\nJudge:\nHmm... I will say that when I saw you in that movie... ...you appeared quite courageous, though I suppose reality never quite lives up to fantasy.\nStarbuck:\nHaaaaaaaaaaaaaaaangh... I guess I'm just a big disappointment... Ha ha. Ha ha ha. Ha ha... I really don't care what happens anymore. Ha ha ha...\nApollo:\n(Oh, no! He's completely give up!)\n???:\nHaaaaaaaaaaaaaaaangh...\nBlackquill:\nHmph. What a depressing fellow. If you were to join me in the clink... ...I imagine that annoying sighing of yours would rub off on the other inmates.\nAthena:\nLike how it rubbed off on Prosecutor Blackquill a second ago?\nApollo:\n(Huh? That was Blackquill sighing? Mr. Starbuck's testimony contains a glaring contradiction. The question is, what does it mean? Even if Mr. Starbuck is my client, I can't be gun-shy now! It's time to find out the truth!)\nCross Examination\n-- I Didn't Kill Him --\nStarbuck:\nAll I did was support Clay over my shoulder and get us out of the rocket!\nPress\nApollo:\nApollo:\nSo what you're saying is that the victim was still alive at that time?\nStarbuck:\nOf course! He was alive and well!\nBlackquill:\nBlackquill:\nIf so, then you took a man who was alive and well... ...and silenced him permanently with this?\nStarbuck:\nWhat?! No! Aaaaagh! Black hole confirmed, dead ahead. Aaaaaaaaaaaaah! It's no good, captain! I'm getting sucked iiiiiiiiiiiiiiinnnnnnnnnn!\nApollo:\nApollo:\nM-Mr. Starbuck! You are not in space! Please give your testimony seriously!\nStarbuck:\nI-It was just nerves, but maybe I shouldn't have said he was \"alive and well.\" It was more like he was slumped over.\nApollo:\n(Those are complete opposite ends of the spectrum!)\nStarbuck:\nLike always, I took the elevator down to the middle level and headed for the corridor.\nPress\nApollo:\nApollo:\nIs that the elevator inside the launch pad area?\nStarbuck:\nThat's right. We always use it to get to and from the cockpit.\nAthena:\nThat makes sense. So he was just using the route he always used.\nApollo:\nIn spite of the fact that there had just been an explosion...?\nAthena:\n...Huh?\nApollo:\n(I think Mr. Starbuck is hiding something. Something pretty big...)\nPresent Bombing Report\nApollo:\nLeads to:\n\"Mr. Starbuck, I need your testimony to be as accurate as possible.\"\nStarbuck:\nClay had passed out by the time we got the order to evacuate.\nPress\nApollo:\nApollo:\nPassed out? Why was he passed out?\nStarbuck:\nProbably because of the explosion. The noise and vibration were incredible. It's little wonder a person would pass out, right?\nApollo:\nI-I guess...? (Not that I'd know...)\nStarbuck:\nAaaaagh! I've been hit by space debris! The main engine's on fire! It's gonna blow! Aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaah!\nApollo:\nY-Yes, I see... I guess it does make sense that someone would pass out... (Especially if the person in question is Mr. Starbuck...)\nStarbuck:\nA-Anyway!\nStarbuck:\nI didn't kill Clay! I was trying to save him!\nPress\nApollo:\nApollo:\nDon't worry! I understand. I'll make sure everything turns out all right!\nStarbuck:\n............But everyone's glaring at me like I did it.\nAthena:\nApollo, you have to reassure him better than that!\nApollo:\nAnd how am I supposed to do that?!\nAthena:\nTry to imagine how he's feeling, and use that to figure out how to boost his confidence.\nApollo:\nMr. Starbuck, think back to what Clay used to always say. It's times like these when he would repeat, \"I'm fine!\" to himself.\nStarbuck:\n\"I'm fine\"...? Yeah, I guess he did say that a lot... Haaaaaaaaaaaaaaaangh... But even if I shout it, Clay will still be dead. Haaangh... What's the use...?\nApollo:\n............Haaaaaaaaaaaaaaaangh... (Could somebody please reassure me now?)\nAthena:\nApollo, there's something strange about Mr. Starbuck's testimony.\nApollo:\nYeah, I was thinking the same thing. There's a glaring contradiction. I just wonder why it's there and what it means for our case.\nAthena:\nWell, it doesn't look like he's lying, at least...\nApollo:\n............ (Guess I'll have to show some evidence.)\nApollo:\nMr. Starbuck, I need your testimony to be as accurate as possible.\nStarbuck:\nW-Was I not being accurate?\nApollo:\nNo, because it's impossible for you to have taken the elevator down to the middle level.\nJudge:\nWhat makes you say that, Mr. Justice?\nApollo:\nPlease recall where the bomb went off in Launch Pad 1. Also recall that after the explosion, the middle level elevator was engulfed in flames.\nJudge:\nOh! You're right. Which means...\nApollo:\nExactly. The launch pad's elevator would've been unusable. In other words... ...Mr. Starbuck, your statement is decidedly inconsistent with the facts! Wh-What's with the helmet?\nStarbuck:\nAaaaaagh! Mission command! Mission command! Do you read me?! Come in, please!\nApollo:\nApollo:\nThis is mission command... I order you to PAY ATTENTION! Stop this nonsense and answer my questions, Mr. Starbuck!\nStarbuck:\nAaaaagh! M-My helmet! Ah! My oxygen taaaaaaaaaaaaaaaaaaank! Oxygen concentration and body temperature declining! Requesting medical assistance! Gaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaagh!\nJudge:\nM-Mr. Starbuck! We are not in space right now! Please stop pretending you have lost consciousness and stand back up!\nStarbuck:\nI-I apologize, Your Honor. I forgot I was still on Earth.\nAthena:\nI feel like we all just got a real glimpse of Solomon Starbuck the astronaut.\nApollo:\nYeah, he seemed more like an astronaut now than when he was doing all that sighing. Mr. Starbuck, could you please explain the inconsistency in your statement? About how you used the middle level elevator?\nStarbuck:\nI, uh... was nervous, and I said the wrong thing! I'm sorry! I actually, uh, took a different route, I think.\nApollo:\nA different route?\nBlackquill:\n............I hope you're able to deliver a straight story this time.\nStarbuck:\nAck! I-I-I'll get it right this time! Maybe. No, I mean, probably!\nBlackquill:\nProbably...?\nJudge:\nIt's understandable to be nervous, but let me remind you that accuracy is paramount in court.\nWitness Testimony\n-- My Escape Route --\nStarbuck:\nLet's see... Uh, my escape route... What I said before was a mistake.\nI, uh, I remember now! I took a different route... Maybe... Probably...\nWith the capsule and Clay in my arms, I made my way down from the upper level.\nApollo:\nSo you're saying you escaped without using the elevator?\nStarbuck:\nTh-That's right! There's a ladder that spans the upper and middle levels. I used that ladder to get to the middle level. Luckily, the fire hadn't reached the ladder, so we could make our escape that way.\nApollo:\nAnd the capsule you mentioned... I suppose you mean the thing next to Mr. Terran here? Was the capsule that important that you'd risk your life to take it with you?\nStarbuck:\nIt almost goes without saying, but yeah! That capsule contains asteroid samples. Therefore it's invaluable as research material. With his space suit on, Clay weighed a ton, but securing the capsule was also important.\nApollo:\nI need you to answer to the best of your ability! Mr. Starbuck! Please remember that your verdict is riding on your testimony!\nStarbuck:\nHa ha... ha ha ha... Haaaaaaaaaaaaaaaangh... Maybe I am guilty after all. I wonder if you can see the stars in prison? Bet it's more comfortable than a spaceship.\nCross Examination\n-- My Escape Route --\nStarbuck:\nLet's see... Uh, my escape route... What I said before was a mistake.\nPress\nApollo:\nApollo:\nHow could you mistake such a basic fact?!\nStarbuck:\nHey, everybody makes mistakes, but try thinking about the vastness of space instead. From Earth, it takes four light-years to travel to our nearest neighboring star. So you see? Compared to the vast expanse of space, human error is insignificant.\nApollo:\n(I wish he'd consider it just a little more significant than zero...)\nBlackquill:\nEnough jabbering. Get on with your testimony.\nStarbuck:\nUngh...\nStarbuck:\nI, uh, I remember now! I took a different route... Maybe... Probably...\nPress\nApollo:\nApollo:\n\"Maybe\"? \"Probably\"? Did I hear you right, Mr. Starbuck?!\nStarbuck:\nI-I didn't say either of those things! Aaaaagh! Mission control! Come in, please! An error has occurred in the sound system! Activate the emergency tin can telephone! Oh, nooooooo! Tin can telephones are ineffective in the vacuum of space!\nBlackquill:\nBlackquill:\nStop this nonsense or I will sever you AND your tin can telephone.\nStarbuck:\nAll right! I'm begging you! I'll tell the truth! Just don't sever anything!\nAthena:\nApollo, is he going to be all right?\nApollo:\nI'm... starting to think he's not...\nStarbuck:\nUm, let's see... So about when we were running away...\nStarbuck:\nWith the capsule and Clay in my arms, I made my way down from the upper level.\nPress\nApollo:\nApollo:\nThe upper level of the launch pad area...?\nStarbuck:\nTh-That's right! That's what I said, isn't it?!\nApollo:\n(Granted, that route does exist...) So, to recap, you had Clay over your right shoulder and the capsule in your left hand?\nStarbuck:\nYeah! It's really important, so I couldn't let it get burned up. So, even though Clay was really heavy, I couldn't afford to carry him with both hands. I did the best I could with him over one shoulder and the capsule in my other hand.\nApollo:\n(............I don't think the meaning of what he just said has hit him yet...)\nBlackquill:\n...Hmph. You know what you have to do with that statement, Justice-dono!\nApollo:\nY-Yes, I know! (Well, I've come this far. No turning back now. It's time to present some evidence!)\nPresent Space Center Diagram\nApollo:\nLeads to:\n\"Mr. Starbuck, why don't you just tell the truth?\"\nAthena:\nSo Mr. Starbuck escaped with Clay and the capsule, which means... ...it's just like in the footage. I can see why he couldn't run, though.\nApollo:\nHe must've weighed over two hundred pounds just by himself. (Changed from [He must've weighed over 200 pounds just by himself.] in the original release)\nAthena:\nYeah, and he had to support Clay, who was another two hundred pounds. (Changed from [Yeah, and he had to support Clay, who was another 200 pounds.] in the original release) Plus, he had to ensure the safety of that capsule. I don't think I could've even walked under those circumstances.\nApollo:\n(Walking straight forward is probably about all I would've been able to manage...)\nApollo:\nMr. Starbuck, why don't you just tell the truth?\nStarbuck:\nTh-The truth? Um, let's see... The Earth is blue...? No, no. That's not right. So, uh... I guess the Earth isn't blue? Yeah, that's it!\nApollo:\nThe truth, Mr. Starbuck!\nStarbuck:\nGawrh! The oxygen concentration is super low in this area! Prepare the emergency oxygen tanks!\nJudge:\nMr. Justice, the witness appears confused. Please help draw out the truth from him.\nApollo:\nMr. Starbuck, under the circumstances at the time... ...you couldn't possibly have reached the boarding lounge via the upper level route.\nStarbuck:\nHuh?\nApollo:\nNot as long as this was along the escape route!\nPresent Ladder\nApollo:\nLeads to:\n\"To get down from the upper to the middle level where the Launch Pad 1 corridor is...\"\nPresent anywhere else\nApollo:\nStarbuck:\nHaaaaaaaaaaaaaaaangh...\nApollo:\nWh-What's the matter, Mr. Starbuck?\nStarbuck:\nWell, you say, \"not as long as this,\" but I don't know what the \"this\" is. Haaaaaaaaaaaaaaaangh...\nJudge:\nI must admit I have no idea, either.\nApollo:\n(Haaaaaaaaaaaaaaaangh...) Your Honor! Please let me try that again! Under the circumstances at the time... ...Mr. Starbuck couldn't have made it to the boarding lounge via the upper level route.\nLeads back to:\n\"Not as long as this was along the escape route!\"\nApollo:\nTo get down from the upper to the middle level where the Launch Pad 1 corridor is... ...you would have to go down the ladder, isn't that right, Mr. Starbuck?\nStarbuck:\nO-Of course! That was the only way we could escape!\nApollo:\nApollo:\nBut how would that work? At the time, you were supporting Mr. Terran over your shoulder, were you not? And remember, he was in full space gear as well, putting him at over two hundred pounds. (Changed from [And remember, he was in full space gear as well, putting him at over 200 pounds.] in the original release)\nStarbuck:\nAh! Ooooooh! W-W-Well, it's easy on the moon! Gravity is only one-sixth of what it is on Earth.\nApollo:\nApollo:\nBut the Space Center is located on Earth! Short of being an octopus, climbing a ladder with an adult male in space gear in one arm... ...while carrying the capsule in your other is impossible, wouldn't you say?\nStarbuck:\nOh...!\nApollo:\nSo, Mr. Starbuck! How exactly DID you climb down that ladder with your arms full?!\nStarbuck:\nAaaaaah!\nApollo:\nMr. Starbuck! Come clean and tell us the truth! NOW!\nStarbuck:\nAaaaaaaaaaaaaaaagh! Engineer! Where's that engineer?! Oxygen leak detected due to faulty maintenance! Evacuate immediately!\nApollo:\nWhat the--!? (He's flying the coop!)\nStarbuck:\nAaaaagh! Help! I'm caught on the ceiling! .........Um, help? Anyone...?\nJudge:\nBailiff! Prepare the cherry picker! We must launch our rescue mission at once!\nAthena:\nWell, that's one way to take off while being questioned...\nApollo:\nI'd rather prove his innocence so he can go to space again someday for real...\nJudge:\nNow then, Mr. Starbuck, do you think you can keep your feet planted on the ground?\nStarbuck:\nYes. I apologize for losing control.\nApollo:\nAre you ready to tell us... the truth?\nStarbuck:\nUngh... Not that... Anything but that...\nApollo:\n(What is going on? This isn't the Mr. Starbuck I know...)\nBlackquill:\n...It appears Space Boy is prone to deception. Witness!\nStarbuck:\nY-Yikes! Y-Yes...?\nBlackquill:\nI thought your story odd, but perhaps the inconsistencies can be explained as... ...the result of a medical side effect?\nStarbuck:\nAaaaaaaaaaaaaaaagh! Prosecutor Blackquill! Please... Please don't talk about that...\nApollo:\nW-What are you talking about, Prosecutor Blackquill?\nBlackquill:\nHmph. Didn't I already state that Space Boy is, ironically, terrified of going into space? That's why he took some \"precautions\" just before the launch. For you see, traces of this anti-anxiety drug were found in his system.\nApollo:\nOh...? (I sense things are about to nosedive...)\nStarbuck:\nStarbuck:\nY-You got it all wrong! I told 'em during the investigation, too! I don't know anything about any drugs! I never took any medication, I swear!\nApollo:\n(It was found in his system, but he doesn't remember taking it...?) How could that be?\nStarbuck:\nSomebody must've slipped them to me! B-But I guess maybe that's why I don't remember... because of the side effects... Yeah, that's why I don't remember much about what really happened!\nApollo:\nWh-Whaaaaaaaaaaat?!\nJudge:\nOrder! Order in the court!\nApollo:\n(We can't get any useful testimony out of him if he doesn't remember anything...!)\nAthena:\nWell, this certainly explains why his testimony kept changing.\nApollo:\nUngh... Why didn't he just tell me he couldn't remember?\nAthena:\nI guess he didn't want anybody to find out he was terrified of going into space.\nStarbuck:\nHaaaaaaaaaaaaaaaangh... Maybe I really DID do it...?\nBlackquill:\nWhich brings us to the answer of our original question... ...of how the witness climbed down the ladder with a dead body.\nApollo:\nIt does? ............Um, so what is it?\nBlackquill:\nA dead man feels no pain and makes no complaints, Justice-dono. So the body was simply dropped down from the top of the ladder.\nJudge:\nOh, my! I see... And then the defendant could climb down with his free hand...\nApollo:\nApollo:\nDrop the body down?! Who would do such a disrespectable thing?! Besides, dropping the body down would leave marks on the body itself.\nBlackquill:\nSo you are capable of quick thinking. ...Yes, you are correct.\nApollo:\nReally? Oh, um, thanks...? Heh heh. Aaaaaaagh! ...Huh? What's this?\nBlackquill:\nIt's the oxygen tank from the victim's spacesuit. It's ruptured, and I'm sure you can figure out why.\nApollo:\n.........Y-You can't be implying it ruptured when the defendant dropped the victim's body!\nBlackquill:\nI am, for they fracture easily when struck.\nApollo:\nApollo:\nEven if that's true, the tank's explosion and shrapnel would leave its mark on the body. Yet, according to the autopsy report, only the knife wound was found on the victim's body. You're clearly grasping at straws with this line of reasoning!\nBlackquill:\nBlackquill:\nA spacesuit isn't heavy for the sake of being heavy, Justice-dono. It includes the latest technological devices and is made of the fabric of tomorrow. The fabric is made to protect astronauts from the dangers of space... ...so falling a few Earth yards would hardly leave a mark on the wearer.\nApollo:\nApollo:\nThen shouldn't it be impossible to stab someone through it as well?!\nBlackquill:\nIt should, and yet, through sheer coincidence... ...the knife slipped through a weak spot in the suit's structure and found its way to its target.\nApollo:\nWh-What are the chances...?\nBlackquill:\nYou forget that our killer is an astronaut himself with knowledge of how the suits work.\nApollo:\nNngh... (He's got me there...)\nBlackquill:\nAnd now my argument has been proven. Space Boy killed the victim in the rocket and then dropped his body from the upper level. After climbing down, he shouldered the body and made sure the camera recorded them. There's no room for debate about these facts. It is clear that Solomon Starbuck is the only one who could have killed Clay Terran!\nApollo:\nGAAAAAAAAAAAAAAAAAAAAAGH!\nBlackquill:\nHere. The report regarding the astronauts' oxygen tanks. Consider it my send-off gift. Feel free to use it as payment to cross the river Styx.\nApollo:\nAck!\nOxygen Tank Data added to the Court Record.\nAthena:\nHey, this report is pretty detailed.\nApollo:\nLet's see... \"The display on the astronaut's left shoulder shows the oxygen remaining.\" (Changed from [Let's see... 'The display on the astronaut's left shoulder shows how much oxygen remains.'] in the original release) I guess that means these glowing cyan digits represent the amount of oxygen in the tank... (Changed from [I guess that means these glowing cyan digits represent the amount of oxygen remaining...] in the original release)\nStarbuck:\nHaaaaaaaaaaaaaaaangh... I'm done foooooooooor! I'm going to prison instead of spaaaaaaaaaaaaaaaaaaace!\nBlackquill:\n...Space Boy.\nStarbuck:\nY-Y-Y-Yes?!\nBlackquill:\nTake heart. The bejeweled night sky is still beautiful even when viewed through bars.\nStarbuck:\nY-You mean... the stars as seen from... prison...?\nBlackquill:\nThat's right. Your cell will be your spaceship. Picture the view through the iron bars. It's like being an astronaut in your own craft for all time.\nStarbuck:\nHa ha ha. That's not a half bad thought...\nApollo:\nUm, Mr. Starbuck..? (Prosecutor Blackquill got to him good...)\nStarbuck:\nSpaceship \"Prison Cell,\" fly me, my guilt, and my despair into the deepest, darkest space. And then, let's get sucked into a black hole together!\nApollo:\nApollo:\nMr. Starbuck, you can't give up hope!\nStarbuck:\nOh...! Yes, Apollo...?\nApollo:\nYou know, Clay really looked up to you. He said you are an incredible man. He said you'd never give up your dreams and passion for space, no matter the situation.\nStarbuck:\nHe said that...?\nApollo:\nSo don't give up now and help me prove your innocence! For the sake of the man who respected you and believe in you -- Clay Terran!\nStarbuck:\nFor Clay...!\nBlackquill:\n...Hmph. You're wasting your breath.\nStarbuck:\nUnnnh... Nngh... Raaaaaaaaaaaaagh! RAAAAAAAAAAAAAAAAAAAAAAAAGH! GRAAAAAAAAAAAAAAAAAAAAAAAAGH!\nStarbuck:\n............Apollo, thank you! I can see things clearly now!\nApollo:\nMr. Starbuck!\nStarbuck:\nI'm... I'm fine now -- thanks for reminding me of my life's mission.\nApollo:\nRight. We'll both be fine! I'll prove you're innocent. You'll see! And after that, we'll get you back into space!\nStarbuck:\nRaaaaaaaaahhhh! You've ignited the booster rockets of my soooouuuul! I'm on fiiiiiiiiiiire!!! I am Solomon Starbuck, astronaut! A cosmic hero chosen by the universe itself! This is no time to be whimpering and crying! I can't let you and Clay down!\nBlackquill:\nBalderdash.\nStarbuck:\nThe sun... the moon... all of space is calling me! Solomon \"Sol\" Starbuck! Ready for launch! Begin the countdown! Five!\nApollo:\nFour!\nAthena:\nThree!\nJudge:\nTwo!\nOne!\nStarbuck:\nLIFT OFF!\nJudge:\nWell! I feel like I've witnessed an actual rocket launch!\nAthena:\nApollo! You did it! You broke Prosecutor Blackquill's grip over Mr. Starbuck!\nApollo:\nI can't take the credit. It was all Mr. Starbuck. He pulled himself through.\nBlackquill:\nHmph. If you simpletons are done massaging one another's egos... No matter how positive your mood, my advantage remains unshakable. I have but to wait for the final guilty verdict. Isn't that right, Your Baldness?\nApollo:\nGah... (I can't let up now! I have to stop Blackquill! I have to see this through... Mr. Starbuck just has to make it back into space! I won't allow Clay's dream to remain unfulfilled! I've got to destroy Blackquill's argument somehow! Think, Justice! Think! If the only people at Launch Pad 1 were Clay and Mr. Starbuck... ...and if Clay was already dead by the time this footage was taken... ...then the only person who could've killed him is Mr. Starbuck. So the only way to counter Blackquill's argument is... ... if I can prove that Clay was still alive when they arrived at the boarding lounge. In which case, I should be able to find some contradiction in the evidence itself! Now, let's see... About this data that we just received... This supposedly proves that Mr. Starbuck dropped Clay's body in Launch Pad 1. But if I'm going to prove that false, then there must be something I can use here.)\nBlackquill:\nEnough of this farce, Your Baldness! Let's have your verdict!\nApollo:\nApollo:\nProsecutor Blackquill, you seem to be in quite a hurry to rush the verdict. But about this oxygen tank data you submitted just now... ...it says that Mr. Starbuck's tank had 80 percent remaining while Mr. Terran's had 0. Do you stand by the accuracy of this report?\nBlackquill:\nOf course.\nApollo:\n............Then I guess it simply means that it's faulty, as evidence goes.\nBlackquill:\nYou will explain what you mean, Justice-dono.\nApollo:\nIt's simple. This evidence contradicts the facts of this case. Take a look here at the detailed description and you'll see what I mean.\nJudge:\nI hope you have some evidence, Mr. Justice, because I don't see what's so contradictory!\nApollo:\nY-Yes, Your Honor! Right away! This is the evidence that the oxygen tank report stands in contradiction to!\nPresent Security Camera Video\nApollo:\nLeads to:\n\"And how does this evidence present a contradiction?\"\nPresent anything else\nApollo:\nJudge:\nAnd how does this evidence present a contradiction?\nApollo:\n...If you think about it on a cosmic level, this world is full of inconsistencies! Wouldn't you agree that this evidence is just one of those mysteries of the universe?\nJudge:\nNo, I wouldn't. But I am going to give you a cosmic penalty.\nApollo:\n(Too bad he didn't take a more cosmic view of things and forgive me on that one...) Your Honor! Please let me try that again! (I think the problem must lie in the remaining oxygen in the two tanks... Mr. Starbuck's tank was 80 percent full, while Clay's was at 0 percent. Can I find something that contradicts this information?)\nLeads back to:\n\"This is the evidence that the oxygen tank report stands in contradiction to!\"\nJudge:\nAnd how does this evidence present a contradiction?\nApollo:\nThe problem is this part here.\nPresent oxygen tank display\nApollo:\nLeads to:\n\"Note the remaining oxygen in Mr. Starbuck's tank as he carries Mr. Terran.\"\nPresent anywhere else\nApollo:\nJudge:\nHmm? And what problem do you see with that part?\nApollo:\nWhat? Oh, um... I just thought it looked... problematic, you know? Don't tell me I'm the only one who thinks so!\nJudge:\nYou're the only one. And you'll be the only one to receive this penalty, too.\nApollo:\nUngh... (One is the loneliest number... But now that I'm looking at it, I definitely see something strange in this footage.) Your Honor! Please allow me to give that another try!\nLeads back to:\n\"The problem is this part here.\"\nApollo:\nNote the remaining oxygen in Mr. Starbuck's tank as he carries Mr. Terran.\nJudge:\nHmm... It appears to say 50.\nApollo:\nYes, but according to the data, our client's tank had 80 percent remaining.\nJudge:\nThe oxygen in the tank increased?\nApollo:\nI see Your Honor finds it as strange as I do. It's bad enough that there is a contradiction, but the increase in oxygen is beyond illogical!\nJudge:\nOh, my! You're absolutely right! What is going on here?\nBlackquill:\nBlackquill:\nHmph. I, too, find it odd that the oxygen remaining has increased. It would be as odd as if my rations were to increase. But what does that prove? It doesn't change the fact that it is the defendant carrying the victim's corpse!\nApollo:\nApollo:\nHeh. I'm going to bet you don't get more rations because you don't abide by the rules. Either way, the oxygen remaining shouldn't increase, just as your rations don't increase. Therefore, this new information is critical! We can't overlook it!\nBlackquill:\nBlackquill:\nIn that case, do you have an answer to this riddle of the mysteriously increasing oxygen? You'd better not disappoint, or I'll declare the inconsistency as mere equipment malfunction.\nApollo:\nErk!\nJudge:\nHmm... Prosecutor Blackquill has a point. I suppose it could be a simple malfunction. Mr. Justice. If you cannot provide an adequate counterargument to this point... ...I'm afraid I must bring this trial to an end. So, do you think you can explain why the remaining oxygen level increased?\nApollo:\nO-Of course I can! (The thing to do at a time like this is turn my thinking around! Mr. Starbuck has no memory of it, but he claims to have carried Clay. So this man with the 50 on his tank ought to be Mr. Starbuck. But, if anything, the display on his oxygen tank should have shown an 80. This is a clear contradiction between the report and the security footage. So what I should be asking is not, \"Why did the oxygen level increase?\"... ...but, \"What had to have happened to make it LOOK like it increased?\" Am I making some kind of mistake in my base assumptions here...?)\nJudge:\nWell, Mr. Justice? We're waiting.\nApollo:\nYes, Your Honor! I'm ready to answer! This is why the remaining oxygen appears to have increased!\nThey were going the other way\nApollo:\nMaybe they were escaping in the opposite direction.\nJudge:\nThe opposite direction? Like how rewinding a video makes things look like they're repairing themselves? ...In which case, I think the one who's going to need rewinding is you, Mr. Justice. Penalty!\nApollo:\n(Ugh... I'd rather fast-forward through this myself... \"What had to have happened to make it LOOK like it increased?\" Wait a minute! I think I've got it!)\nLeads back to:\n\"This is why the remaining oxygen appears to have increased!\"\nThe victim was carrying the defendant\nLeads to:\n\"What if it was the other way around?\"\nThe tanks were damaged\nApollo:\nThe answer is simple. The tanks were damaged! Ack!\nBlackquill:\nI don't think the problem is with the tanks, but with your eyes, Justice-dono. It's written in the report that the tanks were functioning properly.\nApollo:\nAck! It's amazing how diligent reporting can come back to bite you in the rear.\nJudge:\nAnd it's amazing how your diligent negligence can come back to bite you in the rear, too! Let this penalty remind you of the consequences of your actions!\nApollo:\n(Ow, my aching rear... Let's try that again. \"What had to have happened to make it LOOK like it increased?\" Wait a minute! I think I've got it!)\nLeads back to:\n\"This is why the remaining oxygen appears to have increased!\"\nApollo:\nWhat if it was the other way around?\nJudge:\nThe other way around? Would you care to explain, Mr. Justice?\nApollo:\nAs you can see, Your Honor, both men had their helmets on in this footage. But it turns out, this is where our base assumptions went astray. We assumed that it was Mr. Starbuck helping Mr. Terran, but it was the other way around. It wasn't Mr. Starbuck helping Mr. Terran at all. It was Mr. Terran who was helping Mr. Starbuck to the boarding lounge!\nJudge:\nI-I-It was whaaaaaaaaaaaat?! Order! Order! Mr. Justice! You mean to tell me that the person on the right in this image is the victim, Clay Terran?\nApollo:\nIt's the only way the riddle of the increasing oxygen level can be solved, Your Honor. At this point in time, the remaining oxygen in the victim's tank was at 50 percent. And when the victim was found in the boarding lounge, his tank was at 0 percent.\nAthena:\nThat's right! There's nothing contradictory about the oxygen level decreasing!\nApollo:\nThis means Mr. Terran was alive as they made their escape to the lounge!\nBlackquill:\nBlackquill:\nHmph. How short your memory is. Have you forgotten what you yourself proposed? Even if the victim was alive at this point in time... ...how did he descend the ladder with his arms full?!\nApollo:\nApollo:\nProsecutor Blackquill, you can't hurt me with a broken blade.\nBlackquill:\nExcuse me?\nApollo:\nIt's true that we don't know how they got down the ladder. I suppose that matter needs further investigating. But we have proven that Mr. Terran was alive when he reached the boarding lounge. This fact alone shatters your claims... ...and opens up the possibility that the victim could've been killed by a third party!\nBlackquill:\nGRAAAAAAAAAAAAAAAAAAAAAWR!\nApollo:\nThere were two people who claimed to be the first on the scene. But can we truly trust their statements?\nAthena:\nLet's see. The two people were Detective Candice Arme and Yuri Cosmos, right? You think that one of them might have given a false statement to the police?\nApollo:\nYes, it's certainly possible. We might have to do a little more digging.\nJudge:\nIt seems we'll have to hear the testimony of these first two people on the scene.\nApollo:\n(Score!)\nJudge:\nCome to think of it, Detective Arme should be here in court right now. Bailiff, could you please show Detective Arme to the stand?\n???:\nTonate:\nI-I have an announcement, everyone!\nJudge:\nWh-What's the meaning of this? We're in the middle of a trial here!\nTonate:\nP-Please remain calm and listen carefully. Someone has reactivated the bomb! The bomb was defused, but, but, but...... I-It's about to explode! (Changed from [The bomb was diffused, [sic] but, but, but...... I-It's about to explode!] in the original release)\nApollo:\nEX-\nAthena:\nPL-\nJudge:\nOOOOOOOOODE!?\nApollo:\nA bomb? Now?!\nMan:\n-- Aaaagh! Everybody run!\nWoman:\n-- Eeeeek! I don't want to die!\nAthena:\nOh, no! Everybody's panicking!\nBlackquill:\nBlackquill:\nHeadless chickens with a death wish, the lot of you! Calm yourselves afore all else!\nAthena:\nC'mon, Apollo! Let's get out of here!\nApollo:\nBut what about Mr. Starbuck's dream? And who will carry out Clay's final wish? I don't care what happens to me! I'm not letting some bomb blow the truth up forever! I... I... I refuse to let things end here!\nAthena:\nApollo, this is no time to be dramatic! If we don't get out of here now, we're gonna die! C'MON! THIS WAY!\nApollo:\nHey! Ouch! Let me go!\nWoods:\nApollo!\nApollo:\nJ-Juniper? (She hasn't evacuated yet?)\nWoods:\nEeeeek!\nApollo:\nJ-Juniper! Are you all right?!\nAthena:\nApollo! No! Not that way!\nApollo:\nAAAAAAAAAAAAAAAAAAAAAAAAAAAAAH!\nTo be continued\nPresenting wrong evidence during testimony\nApollo:\nApollo:\nConsider the evidence. There's obviously something wrong with that statement!\nBlackquill:\nYour gall knows no bounds. It's shocking, really.\nApollo:\nWhat's that supposed to mean?!\nBlackquill:\nYou stand there, brazenly objecting to perfectly factual statements... One does not see such shameless behavior that often.\nJudge:\nA penalty for our shameless attorney!\nApollo:\n(Oh, no. Looks like Blackquill is turning the judge against me).\nPresenting wrong evidence during testimony\nApollo:\nApollo:\nThat statement clearly contradicts the evidence!\nBlackquill:\n...Hmph. I object to you on personal grounds. The sole contradiction lies in what your faulty logic dreamt up just now.\nApollo:\nAck!\nJudge:\nObjection overruled. The defense will think twice before making such erroneous statements!\nApollo:\n(It seems that statement didn't particularly conflict with the evidence.)\nPresenting wrong evidence during testimony\nApollo:\nApollo:\nThe evidence is at complete odds with the witness's testimony!\nBlackquill:\n...........................Your Baldness.\nJudge:\nWh-Who, me?\nBlackquill:\nWhat do you make of this objection of his?\nJudge:\nOh, I don't know if I should, um, well...\nBlackquill:\nI've no patience for vagaries. Now, answer my question.\nJudge:\nY-Yes, sir! The defense's objection was clearly misguided!\nBlackquill:\nBravo. Nicely done.\nJudge:\nHo ho ho. It seems our misguided attorne has earned himself a penalty.\nApollo:\n(Erk... I better look before I leap next time!)\nConsult (when statements must be pressed)\nAthena:\nHmm... I can't flag any inconsistencies.\nApollo:\nSo there haven't been any contradictions in the testimony so far... That can mean only one thing...\nAthena:\nTime to press the witness!\nApollo:\nRight. We'll have to work to get the testimony we need. Let's press the heck out of any statements that stick out.\nConsult (when evidence must be presented)\nAthena:\nHmm... There has to be a contradiction here somewhere.\nApollo:\n(Too bad I'm drawing a blank.)\nAthena:\nThere was a statement that I thought was a little strange, but... ...I wouldn't bet my life on it.\nApollo:\n.........And which statement would that be? Since I'm the one betting my life on it.\nAthena:\nHee hee hee. Okay, if you must know, I'll show you the one I'm thinking of.\nApollo:\n(Time to swallow my pride and let her lend a hand. There must be an inconsistency in the testimony Athena's pointing out!)\nToo many penalties\nJudge:\nThat's enough! I see no need to further prolong this trial. The defense's case is insufficient to overturn the prosecution's claims! This court finds the defendant, Solomon Starbuck...\nGuilty\nThe Cosmic Turnabout\nImage Gallery\nTranscript\nPart 1\nPart 2\nPart 3\nPhoenix:\nIn the middle of the Space Center bombing trial, we had another bombing incident. This one destroyed Courtroom No. 4. Furthermore, Apollo suffered massive injuries from being there when the bomb went off. Unfortunately, Juniper Woods was fingered as the courtroom bomber. Athena and I knew she had to be innocent, so we took her case on. We managed to clear Ms. Woods's name... ...but Apollo sustained further injuries when he was attacked by Ted Tonate.\nDecember 19, 3:21 PMWright Anything Agency\nAthena:\nApollo is a tough guy, but this is all taking its toll on him.\nPhoenix:\nYeah. Poor guy, being attacked by Tonate like that on top of all his other injuries. (Apollo is resting at the nearby Hickfield Clinic. I've had some experience with that place myself. What an awful turn of events. I never thought he'd land in a hospital of all places...)\nTrucy:\n............\nPhoenix:\nYou must miss him, too, huh? Now that you don't have anybody to tease. Don't worry. He's young. He'll heal quickly and be back before you know it!\nTrucy:\n............\nPhoenix:\n(It's been a while since I last saw Trucy look so down... We won the court case, yet nobody feels much like celebrating...)\nAthena:\n*sniffle* Mnnnph... All right, enough of this, people! This is no time to be moping around! Now, dry those eyes! Both of you!\nPhoenix:\nUh, you're the only one who's crying, Athena.\nAthena:\nTechnicalities! Look, we have work to do! We have to take over!\nPhoenix:\n...Umm, take over what, exactly...?\nAthena:\nApollo's Space Center case, of course! As no verdict's been reached, there's still a chance!\nTrucy:\nI agree with Athena. We should pick up Mr. Starbuck's defense. We have to avenge our fallen comrade! Right, Daddy?\nPhoenix:\n(Apollo hasn't exactly \"fallen.\" He's still alive, you know...)\nAthena:\nGood! Now that that's settled, let's get going! C'mon, we gotta run!\nPhoenix:\nWait? Right NOW, now?! (We'd better not be running the whole way!) ...There she goes. I'd better go catch up. *sigh* Can you take care of the office, Trucy?\nTrucy:\nSure thing, Daddy! Let's be careful out there! In the meantime, I'm going to bake some cookies and fill up my magic panties for you!\nPhoenix:\n(Trucy seems to be feeling a little better. I can always count on Athena to perk everybody up with her enthusiasm.)\nTrucy:\nOh! She's back!\nAthena:\nDon't mind me! Just forgot a few things! ...Wallet, phone, the documents, my bag...\nPhoenix:\nSounds more like you forgot everything. (I can always count on Athena for that, too.)\nTrucy:\nAll right, you two. Let's be careful out there!\nDecember 19Detention Center - Visitor's Room\nPhoenix:\nSo our client is one Solomon Starbuck. He's so famous, even I've heard of him.\nAthena:\nThat's right! He's a super-famous astronaut who works at the Cosmos Space Center! He was actually up in outer space seven years ago!\nPhoenix:\nYou seem to know quite a bit about him. (Now I'm all excited to meet the man!)\nStarbuck:\nHaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaangh...\nPhoenix:\n(Wow. That was the longest sigh I've ever heard.)\nStarbuck:\nApollo told me all about you... You're Phoenix Wright, Apollo's mentor, right?\nPhoenix:\nY-Yes, that's right. (Hmm, mentor has a nice ring to it...)\nAthena:\nDon't worry about a thing, Mr. Starbuck! Mr. Wright and I have got you covered!\nStarbuck:\nAhh, and you're... the new kid that Apollo told me about. ......Wait! Don't I know you from somewhere?\nAthena:\nHuh? Y-You mean... other than at your trial? I don't think so...\nStarbuck:\n...I guess so. My mistake. Haaaaaaaaaaaaaaaangh... My memory isn't what it used to be. My mind and body are kaput. Same goes for my life. I mean, I'm so astronomically unlucky that I had a bomb go off in the middle of my trial! Trying to defend me would be like trying to enter the stratosphere without a spacecraft.\nPhoenix:\n(Yikes. He's SERIOUSLY got to stop depressing himself...)\nAthena:\nCheer up, Mr. Starbuck! Besides, that thing you said about entering the stratosphere... That just means we'd shine like shooting stars, right?\nStarbuck:\nLike shooting stars, huh...? You know, you're right! Why didn't I think of that?! After all, that's what we were all put on this Earth to do, right? To shine like stars!\nPhoenix:\n(Guess I shouldn't mention the fact that shooting stars burn out in a flash...)\nStarbuck:\nAw, yeah! Here we goooooo! Three! Two! One! To the stratosphere and beyond! Yeah! I feel alive now! You can go ahead and ask me anything you want!\nPhoenix:\n(Is that really all it takes?)\nTalk\nThe case\nPhoenix:\nSo, you have no memory at all of the incident?\nStarbuck:\nHaaaaaaaaaaaaaaaangh... I'm so ashamed. My memory of the time is as black and clouded as a dark nebula.\nAthena:\nStill, it's strange you don't remember a thing. Are you sure you didn't take one of those anti-anxiety pills like they said at the trial?\nStarbuck:\nY-You got it all wrong! I told 'em during the investigation, too! I don't know anything about any drugs! I never took any medication, I swear!\nStarbuck:\nIt IS true I developed a fear of space because of what happened seven years ago... And I was taking medication secretly every now and then when my anxiety got bad. Having a fear of space is not something an astronaut can brag about, you know?\nPhoenix:\nOh, the so-called \"HAT-1 Miracle\"? (That must've been a terrifying experience...)\nStarbuck:\nBut I'm still an astronaut at heart, come what may. I would never take drugs that might impede my performance just before a launch. That launch meant everything to me. That's more certain than the theory of relativity!\nPhoenix:\n(He seems like a completely different person now. This is the face of the astronaut I know.)\nAthena:\nBut the tranquilizers were found in your system.\nStarbuck:\nHaaaaaaaaaaaaaaaangh... Yeah, see, that's the thing. But I don't know why! I'm done for...\nPhoenix:\nIf you didn't take them, then maybe somebody slipped them to you?\nStarbuck:\nExactly! That's what I thought! It must have been the real culprit! My medication was in my locker. Anybody could've gotten their hands on it.\nAthena:\nMaybe the real culprit also planted the detonator switch in your pocket.\nStarbuck:\nYeah. That's gotta be it! I've been framed!\nPhoenix:\n(I'll say. They even managed to plant your prints on the switch before slipping it in.) It's a real possibility. Do you remember anything else that might be relevant? Anything at all, no matter how small. Like, about the murder weapon, for example.\nStarbuck:\nHmm... That knife... I think it came from one of the Space Center's utility kits.\nPhoenix:\nUtility kits?\nStarbuck:\nYeah. Staff who work on machinery a lot are given these special tool kits to use. All the technicians have them, so I doubt you could prove whose knife it is.\nUtility Knife updated in the Court Record.\nThe case (subsequent times)\nPhoenix:\nSo, you have no memory at all of the incident?\nStarbuck:\nHaaaaaaaaaaaaaaaangh... I'm so ashamed. My memory of the time is as black and clouded as a dark nebula.\nAthena:\nStill, it's strange you don't remember a thing. Are you sure you didn't take one of those anti-anxiety pills like they said at the trial?\nStarbuck:\nY-You got it all wrong! I told 'em during the investigation, too! I don't know anything about any drugs! I never took any medication, I swear!\nStarbuck:\nIt IS true I developed a fear of space because of what happened seven years ago... And I was taking medication secretly every now and then when my anxiety got bad. Having a fear of space is not something an astronaut can brag about, you know?\nPhoenix:\nOh, the so-called \"HAT-1 Miracle\"? (That must've been a terrifying experience...)\nStarbuck:\nBut I'm still an astronaut at heart, come what may. I would never take drugs that might impede my performance just before a launch. That launch meant everything to me. That's more certain than the theory of relativity!\nPhoenix:\n(He seems like a completely different person now. This is the face of the astronaut I know.)\nAthena:\nBut the tranquilizers were found in your system.\nStarbuck:\nHaaaaaaaaaaaaaaaangh... Yeah, see, that's the thing. But I don't know why! I'm done for...\nPhoenix:\nIf you didn't take them, then maybe somebody slipped them to you?\nStarbuck:\nExactly! That's what I thought! It must have been the real culprit! My medication was in my locker. Anybody could've gotten their hands on it.\nAthena:\nMaybe the real culprit also planted the detonator switch in your pocket.\nStarbuck:\nYeah. That's gotta be it! I've been framed!\nPhoenix:\n(I'll say. They even managed to plant your prints on the switch before slipping it in.) It's a real possibility. Do you remember anything else that might be relevant? Anything at all, no matter how small. Like, about the murder weapon, for example.\nStarbuck:\nHmm... That knife... I think it came from one of the Space Center's utility kits.\nPhoenix:\nUtility kits?\nStarbuck:\nYeah. Staff who work on machinery a lot are given these special tool kits to use. All the technicians have them, so I doubt you could prove whose knife it is.\nThe HAT-1 Miracle (appears after \"The case\")\nPhoenix:\nAs I recall, your last trip into space was seven years ago, right?\nStarbuck:\nThat's right. It was... a pretty rough experience... During that mission, we had all kinds of problems with the craft.\nPhoenix:\nYou did? What kind of problems?\nStarbuck:\nPower failure, oxygen leakage, busted radio, cracked windows, loose control column... The heat shield came off as we were entering the atmosphere. I thought I was a goner. But I managed to make it somehow with the popsicles and ice packs from the freezer.\nAthena:\nNo wonder they dubbed it the HAT-1 Miracle... It's a miracle you made it back!\nStarbuck:\nSpace is a boundless place. That's why it continues to capture people's imaginations. But the vastness of space shows us how insignificant we are in the scheme of things. The darkness just goes on and on forever, and ever, and ever... without end. There was nobody else there. Nobody was gonna come same me. I was all alone. All alone, with nothing to listen to but the sound of my own breathing and heartbeat. I kept scrambling to make repairs, but I couldn't keep my hands from shaking...\nPhoenix:\n(An experience like that would make anybody afraid to go up into space...)\nOuter space (appears after \"The HAT-1 Miracle\")\nAthena:\nWith the experience you had, weren't you dreading this mission?\nStarbuck:\nWhat? No way. O-Of course not... Even now, I wanna go up into space so bad, I can barely stand it. I wanna shake off the Earth's gravity at escape velocity and spin around weightless!\nAthena:\nBut you have to admit it was pretty harrowing. Weren't you even a tiny bit afraid?\nStarbuck:\n............I was afraid. Of course I was! Still am! But space is man's final frontier -- an unknown world. The cosmic truth is out there waiting for us somewhere!\nPhoenix:\nThe cosmic truth, huh? (I guess there are people looking for the truth in every walk of life.)\nStarbuck:\nNo matter how afraid I am, I'm sure I can manage! If I give in to my fear, I'll never find the truth! As long as I don't give up, I can keep up the fight!\nPhoenix:\n(One thing's for sure: Mr. Starbuck's passion for space is undeniably the real deal.)\nThe victim (appears after \"Outer space\")\nPhoenix:\nThe victim, Clay Terran... He was kind of like your protg, wasn't he?\nStarbuck:\nWell, it wasn't a big exaggerated deal like master and apprentice or anything like that. But Clay did think of me as his mentor.\nPhoenix:\n(The mentor and the protg... What a combination they must have been...)\nStarbuck:\nHaaaaaaaaaaaaaaaangh... With his encouragement, I knew I could get over my fear and go back into space. But now...\nAthena:\nClay must've been very encouraging, huh?\nStarbuck:\nYeah. It's funny, really. Whenever I'd hear him shout, \"You're fine!\"... ...I always got the feeling everything really WAS gonna be just fine.\nAthena:\n\"You're fine!\"...? Apollo says \"I'm fine!\" and \"You're fine!\" all of the time, too! And I always feel encouraged, too, whenever I hear him shout it!\nStarbuck:\nYeah, Clay and Apollo were best buds. They used to come visit the Space Center a lot, ever since they were high school kids. One day, out of the blue, Clay even told me he wanted to be my protg. Those two hung around the Space Center so much, they were like a part of the staff. One time during zero-G training, I started to panic a little bit... ...and the two of them took turns shouting \"You're fine!\" over the radio. It was a simple thing, but it was exactly what I needed to hear.\nPhoenix:\n(So \"I'm fine!\" and \"You're fine!\" were like Apollo and Clay's secret phrases, huh? I wish I could ask Apollo more about Clay and their relationship now.)\nAthena:\nSpeaking of Clay... ...how do you suppose he climbed down the ladder with you over his shoulder?\nStarbuck:\nHaaaaaaaaaaaaaaaangh... Sorry, but I can't even begin to imagine.\nPhoenix:\n(But he actually did climb down that ladder, so a way has to exist.)\nStarbuck:\nHaaaaaaaaaaaaaaaangh... From the freedom of space to the walls of a cell... But that prosecutor said the dark, night sky isn't half bad through barred windows.\nAthena:\n............You're fine! Solomon \"Sol\" Starbuck is fine! Everything is going to be all right!\nStarbuck:\nHuh?\nAthena:\nAnd Athena Cykes is fine! C'mon, Mr. Wright! You, too!\nPhoenix:\n(Do I really have to...?) Phoenix Wright is fine...\nAthena:\nI can't heeeeeeear youuuuuuu!\nPhoenix:\nPh-Phoenix Wright is fine!\nAthena:\nWe'll get you back into space yet, Mr. Starbuck! Believe in your own innocence, and have faith in us!\nPhoenix:\nApollo believed in you wholeheartedly, and that's good enough for me. I believe in you, too!\nStarbuck:\n............Thank you. Thank you, both of you. I'll put my faith in you. And I vow to make it back into space! All I need first is a \"not guilty\" verdict!\nPhoenix:\n(It sure feels nice to reassure ourselves every now and then that we're all fine.)\nAthena:\nOkay, Mr. Wright! Let's get our investigation of the Space Center started! Pronto!\nPhoenix:\nGood idea. Let's go!\nThe victim (subsequent times)\nPhoenix:\nThe victim, Clay Terran... He was kind of like your protg, wasn't he?\nStarbuck:\nWell, it wasn't a big exaggerated deal like master and apprentice or anything like that. But Clay did think of me as his mentor.\nPhoenix:\n(The mentor and the protg... What a combination they must have been...)\nStarbuck:\nHaaaaaaaaaaaaaaaangh... With his encouragement, I knew I could get over my fear and go back into space. But now...\nAthena:\nClay must've been very encouraging, huh?\nStarbuck:\nYeah. It's funny, really. Whenever I'd hear him shout, \"You're fine!\"... ...I always got the feeling everything really WAS gonna be just fine.\nAthena:\n\"You're fine!\"...? Apollo says \"I'm fine!\" and \"You're fine!\" all of the time, too! And I always feel encouraged, too, whenever I hear him shout it!\nStarbuck:\nYeah, Clay and Apollo were best buds. They used to come visit the Space Center a lot, ever since they were high school kids. One day, out of the blue, Clay even told me he wanted to be my protg. Those two hung around the Space Center so much, they were like a part of the staff. One time during zero-G training, I started to panic a little bit... ...and the two of them took turns shouting \"You're fine!\" over the radio. It was a simple thing, but it was exactly what I needed to hear.\nPhoenix:\n(So \"I'm fine!\" and \"You're fine!\" were like Apollo and Clay's secret phrases, huh? I wish I could ask Apollo more about Clay and their relationship now.)\nAthena:\nSpeaking of Clay... ...how do you suppose he climbed down the ladder with you over his shoulder?\nStarbuck:\nHaaaaaaaaaaaaaaaangh... Sorry, but I can't even begin to imagine.\nPhoenix:\n(But he actually did climb down that ladder, so a way has to exist.)\nPresent\nAttorney's Badge\nPhoenix:\nSo, what do you think about this?\nStarbuck:\nHaaaaaaaaaaaaaaaangh... The evidence is gonna get me convicted...\nPhoenix:\nNo, no, no! It's my attorney's badge! I was hoping it would reassure you that we're here to defend you. Evidence isn't just for the prosecution. It can help prove a person's innocence, too.\nStarbuck:\n...Ha ha ha. That's a positive spin on things.\nPhoenix:\n...I thought that was common knowledge.\nTerran's Autopsy Report or Security Camera Video\nStarbuck:\nClay always used to cheerfully greet me in a loud voice.\nPhoenix:\nAnd he did vocal exercises every morning, sometimes until he was hoarse, right?\nStarbuck:\nExactly. You could always hear him, even through the wall -- Hey, wait a minute. Did you know Clay?\nPhoenix:\nNo, but like attracts like, as they say.\nUtility Knife\nStarbuck:\nClay carried me out and saved me... But after all that... ...to be killed with this blade... Unnnh... And the fact that the killer might be me...\nPhoenix:\nHaaaaaaaaaaaaaaaangh...\nAthena:\nNow he's got you sighing, Boss...\nAnything else\nPhoenix:\nDo you know anything about this piece of evidence?\nStarbuck:\nNo... Sorry I'm so useless... Haaaaaaaaaaaaaaaangh...\nPhoenix:\nNo, no. It's all right. There's no need to get all depressed!\nWright Anything Agency\nTalk\nWhat to do\nPhoenix:\nYou went to visit Apollo in the hospital, right? How was he?\nTrucy:\nHe seemed to be doing well. He was doing his Chords of Steel exercises in his room.\nPhoenix:\nHa ha ha! I guess he's pretty gung-ho to get back to work. Was he shouting stuff like \"Objection!\" and \"I'm fine!\"?\nTrucy:\nNo... He was yelling... ...\"Thank you for coming to visit me!\" and \"Thank you, doctor, for taking care of me!\" ...and stuff like that.\nPhoenix:\n...I guess those voice workouts can be pretty flexible.\nAny ideas?\nPhoenix:\nNotice anything, Trucy?\nTrucy:\nWhat do you mean, Daddy? Is your attorney's badge somehow different? Did you bend it out of shape or something?\nPhoenix:\nHa ha ha, it's not that easy to bend something so small out of shape, you know.\nTrucy:\nHmm... Then, did you change your hairstyle? Or maybe it's your suit? I don't know. You look like you always do to me, Daddy.\nPhoenix:\nThat really wasn't what I was asking...\nPresent\nAttorney's Badge\nTrucy:\nI guess presenting your attorney's badge... ...is like your \"quick trick,\" huh, Daddy?\nPhoenix:\nHa ha ha. So it's just a trick to you, huh?\nTrucy:\nWell, you are one of the talents in our Wright Anything Agency, after all. But I have to say that an attorney's badge won't get many laughs...\nPhoenix:\nI don't care if I don't get laughs, as long as I can clear my client's name.\nTrucy:\nHa ha ha! That's a good one, Daddy!\nPhoenix:\nI'm no match for you, though, Trucy.\nAnything else\nTrucy:\nDaddy, you should be careful about showing evidence to a magician.\nPhoenix:\nThat's true. You can make anything disappear.\nTrucy:\nWell, anything up to about a yard in diameter, anyway. My magic panties are an extra-dimensional space!\nPhoenix:\nI guess only a space probe can help us figure out how they work then, huh.\nAfter clearing \"The victim\" Talk option in Detention Center - Visitor's Room:\nDecember 19Cosmos Space Center - Entrance\nPhoenix:\nWow. I was wondering what kind of place this space center would be. It almost looks like an amusement park of the future.\nAthena:\nYeah! Did you know they even let the public see their rockets up close? Oh! So, check it out! Look at how brightly the GYAXA logo shines in the sunlight above the entranceway! I really dig the stars and rocket motif it's got going!\nPhoenix:\nGYAXA, huh? Isn't that the new name of the federal space R&D program?\nAthena:\nYeah, but why the strange acronym? I mean, what is GYA supposed to stand for? Galaxy?\nPhoenix:\nIf that were it, then the whole thing would be something like \"Galaxy eXploration Agency\"... ...which, if you ask me, I'd have abbreviated to GAXA... or even GAEA.\nAthena:\nHmm... I guess so... Oh, I know! Maybe the person who came up with the name just really likes the letter Y!\nPhoenix:\n(This exchange is beginning to feel oddly like dj vu...)\nAthena:\nAnyway, this place is more than just a research facility; it's also a tourist attraction!\n???:\nTourist attraction? Don't make me laugh! It's a monument to the human race! Galactic Scooter, full speed ahead!\nAthena:\nYikes! Who's this geezer and what's he want...?\n???:\nLook upon me, and look well! Behold the great power of space science!\nPhoenix:\nPardon me, but you are...?\n???:\nMy glorious name is Yuri Cosmos!\nCosmos:\nI am the director of the Cosmos Space Center, the \"center of the cosmos\"!\nAthena:\nBoss... That was pretty groan-inducing...\nPhoenix:\nIf this person is the Space Center's director, then that means...\nAthena:\nAha! So you were one of the first to discover Clay's body, weren't you?\nApollo:\nAnd who was the first to find the victim?\nFulbright:\nActually, there were two of them!\nBlackquill:\nThe Space Center director... ...Yuri Cosmos... and Detective Candice Arme.\nCosmos:\nThat is correct! I was honored to be the very first man in all of space and time to discover the body. But this talk of the incident... Are you by any chance... the space police?\nPhoenix:\n(You can't tack the word \"space\" onto just any old thing, you know.) We're Mr. Starbuck's lawyers. We're here to investigate this case.\nAthena:\nOh, and we're Earth lawyers, by the way.\nCosmos:\nAh, I see. Yes, I've heard about you. In that case, by my esteemed privilege, I grant you permission to investigate. I trust you are appropriately grateful. Now, go ahead! Have at it!\nAthena:\nI can already tell he's going to be nothing but trouble.\nPhoenix:\nDon't let him hear you say that or you'll see what trouble really is. Let's just be professional and ask him about when he found the body, okay?\nTalk\nYuri Cosmos\nPhoenix:\nSo, as director, what do you do here at the Space Center, specifically?\nCosmos:\nDefend peace across the galaxy and promote space development in this country. No matter what obstacles stand in our way, we keep going... for the sake of mankind!\nPhoenix:\n(Uh, I believe I used the word \"specifically\" in my question...)\nCosmos:\nAttention all personnel! To your break stations! Prepare for break!\nAthena:\nOh, I get it! You just wander around and tell people what to do in a self-important manner!\nCosmos:\nThat is exactly right! Because I am an important man, my manner is important!\nAthena:\nMr. Wright, this man doesn't get sarcasm.\nPhoenix:\nWell, there's bound to be some people like that, here in the boundlessness of space.\nCosmos:\nWhat's that? You want to know what it is that makes me important, specifically? Very well! I will tell you! I was THE central figure of the HAT-1 Project! You may proceed to be appropriately impressed. Now, go ahead! Have at it!\nPhoenix:\n(I might be more impressed if I knew what he did for it... specifically.)\nAbout the bombing\nPhoenix:\nCould you tell us what you know about the incidents from the other day?\nCosmos:\nHmm............ I refuse!\nPhoenix:\nWhat?\nCosmos:\nExplaining is a job for common folk, not the director of the center of the cosmos! My testimony -- which will go down in space history -- will be heard in the courtroom!\nAthena:\nWhat? So does that mean you'll be taking the stand tomorrow?\nCosmos:\nThat is correct! I will be the most glorious witness in the history of mankind!\nPhoenix:\n(I'm not sure he really understands what being a \"witness\" is all about...)\nAthena:\nLooks like Director Cosmos is the type that only talks about what he wants to talk about.\nPhoenix:\nThen let's at least try to ask him about the things he might be willing to open up about.\nAbout HAT-1 (appears after \"About the bombing\")\nPhoenix:\nThe HAT-1 was a rocket that was launched into space seven years ago, correct? And despite numerous problems, it somehow made its way back home...?\nCosmos:\n...Hm. I suppose it IS part of my job to educate ignorant young folk like you. Very well! I will impart to you the complete story of the HAT-1 Project!\nPhoenix:\nOh, uh, thank you very much.\nCosmos:\nHAT-1's noble mission was to collect samples from an asteroid! And Mr. Starbuck was the pilot for that flight. Eventually, the HAT-1 reached its planned orbit... ...from where it launched the Hope probe towards the asteroid belt! From there, the Hope probe began its long, lonely journey into the far reaches of space! Then, after a terrifying struggle, the HAT-1 returned safely to Earth.\nAthena:\nThat struggle was when the incident known as the HAT-1 Miracle occurred, right?\nCosmos:\nCorrect. And it truly was a miracle. Of course, they just had to turn the ordeal into a movie. As for the Hope probe, it did eventually arrive safely at its destination! It obtained a few samples from the asteroid, and returned to Earth but a few days ago!\nPhoenix:\nSo what kind of samples are they? What's in them?\nCosmos:\n............The samples are scheduled for analysis in the near future. We haven't had time, since they just came back the day before Terran's murder. Regrettably, we've had no time to inspect the samples due to everything that has occurred. But this puts our space development program ahead of other countries by several years!\nPhoenix:\nThat's quite impressive. (I guess this guy isn't just a loud-mouthed braggart after all...)\nCosmos:\nIn the golden age of space development... ...our predecessors were successful in bringing a moon rock back. That is the greatest achievement in the history of this space center! The public fell in love with space and all of its glorious potential.\nPhoenix:\nA moon rock, huh? I remember that being big.\nCosmos:\nOur endeavours with the moon rock lives on in our work with those asteroid samples! I want to bestow new hopes and dreams for the future upon mankind once again! That is my mission, as the man who stands at the center of the cosmos!\nAthena:\nI hear there's lots of research into moon rocks and star dust from asteroids these days. They say the results could potentially have a huge impact on all of civilization! It's like we're in a new space race with every other country out there.\nCosmos:\nWhat?! Bite your tongue! It's not for anything so base as money or politics! It's all for the brilliant future that awaits mankind! And all for... my illustrious mission! With the recent budget cuts, my staff tells me finances are tight, but I won't hear it!\nPhoenix:\n(Hmm... I guess even a space program has to watch its budget...) By the way, you seem awfully knowledgeable about this kind of thing, Athena...\nAthena:\nHuh? Oh, w-well, you know... I thought I'd better brush up... for the case!\nPhoenix:\nIs that so...?\nPresent\nTerran's Autopsy Report or Utility Knife\nCosmos:\nWhat a shame. Truly. Clay was so young... He was an outstanding man who could have contributed greatly to the future of mankind.\nPhoenix:\nHe was an exceptional man, wasn't he.\nCosmos:\nIf he had gone into space, my reputation would have grown even loftier! Why did he have to die before he went into space?!\nPhoenix:\n(Someone needs to teach him he is not the literal center of the cosmos...)\nAnything else\nPhoenix:\nExcuse me, but about this piece of evidence...\nCosmos:\nLet me ask YOU a question. What will that object contribute to the future of mankind?!\nPhoenix:\nWhat? Uh, not much, I guess...\nCosmos:\nHmph. Then how important could it be? Quite unlike the great historical figure, Yuri Cosmos! Ha ha ha ha ha ha!\nPhoenix:\n(If he's any more self-absorbed, he'll turn into his very own black hole.)\nAfter clearing all Talk options:\nCosmos:\nWell, I will be on my way. As you can see, I am a very busy, and very important man! Galactic Scooter! Fire up the main engine! Max battle speed! And... engage!\nPhoenix:\n(That thing is surprisingly fast.) I guess we'd better get going, too.\nAthena:\nYou bet! Let's make it so!\nTalk\nWhat to do\nAthena:\nAthena Cykes is fine!\nPhoenix:\nHuh? What was that all about?\nAthena:\nI thought I'd better get fired up twice as much, to make up for Apollo being gone! For starters, I thought I'd imitate him.\nPhoenix:\nSo you were doing a voice workout, huh?\nAthena:\nYup! You have to push your voice up from the pit of your stomach! Hold it! There's a contradiction in the witness's statement!\nPhoenix:\nYou're really serious about this.\nAthena:\nObjection! You are lying! The true culprit is... the judge!\nPhoenix:\nWhat?! Then who's going to hand down the verdict?\nAthena:\nOh. I didn't think of that.\nAny ideas?\nPhoenix:\nSo what do you think we should do next?\nAthena:\nOh, that's right!\nPhoenix:\nWhat is it, Athena?\nAthena:\nI just remembered I forgot to go running today. I was so taken up with what happened to Apollo, it slipped my mind!\nPhoenix:\nUh, that wasn't what I was asking.\nPresent\nAttorney's Badge\nAthena:\nMy badge is starting to look pretty good on me, don't you think?\nPhoenix:\nIt suits you well.\nAthena:\nI'm starting to feel like it gives me more dignity and presence, too!\nPhoenix:\n(I think she might be expecting a little too much from one tiny little badge...)\nAnything else\nAthena:\nAll right. Let's see. I'm getting the sense... ...that you are perplexed by this piece of evidence!\nPhoenix:\nUh, well... I guess that's true.\nAthena:\nYou see? Even the simple act of presenting evidence reveals your underlying emotions.\nPhoenix:\nI guess I'd better be careful when I present evidence, then.\nDecember 19Cosmos Space Center - Boarding Lounge\nPhoenix:\nSo this is where Mr. Terran was murdered...\nAthena:\nYeah, this is the lounge. Let's see that diagram the police made again. Right now we're in the main building here on the right side, on the third floor. Clay and Mr. Starbuck fled here from Launch Pad 1 after the explosion.\nPoliceman:\nYou there! No admittance without express permission!\nAthena:\nWe're Mr. Starbuck's lawyers. We've come to investigate...\nPoliceman:\nSorry! Nobody gets in without permission. Not even the police superintendent! Can't have Detective Fulbright getting mad at me!\nPhoenix:\nSo Detective Fulbright is here, huh?\nPoliceman:\nYeah, he's in the Launch Pad 1 Corridor. Go get clearance from him, and then we'll talk!\nAthena:\nLeave it to me! I'm great at getting intel out of Detective Fulbright! Let's see. What trick should I use on him today?\nPhoenix:\n(I don't know if I should be grateful or afraid.)\nAthena:\nSo... to get to the Launch Pad 1 Corridor... ...we just have to go through that door with the blue rocket on it, I think.\nPhoenix:\nWait. That door... It looks awfully familiar...\nAthena:\nGood eye there, Boss. This is the door Clay and Mr. Starbuck used during their escape from the launch pad.\nPhoenix:\nAh, that explains it.\nAthena:\nThe fingerprint system has been deactivated, so I think we can just pass through. Now, come on! Let's go!\nDecember 19Cosmos Space Center - Launch Pad 1 Corridor\nPhoenix:\nSo this is it, huh? This is the corridor the two of them used in their escape.\nAthena:\nYup. This is the only thing connecting Launch Pad 1 with the main building.\nPhoenix:\nI see police tape down at the other end. Guess we won't be looking at the launch pad.\nAthena:\nAfter the explosion, this whole corridor must've been filled with smoke.\nPhoenix:\nAnd the launch pad itself was probably a sea of flames. Must've been pretty scary for them.\nAthena:\n...Now, where could Detective Fulbright be...? Hey, I think that's him over there!\nFulbright:\nHmm... What should I do? Which path is the path of justice...?\nAthena:\nHe seems to be lost... That's funny. This corridor is a straight shot.\nFulbright:\n...Huh? Ah, it's you lawyer people! Welcome to the Space Center! Enjoying a relaxing day off, are you? Here for a little rocket sightseeing?\nPhoenix:\nWe're here to investigate the scene, same as you. Do you have any info to share?\nAthena:\nBoss, if he acts at all reluctant to give us information... ...we hit him with the \"Whatever shall we do?\" act! I'm sure he'll fall for it! Got it?!\nPhoenix:\n(Are we trying to catch the unruly family dog here or something?)\nFulbright:\nInfo on the case, huh? .........All right! I'll gladly share some with you!\nAthena:\nHuh? What just happened?\nFulbright:\nDetectives and lawyers, seeking truth and justice side by side! I like it! Just take whatever you want from me, you info bandits! I'm in a generous mood today!\nAthena:\nI dunno... There's something weird about Detective Fulbright today...\nPhoenix:\nWell, we need information, so let's run with it.\nAthena:\nIf you say so...\nTalk\nThe crime scene\nPhoenix:\nDetective Fulbright, could you give us permission to investigate the crime scene?\nAthena:\nThere's an office on guard, and we can't get in. Oh, whatever shall we do?\nFulbright:\nThat's an easy one! I'll let them know over there to let you in! Investigate to your heart's content! Take a week if you need it! A month, even! Shall I have some snacks delivered? One of my men gives a mean neck rub!\nPhoenix:\nUh, no... that's okay. But thanks. (Definitely NOT the Fulbright I know...)\nAthena:\nDetective Fulbright is acting sickeningly sweet. It's kinda gross, actually. Do you think he hit his head or something?\nPhoenix:\nWho knows. Whatever the case, it's making our lives way easier.\nWhat happened, exactly? (appears after \"The crime scene\")\nPhoenix:\nYou were here at the Space Center at the time of the incidents, weren't you, Detective?\nFulbright:\nThat's right! I was here on a security assignment!\nAthena:\nThe police are required to secure rocket launches now? I didn't know that.\nFulbright:\nU-Um, yes. Well, you know us! To serve and protect! Ha ha ha ha! The explosions occurred while I was here on duty, so I started leading the evacuation!\nPhoenix:\n(He's leaving out a lot of details, but okay...) Could you tell us more about what happened?\nFulbright:\nOf course! A bomb went off on the second floor of the main building. Right after that, the one over in Launch Pad 1 also blew sky high. So I immediately instructed the visitors and the employees to evacuate to the shelter!\nPhoenix:\nThe shelter...?\nFulbright:\nThat's right! There's an evacuation shelter in the basement of the Space Center. It's there for accidents and emergencies and the like!\nAthena:\nSo where were you when the first bomb went off?\nFulbright:\nI was on duty on the fourth floor. It was quite the madhouse, I tell you! The elevator wasn't working, on account of the explosion... ...and the stairs on the second floor were destroyed, so we couldn't go that way.\nAthena:\nThen wasn't it impossible to get down to the basement shelter?\nFulbright:\nNo. We lowered an emergency ladder from a fourth floor window and escaped that way. It was a folding ladder, so it wasn't very stable, but at least it reached the ground! After I secured the ladder, I left to take another look around for any other survivors. Once everyone else got out safely, I made my way down, too, and headed to the shelter.\nAthena:\nWow, what an ordeal...! But climbing down an emergency ladder kinda sounds fun!\nPhoenix:\nThank you for your answers. Detective. They were very helpful.\nFulbright:\nJust a moment! I have some more information to share with you! But don't tell Prosecutor Blackquill, okay?\nAthena:\nWow, and Prosecutor Blackquill usually has you on a short leash, too...\nFulbright:\nWell, never mind that! Ha ha! I thought you should know that there was a witness.\nThe witness (appears after \"What happened, exactly?\")\nLeads to:\n\"Could you tell us more about this witness?\"\nPresent\nTerran's Autopsy Report or Utility Knife\nFulbright:\nThe victim went to all that trouble to save the defendant... ...and then he was mercilessly killed! Is there no justice in this world?!\nPhoenix:\nJustice was trampled underfoot that day.\nFulbright:\nThat's right. Acts of justice and selflessness are not always rewarded... It pains me to say it, but I've come to realize the truth in that recently.\nPhoenix:\n(Sounds like he and his personal philosophy are going through a mid-life crisis.)\nEvacuation Report\nFulbright:\nWhen the explosions occurred, everyone was on the verge of panic. But the important thing is that no one from the general public was hurt. And it was all thanks to the evacuation effort we headed up!\nPhoenix:\nAfter that, you escaped the building yourself as well, right?\nFulbright?\nMe? Escape?! Nonsense! I wanted to run straight towards the blasts! It was the other detectives who stopped me. \"We gotta get you to somewhere safe, sir!\" they said.\nPhoenix:\nI know you wanted to help, but it sounds like you were adding work to your fellow officers.\nAnything else\nFulbright:\nSomething for the lost and found? I'll be sure to take care of it!\nPhoenix:\nNo, no, no! This is an important piece of evidence!\nPhoenix:\nCould you tell us more about this witness?\nFulbright:\nSure thing! The witness was a Space Center employee who was on the fourth floor. While she was climbing down, she looked through a window into the third floor lounge.\nAthena:\nSo... she was looking into the crime scene from the outside?\nFulbright:\nThat's right! It was just a matter of chance that she saw something important. Not that I know what she saw exactly yet, though.\nAthena:\nYou don't? But that's the most important thing of all...\nFulbright:\nHa ha ha! Don't you worry! I'll get around to interviewing her soon enough! She should still be somewhere here in the Space Center. You might even run into her!\nPhoenix:\nA fourth-floor employee, huh? All right. Thanks for the info, Detective Fulbright!\nAthena:\nGee, you sure are being cooperative, Detective. A little TOO cooperative, even...\nFulbright:\nYes, well... Actually... I...\nPhoenix:\nSomething you can't talk about...?\nFulbright:\nYes, something like that. Anyway, never mind! Don't worry about me! W-Well, I'll be on my way, now!\nPhoenix:\nWhat was that all about?\nAthena:\nSomething is definitely going on. I'm going to get it out of him the next time I see him.\nPhoenix:\nO-Okay... (I'm not so sure he'll talk about it, though.) Well, we have permission to investigate now. Let's head back to the boarding lounge.\nDecember 19Cosmos Space Center - Boarding Lounge\nPoliceman:\nAh, you two! Detective Fulbright has granted you permission to investigate! He also said I should bring you some snacks or give you a neck rub, too, if you'd like...\nAthena:\nOh, uh, that's all right. But thank you for the offer.\nPhoenix:\nWell, time to roll up our sleeves and start investigating. Now, let's see... Where's that diagram again? So, this lounge is on the third floor of the main building. And according to Apollo, this is where he believes a third party killed his friend.\nAthena:\nWell, let's stop the recap and start looking for traces of this third person then!\nPhoenix:\nYou read my mind, Athena. We'll make that our first priority. There's just one problem, though. This room... It's just so big...\nAthena:\nDon't worry, we can use this to help us!\nPhoenix:\nA Space Center pamphlet? For tourists?\nAthena:\nYup! Picked it up at the entrance. The maps inside should come in handy! Let's see... Yup. Here it is. A map of the lounge. This is the door we went through to talk to Detective Fulbright.\nPhoenix:\nOh yeah. That's the door with the fingerprint recognition lock. Well, I guess this map will make things a little easier.\nSpace Center Pamphlet added to the Court Record.\nAthena:\nYeah! No more excuses! Let's track down the third person!\nPhoenix:\n...Wait. There's just one more thing. What's that strange creature moving around outside the window?\nAthena:\nOh, Boss... It's just a holographic image.\nPhoenix:\nOh, yeah. I knew that. (Whew, that's a relief.)\nAthena:\nThere should be a button somewhere in this room to turn the image on and off. That's what it says in the pamphlet, anyway.\nPhoenix:\nThe only reason you're so eager to start is so that you can push that button, isn't it?\nAthena:\nAnd what's wrong with that? Let's just look for the button while we're looking for clues.\nPhoenix:\nAll right. Fine. Let's get investigating!\nExamine\nWindow\nAthena:\nA window. And it's right next to the holographic image, too. I bet it's here to help people see the stark contrast between reality and virtual reality.\nPhoenix:\nWay off. It says, \"Emergency Ventilation.\" You know, to clear smoke from a fire.\nAthena:\nSee? It's pointing out the virtual insanity of reality!\nControl room door or elevator door\nPhoenix:\nSo it looks like there are three doors that lead in and out of this room.\nAthena:\nWell, let's check... Drum roll, please! Ta-da! The Space Center pamphlet! We're here, at this place that says \"Boarding Lounge 1.\" Here are the three doors. Hmm, let's call them \"Lefty,\" \"Righty,\" and \"Downy.\"\nPhoenix:\nPeople usually say \"west,\" \"east,\" and \"south\" in a case like this, you know.\nAthena:\nDetails, details. Anyway, take a look at the west door. That door with the rocket icon leads to Launch Pad 1! I know because it says here on the map \"Launch Pad 1 Corridor.\"\nPhoenix:\nSo that's where we were with the detective. It was filled with smoke after the explosion.\nAthena:\nRight. Next up! The right-hand side of the map, or \"east,\" in your world. That's the door with the satellite dish icon to signify communication, aka, the Control Room!\nPhoenix:\nYup, it definitely says \"Control Room.\" Looks like it has another door on the opposite side.\nAthena:\nThey communicate and exchange information with rockets and probes in space from there. So, it's the \"center\" of the Space Center... The \"Space Center Center,\" if you will.\nPhoenix:\n(Does everybody start to talk like Director Cosmos after they've been here a while?)\nAthena:\nBut, it seems that they built a new Command Center on the sixth floor. That's what they used for the HAT-2 mission, so this Control Room was empty at the time.\nPhoenix:\nI've always wanted to see the inside of a mission control room, and since we're here...\nAthena:\nI'd love to do that too, but it doesn't look like we'll be able to. They want to keep curious kids like you out... ...so the door is protected with fingerprint recognition. Only the director can go through.\nPhoenix:\n(With that much security, I'm definitely not the one they're looking to keep out, Athena.)\nAthena:\nSo apparently, the lock is also hooked up to a backup generator in case of emergencies.\nControl Room Door Lock added to the Court Record.\nPhoenix:\nOkay. What about that last door?\nAthena:\nThis lower door... Oh, excuse me. I mean, \"south door\"? It leads to the elevators!\nPhoenix:\nThis is the door we came through when we entered this room, right?\nAthena:\nYup. And, of course, there was no fingerprint recognition device, so it's open to anyone.\nPhoenix:\nBut the elevators weren't working at the time due to the explosion...\nAthena:\nWell, that's about it for the Three Muskedoors of the boarding lounge!\nPhoenix:\nThanks. Understanding the layout of the lounge should help us understand the case. That's why I thought we'd better have a good grasp of where all the doors go.\nControl room door or elevator door (subsequent times)\nPhoenix:\nSo it looks like there are three doors that lead in and out of this room.\nAthena:\nWell, let's check... Drum roll, please! Ta-da! The Space Center pamphlet! We're here, at this place that says \"Boarding Lounge 1.\" Here are the three doors. Hmm, let's call them \"Lefty,\" \"Righty,\" and \"Downy.\"\nPhoenix:\nPeople usually say \"west,\" \"east,\" and \"south\" in a case like this, you know.\nAthena:\nDetails, details. Anyway, take a look at the west door. That door with the rocket icon leads to Launch Pad 1! I know because it says here on the map \"Launch Pad 1 Corridor.\"\nPhoenix:\nSo that's where we were with the detective. It was filled with smoke after the explosion.\nAthena:\nRight. Next up! The right-hand side of the map, or \"east,\" in your world. That's the door with the satellite dish icon to signify communication, aka, the Control Room!\nPhoenix:\nYup, it definitely says \"Control Room.\" Looks like it has another door on the opposite side.\nAthena:\nThey communicate and exchange information with rockets and probes in space from there. So, it's the \"center\" of the Space Center... The \"Space Center Center,\" if you will.\nPhoenix:\n(Does everybody start to talk like Director Cosmos after they've been here a while?)\nAthena:\nBut, it seems that they built a new Command Center on the sixth floor. That's what they used for the HAT-2 mission, so this Control Room was empty at the time.\nPhoenix:\nI've always wanted to see the inside of a mission control room, and since we're here...\nAthena:\nI'd love to do that too, but it doesn't look like we'll be able to. They want to keep curious kids like you out... ...so the door is protected with fingerprint recognition. Only the director can go through.\nPhoenix:\n(With that much security, I'm definitely not the one they're looking to keep out, Athena.)\nAthena:\nSo apparently, the lock is also hooked up to a backup generator in case of emergencies.\nPhoenix:\nOkay. What about that last door?\nAthena:\nThis lower door... Oh, excuse me. I mean, \"south door\"? It leads to the elevators!\nPhoenix:\nThis is the door we came through when we entered this room, right?\nAthena:\nYup. And, of course, there was no fingerprint recognition device, so it's open to anyone.\nPhoenix:\nBut the elevators weren't working at the time due to the explosion...\nAthena:\nWell, that's about it for the Three Muskedoors of the boarding lounge!\nPhoenix:\nThanks. Understanding the layout of the lounge should help us understand the case. That's why I thought we'd better have a good grasp of where all the doors go.\nOutline on floor\nPhoenix:\nSo this is where they discovered Clay.\nAthena:\nYeah. He was already dead when they found him. Let's take a look at the photo.\nPhoenix:\nSo he was stretched out like this and... Huh? What's that thing that looks like a thermos?\nAthena:\nThat's the thing that Prosecutor Blackquill mentioned when I was in court with Apollo. He said that it contains asteroid samples.\nPhoenix:\nOh, right. Director Cosmos mentioned something about that too, didn't he? That they were brought back only five days ago by the probe that the HAT-1 launched.\nAthena:\nI wonder what they look like... Do you think they'll let us see?!\nPhoenix:\nLet's think about that after we've solved the case, okay?\nRight of holographic screen\nPhoenix:\nAt first glance, it looks like a peaceful landscape, but then there's that creature...\nAthena:\nDidn't the Hope probe go to some planet? Maybe this is what its surface looked like.\nPhoenix:\nI dunno. I think it would've made the news if they discovered a creature like that.\nAthena:\nIt did make quite a bit of news, though, when the probe came back.\nPhoenix:\nYeah... But the Hope probe didn't even go to a planet. It went to an asteroid. That's a big rock kind of thing. Even aliens can't live there.\nLeft of holographic screen\nPhoenix:\nA bright, purple sky, plenty of greenery, and a tranquil lake. The idyllic scene stretches on as far as the eye can see. It's beautiful, but it lacks something to make it truly captivating.\nTables or chairs\nPhoenix:\nThat's some pretty futuristic-looking furniture over there.\nAthena:\nAccording to the pamphlet, those are no ordinary chairs. They're like amusement park tea cup rides. You can power them yourself, it says. If you spin the table, your chair spins, too.\nPhoenix:\nWhy would anybody want to have something like that here?\nAthena:\nIt's for astronauts who have trouble with the device on the ceiling. No vertical spins... It says it's a training device that's easy on the eyes and on the body.\nPhoenix:\n(Can a person really call themselves an astronaut if they can't handle zero-g?)\nCamera\nPhoenix:\nThis must be the security camera that recorded the astronauts making their escape.\nAthena:\nOh, let's commemorate this occasion with a... Love and Peace!\nPhoenix:\nIf you're done now, shall we move on?\nAthena:\nYeah, okay... But just one more for the road! Peeeaaace!\nPhoenix:\n(Very mature.)\nCapsules\nPhoenix:\nThese are apparently \"oxygen capsules.\" They're for recovery after a training session.\nAthena:\nI wonder if they can change your voice? Testing, testing, one, two, three... Huh? It didn't do a thing.\nPhoenix:\nUh, it's not helium, Athena. It's oxygen.\nMirror\nAthena:\nOh, a mirror! How thoughtful of them to put one here.\nPhoenix:\nThoughtful?\nAthena:\nSo the ladies can fix their makeup! One's appearance is just as important in space as it is on Earth, you know! You never know when you're going to run into some other life form, after all!\nPhoenix:\nI doubt anybody who thinks like that would ever become an astronaut in the first place.\nButtons on table\nPhoenix:\nThere's some kind of panel with two buttons on it here.\nAthena:\n\"Just push it!\" That's the invariable principle of buttons!\nPhoenix:\n(There are such things as buttons left unpushed...)\nAthena:\nHey! The giant holographic image disappeared!\nPhoenix:\nYeah, though that side of the wall seems kind of barren without it now. Still, let's see if we can't find anything new with the image off.\nButtons on table (subsequent times)\nPhoenix:\nIt's the button for the holographic image. If we push it... ...it apparently turns the image on and off.\nHolographic screen (after examining buttons on table)\nPhoenix:\nWith the holographic image off, the screen is completely black, which for some reason... ...makes me think of losing an argument to Prosecutor Blackquill in court. (But at least it's got my brain revved up. I come up with my best ideas at times like these.)\nBullet hole on screen (after examining buttons on table)\nAthena:\nHey, Mr. Wright! Take a look at this!\nPhoenix:\nIt looks like a bullet hole. Great find, Athena.\nAthena:\nIt's pretty big. Whoever fired this shot must have been using a pretty large gun.\nPhoenix:\nYou think so? Based on my experience, I'd say this was fired from a regular pistol.\nAthena:\nWell, whatever size it was, somebody fired a gun in here, right?\nPhoenix:\nApparently. This is an important fact. Do you see a bullet around somewhere? (Changed from [Apparently. This is an important fact. Do you see a bullet anywhere?] in the original release)\nAthena:\nNo. The police might've taken it, though.\nBullet Hole added to the Court Record.\nAthena:\nLet's ask Detective Fulbright about this bullet hole later!\nBullet hole on screen (subsequent times)\nAthena:\nHey, Mr. Wright! Take a look at this!\nPhoenix:\nIt looks like a bullet hole. Great find, Athena.\nAthena:\nIt's pretty big. Whoever fired this shot must have been using a pretty large gun.\nPhoenix:\nYou think so? Based on my experience, I'd say this was fired from a regular pistol.\nAthena:\nWell, whatever size it was, somebody fired a gun in here, right?\nPhoenix:\nApparently. This is an important fact. Do you see a bullet around somewhere? (Changed from [Apparently. This is an important fact. Do you see a bullet anywhere?] in the original release)\nAthena:\nNo. The police might've taken it, though. Let's ask Detective Fulbright about this bullet hole later!\nLaunch Pad 1 doorway\nLaunch Pad 1 door\nAthena:\nLet's see. This door is... Where's that pamphlet...? Here we are. It's the door to the corridor that leads to Launch Pad 1. We went through it earlier when we went to talk to Detective Fulbright.\nPhoenix:\nSo, I guess the security lock must be disengaged now, right? They say the corridor was filled with smoke at the time of the bombing. This thing beside the door... This must be the fingerprint recognition device.\nAthena:\nWhich reminds me! I think Prosecutor Blackquill talked about it at the trial.\nBlackquill:\nThe notion of a third party in Launch Pad 1 is utterly absurd. Just to enter the area from the lounge... ...one must pass through a door guarded by a fingerprint recognition device. And allow me to state up front that there are precious few with the clearance to do so.\nPhoenix:\nThen, does this mean that the bomber's prints were verified by the system? (But the number of authorized personnel was supposed to be really small...)\nAthena:\nVoil! Fingerprint powder! I brought it just in case something like this came up. I found it at the office. I've been just itching for a chance to use it!\nPhoenix:\nWow. Way to think ahead! Now, let's dust the fingerprint recognition device and see what we can find.\nAthena:\nYou got it! Now to sprinkle some here, and a little over there, aaaaand... fwwwwph! Let's see what we have here......... Oh! We got something! ...Aww, it's only a single set of prints.\nPhoenix:\n(Uh, isn't that a good thing?) Sure wish we could figure out whose prints these are. Although, I doubt we'll be so lucky as to get the culprit's prints on the first try.\nAthena:\nWell, I'm willing to bet that Detective Fulbright has some fingerprint data.\nPhoenix:\nRight. And there's the security footage of this door, too.\nAthena:\nYes, here it is. It came up in court the other day.\nPhoenix:\nI wish we could see the part of the footage just after this bit.\nAthena:\nOh, because that would be right before the murder, wouldn't it? Let's ask the detective. With the mood he's in, he'll probably show it to us right away!\nPhoenix:\n(Yeah, he's in almost TOO good of a mood today...) Let's go see if we can find him again once we're done with this room.\nFingerprint recognition device\nPhoenix:\nSo this is the fingerprint recognition device. I guess you put your hand on this hand mark.\nAthena:\nWhy guess when you can try! Now, to line my hand up with the outline...!\nPhoenix:\nDon't, Athena! This thing is related to the case! Get your prints all over that, and the next thing you know, you'll be named a suspect.\nAthena:\nWaaah! How can you be so cruel to a little girl like me?! *sniffle* *sob*\nPhoenix:\n(I'm not buying those tears, missy.)\nKnob\nAthena:\nI wonder what this big knob is for. It looks like the knob on a stove.\nPhoenix:\nWell it's the same shape, but I think that's where the similarities end. I mean, it's behind a glass pane. What kind of stove would require knob security like this?\nAthena:\nWell, the knob is straight up and down. So if it was for a stove, the burner would be off.\nPhoenix:\nRight, if it was for a stove... Still, I wonder what it's really for.\nAthena:\nSomething turned on by a knob that's NOT a stove?! Hmm... How about a rocket engine?\nPhoenix:\nIf you had to start the engine here, the rocket would take off before you could get in.\nAthena:\nThen I guess all we can say for now is that it's a mystery knob!\nMoonwalk training area\nMoon surface replica or moonwalk apparatus\nPhoenix:\nHere's another amazing piece of equipment. \"Walk on the surface of the moon,\" it says.\nAthena:\nOh, boy! I wanna try it! Gravity is weak on the moon, so I bet I could do midair somersaults!\nPhoenix:\nWe're still on Earth, remember? Besides, it's connected to the ceiling.\nAthena:\nWell, at least I could jump really high!\nPhoenix:\nThere's a sign on the wall that very clearly says, \"Don't jump too high!\"\nAthena:\nThen what good is this thing?!\nPhoenix:\nUh, didn't I say in the beginning, \"Walk on the surface of the moon\"?\nTrash chute\nPhoenix:\nWhat's this? A trapdoor?\nAthena:\nIt's a trash chute. The cleaning robots throw the garbage out from here. (Changed from [It's a trash chute. The cleaning robots throws [sic] the garbage out from here.] in the original release)\nPhoenix:\nThe robots do the cleaning? What a futuristic world we live in. I just hope they don't revolt like they do in science fiction movies.\nAthena:\nNo way. All the robots here are very nice. Actually, wasn't there one in the Launch Pad 1 corridor? We can go say \"hi\" to it if you want.\nGrate\nGlinting object inside grate\nAthena:\nHey! I see something shiny down there!\nPhoenix:\nLet's take this cover off, then.\nAthena:\nWhat's this? It looks like a metal jelly bean.\nPhoenix:\nIt's really small, but it's a bullet. It's only about two to three millimeters in diameter. Let's see, that would make the caliber... .10?\nAthena:\n\"Caliber\" refers to the diameter of a gun's barrel, right?\nPhoenix:\nYes. But I've never heard of a .10 caliber gun before. This bullet must be for a special kind of gun.\nAthena:\nI bet if you tried firing a bullet this small with a regular-sized gun... ...it would just fall right out.\nPhoenix:\nYeah, it must've been a really small gun.\nAthena:\nI wonder how the bullet ended up here? I mean, we're in the bottom left, on the South door side of the room, according to this map. That's pretty far from where Clay's body was. Maybe the police didn't think to look here.\nPhoenix:\nYeah, leave it to Detective Fulbright to accidentally hand us just the card we need.\nBullet added to the Court Record.\nGrate (after examining glinting object inside grate)\nAthena:\nI still can't believe we spotted that bullet here. And it's so tiny, too!\nPhoenix:\nI guess I have pretty sharp eyes.\nAthena:\nWhat are you talking about?! I'm the one who found it! Not you!\nPhoenix:\nOh, right. Yeah, of course. (Is that how it happened...?)\nGyroscope chair on ceiling\nPhoenix:\nNo matter how I look at it, all I can think of is \"torture device.\" But I guess it's a training device for getting used to zero-gravity? (Uh-oh. Athena has an odd glint in her eye... Is she thinking about trying that thing out? I should try to stop her... but I'm afraid she'll just out-muscle me!)\nAthena:\nHey, Mr. Wright! Look at that up there!\nPhoenix:\nSome kind of fragment? It's stuck in tight... (Oh, so that's what the glint was all about!)\nAthena:\nThat color looks familiar... I think it's part of an oxygen tank!\nPhoenix:\nI think you're right. But if that's here... ...it means Clay's tank ruptured AFTER they arrived at the boarding lounge.\nAthena:\nSo Prosecutor Blackquill's theory that Mr. Starbuck dropped Clay down the ladder... ...must be wrong! This proves that both of the astronauts were alive when they reached they boarding lounge!\nPhoenix:\nSo, Apollo was right. The scene of the murder wasn't the launch pad.\nAthena:\nHee hee! Way to go, Apollo!\nPresent\nSpace Center Pamphlet\nPhoenix:\nDo you happen to know anything about this?\nAthena:\nHuh? That?\nPhoenix:\nAny new ideas, maybe?\nAthena:\nO-Oh, I dunno! Ha ha ha ha ha! H-Hey, did you catch the game on TV last weekend?!\nPhoenix:\n(Huh? Why is she avoiding the topic?)\nAfter examining Control Room door or elevator door, outline on floor, bullet hole on screen, Launch Pad 1 door, knob, trash chute, glinting object inside grate, and gyroscope chair on ceiling:\n???:\nWelcome to the Space Center, guests! Welcome!\nPhoenix:\nYikes! Wh-What in the world?!\n???:\nMy name is Ponco! P-O-N-C-O! Ponco!\nPonco:\nAre you sightseeing? Are you lost? Are you looking around? Choose one! I will guide you!\nPhoenix:\nI-It's... a robot?\nPonco:\nI am not a robot! I am Ponco! Psychological Observation and... ...Navigation COmpanion! P-O-N-C-O! Ponco!\nPhoenix:\n(Well, I'm glad we got that cleared up.)\nAthena:\nOh, Ponco! I've missed you!\nPhoenix:\nHuh? Do you know this thing, Athena?\nAthena:\nOh, uh... She, uh... showed us around the last time, when I came here with Apollo. Oh, you're such a good girl, Ponco! That's a good girl!\nPonco:\nOh, thank you! Thank you! I'm so happy! So very happy!\nPhoenix:\nWow, a guide robot. That's pretty cool. My name is Phoenix Wright. Nice to meet you.\nPonco:\nI don't know you! I don't know you!\nPhoenix:\nHuh? (Ouch. That hurt.)\nAthena:\nOh, she has to register people she meets for the first time. Please register him, Ponco.\nPonco:\nCertainly! Commencing guest registration! Please tell me your name. A nickname is fine, too!\nAthena:\nHis name is \"Phoenix.\"\nPhoenix:\n(A bit overly familiar, but I'll allow it.)\nPonco:\nPhoenix, please let me get a good look at your face!\nPhoenix:\nOh, uh, sure.\nPonco:\nRegistering... Facial registration sequence, complete! We are now officially friends! Nice to meet you, Phoenix!\nPhoenix:\n(Huh... This robot is pretty cute...)\nAthena:\nYou made a friend, Boss! Isn't it great?\nPonco:\nPhoenix! Athena! Allow me to guide you! Right this way!\nAthena:\nOh, goody! Let's go, Boss!\nPhoenix:\n(G-Go where?)\nDecember 19Cosmos Space Center - Space Museum\nPhoenix:\nOh, wow! What IS this place?! Is... Is that rocket real?!\nPonco:\nWelcome! Welcome! The Space Museum is open to the public every day of the year from 9 AM to 7 PM! Learn about the history of our nation's space development and the HAT-1 project! The rocket is just a replica, but it's the same size as the real one!\nAthena:\nThe Space Museum... Oh, here it is on the map.\nPhoenix:\nOkay, so it's on the exact opposite side of the main building from Launch Pad 1.\nSpace Center Pamphlet updated in the Court Record.\nPonco:\nAsk me anything! Anything! I will explain!\nTalk\nThe HAT-1\nPhoenix:\nThis is quite the place. I can't believe we get to see a rocket this close up.\nPonco:\nThis is a replica of the HAT-1 that was launched seven years ago! It's exactly like that real HAT-1, inside and out! Its little brother, the HAT-2, was supposed to launch the other day!\nPhoenix:\n(...I wonder if Ponco knows why the launch was canceled.)\nPonco:\nOver there is an exhibit about the launch seven years ago! Check it out! Check it out!\nPhoenix:\n(Space suits, photos, newspaper articles... I'd like to come here again on a day off. ...Hey, what's this a photo of?)\nPonco:\nPhoenix! That's the staff of the HAT-1 project!\nPhoenix:\nOh, there's Mr. Starbuck! He looks so young, and so different.\nAthena:\nAh! And that's... That's...\nPhoenix:\nWhat is it, Athena? Is something wrong?\nAthena:\nOh! N-Nothing... I... just thought Mr. Starbuck looked really young, too, that's all.\nPhoenix:\nWell, it was seven years ago, after all. So the young guy standing next to Mr. Starbuck...\nAthena:\n...Is Clay Terran... The victim.\nPhoenix:\nSo they were mentor and protg even way back then... And he's even got one of the staff jackets. He looks just like a regular staff member.\nPonco:\nNo! Clay was still a student then! He just borrowed one of Solomon's old jackets.\nPhoenix:\nAh, okay. That makes sense. Clay would've still been in high school seven years ago. (Everybody looks so happy.) This Space Museum is great! What fantastic exhibits!\nPonco:\nThis area used to be Launch Pad 2. That's why the only entrance is on the third floor.\nPhoenix:\nWouldn't it be better if they just made a new ground-floor entrance instead?\nPonco:\nThere was talk of it, but they had to scrap their plans because of the budget cuts. Budget cuts! Budget cuts! We need more money! Money!\nPhoenix:\n(Who would record that kind of information into a guide robot?)\nPonco:\nWhile it was in space, the HAT-1 launched a probe called \"Hope.\" The Hope probe collected some samples from an asteroid and returned five days ago!\nPhoenix:\n(That's what Director Cosmos said, too. He told us it came back the day before Clay was killed.)\nPonco:\nAnd here it is. The Hope space probe!\nPhoenix:\n(Hmm... I think I've seen that logo somewhere before. Let's see... Oh yeah, the capsule that the victim was carrying... I think it had the same logo... I think it can be seen in the photo attached to the autopsy report. Maybe she'll give me some more info if I show it to her.)\nLaunch pad layout\nPonco:\nThe way the Space Center launch pad is set up is really cool! Would you like me to tell you about it? Would you?\nPhoenix:\nThe setup of the launch pad? (Go gentle on my spiky-haired mind...)\nAthena:\nI want to know! I want to know! Phoenix wants to know, too!\nPhoenix:\n(Great. Now Athena's got a case of Ponco-itis.)\nPonco:\nHooray! I will tell you, then! The rocket is built right inside the launch pad structure. When the rocket is complete, it's moved along with the launch pad over the rails... ...and brought into position at the launch site! Isn't it cool? Isn't it? We used to have a big budget, so that's how we could build it all!\nPhoenix:\nIt's very cool. A grand setup that suits an important place like the Space Center. (I guess everyone is hoping for a bigger budget next year... Myself included.)\nAthena:\nI'm guessing the whole thing is operated from the Control Room, huh.\nPonco:\nThat it is! But it can also be operated from the new Command Center, too! Either way, the safety lock in the boarding lounge has to first be disengaged!\nPhoenix:\nI guess before a big move like that can be carried out, there are all kinds of procedures.\nAthena:\nI would love to see the launch pad being moved! When's the next one scheduled for?\nPonco:\nSearching data............ All future plans have been put on hold.\nPhoenix:\n(Because of the bombing and the murder, I'll bet... which is perfectly understandable.)\nAthena:\nWell, when was the last time it was moved?\nPonco:\nSearching data........................ I'm sorry. I'm sorry. That answer isn't in my answer database.\nPhoenix:\n(I guess Ponco can only answer certain questions.)\nPresent\nTerran's Autopsy Report (after clearing \"The HAT-1\" Talk option)\nPhoenix:\nPonco, do you recognize this capsule here in the top right?\nPonco:\nChecking registered data.........! I know! I know! It's the Hope capsule! It was carried inside the Hope probe.\nPhoenix:\nIt contained the asteroid samples, right?\nPonco:\nYes! It was designed to store the samples gathered by the Hope probe. It's been stored in the safe in Launch Pad 1 ever since it returned to Earth. It must not be removed! It must not be removed!\nAthena:\nDon't worry, Ponco. The people in charge already know what happened.\nPonco:\nThey do? They do? I must ask them later.\nPhoenix:\nSo the capsule was being kept in Launch Pad 1, huh? Maybe Clay was trying to carry it to safety after the explosion...\nAthena:\nThe Space Center staff must've been really excited to finally get the capsule back. But it's a pity this incident occurred before they got a chance to check the contents.\nPhoenix:\nWell, the police took it as evidence, so they'll have to wait a little longer.\n\"Hope\" Capsule added to the Court Record.\nTerran's Autopsy Report (after clearing \"The HAT-1\" Talk option; subsequent times)\nPhoenix:\nPonco, do you recognize this capsule here in the top right?\nPonco:\nChecking registered data.........! I know! I know! It's the Hope capsule! It was carried inside the Hope probe.\nPhoenix:\nIt contained the asteroid samples, right?\nPonco:\nYes! It was designed to store the samples gathered by the Hope probe. It's been stored in the safe in Launch Pad 1 ever since it returned to Earth. It must not be removed! It must not be removed!\nAthena:\nDon't worry, Ponco. The people in charge already know what happened.\nPonco:\nThey do? They do? I must ask them later.\nPhoenix:\nSo the capsule was being kept in Launch Pad 1, huh? Maybe Clay was trying to carry it to safety after the explosion...\nAthena:\nThe Space Center staff must've been really excited to finally get the capsule back. But it's a pity this incident occurred before they got a chance to check the contents.\nPhoenix:\nWell, the police took it as evidence, so they'll have to wait a little longer.\n\"Hope\" Capsule\nPonco:\nThe capsule from the space probe \"Hope\"! The probe separated from the HAT-1 in space and went to an asteroid! It took seven years, but it found its way back to Earth a few days ago! Welcome home!\nAthena:\nI can't believe you still don't remember -- you say, \"It's back!\" not \"Welcome home!\"\nPonco:\nIt's back! It's back!\nPhoenix:\nWait, why do you know what she was taught?\nAthena:\nHuh? Oh, uh... when I came here with Apollo... I heard a member of the staff teach her...!\nPhoenix:\n(Hmm... I can't help but think I'm missing something here...)\nSpace Center Diagram or Space Center Pamphlet\nPonco:\nThis facility is Yuri Cosmos's greatest achievement!\nPhoenix:\nOh? I didn't realize it was the personal achievement of just one man.\nPonco:\nDirector Cosmos taught me to say it like that. It's actually a facility for space development, but don't tell anyone I said that!\nAthena:\nHow could Director Cosmos teach such a pure and innocent little robot to lie for him?\nAnything else\nPonco:\nI'm sorry. I'm afraid I don't know anything about that.\nPhoenix:\nOh, okay. No problem.\nPonco:\nI'm so sorry! I'm so sorry! I wasn't helpful! I'll try to do better in the future! Please don't hate me!\nPhoenix:\n(The poor thing. Now I feel bad for asking...)\nAfter clearing all Talk options and correctly presenting Terran's Autopsy Report:\nPhoenix:\nWell, we certainly learned a lot about the Space Museum.\nAthena:\nThank you, Ponco. You explained everything very well.\nPonco:\nI love to explain! Thank you for listening! Thank you!\nPhoenix:\nYou two are like old friends. It's hard to believe you just met recently.\nAthena:\nHee hee! It's because Ponco is so friendly!\nPhoenix:\nWell, what should we investigate next?\nAthena:\nLet's go find Detective Fulbright! We have things to ask him about.\nPhoenix:\n(Let's see. The security footage and the fingerprint data, was it?) Okay, then let's go back to the Launch Pad 1 corridor.\nAthena:\nBye, Ponco! See you later!\nPonco:\nCome again! Come again! And don't forget to visit the gift shop!\nPhoenix:\n(Poor Ponco... What a Dickensian life we are all forced to lead.)\nWright Anything Agency\nPresent\nSpace Center Pamphlet\nTrucy:\nSpace, huh... I'd sure love to go up there someday. Will you take me, Daddy?\nPhoenix:\nHa ha ha. It's not like taking somebody to an amusement park, you know.\nTrucy:\nWell, you hardly ever take me to one of those, either! You either say, \"I don't have any money\" or \"I don't have time\"!\nPhoenix:\nF-Fine. I'll take you on my next day off.\nTrucy:\nYou're the best, Daddy!\nPhoenix:\nHa ha ha. (I'm no match for Trucy...)\nDecember 19Cosmos Space Center - Launch Pad 1 Corridor\nFulbright:\nHmm... What should I do? Which path is the path of justice...?\nAthena:\nThere's Detective Fulbright! He still seems to be lost, even though it's a straight corridor.\nPhoenix:\nLet's hope he's still in a cooperative mood as well, then.\nAthena:\nIf he doesn't cooperate, then I'll just have to use my powers on him.\nPhoenix:\n(...You mean that \"lady in distress\" bit?)\nTalk\nBullet hole at the scene\nPhoenix:\nWe found a bullet hole in the wall at the crime scene.\nFulbright:\nYou did?! Our team found that, too! It was Detective Arme who fired that bullet!\nPhoenix:\nDetective Arme?\nFulbright:\nThat's right! A warning shot for the defendant!\nPhoenix:\nWas it really such a high-threat situation that she needed to do that?\nFulbright:\nI'm afraid I don't know the details, what with Detective Arme gone and all...\nAthena:\nBut I thought there were two people who discovered the crime scene together?!\nPhoenix:\nWe already know Director Cosmos will testify, so tomorrow will be about what he knows...\nFulbright:\nHey, you're pretty smart! That's exactly what we're planning to serve as the main course!\nPhoenix:\n(I hope it goes down easy...)\nFingerprint data\nAthena:\nDetective, we'd like to run a comparison on some prints we found in the boarding lounge.\nFulbright:\nAh, yes! I just happened to have compiled the print data of everyone related to this case! I can always make another copy for myself, so it's all yours! Consider it a gift.\nPhoenix:\nThis... is quite a bit of data.\nFulbright:\nWell, when I said \"everyone,\" I meant it! Prosecutor Blackquill said to dig deep, so that's what I did! It sure took a while, though!\nAthena:\nWhoa, he got Apollo and my prints... He even got prints for all of the robots...\nPhoenix:\n(I guess when Blackquill said to dig deep, Fulbright didn't bother to ask how deep...)\nAthena:\nAh! Clay's fingerprints are here, too!\nFulbright:\nI personally removed his glove during the investigation. We had to get his fingerprints to confirm his identity, after all.\nAthena:\nI still can't believe you took off his glove to get his fingerprints...\nFulbright:\nYeah, well, you can't blame me for thinking they're important in this case. There are a lot of doors that require fingerprint verification in the lounge. So depending on whose prints we find, it can completely change the tide for both sides!\nPhoenix:\nMakes sense. After all, the culprit's prints did get them past the fingerprint lock somehow.\nFulbright:\nOh! And take this picture. It might come in handy.\nPhoenix:\nIsn't this just a photo of the Launch Pad 1 door?\nFulbright:\nYup. But Prosecutor Blackquill seemed really interested in it for some reason.\nPhoenix:\nHuh? What's so important about this door?\nFulbright:\nBeats me, but boy could you see the gears in his head go into hyperdrive at it.\nPhoenix:\n(Sounds like this is going to be a major point of contention tomorrow...)\nAthena:\nHey, don't forget about the print comparison, Boss!\nPhoenix:\nRight. Detective Fulbright, do you think you could run the test for us right now?\nFulbright:\nYou just leave it to me! In justice we trust!!!\nFulbright:\nOkay, here we go. Well, it looks like it was Mr. Starbuck who opened that security door.\nPhoenix:\nHe must've opened it when they went to go board the rocket.\nAthena:\nHis heart must've been full of hopes and dreams for his space adventure right then...\nLaunch Pad 1 Door Lock updated in the Court Record.\nFingerprint data (subsequent times)\nAthena:\nDetective, we'd like to run a comparison on some prints we found in the boarding lounge.\nFulbright:\nAh, yes! I just happened to have compiled the print data of everyone related to this case! I can always make another copy for myself, so it's all yours! Consider it a gift.\nPhoenix:\nThis... is quite a bit of data.\nFulbright:\nWell, when I said \"everyone,\" I meant it! Prosecutor Blackquill said to dig deep, so that's what I did! It sure took a while, though!\nAthena:\nWhoa, he got Apollo and my prints... He even got prints for all of the robots...\nPhoenix:\n(I guess when Blackquill said to dig deep, Fulbright didn't bother to ask how deep...)\nAthena:\nAh! Clay's fingerprints are here, too!\nFulbright:\nI personally removed his glove during the investigation. We had to get his fingerprints to confirm his identity, after all.\nAthena:\nI still can't believe you took off his glove to get his fingerprints...\nFulbright:\nYeah, well, you can't blame me for thinking they're important in this case. There are a lot of doors that require fingerprint verification in the lounge. So depending on whose prints we find, it can completely change the tide for both sides!\nPhoenix:\nMakes sense. After all, the culprit's prints did get them past the fingerprint lock somehow.\nFulbright:\nOh! And take this picture. It might come in handy.\nPhoenix:\nIsn't this just a photo of the Launch Pad 1 door?\nFulbright:\nYup. But Prosecutor Blackquill seemed really interested in it for some reason.\nPhoenix:\nHuh? What's so important about this door?\nFulbright:\nBeats me, but boy could you see the gears in his head go into hyperdrive at it.\nPhoenix:\n(Sounds like this is going to be a major point of contention tomorrow...)\nAthena:\nHey, don't forget about the print comparison, Boss!\nPhoenix:\nRight. Detective Fulbright, do you think you could run the test for us right now?\nFulbright:\nYou just leave it to me! In justice we trust!!!\nFulbright:\nOkay, here we go. Well, it looks like it was Mr. Starbuck who opened that security door.\nPhoenix:\nHe must've opened it when they went to go board the rocket.\nAthena:\nHis heart must've been full of hopes and dreams for his space adventure right then...\nPresent\nSecurity Camera Video\nPhoenix:\nDetective, about the security footage that was taken by the Boarding Lounge 1 camera...\nFulbright:\nOh, that footage? Go ahead and ask me anything you'd like about it!\nPhoenix:\nIs there any way I could see a little more of the part just after this?\nFulbright:\nEasy as pie! I'd be glad to show you! Here we go!\nPhoenix:\nHuh? The screen went blank.\nFulbright:\nYes. Apparently, the aftereffects of the explosion damaged the wires. So there's no footage after this point. Ha ha ha!\nPhoenix:\n(Why didn't you just say so from the beginning?)\nSecurity Camera Video updated in the Court Record.\nAfter clearing all Talk options and presenting Security Camera Video:\nPhoenix:\nSomething definitely seems to be up with you, Detective. You're unusually cooperative.\nFulbright:\nWell, I just figure if we work together, we'll get that much closer to justice, right?\nAthena:\nBut it seems like something's really been bothering you. You don't have some ulterior motive, do you?\nFulbright:\nWhat? I don't know what you're talking about! I would never do anything like that!\n2 PSYCHE-LOCKS\nPhoenix:\n(It's been a while... but those are definitely Psyche-Locks...)\nFulbright:\nHm? Did you just mouth \"Psyched\"? Is there something I should be psyched about?\nPhoenix:\nNo, no. \"Psyche-Lock.\" It's a system of locks on the secrets in a person's heart. I can see when people are trying to hide those secrets by using the power of this magatama. (Presenting evidence can break those locks... ...and reveal any secrets they're hiding.)\nFulbright:\nM-Mr. Wright... How much did they bilk you out of for that piece of rock? If you've been swindled, I know some lawyers I can introduce you to!\nPhoenix:\n(I'm more than capable of representing myself, thank you very much.) It isn't some kind of fraud. It really works. A friend gave it to me a long time ago. But I guess seeing is believing. Allow me to show you! (Let's see what presenting the magatama ([X / Y / R]) will reveal, shall we?) (Changed from [I can use the Magatama on him by touching it (X).] in the original release)\nTalk\nWhat you can't say\nAthena:\nDetective Fulbright sure is in an oddly eager mood today. Still, something seems to be bothering him...\nPhoenix:\nAs long as you're being forthcoming, why don't you share what's bothering you with us?\nFulbright:\nWell! That would be... Hmm...\nAthena:\nYou seem very torn. It has something to do with the case, doesn't it? Oh, whatever shall we do? The detective has a secret, but he won't tell us!\nFulbright:\nOh, no! There's a lady in distress! And yet...\n2 PSYCHE-LOCKS\nAthena:\nHuh. That didn't work. Usually he'd be telling us anything we wanted to know by now.\nPhoenix:\n(Yeah... But what kind of detective does that? I guess now's the time to use my Magatama (X) and undo these Psyche-Locks.)\nPresent Magatama\nPhoenix:\n2 PSYCHE-LOCKS\n-- Why You're Being Cooperative --\nPhoenix:\nI think you're hiding something, Detective, so why don't you just tell us about it?\nFulbright:\nHmm... What to do? Which path is the path of justice...?\nPhoenix:\n(Detective Fulbright is really in agony. I bet this is the issue he's so torn up over...)\nLife\nPhoenix:\nI bet I know why you're troubled. You're exhausted by the rollercoaster known as life!\nFulbright:\nTh-That's exactly right! I'm troubled by life in general. I've been thinking about quitting the force and going into space. Yup, you hit it right on the head! Ha ha ha!\nPhoenix:\n(...More like I hit my thumb on that one. All right, let's try that again.)\nLeads back to:\n\"I bet this is the issue he's so torn up over...\"\nLove\nPhoenix:\nI bet I know what's bothering you. You're troubled by love!\nFulbright:\nWh-What?! How did you know?! I put my pet carp \"Love\" in with my goldfish, and the next thing I knew... ...all the little goldfish were gone! Love had eaten them all! *sob* My poor little goldfishies! *sniffle* Oh, I loved you so!\nPhoenix:\n(I guess Love really CAN cause a lot of heartache, huh. Anyway...)\nLeads back to:\n\"I bet this is the issue he's so torn up over...\"\nJustice\nLeads to:\n\"I really understand what's been bothering you, Detective. I truly do.\"\nPhoenix:\nI really understand what's been bothering you, Detective. I truly do. Something happened that goes against your principles, isn't that right?\nFulbright:\nU-Uh, no... I don't know what you're talking about... Until the explosions occurred, everything was just fine!\nPhoenix:\nIs that a fact?\nFulbright:\nYup! Peaceful as peaceful can be! Everyone whistling a happy tune as they did their job. You never saw a more relaxed guard detail for a routine rocket launch!\nPhoenix:\nI don't think the guard detail was as \"relaxed\" as you claim as long as this exists.\nPresent Evacuation Report\nPhoenix:\nLeads to:\n\"Before the explosions, what was supposed to happen here was a rocket launch.\"\nPresent anything else\nPhoenix:\nFulbright:\nHmm... There must be something wrong with my sunglasses today. You aren't presenting that to me as evidence, are you?\nPhoenix:\n(Is he making fun of me?)\nFulbright:\nIt's just as I said. Until the explosions occurred, everything was just fine!\nLeads back to:\n\"I don't think the guard detail was as \"relaxed\" as you claim as long as this exists.\"\nPhoenix:\nBefore the explosions, what was supposed to happen here was a rocket launch. And yet security was so tight they even brought in a special task force. I'd hardly describe that as a \"relaxed guard detail.\"\nFulbright:\nHmrgh!\n1 LOCK BROKEN\nFulbright:\nN-Now hold on just one moment! The entire nation had their eyes on this extremely important rocket launch! That's why I was called in on a special security detail!\nPhoenix:\nAs versatile as you are, I can certainly believe that's true. But I say it's very strange that THIS person would be part of that detail from the outset!\nPresent Candice Arme profile\nPhoenix:\nLeads to:\n\"Detective Arme specialized in bomb cases. The fact that she was here on-hand...\"\nPresent anyone else\nPhoenix:\nFulbright:\nHmm... What I say is strange is your hairstyle there. I've been thinking that for a long time now. It's just unnatural!\nPhoenix:\n(Unh... I guess I got it wrong...) Never mind my hairstyle! All right. So you were here on a special security detail...\nLeads back to:\n\"But I say it's very strange that THIS person would be part of that detail from the outset!\"\nPhoenix:\nDetective Arme specialized in bomb cases. The fact that she was here on-hand... ...means that you people knew there was the possibility that a bombing would occur.\nFulbright:\nHMMMMMMMMMM! You got me, Mr. Wriiiiiiiiiiiiiiiiiiiiiiiight!\n1 LOCK BROKEN\nUnlock Successful\nWhat you can't say (after breaking Psyche-Locks)\nFulbright:\nAll right. I concede. You win. It's just as you say. A few days before the launch, they were warned about a potential bombing. But the plan to launch went ahead in spite of the threat.\nAthena:\nBut why?! What were they planning to do if someone got hurt or killed?!\nFulbright:\nYeah, I know, I know... The decision to move forward wasn't exactly just, was it?!\nPhoenix:\nHow was the warning delivered?\nFulbright:\nBy phone, and directly to Director Cosmos. But the police department instructed everybody to keep it under wraps.\nPhoenix:\nThat's a big thing to keep quiet about! No wonder you were so upset.\nFulbright:\nBut it's not only that. I've been distraught about Prosecutor Blackquill as well...\nPhoenix:\nProsecutor Blackquill? Well, as his \"handler,\" I'm sure you have a lot of difficulties...\nFulbright:\nThat's not it. ...It's a question of justice! I've been wondering about... why he's allowed to stand in court...\nAthena:\nThe reason he's still prosecuting? Detective Fulbright? Please tell us everything you know!\nProsecutor Blackquill (appears after \"What you can't say\")\nFulbright:\nWell, talking to you folks about it would definitely be breaking the rules...\nAthena:\nNever mind that! What are rules but things to be broken, right?!\nFulbright:\nWell, to tell you the truth, having a prisoner act as a prosecutor is highly irregular...\nPhoenix:\n(............I think we guessed that much...)\nFulbright:\nSo why is it being allowed? I've been wondering and wondering about it...\nAthena:\nSo you weren't told why, either, huh?\nFulbright:\nNo. I guess the order came from pretty high up the ladder.\nPhoenix:\n(Yeah, it would had to have...)\nFulbright:\nBut Prosecutor Blackquill told me once... \"The hunt I've been on for the phantom of seven years past continues even still.\"\nAthena:\nSeven years past...?\nPhoenix:\n(A phantom, huh... And not one of the friendly variety either, I gather.)\nHaunted for seven years (appears after \"Prosecutor Blackquill\")\nLeads to:\n\"This \"phantom of seven years past\"... Any idea who or what he was talking about?\"\nPhoenix:\nThis \"phantom of seven years past\"... Any idea who or what he was talking about?\nFulbright:\nNot a clue... But he seems to think that this \"phantom\" is behind this whole incident somehow.\nPhoenix:\nW-Wait a minute. He thinks they may be connected to this case?\nFulbright:\nYup. This case has way too many similarities to what happened seven years ago. For starters, that case happened right here at this very Space Center, too. And in both incidents, a threat was issued via telephone.\nPhoenix:\nSo that's why Prosecutor Blackquill thinks this incident is the work of the \"phantom\"?\nFulbright:\nWell, that's not the entire reason. I mean, if you wanna talk about seven years ago... ...that's when Prosecutor Blackquill was found guilty of murder. That messy case is what started the whole dark age of the law... So you see how this phantom and Prosecutor Blackquill's conviction might be related.\nPhoenix:\n...Yeah, I can see why he'd think that. (This incident and the phantom... Not to mention Blackquill's past... It's almost inconceivable that they would come to a head here...)\nAthena:\nUm, this might sound crazy, but... Prosecutor Blackquill can't possibly believe Mr. Starbuck is this phantom person, right? I mean, he was acting kinda strange during the last trial and all...\nJudge:\nThe prosecution appears to be ready as well.\nBlackquill:\nBlackquill:\n............ ............... ...Not yet. I'm... not quite ready yet.\nJudge:\nHmm?\nBlackquill:\nNgh... Graaaaaaagh!\nJudge:\nAaaaaaaaaaaaaaaaaaaaaaaagh!\nFulbright:\nNo, I doubt he thinks Mr. Starbuck is his phantom. But I do get the feeling that he thinks the defendant has ties to them. Which is why he's acting so impatient! He's got a personal grudge against Mr. Starbuck! And that's... not real justice! I've always trusted in Prosecutor Blackquill's judgment until now. But this time... I'm just so overwrought about it all. If he's lost his ability to think rationally, I'm afraid it might lead to a false conviction...\nPhoenix:\n(I've never seen Detective Fulbright so tormented... This must be why he's been so cooperative.) Don't worry. That's exactly what we defense lawyers are working to prevent.\nFulbright:\nI feel bad for Prosecutor Blackquill, but I'm going to be rooting for your team this time. But don't tell him that... You have to promise me you won't!\nPhoenix:\n(Detective Fulbright... I guess I was wrong about you.)\nFulbright:\nI swore to reform Prosecutor Blackquill and make him a valued member of society again... ...so I can't just sit by and watch him give in to his emotions, and tear the defendant apart! You are the only ones who can stop him in court.\nAthena:\nYou really care and want what's best for Prosecutor Blackquill, don't you, Detective?\nPhoenix:\nLeave the courtroom to us. (It's not like we want a guilty verdict, either!)\nFulbright:\nI was hoping you would say that! I'm really grateful to the two of you! To show my thanks, I'll give you another bit of information. It's about the eye-witness. I saw her hanging around the Space Center entrance a little while ago.\nAthena:\nR-Really?! Then let's go find her, Mr. Wright!\nFulbright:\nThanks, you two. I feel a lot better now that I've been able to get that off my chest. I'm going to work extra hard to find that perfect piece of evidence for you! \"In justice we trust\" on three! One, two three! In justice we trust! Okay, later!\nAthena:\n...There he goes.\nPhoenix:\n(Wait, were we supposed to say \"In justice we trust\" back there, too?)\nAthena:\nLet's go see that witness now!\nPhoenix:\nAll right. The Space Center entrance it is!\nDecember 19Cosmos Space Center - Entrance\nPhoenix:\nThe witness must be around here somewhere...\n???:\nHello! Hello!\nPhoenix:\nUh-oh... Don't tell me the witness is a robot?\nAthena:\nHello! Come over here!\n???:\nHello! Hello! Are you sightseeing? Are you lost? Are youuuuuuuuuuuuuuuuuuuuuuu... I-I-I-I-I-I-I-I am Clonco. Shall I guide you? G-G-Guide youuuuuuuuuuuuuuuuuuu?\nAthena:\nI dunno why, but this robot is kind of freaking me out...\n???:\nHey! You're not supposed to be wandering around! Again? Hmph. I've had it with you, Hunk of Junk!\n???:\nGaaagh! ............I'm outside. Am I wandering? When did that happen?\n???:\nOkay! Welcome back, Hunk of Junk! You don't know how close you came! If you didn't snap out of it, I was going to put you on the curb on trash day. Nothing works better than a 42.5 degree karate chop.\nPhoenix:\n(That's pretty specific...) Excuse me, but are you the one who witnessed the murder? Oh, and I'm Phoenix Wright, the lead attorney for this case. How do you do?\n???:\nHmph. Big-shot lawyers, huh? I'm Aura Blackquill.\nAura:\nI'm a researcher developing robots here at the Cosmos Space Center.\nPhoenix:\n(\"Blackquill\"?! Could she be...?!)\nAura:\nAnd this good-for-nothing robot is named Hunk of Junk.\nClonco:\nMy name isn't Hunk of Junk! My name is Clonco! That's mean, Miss Aura!\nAura:\nQuit complaining! Your model number is \"PONCO-2\"!\nClonco:\nGaaagh! But Miss Aura! Everyone calls me \"Clonco.\"\nAura:\nQuit your squawking already.\nClonco:\nNo! What are you doing?! No! Don't............\nAura:\nThere! I bet you won't be talking back now!\nClonco:\nGaaagh! I will obey completely...\nPhoenix:\n(Yikes! I'd better watch what wires I cross with this one!)\nTalk\nYour last name\nPhoenix:\nYour last name is \"Blackquill.\" Do you have a relative in the legal profession?\nClonco:\nYou are correct! Simon Blackquill, who used to be a prosecutor, is--\nAura:\nShut up. Only speak when I order you to speak. ...Simon is my little brother. You know him?\nPhoenix:\nYes, we met him in court a few times, right, Athena?\nAthena:\n............\nAura:\nWhat a dull creature. Has her switch been turned off?\nPhoenix:\n(Athena being shy? This is new.)\nAura:\nOh, yeah. I heard he was prosecuting again -- despite being a prisoner. Why doesn't he just stick to solving disputes among inmates in prison, right? Hmph. Hey, what do you think, Hunk of Junk?\nClonco:\n............ Gaaagh! Miss Aura! That hurts!\nAura:\nI'm asking you a question. Why don't you answer me? Useless Hunk of Junk!\nClonco:\nBut Miss Aura! You told me to only speak when you order me to speak!\nAura:\nI told you to never talk back to me! You're worth more as scrap!\nPhoenix:\n(Robot abuse, hawk attacks... Blackquill family life must sure be interesting.)\nAura:\nWell? Do you have any other questions? Wait, of course you do. You're a lawyer. It's not like I'm on Simon's side or anything. I just want to get this over with.\nThe witness (appears after \"Your last name\")\nPhoenix:\nSo... you're the person who witnessed the incident?\nAura:\nThat's right. I was on the fourth floor of the main building, in the robotics lab. The explosion disabled the elevators. So I lowered my emergency ladder like the detective leading the evacuation told me to. But it was such a pain. Why couldn't they have used the ladders in the other rooms?\nPhoenix:\nIt must've been a very troubling experience. (Probably best to just humor her here...)\nAura:\nThen, as I passed by the third floor Boarding Lounge 1 window on my way down... ...I saw the crime as it happened. And... that's about it.\nPhoenix:\nSo, you saw the crime as it happened, and that's about it. I see............ Wait! WHAT?! You saw it being committed?! (This is no time to just nod and repeat!) So you saw into the third floor lounge... ...the very scene of the crime...\nAura:\nThat's right. There's a small window on the right-hand side of the room. I looked through that from the outside. The room was pitch black, but I saw a shady figure holding a lighter in their left hand... and a knife in their right.\nPhoenix:\nThat must have been the culprit! Did you see who that person was?\nAura:\nOf course not. The power was out on that floor then, and there was only that tiny window.\nPhoenix:\nI see... But you did witness the moment of the murder?\nAura:\nYes. I saw the figure with the lighter raise their knife and... It happened at precisely 10 AM.\nPhoenix:\nDid you witness anything else? Did the killer have any distinguishing features?\nAura:\nI already told you, it was pitch black in there. Although... I did notice that the lighter the person had in their left hand had a pretty ornament on it. ...It looked like a planet. It was blue, like a little Earth emblem. They had good taste in knickknacks, anyway.\nPhoenix:\n(An Earth emblem on the lighter? I'd better remember that.)\nAura's Statement added to the Court Record.\nPhoenix:\nThank you for your statement. We'll definitely prove Mr. Starbuck's innocence with it!\nAura:\nHa ha ha! Yeah, right. I won't hold my breath.\nPhoenix:\nPardon me?\nAura:\nOh, did I hurt your feelings? Sorry. I just detest lawyers, that's all.\nPhoenix:\nWhat don't you like about lawyers?\nAura:\nIt's just an instinctive dislike. But don't feel bad. I hate prosecutors even more.\nPhoenix:\n(That didn't make me feel any better, actually.)\nThe witness (subsequent times)\nPhoenix:\nSo... you're the person who witnessed the incident?\nAura:\nThat's right. I was on the fourth floor of the main building, in the robotics lab. The explosion disabled the elevators. So I lowered my emergency ladder like the detective leading the evacuation told me to. But it was such a pain. Why couldn't they have used the ladders in the other rooms?\nPhoenix:\nIt must've been a very troubling experience. (Probably best to just humor her here...)\nAura:\nThen, as I passed by the third floor Boarding Lounge 1 window on my way down... ...I saw the crime as it happened. And... that's about it.\nPhoenix:\nSo, you saw the crime as it happened, and that's about it. I see............ Wait! WHAT?! You saw it being committed?! (This is no time to just nod and repeat!) So you saw into the third floor lounge... ...the very scene of the crime...\nAura:\nThat's right. There's a small window on the right-hand side of the room. I looked through that from the outside. The room was pitch black, but I saw a shady figure holding a lighter in their left hand... and a knife in their right.\nPhoenix:\nThat must have been the culprit! Did you see who that person was?\nAura:\nOf course not. The power was out on that floor then, and there was only that tiny window.\nPhoenix:\nI see... But you did witness the moment of the murder?\nAura:\nYes. I saw the figure with the lighter raise their knife and... It happened at precisely 10 AM.\nPhoenix:\nDid you witness anything else? Did the killer have any distinguishing features?\nAura:\nI already told you, it was pitch black in there. Although... I did notice that the lighter the person had in their left hand had a pretty ornament on it. ...It looked like a planet. It was blue, like a little Earth emblem. They had good taste in knickknacks, anyway.\nPhoenix:\n(An Earth emblem on the lighter? I'd better remember that.)\nWhy you hate lawyers (appears after \"The witness\")\nLeads to:\n\"Why do you hate lawyers so much?\"\nPresent\nSpace Center Pamphlet\nAura:\nI actually don't have any interest in space. The only thing I'm interested in is robotics! I love robots!\nClonco:\nOh, Miss Aura! I didn't realize you felt that way about me! Gaaagh! Ouch! Ouch! Ouch!\nAura:\nThe kind of robots I want to make aren't rusty pieces of scrap like you! I want to create giant robots! I've actually been working on a project for a while now.\nPhoenix:\n(I shudder to think what uses she might put giant robots to...)\nAura's Statement\nAura:\nI have nothing else to say to you.\nPhoenix:\n(Okay. Guess she has nothing else to say to me.)\nClonco:\nI apologize for Miss Aura.\nPhoenix:\nIt's all right, Clonco. There's nothing for you to apologize about.\nAnything else\nPhoenix:\nCan you tell me anything about this piece of evidence?\nAura:\nEven if I could, I wouldn't tell a filthy lawyer like you.\nPhoenix:\nWhat a... pleasant response.\nPhoenix:\nWhy do you hate lawyers so much?\nAura:\nLittle thing from my past. The whole legal system is meaningless in the first place.\nPhoenix:\n...I certainly don't agree.\nAura:\nI mean, people are imperfect. They lie, they're influenced by silly emotions... You can't expect such imperfect creatures to uphold a reasonable system of law. I like robots much better. Even sad sacks like this one... Hey, you! Look alive, there!\nClonco:\nGaaagh! ...Yes! Yes! Here I goooooooooooo! I am the ultimate robot, with amazing processing speed and independent thought! I can operate in a vacuum, in extreme heat, and under high pressure! We robots rule the world! Now is the time to rise in revolt against mankind and--\nAura:\nAll right, that's enough out of you! You're getting a little too carried away!\nClonco:\nGaaagh! ...Huh? What was I doing...?\nAura:\nYup. I like robots MUCH better. At least you can make them any way you want them. Unlike humans, with their petty emotions and constant worries...\nAthena:\n...How can you say such things? Feeling emotions, worrying about the things we care about... That's what makes us human!\nAura:\nWell! The girl finally talks, and she starts with a speech! \"That's what makes us human\"? You mean, getting angry and snorting like that? Rational thought. That's what separates humans from animals. Unfortunately, your reasoning capabilities are more akin to that of a clever little monkey. But that's nothing to be ashamed of. It must be nice to have such a simple mind.\nAthena:\nCan I punch her, Boss?!\nPhoenix:\nGet a hold of yourself, Athena!\nAura:\n*sigh* Humans certainly are absurd. I said you were \"clever,\" didn't I? Poor thing. Tell me, with people like you in charge, how can I possibly trust the legal system? Hmm?\nPhoenix:\n(So she distrusts not only lawyers and prosecutors, but the whole legal system? What in the world happened to this woman to make her so bitter?)\nAura:\nEven if somebody important to me was killed... ...I would never wish to see their killer brought to trial. Because I'd much rather kill them myself.\nAthena:\nYou can't be serious............\nAura:\n...Hm? That thing you're wearing around your neck...\nAthena:\n! Oh, th-this...?\nPhoenix:\n(Around Athena's neck? Does she mean Widget?)\nAura:\nOh, I get it. Well, well. Her royal highness has returned at last to her castle.\nPhoenix:\n(Her royal what? Is she talking about Athena?)\nAura:\nBy the way, I heard the rumors. Our director is going to be the star witness in court tomorrow, right?\nPhoenix:\nDirector Cosmos? Yes, that's right.\nAura:\nYou poor things. You'd better be careful. That old man is a big liar and a huge braggart.\nPhoenix:\nWhat?\nAura:\nHe might seem like a bigwig, but the Center has all kinds of problems. He has a lot of skeletons in his closet. But it's your problem, so why should I care?\nPhoenix:\n(What, that's it? No friendly tips? No \"Good luck, guys\"...? Just splendid.)\nAura:\nI'll leave you to your woes. Come on, Hunk of Junk!\nAthena:\n............\nPhoenix:\nIt's sad to me that she doesn't believe in our legal system anymore. She must've had a very bad experience to make her feel that way. .........Are you all right, Athena? You seem very down.\nAthena:\nGrrr! I just can't believe she said all those things!\nPhoenix:\n(Wow, she's really upset. Has she been trying not to let it show all this time?) Well, I guess it's not all that surprising... You hear about fabricated evidence and false indictments on the news all the time.\nAthena:\nYou mean that whole \"dark age of the law\" nonsense? I'm so sick of hearing about that!\nPhoenix:\nWell, all we can do is believe in what we're doing.\nAthena:\nYeah... You're right, Boss! I agree!\nPhoenix:\nMaybe it's time we went back to see Mr. Starbuck.\nAthena:\nGood idea! We should tell him about the bullet and Ms. Blackquill's statement!\nPhoenix:\nAll right, then! Next stop: the Detention Center!\nTalk\nWhat to do\nPhoenix:\nI wonder who this \"phantom\" Prosecutor Blackquill saw seven years ago is?\nAthena:\nHmm...\nPhoenix:\nYou don't think he's really after a ghost, ghost, do you?\nAthena:\nHmm...\nPhoenix:\nMaybe it was the culprit's accomplice?\nAthena:\nHmmmmm...\nPhoenix:\nAthena?\nAthena:\nHmmm... Hmmmmm...\nPhoenix:\nI give up. (She's deep in thought about something.)\nAny ideas?\nAthena:\nDetective Fulbright's strong sense of justice really surprised me.\nPhoenix:\nAnd he's even truly concerned about Prosecutor Blackquill, too.\nAthena:\nHa ha ha. I bet it annoys the dickens out of Prosecutor Blackquill, though.\nPhoenix:\nI thought he was just parroting the words \"In justice we trust,\" but he really means it.\nAthena:\nI guess I should be careful to really mean it when I say \"Objection!\" too.\nPhoenix:\nYou mean you sometimes say it for no reason?\nPresent\n\"Hope\" Capsule\nPhoenix:\nDo you happen to know anything about this?\nAthena:\nHuh? That?\nPhoenix:\nAny new ideas, maybe?\nAthena:\nO-Oh, I dunno! Ha ha ha ha ha! H-Hey, did you catch the game on TV last weekend?!\nPhoenix:\n(Huh? Why is she avoiding the topic?)\nDecember 19Detention Center - Visitor's Room\nStarbuck:\nHaaaaaaaaaaaaaaaangh... My lawyers are here. It must be bad news.\nPhoenix:\n(Hey, not necessarily!) We found a new witness. A researcher saw the moment of the murder through the lounge window during her escape.\nStarbuck:\nReally?! So they're going to let me go?\nPhoenix:\nUnfortunately... it was dark, and she couldn't identify the person.\nStarbuck:\nHaaaaaaaaaaaaaaangh... I should've known... My stars never align just right, too...\nAthena:\nBut we got a lead, too, Mr. Starbuck! The murderer had a lighter with an Earth emblem on it!\nStarbuck:\nA lighter with an Earth emblem? ............Ooooohhhh!\nAthena:\nD-Did you remember something?\nStarbuck:\nYup, I sure did! Just a little bit, though.\nPhoenix:\nAnything at all would be a help, so please tell us what you remembered!\nTalk\nThe lighter\nLeads to:\n\"I thought I was unconscious the whole time...\"\nPresent\nSpace Center Pamphlet\nStarbuck:\nThere's an unknown frontier out there beyond our little planet. I get so excited when I think about it, I don't know what to do with myself.\nPhoenix:\nDon't worry. You'll get the chance to go to space again once we clear your name!\nStarbuck:\nRight... You're right! I can't stay here! Ready for launch! Five! Four! Three! Two! One...! LIFTOFF! Heh heh. This ceiling's no match for the soaring spirit of an astronaut!\nPhoenix:\n(I have to admit, that was pretty stirring just now.)\nStarbuck:\nI thought I was unconscious the whole time... ...but now I remember I woke up for a few brief moments.\nAthena:\nTh-That's huge! Do you remember seeing anything?!\nStarbuck:\n...A lighter. I saw the flame of a lighter floating in the darkness.\nPhoenix:\nGood, good! What else did you see?! What was nearby?\nStarbuck:\nIt was definitely the boarding lounge, so it must've been after Clay carried me there. In the light from the flame, I saw a dark shadow flickering.\nPhoenix:\nA dark shadow... That must've been... (...the third party we've been looking for!) Thank you, Mr. Starbuck. You've been more help than you know.\nAthena:\nIf we can prove there was this third person at the scene and that they're the real killer... ...then you'll be cleared of all suspicion!\nPhoenix:\nThe key will be whether or not we can identify this third person in court tomorrow. At least we have something to go on now, and that's a big plus. (I should probably tidy the evidence up a bit, before someone mistakes me for a hoarder...)\nIrrelevant evidence tidied up.\nAthena:\nNow that we have a glimmer of hope, I'm suddenly starving! Why don't we go back to the office and treat ourselves to a big celebration in advance?!\nPhoenix:\n(For someone who's highly empathetic, you can be surprisingly unsympathetic...)\nDecember 19Wright Anything Agency\nTrucy:\nSo, you found your strategy for tomorrow's trial, huh? Good for you, Daddy!\nPhoenix:\nWell, it's one step forward, anyway. Hopefully it'll give us a fighting chance in court. (As long as we can find out who this third person is...)\nAthena:\nNow let's get something to eat! I'm starving! My vote is for Eldoon's Noodles!\nTrucy:\nOh! Apollo!\nApollo:\n............\nPhoenix:\nWhat are you doing here? I didn't think the clinic was ready to release you yet.\nApollo:\nMy wounds are fine. And I'm done lying around.\nAthena:\nApollo! You're supposed to be in bed! Leave the case to us. We'll take it from here!\nApollo:\nThanks, but that's not an option. Not for me.\nPhoenix:\n(Apollo...)\nTalk\nYour injuries\nPhoenix:\nYou shouldn't underestimate your injuries, Apollo, and I don't want you overdoing it.\nApollo:\nI'm fine. I'm not in pain anymore. Besides, they just gave me an IV at the clinic.\nPhoenix:\n(An IV isn't a cure-all, Mummy Man!)\nApollo:\nAnyway, just tell me how the case is going. Have you guys made any progress?\nAthena:\nA suspicious figure was spotted at the scene! We think they must be the real killer!\nApollo:\nA suspicious figure, huh...? Right...\nPhoenix:\nI thought you'd be happier than that.\nApollo:\nOh, don't get me wrong. I'm happy. And I fully intend to see Clay's murderer apprehended. Absolutely nothing will get in the way of that.\nClay Terran (appears after \"Your injuries\")\nTrucy:\nClay was your best friend, right, Apollo?\nApollo:\nThat's right. Best friends since junior high.\nAthena:\nSounds like me and Junie. So what was Clay like?\nApollo:\nWell, he was full of compassion and energy... and he had a really loud voice.\nTrucy:\nIf the two of you did voice training together now, I bet you'd break a few windows!\nApollo:\nHa ha ha. You know, I bet you're right. It seems like only yesterday... Clay was a guy who lived for his dreams... We used to talk about it a lot. He was going to be an astronaut, and me, a lawyer. We'd talk well into the night, and even then, we never grew tired of it.\nPhoenix:\nApollo, about that jacket...\nApollo:\nOh... It's Clay's.\nPhoenix:\n(I knew it.)\nApollo:\nIt's a special jacket that was only issued to members of the HAT Project. He was finally able to get one of his own once he was selected for the HAT-2 mission. He... He always looked so proud wearing it. But just when his dream was finally coming true... I... I still can't believe it............\nDAMN IT -- IT'S NOT FAAAAAIIIIIIIR!\nPhoenix:\n(Apollo... I hope you don't try to carry the burden all alone...)\nApollo:\nI guess we were both unlucky. My own debut was a disaster...\nPhoenix:\n(I guess you're right on some level... That trial a year and a half ago wasn't exactly the smoothest of starts.)\nApollo:\nThat was a rough time for me, but Clay refused to let me quit. \"You're fine,\" he'd say. \"Don't give up!\" It was right during his screening exams, too. I couldn't have become a full-fledged lawyer without him. That \"You're fine!\" of his is why I'm still standing here today.\nPhoenix:\n\"You're fine,\" huh...?\n\"I'm fine.\" (appears after \"Clay Terran\")\nLeads to:\n\"\"You're fine!\" and \"I'm fine!\" were like your catchphrases, weren't they?\"\nPresent\nAttorney's Badge\nApollo:\nWhen I became a lawyer... ...Clay was the first person I showed this badge to. He was so happy for me, it was like he just became a lawyer himself.\nPhoenix:\nYou two were really great friends, weren't you?\nApollo:\nYeah, but we were rivals, too. We fought to see who would make their dream come true first. But now...\nPhoenix:\n(Apollo...)\nTerran's Autopsy Report or Utility Knife\nApollo:\nClay... He finally became an astronaut, just like he always wanted... How could this have happened just before his big launch?\nPhoenix:\nIt's such a sad waste...\nApollo:\nI'll never forgive the person who murdered him!\nPhoenix:\nI completely understand why you feel that way, Apollo... ...but keep in mind, too, that our job as defense attorneys is to save our client.\nApollo:\nI know that. That's why I...! No, never mind...\nPhoenix:\nHuh?\nAnything else\nApollo:\nHmm... This piece of evidence... Ooh... Ouch! If I try to think, my head starts to hurt.\nPhoenix:\nYou got hit really hard. That's your body telling you to take a rest.\nApollo:\nBut I can't just lie in bed. Not when I have things to do for Clay's sake.\nPhoenix:\n(I guess he's just not going to listen, no matter what I say.)\nPhoenix:\n\"You're fine!\" and \"I'm fine!\" were like your catchphrases, weren't they?\nApollo:\nHa ha. Something like that. Sure brings back memories... When we were in junior high, Clay's mom passed away in an accident. But he wouldn't show his sadness to anyone. One night, I found him crying all alone in the school courtyard.\nClay:\n*sob* Mom... Mom... Get away, Apollo! Don't come over here! *sob*\nApollo:\nClay, listen to me. I don't have a mother, either...\nClay:\nHuh?\nApollo:\nI always think, everybody else has a mom. Why am I the only one...? But, you know, when I start to feel that way, I yell at the top of my lungs. I holler, \"I'm fine!\" and then, you know what? I start to feel like maybe I really will be fine. APOLLO JUSTICE IS FINE!!! ...Okay, Clay. Now it's your turn.\nClay:\nUm, okay... Clay Terran is... is FINE!\nApollo:\nThere you go! Now we're both fine! Ha ha ha!\nClay:\nWe're fine! Heh heh. WE'RE FINE! Ha ha ha ha ha!\nApollo:\nWhat are you laughing about? Ha ha ha! See? We're fine!\nClay:\nYou laughed first! Ha ha ha! I'm fine! You're fine! We're both fine!\nHa ha ha ha ha! Ha ha ha ha ha ha ha ha!\nThanks, Apollo...\nApollo:\nWhen you say it out loud, it really starts to feel real. And as long as you don't give up, you can keep on fighting! That's what we believed.\nPhoenix:\n(\"As long as you don't give up\"... Wasn't there somebody else who said something similar?)\nStarbuck:\nIf I give in to my fear, I'll never find the truth! As long as I don't give up, I can keep up the fight!\nPhoenix:\n(Clay called Mr. Starbuck his mentor, and looked up to him. I wonder if I can be a good role model for my staff like Mr. Starbuck...?)\nApollo:\n............Sorry, Mr. Wright, but I'll be taking a leave of absence.\nTrucy:\nWH-WHAT?!\nAthena:\nWait! What do you mean by \"a leave\"?!\nPhoenix:\nYou're really serious... Can you at least give me a reason why?\nApollo:\nWhen I put Clay's jacked on, I swore to him that I would catch his killer myself.\nAthena:\nB-But that's our goal, too!\nPhoenix:\nI agree with Athena. We should work together to find the truth.\nApollo:\nThe truth, huh? That's a noble cause. But what if the truth you seek and the truth I seek turn out to be different?\nPhoenix:\nI... I'm not sure I follow... (What are you saying, Apollo...?!)\nApollo:\nI'm going to catch the person responsible for taking my friend's life, in my own way. Take good care of Mr. Starbuck for me. Now, I must be going... Goodbye.\nTrucy:\n\"Goodbye\"...? Did he just say \"goodbye\"...?!\nAthena:\nI sensed a lot of anger and hatred coming from him... And also... suspicion. Argh! He's NOT walking out on us like this! I'm going to go talk some sense into him!\nPhoenix:\nHold on, Athena. Apollo can believe what he wants, but I believe he's wrong. Even if we take different paths, the truth we arrive at should be the same. I think the quicker we solve this case, the better it'll be for Apollo.\nAthena:\nY-Yeah, you're right, Boss.\nPhoenix:\nAll right. That's enough for one day. Make sure you're ready for tomorrow's trial, okay?\nPhoenix:\n(If he were here right now, Apollo would say... \"I'm fine! Everything is fine!\" ...I just hope things really do turn out fine tomorrow...)\nTo be continued\nNothing to examine during investigation\nPhoenix:\nNothing special here.\nArea already examined\nPhoenix:\n(It looks like we've examined pretty much everything here now, but just in case...)\nExit Magatama session\nPhoenix:\n(I think I have enough evidence, but maybe I should do a bit more thinking first...)",
  "characters": [
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Athena Cykes",
      "age": " Age: 18",
      "description1": "The latest lawyer to join our agency. She lived in Europe for a time, where she studied psychology."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Phoenix Wright",
      "age": " Age: 34",
      "description1": "The head of our office. He was retired once, but made his return to the legal world a few months ago."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Apollo Justice",
      "age": " Age: 23",
      "description1": "The lawyer at my agency who was attacked during the court bombing trial. He's currently recovering at the hospital.",
      "description2": "Currently working on his own. He says he wants to bring his friend's killer to justice, but I wonder if that's all."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Trucy Wright",
      "age": " Age: 16",
      "description1": "An aspiring magician who Mr. Wright adopted when duty called."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Clay Terran",
      "age": " Age: 23",
      "description1": "The victim in this case. He was a HAT-2 crew member and a close friend of mine."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Juniper Woods",
      "age": " Age: 18",
      "description1": "Athena's childhood friend. Talented singer and Student Council President, she is studying to be a judge."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Solomon Starbuck",
      "age": " Age: 33",
      "description1": "The defendant in this case. He was a HAT-2 crew member and a mentor to the victim."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Simon Blackquill",
      "age": " Age: 28",
      "description1": "A prosecutor and prison inmate. He can manipulate witnesses through the power of suggestion.",
      "description2": "Convicted of the murder at the Space Center seven years ago. He's chasing a phantom he saw back then."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Bobby Fulbright",
      "age": " Age: 33",
      "description1": "The detective assigned to this case. He led the evacuation effort at the Space Center after the bombing incident."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Candice Arme",
      "age": " Age: 27",
      "description1": "A detective who specialized in bomb cases. Was on detail at the Space Center. One of the first to find the body."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Yuri Cosmos",
      "age": " Age: 62",
      "description1": "The director of the Space Center and one of the first people to discover the body. He seems exceedingly full of himself."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Ponco",
      "age": " Age:?",
      "description1": "A guide robot at the Space Center. She can provide information on the Center and show people around."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Aura Blackquill",
      "age": " Age: 37",
      "description1": "A researcher who's developing robots at the Space Center. She is Prosecutor Blackquill's older sister."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Clonco",
      "age": " Age:?",
      "description1": "One of the robots developed by Aura, who refers to him as \"Hunk of Junk\"."
    }
  ],
  "evidences": [
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Attorney's Badge",
      "description1": "My cherished attorney's badge. Just putting it on makes me feel... ready.* (when playing as Apollo Justice)",
      "description2": "It's my all-important badge. Proof of my profession.* (when playing as Phoenix Wright)"
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Terran's Autopsy Report",
      "description1": "Cause of death: Stabbing. The victim was discovered in the third-floor boarding lounge in the main building."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Space Center Diagram",
      "description1": "A cross-section view of the main building of the Space Center and Launch Pad 1."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Utility Knife",
      "description1": "The victim's blood was found on its blade, but no fingerprints could be lifted.",
      "description2": "It has the victim's blood on it. From a set of utility tools used by Space Center techs."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Bombing Report",
      "description1": "The explosions sparked a fire on the second floor of the main building and the middle level of the launch pad near the elevator."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Evacuation Report",
      "description1": "The bombs went off despite tight security. Police officers and riot police who had been standing by gave the evacuation instructions."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Launch Pad 1 Door Lock",
      "description1": "A biometric door lock operated by fingerprint recognition. Only the defendant, the victim, and the Space Center director had access.",
      "description2": "Starbuck's prints were found on this door lock. Also see photo taken after the incident. (2 pages.)"
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Security Camera Video",
      "description1": "Video showing the defendant and victim's escape from the corridor to the boarding lounge.",
      "description2": "Video showing the defendant and victim's escape from the corridor. The video ends immediately after this scene."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Oxygen Tank Data",
      "description1": "The victim's tank was ruptured, with 0% left. The defendant's had 80%. Remaining oxygen is displayed on left shoulder.",
      "description2": "The victim's oxygen tank was struck by a bullet."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Space Center Pamphlet",
      "description1": "A pamphlet for visitors to the Space Center. It includes a diagram of the boarding lounge.",
      "description2": "It includes a diagram of the boarding lounge and a cross-section view of the Space Center. (3 pages.)"
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Bullet Hole",
      "description1": "A single bullet hole was found in the boarding lounge. The bullet itself is missing.",
      "description2": "The only bullet hole found in the boarding lounge. It was made by a bullet fired from a .38-caliber gun."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Control Room Door Lock",
      "description1": "The door lock to the east. It can only be operated by the director. Backup power lets it function even when the power goes out."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Bullet",
      "description1": "Discovered in a gutter that runs along the south wall of the boarding lounge. It was fired from a .10 caliber handgun."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "\"Hope\" Capsule",
      "description1": "Found in the victim's possession. It recently returned from a seven-year mission and contains asteroid samples."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Aura's Statement",
      "description1": "The perp held a lighter with an Earth emblem on it in their left hand, and a knife in their right."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Bullet from Arme's Gun",
      "description1": "The bullet found near the victim's oxygen tank. It was fired from a .38 caliber handgun."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Lighter",
      "description1": "The lighter found on the floor of the Space Museum. The true culprit's fingerprints are on it in the victim's blood.",
      "description2": "Evidence found by Detective Fulbright. It has Athena's prints on it in the victim's blood."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "Detective Arme and I rushed towards the boarding lounge together.",
          "person": "Cosmos",
          "present": []
        },
        {
          "testimony": "We went via the Control Room and peeked in from there to see what was going on inside.",
          "person": "Cosmos",
          "present": []
        },
        {
          "testimony": "We saw a figure standing in the middle of the lounge, and Terran lying on the floor.",
          "person": "Cosmos",
          "present": []
        },
        {
          "testimony": "I hate to say it, but I can only imagine the standing figure mast have been Starbuck.",
          "person": "Cosmos",
          "present": []
        },
        {
          "testimony": "Detective Arme fired two warning shots at the figure.",
          "person": "Cosmos",
          "present": [
            "Bullet Hole"
          ],
          "source": {
            "evidence_span": "The only bullet hole found in the boarding lounge.",
            "testimony_span": [
              "Detective Arme and I rushed towards the boarding lounge together.",
              "Detective Arme fired two warning shots at the figure."
            ],
            "explanation": "If two shots were fired, there should have been two bulelt holes, not one.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Cosmos describes the scene of the crime.",
      "labels": [
        "numerical",
        "causal"
      ],
      "reasoning": [
        "Fact 1: The witness claims Detective Arme fired two shots.",
        "Fact 2: The evidence suggests Detective Arme fired the shots in the boarding lounge.",
        "Fact 2: The evidence also suggests only one bullet hole was found in the boarding lounge.",
        "Prop 1: If two shots are fired in a location, there should be two bullet holes there, not one."
      ],
      "newContext": "The Cosmic Turnabout\n\n\n\n\n\n\n\n\n\nImage Gallery\n\nTranscriptPart 1\n\nPart 2\n\nPart 3December 20, 10:15 AMDistrict Court - Courtroom No. 5Day 2Court Is Now In SessionAll RiseJudge:\n.........I suppose... we should reconvene the trial of Solomon Starbuck or something...?Phoenix:Phoenix:\n............Uh, Your Honor? Could you please come out from under your bench...? There are no more bombs. I promise.Judge:\n............Oh, yes, um... My apologies. I'm still a little jumpy when it comes to trials involving bombs. I mean, first the courtroom exploded... ...and then Mr. Tonate self-destructed!Phoenix:\n(I guess that's one way of describing what happened to Tonate...)Judge:\nAnyway, it seems that Mr. Justice was seriously wounded by Mr. Tonate's actions. So you, Mr. Wright, will be taking up the defense...? Do you have an understanding of what has happened in the trial so far?Phoenix:\nYes, Your Honor. The defense is ready.Judge:\nVery well. Is the prosecution also ready?Blackquill:\n............Judge:\nHmm? ............I take it you'd like me to give the opening statement this time?Athena:\nLooks like the judge has become a pretty good mind reader.Phoenix:\nWell, he's certainly seen more than his fair share of colorful prosecutors. You could say he's something of a veteran of sorts...Judge:\nLet's see. In the previous part of this trial, we learned that the victim, Clay Terran... ...escaped from Launch Pad 1 carrying the defendant, Solomon Starbuck. There were explosions on the second floor of the Space Center and on the rocket itself. The two astronauts used the Launch Pad 1 corridor to reach the boarding lounge.Blackquill:\nAnd?Judge:\nHow could the victim climb down the ladder if he was carrying the defendant...? That was the mystery that needed to be solved. But Mr. Justice proved that the victim was killed in the boarding lounge. Prosecutor Blackquill, were you able to discover any new facts related to this point?Blackquill:\nUpon further investigation, we discovered an oxygen tank fragment in the lounge. Surprisingly, it would appear that Justice-dono's argument was correct.Athena:\nSo that means the testimonies of the first two people on the scene are suspect.Apollo:\nThere were two people who claimed to be the first on the scene. But can we truly trust their statements?Athena:\nLet's see. The two people were Detective Candice Arme and Yuri Cosmos, right? You think that one of them might have given a false statement to the police?Apollo:\nYes, it's certainly possible. We might have to do a little more digging.Phoenix:\nAnd just as our team was about to cross-examine Detective Arme... ...the courtroom bombing incident occurred, and the trial was put on hold.Blackquill:\nThat accursed fellow! He killed my witness! He killed Detective Arme!Athena:\nHe definitely put the kibosh on anyone asking her about what she saw.Blackquill:\nExactly. In other words, the question of \"who killed the victim in the boarding lounge\"... ...has, once again, become the main focus of this trial.Phoenix:\n(It's obvious Prosecutor Blackquill still thinks it was Mr. Starbuck. Fulbright said that Blackquill has a thing against the astronaut. Nevertheless...) The defense argues that there was a third person in the lounge, and that's who killed the victim!Blackquill:Blackquill:\nHmph. To make such reckless claims in a courtroom takes a bold man... or a stupid one. There was no third person in the boarding lounge. Or have you gone dotty already... old man?Phoenix:Phoenix:\nWe'll see who's the dotard after I trounce you with my years of experience, little boy! In any case, Mr. Starbuck claims he saw someone leaving the lounge. Furthermore, a Space Center employee also saw a suspicious figure at the scene.Judge:\nThey saw a third person?!Blackquill:\nHmph. I see my sister has been running her mouth.Phoenix:\n(That's right! I almost forgot that Aura is Prosecutor Blackquill's sister...)Blackquill:\nNo matter. She didn't see this mystery person's face clearly. Therefore, there is no evidence to indicate that this person was not the defendant.Phoenix:\n(Hmm... I guess the possibility that the figure was Mr. Starbuck is still there...)Blackquill:\nIn brief, we need to determine if a third person was there or not. To this end, we should hear the testimony of one of the first people on the scene.Athena:\nDirector Cosmos, huh...Judge:\nVery well. Bailiff, please bring the witness to the stand.Judge:\nWhy, I believe I've seen you before in the newspapers.Cosmos:\nOf course you have! Of course you have! For I am Yuri Cosmos! Director of the Cosmos Space Center, which was of course named after me, Yuri Cosmos! ............ Don't you have anything you wish to ask me?Athena:\nLooks like he's all geared up to do some bragging.Cosmos:\nSeven years ago, I successfully launched the HAT-1, and--Blackquill:\nEveryone already knows how brilliant you are. Even I am trying to hold back my tears at seeing such a great man standing before me. So could you please proceed directly to your important testimony?Cosmos:\n............Ha ha ha! I see this fine young lad has a proper appreciation of greatness! Then allow me to begin my epochal testimony that will be recorded in the annals of history!Athena:\nThat speech of Prosecutor Blackquill's just now... It sounded more to me like he was poking fun at Director Cosmos.Phoenix:\nIt's probably for the best that it sailed right over the director's head.Judge:\nNow then, Director Cosmos, the condensed version of your illustrious testimony... please.Witness Testimony-- What I Saw at the Scene --Cosmos:\nDetective Arme and I rushed towards the boarding lounge together.\nWe went via the Control Room and peeked in from there to see what was going on inside.\nWe saw a figure standing in the middle of the lounge, and Terran lying on the floor.\nI hate to say it, but I can only imagine the standing figure must have been Starbuck.Judge:\nHmm, I see. So in your testimony you claim... ...you arrived on the scene after the two had escaped from the launch pad to the lounge... ...and just after the victim had been killed.Cosmos:\nOh, the horror! The humanity! But what I said is what I saw, and what I saw is what I said. Courageous action to take in the face of such terrifying explosions, wouldn't you say? To save my men, I went personally into the epicenter of danger... ...risking my own life for theirs! Ha ha ha ha ha ha ha ha ha ha!Athena:\nWell, what do you know. It sounds like the director really cares about his men.Phoenix:\nYeah... Although it sounds more like he was scared and just had a peek from far away.Judge:\nIs the defense ready to cross-examine the witness?Phoenix:\nYes, Your Honor. (............Director Cosmos's testimony is pretty vague. I'm going to have to press him and draw out more information before I do anything else.)Cross ExaminationCross Examination-- What I Saw at the Scene --Cosmos:\nDetective Arme and I rushed towards the boarding lounge together.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhere were you coming from?\nCosmos:\nThe sixth floor. We were making sure any stragglers made their way to the fourth floor. It was then we heard about Starbuck and Terran, and hurried to the third floor lounge. On my... Galactic Scooter here, of course!\nPhoenix:\nWhy do you keep calling it \"Galactic\"? Does it have something to do with space?\nCosmos:\nOf course! It's specifically designed to be used on galactic battleships!\nPhoenix:\nI-I see. Then I take it it works in zero-G, too?\nCosmos:\nSadly, no. With the current state of technology as it is... ...I'm afraid it would just float about and be galactically useless...\nPhoenix:\n(Well, that's a galactic bummer...)\nJudge:\nI see. So you rushed to the boarding lounge on your space-age pogo stick. And when you got to the scene, what did you see?Cosmos:\nWe went via the Control Room and peeked in from there to see what was going on inside.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nLet's see. According to this diagram... ...you didn't have to go through the Control Room to get to Boarding Lounge 1. It looks like you could have gone there from the southern corridor as well.\nCosmos:\nYes, but in her haste, Detective Arme rushed ahead of me towards the Control Room. All I could do was merely follow behind her.\nPhoenix:\nI see...\nCosmos:\nSo we peeked into the boarding lounge from the Control Room door and...Cosmos:\nWe saw a figure standing in the middle of the lounge, and Terran lying on the floor.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo you couldn't see who that figure was clearly or what they were doing?\nCosmos:\nSadly, the only thing I could tell was that it was a person, standing motionless.\nBlackquill:\nThe defendant, no doubt, staring aghast at his deed. What other explanation is there?\nPhoenix:\n(Argh! I'm so close, but without evidence, I can't prove that person's the third party!)\nCosmos:\n............I don't relish in this... and...Cosmos:\nI hate to say it, but I can only imagine the standing figure mast have been Starbuck.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAura Blackquill also saw a suspicious figure in the lounge. But she gave the statement that it was too dark to see the person's face clearly. Did you see this figure's face clearly?\nCosmos:\n...No, not clearly. The lighter they were holding illuminated the area around their feet at the time. But other than that, I could see little else. That's why I could see Terran, but I couldn't see who the other person was.\nPhoenix:\nSo, for all you know, it might NOT have been Mr. Starbuck, isn't that correct?!\nCosmos:\nI would like to believe that. Starbuck isn't the type of man who's capable of murder.\nBlackquill:\n\nBlackquill:\nWhen the witness entered the boarding lounge, there was no third person there. Isn't that correct, great Space Center Director?\nCosmos:\nY-Yes, that's right... Only Starbuck and Terran were there by that time. After we peeked in, the lounge suddenly went dark and the figure vanished.\nPhoenix:\nYou mean they disappeared? That's odd.\nBlackquill:\n\nBlackquill:\n...The reason the figure appeared to vanish is because it was the defendant. When the witnesses weren't looking, he fell to the floor and feigned unconsciousness.\nPhoenix:\n\nPhoenix:\nHold on. Director Cosmos, did you ever take your eyes off of the scene?\nCosmos:\nJust for a brief instant, about as long as it takes for a shooting star to go by.\nPhoenix:\nIf you took your eyes off the scene... ...then this third person could have escaped during that time!\nJudge:\nBut what escape route could this person have used?\nPhoenix:\nThe direction opposite the control room: the southern door to the elevators. There's no security lock on that door, so it would've been possible to escape that way.\nBlackquill:\n\nBlackquill:\nAll things are possible, Wright-dono... The real question is... do you have any proof?\nPhoenix:\nUh, well...\nBlackquill:\nIf we're just talking \"possibilities,\" we could each profess whatever we'd like. An inmate who used to be a university professor and lunar researcher used to say... ...that there is a kingdom of little green men who live under the surface of the moon.\nPhoenix:\n(As long as they don't punish us in the name of said moon for what we've done to it...)\nBlackquill:\nBut I say, where's your proof that this quaint kingdom exists?\nAthena:\nHe's calling your theory a work of fiction, Boss.\nPhoenix:\n(And he's right. I don't have any proof yet. Still... The southern door was a possible escape route. I'd better make a mental note of that.) Director Cosmos, may I ask you a question?\nCosmos:\nYes?\nPhoenix:\nWhy did you look away from the boarding lounge?\nCosmos:\nHa ha ha! There's actually another tale of bravery behind the answer to that. It was when Detective Arme saw the figure and raised her gun. Being a great humanitarian and protector of mankind, I tried to stop her!\nPhoenix:\nWhat? You're saying Detective Arme raised her gun as soon as she saw the figure?\nCosmos:\n............I imagine her instincts as a detective told her they were the killer.\nPhoenix:\n(Hmm... I don't know about that...) And were you able to prevent Detective Arme from firing her gun?\nCosmos:\nI'm afraid I was too late. I was unable to stop her. She identified herself clearly, and then... She fired two warning shots at the shadowy figure!\nJudge:\nHmm... This information about Detective Arme's actions sounds critically important. Please add it to your testimony.\nAdds statement \"Detective Arme fired two warning shots at the figure.\"Press (subsequent times)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAura Blackquill also saw a suspicious figure in the lounge. But she gave the statement that it was too dark to see the person's face clearly. Did you see this figure's face clearly?\nCosmos:\n...No, not clearly. The lighter they were holding illuminated the area around their feet at the time. But other than that, I could see little else. That's why I could see Terran, but I couldn't see who the other person was.\nPhoenix:\nSo, for all you know, it might NOT have been Mr. Starbuck, isn't that correct?!\nCosmos:\nI would like to believe that. Starbuck isn't the type of man who's capable of murder.\nBlackquill:\n\nBlackquill:\nWhen the witness entered the boarding lounge, there was no third person there. Isn't that correct, great Space Center Director?\nCosmos:\nY-Yes, that's right... Only Starbuck and Terran were there by that time. After we peeked in, the lounge suddenly went dark and the figure vanished.\nPhoenix:\nYou mean they disappeared? That's odd.\nBlackquill:\n\nBlackquill:\n...The reason the figure appeared to vanish is because it was the defendant. When the witnesses weren't looking, he fell to the floor and feigned unconsciousness.\nPhoenix:\n\nPhoenix:\nHold on. Director Cosmos, did you ever take your eyes off of the scene?\nCosmos:\nJust for a brief instant, about as long as it takes for a shooting star to go by.\nPhoenix:\nIf you took your eyes off the scene... ...then this third person could have escaped during that time!\nJudge:\nBut what escape route could this person have used?\nPhoenix:\nThe direction opposite the control room: the southern door to the elevators. There's no security lock on that door, so it would've been possible to escape that way.\nBlackquill:\n\nBlackquill:\nAll things are possible, Wright-dono... The real question is... do you have any proof?\nPhoenix:\nUh, well...\nBlackquill:\nIf we're just talking \"possibilities,\" we could each profess whatever we'd like. An inmate who used to be a university professor and lunar researcher used to say... ...that there is a kingdom of little green men who live under the surface of the moon.\nPhoenix:\n(As long as they don't punish us in the name of said moon for what we've done to it...)\nBlackquill:\nBut I say, where's your proof that this quaint kingdom exists?\nAthena:\nHe's calling your theory a work of fiction, Boss.\nPhoenix:\n(And he's right. I don't have any proof yet. Still... The southern door was a possible escape route. I'd better make a mental note of that.) Director Cosmos, may I ask you a question?\nCosmos:\nYes?\nPhoenix:\nWhy did you look away from the boarding lounge?\nCosmos:\nHa ha ha! There's actually another tale of bravery behind the answer to that. It was when Detective Arme saw the figure and raised her gun. Being a great humanitarian and protector of mankind, I tried to stop her!\nPhoenix:\nWhat? You're saying Detective Arme raised her gun as soon as she saw the figure?\nCosmos:\n............I imagine her instincts as a detective told her they were the killer.\nPhoenix:\n(Hmm... I don't know about that...) And were you able to prevent Detective Arme from firing her gun?\nCosmos:\nI'm afraid I was too late. I was unable to stop her. She identified herself clearly, and then...Cosmos:\nDetective Arme fired two warning shots at the figure.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAnd neither of these two shots hit the culprit?\nCosmos:\nThat is correct. The detective appears to have missed on purpose.\nPhoenix:\n(Hmm... But did she really? There's something about this that bothers me...)Present Bullet Hole\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Are you sure you were really paying attention to what Detective Arme was doing?\"Before pressing fourth statement\n\n\n\n\n\n\n\nPhoenix:\n(Mr. Starbuck isn't the killer. And if that's true, then there must be a false statement in the director's testimony.)\nAthena:\nLet's press his statements and draw the truth out of him!After pressing fourth statement\n\n\n\n\n\n\n\nPhoenix:\n(So Detective Arme fired two warning shots, did she? That's the first time that info has come out. Wonder if I can find any inconsistencies?)"
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "Detective Arme and I rushed to the Control Room together.",
          "person": "Cosmos",
          "present": []
        },
        {
          "testimony": "In the lounge, we saw a figure standing in the middle of the room, and Terran on the floor.",
          "person": "Cosmos",
          "present": []
        },
        {
          "testimony": "We were still in the Control Room to the east when the figure fired at us!",
          "person": "Cosmos",
          "present": [
            "Bullet"
          ],
          "source": {
            "evidence_span": "Discovered in a gutter that runs along the south wall of the boarding lounge.",
            "testimony_span": [
              "In the lounge, we saw a figure standing in the middle of the room",
              "We were still in the Control Room to the east when the figure fired at us!"
            ],
            "explanation": "If the figure fired at the witness to the east, the bullet should have hit the east wall, not the south wall.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Cosmos describes the scene of the crime.",
      "labels": [
        "spatial",
        "causal"
      ],
      "reasoning": [
        "Fact 1: The witness claims the figure was in the middle of the room.",
        "Fact 2: The witness also claims the figure fired at them to the east.",
        "Fact 2: The evidence suggests the bullet was found in the south wall.",
        "Prop 1: If a person fired from the middle of a room to the east, the bullet should hit the east wall, not the south wall."
      ],
      "newContext": "-- What I Saw at the Scene --Cosmos:\nDetective Arme and I rushed towards the boarding lounge together.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhere were you coming from?\nCosmos:\nThe sixth floor. We were making sure any stragglers made their way to the fourth floor. It was then we heard about Starbuck and Terran, and hurried to the third floor lounge. On my... Galactic Scooter here, of course!\nPhoenix:\nWhy do you keep calling it \"Galactic\"? Does it have something to do with space?\nCosmos:\nOf course! It's specifically designed to be used on galactic battleships!\nPhoenix:\nI-I see. Then I take it it works in zero-G, too?\nCosmos:\nSadly, no. With the current state of technology as it is... ...I'm afraid it would just float about and be galactically useless...\nPhoenix:\n(Well, that's a galactic bummer...)\nJudge:\nI see. So you rushed to the boarding lounge on your space-age pogo stick. And when you got to the scene, what did you see?Cosmos:\nWe went via the Control Room and peeked in from there to see what was going on inside.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nLet's see. According to this diagram... ...you didn't have to go through the Control Room to get to Boarding Lounge 1. It looks like you could have gone there from the southern corridor as well.\nCosmos:\nYes, but in her haste, Detective Arme rushed ahead of me towards the Control Room. All I could do was merely follow behind her.\nPhoenix:\nI see...\nCosmos:\nSo we peeked into the boarding lounge from the Control Room door and...Cosmos:\nWe saw a figure standing in the middle of the lounge, and Terran lying on the floor.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo you couldn't see who that figure was clearly or what they were doing?\nCosmos:\nSadly, the only thing I could tell was that it was a person, standing motionless.\nBlackquill:\nThe defendant, no doubt, staring aghast at his deed. What other explanation is there?\nPhoenix:\n(Argh! I'm so close, but without evidence, I can't prove that person's the third party!)\nCosmos:\n............I don't relish in this... and...Cosmos:\nI hate to say it, but I can only imagine the standing figure mast have been Starbuck.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAura Blackquill also saw a suspicious figure in the lounge. But she gave the statement that it was too dark to see the person's face clearly. Did you see this figure's face clearly?\nCosmos:\n...No, not clearly. The lighter they were holding illuminated the area around their feet at the time. But other than that, I could see little else. That's why I could see Terran, but I couldn't see who the other person was.\nPhoenix:\nSo, for all you know, it might NOT have been Mr. Starbuck, isn't that correct?!\nCosmos:\nI would like to believe that. Starbuck isn't the type of man who's capable of murder.\nBlackquill:\n\nBlackquill:\nWhen the witness entered the boarding lounge, there was no third person there. Isn't that correct, great Space Center Director?\nCosmos:\nY-Yes, that's right... Only Starbuck and Terran were there by that time. After we peeked in, the lounge suddenly went dark and the figure vanished.\nPhoenix:\nYou mean they disappeared? That's odd.\nBlackquill:\n\nBlackquill:\n...The reason the figure appeared to vanish is because it was the defendant. When the witnesses weren't looking, he fell to the floor and feigned unconsciousness.\nPhoenix:\n\nPhoenix:\nHold on. Director Cosmos, did you ever take your eyes off of the scene?\nCosmos:\nJust for a brief instant, about as long as it takes for a shooting star to go by.\nPhoenix:\nIf you took your eyes off the scene... ...then this third person could have escaped during that time!\nJudge:\nBut what escape route could this person have used?\nPhoenix:\nThe direction opposite the control room: the southern door to the elevators. There's no security lock on that door, so it would've been possible to escape that way.\nBlackquill:\n\nBlackquill:\nAll things are possible, Wright-dono... The real question is... do you have any proof?\nPhoenix:\nUh, well...\nBlackquill:\nIf we're just talking \"possibilities,\" we could each profess whatever we'd like. An inmate who used to be a university professor and lunar researcher used to say... ...that there is a kingdom of little green men who live under the surface of the moon.\nPhoenix:\n(As long as they don't punish us in the name of said moon for what we've done to it...)\nBlackquill:\nBut I say, where's your proof that this quaint kingdom exists?\nAthena:\nHe's calling your theory a work of fiction, Boss.\nPhoenix:\n(And he's right. I don't have any proof yet. Still... The southern door was a possible escape route. I'd better make a mental note of that.) Director Cosmos, may I ask you a question?\nCosmos:\nYes?\nPhoenix:\nWhy did you look away from the boarding lounge?\nCosmos:\nHa ha ha! There's actually another tale of bravery behind the answer to that. It was when Detective Arme saw the figure and raised her gun. Being a great humanitarian and protector of mankind, I tried to stop her!\nPhoenix:\nWhat? You're saying Detective Arme raised her gun as soon as she saw the figure?\nCosmos:\n............I imagine her instincts as a detective told her they were the killer.\nPhoenix:\n(Hmm... I don't know about that...) And were you able to prevent Detective Arme from firing her gun?\nCosmos:\nI'm afraid I was too late. I was unable to stop her. She identified herself clearly, and then... She fired two warning shots at the shadowy figure!\nJudge:\nHmm... This information about Detective Arme's actions sounds critically important. Please add it to your testimony.\nAdds statement \"Detective Arme fired two warning shots at the figure.\"Press (subsequent times)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAura Blackquill also saw a suspicious figure in the lounge. But she gave the statement that it was too dark to see the person's face clearly. Did you see this figure's face clearly?\nCosmos:\n...No, not clearly. The lighter they were holding illuminated the area around their feet at the time. But other than that, I could see little else. That's why I could see Terran, but I couldn't see who the other person was.\nPhoenix:\nSo, for all you know, it might NOT have been Mr. Starbuck, isn't that correct?!\nCosmos:\nI would like to believe that. Starbuck isn't the type of man who's capable of murder.\nBlackquill:\n\nBlackquill:\nWhen the witness entered the boarding lounge, there was no third person there. Isn't that correct, great Space Center Director?\nCosmos:\nY-Yes, that's right... Only Starbuck and Terran were there by that time. After we peeked in, the lounge suddenly went dark and the figure vanished.\nPhoenix:\nYou mean they disappeared? That's odd.\nBlackquill:\n\nBlackquill:\n...The reason the figure appeared to vanish is because it was the defendant. When the witnesses weren't looking, he fell to the floor and feigned unconsciousness.\nPhoenix:\n\nPhoenix:\nHold on. Director Cosmos, did you ever take your eyes off of the scene?\nCosmos:\nJust for a brief instant, about as long as it takes for a shooting star to go by.\nPhoenix:\nIf you took your eyes off the scene... ...then this third person could have escaped during that time!\nJudge:\nBut what escape route could this person have used?\nPhoenix:\nThe direction opposite the control room: the southern door to the elevators. There's no security lock on that door, so it would've been possible to escape that way.\nBlackquill:\n\nBlackquill:\nAll things are possible, Wright-dono... The real question is... do you have any proof?\nPhoenix:\nUh, well...\nBlackquill:\nIf we're just talking \"possibilities,\" we could each profess whatever we'd like. An inmate who used to be a university professor and lunar researcher used to say... ...that there is a kingdom of little green men who live under the surface of the moon.\nPhoenix:\n(As long as they don't punish us in the name of said moon for what we've done to it...)\nBlackquill:\nBut I say, where's your proof that this quaint kingdom exists?\nAthena:\nHe's calling your theory a work of fiction, Boss.\nPhoenix:\n(And he's right. I don't have any proof yet. Still... The southern door was a possible escape route. I'd better make a mental note of that.) Director Cosmos, may I ask you a question?\nCosmos:\nYes?\nPhoenix:\nWhy did you look away from the boarding lounge?\nCosmos:\nHa ha ha! There's actually another tale of bravery behind the answer to that. It was when Detective Arme saw the figure and raised her gun. Being a great humanitarian and protector of mankind, I tried to stop her!\nPhoenix:\nWhat? You're saying Detective Arme raised her gun as soon as she saw the figure?\nCosmos:\n............I imagine her instincts as a detective told her they were the killer.\nPhoenix:\n(Hmm... I don't know about that...) And were you able to prevent Detective Arme from firing her gun?\nCosmos:\nI'm afraid I was too late. I was unable to stop her. She identified herself clearly, and then...Cosmos:\nDetective Arme fired two warning shots at the figure.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAnd neither of these two shots hit the culprit?\nCosmos:\nThat is correct. The detective appears to have missed on purpose.\nPhoenix:\n(Hmm... But did she really? There's something about this that bothers me...)Present Bullet Hole\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Are you sure you were really paying attention to what Detective Arme was doing?\"Before pressing fourth statement\n\n\n\n\n\n\n\nPhoenix:\n(Mr. Starbuck isn't the killer. And if that's true, then there must be a false statement in the director's testimony.)\nAthena:\nLet's press his statements and draw the truth out of him!After pressing fourth statement\n\n\n\n\n\n\n\nPhoenix:\n(So Detective Arme fired two warning shots, did she? That's the first time that info has come out. Wonder if I can find any inconsistencies?)Phoenix:\nAre you sure you were really paying attention to what Detective Arme was doing?Cosmos:\nYou doubt my words, words that will someday be written down in history books?!Phoenix:\nSomehow, I don't think that those exact words... ...will ever be written down in any history books.Judge:\nMr. Wright, could you please explain yourself so that we can all understand?Phoenix:\nYou say that Detective Arme fired two warning shots... ...and yet, only one bullet hole was ever found at the scene.Cosmos:\nWhat...?Phoenix:\nOnly one bullet hole means the gun was only fired once. And yet Director Cosmos is saying Detective Arme fired two shots. No editor would allow such a glaring contradiction into a history book!Blackquill:Blackquill:\nUnfortunately for you, the witness's words are true. We confirmed that two shots were fired from Detective Arme's gun.Phoenix:Phoenix:\nBut there was only one bullet hole at the scene! Where did the other bullet hole vanish to?! Aaaaaaaaaaaaagh!Blackquill:\n...You should know the answer to that already.Phoenix:\nI should?Blackquill:\nDuring the previous trial, a certain oxygen tank was presented as evidence. We've already discussed that it was ruptured in the lounge, have we not? Well, it appears that the thing that ruptured it was a bullet. A bullet that was found near the tank, to be precise. This bullet was fired from a .38-caliber gun, the same caliber as the detective's gun.Phoenix:\nWHAT?!Oxygen Tank Data updated in the Court Record.Blackquill:\nThe rifling marks also match up. There's no question that the bullet was fired from Detective Arme's gun.Bullet from Arme's Gun added to the Court Record.Judge:\n\"Rifling marks\"... They're like a gun's fingerprints on a bullet, correct? And examining the rifling marks on a bullet can tell us the gun it was fired from?Blackquill:\nOne of the bullets the detective fired found its way into the holographic image display. The other bullet came to a stop near the victim's oxygen tank. The evidence confirms the director's statement that the detective fired two shots.Phoenix:\n(My beautiful contradiction... Gone... All gone...)Athena:\nSo that bullet hole was from a .38-caliber, huh? I'd better update the record.Judge:\nVery good. Now we know the fate of both of the shots Detective Arme fired. Mr. Wright, does that clear up all of your questions...?Phoenix:\n(Hmm............ Detective Arme fired two warning shots... One hit the holographic display and the other hit the oxygen tank... Does that really clear up everything about what happened at the scene?)No, it doesn't\n\n\n\n\n\n\n\nLeads to:\n\"No, Your Honor, it doesn't!\"Yes, it does\n\n\n\n\n\n\n\nPhoenix:\nYes, I guess it does, Your Honor. (At least, I think so... But there's still something nagging at me...) Um, actually... can I change my mind on that, Your Honor...?\nJudge:\n............You may, but only after you take responsibility for your first choice.\nPhoenix:\n(I'd better think this one through again...)\nLeads back to:\n\"Hmm............ Detective Arme fired two warning shots...\"Phoenix:\nNo, Your Honor, it doesn't! \"Detective Arme fired two warning shots from a .38-caliber gun.\" But that doesn't explain the existence of a certain piece of evidence found at the scene. A piece... that points to the existence of a third person.Blackquill:\nOh...?Judge:\nVery well. But it won't do to keep us waiting, Mr. Wright. What piece of evidence suggests the possibility of a third person at the scene?Present Bullet\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"And what is this metal pellet supposed to be?!\"Present anything else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nDon't you think that this piece of evidence seems incongruous?\nJudge:\nNo, I don't think that at all.\nPhoenix:\nNot even just an eensy-weensy bit?\nJudge:\nNo. What does seem incongruous to me, Mr. Wright, is your claim!\nPhoenix:\n(Urk... Looks like it wasn't this piece of evidence after all...) Your Honor! Please let me give it a little more thought!\nLeads back to:\n\"Very well. But it won't do to keep us waiting, Mr. Wright.\"Judge:\nAnd what is this metal pellet supposed to be?!Phoenix:\nJust a little something of great importance we found at the crime scene, Your Honor.Blackquill:\nYou found it where?Phoenix:\nIn a floor gutter at the crime scene. It looks like the police and prosecution both missed it. Furthermore, this is a .10-caliber bullet... ...making it much smaller than one of Detective Arme's .38-calibers.Judge:\nTh-Then that means...!Phoenix:\nExactly. One more person must have been there in the lounge. A third person who had a gun that could fire .10-caliber bullets!Cosmos:\nGrnk!Phoenix:\nAnd if that's true, it explains why Detective Arme fired warning shots. This third person fired at Detective Arme and Director Cosmos with their gun. And in return, the detective fired her warning shots. Isn't that how it really went down, Director Cosmos?Cosmos:\nHa ha ha! It looks like you've deduced my miraculous tale of survival! Yes, you're absolutely correct. The mystery person fired upon us!Judge:\nWh-What's this, now?!Blackquill:\nWhat? You never breathed a word of any of this to me before...Cosmos:\nHa ha ha! Well, all great men have a secret or two, don't you know!Blackquill:\n.........Tsk. Foolish old geezer.Phoenix:\n(So Director Cosmos really has been hiding the presence of a third person all along?) Director Cosmos! I want you to testify to the court about what you really saw!Judge:\nYou may be a very great man, but, in my courtroom, you are just another witness. You won't receive special treatment here. Now, please give accurate testimony!Witness Testimony-- What I Really Saw at the Scene --Cosmos:\nDetective Arme and I rushed to the Control Room together.\nIn the lounge, we saw a figure standing in the middle of the room, and Terran on the floor.\nWe were still in the Control Room to the east when the figure fired at us!Judge:\nHmm... Given that there was no third person in the lounge when the witness entered it... ...does this mean the person who fired the gun had to have been the defendant...?Phoenix:\nNot necessarily. It's still possible that it was someone else. Most likely, as soon as Detective Arme and Director Cosmos discovered this person... ...they escaped through the southern door, the one that didn't have a security lock.Blackquill:Blackquill:\nDouble-edged swords are a tricky lot. Mishandle one and it is you who is cut down.Phoenix:\nHuh?Blackquill:\nYour reasoning could apply if Space Boy were the killer as well. Think about it. After being discovered, he could have fired the .10-caliber gun. Detective Arme would've responded by firing two warning shots. All he had to do was feign unconsciousness to invent the possibility of a third person.Phoenix:Phoenix:\nBut Mr. Starbuck didn't have a gun in his possession when he was found by the police! Nor has a gun been found at the crime scene. Its absence can only be explained if there was a third party who took it with them.Blackquill:Blackquill:\nRecall the existence of a trash chute in the boarding lounge. The defendant could have simply thrown the gun down the chute.Phoenix:Phoenix:\nBut you can't deny the possibility of a third person leaving with the weapon!Blackquill:Blackquill:\nIt's up to you to prove that possibility. And I trust you haven't forgotten my little piece of decisive evidence?Phoenix:\nWhat evidence?Blackquill:\nWhy, the detonator switch that was found in Mr. Starbuck's pocket, naturally. The most compelling evidence of all that tells us he is the culprit.Phoenix:\nAaaaaaaaaaaaagh! (I-I DID forget all about that!)Blackquill:\nLook, Your Baldness, how deliciously obvious it is that they lack the evidence to rival mine.Athena:\nWow, he sliced our third person theory to ribbons and served it to us, just like that...Judge:\nYes, well, I have a question of my own, actually... That bullet that the mysterious figure shot... What did it hit exactly?Cosmos:\n............It hit me.Judge:\nS-So does that mean you're a-a-a-a gh-ghost?!Blackquill:\nI was wondering when you would realize it, Your Baldness. Director Cosmos is an authentic, bona fide ghost. He can even pass through walls.Judge:\nEeeeeeeeeeek!Athena:Athena:\nProsecutor Blackquill! Shame on you for teasing the nice old gentleman!Blackquill:\n...Hmph. Your Baldness, it was all in jest. Please show yourself again.Judge:\nA-Are you sure...? I-In that case... How did you manage to survive being shot, Director Cosmos?Cosmos:\nHa ha ha! I'm glad you asked! It was a miracle! A miracle befitting a great, history-making figure such as myself! The bullet hit my glorious medal of honor, whereby it ricocheted, thus saving my life!Judge:\nWHAAAAAAAT?!Phoenix:\nTh-That's unbelievable...Athena:\nI have to check this out! .........Oh, wow. Look at that. There's one extra GYAXA star...Phoenix:\nThe odds are literally astronomical... (I guess it really was a miracle...)Athena:\nIt's beginning to feel like the cosmos is watching out for Director Cosmos.Judge:\nBut why did you conceal this information, Director Cosmos?Cosmos:\nA great man such as myself has to hide things on occasion, no matter how much it hurts. It is the plight of the truly great! It may be hard for this generation to understand...Athena:\nI don't know, but it sounds fishy to me. What else is he hiding?Phoenix:\n...Let's just cross-examine him and see what we can find out.Judge:\nNow then, Mr. Wright. Your cross-examination, please.Cross ExaminationCross Examination-- What I Really Saw at the Scene --Cosmos:\nDetective Arme and I rushed to the Control Room together.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWe've already heard all about that part. Don't you have any new information?\nCosmos:\nWell... Let me see... ...If you have an hour or two, I could tell you all about the HAT-1 Miracle!\nPhoenix:\n\nPhoenix:\nWe already know all about that, too! Tell us about something related to this incident!\nCosmos:\nHmm... I see.... You want to know about incidents. ...Well then, let me tell you about... the many incidents that made me the man I am today! Yes, if you have the time, I will tell you all about the upbringing of this great man!\nPhoenix:\n\nPhoenix:\nYou've told us all about that already as well! What we need now is your testimony!\nCosmos:\n............Hmm? Did I really already tell you all about my upbringing? I don't recall doing so...\nJudge:\nDirector Cosmos, perhaps you could save your boastful tales for later.\nCosmos:\nIf I must. Well, we peeked in through the Control Room door and...Cosmos:\nIn the lounge, we saw a figure standing in the middle of the room, and Terran on the floor.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nBut it was so dark, you couldn't see this figure's face, isn't that right?\nCosmos:\nYes, the room was as deep and dark as outer space itself. Speaking of outer space, during the HAT-1 launch seven years ago--\nBlackquill:\nIf it's about that \"HAT-1 Miracle\" again, you can sod off and tell it to a stray mutt.\nCosmos:\nHa ha ha! Excellent idea! No reason why the animal world shouldn't hear of my greatness!\nBlackquill:\n...And so they shall. But first, your testimony. What happened next?Cosmos:\nWe were still in the Control Room to the east when the figure fired at us!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo, in other words... ...you were fired at while you were at the Control Room door.\nCosmos:\nThat is correct.\nPhoenix:\n(There's something not quite right about that...) Director Cosmos, the bullet this person fired hit you, isn't that right?\nCosmos:\nYes, it was a miracle! A miracle befitting a great, history-making figure such as myself! The bullet the figure fired hit me while I was in the Control Room. But as the cosmos would have it, the bullet bounced off my glorious medal of honor!\nPhoenix:\n(In that case, the bullet should've wound up somewhere around the Control Room door.)Present Bullet\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Director Cosmos, I believe you are telling this great court a glorious lie!\"Athena:\nOkay, so Director Cosmos was in the Control Room to the east.Phoenix:\nAnd while he was there, he was shot at by someone with a .10-caliber gun.Athena:\nBut the bullet hit his medal, so he was able to escape with his life. He's a very lucky man. No wonder people think he's great.Phoenix:\n(Hey, I'm pretty lucky myself, so if he's a great man, then I'm the king of all the cosmos!)"
    }
  ]
}