{
  "previousContext": "Episode II\nThe Memoirs of the Clouded Kokoro\nAnime cutscene\nIt was a ghastly tale of a winter's night - one of an invisible killer and a crime perpetrated on the pavement along Briar Road. As the victim lay at death's door, thy mystery of just who had stabbed the young lady from behind had been resolved. But no sooner had my friend saved that Eastern exchange student from his harrowing plight, than in the dim, flickering shadows of gaslight did a second bizarre crime rend the stillness of that very night. I daresay most can still recall the sensational headlines of the day. 'Haunted Apartment of Death' 'The Condemned Criminal's Curse' 'The Dread Demon of Coal Gas' Yet, though the great detective had at once discerned the truth upon his arrival at the scene, it only proved to be the overture that announced the rising of the curtain on a most tragic play.\nMy name is Ryunosuke Naruhodo. I'm a fledgling lawyer, just starting out on my journey. Six months ago, I arrived as a visiting student of law... ...having made the long voyage across the sea from the Empire of Japan to here...London, England. And on the way, in quite extraordinary circumstances, I made the acquaintance of a world-famous detective. Currently, I reside in the attic of the detective's own lodgings, from where I run my legal consultancy of sorts. I've successfully defended a number of clients in Britain's highest court, the Old Bailey. But since a particularly gruelling and unforgettable legal battle four months ago now... ...I haven't returned to the courtroom. In truth, I lost my right to return. But that epic trial was just part of an epic tale. A tale which was now about to awaken from slumber... ...thanks to a letter that arrived this morning from my homeland...\n*Ruuumble*\nRyunosuke:\n......... (Mmm, what a delicious smell wafting up the stairs... It must be nearly time for breakfast. I'd better go down to Mr Sholmes's suite... ...and say good morning to the great detective and his flatmate.)\n30th August, 7:28 a.m.\nSholmes's Suite\nIris:\nAh, Runo, good! I was just about to call up to you. The bacon's ready.\nRyunosuke:\nGood morning, Iris. It smells delicious as usual. Before we eat, though, I have some news. I had a surprise this morning-\nSholmes:\nShh! Not another word, Mr Naruhodo! This could be just the abstruse thing for my pre-breakfast stagnation-repelling mental stimulation, my dear fellow.\nRyunosuke:\n'Morning' to you too, Mr Sholmes.\nSholmes:\nAh...yes...I see... So that's it... The truth is as clear to me as day. My faculties of observation have revealed it again.\nRyunosuke:\nWh-What are you talking about?\nSholmes:\nYou, Mr Naruhodo. You have, this very morning, met with a surprise! ...Well? Is that not the case?\nRyunosuke:\nUm...\nSholmes:\nReally, my dear fellow, it barely warrants explanation. Firstly, your hair is particularly unkempt. Somewhat reminiscent of a bird's nest. Secondly, you have neglected to fasten the third button of your jacket. Clearly, when considered together, these two facts point to you having been flustered this morning.\nRyunosuke:\n......... Can I talk now?\nSholmes:\nBut of course, of course! Though I don't look for admiration, you understand.\nRyunosuke:\nMy hair always looks like this. It's been this way since I first met you.\nSholmes:\nOh. It has?\nRyunosuke:\nAnd the button...was ripped off last night, if you remember? ...By you.\nIris:\nHurley pulled your button off?\nSholmes:\n......... Ah yes, I recall the incident now. It was after supper, was it not? As the evening advanced, I picked up my violin and began to play the wailing notes of a haunting tune. But then, to my utter dismay, the third string snapped! Why did it have to happen? WHY?! Little wonder then, that in my vexation, I grabbed the first button I saw and ripped it from its proper place!\nRyunosuke:\n...Well, I'd like it back now, please. It's troubling me that I can't fasten my jacket.\nSholmes:\nAnd it's troubling me that you expect me to know where it is! Somewhere thereabouts on the floor, one presumes.\nRyunosuke:\n(Helpful.)\nSholmes:\nWhat matters at the present time, my dear fellow, is simply whether or not my deduction was unerring.\nIris:\nBut Hurley, Runo said it when he came in, didn't he? 'I had a surprise this morning.'\nSholmes:\n......... Ah ha ha ha ha hah! Well, that really is a surprise!\nRyunosuke:\n(Yes, this man is the pride of the British Empire. The famous consulting detective, Mr Herlock Sholmes. There can't be a single person in the world who doesn't know his name.)\nIris:\nAlright then, enough of this silly conversation. Come and eat this bacon before it goes cold. And I have a new herbal tea for you to try, too! My latest special blend!\nRyunosuke:\n(And here we have Iris Wilson, Mr Sholmes's lodger and companion. A truly exceptional young girl, who's the author of a highly successful serialisation here in London. Yes, 'The Adventures of Herlock Sholmes' as published in Randst Magazine.)\nSholmes:\nSo, Mr Naruhodo, won't you put us out of our misery? What surprised you this fine morning?\nRyunosuke:\nAh, well, I received a letter...from Japan.\nIris:\nOh! From Susie, you mean?! Was it? Really?\nRyunosuke:\nThat's right. And she had some rather startling news, in fact.\nSholmes:\nAh... intriguing indeed. You must tell us all about it over breakfast!\nIris:\nOh yes! What fun!\nAfter clearing all Converse options:\nRyunosuke:\nSummoning her back to Japan so suddenly like that... I wonder what Miss Susato's father is hiding.\nIris:\nHmmm... Hurley, do you know what it's all about?\nSholmes:\n...Hm? Ah, well, who can say?\nRyunosuke:\nWhat? But, but you said...\nSholmes:\nPlease, I have engagements, my dear fellow! My calendar is quite surprisingly full today. And a stringent analysis of the matter would be excessive, I feel. Even if I were quite at leisure. So! Man the fort in my absence, won't you, Iris?\nIris:\nI will, Hurley, don't worry. See you later!\nRyunosuke:\n(He scuttled off rather quickly there... I think perhaps Professor Mikotoba isn't the only person hiding something here. Soseki-san was involved in two cases, but only one of them was forbidden from being published. By, of all people...Mr Sholmes.)\nIris:\nAh-ha! I've found them at last!\nRyunosuke:\nIris! Are, are they...?\nIris:\nThe notes about the case? That's right. Susie and I compiled them together. 'The Case of the Haunted Lodgings'... Do you want to read them, Runo?\nRyunosuke:\n......... Absolutely. Thank you, Iris. I have no idea what secrets could still be hiding in the shadows of this case... ...but perhaps if I read over the notes again, something might come to light.\nIris:\nThat's the spirit!\nAnd so... ...Iris and I decided to read over the case notes again together. Everything from what happened, to our investigation and that fierce battle in court that followed. Reliving every detail... I just need to find a clue. And I have all the time in the world. Because of course... ...I'm no longer allowed to practise law in the courts of Great Britain.\nIt was six months ago... A mysterious incident that unfolded on the wintry streets of London. A young woman was found lying on the snowy pavement of Briar Road with a knife in her back. Fortunately, her life was spared, but she was unconscious for several days following the incident. The fog was thick, and nobody saw her attacker, but... ...by a cruel twist of fate, a visiting Japanese student was walking behind her at the time, and was duly arrested. That man was Soseki-san. And the man who effected his arrest...was Mr Sholmes. Believing in our compatriot's innocence, Susato-san and I decided to represent Soseki-san in court. And, after a gruelling trial of many twists and turns, we finally managed to prove his innocence.\nSoseki:\nJoyful, Joyous, Jubilant Jubilation!\nRyunosuke:\n...Was the man's reaction after the trial. But his jubilant jubilation was short lived. We received a telegram from Mr Sholmes the following morning. 'The victim of the Briar Road stabbing has regained consciousness. Hurry to Barts at once!' So Susato-san and I summoned a hansom and headed immediately to the hospital.\nBefore clearing all Converse options in Sholmes's Suite:\n30th August\nNaruhodo's Legal Consultancy\n21st February, 5:30 a.m.\nSt Bartholomew's Hospital, Recovery Ward\nSholmes:\nThere you are at last!\nRyunosuke:\nGood morning, Mr Sholmes.\nSholmes:\nI think not.\nSusato:\nOh!\nSholmes:\nYou're late! What on earth took you so long!\nSusato:\nYour telegram only arrived at five o'clock, Mr Sholmes. And it's a twenty-minute ride to the hospital.\nRyunosuke:\nThat's right, and it's half past five now. I think we made very good time.\nSholmes:\nThe time is utterly irrelevant! The fact is, I have been waiting for what has felt like an eternity.\nRyunosuke:\nHaah...\nSholmes:\nIn point of fact, I myself was awoken at four this morning by a telegram boy. And feeling it was somewhat unjust that I alone had been roused at such an hour, I sent one to you.\nRyunosuke:\n(Well thanks for that.)\nSholmes:\nAnyway, you're here now, so... The victim is over there. She's only just regained consciousness. You should introduce yourselves. And I shall observe from here.\nRyunosuke:\n(So that's the lady who was found on the snow-covered pavement with the knife in her back...)\nSusato:\nHer name is... Ah yes, here we are. Miss Green.\nAfter clearing all Converse options with Olive Green and examining picture frame:\n???:\nIs there a Mr Narrowfodder here? Mr Narrowfoddeeer?!\nRyunosuke:\n('Narrowfodder' now...?) Well, um, if you're looking for Naruhodo, the lawyer, that's me, but...\n???:\nAh! Mr Narrowfodder, good. This is for you. It's a message from a Mr Saucy Nutsmeg.\nRyunosuke:\nMr Natsume?! Sent a message...to me?\nSusato:\nBut why would a policeman be delivering a message from Mr Natsume?\nRyunosuke:\nExactly... (What's going on? What's a Scotland Yard constable doing playing delivery boy at this time in the morning?)\nSholmes:\nArgh, what are you waiting for?! Let me see that!\nRyunosuke:\nOh!\nSholmes:\n......... Well...this is most unexpected...\nRyunosuke:\nIs something wrong, Mr Sholmes?\nSholmes:\n'Is something wrong, Mr Sholmes?' he says! Have you not seen this note?!\nRyunosuke:\nNo, how could I have?!\nSholmes:\nIt would seem that London's criminals have no intention of letting the great detective rest. A new case calls. A case of murder, no less. ...We must depart at once!\nSusato:\nMurder?!\nSholmes:\nCall a cab! Time is of the essence!\nRyunosuke:\nBut...the trouble is... ...we've yet to read Mr Natsume's note. I was thinking we ought to pay him a visit in his lodgings once we did.\nSholmes:\nThat will be entirely convenient.\nSusato:\nConvenient? What do you mean?\nSholmes:\nIt's all here in the note, my dear fellows. The murder we must investigate...took place at Mr Moustache's lodgings!\nRyunosuke:\nWait...WHAT?!\nSusato:\nI'll hail a fiacre at once!\n(It was only yesterday that Soseki-san was in court and we were dispelling doubts about his innocence. And now...the very next day... ...there's a murder at the man's own address? He may very well be the unluckiest man alive.) ...Or so it seemed to us at the time, but we were soon to discover it was worse than we thought.\n21st February\nSholmes's Suite\n21st February, 7:18 a.m.\nMr Natsume's Lodgings, Ground Floor\nRyunosuke:\nWhat on earth...?!\nSusato:\nOh my! The gentleman is deceased, without question! He's dead!\nSoseki:\nL-L-L-Locum Student Mr Naruhodo Esquire!\nRyunosuke:\nMr Natsume!\nSoseki:\nOh...why...? Why is this happening? Why to me? I'VE ONLY JUST GOT OUT OF COURT! YESTERDAY! I WAS FINALLY HOME AFTER TWO DAYS OF MISERY! AND THEN I WAKE UP THE NEXT DAY TO THIS! NO EARLY BIRD SHOULD CATCH A WORM LIKE THIS!\nWOEFUL WORM WITHOUT WIGGLE!\nSholmes:\nI see you're in high spirits again this morning, Mr Moustache.\nSoseki:\nAAAAAAAAAAAAAAARGH!!! Not the horrible HERR LOCK SHOLMES! SHOO! SHOVE OFF! SHOW YOURSELF THE DOOR! I NEVER INVITED YOU!\nSusato:\nMr Sholmes came here with us. I'm quite sure he'll be able to help you, Mr Natsume!\nSholmes:\nI am entirely at your disposal, Mr Moustache. What can I do for you?\nSoseki:\nGRRRRRRRRRRRRRRR!\nGregson:\nTsk, here they are...already. The busybodies.\nSholmes:\nAh, Inspector Gregson. What a pleasant surprise.\nGregson:\nPleasant, is it? Gives me heartburn every time I see your face at a crime scene, Sholmes.\nSholmes:\nHah! I deduce, Inspector...that your heartburn is a result of your excessive consumption of fried food.\nRyunosuke:\nUm...good morning, Inspector.\nGregson:\n.........This is a crime scene! Don't you go touchin' anythin'!\nRyunosuke:\n(Or 'Good morning to you too, sunshine...')\nRyunosuke:\nUm, Mr Sholmes, what are you doing?\nSholmes:\nHah! You need only observe to know it, my dear fellow. Investigating, naturally!\nRyunosuke:\n...There's nothing natural about that pose.\nSusato:\nMr Sholmes! Have you made some miraculous discovery?\nSholmes:\nPatience, my dear madam, patience. We've not been here in this room five minutes. So far, all I've managed to deduce is what actually happened.\nSusato:\nMy goodness! But...isn't that everything we need to know, Mr Sholmes?\nSholmes:\nHm... Now that you propose the idea, I believe one could, indeed, see it that way. At the present time, I have managed to draw two incontrovertible conclusions. The first, that there was a physical struggle here last night in which the victim fought for his life.\nSoseki:\nAAAAAAAAAH!\nSusato:\nAh!\nRyunosuke:\nMr Natsume, what's wrong? Is something that Mr Sholmes said significant somehow?\nSoseki:\nN-No... Don't mind me! Forget I was here!\nSholmes:\nAnd my second conclusion... ...is that there was a poison lingering in the air here last night that passed the victim's lips.\nSoseki:\nN-N-N-NONSENSE!\nSusato:\nAh!\nRyunosuke:\nAlright, Mr Natsume. Why are you reacting so extremely to Mr Sholmes's deductions?\nSoseki:\nN-N-N-No... Please! Pretend I'm not here!\nInvisible, Ineffable, Inscrutable...Insignificant!\nRyunosuke:\n...Impossible to ignore.\nSusato:\nYou must tell us everything, Mr Sholmes! Spare no detail!\nSholmes:\n......... But of course. Let the theatrical tragedy before us be unravelled by my great deductions, presented for your pleasure in two acts!\nRyunosuke:\n(We've heard some truly astounding great deductions from Mr Sholmes in the past... No doubt this will be no exception. What miracles will unfold before our eyes this time?)\nSholmes:\nSo, my dear fellows, for your delight and wonder, let the curtain rise... ...for Herlock Sholmes's 'Logic and Reasoning Spectacular', Act One!\nThe Great Deduction\nThe game is afoot!\nTopic 1\nCause of Death\nSholmes:\nCareful observation of the victim reveals to us the events that transpired in this disconsolate room last night. Foam at the mouth of the deceased clearly indicates the use of poison. Next to the victim, we notice a large dining plate, which contains, you will observe... ...one half of a sizeable bar of soap. Meaningful? Indubitably. Why is this soap set so purposefully upon the dish? Like the victim's last supper, in fact. Yes... Could it be that the man was about to eat it? Of course, the fork reveals the answer. It appears that the young man's appetite was his undoing. Taking up arms in the form of his cutlery, the victim engaged in a deadly battle for his life. Yet the struggle against his hunger was in vain, for in the end, he couldn't resist devouring the slippery feast! But London's foul soap is besmirched by foul poison. Yes, the victim's life was claimed by poison that tainted the contents of the plate! The soap...and the lather about the young man's mouth are too perfectly matched to ignore. The cause of death was clearly intoxication due to excessive ingestion of foul soap! ...Though personally, I have a greater interest in the taste of foul candlewax, of course.\nTopic 1\nCause of Death\nConclusion\nPoisoning from soap ingestion\nTopic 2\nSuicide or Murder?\nSholmes:\nThe cause of death identified, we proceed to Act Two, where we ponder the next question: Was this suicide or murder? The audience will recall that death occurred during the victim's 'last supper'. Did the man dine and die alone? This single teacup suggests the answer. To draw a conclusion on such meagre evidence would be foolish however, certainly. The careful criminal could have absconded with his own cup to cover his tracks. Well, allow me to lift the veil of doubt, my dear fellow. Indeed. What reveals the answer, of course, is the broken lock! Though forced open now, at the time of the incident, this door was locked. And the sole key was in the victim's pocket. In other words, when the victim consumed the poison, he must have been alone. Alone with his inferior soap, from whence wafted an inferior scent. And with that acrid aroma lingering in the air, the victim met his end...in tragic solitude. We can take comfort only in the fact that his soul was well cleansed on its way to the hereafter.\nTopic 2\nSuicide or Murder?\nConclusion\nNo possible perpetrator present\nSholmes:\nThus concludes the final act of Herlock Sholmes's great deduction!\nSusato:\n.........\nGregson:\n.........\nRyunosuke:\n...There's just one thing, Mr Sholmes...\nSholmes:\nYou are disposed to identifying 'just one thing', aren't you, Mr Naruhodo? Pray, what concerns you?\nRyunosuke:\nWell...no matter how hungry he was, do you really think the man would have eaten soap?\nSholmes:\nIt is quite apparent that this man had barely a penny to his name. It is a curious thing, but to one so destitute, soap can suddenly appear quite irresistibly appetising.\nSusato:\nHow extraordinary!\nSholmes:\nIn truth, I have tried a little soap myself in the past.\nRyunosuke:\nYou've eaten it, you mean?!\nSholmes:\nMy dear fellow, it was some time ago now. My postulation was that it would cleanse my gut.\nSusato:\nAnd did it?\nSholmes:\nAs I writhed in agony on the floor and spilt the contents of my stomach...yes, I believe it did. The experience taught me a valuable lesson: soap is quite poisonous. It has an unpleasant taste and leads to great discomfort. In summary, I cannot recommend it.\nRyunosuke:\n(Believe me, I wouldn't eat it even if you did.)\nSusato:\nThere's something that troubles me as well, actually.\nRyunosuke:\nOh? What's that?\nSusato:\nIt's Mr Natsume.\nSoseki:\nAh!\nSusato:\nI couldn't help noticing him shuddering and quivering out of the corner of my eye. Almost as if Mr Sholmes's deductions touched a nerve somehow.\nSoseki:\nN-N-N-N-N-Nonsense...\nRyunosuke:\n(Well, that clenched teeth episode didn't last...)\nSusato:\nI think...judging by Mr Natsume's reaction... ...the great detective's deductions may need some gentle corrections in order to reach the actual truth.\nRyunosuke:\n(Yes, Mr Sholmes's observations and deductions are sometimes a little too sharp... He has a tendency to hit the nail on the side of the head and drive it in at an obtuse angle. When he does that, it falls to us to straighten things out.) Alright then, let's see what we can do.\nSusato:\nYes, we must pick out the key words in Mr Sholmes's quite brilliant deductions... ...and discreetly exchange them for something that makes a little more sense. If we can do that... ...I'm sure we'll arrive at what Mr Sholmes meant to say in the first place!\nSholmes:\nIn that case...are you ready for the second performance of the day? Once again, my dear fellows, for your continued delight and wonder, let the curtain rise... ...for Herlock Sholmes's 'Logic and Reasoning Spectacular', Act One!\nCourse Correction\nHold it, Mr Sholmes!\nTopic 1\nCause of Death\nConclusion\nPoisoning from soap ingestion\nSholmes:\nCareful observation of the victim reveals to us the events that transpired in this disconsolate room last night. Foam at the mouth of the deceased clearly indicates the use of poison. Next to the victim, we notice a large dining plate, which contains, you will observe... ...one half of a sizeable bar of soap. Meaningful? Indubitably. Why is this soap set so purposefully upon the dish? Like the victim's last supper, in fact. Yes... Could it be that the man was about to eat it? Of course, the fork reveals the answer.\nRyunosuke:\nWell, you can't deny that a fork implies the man was eating something, or about to eat something.\nSusato:\nYes, that's true. If I were to decide to eat some soap, I should prefer to use a fork than to attempt it with chopsticks.\nRyunosuke:\nAnd of course, only half of the bar of soap is left on the plate.\nSusato:\nBut might there not be some other explanation? Something material that proves whether or not the man really ate some soap...\nCould it be that the man was about to eat it? Of course, the fork reveals the answer.\nRyunosuke:\nSome soup on a plate, and a fork in hand... Even so, surely you wouldn't try to eat soap, no matter how hungry you were.\nSusato:\nThat's what we must determine: was the victim eating soap when he died or not? Until we can establish that with some certainty, we shan't make any progress.\nRyunosuke:\n(Talk about a slippery problem...)\nRyunosuke:\nCould it be that the man was about to eat it? Of course, the other piece of soap reveals the answer.\nSholmes:\nIt being the other half of the soap on the table. In short, the victim was not eating soap at all. But it's obvious, really. For no depths of hunger could drive any man to attempt to eat soap. Even I, with my unquenchable thirst for practical knowledge, took only a single bite!\nRyunosuke:\nBut that begs the question of how the man was poisoned. Because there's no sign of any food on the table.\nSholmes:\nAn excellent observation, Mr Naruhodo. And one that furnishes us with the answer we seek. For London's foul soap is besmirched by foul poison. Yes, the victim's life was claimed by poison that tainted the contents of the plate!\nRyunosuke:\nMr Sholmes is still pushing the soap argument, then.\nSusato:\nPerhaps he's suggesting the man licked the soap rather than ate it.\nRyunosuke:\nIf soap in London is that poisonous, I don't think I want to be washing my hands with it. (But there are no signs of any food in this room at all.)\nSusato:\nOf course, food isn't the only thing that passes people's lips, is it?\nYes, the victim's life was claimed by poison that tainted the contents of the plate!\nRyunosuke:\nIf the cause of death was poison, how did it get into the victim's body?\nSusato:\nI think it might be difficult to establish the answer conclusively at this point. But at the very least, the idea of poisoned soap should be discounted, I think. I'm sure there's a far more likely explanation before our eyes here.\nRyunosuke:\n(Something obvious that could explain how poison passed the victim's lips...)\nRyunosuke:\nYes, the victim's life was claimed by poison that tainted the teacup!\nSholmes:\nIndeed! Cups have been the vessel of choice for practising poisoners over the centuries. And it would appear that this victim drank every last drop.\nRyunosuke:\nThere's no sign of food anywhere in the room.\nSholmes:\nWhich leads us to the immutable conclusion: The cause of death was clearly intoxication due to the ingestion of poison contained in this teacup!\nTopic 1\nCause of Death\nConclusion\nPoisoning from soap ingestion\nPoison in the tea\nSolved\nTopic 2\nSuicide or Murder?\nConclusion\nNo possible perpetrator present\nSholmes:\nThe cause of death identified, we proceed to Act Two, where we ponder the next question: Was this suicide or murder? The audience will recall that death occurred during the victim's 'last supper'. Did the man dine and die alone? This single teacup suggests the answer.\nRyunosuke:\nAh, the 'Western vessel for infused hot drinks' again. It's already featured heavily in our deductions so far.\nSusato:\nYes, we can imagine that shortly before his death, Mr Shamspeare was having a drink of tea. There would be nothing remarkable about that. But what troubles me...\nRyunosuke:\n...Is Mr Natsume's reaction when he heard Mr Sholmes suggest it. (There's more to this deduction than it seems...)\nSusato:\nWe must closely examine the scene of the crime again for some more clues!\nDid the man dine and die alone? This single teacup suggests the answer.\nSusato:\nIt's crucial that we determine whether or not there was somebody else present at the time of death. It will tell us if this was a murder or suicide.\nRyunosuke:\nYes, and while the argument that the presence of a single teacup shows he was alone is a good one... (...we need to make sure we look at this from all angles...)\nRyunosuke:\nDid the man dine and die alone? This other teacup suggests the answer. Yes! There were two teacups in this room all along!\nSoseki:\nAh!\nRyunosuke:\nIn other words, this is a strong indication that at the victim's 'last supper'... ...there was a guest present!\nSholmes:\n...At the very least, we can say now with certainty... ...that somebody else was here in this room last night, taking tea with the victim!\nSoseki:\nWh-Wh-What are you TALKING ABOUT?!\nUtterly, Unbelievably, Unjustly Unreasonable!\nSholmes:\nTo draw a conclusion on such meagre evidence would be foolish however, certainly.\nRyunosuke:\nIn which case, what more can we deduce about this possible 'guest' at the table?\nSholmes:\nWell, allow me to lift the veil of doubt, my dear fellow.\nRyunosuke:\nDo you mean to say, you know who exactly was in this room at the time of the victim's death?!\nSholmes:\nIndeed. What reveals the answer, of course, is the broken lock!\nRyunosuke:\n...I'm not sure I like where this deduction is going now.\nSusato:\nI'm afraid it's too late to go back to the halcyon days of eating too much soap.\nRyunosuke:\nBut the identity of the 'guest' who was in here last night when the victim passed away is... Is something I have a very bad feeling about.\nSusato:\nWell, you can try to ignore your feelings, but we cannot ignore the truth, Mr Naruhodo.\nRyunosuke:\n(No, I suppose not. Time to look around again...)\nIndeed. What reveals the answer, of course, is the broken lock!\nRyunosuke:\nWas there somebody else in here last night, or not... Clearly that's a fundamental question that will reveal the truth about this man's passing.\nSusato:\nExactly. So we must make sure we have solid grounds for our conclusion.\nRyunosuke:\n(I must have another look around and make sure there's not more here than meets the eye...)\nRyunosuke:\nIndeed. What reveals the answer, of course, is the pile of familiar books!\nSholmes:\nQuite so! It's no mere coincidence that these three titles are here in this room. It's the link to the truth!\nSoseki:\nAgh!\nRyunosuke:\nMr Natsume, you purchased these books four days ago at a secondhand bookshop.\nSoseki:\nTh-That's just...a c-c-c-coincidence!\nSholmes:\nIn that case, you will be able to bring the same three titles from your own room, will you not? This very moment!\nSoseki:\n.........\nNo! Never! Non-Negotiable!\nRyunosuke:\nIf you can't bring your own copies here, it proves that these three books are in fact yours.\nSoseki:\nHnnnnnngh...\nRyunosuke:\nHaving purchased the books four days ago and returned to your lodgings, you were arrested the very next day. So you could conceivably have brought the books here on that evening, but you never mentioned that.\nSholmes:\nIn other words, you could only have brought these three books here to the victim's room... ...last night, having returned to your lodgings after the trial concluded at the Old Bailey.\nSoseki:\nAh...um...aaah...aaaaaah...\nSholmes:\nIn short...there is only one possible conclusion: The victim died here in his room last night as a result of poisoning.\nRyunosuke:\nAnd that same night, the victim had a visitor.\nSholmes:\nAnd that visitor...\nRyunosuke:\n...Was you, Mr Soseki Natsume!\nSholmes:\nThus concludes the final act of Herlock Sholmes's great deduction!\nTopic 2\nSuicide or Murder?\nConclusion\nNo possible perpetrator present\nSoseki Natsume at the scene\nSolved\nDeduction CompleteElementary!\nSoseki:\nHuuurgh...uuurgh... Not again... Not again... Not again... NOT AGAAAAAAAAAAAAIN!!!\nGregson:\nWell then, Mr Natsume... ...it would appear you're gonna have to accompany me down to the Yard...again.\nSoseki:\nBut, but, but... But wait! HOLD YOUR HORSES!\nGregson:\nYes?\nSoseki:\nDoor! Key! Locked! Entry! Exit! Entirely! Impossible!\nRyunosuke:\n(He's so flustered he's being even stranger than normal...)\nGregson:\nWhat, you think that's an alibi? You could have just made a copy.\nSoseki:\nWha...?\nGregson:\nYou live in the same buildin', after all. You'd have had plenty of opportunity, I'm sure.\nSoseki:\nB-B-B-B-But... MISERY MEEEEEEEEE!\nGregson:\nSorry, sir, you'll get your chance to give your side of the story later.\nSholmes:\nThe facts speak for themselves, Mr Moustache.\nSoseki:\nAaargh...you...you... You horrible Herr Lock Sholmes!\nRyunosuke:\n(He really has found himself an arch-rival now, hasn't he?)\nGregson:\nCome on now, no dilly-dallyin'. Outside! There's a carriage waitin'.\nSoseki:\nLocum Student Mr Naruhodo Esquire! I, I never imagined I'd be in this position again, but... YOU HAVE TO HELP ME! Please! Please! I'm innocent!\nRyunosuke:\n...Alright, I understand. We'll come to your cell later and talk about it.\nSoseki:\nAnd one more thing!\nRyunosuke:\nOh! Yes?\nSoseki:\nMy, my poor little kitty-cat... Please give him his breakfast for me!\nAnd so... ...his evil curse still apparently unbroken... ...Soseki-san found himself once again the prime suspect in a case of murder. Thanks to the incriminating deduction of the great detective.\nSholmes:\nMy dear fellow, that honour belongs to you!\nRyunosuke:\nWell, at least that means Inspector Gregson is no longer here. We can examine the crime scene in more detail now.\nSusato:\nYes, that's right. Ah, and of course...\nRyunosuke:\nWhat?\nSusato:\nHave you forgotten what the inspector mentioned before? It was the landlord, Mr Garrideb, who discovered Mr Shamspeare.\nRyunosuke:\nAh, Mr John Garrideb, yes...\nSusato:\nI expect we could find him in his sitting room on the top floor as usual.\nRyunosuke:\nRight. We must remember to go and talk to him later, then.\nAfter examining meter on wall, teacup, bricked-up window twice, and paper scrap on floor:\n???:\n...Looks like you're havin' a good snoop around, eh?\nRyunosuke:\nInspector Gregson! B-Back so soon?\nGregson:\nAfter I threw that little Japanese fella in the clink, I went and reported this to the investigation division. In five minutes' time, this place will be cordoned off by the Yard.\nRyunosuke:\nOh, I see. Well, we'd better be leaving then.\nSusato:\nPoor Mr Natsume must be feeling very low, being back in a cell again so soon...\nRyunosuke:\nI'm sure. We should probably go...and.........\nSusato:\nWhat's wrong, Mr Naruhodo? KYAAAAAAAAAAAAAAAH!!!\nShamspeare:\n'Out, out, brief candle! Life's but a walking shadow, a poor player... That struts and frets his hour upon the stage, And then is heard no more...' ......... ...Now, how soundeth the next part?\nGregson:\n'It is a tale. Told by an idiot, full of sound and fury, Signifying nothing.'\nShamspeare:\nIndeed! Oh, happy day!\nRyunosuke:\nWa-Wa-Wa-Wa-Wa... ...WALKING DEEEEEEEEEAD!!!\nGregson:\nThe, the fella isn't dead at all?!\nRyunosuke:\nWhat was that nonsense he was saying, though?\nSusato:\nI think... Yes, it was from William Shakespeare's 'Macbeth'. A soliloquy from Act Five, Scene Five.\nRyunosuke:\nShakespeare...\nSo it was... ...that the victim, Mr William Shamspeare...'came back to life'. If the man had indeed been poisoned, it transpired that it hadn't killed him. He was taken by emergency carriage to a nearby hospital for treatment. And Inspector Gregson evicted us from the scene of the crime...whatever that now was.\n21st February\nBriar Road\nSusato:\nWhatever do you think will happen now?\nRyunosuke:\n...Good question. What a strange situation for Mr Natsume. Arrested for murder, but then the victim comes back to life!\nSusato:\nI think perhaps the victim was never dead in the first place. It seems very likely that Mr Shamspeare did consume poison, as we deduced... ...but was it an accident, attempted suicide...or attempted murder? Until the truth can be established, I imagine the police will keep Mr Natsume in custody.\nRyunosuke:\nI suppose so... Let's hope it doesn't come to anything more than a night in the cells... (Oh...what's this? What's that man doing over there? He looks like he's trying to see into Soseki-san's lodgings...)\nSusato:\nIs something wrong, Mr Naruhodo?\nRyunosuke:\nUm, excuse me! Could we have a word?\n???:\nAh!\nRyunosuke:\n(He just ran off...)\nSusato:\nI feel sure that I've seen that man somewhere before. Where was it...?\nRyunosuke:\nHm... (I do too, but I don't remember...)\n21st February\nNaruhodo's Legal Consultancy\n21st February\nThe Garridebs' Room\nRyunosuke:\n(Here we are again. The eccentric landlord's eccentric top floor abode...)\nSusato:\nWe're here because Mr Garrideb's the one who discovered the incident this morning, don't forget.\nGarrideb:\nAh...you chaps, eh?\nRyunosuke:\nYes, good morning, sir.\nGarrideb:\nThank you for your...cooperation in court yesterday.\nRyunosuke:\n(It was quite a trial... As much for Mr Garrideb as anyone, really.)\nGarrideb:\nCame straight back here after all that business at the Bailey yesterday. Didn't expect to wake up to more bally nonsense this morning!\nSusato:\nI wonder...if you wouldn't mind telling us exactly what happened, Mr Garrideb?\nGarrideb:\nYes...I suppose you'd like to know all about that dead loss of an actor chap in the ground floor room.\nRyunosuke:\n(Those were exactly Inspector Gregson's words, weren't they?)\nAfter clearing all Converse options with John Garrideb and examining meter on wall, teacup, bricked-up window twice, and paper scrap on floor in Mr Natsume's Lodgings, Ground Floor:\nRyunosuke:\nWell, we've done as much investigating here as we can, I think. Perhaps we ought to go to the prison and speak with Mr Natsume again.\nSusato:\nA good idea!\n21st February\nLocal Prison, Cell 9\nSusato:\nLook, Mr Naruhodo. Mr Natsume...have the police finished questioning you now?\nSoseki:\nLocum Student Mr Naruhodo Esquire!\nRyunosuke:\nOh! Y-Yes?\nSoseki:\nWhat is he? Tell me! Is he a ghost? Is he here to haunt me?!\nRyunosuke:\nLet me guess... You're talking about Mr Sholmes?\nSusato:\nHe actually calls himself a great detective, Mr Natsume. Not a ghost.\nSoseki:\nBut, but his diabolic deductions... They're not of this world... They've...they've...they've left me... AAAH! Cursed! I'm cursed, I tell you!\nRyunosuke:\n(Well, that sort of hurts...)\nSusato:\nCredit where credit is due, Mr Naruhodo. You were heavily involved in the deduction, too.\nRyunosuke:\nYes, um...moving on... We have some wonderful news!\nSoseki:\nOh?\nSusato:\nThe victim that we all thought was dead...has come back to life again!\nSoseki:\n.........\nRyunosuke:\nNow, in the absolutely worst case, you could only be tried for attempted murder! That's...great, isn't it? Mr Natsume?\nSoseki:\nIT'S TERRIBLE!\nSusato:\nOh!\nSoseki:\nI'm stuck! In this cell! Suffering! For some silly! Wrong end of the stick! 'You did it, didn't you?' 'Confess!' 'You're a killer!' 'Why the moustache?' CONSTANT QUESTIONS!\nRyunosuke:\nI'm sorry to hear that...\nSoseki:\nARGH, THAT SELFISH SHYSTER! Make up your mind! Are you dead or alive? If you were going to come back to life, why bother dying?\nWickedly Wishy-Washy William!\nRyunosuke:\nWell...it seems likely that Mr Shamspeare was never actually dead in the first place.\nSoseki:\nAh, yes, that might make sense... And I'm pleased that he's alive, of course. Our lively debate last night was much fun. I'd be sad to think it was our last.\nSusato:\nOh!\nSoseki:\nOops.\nRyunosuke:\nUm, Mr Natsume...does this mean... ...that you did see the victim last night? You met with Mr Shamspeare, didn't you?\nSoseki:\n......... I'm not saying another word! I demand to have a lawyer present!\nRyunosuke:\nWho do you think I am? Please, Mr Natsume, we need to hear your side of the story!\nSoseki:\nUgh... Why am I cursed like this...?\nAfter clearing all Converse options:\nSoseki:\nOf course... ...Mr Lord-of-the-Manor is worried about the curse on my room as well.\nRyunosuke:\nYou mean Mr Garrideb?\nSoseki:\nYes. He knows that if people keep dying there, he'll never be able to rent it out again.\nRyunosuke:\nWell, that's true. I, for one, wouldn't go near the place.\nSusato:\nAh... Perhaps... ...that may explain why the landlord pays so much attention to the gas lamps and his tenants' movements.\nRyunosuke:\nYou mean...because he's worried about their well-being? (He does seem to have an unusually keen interest in the amount of gas in the pipes... There must be a reason why he keeps such close tabs on the occupants of his let rooms.)\nSoseki:\nWhat do you mean, 'he pays so much attention to the gas lamps'?\nSusato:\nOh dear! No! It's nothing to do with you, Mr Natsume! Please, forget I said anything!\nSoseki:\nOh, now you're talking about me behind my back as well...\nRyunosuke:\nWhat's important is that Mr Shamspeare isn't in fact dead at all. Once he's come round and he's able to tell us what happened, we'll be able to get you released.\nSoseki:\nYes, please! Oh, I do hope you're right!\n???:\nAhem! Excuse me...\nRyunosuke:\nInspector Gregson!\nGregson:\nI couldn't help overhearin' what you just said. And on that note... ...I have some good news and some bad news.\nSoseki:\nOh.\nGregson:\nWhich d'you want first?\nSoseki:\nAlways! Every time! The bad news comes first! 'When hope is all you have, hold onto it!' That's my guiding principle!\nGregson:\nRight, well, in that case...the good news it is!\nSoseki:\nHuh?\nGregson:\nSorry, but it's just a lot easier to explain everythin' that way.\nSoseki:\n...Then why did you ask me my preference?\nGregson:\nAs you might have heard, the victim, Mr Shamspeare, was just unconscious. He's come round now.\nRyunosuke:\nYes...we saw it happen in all its terrifying glory.\nGregson:\nHe's still bein' treated by the doctors, but we've managed to get a written statement from him already.\nSusato:\nOh, isn't that wonderful, Mr Natsume?\nSoseki:\nOh, thank goodness... It's all over, then. I can leave this sombre cell...\nGregson:\nSorry, no. That's not on the cards.\nSoseki:\nWhat?\nSusato:\nWhy ever not, Inspector?\nGregson:\nMr Shamspeare has implicated someone as bein' responsible for what happened last night.\nRyunosuke:\nImplicated someone?\nSusato:\nOh dear!\nSoseki:\nYou, you don't mean...?\nGregson:\nI'm sorry to say I do, yes. He's pointed the finger at you, Mr Natsume.\nSoseki:\nARGH!\nGregson:\n'By sweet poison did he seeketh to end my life. That wicked'st caitiff...Soseki Natsume!'\nRyunosuke:\nNo!\nGregson:\nSo I'm afraid you'll be appearin' in court as planned. You'll be wantin' to make the necessary preparations.\nSoseki:\nNnnnnn... NOOOOOOOOOOOOOOOOOOOOOH!\nRyunosuke:\nAnd so...once again, Soseki-san found himself having to take the dock in the Old Bailey. Whether his room was haunted or whether he was just terribly unlucky, I knew I had no choice... The following day I would represent him in court, and do my utmost to break the curse that blighted him!\nTo be continued...22nd February, 9:23 a.m.\nThe Old Bailey, Defendants' Antechamber\nRyunosuke:\n(The Old Bailey... This place always makes me feel strange. I seem to get chills down my spine and break out in a nervous sweat all at the same time...) Well...I didn't think I'd be back here so soon.\n???:\nThat's my line!\nSoseki:\nGOOD MORNING!\nRyunosuke:\nAh! Good morning, Mr Natsume.\nSoseki:\nIt was only two days ago that I was declared not guilty here.\nRyunosuke:\n(Yes, we somehow managed to prove he didn't stab Miss Green in the back...)\nSoseki:\nBUT NOW THIS! ANOTHER MORNING, ANOTHER MURDER! AND HERE I AM AGAIN IN THIS HELLHOLE!\nCan't Keep Coming to Court!\nRyunosuke:\n(I'm beginning to think he's right. It really does seem as though he's cursed.)\nSusato:\nMr Naruhodo! I'm afraid I have bad news! .........Oh! Mr Natsume... Good morning.\nSoseki:\n...Yes, morning.\nSusato:\nSo...here we are again!\nSoseki:\n...Yes, again.\nSusato:\n.........\nSoseki:\n......... JUDICIAL ASSISTANT MISS MIKOTOBA ESQUIRESS! WHAT'S THE BAD NEWS?\nSusato:\nOh dear... You heard, did you?\nSoseki:\nIf you come in shouting at the top of your voice...PEOPLE CAN'T HELP HEARING WHAT YOU SAY!\nSusato:\nOh... I am sorry.\nRyunosuke:\nYou've done nothing wrong, Miss Susato. Now, what is it?\nSusato:\n......... Well...it seems that the prosecution in today's trial... ...will be led by Lord Barok van Zieks.\nRyunosuke:\nVan, van Zieks...?\nSoseki:\nGAAAAARGH! Oh no... Oh no no...\nRyunosuke:\n(The so-called 'Reaper of the Bailey'... The most legendary prosecutor in the land... In the trial two days ago, he pursued Soseki-san and I relentlessly. Of course, by the skin of our teeth, we managed to pull through, but still...)\nSusato:\nPerhaps Mr Natsume's acquittal in the last trial wasn't the end of the matter. After all...\nRyunosuke:\nYes, I know what you're thinking. The legend of the Reaper that says... ...nothing can save a person in the dock when Lord van Zieks is the prosecutor.\nSoseki:\nOh no...\nSusato:\nThat even if that person is found not guilty...the accused will meet a mysterious end one way or another...\nRyunosuke:\n(And we've experienced it firsthand. A man we successfully defended met the most terrifying end after his acquittal...right here in the Old Bailey...)\nSoseki:\nAGH! DO I HAVE TO PUT UP WITH THOSE ICE-COLD EYES BORING INTO MY SOUL AGAIN?! CURSED BY EVIL SPIRITS AND NOW BY THE REAPER!\nPair of Petrifying Perils, Potentially!\nSusato:\nWell, if it's 'potentially'...at least you appear to have hope, Mr Natsume.\nSoseki:\nLocum Student Mr Naruhodo Esquire!\nRyunosuke:\nAh! ...Yes?!\nSoseki:\nI'm...I'M INNOCENT! YOU HAVE TO BELIEVE ME! You, more than anyone now...\nRyunosuke:\n......... Don't worry. I'll be your steadfast ally every step of the way in this battle. ...I promise! (...And this promises to be a hard battle, I fear...)\nSusato:\nWell... ...the trial is scheduled to begin shortly. We should move into the courtroom.\nRyunosuke:\nLet's go!\nSusato:\nOh yes, I forgot to say... I'm afraid he won't be able to make it. Mr Sholmes, I mean.\nRyunosuke:\n......... That's probably for the best.\nSusato:\nOh!\nRyunosuke:\nIf he were here, I might be tempted to rely on his help. And that could be seen as a weakness. If Lord van Zieks were to notice, he'd prey on it mercilessly. At least, that's my gut feeling.\nSusato:\nMr Naruhodo...\nSoseki:\nYou're right... Yes, you're so right. Oh, well said, Locum Student Mr Naruhodo Esquire! Well said!\nRyunosuke:\nI swear on this sword at my side, and on the spirit of Kazuma that it harbours... ...I'll show him what a Japanese lawyer can do! I'll set you free...with honour!\nSusato:\nOh yes!\n22nd February, 9:40 a.m.\nThe Old Bailey Courtroom\nJudge:\nIn the name of Her Majesty the Queen, I hereby declare this court to be in session. I now call upon the counsels for the prosecution and defence to declare their willingness to proceed.\nVan Zieks:\nThe prosecution is ready.\nRyunosuke:\nThe defence is ready, My Lord.\nVan Zieks:\nReadiness for the trial, my learned Nipponese friend, is not what the defence needs. What you need...is readiness for your inevitable defeat.\nRyunosuke:\n......... (It's not just in my imagination; it's really there... Lord van Zieks has such an animosity towards us Japanese for some reason...)\nSusato:\nIt was some time ago now that he first became known as the Reaper of the Bailey, I believe. These past few years, he hasn't appeared in court at all.\nRyunosuke:\nYet now he's back in the courtroom. Though for some reason... ...only when I'm defending. (This 'Reaper', with his curious disdain for us Japanese, is a prosecutor shrouded in mystery. Still...this isn't the time to be pondering that. I have to concentrate on Soseki-san's trial.)\nJudge:\nFurthermore, I now call upon the six ladies and gentlemen of the jury. You have been chosen at random to represent the will of the people in this trial. Are you ready to fulfil your duty?\nJuror No. 1:\nAbsolutely! I had a feeling this larrikin wasn't innocent before!\nJuror No. 2:\nI must say that I feel especially ruthless on days when my hat refuses to sit right!\nJuror No. 3:\nOh...well I rather like how you're wearing your hat. I think the ruthless look is very fetching, actually...\nJuror No. 4:\nI need to be somewhere at ten o'clock. I have a very important meeting. Let's make this quick.\nJuror No. 5:\nI couldn't agree more. I need to take home five bob tonight, or the missus will go through the roof!\nJuror No. 6:\nOh, may the Lord show us all the light here, and lead His flock to a righteous verdict...\nSusato:\nThe British jury system is so very different to our own, isn't it? It's quite extraordinary to think that the power of judgement is in the hands of six members of the public. And that the judge can only pass sentence when all jurors are in agreement about the defendant's guilt.\nRyunosuke:\n(Six citizens of London, chosen at random... Or at least, that's the idea.)\nVan Zieks:\nThe prosecution would draw attention to the fact that the accused was on trial here but two days ago. Accordingly, where possible, the same jurors have been asked to return for duty today.\nJudge:\nVery well, let us commence the trial. Lord van Zieks...your opening statement, please.\nVan Zieks:\nLadies and gentlemen of the jury, it is not the intent of the prosecution to cast doubt over your past decision... However, the innocent verdict afforded to this eccentric Nipponese before...has had dire consequences. Did the accused repent for his wrongdoing in that affair? Far from it. Instead, he used his freedom to perpetrate a most blood-curdling crime! Namely, that of the attempted murder of his neighbouring lodger, an innocent Englishman.\nRyunosuke:\n...!\nVan Zieks:\nTo explain the circumstances of the crime, the prosecution calls its first witnesses to the stand... ...the detective responsible for investigating the scene, and the accused himself!\nVan Zieks:\nWitnesses, your names and occupations, please.\nGregson:\nYes, sir! Tobias Gregson, Detective Inspector at Scotland Yard's homicide division.\nSoseki:\n......... Ah! Soseki Natsume from the Empire of Japan! My government ordered me to come here as a student to study your language and culture.\nJudge:\nMr Natsume...\nSoseki:\nYes! My Lord, sir!\nJudge:\nI'm quite sure I'm not mistaken... ...that you swore on oath...never to set foot in my courtroom again. I remember it as if it were yesterday.\nVan Zieks:\nThe day before, in fact, My Lord. But close enough.\nSoseki:\nUgh...believe me, this is the last place I want to be...\nVan Zieks:\nInspector, let's hear from you first. Explain the case for the court.\nGregson:\nRight you are, sir! The incident occurred at the Garrideb household where the defendant has lodgings... ...in the ground floor room of the victim, Mr William Shamspeare. The defendant has already admitted to visitin' the victim on the night in question. Mr Shamspeare collapsed in his room as a result of poisonin' by strychnine. He was found the followin' mornin' when the landlord, suspectin' somethin' was wrong, broke down the door.\nJudge:\nThis means, I presume, that the door to the victim's room was locked at the time of the incident?\nVan Zieks:\nCorrect, My Lord. It was locked from the inside, making entry to or exit from the room impossible.\nGregson:\nAlthough the victim, Mr Shamspeare, lives to tell tale... ...he very nearly didn't. The man was halfway to Heaven when we first found him.\nJudge:\nHmmm...\nGregson:\nI was the first officer on the scene, My Lord... ...and I have a photographic print here that I took at the time to show how it looked.\nJudge:\nYes, a chilling scene indeed. The man looks very much deceased.\nGregson:\nThat's right. Everyone present believed that's exactly what he was.\nJudge:\nVery well, I shall accept this photographic print as evidence for the court.\nThe crime scene photograph has been entered into the Court Record.\nJudge:\nNow then, Mr Natsume...\nSoseki:\nAh! Y-Yes...yes...YES?!\nJudge:\nAs the defendant, do you have anything to say at this juncture?\nSoseki:\n......... They're, they're haunted... Haunted by evil sp-spirits...\nJudge:\nGood gracious! What's haunted?\nSoseki:\nMY LODGINGS! THERE'S BEEN A WHOLE SERIES OF STRANGE HAPPENINGS IN MY LODGINGS! The tenant before me died in mysterious circumstances! A woman was stabbed by no one on the street outside! My neighbour was poisoned! And ME! WHAT ABOUT ME?! I've nearly been killed countless times!\nJudge:\nKilled, Mr Natsume? How?\nSoseki:\nEven on that fateful night, it happened. When I returned from Mr Shamspeare's room... ...I lit my gas stove and climbed into bed, but before long... ...the stove went out, AND SOMEBODY TRIED TO KILL ME!\nJudge:\nYou must always extinguish all fires before retiring for the night, Mr Natsume.\nSoseki:\nBUT IT'S SO COLD! My, my runny nose would freeze! The point is, I, I didn't poison my neighbour. Oh...why am I being accused of this? Why is my existence so cursed...?\nJudge:\nThank you, witnesses. I believe I have a reasonably clear picture of events.\nVan Zieks:\nIf I could raise one more point, My Lord. One more...conclusive point.\nJudge:\nConclusive? Go on...\nVan Zieks:\nFortunately, the victim, Mr Shamspeare, has regained consciousness after his ordeal. And he has named the true culprit.\nRyunosuke:\n...!\nVan Zieks:\nThe poison consumed by the victim was administered in a cup of tea that he drank on the night in question. Tea, My Lord, that was brought to the victim's room by the accused.\nJudge:\nThe accused...? Good grief! Ordaaar! Ordaaar!\nRyunosuke:\n(Yes...that's the crux of this whole case. If Soseki-san is innocent, then why...? Why has the victim accused him?)\nJudge:\nWell, Mr Natsume? What have you to say to this accusation?\nSoseki:\nThat evening, yes...I did take some freshly brewed tea with me when I visited Mr Shamspeare's room, as a gift. The public water pump outside always freezes at night, so I bought bottled water especially to make it. And this is the result! Never will I touch tea again! Never!\nRyunosuke:\nThe public pump was frozen, you say?\nSusato:\nThat's not information we've heard before.\nJudge:\nThat will do, thank you. Now, according to our laws, the defence must have the opportunity to cross-examine witnesses at least once. Therefore, I call upon these witnesses now for a formal testimony. ...I presume the prosecution has no objection?\nVan Zieks:\nNone whatsoever, My Lord.\nJudge:\nGood. Then you will give your account of events on the night in question to the court now.\nSoseki:\nYe-Ye-Ye...YEEEEEESSS, MY LORD!\nWitness Testimony\n- The Catastrophic Night -\nSoseki:\nIt was around nine o'clock that evening when I visited my neighbour, and I took some tea with me as a gift.\nWe had a heated literary debate over a nice, hot drink. After which I went back to my room, at around eleven.\nArgh! My tea was completely harmless! He couldn't have locked the door behind me otherwise, could he?\nGregson:\nStrychnine takes some time to have an effect on the body. People don't keel over immediately after takin' it.\nThe victim would have been perfectly able to lock the door after his guest left. The argument still stands.\nJudge:\nHm, yes, I see... It all seems relatively straightforward.\nSusato:\nExcuse me, but...that testimony does raise one rather crucial point, I think. Mr Natsume claims his tea to have been harmless. Presumably, though... ...the teacups have been examined for traces of the poison...haven't they?\nRyunosuke:\n(Why didn't I think of that?)\nGregson:\nWell, as it happens, no. We haven't been able to.\nJudge:\nDid I hear you correctly, Inspector? Scotland Yard has failed to examine the suspect substance?\nRyunosuke:\nHow could you have overlooked something so important?! Isn't that the first thing you should have done?\nVan Zieks:\n...My learned Nipponese friend is falsely incensed.\nRyunosuke:\n...!\nVan Zieks:\nThe inspector said Scotland Yard was unable to examine the tea. Not that it was overlooked.\nRyunosuke:\nUnable? Why?\nGregson:\nIt's simple enough. There was none left. Not a drop. Someone must have been very thirsty indeed.\nVan Zieks:\nWith current scientific techniques, it's not possible to test for poison under such circumstances.\nGregson:\nWe only need a drop, but that one drop does actually have to exist, funnily enough.\nJudge:\nHmmm...\nVan Zieks:\nThe lack of examination notwithstanding... ...it appears nothing other than the tea passed the victim's lips on the night in question.\nRyunosuke:\n...!\nJudge:\nI see. Thank you. The matter is clear.\nVan Zieks:\nCast your eyes over the jury, my learned friend.\nRyunosuke:\nWhat?\nVan Zieks:\nYou can see it in their faces, I'm sure. The recognition of the accused's guilt. Your client's fate is all but sealed. In mere moments from now...you will lose, and your compatriot will be damned for all eternity!\nRyunosuke:\n(He's right. I can feel all six of the jurors looking daggers at me. But I can't let them beat me down... I won't...)\nJudge:\nCounsel for the Defence...proceed with your cross-examination!\nRyunosuke:\nYes, My Lord!\nCross-Examination\n- The Catastrophic Night -\nSoseki:\nIt was around nine o'clock that evening when I visited my neighbour, and I took some tea with me as a gift.\nSoseki:\nWe had a heated literary debate over a nice, hot drink. After which I went back to my room, at around eleven.\nSoseki:\nArgh! My tea was completely harmless! He couldn't have locked the door behind me otherwise, could he?\nGregson:\nStrychnine takes some time to have an effect on the body. People don't keel over immediately after takin' it.\nGregson:\nThe victim would have been perfectly able to lock the door after his guest left. The argument still stands.\nRyunosuke:\n(That's the extent of their testimony, is it?)\nSusato:\nIf I could voice a personal opinion, Mr Naruhodo...\nRyunosuke:\nOf course. Go ahead.\nSusato:\nMr Natsume is arguing for his innocence so adamantly and so persistently... ...yet Inspector Gregson just brushes what he says aside. It's really quite infuriating!\nRyunosuke:\nI agree. So we need to find an inconsistency in what the inspector is saying, I think.\nSusato:\nI'm afraid so. As things stand, the jurors are sure to find Mr Natsume guilty.\nRyunosuke:\n(As I see it, what we need to focus on is the poison and the tea...) Let's listen carefully to this testimony again.\nSusato:\nYes!\nRyunosuke:\nThe argument still stands, you say? I think not, Inspector!\nGregson:\n...Come again?\nRyunosuke:\nI think you'll find...that you've overlooked a very significant chronological inconsistency here!\nGregson:\nA chrono-what? What are you on about?\nRyunosuke:\nAccording to this report... ...the victim must have consumed the poison at around... one thirty in the morning. And yet... ...the defendant, Mr Natsume, left the victim's room at eleven.\nGregson:\nAh!\nRyunosuke:\nYes, that's right... There's more than two hours of missing time there!\nGregson:\n...Nnf...\nRyunosuke:\nIn other words... ...if there was poison in the tea that Mr Natsume brought to the victim's room... ...how could the victim have fallen ill to it...two and a half full hours after the defendant left?!\nGregson:\nUWAAAAAAAAAAAAH!\nJudge:\nThe defence's argument is entirely reasonable. How do you respond, Lord van Zieks?\nVan Zieks:\n...Pray forgive the discourtesy if my mind has wandered. I was considering what cuisine would best complement the contents of my hallowed chalice this luncheon.\nRyunosuke:\n...!\nVan Zieks:\nHow could it have happened, you ask? I do hate to shatter illusions, but my Nipponese friend appears to be chasing a phantom idea.\nRyunosuke:\nA phantom...?!\nVan Zieks:\nIs it so hard to imagine that the victim drank his tea after the accused had left? For example, at the time stated in the medical report. Yes...at around half past one.\nRyunosuke:\nRyunosuke:\nMr Natsume brought the tea with him to drink together with his neighbour! And in Japan, there is a well known saying: 'Drink tea while it's hot!'\nVan Zieks:\nVan Zieks:\nAnd in my country, there is an even more apt saying: 'There is nothing more refreshing than cold tea.'\nRyunosuke:\nThe, the point is...if there was such a long gap... ...there may be other ways to explain how the victim came to be poisoned! Other possibilities!\nJudge:\nWhat sort of possibilities, Counsel?\nRyunosuke:\n......... Well...for example... The man could have had another visitor!\nVan Zieks:\nAnother visitor? That's a very bold assertion, my learned friend...from someone who has nothing to substantiate it.\nRyunosuke:\nOr...or...the victim could have taken the poison of his own volition!\nJudge:\nYou suggest this may have been a suicide, Counsel?\nVan Zieks:\nVan Zieks:\nMr Shamspeare has categorically denied suicide. The idea can and must be discounted.\nRyunosuke:\nRyunosuke:\nBut, but he could be lying!\nVan Zieks:\n.........\n.........\n..................\nJudge:\nIs something wrong, Lord van Zieks?\nVan Zieks:\nI was listening to the sound of the carriage pulling up outside the courtroom. Pray, forgive the discourtesy.\nRyunosuke:\nCarriage? What carriage?\nVan Zieks:\nIt would seem...that the key player in this case has just arrived.\n???:\n???:\n'Out, out, brief candle! Life's but a walking shadow...'\nShamspeare:\n'...a poor player, that struts and frets his hour upon the stage, and then is heard no more. It is a tale, told by an idiot, full of sound and fury, Signifying nothing.'\nJudge:\nWho, sir, are you...?\nShamspeare:\nWilliam Shamspeare, My Lord. Alas 'twas I, undone by these bitter events. I...am the victim!\nRyunosuke:\nWha... What's he doing here?!\nVan Zieks:\nThe prosecution seeks to call this gentleman to the stand. With his testimony, my learned friend's futile resistance will be utterly crushed.\nRyunosuke:\nYou're calling him as a witness?\nJudge:\nVery well, Counsel. I grant your request with interest. I'm curious to discover what the court shall hear from the victim himself!\nShamspeare:\nHappy am I, Shamspeare, to regale thee with my tale of woe, My Lord.\nSoseki:\nB-But...! I still have my own tale to tell! My own tale of worse woe! I CAN REGALE THE COURT WITH THE TALE OF MY PERFECT INNOCENCE IN PERFECT ENGLISH!\nJudge:\nThat will do, Mr Natsume. Let the court now hear from the victim!\nRyunosuke:\n(Alright, so that's Mr Shamspeare... But who's that other man beside him?)\nSusato:\nYes, I think... I feel sure that we've caught a glimpse of that man before.\nVan Zieks:\nState your names and occupations for the court, please, witnesses.\nShamspeare:\nA writer of words so sweet, they do scent the breeze. An inventor of ideas so profound, they compose the earth. The unrivall'd poet, the unmatched scribe, William Shakespeare... Were the great bard to be recall'd to life anew, lo, what a magnificent man! Good fellows, I am he who ponders such a miracle... William Shamspeare.\nMetermann:\nOh, um...the name's Metermann. Adron B. Metermann. I work for the Altamont Gas Company, East End branch office.\nSusato:\nAh! I remember now! It was yesterday, on Briar Road...\nRyunosuke:\nOh yes! (She's right. It's him!)\nRyunosuke:\n(Oh...what's this? What's that man doing over there? He looks like he's trying to see into Soseki-san's lodgings...)\nSusato:\nIs something wrong, Mr Naruhodo?\nRyunosuke:\nUm, excuse me! Could we have a word?\n???:\nAh!\nRyunosuke:\n(Yes, we spotted him outside Mr Garrideb's house that morning. And he's a gas company employee? What does he have to do with this case?)\nJudge:\nSo, Mr William Shamspeare...you are the victim in this miserable affair, correct?\nShamspeare:\n'O Heaven! O Hell! Do you command me to remember?' That sweet poison that didst cross me and cross mine innocent lips.\nVan Zieks:\nI subpoenaed him for the trial. With his doctor's permission, naturally. Hearing the testimony of the aggrieved will remove any room for doubt from the jurors' minds, I'm sure.\nShamspeare:\nBehold, you have only to rearrange the letters of my name to see that 'me's a seraph'! An angel, indeed! Thus be I noble of mind, sweet of nature and verily, honest of heart. As all heavenly angels be.\nRyunosuke:\n(Because there isn't a less contrived meaning in your name. No, not at all...)\nSusato:\nThe jurors seem to be very moved by this man, I'm afraid.\nRyunosuke:\n(They're actually taking this 'seraph' anagram idea seriously...?)\nJudge:\nThank you, witnesses, for your illuminating introductions.\nRyunosuke:\nBut My Lord...what's the man next to Mr Shamspeare doing here? The gasman, I mean.\nMetermann:\nUh? What? Me? Well now...\nVan Zieks:\nAllow me to enlighten my learned friend. You recall, I presume, your earlier impertinence? When you suggested that the victim had another visitor to his room on the night in question. And, moreover, that the victim is a compulsive liar.\nRyunosuke:\nWhat?! No, no I didn't quite say that...\nVan Zieks:\nThis young chin-stroker is here to controvert your wild claims. Conclusively. Is that not so...Mr Metermann?\nMetermann:\nEh? Hang on, no... I'm just here...\nJudge:\nI hereby call for your formal testimonies. You will tell the court as lucidly as possible what happened on the night in question!\nShamspeare:\n'One may smile, and smile, and be a villain...' Yes, it doth pain me, but let the truth be spoken! The truth of that wintry night of my discontent.\nMetermann:\nHmmm...\nWitness Testimony\n- The Wintry Night of My Discontent -\nShamspeare:\nThe snow lay about. My neighbour did cometh in the evening, bearing a gift of tea.\nBut marry! Bitter was his drink! And when he left, I did fall prostrate on my table!\n'Twas the tea alone did pass my lips that late hour. Nought else.\nMetermann:\nI was outside this bloke's window in the freezin' cold all night, keepin' an eye on his room.\nNo one else visited his room but that short little round-backed Eastern fella.\nRyunosuke:\nWait, what did you say?! You were 'keeping an eye' on Mr Shamspeare's room all night?!\nMetermann:\nThat's right. 'Course, the bloke's window is all but blocked up, isn't it? But there's a little gap in the bricks where you can see into the room. So I spent the night tryin' to keep my teeth from chatterin' as I peered in through that.\nJudge:\nThe question is, sir...why?\nMetermann:\nAh! Well now, that's because he's on my list!\nShamspeare:\n'What a piece of work is a man!' ...Wherefore wouldst thou not stare in wonderment?\nRyunosuke:\nWhat are you talking about?\nShamspeare:\nThis buzzing busybody hath not part in this play. I pray thee...pay him no heed. Make no more ado about his tedious words...\nMetermann:\nWhat'd you say about me?!\nVan Zieks:\nCalm yourself. This court is concerned with what happened on the night in question. Nothing more.\nJudge:\nIndeed, that is so.\nVan Zieks:\nAnd, as the testimony we have just heard clearly reveals... ...there was no one other than the accused present at the time who could have carried out this crime.\nRyunosuke:\n...!\nJudge:\nWell...I believe this may be the final testimony of the trial. Now, Counsel...the defence may proceed with the cross-examination!\nRyunosuke:\nYes...My Lord!\nCross-Examination\n- The Wintry Night of My Discontent -\nShamspeare:\nThe snow lay about. My neighbour did cometh in the evening, bearing a gift of tea.\nShamspeare:\nBut marry! Bitter was his drink! And when he left, I did fall prostrate on my table!\nShamspeare:\n'Twas the tea alone did pass my lips that late hour. Nought else.\nMetermann:\nI was outside this bloke's window in the freezin' cold all night, keepin' an eye on his room.\nMetermann:\nNo one else visited his room but that short little round-backed Eastern fella.\nRyunosuke:\n(So that's the entire testimony...)\nSusato:\nWhat do you think, Mr Naruhodo?\nRyunosuke:\nWell...erm... ...I can't see any obvious holes at all, to be honest.\nSusato:\nNo... Oh dear... If nobody else visited Mr Shamspeare's room that night apart from Mr Natsume... ...I imagine the members of the jury will all conclude the same thing.\nRyunosuke:\n(Right. That he's guilty...) Well, all we can do is press these witnesses for more information and hope for a breakthrough.\nSusato:\nYes!\nAfter pressing all statements:\n???:\nJuror No. 1:\nMy Looord!\nJudge:\nGoodness me! Yes, Mr Foreman?\nJuror No. 1:\nI've kept my mouth shut and listened up to now, but this has gone on long enough. Are you all with me?\nYEEEEEESSS!\nVan Zieks:\nAre we to understand...that you ladies and gentlemen of the jury are in agreement with one another? That you've reached a unanimous decision?\nJuror No. 1:\nToo right, we have!  Are you all with me?\nYEEEEEESSS!\nRyunosuke:\nWait! No! The defence is in the middle of a cross-examination!\nJuror No. 1:\nTo be honest, I was holding out a bit of hope for you, young man. Especially after you identified those few hours that followed the accused leaving the victim's room.\nJuror No. 2:\nYes, the three 'missing hours' as you put it.\nJuror No. 3:\nBut in the end, what difference do they make? None, as far as I can see.\nJuror No. 4:\nAnd since that's now apparent, there's really no reason to delay our decision any longer.\nJuror No. 5:\nLike I was saying before: if I don't take five bob home with me tonight, the missus will blow her top!\nJuror No. 6:\nHm? What's that? Sorry, I didn't quite catch what you said...\nJudge:\nVery well, let the court be apprised of your decisions. Ladies and gentlemen of the jury, you will state your leanings as to the defendant's culpability!\nJuror No. 1:\nGuilty!\nJuror No. 2:\nGuilty!\nJuror No. 3:\nGuilty!\nJuror No. 4:\nGuilty!\nJuror No. 5:\nGuilty!\nJuror No. 6:\nGuilty!\nRyunosuke:\nA-All of you...?\nJudge:\nWell, it would appear that the jury is indeed unanimous.\nVan Zieks:\nSo...this time at least, it seems justice will be done. All's well that ends well, as they say. This calls for a toast, I feel... To the guilty being punished!\nRyunosuke:\nUgh... UWAAAAAAAAAAAAH!\nSusato:\nGet up, Mr Naruhodo! Please! The trial isn't over yet!\nRyunosuke:\nWh-What do you mean, Miss Susato?\nSusato:\nWhat about the information I found in this Encyclopaedia of British Law that I have? That obscure right that belongs to the defence in these situations...remember?\nRyunosuke:\n......... ...A summation examination... ...Yes, that's right... We don't have a jury in Japanese courts, of course. But here in a British court of law, if we can reverse the decisions of a majority of the jurors... ...we can force the trial to continue. (This trial can't end now. Whatever it takes, I just can't let that happen!) The defence moves to invoke its right to a summation examination, My Lord!\nVan Zieks:\nWhy am I not surprised...at my learned Nipponese friend's inability to admit defeat? You choose to cling desperately to some archaic rule you barely comprehend instead of accepting the truth.\nJudge:\nCertainly no other defence counsellor in recent times has exercised the right to a summation examination.\nVan Zieks:\nBecause they all know that once the jury's mind is set, it cannot be altered.\nJudge:\nNevertheless, the right remains and must be upheld. The defence counsel's request is granted. This court will proceed with a summation examination, as outlined in the Encyclopaedia of British Law!\nRyunosuke:\nThank you, My Lord!\nJudge:\nAre you and your fellows prepared, Mr Foreman?\nJuror No. 1:\nBelieve me, My Lord, we know all about this young lad's tenacity. And we're ready for it!\nJudge:\nVery well. In that case, ladies and gentlemen of the jury, I hereby call upon each of you... ...to state the grounds upon which you find the defendant guilty of the crime for which he stands accused!\nJudicial Findings\n- The Jurors' Contentions -\nJuror No. 1:\nThe victim may not be well off, but he's a noble man and straight up! There's no reason to doubt the man.\nJuror No. 2:\nWell, I do declare the good gentleman has no reason to lie. In fact...I think he's rather splendid.\nJuror No. 3:\nJust look at the accused by comparison! He's Japanese, stoops all the while, and has a moustache! Very fishy...\nJuror No. 4:\nThere's no evidence to suggest the gangling actor is a fraudsman. ...For now, at least.\nJuror No. 5:\nAgh! I really don't care, like! I just need this trial to end quickly!\nJuror No. 6:\nThree hours of 'missing time' is nothing when you reach my age, you know. Nothing at all.\nRyunosuke:\n(I knew it... Every single one of them seems completely convinced...)\nSusato:\nIt would seem that all the jurors... ...have come to the conclusion that Mr Shamspeare is a fine, upstanding and honest citizen.\nRyunosuke:\nIf you ask me, they've all been bewitched by his strange theatrical movements.\nSusato:\nAnd sadly, nothing Mr Natsume has said appears to have registered at all.\nRyunosuke:\nWell...here goes! (Let's not forget... ...I've pleaded with the jury on Soseki-san's behalf before and it worked. So you never know!)\nSusato:\nBefore we begin... ...it might be an idea for me to remind you exactly how a summation examination works, Mr Naruhodo.\nRyunosuke:\nOh.\nSusato:\nWell, you're still very new to British law, after all.\nRyunosuke:\n(That's true, I suppose. And Soseki-san's fate is entirely in my hands now, too. There's always a chance I might have forgotten some crucial detail. Perhaps I should hear Susato-san out. I wonder...should I let her talk me through it again or not bother?)\nJudge:\nWithout further ado, please, Counsel. Proceed with the summation examination!\nRyunosuke:\n...Yes, My Lord!\nJury Examination\n- The Defence's Rebuttal -\nJuror No. 1:\nThe victim may not be well off, but he's a noble man and straight up! There's no reason to doubt the man.\nJuror No. 1:\nAlright, if you can show me that the victim's a liar, I'll reconsider my position!\nJuror No. 2:\nWell, I do declare the good gentleman has no reason to lie. In fact...I think he's rather splendid.\nJuror No. 3:\nJust look at the accused by comparison! He's Japanese, stoops all the while, and has a moustache! Very fishy...\nJuror No. 4:\nThere's no evidence to suggest the gangling actor is a fraudsman. ...For now, at least.\nJuror No. 4:\nThe 'victim' puts on a fine performance, but in reality, he's a common thief...of my company's gas!\nJuror No. 5:\nAgh! I really don't care, like! I just need this trial to end quickly!\nJuror No. 6:\nThree hours of 'missing time' is nothing when you reach my age, you know. Nothing at all.\nSusato:\nThe key to summation examinations is identifying contradictions between jurors' statements, Mr Naruhodo.\nRyunosuke:\nRight, and once I've found two jurors whose statements can't coexist, I need to pit those jurors against each other. Then hopefully, when they see that what they're saying doesn't make sense, they'll change their leaning.\nSusato:\nYes. And if you're able to change the minds of a majority of the jurors, the trial will continue. But conversely, if you're unable to do that, the judge will declare the trial over and move to adjudication.\nRyunosuke:\n(And I can't let that happen. Somehow or other, I have to turn this trial around!)\nRyunosuke:\nThose two statements clearly contradict each other!\nJudge:\nGood gracious! To whose statements do you refer, Counsel?\nRyunosuke:\nJuror number one!\nJuror No. 1:\nEh? What are you yelling about, lad?\nRyunosuke:\nI presume you've heard juror number four's statement? Made by the wife of the owner of Altamont Gas.\nJuror No. 1:\nWell, yes...\nRyunosuke:\nThe victim, who you claim to be a noble, 'straight up' man... ...in fact turns out to be a 'common thief'.\nJuror No. 1:\nSo the good lady says. But there's no evidence, is there? You and I both heard them say as much!\nJuror No. 4:\nIt's true, we don't have evidence as such...just yet. But the claims aren't baseless, you know.\nJuror No. 1:\nWhat?\nJuror No. 4:\nYou heard me. Seeing as his operation has already been compromised... ...I would suggest that the court hears testimony from our East End branch office employee over there.\nMetermann:\nI'll do whatever you say, my lady! Gasman's honour!\nRyunosuke:\nJuror number one! You say you're a man of your word!\nJuror No. 1:\n...!\nRyunosuke:\nIf I could show that Mr Shamspeare was a liar, you assured me... ...that you would reconsider your decision about the defendant's guilt.\nJuror No. 1:\n......... Hm, yes, I did say that. And as a man of honour, I'll hold to it. ...As I'm sure the other gentlemen of the jury will!\nJuror No. 3:\nMe?! Oh, well, yes... Now that we've found out the man's a liar, perhaps we ought to consider the matter further.\nJuror No. 6:\nWell...if I'm perfectly honest, I haven't heard half of what you've all been saying. So if this means you'll recap a few points, that would suit me down to the ground.\nJuror No. 5:\nOh no, I'm not having any part of this! I want this trial over and done with!\nJuror No. 4:\nIn that case, I shall change my leaning.\nJuror No. 1:\nSo, Mr William Shamspeare...if that is your real name... ...we of the jury demand to know exactly what kind of a man you really are!\nRyunosuke:\nThat's...four jurors! Four for 'not guilty'!\nSusato:\nYes, Mr Naruhodo! Victory!\nJudge:\nOrdaaar! Ordaaar! Well...this is quite extraordinary, I must say. As a result of the defence's summation examination, the jury's leaning has changed. Now only two jurors say 'guilty', whilst four say 'not guilty'. I therefore declare this court to be in a state of disaccord... ...and order the trial to continue!\nVan Zieks:\nYou have spoilt the bouquet...Mr Shamspeare.\nShamspeare:\n.........\nVan Zieks:\nThe ladies and gentlemen of the jury now find they are unable to trust you, the victim.\nShamspeare:\n......... 'But you gods will give us, Some faults to make us men.' So God mend me, I do swear... This gasman speaketh that which concerns him most: nought but gas! Nought but thin air! Ay, it burneth bright a while, but it hath no substance. And it doth reek foul!\nMetermann:\nOi, what did you say?!\nJudge:\nDo I take it, Mr Shamspeare, that you deny the allegations of gas thievery?\nShamspeare:\nMost heartily, My Lord! Hast thou forgot? I am as a seraph! An angel! Noble of mind, sweet of nature and verily, honest of heart.\nMetermann:\nArgh, you flowery-mouthed, pompous beanpole! Just cos I haven't got the evidence yet...\nRyunosuke:\nMr Shamspeare! If, in fact, you are NOT noble of mind, sweet of nature or honest of heart... If you are a liar... ...then your testimony should have no sway in this courtroom!\nShamspeare:\n.........\nJudge:\nIt is my considered opinion... ...that at the present time, no other possible culprit of this crime has been identified. All testimony heard by the court thus far heavily implicates the defendant. In short, it would not be unreasonable at this stage for me to rule on the case.\nSusato:\nOh no...\nJudge:\nHowever...in light of the fact that the jury has expressed concern about the fidelity of this witness... ...I believe it would be inappropriate for this court not to pursue the point further.\nVan Zieks:\nVan Zieks:\nI assure you, My Lord, that would be a waste of the court's time. The gas and this case are unrelated.\nRyunosuke:\nJuror number four!\nJuror No. 4:\nYes?\nRyunosuke:\nDidn't you say before that although you had no hard evidence to prove this man has been stealing gas... ...you have strong grounds for suspecting him?\nJuror No. 4:\nThat's right, we do. ...Don't we, hm, worker?\nMetermann:\nAbsolutely, Lady Quinby! Gasman's honour!\nJudge:\nVery well, then. We will hear your testimony now. You will tell the court precisely why you believe the victim, Mr William Shamspeare, has been stealing gas.\nMetermann:\nYes, My Lord, it'll be my pleasure! On the Altamont Gas name, I swear-\nJuror No. 4:\nIf I may, My Lord...?\nJudge:\nGo ahead, madam.\nJuror No. 4:\nThis worker's testimony may have a significant bearing on the good name of my husband's company. Therefore, I should like to take the stand alongside him, in a supervisory role. If you wouldn't mind.\nMetermann:\nWahoo! Oh, yeah! Sweet as honey! Yeah, yeah, yeah, yeah, yeah!\nJudge:\n...Very well. As an exception, I shall honour your request.\nJuror No. 4:\nThank you, My Lord.\nMetermann:\nYou wait till the boss gives you an earful! Ooh, it's gonna sting, you mark my words!\nJudge:\nSo, you will both testify before the court... ...on the subject of the illegal consumption of the Altamont Gas Company's fuel!\nJuror No. 4:\nYes... ...Is that clear, my good man?\nMetermann:\nClear as Altamont gas, my lady! ...Which is the clearest in the world!\nRyunosuke:\nDo you think the gas has gone to his head, Miss Susato?\nSusato:\nI think the man is just a very dedicated employee, Mr Naruhodo.\nWitness Testimony\n- The Altamont Gas Company's Investigation -\nMetermann:\nI'm proud to be the company's East End branch investigator and meter money collection agent.\nAltamont gas meters accept thruppenny bits, each coin givin' customers about two hours of gorgeous gas!\nAltamont:\nAnd yet, the meter in Mr Shamspeare's room didn't have a single coin in it!\nThe meter doesn't appear to have been tampered with, though, and the collection agent has the only key.\nMetermann:\nSomehow, he's usin' all the flamin' gas he wants without payin' a penny! If that's not thievin', what is?!\nVan Zieks:\n...Pray forgive the discourtesy. The irrelevance of this testimony caused me to turn to my hallowed chalice.\nJudge:\nWhat do you mean by that remark, Lord van Zieks?\nVan Zieks:\nDid the moustachioed Nipponese poison the gangling excuse for an actor or didn't he? That is all that should concern this court. And yet now we must listen to this...abhorrence. Clearly what separates the vast British Empire and your Eastern island nation is more than geographical distance.\nRyunosuke:\nBut...but this could turn out to be crucial testimony! The cross-examination must go ahead!\nVan Zieks:\n...Do what you will.\nSusato:\nLord van Zieks appears to be in a violent mood.\nRyunosuke:\nYes...he does. (An attempted poisoning...and an incidence of gas theft with no supporting evidence... It's true that they would appear completely unrelated at first glance. But I wonder... The truth tends to be buried in the most unusual places. And the first step in uncovering it...will be to establish just who and what this man really is!)\nCross-Examination\n- The Altamont Gas Company's Investigation -\nMetermann:\nI'm proud to be the company's East End branch investigator and meter money collection agent.\nMetermann:\nAltamont gas meters accept thruppenny bits, each coin givin' customers about two hours of gorgeous gas!\nAltamont:\nAnd yet, the meter in Mr Shamspeare's room didn't have a single coin in it!\nAltamont:\nThe meter doesn't appear to have been tampered with, though, and the collection agent has the only key.\nAltamont:\nAll joints on the meter are welded shut, and the lock is made from solid steel. There's no way to dismantle it.\nAltamont:\nThe meter is designed for coins the exact diameter and thickness of a thruppenny bit. Nothing else will fit.\nMetermann:\nSomehow, he's usin' all the flamin' gas he wants without payin' a penny! If that's not thievin', what is?!\nRyunosuke:\n(I certainly didn't expect to uncover another crime that looks like it's been taking place in the very same room...)\nSusato:\nAccording to the testimony, it's only the meter in Mr Shamspeare's room that's under suspicion. It does seem as though perhaps it has nothing to do with the incident involving Mr Natsume...\nRyunosuke:\nI know. It does seem that way. But the fact is... ...since I've been practising law in England, I feel like I've encountered this at least once already. Cases that are interlinked.\nSusato:\nOh...\nRyunosuke:\nIt might seem that two cases have nothing to do with one another at first. But in fact, they're intimately connected.\nSusato:\nYes, we have experienced that before, haven't we? I wonder if this is another instance...?\nRyunosuke:\nPerhaps... But we can't be sure of that yet. (If the Altamont Gas Company has been investigating Mr Shamspeare so earnestly... ...there must be something to it. But then how has he been managing to steal their gas?)\nRyunosuke:\nLet me just confirm something here... If the diameter and thickness were to be correct... ...the meter would accept any object as if it were a thruppenny bit. Is that correct?\nAltamont:\nYes, that is correct.\nRyunosuke:\nWell, by something of a coincidence, while we were investigating in Mr Shamspeare's room... ...we found a particular item that matches the dimensions perfectly.\nAltamont:\nSomething the same size as a thruppenny bit?! What was it?\nRyunosuke:\nThe item in question...is this!\nMetermann:\nWha...? Have you been inhalin' gas? That's a bar of soap!\nAltamont:\nIt certainly looks nothing like a thruppenny bit, I must say...\nRyunosuke:\n(It looks like I'm going to have to point out exactly what I mean here.) What's so important about the soap...is this part here!\nRyunosuke:\nYou have to turn over the soap to see what I mean.\nAltamont:\nAh! Are you referring to that round depression in the middle of the soap there?\nRyunosuke:\nThat's right. A depression that's approximately three-quarters of an inch in diameter. Or in other words, almost exactly the same size as a thruppenny bit.\nMetermann:\nGET AWAY!\nJudge:\nDoes anyone here present have in their possession a thruppenny bit? Quickly now! Hand over your coins, ladies and gentlemen!\nSusato:\nIt sounds rather like a highway robbery, doesn't it?\nJudge:\nThanks to a kind member of the public in the gallery, I have here a thruppenny bit. Now, to see if it fits... ......... My word! It couldn't be more snug!\nRyunosuke:\nYes, as I suspected... This, without a doubt, is a vital clue to explain how the Altamont Gas Company is being defrauded!\nAltamont:\nWell! I don't believe it!\nVan Zieks:\nSo...your assertion amounts to what? That some inferior bar of soap has a tentative connection to the theft of gas?\nRyunosuke:\nYes! The depression in the soap was clearly made by a thruppenny bit.\nJudge:\nI must concur at least, that pushing a coin with some force into a poor-quality bar of soap such as this... ...is a remarkably simple way of replicating the coin's shape.\nMetermann:\nAnd then you could use...well, some melted wax or somethin' to pour into the mould... You could make fake coins in no time!\nRyunosuke:\n(This brings all the pieces of the puzzle together. It's the method Mr Shamspeare has been using to steal the gas... That's the missing link! And now if I follow the chain of thought... ...it's going to bring me to a new explanation for what happened that nobody's considered yet!)\nAltamont:\nBut...this is all nonsense! If the man had been making fake coins, my worker here would have found them when he emptied the meter!\nJudge:\nQuite true, Lady Altamont. In the absence of some black magic that could make them disappear...\nVan Zieks:\n......... I see. That's what we're dealing with, is it? There is one form of 'black magic' that could cause the fake coins to disappear into thin air, yes.\nRyunosuke:\nExactly. And the meter here gives it away.\nAltamont:\nWhat on earth...?\nRyunosuke:\nThere are remnants of the 'magical' method used visible on the gas meter taken from the victim's room!\nJudge:\nIf that is your assertion, Counsel, the defence will identify these remnants for the court at once! Where on the meter can the remnants of the method used to make the fake coins disappear be seen?\nRyunosuke:\nWe found this bar of soap at the scene of the crime, just outside the victim's window.\nMetermann:\nOutside...?\nRyunosuke:\nYes, outside, where you yourself, Mr Metermann, were loitering...in the freezing winter air. That's where we found this soap.\nMetermann:\nAh! I get it!\nRyunosuke:\nThat's right. The answer, of course...is ice.\nJudge:\nDid you say...ice?\nRyunosuke:\nMr Shamspeare has been leaving soaps like this outside his window each evening, filled with water. After a night outside in the bitter cold, the water is completely frozen solid the next morning.\nVan Zieks:\nThen he takes his fake coins of ice and feeds them into the gas meter, giving him light and warmth in spades. As his room becomes very comfortably warm, the ice now inside the meter's coin box...melts...\nRyunosuke:\n...Turning back into water... ...and draining harmlessly away through the small hole made in the underside of the meter. That is how, without leaving any evidence of his wrongdoing, this man has been stealing Altamont gas!\nAltamont:\n.........\nVan Zieks:\n.........\nJudge:\n.........\nAltamont:\nJust like that... So simply... Is, is he trying to make us look like idiots? He's been fooling us all with some bars of soap and some water?\nRyunosuke:\nThat's right, madam.\nAltamont:\nI don't believe it! It can't be true! Do you have any idea how much money we spent to develop that new meter? And now you have the audacity to suggest...that a bit of soap and some water can render it totally useless?\nRyunosuke:\nI'm fairly sure I didn't design it...\nAltamont:\n...Evidence!\nRyunosuke:\nSorry?\nAltamont:\nI want evidence! If you're going to stand here and tell me our meters are rubbish, I want to see proof!\nSusato:\n...She's very good at enforcing accountability, isn't she?\nRyunosuke:\nVery well, Lady Altamont. If you'd like evidence, I'll provide it.\nAltamont:\nWhat?\nSusato:\nMr Naruhodo! Are, are you saying...you do actually have evidence to support this theory?!\nRyunosuke:\n(I did notice a trace of something that bothered me a little at the time. And I have a feeling that this theory we've come up with now could explain it.) The piece of evidence that substantiates the theory about how Mr Shamspeare has been stealing gas is...\nRyunosuke:\nThis is a photograph of the scene at the point when the victim was discovered, taken by Inspector Gregson. And it clearly shows the remnants of the crime carried out by Mr Shamspeare!\nVan Zieks:\nWhat remnants?\nRyunosuke:\nHere you can see the gas meter on the wall in Mr Shamspeare's room. Now...look closely at the floorboards directly underneath the meter.\nAltamont:\nWhat, what is that? Some kind of grubby stain...\nRyunosuke:\nAlmost certainly...it's a water stain resulting from the liquid that drained out of the hole made in the meter.\nAltamont:\nAh!\nRyunosuke:\nIf one coin gives around two hours of gas usage, and the occupant was heating his room in all his waking hours... ...we can imagine he would have used around ten of his fake coins each day. The melting ice inside the meter's coin box would have been dripping out almost constantly... ...leaving a stain on the floor.\nAltamont:\nThis, this is awful...\nRyunosuke:\nAnd there's further evidence, too. Mr Shamspeare is slumped over the table, apparently having consumed strychnine. And right there next to him...is a bar of soap, broken in half.\nAltamont:\nYou're right...\nJudge:\nIt would appear to me then, Counsel... ...that the man was eating the soap, was he?\nVan Zieks:\nPardon me for disagreeing with Your Lordship, but... ...certainly not.\nSusato:\nHe didn't beat about the bush there, did he?\nRyunosuke:\nIn truth... ...Mr Shamspeare was found with a fork in his hand.\nJudge:\nA meal of soap is sounding increasingly likely, Lord van Zieks...\nMetermann:\nD'you mean to say...? He was using the fork to...\nRyunosuke:\nYes. To extract a frozen coin from the bar of soap.\nAltamont:\nAh!\nSusato:\nBut the bar broke in half... ...so perhaps it didn't go very well.\nJudge:\nGood gracious!\nVan Zieks:\n.........\nRyunosuke:\nL-Lord van Zieks!\nVan Zieks:\nI was throwing my hand up in despair... ...and happened to catch my hallowed bottle on the way. Pray, forgive my maladroit mistake.\nJudge:\nWhat is the meaning of this, Counsel?\nVan Zieks:\nAllow me to pose my learned friend a question: What exactly did you establish with your most recent cross-examination?\nRyunosuke:\nUm...well...\nSusato:\nThat Mr William Shamspeare is a liar and a thief. In other words...that his testimony is unreliable!\nRyunosuke:\nThat's it! That's exactly it!\nVan Zieks:\nVery well, let us assume the man is a liar. Now allow me to pose another question: What possible difference does that make?\nRyunosuke:\nWell...\nVan Zieks:\nWe know that suicide can be discounted. Scotland Yard's investigation revealed no sign of another vessel that contained poison.\nJuror No. 1:\n...!\nJuror No. 2:\n...!\nVan Zieks:\nAnd on the night in question, there were no visitors to the room except the accused. The young gasman's testimony, which we have no reason to doubt, has confirmed that.\nJuror No. 3:\n...!\nAltamont:\n...!\nVan Zieks:\nFurthermore...the only possible way the poison could have entered the victim's body is via the tea. The court has seen no evidence whatsoever that suggests otherwise.\nJuror No. 5:\n...!\nJuror No. 6:\n...!\nVan Zieks:\nEven if William Shamspeare is the liar you claim him to be... ...these facts have been objectively established. There's no escaping it!\nRyunosuke:\nAgh!\nVan Zieks:\nTherefore, in light of these facts... ...the prosecution calls for immediate adjudication!\nRyunosuke:\nY-You......... WHAAAAAAAAAAAAAAT?!\nJudge:\nOrdaaar! Ordaaar! Well, Counsel? How does the defence respond?\nSusato:\nM-Mr Naruhodo!\nRyunosuke:\n(What was the point of that last cross-examination? Did it actually get us anywhere? Or did it make no difference at all, like Lord van Zieks is saying?)\nRyunosuke:\nNo! This isn't over! The defence will not rest!\nVan Zieks:\nWhat?\nJudge:\nBut, Counsel, you've successfully explained everything! You've identified and substantiated the unscrupulous method employed by Mr Shamspeare to consume gas. What more is there to discuss?\nRyunosuke:\nLord van Zieks just highlighted three 'facts' in order to make his point. But contrary to what he would have the court believe, not all of them have been objectively established at all!\nVan Zieks:\nWhat are you trying to say, my Nipponese friend?\nRyunosuke:\nAt least one of those so-called facts is an assumption, made due to a lack of evidence.\nVan Zieks:\n...!\nRyunosuke:\nBut the situation has changed now following the cross-examination of the latest witnesses to take the stand.\nVan Zieks:\nDon't be absurd! What is this nonsense?!\nRyunosuke:\n(Yes, when you bring everything we've learnt so far together and consider it as a whole, it's clear... There's a question that we now need to consider. Namely...)\nRyunosuke:\nWe've all been led to believe that the strychnine poison that afflicted Mr Shamspeare... ...was in the tea brought to him by Mr Natsume. But that's conjecture at best.\nVan Zieks:\nVan Zieks:\nThe victim has testified that nothing else passed his lips that night. There is no other possibility. And since there was no trace of the tea left at the scene, it couldn't be tested for traces of the poison.\nRyunosuke:\nRyunosuke:\nAs I said, the situation has changed. Because in fact...some of Mr Natsume's tea WAS left at the scene! And a particular piece of evidence proves it!\nVan Zieks:\nVan Zieks:\nA ludicrous claim. Scotland Yard detectives investigated the scene exhaustively. What evidence are you suggesting they missed?\nJudge:\nThe defence has made a bold claim indeed. Very well, Counsel... Present your proof! What evidence from the scene of the crime can tell us about the nature of the defendant's tea?\nJudge:\nGood gracious! The soap again? The same bar the victim used to fashion his coins of ice?\nRyunosuke:\nYes, that's right, My Lord. It's just come back to me. Something about when we first found this bar of soap at the scene yesterday.\nSusato:\nIt's...more bars of soap!\nRyunosuke:\nSoap? What are bars of soap doing lined up on a ledge outside the window?\nRyunosuke:\nI'm quite certain that when we originally stumbled upon the bars of soap... ...there was actually a frozen coin in each bar.\nVan Zieks:\nSo you discovered the gas thief's coin factory. Fascinating...\nRyunosuke:\nIn a way, yes. But there's more. The coins we found in the soap at the time weren't normal ice.\nJudge:\nThere, there was something strange about them, you mean?\nRyunosuke:\nExactly. Something very obviously strange. They were red.\nVan Zieks:\nThe ice...was red? No... You mean...?\nRyunosuke:\nThat's right. It's obvious to me now. The fake coins in the soap...were made from frozen tea!\nVan Zieks:\n...!\nWHAAAAAAAT?!\nRyunosuke:\nI would remind the court of a statement made by Mr Natsume earlier in this trial...\nSoseki:\nThat evening, yes...I did take some freshly brewed tea with me when I visited Mr Shamspeare's room, as a gift. The public water pump outside always freezes at night, so I bought bottled water especially to make it. And this is the result! Never will I touch tea again! Never!\nJudge:\nAh yes. I believe there had been a snowfall that day. It was particularly cold. Sadly on such occasions, the poorly constructed water mains in the East End are prone to freezing.\nRyunosuke:\nSo on the night in question, Mr Shamspeare, having no running water to use... ...was forced to use the tea brought by Mr Natsume in order to make his fake coins!\nJudge:\nMy word!\nRyunosuke:\nThere were two bars of soap on the window ledge when my judicial assistant and I investigated the scene.\nSusato:\nThat's right. And we only borrowed one of them.\nRyunosuke:\nWhich means...that even as we speak, some of the defendant's tea is still present at the scene of the crime... ...frozen solid in a bar of soap outside Mr Shamspeare's window!\nJudge:\nExtraordinary!\nRyunosuke:\nEarlier today, Inspector Gregson informed the court... ...that if even one drop of the tea remained, Scotland Yard would be able to analyse it for poison. As such, we are now in a position to prove or disprove what has until now been mere conjecture... ...by finding out for sure whether or not Mr Natsume's tea actually contained strychnine at all!\nVan Zieks:\nArgh! You...smug Nipponese...!\nRyunosuke:\nMy Lord, we cannot do the defendant the injustice of passing judgement now! The police should be dispatched to recover the remaining bar of soap from the scene at once! And the defence requests a thorough analysis of the frozen tea embedded in it... ...to determine whether or not it contains any poison!\nJudge:\nBailiff! Bailiff! Instruct the police to attend the scene at once!\nBailiff:\nYes, My Lord! Understood!\nJudge:\nIt would seem we have no choice but to suspend these proceedings for the time being. I trust you have no objection, Lord van Zieks?\nVan Zieks:\nNone, My Lord.\nJudge:\nScotland Yard will recover the tea from the scene and carry out the requisite tests immediately. The trial will resume at the same hour tomorrow. The prosecution and defence may conduct further investigations as appropriate in the interim.\nRyunosuke:\nYes, My Lord!\nVan Zieks:\n.........\nRyunosuke:\n(Well... ...we managed to scrape through there somehow.)\nJudge:\nThank you, Counsels. Court is adjourned until tomorrow!\nTo be continued...22nd February, 1:11 p.m.\nNaruhodo's Legal Consultancy\nRyunosuke:\nWhew. We made it back in one piece...just. To be perfectly honest, I thought we were finished there for a while.\nSusato:\nOh, I know. What a lot of close shaves. There are so many carriages on the streets of London, you were very nearly flattened several times.\nRyunosuke:\nOh...no...I didn't mean that.\nSusato:\nYes, I know. It was a marvellous defence, Naruhodo-san, it really was. I was in awe of you!\nRyunosuke:\nOh! Um...thank you.\nSusato:\nAnd now that your fervent exploits have won us some more precious investigation time... ...let's see if we can't find some new clues for court tomorrow!\nRyunosuke:\nYes. Let's do that! .........\nSusato:\nEverything alright?\nRyunosuke:\nI suppose...I still can't quite believe it, that's all. That I'm here in England working as a lawyer, I mean. In the Old Bailey, no less.\nSusato:\n.........\nRyunosuke:\n(The truth is, it shouldn't be me, should it? It should be him standing in my shoes. It should be Kazuma.)\nSusato:\n...It was Kazuma-sama's wish that you follow him to Great Britain and work alongside him.\nRyunosuke:\nYes. I mean, I never had the chance to ask him exactly why, but...he clearly had a plan. I wouldn't be here today if it wasn't for him.\nSusato:\nAnd you're doing wonderfully, Naruhodo-san! I've no doubt that Kazuma-sama would say exactly the same if he were here with us.\nRyunosuke:\n...Thank you, Susato-san. Thank you.\n22nd February\nMr and Mrs Garrideb's Room\nSusato:\nMr Garrideb appears to be out.\nRyunosuke:\nHm, oh well. I suppose we'll just have to come back again later.\n22nd February\nSt Bartholomew's Hospital, Recovery Ward\nSusato:\n...What do you suppose is happening? It sounds like some sort of disturbance...\nRyunosuke:\nYes, I hear angry voices...\nShamspeare:\nBe not angry, o ample lady! Verily, thou art mistaken.\nGreen:\nMistaken, my foot! You were looking! You were looking at my painting!\nShamspeare:\n'The eye of man hath not heard, the ear of man hath not seen...' 'Twas foul indeed, the poison that moustached villain gaveth me! Forgive me, lady!\nGreen:\nI wish that you'd died from that poison!\nShamspeare:\nGod-a-mercy, ample lady! But thou seest, I have vigour still! Behold, my Shamspeare dance!\nSusato:\n...This looks rather ominous, doesn't it?\nShamspeare:\nAh... Lo, 'tis the lawyer from the land whence riseth the sun! How now?\nRyunosuke:\nUm, what are you doing here, Mr Shamspeare?\nShamspeare:\nMarry, I do believe I am return'd unto another ward!\nGreen:\nHe was looking, that's what he was doing! Looking at my terrible work!\nShamspeare:\n......... Eastern fellow, so dark yclad... ...faith, thy work in court this morning was wonderful. I do applaud thee!\nRyunosuke:\nOh, well...thank you.\nShamspeare:\nBut! That doesn't mean things will go so wonderfully for you tomorrow, does it?\nRyunosuke:\n...!\nShamspeare:\n...Anon, exeunt!\nRyunosuke:\n(Mr Shamspeare might technically be the victim in this case... ...but there's definitely a lot more to it than that. It's very hard to pin the man down.)\nGreen:\nI'm so sorry. I'm such an awful person.\nRyunosuke:\nAh, Miss Green. Is everything alright?\nGreen:\nOh...yes...I mean, don't worry about me. They're about to discharge me, so...I must get ready to leave now.\nRyunosuke:\nOh, I see.\nSusato:\nWe're delighted that you'll soon be well enough to go home, Miss Green.\nGreen:\nOh dear, you're too kind. I, I don't deserve it.\n22nd February\nSholmes's Suite\nIris:\nOh, Runo! And Susie! Hurray! You're back!\nSusato:\nHello, Iris. You're in fine spirits as always, I see.\nIris:\nI am! And you look as immaculately presented as ever, Susie!\nSusato:\nOh! You flatter me!\nIris:\nWell, you couldn't have come at a better time! I've just made a pot of tea. I'll set some cups.\nRyunosuke:\nReally? Thanks, Iris. (But actually... ...what is that foul smell?)\nSholmes:\nAh-ha! The wanderers return at last! Where on earth have the pair of you been?\nRyunosuke:\nUm...we've been in court?\nSholmes:\nOh! For Mr Moustache's case? That was today, was it?\nSusato:\nI'm sure I mentioned it only yesterday, Mr Sholmes.\nSholmes:\nI'm sure you think you did. Ah ha ha ha ha hah! ...Well, we can laugh about it now! So tell me...how did the trial go?\nRyunosuke:\nReasonably well so far. We've managed to escape without a guilty verdict at least.\nSholmes:\nReally? I would have liked to see it. And I must pass the time of day with Mr Reaper again. It's been too long.\nRyunosuke:\nIs Lord van Zieks an acquaintance, Mr Sholmes?\nSholmes:\nNaturally. There's not a person in the world who doesn't know my name, Mr Naruhodo.\nRyunosuke:\n(Not quite what I asked, but still...)\nSusato:\nMr Sholmes...whatever is that odour?\nRyunosuke:\nYes, what is it? It's faint, but...absolutely awful!\nSholmes:\nAh, indeed! That's the scent of victory, my dear fellows! Victory in science!\nSusato:\nOh dear...\nRyunosuke:\n(Alright, I'll bite. What's he up to now...?)\nAfter clearing all Converse options:\nRyunosuke:\nWell, I think we should go back to the scene and see if we can uncover any new clues.\nIris:\nThat's the spirit, Runo! See you later!\nSholmes:\nYes, until later.\nRyunosuke:\nNo no, Mr Sholmes! We were thinking you'd come with us.\nSholmes:\nYou were?\nRyunosuke:\nYes! Of course! You said so just a moment ago! You said we'd witness your forensic talents in action.\nSholmes:\nAh, yes. I do recall saying something along those lines. But you go on ahead. I shall be sure to follow you later...in all likelihood. ...Probably. ...Maybe. ...Well, I might.\nRyunosuke:\n...Your commitment astounds me.\nSusato:\nOh, thank you, Mr Sholmes! We'll eagerly await your arrival!\nIris:\nBye-bye, Runo! Bye, Susie!\n22nd February\nMr Natsume's Lodgings, Ground Floor\nRyunosuke:\nOh! Hello again, Inspector Gregson.\nGregson:\nWhat are you doin' here?\nRyunosuke:\nErm, well...we were hoping to have another look around, actually.\nSusato:\nThe lawyer representing the defendant has a right to examine the scene, as I'm sure you're aware.\nGregson:\nYeah, I know the score.\nRyunosuke:\nOh! Yes, one other thing... The soap on the ledge outside the window. Did you find it? With the tea in it?\nGregson:\nYeah, we found it alright. And there was a small amount of tea in it, as you said.\nRyunosuke:\n(I knew it!)\nGregson:\nIt's with the identification section at the Yard now. They're lookin' into it. The results should be available later today.\nSusato:\nThat's wonderful news! Thank you!\nGregson:\n......... Pretty impressive performance in court this mornin'.\nRyunosuke:\nSorry?\nGregson:\nNothin'! Forget it! Just make sure you don't disturb anythin' in here!\nRyunosuke:\nMr Sholmes! What are you up to over there?\nSholmes:\nWhat a question, indeed! Was it not your good self who asked me to attend the scene?\nGregson:\nOi! What are you doin' there, Sholmes?\nSholmes:\n'What are you up to over there?' 'What are you doing here?'... Dear me, once a great detective, one is always under scrutiny, it seems.\nSusato:\nIs now the time, Mr Sholmes? Are you about to show us your forensic talents in action as you promised?!\nSholmes:\nWith the greatest of pleasure, my dear madam!\nRyunosuke:\nUm...what's all this?\nSholmes:\n'All this' is precisely what you requested, Mr Naruhodo. Herlock Sholmes's sensational Skin Print Seeker gun! Moments ago, I took a sample from the teacup that was used by the victim.\nRyunosuke:\nA sample? From Mr Shamspeare's cup?\nSholmes:\nEach individual leaves microscopic secretions on everything he or she touches. A sample of those secretions is all I need to produce this... a refined indicator solution. By liberally spraying the room with this chemical... ...everything the victim touched is instantly revealed with the aid of these goggles. Here, try them out! There. Now, spray the chemical indicator about and all will be revealed?\nRyunosuke:\nSpray? How, how do I do that exactly?\nSholmes:\nA little press of [A / X / space] on the area you're interested in is all that's required. ...Like this!\nRyunosuke:\nAh! Wh-What is that stuff? It's like fog!\nSholmes:\nA suspension of the chemical indicator in a pressurised gas. It's the most efficient way to cover a large area. That was another invention I discovered incidentally whilst I was developing this idea.\nRyunosuke:\n(As you do...)\nSholmes:\nGo ahead! Try it, my dear fellow! We may learn something interesting about the victim's movements on the night in question.\nRyunosuke:\n(Well...there's nothing to lose, I suppose... Let's explore!)\nAfter spraying sides of painting and floor to right of table:\nRyunosuke:\nWell, we sprayed Mr Sholmes's amazing 'skin print' indicator all over this room, didn't we?\nSusato:\nWe did. But there are...two places in particular that are of interest, I would say.\nRyunosuke:\nThe handprints on the floor there...and on the wall by the picture, you mean?\nSusato:\nYes! And I think the floor warrants closer investigation! I won't be a moment... ......... Ah!\nRyunosuke:\nWhat is it, Miss Susato?\nSusato:\nLook here, Mr Naruhodo! One of the floorboards has popped out!\nRyunosuke:\nOne of the...? You mean... (It's a secret hiding place?!)\nSholmes:\nExcellent work, Miss Susato! So...what do we have in here?\nGregson:\nOi! What are you lot doin'?\nRyunosuke:\nInspector Gregson!\nGregson:\nStand aside right this minute! It's my job to investigate there!\nSholmes:\nNo need, Inspector. You continue to dig in to your portion of chips, whilst we dig around under the floor here.\nGregson:\nYour fancy talk's puttin' me off my food anyway, Sholmes! A new bit of evidence is exactly what I need.\nRyunosuke:\n(Wow, a secret hiding place under the floor! What a find!)\nSusato:\nIt's not a hiding place you could make use of in Japan. I don't think I could lift a straw tatami mat...\nRyunosuke:\nNo, I know. But I never expected one of these wooden floorboards to move, either. It's got me wondering about the wall over there, too. Aren't you curious?\nSusato:\nOh! I'll investigate at once! ......... There's nothing behind the picture, sadly. Only the wall.\nSholmes:\nHmmm... How disappointing.\nRyunosuke:\nBut then...how do you explain the handprints?\nSusato:\n...I really can't think why anyone would have been touching the wall over and over in one place like that.\n*Click!* *Whir...*\nSholmes:\nThere you are. A print for you.\nThe photograph of the handprints on the wall has been entered into the Court Record.\nRyunosuke:\nOh! Thank you very much! (His invention can make prints, too? Now then... ...I wonder if Inspector Gregson has found anything under the floor there...)\nSholmes:\nI'm desperate to know!\nSusato:\nSo am I!\nRyunosuke:\n(I'd love to know if there's anything hidden underneath that floorboard there...)\nSholmes:\nAllow me to ask Gregson now. After all, we're well acquainted. Inspector Gregson! Really, it's been too long!\nGregson:\n...What is it, Sholmes?\nSholmes:\nI thought perhaps you might show me what you've found there. Seeing as we're such good friends.\nGregson:\n...We're not friends.\nSholmes:\n...No, I...suppose not. A dismal failure!\nRyunosuke:\nYes...I heard. (Ugh, I'd kill to know what was under that floorboard.)\nGregson:\n......... Alright then, fair's fair.\nRyunosuke:\nWhat?\nGregson:\nYou did discover the hidin' place, after all. I suppose I should at least fill you in.\nRyunosuke:\nReally, Inspector? Thank you!\nSholmes:\nDo it quickly, my dear fellow! If there's one thing I know about this man, it's that he blows with the wind! As fickle as the weather!\nGregson:\nOi! Stop makin' me out to be some kind of nut! There were three items under the floor there: a newspaper clippin', a photographic print and a tin box. Now...what do you want to know?\nAfter clearing all options:\nMiaow...\nSusato:\nOh look! It's that lovely little kitty cat! What was its name...?\nRyunosuke:\nIt's Mr Natsume's, isn't it? I don't think we ever asked him, actually. Why don't we call it, um...Wagahai? You know, like Mr Natsume refers to himself in Japanese. (I wonder how he got in here? Clever cat...)\nSusato:\nOh, wonderful! Well then, Wagahai...here's something delicious I bought for you from the cats' meat man!\nWagahai:\nMiaow...\nSusato:\nHee hee...he couldn't be happier now, look.\nRyunosuke:\n(I just hope we can bring some happiness to his owner, too.)\nAfter clearing Converse options in Naruhodo's Legal Consultancy and clearing all options in Mr Natsume's Lodgings, Ground Floor:\n22nd February\nLocal Prison, Cell 9\nSusato:\nOh! Mr Natsume is back!\nRyunosuke:\nSo he is. ...Mr Natsume! Hello!\nSoseki:\nI...am a cat.\nRyunosuke:\nSorry?\nSoseki:\nI don't know who Mr Natsume is. Or Herr Lock Sholmes. I don't know about courts or trials or Old Baileys. I am a cat. That's what I am. Just a cat.\nSusato:\nMr Naruhodo! He's trying to escape from reality!\nRyunosuke:\n(Trying to? He already has! Completely!) SO, um...what is your name, then?\nSoseki:\n......... As yet I have no name.\nSusato:\nMr Naruhodo! He hasn't fully thought out his new identity yet! Maybe it's not too late to bring him back to reality!\nRyunosuke:\nDo you think...you could open your eyes for us, Mr Natsume?\nSoseki:\n......... I...am not a cat.\nSusato:\nIt worked! He's back in the real world!\nSoseki:\nWh-What's going to b-b-become of me? ...NO! DON'T ANSWER THAT! IT'S OBVIOUS! My accursed soul is never going to escape this accursed fate!\nSusato:\nMr Natsume, no! This morning's proceedings in court proved that there's hope!\nSoseki:\nYes... Yes... Locum Student Mr Naruhodo Esquire was brilliant, but... BUT! THE REAPER IS OMNIPRESENT! IN COURT! IN MY LODGINGS! Here! There! Everywhere!\nRyunosuke:\n(...What's he looking straight at me for?) I think perhaps...there are some things we should discuss?\nSoseki:\nOh! Yes... Yes, we must...\nAfter clearing \"Capital offender, Selden\" and \"The convict's curse\" Converse options in Local Prison, Cell 9:\n22nd February\nMr and Mrs Garrideb's Room\nRyunosuke:\nAh, you're here now, Mr Garrideb.\nGarrideb:\nRight bally business it is for me, you know. Getting out and about.\nRyunosuke:\nWere you at the Old Bailey, by any chance?\nGarrideb:\nNaturally. Fate of my lodgings hanging in the balance and all that. Not a trial to miss.\nRyunosuke:\n(The fate of what's already been dubbed your 'haunted lodgings', yes...)\nGarrideb:\n'Course, the place has caused quite a stir around the capital on more than one occasion already. As the old 'haunted lodgings' or some such.\nRyunosuke:\nAh... (Well, at least he knows.)\nGarrideb:\nMakes you wonder what the blazes is going on, don't you know?\nSusato:\nYes...I'm sure it does. In fact, thinking back to Mr Natsume's other trial just two days ago... ...you were at the Old Bailey then as well, weren't you? Testifying with your wife about what happened.\nGarrideb:\n...Stopped off at the prison on the way home, in fact. Beastly business.\nRyunosuke:\nI see...\nGarrideb:\nSo...what brings you to my haunted abode today, eh?\nAfter clearing all Converse options:\nGarrideb:\nAh! That reminds me, actually...\nRyunosuke:\nYes?\nGarrideb:\nAbout young Duncan. The night before the poor chap perished... ...he'd been writing a letter. A letter of affection to a young lady.\nSusato:\nA love letter, you mean?!\nGarrideb:\nYes, where did I put it now...? Ah, here it is! Left it on my desk.\nSholmes:\nIf you'll excuse me... Let me see now, what does it say...? 'To my most beautiful and charming sweetheart...'\nSusato:\nUm...do you think that we should be reading such a personal piece of correspondence?\nSholmes:\nMy dear Miss Susato, that is precisely why I prefaced my reading with 'If you'll excuse me'!\nSusato:\nI will NOT excuse you, Mr Sholmes, no!\nGarrideb:\nSadly he didn't address it, though. So I've no means of delivering the thing. Rather sad, really...\nRyunosuke:\nI see... (That's going to play on my mind...)\nSusato:\nBut really, the identity of Mr Ross's sweetheart has no bearing on the case. I think we should leave well alone.\nRyunosuke:\nYes, I suppose you're right.\nSholmes:\nIndeed, the intended recipient's address is missing. However... ...there is a name attributed to the man's 'most beautiful and charming sweetheart'.\nSusato:\nMr Sholmes, please! I've already had to chastise you about this once.\nSholmes:\n'...My undying love to you, my colourful darling, Olive Green.'\nSusato:\nAh!\nRyunosuke:\nO... Olive Green?! (The woman who was plunged into a coma after a knife plunged into her back outside this house five days ago! The victim of the last case Soseki-san was in court for, who regained consciousness only yesterday! Is it just chance that her name has come up now? Could it possibly be a mere coincidence?)\nSusato:\nMr Naruhodo, whatever can this mean?\nSholmes:\n...Reading personal correspondence can have its merits, you see, Miss Susato. Ah ha ha ha hah!\nAfter clearing all Converse options in Local Prison, Cell 9 and Mr and Mrs Garrideb's Room:\n22nd February\nSt Bartholomew's Hospital, Recovery Ward\nSusato:\nMr Naruhodo, I've just finished speaking with the doctor. It seems Miss Green is well enough to be discharged at last.\nRyunosuke:\nThis is good news. But hopefully, just before she leaves-\nSusato:\nAh!\nRyunosuke:\nWhat is it? Miss Green! (What was that?! She clearly just hid something behind her back!)\nGreen:\nOne, one moment! ...I'll be with you in a jiffy! Oh...hello, everyone. What are you all doing here? The doctor has said I can be discharged, so I'm just getting my things together.\nSusato:\nMiss Green...what were you just doing?\nGreen:\nOh! Um...nothing...really. I was just about to take some medicine the doctor prescribed for me, that's all.\nRyunosuke:\nWell...we were hoping to have another quick chat with you if that's alright?\nGreen:\nI...don't really have anything else to tell you.\nRyunosuke:\n(Alright, she's definitely behaving strangely. Let's see if we can't coax something out of her...)\nRyunosuke:\nMiss Green, we were hoping to ask you about someone. Mr Duncan Ross. You...knew him, didn't you? Oh no! I'm so sorry! (The bottle of medicine fell down when she did!)\nSusato:\nOh, Miss Green! Are you alright?\nRyunosuke:\nI'm so sorry. I didn't mean to startle you like that.\nGreen:\nNo. No, it's alright. I just wasn't expecting it. But how do you know about Duncan?!\nSusato:\nMr Ross had been writing a letter when he passed away. The landlord found it in his room. It...was a very personal letter...to you.\nGreen:\n......... It was at the art school. That's where I met Duncan. A year ago now. He was working to fund his studies. He dreamt of becoming a professional artist one day.\nSusato:\nAnd the two of you became romantically involved?\nGreen:\n...Yes, that's right. We were very much in love. We were engaged to be married, actually. That's why he decided to move into a cheaper room. To save money for the wedding.\nRyunosuke:\nAnd that's what led him to Mr Garrideb's...\nGreen:\nYes. He told me he'd found the worst, but cheapest room in the entire East End. And then...one month ago... That's when it happened.\nSusato:\nWe're so terribly sorry, Miss Green.\nGreen:\nWell...it's all in the past now, I suppose.\nSusato:\nPoor Miss Green... She looks desperately sad.\nRyunosuke:\n(I was starting to think that's just her 'look'... ...but now I see that she has every reason to feel the universe is against her.)\nAfter clearing Converse option and presenting Hidden Photograph:\nGreen:\nUm...I do hope you won't think I'm being rude, but... ...would you mind leaving me in peace now? I have to leave the hospital soon.\nRyunosuke:\nOh, I'm so sorry! We didn't mean to hold you up. Of course, we'll be on our way-\n???:\nMr Naruhodo!\nSholmes:\nSurely you were not about to leave? That's quite out of the question!\nRyunosuke:\nWha... Mr Sholmes! I didn't realise you were here!\nSholmes:\nBut of course I was, my dear fellow. Watching intently from the shadows as always.\nRyunosuke:\nWell...make your presence known next time!\nSusato:\nMr Sholmes, what's this about?\nSholmes:\nSomething which occurs to me with some regularity, Miss Susato, is this: Why do detectives insist on such an ex post facto modus operandi? Why solve a case after it's happened... ...instead of preventing a case before it happens? That is what sets a great detective apart!\nRyunosuke:\nWhat do you mean?\nSholmes:\nThere is a case waiting to happen under our very noses, Mr Naruhodo. So let us avert disaster! Let us prevent this case from ever happening...with nothing but careful observation.\nRyunosuke:\n...Alright.\nSholmes:\nAll the clues you need are set before you. You need only look, and you cannot fail to see!\nSusato:\nYou can do it, Mr Naruhodo! I know you can!\nAfter clearing all Converse options:\nGreen:\nI think...I really will have to ask you to excuse me now. I've told you everything.\nRyunosuke:\n...Yes, I'm very sorry to have had to drag up such painful memories for you.\nGreen:\nNo, it's fine.\nSusato:\nMiss Green... ...please, promise us you won't try to...do anything like that again.\nGreen:\nYes, don't worry. Your detective friend has the bottle now anyway. And besides... ...I've been stabbed in the back and had a close shave with a bottle of poison and I'm still here. I think...I'm destined to see things through to the end. It might sound a little conceited, but, well...that's how all this has made me feel.\nLeaving Miss Green and St Bartholomew's behind... ...we made our way back to Baker Street with Mr Sholmes.\nSholmes:\nWell, it would appear we've reached the end of the investigative trail for today.\nRyunosuke:\nYes...it's late.\nSholmes:\nAnd, Mr Naruhodo...? ...Did you discover anything that may be of use to you in court tomorrow, do you think?\nRyunosuke:\nDetails about Mr Shamspeare...Mr Garrideb's lodgings... the convict, Selden... There are many facets to this case, and we're yet to see to the heart of it, if you ask me. That's my feeling, anyway.\nSusato:\nI can't help wondering about the results of the analysis.\nRyunosuke:\nInto Mr Natsume's tea, you mean?\nSusato:\nYes. Will they have found strychnine in it or not?\nSholmes:\nWell, I fear that either way... ...it will be hard to escape the grip of our friend Mr Reaper.\nSusato:\nOh dear...\nRyunosuke:\n(Yes, Barok van Zieks...)\nSholmes:\nBut I wish you every success, of course. And though I was late to rise this morning... ...tomorrow will be a new dawn! I intend to spring from my bed at a crisp hour and attend the trial.\nSusato:\nMr Sholmes! You're going to come?\nSholmes:\nIndeed! Whatever happens, I shall be there! ...Assuming my eyelids cooperate in the morning.\nRyunosuke:\nWell...I think we've done all we can. All that's left is to remain focused and keep fighting for Mr Natsume's cause until the very end.\nLondon, the world's most prosperous city, home to some six million people. But away from the razzle-dazzle, down back alleys and behind bricked-up windows...the lonely lurk. Soseki-san had battled long and hard with loneliness during his many months here. And so I felt honour-bound to battle equally hard for my compatriot. To lift the curse that gripped him. As Mr Sholmes said, tomorrow would be a new dawn...for all of us!\nTo be continued...",
  "characters": [
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Susato Mikotoba",
      "age": "16",
      "description1": "A judicial assistant sent to Britain on a study tour. She's the epitome of a refined Japanese lady and a huge help to me always."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Iris Wilson",
      "age": "10",
      "description1": "An extraordinary young girl who lives with Mr Sholmes. She has a degree in medicine and is the author of a popular series of short stories."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Herlock Sholmes",
      "age": "34",
      "description1": "There's not a person in the world who hasn't heard of this famous great detective, whose deductions never fail to surprise."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Olive Green",
      "age": "20",
      "description1": "An art-school student whose ambition is to become an artist. She's just regained consciousness, having been comatose for days after suffering a stab to from the back."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Soseki Natsume",
      "age": "33",
      "description1": "A Japanese scholar sent to London to further his research into the English language. He's just been acquitted of a very serious crime.A Japanese scholar sent to London to further his research into the English language. He's just been acquitted of a very serious crime, but now finds himself accused of another."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Tobias Gregson",
      "age": "44",
      "description1": "The detective inspector in charge of Scotland Yard's investigation of the case. He's stern and single-minded in his approach, and a great lover of fish and chips."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "William Shamspeare",
      "age": "31",
      "description1": "The victim of the current case - a failed actor renting a room in the same building as Mr Natsume's lodgings."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "John Garrideb",
      "age": "46",
      "description1": "A retired army man who's the landlord of the lodgings rented by the defendant, Mr Natsume. An old knee injury means he's confined to a chair most of the time."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Barok van Zieks",
      "age": "32",
      "description1": "A prosecutor known as the Reaper of the Bailey. Supposedly, the souls of those he prosecutes are eternally damned, one way or another."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Adron B. Metermann",
      "age": "23",
      "description1": "A young man who works for Altamont Gas. He's a witness to the incident."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Quinby Altamont",
      "age": "38",
      "description1": "The wife of the owner of the Altamont Gas Company. She's a staunch believer in the superiority of the fuel and utterly unforgiving of gas theft."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Duncan Ross",
      "age": "21",
      "description1": "The love of Miss Green's life, who sadly passed away a month ago as a result of gas poisoning."
    }
  ],
  "evidences": [
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Armband",
      "type": "",
      "obtained": "",
      "description1": "An armband I inherited from Kazuma. It identifies the wearer as a defence lawyer throughout the Empire of Japan."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Secondhand Book Receipt",
      "type": "",
      "obtained": "",
      "description1": "A receipt for some books that Mr Natsume purchased at a secondhand bookshop. It was submitted as evidence in the trial the other day."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Nearby Street Map",
      "type": "",
      "obtained": "",
      "description1": "A street map of the neighbourhood where Mr Natsume has his lodgings. It was submitted as evidence in the trial the other day."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Pair of Teacups",
      "type": "",
      "obtained": "",
      "description1": "The teacups used by Mr Shamspeare and Mr Natsume. The one with the green line around the rim was Mr Natsume's.",
      "description2": "The teacups used by Mr Shamspeare and Mr Natsume. There is no tea ring on the inside of Mr Natsume's cup."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Torn-Off End of Envelope",
      "type": "",
      "obtained": "",
      "description1": "A ripped piece of an envelope that was found in Mr Shamspeare's room. The rest of the envelope could not be located.",
      "description2": "A ripped piece of an envelope that was found in Mr Shamspeare's room. It fits perfectly with an envelope in Miss Green's possession."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Bar of Soap",
      "type": "",
      "obtained": "",
      "description1": "A cheap bar of soap that was discovered just outside Mr Shamspeare's window. It's one of two that were found there.",
      "description2": "A cheap bar of soap that was discovered just outside Mr Shamspeare's window. There is a two centimetre diameter circular depression in the middle of one surface."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Crime Scene Photograph",
      "type": "",
      "obtained": "",
      "description1": "A photographic print of the scene taken by police upon their arrival. The victim can be seen unconscious at the table, having been poisoned."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Victim's Medical Report",
      "type": "",
      "obtained": "",
      "description1": "A report issued by Scotland Yard's medical officer. It obviously mentions the poison as well as other details gleaned during the police investigation."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Gas Meter",
      "type": "",
      "obtained": "",
      "description1": "A meter that dispenses gas for a set time after a coin is inserted. It sports a very strong lock, especially with Mr Shamspeare in mind.",
      "description2": "A meter that dispenses gas for a set time after a coin is inserted. The attached coin box sports a very strong lock, and there is a tiny hole in its base."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Handprints on the Wall",
      "type": "",
      "obtained": "",
      "description1": "Traces of handprints on the wall, discovered using the Skin Print Seeker gun. There are multiple prints on either side of a hanging picture."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Capital Offender Article",
      "type": "",
      "obtained": "",
      "description1": "A newspaper article about Selden, a criminal sentenced to receive the death penalty. However, he died of illness in prison whilst his loot remained undiscovered."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Hidden Photograph",
      "type": "",
      "obtained": "",
      "description1": "A photographic print found in Mr Shamspeare's room. It shows the landlord, Mr Garrideb, together with a young man."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Bottle of Poison",
      "type": "",
      "obtained": "",
      "description1": "A bottle found in the possession of Miss Green with traces of the slow-acting poison strychnine inside."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Capital Offender's File",
      "type": "",
      "obtained": "",
      "description1": "Scotland Yard's file about the convicted criminal Selden that includes the newspaper article about him dying of illness in prison."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Miss Green's Card",
      "type": "",
      "obtained": "",
      "description1": "A note in an envelope that seems to have been ripped open rather roughly. It contains instructions to meet with someone who claims to have information about Duncan Ross.",
      "description2": "A note in an envelope that seems to have been ripped open rather roughly. The envelope fits perfectly with a torn-off piece found at the scene of the crime."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "The Memoirs of the Clouded Kokoro\n\n\n\n\n\n\n\n\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 423rd February, 9:23 a.m.\nThe Old Bailey, Defendants' AntechamberSoseki:\n.........Susato:\n.........Ryunosuke:\n.........Susato:\nThis is it then, Mr Naruhodo.Ryunosuke:\nYes. It's time to put an end to this now. To the miserable 'curse' that has been plaguing Mr Natsume... To everything!Susato:\nAnd in my own small way, I shall do everything I can to help you!Ryunosuke:\n...I always appreciate your help, Miss Susato.Soseki:Suffering Soseki Selfishly Sidelined!Susato:\nAh!Ryunosuke:\nGood...morning to you too, Mr Natsume.Soseki:\n'GOOD MORNING'...? 'GOOD MORNING', LOCUM STUDENT MR NARUHODO ESQUIRE?! LISTEN TO YOU TWO CHATTING AWAY HAPPILY AS IF THE MAIN PLAYER OF TODAY'S TRIAL ISN'T HERE! WHY WOULD YOU DO THAT? WHY?!Susato:\nOh dear... We didn't mean to cause offence, Mr Natsume. I thought perhaps that because you had your eyes shut so tightly, you were meditating. Finding inner calm. It seemed wrong to disturb you.Soseki:\nI was waiting! 'What's the matter, Mr Natsume? You seem...different somehow today...' 'Why naturally. That's because I've attained spiritual enlightenment. The path of literature, you see, is a journey to discover one's own death!' ...Or suchlike. That's the sort of morning conversation I was hoping for! That's why I had my eyes shut!Ryunosuke:\nI...missed the signs, I'm afraid. Somehow. You'll have to forgive me.Susato:\nAnd you mustn't talk of your path leading you to death, Mr Natsume!Soseki:\nTHAT WAS JUST AN EXAMPLE!Ryunosuke:\n(...Oh yes, there it is. Inner calm...)Soseki:\nYou, you barely came to see me at all yesterday. I, I was sure you'd abandoned me and returned to our beautiful, long-lost homeland!Susato:\nWe've not even been in Great Britain a week yet.Ryunosuke:\nYes, well, anyway... ...I intend to set everything straight in court today. I'm determined to uncover the truth.Soseki:\n...! I've actually reached an important decision myself.Ryunosuke:\nOh? What sort of decision?Soseki:\nI shall fill you in after the trial!Ryunosuke:\n...Alright.Susato:\nIt would seem... ...Mr Sholmes isn't coming today, after all. It's a very clever message, I think! 'My dear fellows, you must win this battle on your own merits!'Ryunosuke:\nIt's a very clear message, I think. That he's overslept again.Soseki:\nThe 'great detective'? My arch-nemesis... LONG MAY HE STAY AWAY! ...If you ask me.Bailiff:\nDefendant! And your legal representative! The trial is about to begin. Make your way into the courtroom immediately!Ryunosuke:\n(Today, once again, we face the Reaper. And when the Reaper stands for the prosecution, the defendant's fate is sealed. But I don't believe in that legend any more than I believe in Soseki-san's curse. The truth is hidden here somewhere. And I won't let it escape me. I have to keep believing in my client, and keep fighting to the very end. That's all!)23rd February, 9:40 a.m.\nThe Old Bailey CourtroomJudge:\nIn the name of Her Majesty the Queen, I hereby declare this court to be in session. I call upon the counsels for the prosecution and defence to declare their willingness to proceed.Van Zieks:\nThe prosecution is ready.Ryunosuke:\nYes, the defence is ready!Judge:\nVery good. And now I call upon the six ladies and gentlemen of the jury... ...chosen by lot to represent the will of the people in this trial. Are you ready to proceed?Juror No. 1:\nAbsolutely! Justice will be done, you mark my words!Juror No. 2:\nI feel obliged to say...I feel especially ruthless on days when my hat is sitting just right.Juror No. 3:\nOh...well I wonder if you could adjust my hat for me. And please, be as ruthless as you like...Juror No. 4:\nThieves deserve to die if you ask me. Especially gas thieves! I've no sympathy for the man at all!Juror No. 5:\nLook! I said it yesterday and I'll say it again now. I don't have time for this! I've got my own problems!Juror No. 6:\nOh, may the Lord show us all the light here, and lead His flock to a righteous verdict again today...Judge:\nNow...Lord van Zieks, what can you tell us?Van Zieks:\n.........Judge:\nThe prosecution's report, please, for the court. In relation to the theory expounded by the defence yesterday...regarding the defendant's tea.Ryunosuke:\n...! (So he does have the results...)Van Zieks:\n...Before the prosecution delivers the black news about the black tea belonging to the blackguard in the dock... ...pray, allow me a moment to savour a liquid of a more sanguine hue. In fact, I'll defer to the good detective for the report. ...Here's to you, Inspector.Gregson:\nYes, sir! Thank you, sir. As indicated by the defence, we found a bar of soap just outside the victim's window in the snow. And there was indeed a frozen reddish liquid in a little depression on the top of it.Ryunosuke:\nYes! That's the tea! That's what Mr Natsume brought with him that night!Gregson:\nWell the brains at the Yard analysed it, and yes, you're right: it was tea. And there wasn't a trace of strychnine or any other toxic substance in it.Susato:\n...! No poison at all!Gregson:\nIn other words...the tea that the defendant brought with him to the victim's room...is innocent. It's in the clear.Judge:\nWhat a revelation!Ryunosuke:\n(As I suspected...) This makes it quite clear! The defendant, Mr Soseki Natsume, is blameless here!Van Zieks:Van Zieks:\nMy learned friend is jumping to conclusions again. ...A typical Nipponese reaction.Ryunosuke:\nWhat?!Van Zieks:\nYes, it's true, no poison was found in the few drops of liquid recovered from the soap on the window ledge. But! What logic is that? Would you take a drop from the Thames and conclude that the water in the ocean isn't salty?Judge:\nMy word! The water in the ocean is extremely salty, Counsel!Van Zieks:\nExactly! Unfit for drinking! Just as the victim's tea was on the night in question, as the court has already heard. 'Bitter' was the precise word from the lips of Mr William Shamspeare... ...whom the prosecution now calls back to the stand!Judge:\nVery well, I will uphold the prosecution's request.Susato:\nMr Shamspeare...Ryunosuke:\nYes, it sounds like we're going to have another confrontation with our theatrical friend.Judge:\nBailiff! Show Mr Shamspeare to the stand!Van Zieks:\nMr William Shamspeare...the victim of this despicable crime.Shamspeare:\n'O Heaven! O Hell! Do you command me to remember?' Forsooth, 'twas I, Shamspeare, did have a bellyful of the foul fluid giv'n! In mine innocence!Judge:\nYes...but as was revealed in yesterday's proceedings... ...the witness is not as innocent as we had perhaps first been led to believe.Van Zieks:\nBy using bars of soap such as this, he has been stealing gas from the supply company, yes.Shamspeare:\n'One may smile, and smile, and be a villain...' Forsooth, 'twas I, Shamspeare, did have a roomful of the sweet fuel giv'n!Juror No. 1:\nThat's right! Fellow jurors, don't forget...this man is a rotten thief!Juror No. 5:\nI haven't forgotten! Kept all that about the ice coins a tidy secret, didn't you? You should've owned up sooner.Juror No. 4:\nArrest him, I say! Arrest him at once! And let him feel the sting in my tail!Shamspeare:\nO, indeed! By dint of vile and cowardly means have I plotted to further mine own ends. I confess! Thou wouldst not pardon my sins, of that I am sure.Ryunosuke:\nIf you acknowledge your wrongdoing, what exactly are you doing here?Shamspeare:\n'Cowards die many times before their deaths.' And for a coward such as I...death be well deserv'd. But! Would it that a still greater crime passeth unpunish'd? For lo! The hairy-faced gentleman of farther East than Verona did contrive to poison me!Ryunosuke:Ryunosuke:\nBut there was no poison in the tea found in your room! The police have attested to that.Van Zieks:\nWhat the defence would assert as an inconsistency will quickly be cleared up by the witness's testimony. Is that not so, Mr Shamspeare?Shamspeare:\nVerily, my liege! I would most gladly speak!Judge:\nVery well. Let the witness testify to explain this inconsistency. Tell the court why it is that poison apparently entered your body, though none was found in the tea!Witness Testimony\n- The Tea Inconsistency -Shamspeare:\nThe Japanese man did come to my chamber with tea brew'd in a pot.\n'Twas in my cup alone that the wicked miscreant secretly pour'd his wicked poison.\nWhilst feigning distraction in our debate, ne'er did a drop of his own drink pass his lips.\nWhen he departed by and by, I did use the tea that remain'd in his cup to make my coins of ice.\nThus 'tis no surprise that poison be not found in the tea I did pour into the moulds of soap.Van Zieks:\nThe poison was slipped into the cup after the tea had been poured. The normal way for poison to be administered...in my experience.Judge:\nQuite. Otherwise it would be disastrous if the poisoner were to mix up the cups, for instance.Ryunosuke:\nBut no poison bottle was found at the scene!Van Zieks:\nBecause, quite simply, the Nipponese took the bottle back to his own room.Ryunosuke:\n...!Van Zieks:\nThe absence of a vessel containing the poison only becomes problematic when considering suicide.Ryunosuke:\nUgh... (I knew that...)Van Zieks:\nBy now it should be perfectly clear. A bar or two of cheap soap... ...is wholly insufficient to was the deep stains of guilt from the accused's hands.Ryunosuke:\nAgh!Shamspeare:\nSirs! Madams! 'Tis true that I, Shamspeare, be a common thief of gas... But... BUT! Listen here, ladies and gentlemen... Wherefore would I lie? Verily, I have no cause! I have nought to lose!Juror No. 2:\nWell...Juror No. 3:\nI do declare...Judge:\nThank you for your testimony, witness. Counsel, proceed with the cross-examination!Ryunosuke:\nYes, My Lord!Cross-Examination\n- The Tea Inconsistency -",
      "testimonies": [
        {
          "testimony": "The Japanese man did come to my chamber with tea brew'd in a pot.",
          "person": "Shamspeare",
          "present": []
        },
        {
          "testimony": "'Twas in my cup alone that the wicked miscreant secretly pour'd his wicked poison.",
          "person": "Shamspeare",
          "present": []
        },
        {
          "testimony": "Whilst feigning distraction in our debate, ne'er did a drop of his own drink pass his lips.",
          "person": "Shamspeare",
          "present": [
            "Pair of Teacups"
          ],
          "source": {
            "evidence_span": "The teacups used by Mr Shamspeare and Mr Natsume. There is no tea ring on the inside of Mr Natsume's cup.",
            "testimony_span": "Whilst feigning distraction in our debate, ne'er did a drop of his own drink pass his lips.",
            "explanation": "If Mr Shamspeare's tea cup has a ring, it means Mr Mr Shamspeare has not drink the tea, and thus cannot be poisoned.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "When he departed by and by, I did use the tea that remain'd in his cup to make my coins of ice.",
          "person": "Shamspeare",
          "present": []
        },
        {
          "testimony": "Thus 'tis no surprise that poison be not found in the tea I did pour into the moulds of soap.",
          "person": "Shamspeare",
          "present": []
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Shamspeare is testifying about the events of the night in question, and how he was poisoned.",
      "labels": [
        "physical",
        "causal"
      ],
      "reasoning": [
        "Fact 1: The witness claims Mr. Natsume did not drink from his cup.",
        "Fact 2: The evidence suggests Mr. Shamspeare's cup has a ring.",
        "Prop 1: If Mr. Shamspeare's cup has a ring, then Mr. Shamspeare has not drink the tea, but not Mr. Natsume."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "Shamspeare:\nThe Japanese man did come to my chamber with tea brew'd in a pot.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nI understand that you were already acquainted with Mr Natsume. Is that correct?\nShamspeare:\n'I know thee not, old man. Fall to thy prayers.' Do I know thee, or know thee not? Methinks 'tis all I can know that thy destiny mingles with mine.\nRyunosuke:\n...You lost me at the first 'thee'.\nShamspeare:\nZounds, sir! Thou must learn the English tongue afore thou turns thy hand to lawyering!\nRyunosuke:\n(I did. But I must have missed the Archaic Elizabethan lecture...)\nShamspeare:\nVerily and in truth, 'twas a fine-flavoured brew. Though a drop of poison did barb its sweetness. As the thorn doth barb the sweet rose. That, dear friends, be the simple truth.\nSusato:\nListen to Mr Shamspeare... He seems in even better form than he was yesterday.\nRyunosuke:\nEither that, or I'm in worse form...\nShamspeare:\nThat fated evening, after I did dine... ...at Grub's Grubbery - a local alehouse of good report... ...nought did pass my lips but the tainted black tea. But behold! The poison was not in the tea at first!Shamspeare:\n'Twas in my cup alone that the wicked miscreant secretly pour'd his wicked poison.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nAre you saying that you saw the moment when the poison was added to your tea?\nShamspeare:\n...To have witness'd the act and then drank the tea? Thou dost describe the actions of a fool.\nJudge:\nQuite so, quite so.\nShamspeare:\nBut no one likes going thirsty, do they? Sooner would I die quench'd than parch'd...would I have the choice.\nRyunosuke:\nActually, on the night in question, the water main was frozen, I believe, wasn't it?\nShamspeare:\nWere it not for the tea, in sooth I would sooner have died frozen than quench'd or parch'd.\nRyunosuke:\n(Right... No ice coins means no heating...)\nVan Zieks:\nThe witness had more than one brush with death on the night in question, it would seem.\nJudge:\nHmmm...\nVan Zieks:\nRemind the court,  Mr Shamspeare...as to whether the accused drank any of the tea which he brought with him.\nShamspeare:\nWith the greatest of pleasure, my liege...Shamspeare:\nWhilst feigning distraction in our debate, ne'er did a drop of his own drink pass his lips.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nBut the teacup Mr Natsume drank from was found completely empty at the scene! And let's not forget the defendant's maxim: 'Drink tea while it's hot!'\nShamspeare:\n...I did gulp from the poison'd cup that night. And in mine agony did I writhe uncontroll'd. In fits of pain I did knock the fellow's cup and its contents spilt as blood from a gaping wound...methinks. ...Though certainly, 'twas after I had made the coins of ice from his tea.\nVan Zieks:\nAn upset cup was found on the table that the victim was slumped over. There is no contradiction here.\nSusato:\nIt's true, there was no tea left in either cup that we found at the scene. But still...something about this statement is troubling me.\nRyunosuke:\nYes! Of course! I know what it is! It's Mr Natsume's wise 'drink tea while it's hot' maxim, isn't it?\nSusato:\n......... No, I'm not sure that's it...\nJudge:\nThank you, witness. Now reiterate for the court what it is that occupied you after your guest had left and before you drank your tea.Present Pair of Teacups (after examining inside of Soseki Natsume's cup)\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"You claim that Mr Natsume didn't drink a drop of tea on the night in question...\"Shamspeare:\nWhen he departed by and by, I did use the tea that remain'd in his cup to make my coins of ice.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYes, so that you could cheat the gas company, in fact. ...Isn't that right?\nShamspeare:\nTo cheat...or to die... 'Tis life's only choice.\nRyunosuke:\n...Yeees.\nShamspeare:\nFaith, to cheat be the wise choice! And mine occupation be not an ugly one! Prithee, dost thou not see beauty in the simplicity of the ruse?\nJuror No. 4:\nNo, I don't. And be very sure, sir... ...once this trial is over, Altamont Gas will take you to ask over this! Legal task!\nShamspeare:\nI shall not run! I shall not hide! Sooth to say, I have nowhere to run nor to hide... But my lady! What wouldst thou with this pitiful player?\nJuror No. 4:\nOh, I'll tell you what I'd like to do with you. Starting with the shoddy shirt on your back.\nShamspeare:\n......... ...'Tis time for a Shamspeare dance!\nSusato:\nWhat a harsh world we live in...\nVan Zieks:\nThe thieving of the gas was addressed in yesterday's proceedings. The prosecution calls on the defence not to muddy the waters with irrelevancy.\nJudge:\n...Consider that a warning, Counsel.\nRyunosuke:\nYes, My Lord! (Why am I the one in trouble here?)\nVan Zieks:\nMr Shamspeare, after the accused returned to his own lodgings, you used his tea to make your...coins. Is that correct?\nShamspeare:\nTo cheat or to die... I did make my choice many moons ago.Shamspeare:\nThus 'tis no surprise that poison be not found in the tea I did pour into the moulds of soap.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nIf, having first made your special coins, it was after two in the morning when you collapsed... ...that would mean you can't have drunk any tea yourself until around that time.\nShamspeare:\nOnce ensnared by literary debate, nought else be found in the furrows of the mind.\nRyunosuke:\nThe debate about Romeo and Juliet, you mean? And who was the stronger of the two.\nShamspeare:\nRightly did I pay no heed to the tea as I wrestled with the abominable fellow.\nRyunosuke:\n(I don't remember debates like that when I was studying...)\nJudge:\nAre you suggesting that neither of you actually drank the tea whilst it was hot that evening?\nShamspeare:\nMy Lord, wouldst thou be privy to some Shamspearean wisdom? 'Husband, wife and tea ought aye tepid be!'\nSusato:\nAh yes, so very true. Everyone has different preferences when it comes to tea.\nRyunosuke:\n...I think you might have interpreted that wrongly.Ryunosuke:\n(Hm... So it's been proven that there was no poison in Soseki-san's tea. That should be hugely in our favour. But the atmosphere in this courtroom today...)Susato:\nIt feels as though everybody is against us, Mr Naruhodo.Ryunosuke:\nIt must be the Reaper's poison.Susato:\nI'm afraid that if we don't find a significant flaw in this testimony somewhere... ...the jury will pounce and find Mr Natsume guilty!Ryunosuke:\n(It really feels like we've jumped into the fire here...)Ryunosuke:\nYou claim that Mr Natsume didn't drink a drop of tea on the night in question... ...but that's impossible.Shamspeare:\nHow, how, how, choplogic? What is this, ye dark yclad fiend?Ryunosuke:\nThe two teacups from the scene - one used by the victim and the other by the defendant... ...have a clear difference between them...one that represents incontrovertible proof!Judge:\nIncontrovertible?Van Zieks:\nWhat difference?Ryunosuke:\nLook at the inside of the cups. Just here...there's a clearly visible ring.Van Zieks:\nYes... A tea ring. Commonplace enough.Judge:\nIndeed. Such stains occur all too readily when one leaves tea in the cup for a while.Ryunosuke:\nAnd yet...Nr Natsume's cup has no such ring.Judge:\nGood Lord! You're right! It's completely clean...Shamspeare:\nAnd prithee, sir, what mak'st thou of it?Ryunosuke:\nExactly what Mr Natsume told the court yesterday. The Japanese saying he quoted!Juror No. 3:\nDrink...Juror No. 5:\n...Tea...Juror No. 1:\n...While it's hot!Ryunosuke:\nThat's right! Yes... ...the jittery Mr Natsume was true to his usual self that night, and drank his tea in no time.Shamspeare:\nUh...Ryunosuke:\nIf, as you claim in your testimony, he didn't touch a drop of his tea... ...a ring would have developed on the inside of his cup as well, after the several hours the tea was left standing.Shamspeare:\nBut...erm...Ryunosuke:\nIn short, Mr Shamspeare... ...you clearly lied to the court!Shamspeare:\nGet...thee...to a nunneriiiiiiiiieeeeeeeee!Van Zieks:Van Zieks:\nAs a rule, I fill my hallowed chalice up to seven times during any one trial.Ryunosuke:\n(You might want to keep that information to yourself...)Van Zieks:\nYet on occasion, tedium distracts me and I pour more times than I intended until the bottle is dry.Ryunosuke:\nYour drinking habits are fascinating, but...irrelevant.Van Zieks:\nOn the contrary. They illustrate the fickleness of human memory. To William Shamspeare...Shamspeare:\nY-Yes...my liege...Van Zieks:\n...though you previously stated that you made the coins of ice from the leftover tea in the accused's cup... ...could it be that you were perhaps mistaken?Shamspeare:\nEh?Van Zieks:\nCould it be that...yes. Perhaps there was some tea remaining in the small teapot left at the scene. A fact that had vanished from your memory until now...Shamspeare:\n......... Faith, my liege, thou art a magician! For verily...'tis as though thou hast seen with thine own eyes that night.Ryunosuke:\nWhat?Shamspeare:\nForsooth! I was mistook! I did plan to use tea from the Japanese fellow's cup, but lo! When I looked, 'twas empty! And thus did I use the dregs that fester'd in the teapot, as my liege did suggest.Ryunosuke:Ryunosuke:\nAnd you've just suddenly remembered now that you made a mistake before? Are we supposed to believe that?!Van Zieks:Van Zieks:\nPeople's memories are imperfect, my learned friend. Which is why we rely on evidence instead.Ryunosuke:\n...!Van Zieks:\nBut in any case, it makes no difference. The victim's most recent testimony tells us two things of note: Firstly, that the poison was put into the victim's teacup only. And secondly, that this spoilt cup was not the source of the insipid 'ice coins' that have bewitched this court.Judge:\nHmmm... The prosecution makes a fine summary of the facts.Van Zieks:\nFurthermore, that testimony remains valid and in full support of the established facts. In other words... ...the inconsistency claimed by the defence simply does not exist!Ryunosuke:\nNo!What does this mean then?\nI do declare it means there's no issue with the gas thief's testimony...\nApart from the bit about thieving gas, obviously!Shamspeare:\nMy lords, ladies and gentlemen of the jury! I do solemnly swear... After I did dine at Grub's Grubbery alehouse that night... ...nought did pass my lips but the black tea giv'n me by the Japanese, whose back be stoop'd as low as death!Judge:\nAnd on what did you dine, sir?Shamspeare:\nWhy, I did partake of my favourites: a broth as wouldst be call'd soup and a leaf as wouldst be call'd salad...Van Zieks:\nAs insalubrious a menu as the establishment where it was served...Shamspeare:\n'But you gods will give us, Some faults to make us men.' Willingly would I suffer what punishment 'tis seen fit to serve a wicked thief of gas. But! I pray ye wise and noble fellows, ne'er forget the simple truth...That be one thing, and this be another!Juror No. 2:\n...!Juror No. 5:\n...!Ryunosuke:\n...!Shamspeare:\nJurors all, your humble servant Shamspeare doth entreat you: punish the Japanese fellow for his sins!???:My Loooooord!!!Juror No. 1:\nIf I may speak, My Lord?Judge:\nYes, Mr Foreman?Juror No. 1:\nI believe we may have been duped by that rotten defence lawyer!Ryunosuke:\nBy me?!Juror No. 2:\nI do declare you may be right!Juror No. 3:\nWe all know the waif there was making coins of ice to keep himself warm...Juror No. 5:\n...But this lawyer lad says if he's stealing gas, he deserves a dose of poison, eh? He's been leading us up the garden path, that's what he's been doing!Ryunosuke:\nI really never said anything like that.Juror No. 1:\nBut what we just heard from the victim there has opened our eyes again! We've reached a decision this time, and we won't be swayed from it!Judge:\nThe court acknowledges the position of the jury foreman... ...and will duly hear the jury's findings.Ryunosuke:\nWhat? No! You, you can't yet...Judge:\nLadies and gentlemen of the jury...you will state your decisions now!Juror No. 1:\nGuilty!Juror No. 2:\nGuilty!Juror No. 3:\nGuilty!Juror No. 4:\nGuilty!Juror No. 5:\nGuilty!Juror No. 6:\nGuilty!Judge:\nI hereby declare the jury to be in one accord.Shamspeare:\nO happy day!Van Zieks:\n.........Ryunosuke:\n(How is this happening?) My Lord! The defence asserts its right to carry out a summation examination!Judge:\nVery well. The court upholds the defence's right.Van Zieks:\nTypical... My learned friend is unable to accept the obvious truth...Judge:\nThis trial will therefore enter its second summation examination immediately. Jurors, the court calls upon each of you... ...to state the grounds upon which you find the defendant guilty of the crime of which he is charged.Judicial Findings\n- The Jurors' Contentions -Juror No. 1:\nI'm a man of logic, me. And having considered all the evidence, the defendant must logically be guilty.Juror No. 2:\nI do agree that gas is far too expensive. I can quite understand why the man would want to avoid paying.Juror No. 3:\nThe stuff explodes and it can poison you! It's absolutely lethal, gas is!Juror No. 4:\nGas doesn't come for free! It costs a fortune to deliver it around the city and maintain the pipes!Juror No. 5:\nTruth be told, the tea my wife serves up for me is a little...sketchy at times.Juror No. 6:\nIf nothing else passed the victim's lips that night, there's no other explanation, is there?Judge:\nHm, I do feel that perhaps personal opinion about gas and its supply has influenced decisions somewhat... ...but never mind.Ryunosuke:\n(No no, you really should mind.)Susato:\nThe truth is, our counter-argument wasn't as unassailable as we'd hoped. And Mr Shamspeare WAS poisoned. There can be no doubt of that.Ryunosuke:\nThen how are we supposed to turn this around?Susato:\nI think... ...we need to establish the method by which Mr Shamspeare was actually poisoned. Our only hope is to demonstrate that to the court incontrovertibly.Ryunosuke:\nBut...but that's surely almost impossible at this stage!Susato:\n...If we don't manage it, though, Mr Natsume will...Ryunosuke:\n(...Will be found guilty!)Judge:\nNo delays, Counsel! Proceed with the summation examination!Jury Examination\n- The Defence's Rebuttal -Juror No. 1:\nI'm a man of logic, me. And having considered all the evidence, the defendant must logically be guilty.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nAll the evidence, you say?\nJuror No. 1:\nThat's right. And there's no room for doubt. It's all pointing at that Japanese man with the big moustache!\nRyunosuke:\n(Says the Englishman with the bigger moustache...)\nSusato:\nWhich means we need to show the man some new evidence to make him change his mind!\nRyunosuke:\n...If only we had that kind of evidence...\nSusato:\nDon't worry. This summation examination has barely started really. Perhaps there'll be a shift in the situation that shows an existing piece of evidence in a new light!\nRyunosuke:\nLet's hope so! (To start with, though, I need to find some way out of this deadlock...)Press (after Jurors No. 2, 3, and 6 vote innocent)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nAll the evidence, you say?\nJuror No. 1:\nThat's right. And there's no room for doubt. It's all pointing at that Japanese man with the big moustache!\nRyunosuke:\n(Says the Englishman with the bigger moustache...) But the defence just demonstrated another possible explanation for the events on the night in question. What do you make of that?\nJuror No. 1:\nWhat, your so-called 'skin prints'?\nSusato:\nIt's an exciting new forensic investigation technique... developed by the great detective himself!\nRyunosuke:\nThe numerous handprints on the wall are clearly out of the ordinary. And if Mr Shamspeare had indeed put his mouth to the gas pipe on the night in question... ...it can't be denied that there's a possibility that's where the poison was!\nJuror No. 1:\nWell, yes... I won't deny that it's playing on my mind. But as the prosecution rightly says: we should pay no heed to unacceptable forms of evidence. And besides...\nRyunosuke:\nYes?\nJuror No. 1:\nEven if the fellow has been up to some mischief with the gas pipe dozens of times before... ...it doesn't mean he got up to the same shenanigans on the night in question, does it?\nRyunosuke:\nOh...\nJuror No. 1:\nIf you can't make your case better than that, I'm afraid I can't change my stance.\nJuror No. 2:\nHm, you do make a very valid point, sir.\nRyunosuke:\nWhat?\nJuror No. 3:\nHm...that's true. Perhaps I was a little hasty...\nRyunosuke:\nNo no no! Wait!\nJuror No. 1:\nLook, you've got your chance here, haven't you? So it's time to prove your theory. If you and your Japanese cohorts can, that is!\nRyunosuke:\n...! (Just leave our nationality out of this, please!)\nSusato:\nMr Naruhodo! If we can't substantiate our position... ...I'm afraid the jurors that changed their minds before may very well change them back!\nRyunosuke:\n(What can I do...? Is there any more proof I can give here? Can I show that Mr Shamspeare really did blow down the gas pipe on the night in question?)\n\n\n\nI can't prove it\n\n\n\n\n\n\n\nRyunosuke:\nWell...I'm not in a position to prove it...yet.\nJuror No. 1:\nAs I thought. I had a feeling that would stump you Japanese.\nRyunosuke:\n(We ARE capable of independent thought, you know.)\nSusato:\nI think we need to gather some more material to bolster our position, Mr Naruhodo.\nRyunosuke:\nYes. That's what I was trying to imply by saying we can't prove it 'yet'.\nJudge:\nThank you, Counsel. On with the examination, please.\nLeads back to summation examination\n\n\n\n\nI can present evidence\n\n\n\n\n\n\n\nRyunosuke:\nNaturally, I can provide evidence to support the defence's position.\nJudge:\nVery well. You will present the evidence now, Counsel. The evidence in support of your claim that the victim blew down the gas pipe on the night in question!\n\n\n\nPresent anything\n\n\n\n\n\n\n\nRyunosuke:\n\nJudge:\nWell, Mr Foreman? What say you to that?\nJuror No. 1:\nOh yes, it's evidence alright. No question about it. Evidence that this ripe little lawyer thinks he can make a fool of us all!\nRyunosuke:\nWha...?\nJudge:\nYou heard the man, Counsel. Don't get too big for your boots!\nSusato:\nAre you getting too big for your boots, do you think, Mr Naruhodo?\nRyunosuke:\nNot likely. In fact, I wish they'd swallow me up at the moment. (It looks like I need to take another tack here...)\nJudge:\nOn with the summation examination, Counsel.\nLeads back to summation examination\n\n\n\n\n\nI have supporting testimony\n\n\n\n\n\n\n\nRyunosuke:\nNo, in truth I don't have evidence to support my theory. However... ...there is witness testimony that substantiates it.\nJuror No. 1:\nWhat's that? Testimony?!\nJuror No. 3:\nThis is incredible! Whose testimony?\nRyunosuke:\n(Yes...it's all connected. Everything is linked.) A person whose testimony revealed details about the gas in the Garrideb residence that night. Namely...\n\n\n\nPresent Soseki Natsume profile\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"Obviously I'm talking about the defendant, Mr Soseki Natsume himself!\"\n\n\n\n\nPresent anyone else\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nWell, Mr Foreman? Does THAT convince you?\nJuror No. 1:\n.........\nRyunosuke:\n(Whew. I don't think he was listening...)\nJudge:\nRest assured, Counsel, I shan't let such nonsensical answers go without penalty.\nRyunosuke:\n(Ugh... I thought I'd got away with it...)\nSusato:\nA witness who spoke about the gas on the night in question... Yes, there was someone...\nRyunosuke:\nThat's what I thought, too. (But I obviously chose the wrong person!)\nLeads back to summation examinationJuror No. 2:\nI do agree that gas is far too expensive. I can quite understand why the man would want to avoid paying.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nThis isn't the time or the place to be discussing the price of gas, madam!\nJuror No. 2:\nBut really! Think of the injustice! Air is a gas, and air is free! Why should Altamont gas cost money? It, it makes my blood boil! I can feel myself becoming more ruthless than ever!\nRyunosuke:\nThis isn't the time or the place to be ruthless either.\nJuror No. 4:\nIf I might interject here?\nRyunosuke:\nAh, yes, madam?\nJuror No. 4:\nIt seems my fellow juror takes issue with the price our company charges for gas. But it's precisely because of thieves like this man that the cost goes up!\nJuror No. 2:\nOh, what a beastly man! That unkempt moustache, those hunched shoulders... Poisoning tea and stealing gas... Utterly unforgivable!\nRyunosuke:\nNo no no! Mr Natsume isn't the one who's been stealing gas! I'll thank you NOT to go adding on more crimes!\nSusato:\nMr Natsume hasn't been poisoning tea either!\nJuror No. 2:\nWell anyway, I've quite made up my mind. It's as made up as the price of gas!Juror No. 2:\nI'm very interested in the results of this great detective's investigation at the scene!Juror No. 3:\nThe stuff explodes and it can poison you! It's absolutely lethal, gas is!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nCould we please talk about the poison rather than the gas, do you think, sir?!\nJuror No. 3:\nWell, if you like. I mean, to be honest, I'd take poison over gas every time!\nRyunosuke:\nYou'd 'take poison'?\nJuror No. 3:\nWhat I mean is, poison can only poison you. It doesn't explode, does it?\nJuror No. 4:\nGoodness me! What are you talking about? Set him straight, please, lawyer man!\nRyunosuke:\nWell...it's certainly true that poison isn't prone to exploding... ...but I think you'll find poison also can't light or heat up a room.\nJuror No. 3:\nAh! You're right! I hadn't considered that at all...\nJuror No. 4:\n......... Young lawyer man...\nRyunosuke:\nUm...yes?\nJuror No. 4:\nYou have a good head on your shoulders. We could use someone like you as our company's legal representative.\nRyunosuke:\n(Well, I wasn't expecting to pick up more business in the middle of a trial, that's for sure...)\nJuror No. 3:\nAnyway, the point is, I haven't had the best experience with gas companies in the past.Juror No. 3:\nBlow too hard into a gas pipe, and you extinguish everything in the house. And then you're in real trouble!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nWhen you say 'extinguish everything in the house', do you mean even on different floors?\nJuror No. 3:\nOh yes. All floors are connected to the same pipe, after all.\nJuror No. 4:\nThat's true of every building, because gas supply contracts are issued for whole properties.\nRyunosuke:\nWell...I had no idea that it was possible to extinguish gas appliances simply by blowing down the pipe.\nJuror No. 4:\nIt's not something we like to publicize, to be honest. But we have to carry out these investigations, as I'm sure you can appreciate.\nJudge:\nIndeed. It has been mentioned on more than one occasion in the papers, even.\nRyunosuke:\nIs that so? (It's been mentioned to me, too. Very recently. An incident involving the gas stove going out inexplicably, almost leading to someone's death...)\nSusato:\nMr Naruhodo, I think perhaps...\nRyunosuke:\nYes. It's finally starting to fall into place. The secret link that joins all of these strange occurrences.Pit against Juror No. 6's statement\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nThose two statements clearly contradict each other!\nJudge:\nGood gracious! To whose statements do you refer, Counsel?\nRyunosuke:\nJuror number six! Did you hear what juror number three just said?\nJuror No. 6:\nEh? What? Yes! Of course! I, I heard him mumbling about something or other.\nRyunosuke:\nThere IS another explanation here, I believe. Something besides Mr Natsume's tea did, in a manner of speaking, pass the victim's lips on the night in question.\nJuror No. 6:\nWhat? What explanation?\nRyunosuke:\nI wonder...did the police check the mouth of the gas pipe feeding the wall light at the scene? To see if there were any traces of poison there.\nVan Zieks:\nI was curious to see what your floundering would result in this time...but the mouth of a gas pipe? Scotland Yard have enough to do without exploring such irrelevance.\n???:\n\nShamspeare:\n'What a piece of work is a man!'\nRyunosuke:\nWhat are you trying to say, Mr Shamspeare?\nShamspeare:\nWhat speakest thou? Prithee, is it not strange and strange? That is what I say to thee, sir!\nRyunosuke:\nI thought I'd been quite clear. But let me put it another way... The strychnine could have been on the mouth of the gas pipe that feeds the wall lamp in your room. And that is how the poison came to enter your body!\nJudge:\nGood... Good Lord!\nJuror No. 5:\nAre they tasty, then, gas pipes? Is that what he's saying?\nJuror No. 2:\nOr is the gentlemen suggesting that the poor man was so desperately hungry, he tried to fill his belly with gas?\nJuror No. 4:\nPerhaps no actress would perform a kiss scene with him, hm?\nShamspeare:\nFor shame, madam, speaking thy fancy! I assure you, I'm not such a buffoon that I have to kiss pipes!\nVan Zieks:\n\nVan Zieks:\n...This is no summation examination. This is a farce. The prosecution will not stand for any more of my learned Nipponese friend's conjecture.\nRyunosuke:\n...!\nVan Zieks:\nTo begin with, the lamp in the victim's room is high on the wall. In order to have placed his lips to the pipe that feeds it, he would have to be a contortionist. These are empty assertions. There is no possible proof that the man did as you say.\nRyunosuke:\n\nRyunosuke:\nIt's true...I have no proof that Mr Shamspeare put his lips to the pipe. However, I can say with some certainty...that on multiple occasions... ...Mr Shamspeare has been doing something in front of that lamp on his wall. ...And I have evidence to prove it!\nShamspeare:\n...!\nJuror No. 1:\n...Alright, you've got our attention, lad. I'd like to see how you can be so sure of yourself.\nJuror No. 3:\nSo would I! Let's see this evidence then.\nRyunosuke:\n(Now that I've got the jury's ear... ...I need to make this opportunity count!) This is the proof that, time and time again, Mr Shamspeare stood in front of his gas lamp!\n\n\n\nPresent Handprints on the Wall\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"What the...?!\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nWell?! How's that?\nJuror No. 1:\nI don't know what you think that 'Well' was for.\nJuror No. 2:\nI do declare I should be the one saying 'Well'. As in: 'Well, it's meaningless.'\nJuror No. 3:\nI don't know what you think that 'How's that?' was for either.\nJuror No. 4:\nI should be saying 'How's that?' I think. As in: 'How's that relevant?'\nRyunosuke:\n(They make a formidable pair of double acts...)\nJudge:\nThat's enough, thank you. It would appear that not one person present was moved by the evidence you produced, Counsel.\nRyunosuke:\n(Proof that Mr Shamspeare stood in front of that gas lamp many, many times... I'm sure there's a piece of evidence we have that makes my point perfectly...)\nSusato:\nThe mystery we uncovered when we investigated Mr Shamspeare's room is about to be solved, I believe!\nRyunosuke:\nYes. And this time I'm going to show the court evidence that's irrefutable!\nLeads back to:\n\"This is the proof that, time and time again, Mr Shamspeare stood in front of his gas lamp!\"\n\n\nJuror No. 3:\nWhat the...?!\nRyunosuke:\nThese are... Wait, what are they called? ...Yes! Skin prints that were found at the scene!\nJudge:\nSkin prints, Counsel? I've never heard of such things. The justice ministry is currently assessing whether or not to permit fingerprints as evidence in court, however.\nSusato:\nMy Lord, this is an exciting new forensic technique developed by the great detective, Mr Herlock Sholmes! It reveals all of the places that Mr Shamspeare touched in his room.\nJuror No. 5:\nI've never seen anything like it! I mean that's black magic, isn't it?\nJuror No. 6:\nHm... Well, if anyone could invent something like this, it's that great Sholmes fellow, that's for sure.\nJuror No. 4:\nI agree. This month's edition of 'Engineering Thumbs' was quite fascinating.\nRyunosuke:\nWe found skin prints in many places that you would expect. On the table...on the costumes... However, Mr Shamspeare also appears to have been touching some very unexpected places in his room. For example, here.\nJudge:\nAround the hanging picture there? Indeed, multiple handprints appear to be visible.\nJuror No. 2:\nWell, I wonder... Could he have been appreciating the artwork, perhaps?\nRyunosuke:\nAt first, my colleagues and I thought the same. However... ...imagine standing with your hands where those prints are, and you would find yourself directly in front of...?\nJuror No. 3:\nIn front of... Ah!\nJuror No. 4:\nI don't believe it!\nThe gas lamp!\nRyunosuke:\nThough the reason why isn't immediately obvious, it's clear that Mr Shamspeare... ...has regularly been standing with his hands to the wall in front of that lamp.\nJuror No. 5:\nRight! What have you been up to, you nut?\nShamspeare:\n.........\nRyunosuke:\nI'd ask the court to recall juror number four's earlier statement.\nJuror No. 4:\nMe? What did I say?\nRyunosuke:\nYou said that blowing into a gas pipe would make the lights in the entire building flicker. And now, if you'll recall juror number three's statement...\nJuror No. 3:\nWhat? Me now?\nRyunosuke:\nWhen the gas worker who visited his home blew with too much force into the pipe... ...it caused all the lights and the gas stove to go out, and gas to start leaking into the rooms. Obviously, that incident was an accident. However, the simple fact is... ...if Mr Shamspeare were to have blown hard into the gas pipe here in his room... ...he could have extinguished every other light and gas stove in the building at will.\nJuror No. 1:\nCrikey!\nJuror No. 4:\nAre, are you suggesting that the man purposefully caused the gas to...?\nVan Zieks:\n\nVan Zieks:\nWhilst I acknowledge that the prosecution is required to remain silent during a summation examination... ...I must toast my learned friend's utter disregard for the letter of the law.\nJudge:\nWhat is the meaning of this, Lord van Zieks?\nVan Zieks:\nThis curious photograph - or whatever it is - presented by the defence... The so-called 'skin prints'... Clearly, that cannot be accepted as any form of useable evidence in this case.\nJuror No. 2:\nBut, but it's an exciting new forensic technique! Developed by a great detective!\nVan Zieks:\nIt's nothing. A mere toy developed by an amateur sleuth with too much time on his hands.\nRyunosuke:\nUgh!\nJudge:\nHmmm... Certainly, even research of this nature by the esteemed Mr Sholmes... ...cannot be recognised by the court as formal evidence.\nRyunosuke:\nBut...\nSusato:\n\nSusato:\nPlease, My Lord, if I may...\nRyunosuke:\nMiss Susato?!\nSusato:\nIt was not the defence's intention to submit the skin prints as formal evidence. We merely wished to present the results of the great detective's investigation of the scene... ...as a tool by which to explain a possibility to the ladies and gentlemen of the jury.\nVan Zieks:\n...!\nSusato:\nAnd, if the trial were to come to an end now... ...we should never learn the truth behind these mysterious handprints that everyone has now seen. I don't believe we can allow that to happen! And I'm sure the jurors would agree!\nJuror No. 1:\n...!\nJuror No. 2:\n...!\nJuror No. 3:\n...!\nJuror No. 4:\n...!\nJuror No. 5:\n...!\nJuror No. 6:\n...!\n???:\n\nJuror No. 3:\nYou're right! Whether those strange handprints are a significant clue or not...it's down to us to decide!\nRyunosuke:\nJuror number three!\nJuror No. 2:\nOh yes! I do declare that the great detective's investigation results sound absolutely fascinating! And I want to hear what that shady actor fellow has to say about those shady handprints!\nJuror No. 1:\nWhat's the matter with you two? That was foolhardy!\nJuror No. 6:\nWell, I did say it, didn't I? And I don't like to break a promise.\nJuror No. 1:\nNo! Wait! You heard His Lordship! It's not fair dinkum evidence!\nSusato:\nOh, well done, Mr Naruhodo! If just one more juror changes his or her mind... ...Mr Natsume's trial will have to continue!\nRyunosuke:\nThank you, Miss Susato. But I couldn't have done it without you.\nSusato:\nOh no, it was you who identified the clue, after all. This is very much your success.\nShamspeare:\n.........\nRyunosuke:\n(Why, Mr Shamspeare...you seem to be losing your composure...)\nSusato:\nJust one more juror, Mr Naruhodo! You can do it!\nJudge:\nVery well. Continue, Counsel!\nChanges Juror No. 2's statement to: \"I'm very interested in the results of this great detective's investigation at the scene!\"\nChanges Juror No. 3's statement to: \"We're the ones who decide if the evidence is worthy of consideration or not! Us. The jury.\"\nChanges Juror No. 6's statement to: \"I don't believe in breaking promises. We can't come to a decision whilst so much is up in the air.\"Juror No. 3:\nWe're the ones who decide if the evidence is worthy of consideration or not! Us. The jury.Juror No. 4:\nGas doesn't come for free! It costs a fortune to deliver it around the city and maintain the pipes!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nCan we please refrain from all this talk of gas?!\nJuror No. 4:\nThere's an all-out attack underway here in case you hadn't noticed. Against my company's gas. And I'm supposed to sit here and take it, am I? I don't think so!\nRyunosuke:\n(She's really buzzing now...)\nJuror No. 4:\nAll I've heard about our wonderful fuel is explosions and poisonings! What about electricity, hm? What about getting electrocuted? What about that? A little explosion here and there is nothing in comparison!\nJudge:\nAny explosion...could hardly be described as 'nothing', madam. Nevertheless, the theft of your gas is deplorable.\nJuror No. 4:\nMy point exactly. But the gas thieves aren't even the worst of our enemies. We have far more devious reprobates to contend with on a daily basis, you know.\nRyunosuke:\nMore devious...? Who, madam?\nJuror No. 4:\nOther gas companies, of course.\nRyunosuke:\nOther...gas companies...? (Not quite what I was expecting...)\nJuror No. 4:\nWe generate gas and we deliver it to our customers fair and square.\nJudge:\nIndeed. Nobody is questioning that, madam. Altamont is an exemplary gas company.\nJuror No. 4:\nBut there are other, unscrupulous gas companies here in London that don't even have any gas at all.\nRyunosuke:\nWhat? But if they don't have any gas, how do they go about selling it to people?\nJuror No. 4:\nYou wouldn't think it possible, would you? But they steal our gas, you see. And sell that.\nJudge:\nThey steal your gas? How on earth is such a thing possible?\nJuror No. 4:\nGas companies like ours deliver gas to people's homes via a network of pipes. But these devious reprobates...secretly disconnect our pipes and divert our gas into their own rotten pipes! Then they make a contract with the households supplied by those pipes... ...and take money for the precious gas that's rightfully ours, without us even knowing!\nSusato:\nThey're diverting gas into their own pipes illegally... What a brazen form of theft!\nJuror No. 4:\nWhen we visit customers' houses to collect the money from their meters... ...we always have to check whether or not one of these devious companies has been up to its tricks.\n\n\n\nPursue Juror No. 3 (before Juror No. 3 changes his statement)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nDo you have something to say about that, juror number three?!\nJuror No. 3:\nOh golly! You mean me? I'm, I'm terribly sorry! I was just thinking to myself...\nRyunosuke:\n(I really did catch him off guard there...) Thinking about what the lady next to you was saying, correct?\nJuror No. 3:\nWell, yes. I just...got a little riled about it recently, you see.\nRyunosuke:\nGo on...\nJuror No. 3:\nAn Altamont Gas worker visited my house the other day. To investigate the pipework. 'We need to ask for your cooperation while we carry out a secret check of your property, sir,' the fellow said. So I let him in...and do you know what he did?\nRyunosuke:\nI'm, um...afraid I have no idea. Please tell us.\nJuror No. 3:\nHe proceeded to take one of my lights off the wall. Then he grabbed the exposed mouth of the pipe...and started blowing into it!\nJuror No. 4:\nWhat do you think you're doing, young man? You're giving away company secrets there!\nJuror No. 3:\nOh please! Everybody knows! But it was very nearly the death of me, I can tell you!\nRyunosuke:\nWhat do you mean?\nJuror No. 4:\nI'll explain, if you don't mind. As I said before... ...these unscrupulous other gas companies connect their customers to our pipe network.\nRyunosuke:\nYes, but how does blowing into the pipes come into it?\nJuror No. 4:\nObviously there's gas in the pipes. And it's at a fairly low pressure. By blowing air through the pipe, you can make the pressure drop temporarily. And if you do that, any lights connected to the same pipe will flicker for a moment.\nJudge:\nAh, I see! In other words... ...if, upon blowing into the pipe, the lights of an adjacent property that has no contract with your company flicker... ...you can know that these devious scoundrels have been meddling with the pipes!\nJuror No. 4:\nExactly, My Lord. That's it in a nutshell. It's the reason why we have teams of workers going around neighbourhoods to investigate which lights flicker.\nJuror No. 3:\nThe trouble is, the particular worker who came to my house didn't know the strength of his own breath! He blew down the pipe with all his might! And you can guess what happened, can't you?\nRyunosuke:\nWell, if he blew hard, then... Wait! You mean...?\nJuror No. 3:\nThat's right. The lights didn't just flicker; they went out! Along with the stove! Gas started pouring into the house!\nRyunosuke:\nWhat a disaster...\nSusato:\nThe gas supply must have been interrupted briefly because the man blew too hard, so the flames went out.\nJuror No. 3:\nI'm afraid I yelled at the fellow. 'Are you trying to kill us all?!' I said.\nRyunosuke:\n......... (So by disconnecting a lamp and blowing into the exposed gas pipe... ...it's possible to extinguish lamps and stoves connected to the same network of pipes... And then when the gas starts flowing again, it just silently seeps into the room...)\nSusato:\nMr Naruhodo, I think perhaps...\nRyunosuke:\nYes. This is almost certainly the clue that we've been hoping for! Juror number three! The defence requests that you amend your statement to include that information!\nJuror No. 3:\nOh, well, if you like. I don't mind.\nJuror No. 4:\nWell I DO! That's our company's secret method of identifying the rogues that try to diddle us!\nJuror No. 3:\nLike I said, madam, it's widely known already.\nJudge:\nVery well. Juror number three, you will amend your statement accordingly.\nJuror No. 3:\nYes, My Lord. ...Although I'm not really sure what the point of all this is...\nChanges Juror No. 3's statement to \"Blow too hard into a gas pipe, and you extinguish everything in the house. And then you're in real trouble!\"\n\n\nRyunosuke:\nI, I had no idea... It's almost unbelievable...\nJuror No. 4:\nIt might seem unbelievable to you, but it's happening. All the time. Right here in the capital. It's very difficult selling something you can't see, you know. Very difficult indeed.\nJudge:\nThank you, that will do! Clearly this is a very involved subject, but I feel we have digressed rather too much already.\nVan Zieks:\nI concur. Though if my learned friend wishes to become an expert in gas, I believe the subject will suit him well. To your new career in nothingness!\nRyunosuke:\nThank you so much...\nSusato:\n.........\nJudge:\nYou will turn your attention to the next juror's assertion, please, Counsel.Juror No. 5:\nTruth be told, the tea my wife serves up for me is a little...sketchy at times.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYou, you mean it's poisoned?!\nJuror No. 5:\nThat's right. It's happened a tidy few times now.\nJudge:\nThis is most troubling indeed!\nJuror No. 5:\nIt's always days like this one when I don't get any wages. I get in at tea time, see... ...and I see her doing it. My wife. She gets that devilish look on her face and she slips some white powder into my cup!\nRyunosuke:\nAnd...and you drink it anyway?\nJuror No. 5:\nI was brought up proper, I was. If someone gives you a cuppa, you drink it.\nRyunosuke:\nAnd what happened to you? What did it taste like?\nJuror No. 5:\nIt was God-awful, believe you me! Salty as hell!\nRyunosuke:\n.........\nVan Zieks:\n.........\nJudge:\n.........\nSusato:\nThen I think perhaps what your wife put in your tea...was salt.\nJuror No. 5:\nNo! So...she doesn't even care enough to poison me properly, eh? Unbelievable...\nJudge:\nLet's move on, please!Juror No. 6:\nIf nothing else passed the victim's lips that night, there's no other explanation, is there?Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nDoes that mean that if the victim could be shown to have ingested something else, you'd change your leaning?\nJuror No. 6:\nHm? Sorry? What's that now?\nRyunosuke:\nOh, um...I was just saying, if the victim did actually eat or drink something else on the night-\nJuror No. 6:\nWhat's the matter with you?!\nRyunosuke:\nSorry?\nJuror No. 6:\nI said, 'If nothing else passed the victim's lips that night, there's no other explanation, is there?' Haven't you been listening to me at all?!\nRyunosuke:\n(I feel there's an English expression about a pot and a kettle that's appropriate here...)\nSusato:\nCompared to the other jurors who don't even appear to have anything to say about the case at all... ...it would seem that this elderly gentleman has been listening to the proceedings far more intently!\nRyunosuke:\nI-I suppose. The trouble is...\nSusato:\n...He has selective hearing?\nRyunosuke:\n(Exactly. But still...) This juror may well be the key to the breakthrough that we so desperately need!Pit against Juror No. 3's statement (after Juror No. 3 changes his statement)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nThose two statements clearly contradict each other!\nJudge:\nGood gracious! To whose statements do you refer, Counsel?\nRyunosuke:\nJuror number six! Did you hear what juror number three just said?\nJuror No. 6:\nEh? What? Yes! Of course! I, I heard him mumbling about something or other.\nRyunosuke:\nThere IS another explanation here, I believe. Something besides Mr Natsume's tea did, in a manner of speaking, pass the victim's lips on the night in question.\nJuror No. 6:\nWhat? What explanation?\nRyunosuke:\nI wonder...did the police check the mouth of the gas pipe feeding the wall light at the scene? To see if there were any traces of poison there.\nVan Zieks:\nI was curious to see what your floundering would result in this time...but the mouth of a gas pipe? Scotland Yard have enough to do without exploring such irrelevance.\n???:\n\nShamspeare:\n'What a piece of work is a man!'\nRyunosuke:\nWhat are you trying to say, Mr Shamspeare?\nShamspeare:\nWhat speakest thou? Prithee, is it not strange and strange? That is what I say to thee, sir!\nRyunosuke:\nI thought I'd been quite clear. But let me put it another way... The strychnine could have been on the mouth of the gas pipe that feeds the wall lamp in your room. And that is how the poison came to enter your body!\nJudge:\nGood... Good Lord!\nJuror No. 5:\nAre they tasty, then, gas pipes? Is that what he's saying?\nJuror No. 2:\nOr is the gentlemen suggesting that the poor man was so desperately hungry, he tried to fill his belly with gas?\nJuror No. 4:\nPerhaps no actress would perform a kiss scene with him, hm?\nShamspeare:\nFor shame, madam, speaking thy fancy! I assure you, I'm not such a buffoon that I have to kiss pipes!\nVan Zieks:\n\nVan Zieks:\n...This is no summation examination. This is a farce. The prosecution will not stand for any more of my learned Nipponese friend's conjecture.\nRyunosuke:\n...!\nVan Zieks:\nTo begin with, the lamp in the victim's room is high on the wall. In order to have placed his lips to the pipe that feeds it, he would have to be a contortionist. These are empty assertions. There is no possible proof that the man did as you say.\nRyunosuke:\n\nRyunosuke:\nIt's true...I have no proof that Mr Shamspeare put his lips to the pipe. However, I can say with some certainty...that on multiple occasions... ...Mr Shamspeare has been doing something in front of that lamp on his wall. ...And I have evidence to prove it!\nShamspeare:\n...!\nJuror No. 1:\n...Alright, you've got our attention, lad. I'd like to see how you can be so sure of yourself.\nJuror No. 3:\nSo would I! Let's see this evidence then.\nRyunosuke:\n(Now that I've got the jury's ear... ...I need to make this opportunity count!) This is the proof that, time and time again, Mr Shamspeare stood in front of his gas lamp!\n\n\n\nPresent Handprints on the Wall\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"What the...?!\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nWell?! How's that?\nJuror No. 1:\nI don't know what you think that 'Well' was for.\nJuror No. 2:\nI do declare I should be the one saying 'Well'. As in: 'Well, it's meaningless.'\nJuror No. 3:\nI don't know what you think that 'How's that?' was for either.\nJuror No. 4:\nI should be saying 'How's that?' I think. As in: 'How's that relevant?'\nRyunosuke:\n(They make a formidable pair of double acts...)\nJudge:\nThat's enough, thank you. It would appear that not one person present was moved by the evidence you produced, Counsel.\nRyunosuke:\n(Proof that Mr Shamspeare stood in front of that gas lamp many, many times... I'm sure there's a piece of evidence we have that makes my point perfectly...)\nSusato:\nThe mystery we uncovered when we investigated Mr Shamspeare's room is about to be solved, I believe!\nRyunosuke:\nYes. And this time I'm going to show the court evidence that's irrefutable!\nLeads back to:\n\"This is the proof that, time and time again, Mr Shamspeare stood in front of his gas lamp!\"\n\n\nJuror No. 3:\nWhat the...?!\nRyunosuke:\nThese are... Wait, what are they called? ...Yes! Skin prints that were found at the scene!\nJudge:\nSkin prints, Counsel? I've never heard of such things. The justice ministry is currently assessing whether or not to permit fingerprints as evidence in court, however.\nSusato:\nMy Lord, this is an exciting new forensic technique developed by the great detective, Mr Herlock Sholmes! It reveals all of the places that Mr Shamspeare touched in his room.\nJuror No. 5:\nI've never seen anything like it! I mean that's black magic, isn't it?\nJuror No. 6:\nHm... Well, if anyone could invent something like this, it's that great Sholmes fellow, that's for sure.\nJuror No. 4:\nI agree. This month's edition of 'Engineering Thumbs' was quite fascinating.\nRyunosuke:\nWe found skin prints in many places that you would expect. On the table...on the costumes... However, Mr Shamspeare also appears to have been touching some very unexpected places in his room. For example, here.\nJudge:\nAround the hanging picture there? Indeed, multiple handprints appear to be visible.\nJuror No. 2:\nWell, I wonder... Could he have been appreciating the artwork, perhaps?\nRyunosuke:\nAt first, my colleagues and I thought the same. However... ...imagine standing with your hands where those prints are, and you would find yourself directly in front of...?\nJuror No. 3:\nIn front of... Ah!\nJuror No. 4:\nI don't believe it!\nThe gas lamp!\nRyunosuke:\nThough the reason why isn't immediately obvious, it's clear that Mr Shamspeare... ...has regularly been standing with his hands to the wall in front of that lamp.\nJuror No. 5:\nRight! What have you been up to, you nut?\nShamspeare:\n.........\nRyunosuke:\nI'd ask the court to recall juror number four's earlier statement.\nJuror No. 4:\nMe? What did I say?\nRyunosuke:\nYou said that blowing into a gas pipe would make the lights in the entire building flicker. And now, if you'll recall juror number three's statement...\nJuror No. 3:\nWhat? Me now?\nRyunosuke:\nWhen the gas worker who visited his home blew with too much force into the pipe... ...it caused all the lights and the gas stove to go out, and gas to start leaking into the rooms. Obviously, that incident was an accident. However, the simple fact is... ...if Mr Shamspeare were to have blown hard into the gas pipe here in his room... ...he could have extinguished every other light and gas stove in the building at will.\nJuror No. 1:\nCrikey!\nJuror No. 4:\nAre, are you suggesting that the man purposefully caused the gas to...?\nVan Zieks:\n\nVan Zieks:\nWhilst I acknowledge that the prosecution is required to remain silent during a summation examination... ...I must toast my learned friend's utter disregard for the letter of the law.\nJudge:\nWhat is the meaning of this, Lord van Zieks?\nVan Zieks:\nThis curious photograph - or whatever it is - presented by the defence... The so-called 'skin prints'... Clearly, that cannot be accepted as any form of useable evidence in this case.\nJuror No. 2:\nBut, but it's an exciting new forensic technique! Developed by a great detective!\nVan Zieks:\nIt's nothing. A mere toy developed by an amateur sleuth with too much time on his hands.\nRyunosuke:\nUgh!\nJudge:\nHmmm... Certainly, even research of this nature by the esteemed Mr Sholmes... ...cannot be recognised by the court as formal evidence.\nRyunosuke:\nBut...\nSusato:\n\nSusato:\nPlease, My Lord, if I may...\nRyunosuke:\nMiss Susato?!\nSusato:\nIt was not the defence's intention to submit the skin prints as formal evidence. We merely wished to present the results of the great detective's investigation of the scene... ...as a tool by which to explain a possibility to the ladies and gentlemen of the jury.\nVan Zieks:\n...!\nSusato:\nAnd, if the trial were to come to an end now... ...we should never learn the truth behind these mysterious handprints that everyone has now seen. I don't believe we can allow that to happen! And I'm sure the jurors would agree!\nJuror No. 1:\n...!\nJuror No. 2:\n...!\nJuror No. 3:\n...!\nJuror No. 4:\n...!\nJuror No. 5:\n...!\nJuror No. 6:\n...!\n???:\n\nJuror No. 3:\nYou're right! Whether those strange handprints are a significant clue or not...it's down to us to decide!\nRyunosuke:\nJuror number three!\nJuror No. 2:\nOh yes! I do declare that the great detective's investigation results sound absolutely fascinating! And I want to hear what that shady actor fellow has to say about those shady handprints!\nJuror No. 1:\nWhat's the matter with you two? That was foolhardy!\nJuror No. 6:\nWell, I did say it, didn't I? And I don't like to break a promise.\nJuror No. 1:\nNo! Wait! You heard His Lordship! It's not fair dinkum evidence!\nSusato:\nOh, well done, Mr Naruhodo! If just one more juror changes his or her mind... ...Mr Natsume's trial will have to continue!\nRyunosuke:\nThank you, Miss Susato. But I couldn't have done it without you.\nSusato:\nOh no, it was you who identified the clue, after all. This is very much your success.\nShamspeare:\n.........\nRyunosuke:\n(Why, Mr Shamspeare...you seem to be losing your composure...)\nSusato:\nJust one more juror, Mr Naruhodo! You can do it!\nJudge:\nVery well. Continue, Counsel!\nChanges Juror No. 2's statement to: \"I'm very interested in the results of this great detective's investigation at the scene!\"\nChanges Juror No. 3's statement to: \"We're the ones who decide if the evidence is worthy of consideration or not! Us. The jury.\"\nChanges Juror No. 6's statement to: \"I don't believe in breaking promises. We can't come to a decision whilst so much is up in the air.\"Juror No. 6:\nI don't believe in breaking promises. We can't come to a decision whilst so much is up in the air.Before \"Pursue\" tutorial\n\n\n\n\n\n\n\nRyunosuke:\n(Ugh, this is hopeless... There's no way for me to appeal to these people...)\nSusato:\nI do think that the only way we shall overcome this difficult situation... ...is by exposing the way in which Mr Shamspeare was really poisoned. We have to prove that it happened some other way, and not via Mr Natsume's tea.\nRyunosuke:\nYes, I know. The trouble is... ...I have absolutely no idea how it did happen.\nSusato:\nMr Naruhodo... ...I wonder if perhaps there's something...you might have forgotten.\nRyunosuke:\nOh? Like what?\nSusato:\nIt's important to watch everyone involved and pursue people if they react to something someone else says. If you'd like me to remind you exactly what I mean, I'd be more than happy to, of course.\nRyunosuke:\n(Once again, Soseki-san's fate is entirely in my hands here. I probably owe it to my client to hear any advice my assistant may be able to offer. So perhaps I ought to let Susato-san remind me. Then again...)\n\n\n\nRefresh my memory!\n\n\n\n\n\n\n\nSusato:\nWhen a particular juror is talking, the other jurors will be listening, naturally. Most of the time, when people are speaking themselves, they are careful not to give away more than they want to. But when they're listening to others speak, they tend to be less guarded.\nRyunosuke:\n...Yes, that's very true. \nSusato:\nSo, if you see people reacting strangely in an unguarded moment, you must 'Pursue' them to find out why! Here, take a look at this, Mr Naruhodo... When you press jurors about their assertions, a marker appears in the centre of the screen. By using [D-pad / A D], you can move the marker and see how other jurors are reacting to what's being said. And if you find a particular juror seems to be reacting oddly, you can 'Pursue' him or her about it. By catching people off guard, you may be able to glean new and potentially useful information!\nRyunosuke:\nYes! Alright, I've got it. (Press, and then if something seems odd... ...slide the marker with [D-pad / A D] to see if one of the other jurors is having an unusual reaction. If so, 'Pursue' that juror!)\n\n\n\n\nNo need!\n\n\n\n\n\n\n\nRyunosuke:\n...Actually, I don't think there's any need. It's vital that we start trying to change these jurors' minds as soon as possible!\nSusato:\nOf course. I'm sure you're right. But if you decide you would like your memory refreshed, you need only ask, Mr Naruhodo.After \"Pursue\" tutorial\n\n\n\n\n\n\n\nRyunosuke:\n(Ugh, this is hopeless... There's no way for me to appeal to these people...)\nSusato:\nI do think that the only way we shall overcome this difficult situation... ...is by exposing the way in which Mr Shamspeare was really poisoned. We have to prove that it happened some other way, and not via Mr Natsume's tea.\nRyunosuke:\nYes, I know. The trouble is... ...I have absolutely no idea how it did happen.\nSusato:\nOh dear... Are there no clues at all that might help us?\nRyunosuke:\nAll we can do is keep pressing these jurors for more information, I suppose. (Because we simply have to find some way to turn this situation around.)\nSusato:\n...Or Mr Natsume will be found guilty!Ryunosuke:\nObviously I'm talking about the defendant, Mr Soseki Natsume himself!Juror No. 1:\nThe defendant?Ryunosuke:\nAt the very beginning of the proceedings here in court yesterday, Mr Natsume said the following:Soseki:\nMY LODGINGS! THERE'S BEEN A WHOLE SERIES OF STRANGE HAPPENINGS IN MY LODGINGS!Soseki:\nEven on that fateful night, it happened. When I returned from Mr Shamspeare's room... ...I lit my gas stove and climbed into bed, but before long... ...the stove went out, AND SOMEBODY TRIED TO KILL ME!Ryunosuke:\nOn the night in question, the gas in the defendant's room went out. So I ask the court...was that a mere coincidence, or not?Juror No. 6:\nGood golly!Juror No. 3:\nSo that Shamspeare fellow blew air into the gas pipe to make the man's stove go out on purpose?!Juror No. 5:\nNow hold your horses there. What would he do that for?Shamspeare:\n.........Ryunosuke:\nMr Foreman!Juror No. 1:\nWhat the...?! What is it, man?Ryunosuke:\nWe cannot allow judgement to be passed whilst this doubt remains. It's true that I don't have conclusive evidence yet. However... ...you must surely agree...there is more to this case than meets the eye!Juror No. 1:\nAgh! ......... ...Fair enough. Like I said at the outset... ...I'm a man of logic, first and foremost.Ryunosuke:\nThat's four jurors leaning towards not guilty, My Lord. We've overturned the decision. Therefore...the defence calls for the trial to continue!Judge:\nAs the defence has rightfully indicated... ...the summation examination has concluded with a majority of jurors altering their decisions. Two jury members now call guilty. Four now call not guilty. Therefore, the jury's opinion is conflicted, and, in accordance with the law of this land... ...I hereby order the continuation of this trial.Judge:\nMr William Shamspeare!Shamspeare:\nMy Lord! How can thy humble Shamspeare serve thee?Judge:\nWhat say you in response to the various revelations made during the summation examination?Shamspeare:\nSo God mend me, I do solemnly swear... ...I recall aught of either the lamp or the pipe!Juror No. 5:\nBut your handprints have made a tidy mess all over the wall there. How d'you explain that, eh?Van Zieks:\nI am done with this. The dignity of this great courtroom has been sullied enough already...juror number five.Juror No. 5:\nWho, me?!Van Zieks:\nAs I went to some pains to point out already... ...a print from the self-professed detective's toy has no place in a British court of law.Juror No. 1:\nAgh!Van Zieks:\nAs such, whether or not this man did indeed stand before the gas lamp with his hands against the wall... ...remains, at this time, unestablished conjecture. You would all do well to remember that.Juror No. 3:\nAh.........Ryunosuke:Ryunosuke:\nBut the prosecution must concede that it would be extremely simple to verify! Just order the mouth of the gas pipe feeding that lamp in Mr Shamspeare's room to be examined! If there are traces of poison there...Van Zieks:Van Zieks:\nWhat appears to be extremely simple is my Nipponese friend's mind. You will recall that in order to check for the presence of poison in the tea, some remnants of tea were required.Ryunosuke:\nYes...Van Zieks:\nTherefore it shouldn't be beyond your wit to imagine that even if poison were to have been spread on the pipe... ...it would have completely evaporated by now, making any analysis impossible!Ryunosuke:\nAgh! (I didn't think of that...)Judge:\nIn any case, Counsel...I fail to see what could possibly have motivated the man to do as you describe. Why on earth would this fellow have wanted to blow air into the gas pipework where he lived?Ryunosuke:\n......... There's only one possibility that I can think of. And that is... ...to use the leaking gas to commit murder!Judge:\nOrdaaar! Ordaaar! ...Counsel! Precisely whose life do you propose this man was plotting to end?Ryunosuke:\n(The answer couldn't be simpler. Now we've unravelled the mystery this far...) Mr Shamspeare wanted to end the life of...Present Soseki Natsume profile\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"If a gas lamp were to go out, it would be noticed immediately, of course.\"Present anyone else\n\n\n\n\n\n\n\nRyunosuke:\n\nJudge:\nGood Lord! An unexpected answer indeed!\nRyunosuke:\nThat's right, My Lord. The nature of cases like these is that they're full of wild twists and turns!\nVan Zieks:\n\nVan Zieks:\nOr rather, My Lord... ...the nature of counsellors like these is that they're full of wide-eyed twattle and theatrics.\nRyunosuke:\nUWAAAGH! (Alright, keep calm... Just try to think... I know there's someone who's been complaining of troubles with the gas supply recently...)\nLeads back to:\n\"Mr Shamspeare wanted to end the life of...\"Ryunosuke:\nIf a gas lamp were to go out, it would be noticed immediately, of course. But a gas stove, on the other hand, could be silently extinguished by the killer without anyone noticing.Juror No. 5:\nI live round those parts myself, so I know what it's like. I can tell you, trying to sleep without the stove lit is pretty much suicide. You'd freeze to death in no time.Ryunosuke:\nMr Garrideb, the landlord, has a large fireplace in his part of the residence, on the top floor. In other words, it wasn't the landlord, but a fellow lodger whose life Mr Shamspeare was trying to end.Judge:\nOutrageous!Ryunosuke:\nI'm talking, of course...about the defendant!Shamspeare:\n.........Ryunosuke:\nMr Natsume isn't the villain in this case... ...he's the victim this man was trying to murder!Judge:\nGood gracious!Van Zieks:Van Zieks:\nThe accused is actually the aggrieved? ...Interesting. However...the fundamental facts of the case remain unchanged. Namely...that the accused is the aggressor here!Ryunosuke:\nWhat? How can you still claim that?Van Zieks:\nLet us indulge your fancies for a moment and assume that there was indeed poison on the mouth of the gas pipe. The question that then arises...is who put it there.Ryunosuke:\n...! (Who DID put it there?)Van Zieks:\nThe only logical conclusion is that the person responsible... ...was aware of this man's trickery with the gas supply and his intent to kill.Judge:\nYes, that would indeed seem logical. If the assailant were unaware, how would he or she have known to lace the end of the gas pipe with poison?Van Zieks:\nSo now we must ask...how could anyone have known of Mr Shamspeare's murderous designs?Susato:\nAh! You mean to suggest...?Van Zieks:\nNaturally, the sole possible answer to that question couldn't be more obvious. Only the man whose life was being threatened could possibly have known.Ryunosuke:\nWhat?Van Zieks:\nIn other words... ...the person who put the poison on the gas pipe, in what was a clear retaliatory attack... ...can only have been the accused, Mr Soseki Natsume.Ryunosuke:\nAh!Juror No. 1:\n...!Juror No. 2:\n...!Juror No. 3:\n...!Van Zieks:\nWhatever Mr William Shamspeare may or may not have contrived to do... ...he was nevertheless the victim of a potentially lethal poison attack. And the only person who could possibly have perpetrated that attack...is the accused, Mr Natsume.Juror No. 4:\n...!Juror No. 5:\n...!Juror No. 6:\n...!Van Zieks:\nThe defence counsel's theorising has failed to avert suspicion from the accused. Far from it. In fact, now that a clear motive for the poisoning has been successfully established... ...that suspicion is greater than ever. Would you not agree...my Nipponese friend?Ryunosuke:\nAh......... AAAAAAAAAAAARGH!!! (How did he manage to turn that around on me so rapidly?)Susato:\nMr Naruhodo, you must respond! Otherwise the members of the jury may very well change their leanings against us again. And this may be our last chance to gain the advantage!Ryunosuke:\nWhat advantage?Susato:\nWell, it would seem that somebody put poison on the gas pipe in Mr Shamspeare's room. So we must name that person now and absolve Mr Natsume of guilt!Ryunosuke:\nYou mean...name the true culprit?Susato:\n...I know it might sound impossible. But if we fail to do that... ...I have no doubt that Mr Natsume's fate will be sealed once and for all!Ryunosuke:\n(As it happens... ...one possible culprit does come to mind. The evidence... The poison... It's all pointing to a particular person now...)Van Zieks:\nThe prosecution calls for the jury to consider their leanings again. I trust you'll make the correct choice this time... Mr Foreman.Juror No. 1:\nHm? What? ...Oh, don't you worry! We know exactly what-Ryunosuke:Ryunosuke:\nThere is one other person who I believe could have been involved in all of this. The true culprit of this crime.Judge:\nThe, the true culprit?Van Zieks:\nA term found only in second-rate novels featuring third-rate 'great detectives'...my Nipponese friend. But why not? This farce has gone on for so long already, I see no reason to cut it short before its disappointing climax.Ryunosuke:\nThank you.Van Zieks:\nTell us, my learned Nipponese friend...what is your latest theory? Who is the so-called 'true culprit' of this crime?Present Olive Green profile\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"The name of the person responsible for the poison that afflicted Mr Shamspeare is, I believe...\"Present anyone else\n\n\n\n\n\n\n\nRyunosuke:\n\nVan Zieks:\n......... You claim this person is the true culprit?\nRyunosuke:\nHighly suspicious, I would say, yes!\nVan Zieks:\nPerhaps, my learned Nipponese friend, you should turn those wide eyes of suspicion on yourself.\nRyunosuke:\nWhat?\nVan Zieks:\nFor it seems to me that your reckless reasoning makes you, far more than anyone else you could name... ...a very dangerous man indeed!\nRyunosuke:\nGAAAAAAAAAAAH!\nSusato:\nMr Naruhodo, please! You must concentrate!\nRyunosuke:\nI, I was trying to!\nSusato:\nThen you must concentrate harder!\nRyunosuke:\n(Ugh. Harsh...)\nLeads back to:\n\"Who is the so-called 'true culprit' of this crime?\"Ryunosuke:\nThe name of the person responsible for the poison that afflicted Mr Shamspeare is, I believe... ...Miss Olive Green.Judge:\nMiss Olive Green... Miss...Olive Green... I do feel as though I've heard that name in the recent past, Counsel. But I don't recall where...Van Zieks:\nMiss Olive Green? The woman from six days ago... The victim in the recent case of stabbing on Briar Road. An incident for which Mr Natsume was arrested, I hasten to add.Judge:\nOh... Of course, yes! Miss Green. She was left comatose for some three days, I believe. But I hear she regained consciousness two days ago.Van Zieks:\nAnd I hardly need remind the court that Mr Shamspeare's poisoning took place three days ago. Given that the woman was lying comatose in a hospital bed at the time, she appears to have a rather fine alibi.Ryunosuke:\n(True, on the night that the incident occurred, Miss Green was in hospital, unconscious. So on the face of it, it would seem that she couldn't possibly be responsible. But still...) My colleagues and I visited Miss Green in hospital yesterday. And we found her to be in possession of a bottle of poison.Judge:\nGood gracious! She had poison?Ryunosuke:\nAnd there is another fact that links Miss Green to this case as well. The defence requests that she be brought to the witness stand in order to explain the details to the court.Judge:\nHmmm... Tell me, Mr Shamspeare...Shamspeare:\nMy Lord! Pray, what be thy bidding?Judge:\nAre you acquainted with Miss Green?Shamspeare:\nEh? N-No, never heard of her...Susato:\nJudging by the look on Mr Shamspeare's face... ...I think perhaps he genuinely doesn't know her. At least...not by name.Van Zieks:\n...As the voice of Her Majesty's prosecution here, I adhere to my word. We will see my learned Nipponese friend's farce through to its conclusion.Ryunosuke:\nI, I appreciate that!Van Zieks:\nThe prosecution requests a short recess, My Lord. In order to subpoena the witness and bring her here.Judge:\nYes, Miss Olive Green...Van Zieks:\nIndeed, My Lord. One hour should be sufficient.Judge:\nVery well. I grant the request.Ryunosuke:\n(Excellent...I hope.)Judge:\nThe defence has made a most extraordinary accusation, I must say. But at the present time, I feel the prosecution's argument remains largely uncontested. Accordingly, I'm afraid the defendant and his culpability remain the sole subject of this court's attention. Thank you, Counsels. We reconvene in one hour. Court is adjourned!To be continued...23rd February, 11:32 a.m.\nThe Old Bailey, Defendants' AntechamberSoseki:Joyful, Jubilant, Jumping Jacks!Susato:\nOh, Mr Natsume! I'm so pleased for you!Soseki:\nLocum Student Mr Naruhodo Esquire! And Non-Locum Judicial Assistant Miss Mikotoba Esquiress! Now, finally...at long last, there can be proof... Proof that I'm innocent, and...proof that my tea is innocent!Sholmes:\nAh! Good morning, my dear fellows!Soseki:\nARGH! HERR LOCK SHOLMES! May you drink my tepid tea and fall forever silent!Ryunosuke:\n(I thought the tea was innocent...)Susato:\nOh, Mr Sholmes, you came! How wonderful!Sholmes:\nPlease, save your derision. I know what you're all thinking. '\"Good morning,\" he says? When it's very nearly time for luncheon...' Your scorn is written clearly across your faces.Ryunosuke:\nNobody said or thought anything of the sort.Sholmes:\nThe truth is, I was determined that today would be the day. As sleep seduced me last night, I thought... ...'Tomorrow for once I shall not oversleep! I'll rise early and be present in court to support my companions!' Such spirited determination has a beauty all of its own, does it not?Susato:\nOh yes!Sholmes:\nAnd then I began to muse on the subject. 'Why do people oversleep?' I queried. 'Why, time after time, do they make the same foolish blunder?' And the answer came to me at once. It's so delightfully simple: people oversleep...because they sleep! Well? Is that not an astute insight into the matter?Susato:\nOh...yes.Sholmes:\nUpon which realisation, I attempted an experiment. I didn't sleep a wink all night! And the results... By first light, I was exhausted and began to be assailed by fits of drowsiness.Ryunosuke:\nShocking...Sholmes:\nAnd so, the conclusion of last night's experiment is this: a good night's sleep is quite simply essential!Ryunosuke:\nYes, I think most of us probably knew that already.Sholmes:\nWhat others presuppose, I prove by experimentation. That, my dear fellow, is the scientific method! Ah yes, and one more thing... Do you remember this?Susato:\nAh!Ryunosuke:\nYes, of course. It's the poison that Miss Green was about to drink at the hospital yesterday. Oh! You didn't manage to...?Sholmes:\nIt was a laborious task, as the bottle was near empty. But such inconveniences do not hinder Sholmes. I managed to confirm that it contained strychnine.Ryunosuke:\n...So I was right.Sholmes:\nPerhaps. Though of course such circumstantial evidence doesn't prove Miss Green's guilt. I shall leave the bottle in your care now. But licking the inside of the neck is not recommended!The bottle of poison has been entered into the Court Record.???:\nAh...could I have a word?Examine evidence\n\n\n\n\n\n\n\n\n\nBottle of Poison\n\n\n\n\n\n\n\n\n\nBottom of bottle\n\n\n\n\n\n\n\nRyunosuke:\nSo this is the poison we've been hearing so much about. Strychnine... There are a few remnants on the bottom of the bottle here, look.\nSusato:\nYou mustn't be tempted to try it.\nRyunosuke:\nOf course not. ...As long as we don't lose this trial.\nSusato:\n......... No! Even if we lose the trial! ......... No! We mustn't lose the trial in the first place, Mr Naruhodo!\nRyunosuke:\n(Make your mind up, Susato-san...)Sholmes:\nGregson! How good of you to come!Gregson:\n......... Forget it. Excuse me...Ryunosuke:\nWait a minute, Inspector!Gregson:\nI, um...don't wish to make a nuisance of myself...Ryunosuke:\n(From the look on your face, I'd say it's someone else who you think is making a nuisance of himself.)Sholmes:\nMy dear inspector, please, speak freely. Pretend that I'm not here.Gregson:\nBelieve me, if I could do that, life would be a whole lot simpler for me.Susato:\nDo you have the results, Inspector? Of the investigation of Mr Shamspeare's room?Gregson:\nNot yet. Shouldn't be long now, though. No, I'm here about somethin' else. That dead convict, actually.Ryunosuke:\nOh, you mean the man from this newspaper article we discovered yesterday in Mr Shamspeare's room?Susato:\nA man by the name of... Ah yes, Selden.Gregson:\nI went through the archives at the Yard and dug out the fellow's file. There's somethin' in there that... Well, it caught my eye.Susato:\nSomething caught your eye? What, Inspector? What?Gregson:\nI've copied out the relevant parts for you. So you can read it for yourselves.Ryunosuke:\nThank you!The capital offender's file has been entered into the Court Record.Susato:\nThese documents... ...include the details that were in the newspaper cutting we found in Mr Shamspeare's room. I'll rearrange everything in the Court Record so we don't have duplicate information!Ryunosuke:\nWhy are you giving us a copy of this important file, though?Gregson:\nWell...you're the ones who turned up the clue in the first place, aren't you? I'm just makin' sure things get handled in the proper fashion.Susato:\nOh, Scotland Yard's workings are so wonderful!Sholmes:\nIndeed, my dear fellows! And the inspector here is a shining diamond in its crown!Ryunosuke:\nA shining diamond...in the rough, maybe.Gregson:\nLook, I just don't wanna be beholden to a lawyer, that's all.Bailiff:\nCounsel for the Defence! And the defendant! Court proceedings are about to resume. Make your way into the courtroom at once!Sholmes:\nWell, I shall leave you then. I'll be listening with interest from the public gallery. Not nodding off at all! Certainly not!Ryunosuke:\nThank you, Mr Sholmes.Sholmes:\nI'm rather tired of seeing Mr Moustache in floods of tears, personally. So...the best of luck to you!Soseki:\nLOCUM STUDENT MR NARUHODO ESQUIRE!Ryunosuke:\nYes, Mr Natsume?Soseki:\nIt's, it's time, isn't it?Ryunosuke:\nYes...this is it. Miss Olive Green and Mr William Shamspeare... This is going to be the final battle. (I won't really have saved Soseki-san... ...until I've exposed the whole truth of everything that's been going on. But it's all coming to a head now. You can do it, Ryunosuke. You have to!)23rd February, 12:30 p.m.\nThe Old Bailey CourtroomJudge:\nIn the name of Her Majesty the Queen, I hereby declare this court to be in session again now. Before the recess, we heard a most startling accusation from the defence. Namely, that the victim of the case we heard here only a few days ago is the true perpetrator of this incident.Van Zieks:\nA reckless, rash and prejudiced charge of wrongdoing in my opinion, My Lord. However... ...the prosecution has tried to extend every courtesy to this amateur newcomer from dubious Eastern shores.Ryunosuke:\nThank you! (...For that backhanded consideration.)Judge:\n...A rather cold assessment from the honourable British prosecutor, I must say. So, Lord van Zieks...is the new witness present and ready to take the stand?Van Zieks:\nReady and waiting in the witnesses' antechamber, My Lord.Judge:\nVery well. Bailiff! Bring the witnesses in!Van Zieks:\nWitnesses...state your names and occupations for the court, please.Shamspeare:\nWilliam Shamspeare, my liege. For mine occupation, I can say only... ...that I be a tragic victim. To be pitied.Van Zieks:\nCurrently unemployed, in other words.Green:\nI'm Olive Green. I'm a fledgling artist. ...Well, no... ...not a fledgling, really. A hopeless failure who's too weak-spirited to admit she has no talent, I suppose...Van Zieks:\nAlso currently unemployed, in other words.Ryunosuke:\n(What a coterie...)Judge:\nMr Shamspeare...Shamspeare:\nMy Lord, I am thy humble servant...Judge:\nI'm afraid that you are no longer merely the victim in this affair. The possibility has been raised that you are in fact the assailant, intent on taking the life of your fellow lodger. The part you have played in this whole business will be thoroughly scrutinised, I assure you.Shamspeare:\n...I would for nought else, My Lord!Judge:\nAnd Miss Green...Green:\n...Yes?Judge:\nYou are aware of the reason you have been summoned to this courtroom today, I presume?Green:\n......... Yes, the officer did explain. He said I poisoned...this ridiculous buffoon.Ryunosuke:\nAnd? Do you accept the charge, Miss Green?Green:\n......... I don't know anything about any poisoning. And...I don't know anything about this man.Shamspeare:\n'Come, lady, die to live.' Verily, I know not thy prickly, pea-pigmented personage.Judge:\nVery well. Let us proceed with the matter at hand. That being to ascertain whether or not Miss Green has any involvement in this affair.Green:\nIt's all very strange. Very strange indeed. Why would you suspect me? I barely ever go to the East End anyway. It so happens that I passed by that neighbourhood six days ago, that's all. And on the night that this man was poisoned, I was still in hospital, fighting for my life.Van Zieks:\nYes, having been unfortunately caught up in the incident on the street outside the Garrideb household. An incident that rendered you unconscious for some three days.Green:\nI was struck in the middle of my back by a knife, through no fault of my own, and now I'M under suspicion? What other irrelevant things might I be suspected of? It's all very disturbing...Judge:\nHmmm, your energies may be better spent worrying about random knife attacks, I feel, Miss Green.Ryunosuke:\nAt this point in time... ...all that appears to connect you with Mr Shamspeare's lodgings is the Briar Road incident of six days ago. That's why... ...we would like you to testify formally now about exactly what happened.Green:\nOh no! The incident six days ago? You, you mean you want me to relive that awful accident?Ryunosuke:\nUnfortunately, yes. Please tell the court what happened that day. And of course...we will be interested to hear from you about your movements that day, too, Mr Shamspeare.Shamspeare:\nEh? But, but what happened six days ago is nothing to do with me being poisoned!Judge:\nLet us proceed, then. The witnesses will present their formal testimony to the court... ...on the subject of the incident that took place on Briar Road the evening of the seventeenth of February!Witness Testimony\n- The Evening of 17th February -Green:\nIt was six days ago, at about 5 p.m. I was walking along in the snow when I was suddenly stabbed in the back.\nCoincidentally, it happened to be just outside the house where the men in this case have their lodgings.Shamspeare:\nI was at the tavern on the eve of which thou speak'st, for I had bespoke my supper.Green:\nIt was the first time I'd been in the area. I had a little matter to attend to, that's all.\nAnyway, I was admitted straight to hospital, so I knew nothing about all of this business.Judge:\nYes, a second incident inside a week at what I believe to be aptly described as 'the haunted lodgings'. One can only presume this is a most unfortunate coincidence...Van Zieks:\nMeanwhile, you say you were not in your room, Mr Shamspeare?Shamspeare:\n'Twas the following morn when I did awaken that I learn'd of the dire events. Marry! What a commotion did the officers of the law make on the floor above mine!Ryunosuke:\n(When Soseki-san was arrested on suspicion of attempted murder...)Van Zieks:\nAs suspected, there is nothing connecting these two witnesses but happenstance.Ryunosuke:\n(It's true, it does seem as though they're unrelated at first glance. But I'm not so sure... There's something lurking in the shadows here. I feel certain of it. And this is my one and only chance to expose it!)Judge:\nCounsel, you may now cross-examine these two witnesses if you wish.Ryunosuke:\nYes, My Lord!Cross-Examination\n- The Evening of 17th February -",
      "testimonies": [
        {
          "testimony": "It was six days ago, at about 5 p.m. I was walking along in the snow when I was suddenly stabbed in the back.",
          "person": "Green",
          "present": []
        },
        {
          "testimony": "Coincidentally, it happened to be just outside the house where the men in this case have their lodgings.",
          "person": "Green",
          "present": []
        },
        {
          "testimony": "I was at the tavern on the eve of which thou speak'st, for I had bespoke my supper.",
          "person": "Shamspeare",
          "present": []
        },
        {
          "testimony": "It was the first time I'd been in the area. I had a little matter to attend to, that's all.",
          "person": "Green",
          "present": []
        },
        {
          "testimony": "Anyway, I was admitted straight to hospital, so I knew nothing about all of this business.",
          "person": "Green",
          "present": []
        },
        {
          "testimony": "This note was delivered to me at my address. It's nothing to do with the odd man next to me here.",
          "person": "Green",
          "present": [
            "Torn-Off End of Envelope",
            "Miss Green's Card"
          ],
          "source": {
            "evidence_span": [
              "A ripped piece of an envelope that was found in Mr Shamspeare's room. It fits perfectly with an envelope in Miss Green's possession.",
              "A note in an envelope that seems to have been ripped open rather roughly. The envelope fits perfectly with a torn-off piece found at the scene of the crime."
            ],
            "testimony_span": "This note was delivered to me at my address. It's nothing to do with the odd man next to me here.",
            "explanation": "If the note was delivered to Miss Green's address, and Miss Green has nothing to do with Mr. Shamspear, the note shall not be at the scene of the crime.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Green is testifying about the incident six days ago, when she was stabbed in the back. ",
      "labels": [
        "behavioral"
      ],
      "reasoning": [
        "Fact 1: The witness, Miss Green, claims she have the note delivered to her address.",
        "Fact 2: The witness claims she has nothing to do with Mr. Shamspear.",
        "Fact 2: The evidence suggests the note was found at the scene of the crime, Mr. Shamspear's home.",
        "Prop 1: If one is not related to the victim, then a note delivered to her address shall not be at the scene of the crime."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "Green:\nIt was six days ago, at about 5 p.m. I was walking along in the snow when I was suddenly stabbed in the back.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nI'm well acquainted with the case. ...I'm sorry you had to go through that.\nGreen:\nIt was awful. I still can't believe I was unconscious for so long. And I woke up to find that the case had been solved and the culprit arrested.\nVan Zieks:\nYes. The incident has been resolved already. Perhaps it would help you to consider it a bad dream that ended with your wakening...and should now be forgotten.\nGreen:\nYes, I...I suppose so. Thank you.\nRyunosuke:\nBut before you put it completely behind you, Miss Green, I need you to remember the details one last time. You must tell the court exactly what happened that day... for us to arrive at the truth about this new case.\nGreen:\nThe trouble is, there's nothing to tell, really. I was just walking along the pavement.Green:\nCoincidentally, it happened to be just outside the house where the men in this case have their lodgings.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nWhat were you doing there that day, though?\nGreen:\nWhat do you mean...?\nRyunosuke:\nThe art school you attend... What's it called?\nGreen:\nAh...yes... It's the Thorndyke Academy of Fine Arts.\nSusato:\nAccording to Mr Sholmes, that's just in the vicinity of Brixton Road... ...which is some ten stops away from the scene on the Underground.\nRyunosuke:\nI believe you mentioned before that you also live on Brixton Road. Isn't that right? So why, then, would you have been walking along Briar Road in the middle of the East End?\nGreen:\nWell...um... It's because, um... Oh yes, of course! I thought it might make a nice picture!\nVan Zieks:\nThe witness is a student of art. City-dwelling artists can't all paint grand urban vistas.\nGreen:\nThat's, that's right! I happen to like the crumbling look of that part of town.\nSusato:\nPerhaps 'quaint' would have been a less...grating term...\nRyunosuke:\nThe point is, she's definitely hiding something.\nSusato:\nYes. It seems she's not going to be forthcoming with the truth...\nRyunosuke:\n(If she's trying to hide why she was there that evening... ...it must mean there's a reason for her not wanting us to know. That's the key to this!) And you, Mr Shamspeare... On the evening of the incident six days ago... ...would you tell the court what exactly you were doing?\nShamspeare:\n'Twould be my pleasure, sire.Shamspeare:\nI was at the tavern on the eve of which thou speak'st, for I had bespoke my supper.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nA tavern, you say? Which one?\nShamspeare:\n'Twas the Slug and Salad where I did tarry. 'Tis a jewel in the East End.\nVan Zieks:\n......... And a little unexpected, I feel.\nShamspeare:\nHm?\nRyunosuke:\nWhat do you mean, Lord van Zieks?\nVan Zieks:\nThe Slug and Salad offers unusually fine dining...for the locality, at least. Not an establishment you'd expect to be patronised by a man with not even a crumb of bread in his room.\nShamspeare:\n...!\nSusato:\nIt's true. The menu lists premium crusts of bread and glasses of water...in different levels of cloudiness.\nVan Zieks:\nI would have expected Grub's Grubbery in the local vicinity to be more...appropriate for your means. Watery soup and mushy peas. Or rather, soupy water and pea-like mush.\nRyunosuke:\nAll equally appetising...\nShamspeare:\nI, I just wanted to try some water in a different pub for once! What's wrong with that?\nRyunosuke:\n(How different can water really be...?)\nSusato:\nOr perhaps...there's a more plausible explanation. A specific reason why he had to go to that particular establishment...\nRyunosuke:\nAgreed. The fact that on that day of all days, he dined at a place he wouldn't normally... It does stand out. (So Mr Shamspeare's own actions on the day of the incident six days ago were slightly suspicious... I wonder if we have some evidence that can explain those actions...)\n\n\n\nPresent evidence\n\n\n\n\n\n\n\nRyunosuke:\nMr Shamspeare...\nShamspeare:\nY-Yes, sire?\nRyunosuke:\nOn the day in question, is it not the case that you visited The Slug and Salad, a place you don't normally patronise... ...for a very particular reason?\nShamspeare:\nI, I don't know what you're talking about. Pray, if thou hast some purpose, speak'st!\nRyunosuke:\nVery well! I will present the court with evidence. Evidence that explains why you had to be at The Slug and Salad that day. Namely...\n\n\n\nPresent Torn-Off End of Envelope (after examining jagged edge once Miss Green's Card has been added to the Court Record)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nI believe this torn-off piece of envelope reveals the answer. Because it fits together perfectly with the envelope of the card that was submitted into evidence earlier.\nJudge:\nGood Lord! Miss Green's card, you mean?\nRyunosuke:\nThat's right, My Lord. It reads: 'I have information regarding the death of Duncan Ross. Come to The Slug and Salad on Briar Road at 5 p.m. on 17th. Don't tell anybody else about this letter or the meeting. It is a matter of utmost importance.' Mr Shamspeare... Your actions on the afternoon of Miss Green's stabbing... ...are exactly as described in this note.\nShamspeare:\nAh...\nRyunosuke:\nPersonally, I find it hard to believe that's a coincidence. Don't you, Mr Shamspeare?\nShamspeare:\nUm...well...\nGreen:\nExcuse me...can I say something?\nRyunosuke:\nYes, Miss Green?\nGreen:\nThat card was delivered to me. It doesn't have anything to do with THIS odd man, does it?\nRyunosuke:\nWell, well you'd think so, yes. But it's hard to believe it's merely-\nGreen:\nMy Lord, may I?\nJudge:\nMay you what, Miss Green?\nGreen:\nI'd like to make something very clear about that card.\nJudge:\nVery well then, you may amend your testimony... ...to include details about the peculiar note.\nChanges fifth statement from \"Anyway, I was admitted straight to hospital, so I knew nothing about all of this business.\" to \"This note was delivered to me at my address. It's nothing to do with the odd man next to me here.\"\n\n\n\n\nPresent Miss Green's Card (after examining envelope)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nI believe this card reveals the answer.\nJudge:\nGood Lord! Miss Green's card, you mean?\nRyunosuke:\nThat's right, My Lord. It reads: 'I have information regarding the death of Duncan Ross. Come to The Slug and Salad on Briar Road at 5 p.m. on 17th. Don't tell anybody else about this letter or the meeting. It is a matter of utmost importance.' Mr Shamspeare... Your actions on the afternoon of Miss Green's stabbing... ...are exactly as described in this note.\nShamspeare:\nAh...\nRyunosuke:\nPersonally, I find it hard to believe that's a coincidence. Don't you, Mr Shamspeare?\nShamspeare:\nUm...well...\nGreen:\nExcuse me...can I say something?\nRyunosuke:\nYes, Miss Green?\nGreen:\nThat card was delivered to me. It doesn't have anything to do with THIS odd man, does it?\nRyunosuke:\nWell, well you'd think so, yes. But it's hard to believe it's merely-\nGreen:\nMy Lord, may I?\nJudge:\nMay you what, Miss Green?\nGreen:\nI'd like to make something very clear about that card.\nJudge:\nVery well then, you may amend your testimony... ...to include details about the peculiar note.\nChanges fifth statement from \"Anyway, I was admitted straight to hospital, so I knew nothing about all of this business.\" to \"This note was delivered to me at my address. It's nothing to do with the odd man next to me here.\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nRyunosuke:\n\nShamspeare:\nO good Horatio... ...there are more things in Heaven and Earth, than are dreamt of in your philosophy.\nRyunosuke:\nHoratio?\nSusato:\nI believe it's a line from Shakespeare's play 'Hamlet', Mr Naruhodo.\nVan Zieks:\nBe it a line from the great Shakespeare or from this... Mr Shamspeare, the message is the same: My learned Nipponese friend is wide of the mark.\nRyunosuke:\n(Hardly surprising given this witness's obtuse literary quotes...)\nSusato:\nI do wonder if there isn't perhaps some evidence that would explain why it was The Slug and Salad he visited...\nJudge:\nI think we have discussed this issue enough. Let us return to the witnesses' testimony, please...\nShamspeare:\nGladly I would thy bidding do, Horatio...\nLeads back to cross-examination\n\n\n\n\n\nNot at the moment\n\n\n\n\n\n\n\nRyunosuke:\n(I wish we did...but sadly I can't think of anything at the moment.)\nSusato:\nIf we find a clue that could explain why Mr Shamspeare went there, we must present it to the court!\nRyunosuke:\nYes, absolutely!\nJudge:\nIf that is all on this matter, Counsel, I would ask Miss Green to reiterate her next statement.\nLeads back to cross-examinationPress (after changing fifth statement)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nRemind me, which tavern was it?\nShamspeare:\nWhy, The Slug and Salad, sire. As I said to thee erewhile.\nRyunosuke:\nSo on that particular evening, and no other, you chose to visit a different tavern to normal. And the reason for that is written in this card, isn't it? 'Come to The Slug and Salad on Briar Road at 5 p.m. on 17th.'\nShamspeare:\nNo! ...Nay! The green woman already told you! The note is nothing to do with this odd man!\nRyunosuke:\n(That's one admission, at least...)\nSusato:\nBut the undeniable truth is that the torn-off end of the envelope was found in Mr Shamspeare's room.\nRyunosuke:\nIn other words... ...one or the other of these witnesses is lying!\nShamspeare:\n.........\nGreen:\n.........\nVan Zieks:\nLet's return to the testimony, shall we?Green:\nIt was the first time I'd been in the area. I had a little matter to attend to, that's all.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nWhat 'little matter', Miss Green? Please elaborate.\nGreen:\nIt was nothing, really. It's not worth mentioning.\nRyunosuke:\nIf you remember, you mentioned it to us yesterday at the hospital.\nGreen:\nAh...\nRyunosuke:\nIt was related to the card you were holding.\n\n\nRyunosuke:\nMiss Green! (What was that?! She clearly just hid something behind her back!)\n\n\nRyunosuke:\nFrom memory, I believe the card contained a note that read: 'I have information regarding the death of Duncan Ross.'\nGreen:\nWh-What does that matter? This has nothing to do with Duncan.\n\n\n\nPursue William Shamspeare (before Miss Green's Card is added to the Court Record)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nMr Shamspeare! Do you have something to share with the court?\nShamspeare:\n......... 'To be, or not to be, that is the question...' ...Ah, pray, forgive me. The great bard's words springeth from within me with ne'er a thought.\nRyunosuke:\n(Don't tell me... It's because you're possessed by Shakespeare's spirit, right?) Hearing Miss Green's words a moment ago seemed to make you think of something. Something of relevance perhaps?\nShamspeare:\nEh?! Um...well... Nay nay, sire! 'Twas nothing at all!\nRyunosuke:\nPresumably you know the name, though? Mr Duncan Ross, I mean. After all, you were both lodgers in the same house.\nShamspeare:\nI would it were so, but sadly nay. Lodging be a lonely occupation, sire. My lodging fellows be rarely known to me.\nRyunosuke:\nSo you haven't heard of him...even though he passed away in the room just one floor above yours?\nShamspeare:\n...!\nJudge:\nHmmm... Miss Green.\nGreen:\nMe, My Lord? Have I done something wrong?\nJudge:\nThe card that was mentioned before...containing the note. Do you have it upon your person?\nGreen:\nI do, yes. But I don't need it any more. In fact, I should throw it away, really.\nJudge:\nBefore you dispose of it, the court will take it as evidence, please.\nMiss Green's card has been entered into the Court Record.\nRyunosuke:\n(Of course... That's what links Mr Shamspeare and Miss Green! It's Duncan Ross!)\nJudge:\nNow, continue with your testimony, please, Miss Green.\nLeads back to cross-examination\n\n\nVan Zieks:\nDuncan Ross...\nRyunosuke:\nPlease, Miss Green. Tell us more about that note!\nGreen:\n......... I'm sorry... ...there's really nothing I can tell you. But I can assure you, it's unrelated to all of this. Completely unrelated.\nRyunosuke:\nThe truth is, you went out that day because that's what the note told you to do, isn't it? The instructions were for you to come to Briar Road at five o'clock that afternoon.\nGreen:\n......... I didn't think I should go at first. But then... ...I thought it might be a good opportunity to see what the East End looked like.\nJudge:\nHmmm... Very well, if that's your final word on the matter. Continue, please.Examine evidence\n\n\n\n\n\n\n\n\n\nMiss Green's Card\n\n\n\n\n\n\n\n\n\nEnvelope or card\n\n\n\n\n\n\n\nRyunosuke:\nThe envelope has been ripped open rather carelessly, hasn't it? Miss Green strikes me as the type to open correspondence more neatly than that. ......... Ah.\nSusato:\nWhat is it?\nRyunosuke:\nThe way the envelope is torn... I'm almost sure I've seen that exact same shape somewhere else.\nSusato:\n......... Oh! You don't mean... Were you thinking of this piece of evidence, Mr Naruhodo?\nRyunosuke:\nExactly! That's it. Try to match them up...\nSusato:\nThey go together perfectly... This torn-off end of the envelope clearly belongs with this card!\nThe details of Miss Green's card have been updated in the Court Record.\nThe details of the torn-off end of envelope have been updated in the Court Record.\n\n\n\n\nEnvelope or card (subsequent times)\n\n\n\n\n\n\n\nRyunosuke:\nThe envelope that contained the note to Miss Green and the torn-off card we found fit together perfectly.\nSusato:\nYes! There's no question that they're from the same letter!\nRyunosuke:\nBut...that means... (Something doesn't quite add up here, does it?)\n\n\n\n\n\nTorn-Off End of Envelope\n\n\n\n\n\n\n\n\n\nJagged edge (before examining envelope or card of Miss Green's Card)\n\n\n\n\n\n\n\nRyunosuke:\nDo you remember where we found this torn-off piece of envelope?\nSusato:\nYes, of course. It was in Mr Shamspeare's room.\nRyunosuke:\nFor some reason, it's suddenly started to bother me. ......... The way it's been ripped... I feel sure I've seen the same pattern somewhere else...\nSusato:\n......... Ah! I wonder if it could be this you're thinking of! The envelope in which Miss Green's card came.\nRyunosuke:\nYes! That's it! Try putting them together now and let's see...\nSusato:\nThey go together perfectly... This torn-off end of the envelope clearly belongs with this card!\nThe details of the torn-off end of envelope have been updated in the Court Record.\nThe details of Miss Green's card have been updated in the Court Record.\n\n\n\n\nJagged edge (subsequent times, or after examining envelope or card of Miss Green's Card)\n\n\n\n\n\n\n\nRyunosuke:\nThe envelope that contained the note to Miss Green and the torn-off card we found fit together perfectly.\nSusato:\nYes! There's no question that they're from the same letter!\nRyunosuke:\nBut...that means... (Something doesn't quite add up here, does it?)Green:\nAnyway, I was admitted straight to hospital, so I knew nothing about all of this business.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYes, you didn't regain consciousness until the day after the trial, did you? In the early hours.\nGreen:\nExactly! So how could I have had anything to do with it? And yet you still haul me in here to court like this. Honestly...!\nVan Zieks:\nSo at the time of the poisoning, the witness was unconscious in her hospital bed. Could there be a more airtight alibi, I ask you?\nRyunosuke:\n.........\nGreen:\nAnd yet, in spite of that, you claim that I was the culprit?\nRyunosuke:\nWell, I, I, erm...\nGreen:\nBut you certainly haven't produced any evidence to support your wild claim, have you? None at all!\nVan Zieks:\nThere you have it. The good lady has yet to see evidence...my learned Nipponese friend.\nRyunosuke:\nI'm working on it...\nJudge:\nCounsel, I will point out here that the jury's next decision will be final.\nRyunosuke:\n(We're really up against the wall here...)Green:\nThis note was delivered to me at my address. It's nothing to do with the odd man next to me here.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nI think you said that you received it the day before the incident, didn't you?\nGreen:\nYes, that's right.\nVan Zieks:\nThere appears to be no indication of the sender's name or address on the envelope.\nGreen:\nIt was in my letterbox and that's all I know, I'm afraid. I've no idea who sent it.\nJudge:\n'I have information regarding the death of Duncan Ross.' Who is this Duncan Ross, please?\nGreen:\nA friend of mine. He attended the same art school as I do. He, he passed away in a tragic accident a month ago now, though. I wasn't sure what to make of that note, to be honest, but in the end I decided to go.\nRyunosuke:\nSo you found out what the information was?\nGreen:\nOf course I didn't. You're not thinking straight.\nVan Zieks:\nWhilst on her way there, she was stabbed in the back. ...As my learned friend hopefully remembers.\nRyunosuke:\nAh! Yes, of course! (She never made it to the meeting...)Present Torn-Off End of Envelope or Miss Green's Card\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"The day before the incident - exactly one week ago now - this note was delivered to your address.\"Before pressing fourth statement\n\n\n\n\n\n\n\nRyunosuke:\n(So that's all the testimony I have to work with...)\nSusato:\nThere's certainly no obvious link between these two, or the two incidents.\nRyunosuke:\nBut we can't just turn around and admit this has all been a waste of time! I have some pride you know, Miss Susato.\nSusato:\nI think perhaps pride shouldn't come into this, Mr Naruhodo.\nRyunosuke:\nWell anyway, I should at least make sure I've pressed them on all of their statements. ...And hard, too.\nSusato:\nOh dear...did you hear what I said about pride?After pressing fourth statement, before pursuing William Shamspeare correctly\n\n\n\n\n\n\n\nSusato:\nMr Naruhodo, did you notice? One of the witnesses reacted rather strangely to something that was said before.\nRyunosuke:\nOh! You mean...?\nSusato:\nThat's right. When you see someone reacting in an odd way, it's time to 'pursue'!\nRyunosuke:\n(I need to keep a closer eye on the people in the stand, even if they're not speaking at the time, it seems...)After pursuing William Shamspeare correctly\n\n\n\n\n\n\n\nSusato:\nOh, Mr Naruhodo! You pursued Mr Shamspeare wonderfully there!\nRyunosuke:\nIt's worked out well, hasn't it? We have a new clue at last! Alright! Now I need to pull off a really insightful objection somewhere...\nSusato:\nWell... ...as you've managed to expose this promising new angle, I wonder if you should perhaps try to develop that?\nRyunosuke:\nAh! Yes, of course! (And yelling out objections isn't necessarily the best way to do that, I suppose...)Ryunosuke:\nThe day before the incident - exactly one week ago now - this note was delivered to your address. And upon carrying out the instructions in the note...you found yourself in hospital.Green:\nYes, I did! It's terrible, everything that's happened to me!Ryunosuke:\nYes, it is terrible. ...If it's all true, that is.Green:\nWhat do you mean?Ryunosuke:\nMiss Green, have a look at this, please. It's the torn-off end of an envelope.Green:\nOh...is it?Ryunosuke:\nAnd it so happens...that it fits together perfectly with the envelope of the note you received.Green:\n...! Wh-Where did you find that?Ryunosuke:\nIn Mr Shamspeare's room.Shamspeare:\nEh? In, in my room?Ryunosuke:\nMr Shamspeare... ...do you perhaps remember this note from somewhere?Shamspeare:\nUh...well...Ryunosuke:\nYour actions that afternoon follow the instructions in the note to the letter. 'Come to The Slug and Salad on Briar Road at 5 p.m. on 17th.' And so that's exactly where you went.Shamspeare:\n...!Ryunosuke:\nLet me ask you again, Mr Shamspeare... You already knew about this note, didn't you?Shamspeare:\n.........Ryunosuke:\nAnd you, Miss Green!Green:\nAh! What did I do?!Ryunosuke:\nAs this torn-off end of the envelope proves... ...the note was originally in Mr Shamspeare's room. So how is it that it came to be in your possession?Green:\nI, I don't have the first idea. I'm just a fledgling artist, after all.Ryunosuke:\nThere is only one explanation! You broke into Mr Shamspeare's room and stole it!Green:\n.........Shamspeare:\nYou did wha- Sorry- Thou hast WHAT?! You broke- I mean- Thou were in MY ROOM?! What on earth...do you want with me?!Green:\n.........Judge:\nIt would seem... ...that both witnesses need to testify again.Shamspeare:\nUrrrgh...Green:\n.........Van Zieks:\nMiss Green...Green:\nYes?Van Zieks:\nWhilst you have the court's sympathy, I'm sure, for the suffering you have endured in recent events... ...anyone found to be giving false testimony in a court of law...will be duly punished. Please bear that in mind.Green:\n......... Yes...I know...Judge:\nVery well then, witnesses. You will give formal testimony again now... ...on the subject of this curious anomaly regarding the note Miss Green claims to have received!Witness Testimony\n- The Anomaly of the Note -Shamspeare:\nI do remember now. 'Twas a week ago, peradventure, that note was deliver'd unto me.\nOn the day writ therein, I did tarry a long hour at The Slug and Salad, yet nobody came.\nThereafter, on the evening I shared the company of the Japanese fellow, I did see the note had vanish'd.Green:\nI don't know what you mean. You think I snuck into this man's room, do you? Why would I?\nI can point out the villain here! And as for that torn-off piece of the envelope, I don't know anything about it.Judge:\nHmmm... You now claim to have received this letter, do you, Mr Shamspeare?Shamspeare:\nFaith, 'tis so, My Lord! And I would swear to have set it upon the table in my humble lodgings. Yet...'tis clear to me now that since I return'd from the tavern that night, I have not laid eyes upon it.Judge:\nHmmm... Well, that being the case... Young lady, it would appear that your testimony was-Green:\nA lie? Is that what you think? How unfair of you to think I'm the one lying!Judge:\nI beg your pardon?!Green:\nI'm just a fledgling artist, as I said, and fledgling artists don't lie. That note was delivered to me at my address! Besides... ...we all know who the liar around here is!Ryunosuke:\nIf that's true, Miss Green, how do you explain the facts? This part of the envelope was, without question, found in Mr Shamspeare's room.Green:\nI don't see why I should explain.Ryunosuke:\nSorry?Green:\nI'm a fledgling artist. My job here is just to say what happened, that's all. It's your job to give the explanations and the proofs. You, the fledgling lawyer.Ryunosuke:\n(The fledgling will do his best...)Van Zieks:\nEvidently, my learned friend's cross-examination is our only hope of learning the truth.Judge:\nWell, Counsel?Ryunosuke:\nI'm ready, My Lord!Judge:\nVery well then! The defence will now proceed with the cross-examination of the witnesses!Susato:\nMiss Green clearly did break into Mr Shamspeare's room. There can be no question of that. And that's how she acquired the note.Ryunosuke:\nYes. Two facts that are starting to lead me to a possible explanation for all of this... (And it's not a pretty one.)Cross-Examination\n- The Anomaly of the Note -",
      "testimonies": [
        {
          "testimony": "I do remember now. 'Twas a week ago, peradventure, that note was deliver'd unto me.",
          "person": "Shamspeare",
          "present": []
        },
        {
          "testimony": "On the day writ therein, I did tarry a long hour at The Slug and Salad, yet nobody came.",
          "person": "Shamspeare",
          "present": []
        },
        {
          "testimony": "Thereafter, on the evening I shared the company of the Japanese fellow, I did see the note had vanish'd.",
          "person": "Shamspeare",
          "present": []
        },
        {
          "testimony": "I don't know what you mean. You think I snuck into this man's room, do you? Why would I?",
          "person": "Green",
          "present": [
            "Bottle of Poison"
          ],
          "source": {
            "evidence_span": "A bottle found in the possession of Miss Green with traces of the slow-acting poison strychnine inside.",
            "testimony_span": "I don't know what you mean. You think I snuck into this man's room, do you? Why would I?",
            "explanation": "If Miss Green want to poison Mr. Shamspear with the exact poison strychnine, she has the reason to sneak into his room.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "I can point out the villain here! And as for that torn-off piece of the envelope, I don't know anything about it.",
          "person": "Green",
          "present": []
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Miss Green is testifying about she was not in Mr. Shamspeare's room and the torn-off piece of the envelope.",
      "labels": [
        "behavioral",
        "causal"
      ],
      "reasoning": [
        "Fact 1: The witness claims she has no reason to sneak into Mr. Shamspeare's room.",
        "Fact 2: The evidence suggests Miss Green has a bottle of poison with traces of the slow-acting poison strychnine inside.",
        "Fact 3: Mr. Shamspeare was poisoned with the slow-acting poison strychnine.",
        "Prop 1: If one holds the poison and she occurs near the victim's room, later the victim was poisoned, then she could have the reason to sneak into his room for poisoning."
      ]
    }
  ]
}