{
  "0":{
    "context": "Episode 4\nTurnabout Goodbyes\nIt's been, what, 15 years?\n\nAbout that, yes.\n\n15 years is a long time to wait...\n\nYou can't imagine how much I've suffered...\n\nYou... suffered?\n\nAnd now... the perfect opportunity presents itself.\n\nAt last... I shall have my revenge!\n\nWhat!?\n\n...Merry Christmas.\n\nDecember 25, 10:08 AM\nWright & Co. Law Offices\nMaya:\nHey, hey, Nick! Do you know if there's any good waterfalls around here?\n\nPhoenix:\nWaterfalls...? Dare I ask why?\n\nMaya:\nDuh, Nick! Isn't it obvious? I need a waterfall to stand under! Preferably a freezing one!\n\nPhoenix:\n... Oh... Is that part of your spirit medium training?\n\nMaya:\nOf course! Except, I've been slacking off lately... I need to brave the elements and be forged anew under the rushing spring waters!\n\nPhoenix:\nUmm... Okay... I don't know about any falls per se, but Gourd Lake is pretty close...\n\nMaya:\nOh. Darn.\n\nPhoenix:\nSorry, but them's the breaks. Couldn't you just take a cold shower or something?\n\nMaya:\n... Good idea!\n\nPhoenix:\n(So much for the rushing spring waters...)\n\nTV:\nNext in the news... A large, unidentified animal was sighted at Gourd Lake! The town is buzzing with excitement! Locals are calling it 'Gourdy' in a tip of the hat to Nessie, the Loch Ness monster. Though its namesake, Nessie, proved to be a hoax... locals are confident their Gourdy is the real deal. ...\n\nPhoenix:\n*yawn* Bor-ing. Can't they show real news for a change?\n\nMaya:\nNick?\n\nPhoenix:\n?\n\nMaya:\nThe water pressure's kind of low in that shower.\n\nPhoenix:\n... You want more pressure, huh? Why don't you go down to the fire department and have them spray you with the hose?\n\nMaya:\n... Good idea, Nick!\n\nPhoenix:\n(Apparently, E.S.P. is no aid in detecting sarcasm...)\n\nTV:\nWe interrupt this program to bring you a special news bulletin! Strange occurrences continue at Gourd Lake... But this time, it's murder!\n\nPhoenix:\n(Gourd Lake again?)\n\nTV:\nThe body of a man was found in the lake early this morning. A suspect was apprehended. Sources inside the police department revealed... that the suspect's name is Miles Edgeworth, age 24. Edgeworth was an up-and-coming prosecution attorney, known for his skill and connections. He was guaranteed a long and rewarding career... has he thrown it all away?\n\nPhoenix:\n(...? E-Edgeworth!?) What's going on!? Edgeworth would never do something like--\n\nMaya:\nNick?\n\nPhoenix:\nYipes! M-Maya!\n\nMaya:\nThe fireman yelled at me when I called him.\n\nPhoenix:\nWe've got bigger things to worry about than that! They arrested Edgeworth!\n\nMaya:\nWhat? You mean, the prosecutor?\n\nPhoenix:\nYeah, he's a suspect... in a murder!\n\nMaya:\nWhaaaaat!? When? Where? Whom? Why? How?\n\nPhoenix:\nI-I don't know!\n\nMaya:\nLet's go find out, Nick!\n\nExamine Bookshelf\n\nPhoenix:\nDifficult-looking legal books stand in a formidable row. They mock me. I tried reading one, and it made my head hurt. When I closed it, it slipped out of my hand. Then my foot hurt too.\n\nExamine Charley the plant\n\nPhoenix:\nMia's favorite plant. Its name is 'Charley.' Maya's gotten the knack of watering it lately. Charley's been perking up these days.\n\nExamine Mia's desk\n\nPhoenix:\nMia's desk. If we had more clients, I would probably sit here more often. Lately, I've been spending more time on the couch, watching TV.\n\nExamine Movie poster\n\nPhoenix:\nMaya brought in a poster of the Steel Samurai the other day. We had a big fight over whether to put it up or not. I know she's just waiting for a chance to sneak it up on the wall.\n\nExamine Window\n\nPhoenix:\nLooks like it's cleaning day again at the hotel across the way. I hear they're planning a second branch outside the city. I can see the bellboy, getting the angle of that screwdriver in the drawer just right.\n\nPhoenix:\nWell, what should we do?\n\nMaya:\nWhat do you mean!? Let's investigate! We should talk to Mr. Edgeworth, and check out the crime scene!\n\nPhoenix:\n(You're right... We need more information! Save aimlessness and confusion for later!)\n\nPhoenix:\nWell? Got any good ideas?\n\nMaya:\nNot really. I do my best thinking when I'm standing underneath a waterfall.\n\nPresent Attorney's Badge\n\nPhoenix:\nYou know, I think it's developing a nice luster.\n\nMaya:\nI'll look at your badge later, Nick. We've got work to do!\n\nPhoenix:\n(I suppose you're right...)\n\nDecember 25\nDetention Center\nVisitor's Room\nMaya:\nYou know, Nick... We've all been in here one time or another, haven't we?\n\nPhoenix:\nI guess it comes with the territory.\n\nMaya:\nI'm not sure it's something we should mention to too many people... Aah!\n\nPhoenix:\n... Hey! Edgeworth! Come back!\n\nEdgeworth:\nWhat are you doing here!?\n\nMaya:\nNick, I don't think he's in a very good mood.\n\nPhoenix:\nWell, he is in detention. Were you in a good mood when you were here?\n\nEdgeworth:\nSo, you've come to laugh at the fallen attorney? Then laugh, laugh! Well? Why aren't you laughing?\n\nMaya:\nNick... Should we be laughing?\n\nPhoenix:\nNah. It's a trick. Laugh and he'll get mad... or burst into tears. Edgeworth. We don't have so much free time we can spend it coming down here to laugh at you.\n\nEdgeworth:\n... Yes you do.\n\nPhoenix:\n(Actually, he's right.)\n\nEdgeworth:\n... I hoped you wouldn't come. I didn't want you to see me. Not like this.\n\nPhoenix:\n(Hey, I didn't want to see you either, believe me.)\n\nExamine Surveillance camera\n\nPhoenix:\nSmile for the camera...\n\nExamine Security guard\n\nPhoenix:\nThis guard monitors the visitor's room. He hasn't moved an inch since I came in. A real pro. Or maybe he's just nervous with Edgeworth in the room.\n\nPhoenix:\nEdgeworth. Tell me what happened.\n\nEdgeworth:\n... Why should I? What are you going to do about it?\n\nMaya:\nDuh! We're going to help you, that's what!\n\nEdgeworth:\n...! ... Help me? You? Don't be ridiculous.\n\nPhoenix:\nSorry...?\n\nEdgeworth:\nYou're a novice! You've only been in three trials!\n\nPhoenix:\nH-hey!\n\nEdgeworth:\nSure, you got lucky and won all three... But your luck's bound to run out some day! You need real skill, Wright. Experience!\n\nPhoenix:\n...\n\nMaya:\nNick! He's insulting you! Nick? Why am I always the one who has to get angry!?\n\nPhoenix:\nThe murder took place at Gourd Lake, correct?\n\nEdgeworth:\nYes... late last night.\n\nPhoenix:\nThe lake is a long way away from your offices and the court... Why were you down there?\n\nEdgeworth:\n... I see no need to tell you.\n\nMaya:\nM-Mr. Edgeworth! You... you didn't really...?\n\nEdgeworth:\n... Gourdy.\n\nMaya:\nHuh?\n\nEdgeworth:\nI went to see Gourdy.\n\nMaya:\n'Gourdy'? What's that!?\n\nPhoenix:\nI'll... tell you later. (Why won't Edgeworth talk to us?)\n\nEdgeworth:\nYour attorney's badge...?\n\nPhoenix:\nEdgeworth. Let me defend you.\n\nEdgeworth:\n... Hah! Hah hah! Good one, Wright. But I'm not that hard up. Not yet.\n\nMaya:\nWh-what do you mean by that?\n\nEdgeworth:\nMe? Trust a wet-behind-the-ears lawyer with only three trials under his belt? Never!\n\nMaya:\nWh-what!?\n\nEdgeworth:\nMy case is near hopeless, Wright. Every defense attorney I've talked to has turned me down.\n\nPhoenix:\nWhat?\n\nEdgeworth:\nSimply put, they were afraid they'd lose. It occurred to me that it might be my fault that they lack confidence. After all, I did get every single one of their clients declared 'guilty.'\n\nPhoenix:\nI don't believe it!\n\nEdgeworth:\nRegardless, I don't want you involved in this. You in particular I cannot ask to do this.\n\nPhoenix:\nEdgeworth... this is really hard for me to ask... But... you didn't do it, right? Right?\n\nEdgeworth:\n... Think what you will. I have only one request.\n\nPhoenix:\nHuh?\n\nEdgeworth:\nStay out of this case.\n\nMaya:\nWhy!? B-but Nick is trying to help you!\n\nEdgeworth:\nI know...! I know that! But I don't want your help, okay?\n\nMaya:\n!!! Why not?\n\nEdgeworth:\n... Look, just go away, and leave me alone!\n\nMaya:\nNick... Mr. Edgeworth did it, didn't he.\n\nPhoenix:\nMaya! Let's go investigate elsewhere.\n\nMaya:\nBut, Nick...\n\nExamine Security guard\n\nPhoenix:\nThis guard monitors the visitor's room. He hasn't moved an inch since I came in. A real pro. Or maybe he's just nervous with Edgeworth in the room.\n\nDecember 25\nGourd Lake Park\nEntrance\nMaya:\nThis is where it happened?\n\nPhoenix:\nYeah. Gourd Lake is in the middle of this park.\n\nMaya:\nI can see some police walking around in there.\n\nPhoenix:\nQuestioning people, probably.\n\nMaya:\nHey! Isn't that Detective Gumshoe over there?\n\nGumshoe:\nWell, pal!? There's enough of us here! Anyone found anything?\n\nPolice:\nS-sorry, sir... Nothing.\n\nGumshoe:\nIdiot! The trial's tomorrow! We need clues, on the double!\n\nPolice:\nB-but, sir... There weren't any clues... that's why we arrested that attorney, Mr. Edgeworth! It's clear, sir. He's the one who--\n\nGumshoe:\nShaddup! Just you try saying that again! I'll... er... I'll make you sorry if you do! I mean... just, get outta my face, pal!\n\nPolice:\nY-yes, sir!\n\nMaya:\nDetective Gumshoe's kinda scary today!\n\nGumshoe:\nRecruits... peh! ... Aah!\n\nMaya:\nEek!\n\nGumshoe:\nHey, you're that Harry guy! Harry Butz!\n\nPhoenix:\nWright! Phoenix Wright! (Will he ever learn my name!?)\n\nGumshoe:\nAnd just what are you doing here, pal? Investigating!?\n\nPhoenix:\nHuh? Um, well, yes. I suppose.\n\nGumshoe:\nWell, I'm here to help! Ask me anything you want! Bring it!\n\nMaya:\nHe seems different than usual. I wonder what's up? Umm... Mr. Edgeworth hasn't actually asked us to defend him yet...\n\nGumshoe:\nHuh!? Oh? Y-you don't say...\n\nExamine Trees\n\nPhoenix:\nI feel winter's chill from the bare leaf trees today... *sigh* What is it about winter that turns people into poets?\n\nMaya:\nI don't know, but my toes are starting to feel numb.\n\nPhoenix:\n(Yes... my poetry has that effect on some people.)\n\nExamine Sign\n\nPhoenix:\nThe sign says 'Gourd Lake Nature Park.' This place is full of families picnicking on the weekend.\n\nMaya:\nBut... no waterfall.\n\nPhoenix:\nNot many picnickers come here for spiritual training, Maya.\n\nPhoenix:\nDetective Gumshoe? Do you know what happened here?\n\nGumshoe:\nHuh? You don't know, pal?\n\nPhoenix:\nNo...\n\nGumshoe:\nWow, okay, Mr. head-in-the-fluffy-pink-clouds Lawyer.\n\nPhoenix:\nHead-in-the... huh?\n\nGumshoe:\nNever mind, I'll tell you. It happened last night, about 15 minutes after midnight. There was a boat out on Gourd Lake. In that boat were two men. One of those men shot the other with a pistol.\n\nMaya:\nAnd... the shooter was Mr. Edgeworth?\n\nGumshoe:\nA cop who arrived on the scene arrested him.\n\nMaya:\nHow did he get there so fast?\n\nGumshoe:\nWell... There was a witness. When the report came in, we raced to the lake.\n\nPhoenix:\nA witness?\n\nMaya:\nYou don't think Mr. Edgeworth is a... murderer!?\n\nGumshoe:\nAbsolutely not! It's impossible! I don't care if there's a witness either! I don't believe a lick of it!\n\nMaya:\nR-right! Who cares what the witness says!\n\nPhoenix:\n(I care!)\n\nMaya:\n... You really believe in him, don't you, Detective?\n\nGumshoe:\nCourse I do! But... the police are pretty sure he's the killer. Nobody's even really taking this investigation that seriously.\n\nMaya:\nOh no!\n\nGumshoe:\nAfter all the help Mr. Edgeworth has been to us... Hard to imagine that no one's standing up to take his side.\n\nMaya:\nWell, at least you are, Detective. At least you are.\n\nMaya:\nDo you know who will be Mr. Edgeworth's defense attorney in tomorrow's trial?\n\nGumshoe:\nHe hasn't got one yet.\n\nMaya:\nWhat? The trial IS tomorrow, isn't it?\n\nGumshoe:\nWell, I don't know the whole story... But apparently no one he's been talking to will take his case.\n\nMaya:\nW-why not?\n\nGumshoe:\nMr. Edgeworth won't tell me! When you guys showed up, I figured he'd asked you to defend him.\n\nPhoenix:\nU-unfortunately not...\n\nGumshoe:\nWell, pal, then you got a job to do! Help out Mr. Edgeworth! Prove that badge you wear isn't just some fancy piece of metal! Prove it to me, pal! Show me you're an attorney!\n\nMaya:\nI-is it true? No one will take Mr. Edgeworth's case?\n\nGumshoe:\nYeah... He's a bit of a celebrity. If you defended him, and lost, your reputation'd be sure to suffer. What's more... The case against him is... well, it's pretty solid.\n\nPhoenix:\n(I suppose it would be if they have a witness.)\n\nGumshoe:\nHey! Pal! Don't tell me your going to turn your back on him too!? Remember the Steel Samurai! Mr. Edgeworth helped you get your client declared innocent!\n\nPhoenix:\nI... I know. I went to Edgeworth. I tried. He really doesn't want us to represent him. Especially not us, he said.\n\nGumshoe:\nWhat!? W-well, that doesn't make any sense, pal! You should have heard him talking about you after the Steel Samurai case! He kept saying 'Wright, Wright, Wright' over and over.\n\nMaya:\n... Nick? I'm not sure that's a good sign.\n\nPhoenix:\nNeither am I...\n\nGumshoe:\nWhy wouldn't he want your help? I don't get it.\n\n	\nPhoenix:\nWho was this witness?\n\nGumshoe:\nEr, sorry, pal. That's confidential. Anyway, the witness saw everything, apparently. I'm sure they'll turn up at the trial tomorrow.\n\nPhoenix:\nWas there only that one witness?\n\nGumshoe:\nYep. It was pretty cold out on the lake last night. And, it was Christmas Eve after all. Still, we're being thorough. You never know when you're going to turn up another witness. That's why we're here today, checking things out. So far, we're coming up empty...\n\nMaya:\nOh! It's Christmas today! I'd forgotten. What are you getting me for Christmas, Nick?\n\nPhoenix:\nTalk to Santa.\n\nPresent Attorney's Badge\n\nGumshoe:\nThat badge! You're showing that to the wrong guy, pal! You gotta show that to someone who needs it!\n\nPolice:\nDetective Gumshoe, sir!\n\nGumshoe:\nWhat? Find something!?\n\nPolice:\nUm, no, sir. Not yet. But there was a call from the precinct. They want to hold an investigation briefing...\n\nGumshoe:\nA briefing? Right! I'm off! Oh... Sorry, pal. I guess you heard. I gotta go. Any last things you want to ask me about before I head back?\n\nPolice:\nDetective Gumshoe, sir!\n\nGumshoe:\nWhat? Find something!?\n\nPolice:\nUm, no, sir. Not yet. But there was a call from the precinct. They want to hold an investigation briefing...\n\nGumshoe:\nA briefing? Right! I'm off! Oh... Sorry, pal. I guess you heard. I gotta go. Any last things you want to ask me about before I head back?\n\nMaya:\nWell, yes. Do you have any information on the victim...?\n\nGumshoe:\nSorry... They haven't worked up the autopsy report yet. I'm still waiting for it myself. Actually... Say, if you get the time, drop by the precinct! We can talk more there, pal!\n\nPhoenix:\nYou're not coming back, Detective?\n\nGumshoe:\nErm... Probably not, pal.\n\nPhoenix:\nSo, what should we do if we have something to talk to you about...?\n\nGumshoe:\nAh, right. Here, I'll show you how to get to the precinct. Come down and see me anytime.\n\nDetective Gumshoe gave you directions to the police station.\n\nPhoenix:\nOh, hey! Detective Gumshoe!\n\nGumshoe:\nW-what!?\n\nPhoenix:\nUm, we'd like to take a look around in the park. Can we walk around?\n\nGumshoe:\nYeah! No problem, pal. You got my permission.\n\nMaya:\nYou know, Nick. I think there's something to be said for talking to people when they're busy.\n\nPhoenix:\nYeah. They don't have time to think about not giving you information...\n\nMaya:\nRight! Now, let's get investigating!\n\nMaya:\n... Looks like Detective Gumshoe isn't here.\n\nChief:\nSomething wrong, miss? Hmm? Turning yourself in? Okay, what did you do? Shoplifting? Larceny? Public indecency...?\n\nMaya:\nN-no! None of those things! We're looking for Detective Gumshoe... is he around?\n\nChief:\nGumshoe? Oh yeah. He's in a meeting right now. I don't think he'll be out any time soon.\n\nMaya:\nOkay, we'll come back.\n\nChief:\nYou do that. Oh, and go straight home and stay out of trouble. No more shoplifting, you got that?\n\nMaya:\n... Do I look like a criminal or something?\n\nExamine Poster\n\nPhoenix:\nA poster of a female police officer... Wait, no. That's the latest 'Babes in Uniform' calendar. My bad.\n\nExamine Detective\n\nPhoenix:\nThat must be one of the detectives. He's mumbling something to himself.\n\nPolice:\n'...your mama could see you know she'd be crying'... ...a break and spit it out, you lowlife scumbag...'\n\nPhoenix:\n... He must be doing image training for interrogations.\n\nExamine Desk\n\nPhoenix:\nThese are the detectives' desks. There are computers and files on each one. Funny, they're a lot tidier than I'd expect. I guess the detectives don't spend a lot of time at their desks.\n\nExamine Blue Badger\n\nPhoenix:\nHey, is that the police department's mascot...?\n\nChief:\nThat's the 'Blue Badger'! It was my idea! I made it! It's my mascot!\n\nPhoenix:\nI... see. How nice.\n\nChief:\nI'll get him assigned mascot of the Criminal Affairs Dept. if it's the last thing I do!\n\nPhoenix:\nUm, good luck!\n\nExamine Chief\n\nPhoenix:\nThis must be the chief of the detectives here. He's glued to his computer screen.\n\nChief:\nWha...!? 'Gourd Lake...!' 'Gourdy sighted'!!! I don't believe it!\n\nPhoenix:\n(Shouldn't you be reading something more important...?)\n\nDecember 25\nGourd Lake\nPublic Beach\nMaya:\nWowsers! This is 'Gourd Lake'?\n\nPhoenix:\nYup. I'm not sure it warrants a 'wowsers,' though.\n\nMaya:\nHmm. Probably not. But hey, look at that snack stand!\n\nPhoenix:\n'Samurai Dogs'...?\n\nMaya:\nI wanna Samurai Dog! Please! I bet they're great!\n\nPhoenix:\nWith a name like Samurai Dog, how could they not be?\n\nMaya:\nThey're a little behind the times, though. The kids are all into 'The Pink Princess' now. I mean, like, y'know!?\n\nPhoenix:\n(Nope.)\n\nExamine Lake\n\nMaya:\nWow. Gourd Lake is really big.\n\nPhoenix:\nYeah.\n\nMaya:\nSay, Nick. Why is it called 'Gourd Lake'?\n\nPhoenix:\nOh. Well, a long time ago, they used to grow gourds here.\n\nMaya:\nWhoa! No way! I was sure it was because the lake looked like a gourd when viewed from above! You know, like an hourglass shape?\n\nPhoenix:\nWell, it is shaped like a gourd, actually. But that's just a coincidence.\n\nMaya:\nOh. Okay.\n\nExamine Trash\n\nPhoenix:\nThe trashcan is empty. At least the place is well maintained.\n\nExamine Bench\n\nPhoenix:\nA lineup of plastic benches. I guess the idea is you buy a dog and eat it here. I doubt anyone would sit here and eat on a day like this. Except maybe Maya... if she had a Samurai Dog.\n\nExamine Sign\n\nPhoenix:\nHuh... I almost didn't see that signpost. 'Left - Boat docks' 'Right - Exit'\n\nExamine Stand\n\nPhoenix:\nA hotdog stand. It's closed... The Christmas fringe looks a little half-baked. The banner reads 'Samurai Dogs'... Somebody needs to redecorate.\n\nExamine Popper\n\nMaya:\nHuh. Someone left one of those poppers here. You know, you pull the string...\n\nPhoenix:\n...and it goes 'pop.' Yeah, I know the ones. You see them a lot around New Year's.\n\nMaya:\nHey, Nick! It might be a clue! Let's take it.\n\nPhoenix:\nC'mon, admit it. You just want to pop it, right?\n\nMaya:\nWas it that obvious?\n\nPhoenix:\n(A popper... hmm.)\n\n'I suppose it couldn't hurt. Huh? Where'd it go?'\n\nPhoenix:\nNah, let's leave it.\n\nMaya:\nAww, listen to your inner child a little, Nick!\n\nPhoenix:\n(Maybe if you outer child would be quiet for just a moment, Maya!)\n\nPhoenix:\nI suppose it couldn't hurt. Huh? Where'd it go?\n\nMaya:\nI already put it in my pocket.\n\nPopper put in pocket.\n\nWright & Co. Law Offices\n\nPresent Anything else\n\nMaya:\nNick! If we don't hurry Mr. Edgeworth will get the death sentence!!!\n\nPhoenix:\nWhoa! O-okay! Let's go check things out.\n\nDetention Center\n\nPresent Anything else\n\nEdgeworth:\nWhat's that? I'm not in the mood for idle banter, Wright.\n\nDecember 25\nBoat Rental Shop\nMaya:\nNick... what is this place?\n\nPhoenix:\nA boat rental shop. Closed for Christmas it seems. I guess a murder taking place on one of the boats won't be good for business, either.\n\nMaya:\nBoats... I've never ridden on a boat.\n\nPhoenix:\nReally? Well, how about we go out on one when the trial is finished?\n\nMaya:\nHey, good idea! You bet!\n\nExamine Trees\n\nPhoenix:\nThere's more forest off that way. I doubt I'd find any helpful clues in there.\n\nExamine Shop\n\nPhoenix:\nA small boat rental shop. Doesn't look like anyone is around. They're probably closed because it's Christmas.\n\nExamine Boats\n\nPhoenix:\nThere are some boats floating at the dock. Was one of these boats used in the murder, I wonder?\n\nMaya:\nNick?\n\nPhoenix:\nHuh?\n\nMaya:\nI changed my mind. I don't really want to go for a boat ride.\n\nDecember 25\nGourd Lake Woods\nMaya:\nI like it here, Nick. Look... someone's camping!\n\nPhoenix:\nThey've got guts, camping at the scene of a murder.\n\nMaya:\nHey, hey, Nick! If they were camping here last night, they might know about the murder!\n\nPhoenix:\n(That's true...) Good call, Maya. Let's go talk to them.\n\nExamine Camera\n\nMaya:\nHey, Nick. Check out this camera!\n\nPhoenix:\nYeah... what's with the big mic and that box on top, I wonder? It looks like some sort of automatic system for taking a photo when a noise is heard.\n\nMaya:\nWow! Hey, let's see if it works! *cough* 'Hi, I'm Nick!' ... Maybe I'm not saying it loud enough. 'YO! I'M NICK!!!' ... Huh. NIIIIIIIIII......IIIIIIIIIICK!\n\nPhoenix:\nWill you stop that?\n\nMaya:\nI think it's broken, Nick.\n\nPhoenix:\nD-don't kick it! (It must not be set up to respond to voices.)\n\nExamine Camera (after obtaining Popper)\n\nLeads to:\n'This camera has a mic and some sort of attachment.'\n\nExamine Trees\n\nPhoenix:\nThe trees grow quite thick here. Further back, the trees fade into the shadow where the sunlight can't reach them.\n\nExamine Trees\n\nPhoenix:\nThe trees grow quite thick here. Further back, the trees fade into the shadow where the sunlight can't reach them.\n\nExamine Sign\n\nPhoenix:\nThe sign says 'No Camping.' Funny place to pick to pitch your tent.\n\nMaya:\nWait, what if the sign said 'No Setting Tents on Fire'?\n\nPhoenix:\n... I don't think they have signs like that.\n\nMaya:\nOh...\n\nExamine Sheet\n\nPhoenix:\nThere's food and some magazines on the sheet. It takes a pretty tough skin to camp in this cold.\n\nExamine Campfire\n\nMaya:\nHey, Nick!\n\nPhoenix:\nWhat, don't tell me you're hungry again?\n\nMaya:\nNo, no. I was just wondering, why are camping pots and pans made of aluminum?\n\nPhoenix:\n... They didn't talk about that in any of the law books.\n\nMaya:\nSo, there's no law saying they have to be made out of aluminum, then!\n\nPhoenix:\n(I'm not having this conversation...)\n\nExamine SUV\n\nPhoenix:\nThis SUV has seen better days. It's dented all over. I can't believe anyone would drive their car down here.\n\nPhoenix:\nThis camera has a mic and some sort of attachment. It must take pictures when triggered by a noise.\n\nMaya:\nWow! Cool! Let's try it out! *cough* 'Hi, I'm Nick!' ... Maybe I'm not saying it loud enough. 'HEY! I'M NICK!!!' ... Huh. NIIIIIIIIII......IIIIIIIIIICK!\n\nPhoenix:\nWill you stop that?\n\nMaya:\nMaybe it's broken?\n\nPhoenix:\nD-don't kick it! Maybe it isn't set up to respond to voices?\n\nMaya:\nWell what then? I know!\n\nPhoenix:\nThe party popper...?\n\n*BANG*\nklik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik\n\nMaya:\n... Yep. It responded.\n\n???:\nYaaaaaaaaaaaaaaw! Hey, you! Git yer hands offa' that!\n\nMaya:\nEek!\n\n???:\nWhat in the Sam Hill...!? Look what ya done now! There goes a whole roll of film!\n\nMaya:\nAh? Wha... huh? S-sorry!\n\n???:\nSorry's nice but it don't pay my bills! Y'all know how much a roll of film costs!?\n\nMaya:\nI-I'll pay you back!\n\n???:\nWhat were ya'll thinkin' settin' off a party-popper in a place like this?\n\nMaya:\nUh... well...\n\n???:\nWhat! Don't try to play stupid with me just 'cause you think I'm some country bumpkin! Yeah, I know how y'all Yanks think! 'I say, those southern folks talk with that exaggerated drawl, why they must be dumb!' Well let me tell you, just because I might be dumb don't mean we all are!\n\nMaya:\nN-Nick, help!\n\n???:\nAnd who are you, now? Her chaperone?\n\nPhoenix:\nYeah, uh, no, rather, uhh... we're sort of... friends?\n\n???:\nJus' figure out what y'all are gonna say and say it for bejeezum's sake! Gawd, I'd rather sit through one of papa's drawls than listen to you stutter all day.\n\nPhoenix:\n(Oh boy... I guess we should pay her for the film...)\n\n???:\nWatch it!\n\nPhoenix:\nYes ma'am. (On second thought, I'll pay later...)\n\nMaya:\nI'm really sorry!\n\nExamine Camera\n\nPhoenix:\nThis camera is rigged to respond to noise. But it only responds to loud noises... like a party popper.\n\nPhoenix:\nUmmm...\n\n???:\nWhat!? Can't ya see I'm changin' the film on my camera here! Someone--I'm not namin' any names--but someone used up a WHOLE ROLL.\n\nMaya:\nSorry...\n\nPhoenix:\n(That didn't work... I wonder if I have anything to show her that would get her attention...)\n\nPresent Attorney's Badge\n\nPhoenix:\nI, er, this is my badge.\n\n???:\nHuh? Aren't badges supposed t' be all shiny and impressive? You a cop or something?\n\nPhoenix:\nUmm... I'm a lawyer.\n\n???:\nWh-what!? Y'all ain't gonna try and pull one o' them lawsuits on me over that film now? Cause I'll have you know I'm a fighter and I wrassled meaner looking' things'n you!\n\nPhoenix:\nN-no, that's not it at all. We're here investigating a murder that took place here, on the lake.\n\n???:\nA murder...? ... Sounds cool! Why didn't y'all say that in the first place! Go ahead, ask me anything ya like!\n\nPhoenix:\n(Finally! Some cooperation!)\n\n???:\nYou too. Y'all can come out of hiding now. I won't bite. Hard.\n\nPhoenix:\n(Come to think of it, where did Maya get to?)\n\nMaya:\nS-sorry... I-I was feeling a little overwhelmed. The culture gap and all...\n\n???:\nNever you mind, honey. I kin' talk Yank for ya if... ahem... if it pleases you?\n\nMaya:\nTh-thanks. I think I'll be okay.\n\nLotta:\nGreat then! I'm Lotta, Lotta Hart, but y'all can call me Lotta! I'm here photographing meteor showers for a research project. Mighty pleased ta meet ya!\n\n	\nLotta:\nOh yeah, when was that murder, anyway? I ain't seen much television lately.\n\nPhoenix:\nIt happened late in the night on Christmas Eve.\n\nLotta:\nThat so? Christmas Eve?\n\nPhoenix:\nA man on a boat was shot... Did you see anything?\n\nLotta:\nWell, lemme see. A boat, ya say? I reckon I mighta seen one... not sure though. Y'all gotta remember I've been watching this here lake for a good three days now. I seen enough boats to choke a mule. Kinda hard to remember which I seen when.\n\nLotta\n\nMaya:\nSo, what is it you do, Lotta?\n\nLotta:\nHuh? Me? Hah hah. Y'all don't really want to know that, do ya? Actually, I'm a research student at Country U., right in the heart of the heartland.\n\nMaya:\nWow! Neat! Nick! She's a research student at a university! Country U.!\n\nPhoenix:\nUh... so I hear.\n\nMaya:\nSo, when did you come up here?\n\nLotta:\nHmm, lemme see... I guess it was 'bout three days ago.\n\nPhoenix:\nWhat are you photographing?\n\nLotta:\nD-didn't I tell y'all that already? Meteors! Yep, meteor showers!\n\nPhoenix:\n(Falling stars...?)\n\nThe camera (appears after What happened)\n\nMaya:\nThat's quite a camera you have there.\n\nLotta:\nY'all better know it! It's German-made. A genuine Solingen!\n\nPhoenix:\n(Isn't that where they make knives...?)\n\nMaya:\nUmm... So, what's that device you have stuck to the camera?\n\nLotta:\nHuh? Device?\n\nMaya:\nIt started moving all by itself when I fired my party popper...\n\nLotta:\nOh that? That triggers the shutter whenever it detects certain sounds. It's programmed to pick up loud noises right now.\n\nMaya:\nA programmable camera! Neat!\n\nLotta's Camera added to the Court Record.\n\nPresent Attorney's Badge\n\nLotta:\nSo yer a lawyer, huh? Tell the truth, yer badge is a lot more impressive than you are.\n\nMaya:\nHah hah!\n\nPhoenix:\n*glare*\n\nMaya:\nHah... hah... oh. Ahem.\n\nPresent Lotta's Camera\n\nPhoenix:\nLotta?\n\nLotta:\nYeah?\n\nPhoenix:\nSo, your camera... it triggers on loud explosion noises?\n\nLotta:\nAyup.\n\nPhoenix:\nActually, the victim in the case we're researching--he was shot with a pistol.\n\nLotta:\nA pistol...?\n\nPhoenix:\nRight. Now wouldn't a gunshot make a similar noise to our party popper...?\n\nLotta:\nI guess it would.\n\nPhoenix:\nYour camera... didn't get a picture of the murder, did it?\n\nLotta:\n... Hey! Y'all are pretty bright!\n\nPhoenix:\nHuh?\n\nLotta:\nI see what yer sayin'... Tell ya what, I'll have a look-see at my film.\n\nPhoenix:\nIt would have been a photo taken late last night...\n\nLotta:\nI checked 'em once, don't remember if there was anything on 'em though. But what if I got sumtin'! I could be witness to a genuine murder! Yeehaw! I'll go check that film. Y'all come back now, y'hear?\n\nMaya:\nShe went inside her SUV. I guess we should come back later...\n\nWright & Co. Law Offices\n\nPresent Lotta's Camera\n\nMaya:\nWho was that with the camrea...? Lotta something? Let's go talk to her about that photograph!\n\nDecember 25\nPolice Department\nCriminal Affairs\nMaya:\n... I guess Detective Gumshoe is still in that meeting.\n\nGumshoe:\nHey! Thanks for coming down, pal!\n\nMaya:\nDetective Gumshoe!\n\nGumshoe:\nWe just finished the meeting. For better or for worse...\n\nPhoenix:\n(I get the feeling we're in for some bad news...)\n\nExamine Detective\n\nPhoenix:\nThat must be one of the detectives. He's mumbling something to himself.\n\nPolice:\n'All right, hands against the wall, all o' you... Don't even think about escaping! I got eyes in the back of my head!'\n\nPhoenix:\n... He must be doing image training for arrests.\n\nAbout The victim\n\nPhoenix:\nDo you know anything about the victim yet?\n\nGumshoe:\nNo, no... Still can't I.D. him.\n\nMaya:\nHas Mr. Edgeworth said anything?\n\nGumshoe:\nNot a word.\n\nAbout The meeting\n\nPhoenix:\nSo, how did the meeting go?\n\nGumshoe:\nI can't tell you, pal! You're a lawyer!\n\nPhoenix:\nT-true...\n\nGumshoe:\n... Y'know... I don't know what to believe anymore. Sure, Mr. Edgeworth's human like you or me. Still... I get the feeling that if he'd done something wrong, he wouldn't go hiding it. That's just the kind of guy he is. Why can't anyone else see that?\n\nMaya:\nSo, they think that Mr. Edgeworth did it...?\n\nGumshoe:\nWell, the trial's starting tomorrow, as scheduled.\n\nMaya:\nI see...\n\nGumshoe:\n...\n\nPhoenix:\nUmm... hey, in the end you did tell us about the meeting!\n\nGumshoe:\n... Don't go telling anyone else, pal.\n\nPhoenix:\nY-yes, sir!\n\nGumshoe:\nAnd... do me a favor! Stand by Mr. Edgeworth! He needs help, and you're the ones to help him! I'm sure he's got some reason why he won't talk to us.\n\nMaya:\nThanks, Detective Gumshoe.\n\nAbout Trusting Edgeworth\n\nMaya:\nDetective Gumshoe... How come you trust Mr. Edgeworth so much?\n\nGumshoe:\nWell, I'd think that was obvious. We got a strong working relationship, us two. We trust each other, and that's how it works.\n\nMaya:\nA 'working relationship'?\n\nGumshoe:\nSee, Mr. Edgeworth always gets his defendants declared 'guilty' every time. Yeah, his methods right be a little extreme at times. But... there's a reason! He trusts our investigation, see? He trusts us to get the right man! That's why I work extra hard, pal. We've got to earn that trust he places in us.\n\nMaya:\nI see...\n\nGumshoe:\nMr. Edgeworth is a man you can trust... And you have my word on that!\n\nAbout The autopsy report\n\nPhoenix:\nI was wondering, did you ever get that autopsy report?\n\nGumshoe:\nOh, that? Yeah, I made a copy for you.\n\nAdded Autopsy Report to the Court Record.\n\nPhoenix:\nThank you.\n\nMaya:\n...Nick?\n\nPhoenix:\nHuh?\n\nMaya:\nCan you show me that photo of the victim? ... That face...!\n\nPhoenix:\nSomeone you know?\n\nMaya:\nI... I don't know. I just have this feeling that I met him somewhere a long time ago. ...\n\nThe autopsy report (subsequent times)\n\nMaya:\n...\n\nPhoenix:\n(Maya seems lost in thought.) You remember anything?\n\nMaya:\n...\n\nPhoenix:\n(Guess not.)\n\nPresent Autopsy Report\n\nGumshoe:\nWell, I hope it helps you, pal.\n\nPhoenix:\nThanks, Detective.\n\nPresent Anything else\n\nGumshoe:\nSorry, I'm drawing a blank right now.\n\nWright & Co. Law Offices\n\nMaya:\n...\n\nPhoenix:\nWhat is it?\n\nMaya:\nOh. Nothing... just, something's been bothering me. ... Could you show me that autopsy report once more? ... ... ... Hey! I-I remember now! This guy! This is a lawyer that was at that office Mia worked at! I met him once when I went there to hang out with Sis!\n\nPhoenix:\nThat office...? Wait! You mean Grossberg's office?\n\nMaya:\nRight! That guy!\n\nPhoenix:\n(That was the last name I expected to come up... Maybe I should go talk to him... for old time's sake.)\n\nAbout What to do\n\nPhoenix:\nWell, what should we do?\n\nMaya:\nHmm... The police have pretty much made up their minds that Mr. Edgeworth did it. And Mr. Edgeworth won't tell us anything. I guess we could go look for clues down by the lake?\n\nPhoenix:\nRight.\n\nAbout  Any ideas\n\nPhoenix:\nWell? Penny for your thoughts?\n\nMaya:\nThoughts... Thoughts... Yeah, why won't Mr. Edgeworth tell us anything? And... and... And why did he refuse to ask for our help? What a jerk!\n\nPresent Autopsy Report\n\nMaya:\nNick... This person was a lawyer at Grossberg's office. Let's go talk to him! Mr. Grossberg, I mean, not the dead guy.\n\nDecember 25\nGrossberg Law Offices\nPhoenix:\nIt's been a while since I was here last. Mr. Grossberg is out as usual.\n\nMaya:\nHey, Nick. Look at the wall.\n\nPhoenix:\n(That painting is still missing... Mia must have known about the deal with Mr. Grossberg and Redd White... She kept track of all of White's extortion and blackmail rackets.)\n\nExamine Bookshelf\n\nPhoenix:\nExpensive-looking mahogany bookshelves, filled with expensive-looking books. Hmm... funny... they don't look like they've ever been read.\n\nMaya:\nWell then let's take them back to our office! He won't miss them!\n\nPhoenix:\nUh, we don't need them.\n\nMaya:\nThen, can we take that wooden bear?\n\nPhoenix:\n(Hmm. It is kind of cute.)\n\nExamine Desk\n\nPhoenix:\nA solid mahogany desk. The wood's been polished to a deep luster.\n\nMaya:\nHey, Nick! I want a desk like that in our office too!\n\nPhoenix:\nI don't know. I don't think I'm ready to sit at a desk like that yet.\n\nMaya:\nHuh? I meant for me!\n\nPhoenix:\nYou'd better start saving your allowance, then.\n\nExamine Vacant wall\n\nMaya:\nWhy is the wall there a different color?\n\nPhoenix:\nA big painting was hanging there until recently.\n\nMaya:\nHuh. What happened to it?\n\nPhoenix:\nUh... well, he gave it to someone.\n\nMaya:\nI bet he gave it to some romantic interest! Love blooms eternal, Nick!\n\nPhoenix:\nUh... yeah.\n\nExamine Potted plant\n\nPhoenix:\nAn expensive potted plant. No idea what kind of plant it is, but it's probably the most expensive one available.\n\nMaya:\nI think our Charley is cuter.\n\nPhoenix:\nRight. He's a really cute... plant.\n\nExamine Table\n\nPhoenix:\nA table for clients. Hmm... an elegant ebony case, and if I'm not mistaken, that lighter's made of solid gold. Even I can tell someone here's got money to burn.\n\nMaya:\nWe should put things on our client table too.\n\nPhoenix:\nI'm not really into smoking.\n\nMaya:\nWe could put out candy, or gum.\n\nPhoenix:\nClassy...\n\nDetention Center\n\nPresent Autopsy Report\n\nEdgeworth:\n... I'm sorry. I can't think of anything I want to say about that.\n\nDecember 25\nGourd Lake Woods\nLotta:\nHey y'all!\n\nMaya:\nLotta!\n\nLotta:\nWait up a sec! We got bingo!\n\nMaya:\nBingo...?\n\nLotta:\nMy automatic camera took two pictures last night!\n\nMaya:\nHey!\n\nLotta:\nThis is them. Take a look!\n\nPhoenix:\nWait...!\n\nLotta:\nSee? See? He's shooting him with that pistol!\n\nPhoenix:\nI-it looks like that, yes.\n\nMaya:\nBut you can't really tell who that is shooting.\n\nLotta:\nYeah, well there was enough fog out there last night t' strangle a bullfrog. But, y'know... Seeing these photos reminded me of something.\n\nMaya:\nWhat...?\n\nLotta:\nI saw the murder happen. I'm a witness!\n\nMaya:\nWhaaaaaaa!?\n\nPhoenix:\nA-are you serious!?\n\nLotta:\nCourse!\n\nPhoenix:\n(How do you forget... never mind.)\n\nLotta:\nY'all reckon I should tell the cops?\n\nChoose I reckon so\n\nPhoenix:\nI... reckon so!\n\nLotta:\nWhat's that? Now don't y'all go tryin' to mock my accent! I'm a sensitive lady!\n\nChoose I reckon no\n\nPhoenix:\nI... reckon no!\n\nLotta:\nWhat's that? Now don't y'all think y'all can pull one over on me just cause you speak the lingo! I know enough to know that when you see a murder, you'd best tell the cops! It's my obligation as a citizen!\n\nLotta:\nHey, so, I'm off to talk to the cops. Y'all can have this photo. Later.\n\nPhoenix:\nW-w-wait! Lotta!\n\nLotta:\nWhat? Can't y'all see I'm kinda busy?\n\nPhoenix:\nT-tell us what you saw, too! Please?\n\nLotta:\nNice try, honey, but I wasn't born yesterday. I'm a witness, and that means I'm on the side of justice, and that means the cops! I'd sooner eat the south side of a north-bound skunk than tell you!\n\nMaya:\nL-Lotta!\n\nLotta:\nDon't let it get your skivvies in a bunch. Friends today, enemies tomorrow! Or was that the other way round? No matter. I'm gone! Hey! Maybe they'll let me do some testifying! Hot darn!\n\nMaya:\nShe left... ... Well, that's one more witness. What do we do now, Nick?\n\nPhoenix:\n(Well, if she saw something, there's not much we can do about it. The question is: what exactly did she see...? I guess we'll find out in the trial tomorrow.)\n\nLake Photo added to the Court Record.\n\nExamine Camera\n\nPhoenix:\nAn expensive-looking camera faces the lake. Next to it is a large microphone and a blue plastic sheet. Hmm. Looks like a computer is attached to the camera.\n\nDecember 25\nGourd Lake\nPublic Beach\nMaya:\nLooks like the police have given up their questioning.\n\n???:\nHey!\n\nMaya:\nAah! N-Nick! I think Santa's mad at you!\n\n???:\nLong time no see, Nick.\n\nMaya:\nNick... you know Santa!? Wow... Nick and St. Nick... Hey! I see the connection!\n\nPhoenix:\nDon't be ridiculous!\n\n???:\nDude, it's me!\n\nPhoenix:\nL... Larry! What are you doing here!?\n\nButz:\nIsn't it obvious? I'm working my day job! I sell Samurai Dogs! Want one? Gotta get money for dates, you know, My girl Kiyance deserves the best!\n\nPhoenix:\n(K-Kiyance...? Not another model, I hope...)\n\nButz:\nOh, Kiyance's a fine, fine woman, Nick. It was her idea that I wear this costume! She was all 'You go girlfriend!' Y'know? She bought this costume for me!\n\nPhoenix:\nThat... that's great, Larry.\n\nMaya:\nWow! A Santa costume! She must be really nice!\n\nButz:\nWhoa! Cute! Nick! Who's she? She's not your...?\n\nPhoenix:\nNot my... what? N-no, she's not!\n\nMaya:\nI'm his partner, Maya Fey. I'm, uh, the little sister.\n\nButz:\nSister...? ... Wow, Nick, must be tough. Working nine to five, having to take care of a little sister...\n\nMaya:\nN-no, I'm not Nick's sister, I'm my older sister's little sister...\n\nButz:\nHuh. Sounds great!\n\nPhoenix:\n(Don't worry, Maya, he's not listening...)\n\nExamine Bench\n\nMaya:\nHey, Nick, benches! Let's take a break... maybe have a dog?\n\nPhoenix:\nI think not. It's too cold to sit and eat hotdogs out here!\n\nMaya:\nWimpy city boy! You should try standing under a freezing waterfall some time!\n\nExamine Stand\n\nPhoenix:\nI can't get over the Samurai Dogs...\n\nMaya:\nThe 'Original' Samurai Dogs, no less.\n\nButz:\nHey, man, whoever calls their product the 'original' first wins!\n\nPhoenix:\nWhy don't you add 'world-famous' to the sign?\n\nButz:\nHey, good idea!\n\nPhoenix:\n(What have I done...?)\n\nAbout What happened\n\nPhoenix:\nHey, Larry. There was a murder here last night... You work here. Have you heard anything?\n\nMaya:\nNick, you're wasting your time. Last night was Christmas Eve! He was with Kiyance, obviously! He wouldn't have been standing out here in the cold!\n\nButz:\nOof!\n\nMaya:\n?\n\nPhoenix:\nI think what you just said caught him off guard, Maya.\n\nButz:\nN-no, it's just... Kiyance's not in town right now. She... she's in Hawaii on a photo shoot.\n\nPhoenix:\n(A model. I knew it.) Well, anyway, there was a murder here on the lake. The trial's tomorrow.\n\nButz:\nHuh. Neat.\n\nPhoenix:\nThe defendant is Edgeworth. Miles Edgeworth.\n\nMaya:\nUm, Nick? Why would Larry know Edgeworth...?\n\nButz:\nWhoa, Nick! You don't mean THAT Miles Edgeworth!? Old Edgey!?\n\nPhoenix:\nYeah. He's a murder suspect.\n\nButz:\nWh-whoa! Murder?\n\nMaya:\nHuh? You know Mr. Edgeworth, Larry?\n\nButz:\nYeah! Of course! Edgey was in the same class as us in grade school!\n\nMaya:\nWhaaaaaaaaat!?\n\nAbout Samurai Dogs\n\nMaya:\nUmm... umm... tell me about the dogs!\n\nButz:\nHuh? Oh, you mean the Samurai Dogs?\n\nMaya:\nW-why are they Samurai Dogs? I... I mean they kind of look gourd-shaped.\n\nButz:\nOh, well originally, they were Gourd Dogs! Y'know, like 'guard dogs'?\n\nMaya:\nOuch...\n\nButz:\nThe Samurai thing was Kiyance's idea. Oh, she's my woman, y'know. She was all 'change the name and you go girlfriend!' She made me that banner! Man, the kids can't get enough of those Samurai Dogs!\n\nMaya:\nErr... Something about that just seems... wrong.\n\nButz:\nOh, and guess what? We're getting a ton of customers here at the lake, what with the big news!\n\nMaya:\nThe 'big news'...?\n\nButz:\nYeah! Gourdy!\n\nMaya:\nG-'Gourdy'...?\n\nAbout Edgeworth\n\nMaya:\nSo, Mr. Edgeworth was your classmate, Larry?\n\nButz:\nYeah, Nick, him, and I used to hang out all the time.\n\nMaya:\nWow... I never knew.\n\nButz:\nDon't get me wrong. He's always been kind of a stick in the mud. Studying all the time, trying to 'be like father.'\n\nMaya:\nLike his father...?\n\nButz:\nYeah. Edgey's pop was a famous defense lawyer back in the day.\n\nMaya:\nWow. Wait... You said 'defense lawyer'?\n\nButz:\nYeah.\n\nMaya:\nWait a second! But Mr. Edgeworth is a prosecuting attorney!\n\nButz:\nWhat? Edgey's got a proboscis on his knee!?\n\nMaya:\nNo, no--he's a 'prosecuting attorney.' That's like the total opposite of a defense lawyer!\n\nButz:\n... Huh. Go figure! He always used to talk about defending the 'weak' who were 'unable to defend themselves.' Man, he used to go on and on about man's duty to society and all that. What a bore! I wonder that changed his mind, though? Do you know, Nick?\n\nPhoenix:\n...\n\nMaya:\nNick...?\n\nAbout Gourdy\n\nMaya:\nUmm... what's 'Gourdy'?\n\nButz:\nHuh? You mean you don't know? It's here, in this very lake! A giant, mysterious monster! Gourdy!\n\nMaya:\nA... monster?\n\nButz:\nYeah. Check it out. This is an article from yesterday's newspaper. There's a photo!\n\nMaya:\nWow! It's r-really real! Nick! A monster! A real monster!\n\nPhoenix:\nUmm... yeah. (It's probably just a log or something... right?) Hey... there's a quote here from the person who took the photo. Hmm? What's this? 'I set the camera to automatic, and when we got into the frame... I heard a loud 'bang'! Like an explosion... followed by the sound of something slipping into the water...'\n\nMaya:\nI wish I could have seen it!\n\nPhoenix:\n(Why would there be a sound like an explosion...?) Larry. Could I borrow this article from you?\n\nButz:\nSure, no problem. That'll be one million dollars!\n\nMaya:\nO-one million...?\n\nPhoenix:\n(Grow up, Larry.)\n\nGourdy Article added to the Court Record.\n\nAbout Gourdy\n\nMaya:\nHey Nick, show me that article once more. 'I set the camera to automatic, and when we got into the frame... I heard a loud 'bang'! Like an explosion... followed by the sound of something slipping into the water...' How romantic! And cool! I mean, to think, a real monster!\n\nButz:\nYeah. I'm just glad I'm selling more dogs!\n\nGourd Lake Entrance\n\nDecember 25\nPolice Department\nCriminal Affairs\nMaya:\n... Not a Gumshoe in sight.\n\nPolice:\nIf you're looking for Detective Gumshoe, he's in the questioning room. Apparently, an important witness turned up. He'll be in there for a while.\n\nMaya:\nLotta Hart... it has to be.\n\nPhoenix:\nUh oh...\n\nExamine Detective\n\nPhoenix:\nThat must be one of the detectives. He's mumbling something to himself.\n\nPolice:\n'...move in the crowd. Wear drab clothes... Never enter the target's field of vision...'\n\nPhoenix:\n... He must be doing image training for trailing.\n\nDetention Center\n\nPresent Lake Photo\n\nEdgeworth:\nHmph... Who would have thought there'd be a photo...?\n\nPhoenix:\nEdgeworth... Did you shoot him?\n\nEdgeworth:\n... What do you think, Wright?\n\nPhoenix:\nI don't think you're the kind to point a gun at anyone, no.\n\nMaya:\nSo you didn't shoot him?\n\nEdgeworth:\nNo, I didn't. It wasn't me.\n\nWright & Co. Law Offices\n\nDecember 25\nGrossberg Law Offices\nGrossberg:\nAh-HHHHEM!*\nPhoenix:\n(Ah, that old familiar clearing of the throat!)\n\nGrossberg:\nAh hah! You're Mia's... something, are you not?\n\nPhoenix:\nI was her understudy, yes. Phoenix Wright.\n\nGrossberg:\nAh hah! And you, you're Mia's... something too, are you not?\n\nMaya:\nHer little sister, yes!\n\nGrossberg:\nYou've grown! You've come to look a lot like your sister, you know? It takes me back. 'Ahh... the days of my youth... like the scent of fresh lemon...' you see.\n\nPhoenix:\nUm, Mr. Grossberg, sir?\n\nGrossberg:\nHmm...? Ah, yes. I beg your pardon. Of course you came here to discuss something. What is it then? Something the matter?\n\nAbout What happened\n\nPhoenix:\nThere was a murder last night...\n\nGrossberg:\nA murder?\n\nPhoenix:\nYou haven't heard...?\n\nGrossberg:\nI, er, just got up, you see.\n\nPhoenix:\nWell, Miles Edgeworth shot someone with a pistol.\n\nGrossberg:\nEdgeworth!? What!? W-who!?\n\nPhoenix:\nWell, the identity of the victim is still unknown.\n\nGrossberg:\nT-this is terrible news indeed!\n\nPhoenix:\n(I guess he hadn't heard anything...)\n\nAbout That painting\n\nPhoenix:\nMr. Grossberg? Whatever happened to that painting?\n\nGrossberg:\nOh, yes... I do not think it shall ever be coming back home to this office. I can't exactly claim it as stolen... I suppose it's my just desserts. Old, bitter desserts.\n\nAbout Robert Hammond\n\nPhoenix:\nWho is this Hammond guy, anyway?\n\nGrossberg:\nMr. Hammond... He was the defense attorney in that case...\n\nPhoenix:\n'That case'...?\n\nGrossberg:\nYes, the 'DL-6 Incident.'\n\nPhoenix:\n'DL-6'...? (Why does that sound so familiar?)\n\nGrossberg:\nPerhaps you remember?\n\nPhoenix:\n(I'm sure someone mentioned it during the trial for Mia's murder.)\n\nGrossberg:\nThat was the incident where the police were so at a loss they used a spirit medium.\n\nMaya:\n...! Wait... you don't mean? Was that medium my mother?\n\nGrossberg:\nYes, my dear. The spirit medium, Misty Fey, your mother, contacted the spirit of the victim. But... the case was a loss. No conviction was made.\n\nAbout The DL6 Incident\n\nGrossberg:\nThe DL-6 Incident, yes... Happened 15 years ago. A very strange case, indeed.\n\nPhoenix:\nThey never caught the criminal, right?\n\nGrossberg:\nCorrect. Misty Fey used her powers to talk to the spirit of the late victim. Her testimony led to charges being laid against one man. But Mr. Hammond won the case and the suspect was declared innocent.\n\nMaya:\n... And the police blamed my mother, calling her a fraud. You were the one who helped her out then, right, Mr. Grossberg?\n\nGrossberg:\nEr... y-yes. Yes, quite.\n\nMaya:\nThank you!\n\nGrossberg:\nN-no... please. D-don't mention it.\n\nPhoenix:\n... (DL-6... Never thought I'd hear that name again...)\n\nMaya:\nBut wait... What does this case have anything to do with Mr. Edgeworth?\n\nGrossberg:\nIt has everything to do with Mr. Edgeworth, my dear! The victim in the DL-6 Incident was none other than his father, Gregory Edgeworth!\n\nMaya:\nWh-what!? His father!?\n\nGrossberg:\n... If you want to know more, you should ask him yourself.\n\nPresent Attorney's Badge\n\nGrossberg:\nYou've really grown up in the past few years, my dear! How proud Mia would be if she could see you now!\n\nMaya:\nShe said she was more worried about me than anything.\n\nPhoenix:\nAww, just go on and take the compliment, will you?\n\nPresent Lotta's Camera\n\nGrossberg:\nSo, this camera on the lake takes a photo whenever it hears an explosion sound?\n\nMaya:\nThat's what she said.\n\nGrossberg:\nAnd it just happened to be set up on the beach, pointing out on the lake?\n\nMaya:\nYes... she said it was to photograph 'shooting stars.'\n\nGrossberg:\nHmm. Shooting stars... explosions... what's the connection? I'd be suspicious of this witness of yours.\n\nPresent Autopsy Report\n\nGrossberg:\nHmm? Strange... I feel as though I've seen this man somewhere before! ... Aaaaaaaaaaaaah!\n\nPhoenix:\nDid you remember!?\n\nGrossberg:\nHe was a lawyer! Here, in my office! That's Hammond! Robert Hammond!\n\nMaya:\nMr. Hammond...?\n\nGrossberg:\nAnd you say this is the man Miles Edgeworth shot?\n\nPresent Lake Photo\n\nGrossberg:\nSo this is the moment the crime took place, eh?\n\nPhoenix:\nYes.\n\nGrossberg:\nYou can't really say for sure that's Edgeworth. I'm not sure whether that's a good thing or a bad thing. Not sure at all...\n\nPresent Misty Fey's Photo\n\nGrossberg:\nMisty Fey. Mother of Mia and Maya Fey. Show this photograph to Miles Edgeworth. He'll have something to say to you then.\n\n\nPresent Anything else\n\nGrossberg:\nEr... my apologies. I'm not sure I can help you with that.\n\nWright & Co. Law Offices\n\nPresent Misty Fey's Photo\n\nMaya:\nMy mother... ...\n\nPhoenix:\n(Now that I've shown her the picture, I can't think of anything to say... That probably wasn't the best thing to do.)\n\nDecember 25\nDetention Center\nVisitor's Room\nEdgeworth:\nWhat's this? I was hoping you'd gotten my message the first time.\n\nPhoenix:\nEdgeworth, what about your defense?\n\nEdgeworth:\n...! It's no concern of yours.\n\nPhoenix:\n(Guess he hasn't found anyone yet.)\n\nAbout What happened\n\nPhoenix:\nCan I ask you about the murder?\n\nEdgeworth:\nWright. I'll ask you again, just leave me alone.\n\nPhoenix:\n...\n\nEdgeworth:\nPlease try to understand. I'm not doing this to prove I'm tough, or because I look down on you. I just don't want you anywhere near this case. Understand?\n\nAbout Gourd Lake\n\nPhoenix:\nWhy did you go to Gourd Lake?\n\nEdgeworth:\nI have no intention of telling you.\n\nPhoenix:\nNor, apparently, would you tell Detective Gumshoe.\n\nEdgeworth:\n!\n\nMaya:\nDetective Gumshoe was really worried about you!\n\nEdgeworth:\n...\n\nAbout The DL6 Incident\n\nEdgeworth:\nThe 'DL-6 Incident'... was when my father died. Right before my eyes... He was shot and killed, and I saw it all.\n\nMaya:\n...!\n\nEdgeworth:\nMy memories from that time are... foggy. I suppose it's a self-defense mechanism. In any case, a suspect was arrested... a man. It's pretty clear he was the only one who could have killed my father. The spirit medium they used to talk to my late father said the same thing. It was an attorney by the name of Robert Hammond that cleared the suspect's name.\n\nPhoenix:\nAnd Hammond... is the victim in the Gourd Lake murder?\n\nEdgeworth:\nCorrect.\n\nMaya:\nUmm... That spirit medium... that was my mom.\n\nEdgeworth:\nWhat? You mean you're...? ... It's strange. I thought that terrible incident was about to end, and now... this.\n\nPhoenix:\n'About to end'?\n\nEdgeworth:\nThe DL-6 Incident happened 15 years ago. 15 years ago... on December 28.\n\nMaya:\nDecember 28?\n\nEdgeworth:\nThe statute of limitations on the case runs out in three days.\n\nPhoenix:\nWhat!?\n\nMaya:\nUm, Nick? What odes that mean?\n\nPhoenix:\nWhen a case's statute of limitations runs out, legally, the case never happened.\n\nEdgeworth:\nThree days from now, DL-6 will be closed... forever.\n\nAbout The suspect\n\nMaya:\nWhat happened to the suspect? The one who got off innocent?\n\nEdgeworth:\nI don't know... He disappeared from public view. Nobody knows where to. If he's still alive, he'd be about 50 years old now.\n\nPhoenix:\n(I guess I can understand why he'd go into hiding... It'd be hard to live a normal life after being a murder suspect in such a big case.)\n\nAbout Your father\n\nMaya:\nUmm... so, was your father a lawyer?\n\nEdgeworth:\nHe was... Gregory Edgeworth. He was quite famous at the time, apparently.\n\nMaya:\nSo, you were sort of trying to follow in his footsteps.\n\nEdgeworth:\n... I'd rather not talk about it.\n\nPresent Attorney's Badge\n\nEdgeworth:\nYour attorney's badge...? I can't say I really want to see one of those right now.\n\nPresent Misty Fey's Photo\n\nEdgeworth:\n...! ...\n\nPhoenix:\nEdgeworth?\n\nEdgeworth:\nIt's only been a matter of hours since you last visited. Yet you've made incredible progress in your investigation. I'll admit it, I'm impressed, Wright. You were always single-minded in your work, though. Once you start on something, you always see it through, don't you?\n\nPhoenix:\nAbout the 'DL-6 Incident'...\n\nEdgeworth:\nRight... DL-6. I didn't want you to find out about it. That is why I refused your offer to defend me. I'm sorry if it sounded like I thought you weren't up to the job. I just wanted to keep you away from DL-6.\n\nPhoenix:\nSo... do you still think it would have been better for me to stay away?\n\nEdgeworth:\nI don't know. But... I see no point in hiding anything from you now. Very well. Ask whatever you like, and I will answer to the best of my abilities.\n\nEdgeworth:\n... Wright.\n\nPhoenix:\n?\n\nEdgeworth:\nIt pains me to ask you this now...\n\nMaya:\nI know! You want us to defend you!\n\nEdgeworth:\nYes... Will you?\n\nChoose Of course we will\n\nPhoenix:\nAh, who could have guessed this day would come?\n\nEdgeworth:\nNot me.\n\nChoose Of course we won't\n\nPhoenix:\nSorry, charley! No way!\n\nEdgeworth:\nWright...\n\nMaya:\nNick...!? ...\n\nPhoenix:\nH-hey, don't look so serious, guys! I was kidding! Just a little joke!\n\nEdgeworth:\nThere was nothing little...\n\nMaya:\n...or joke-like about it!\n\nPhoenix:\n(I thought it was funny...)\n\nMaya:\nNick! Do it over!\n\nPhoenix:\nYes, Your Honor. How could I refuse you, Edgeworth?\n\nEdgeworth:\nThank you, Wright.\n\nPhoenix:\nThis is my chance to finally pay you back.\n\nMaya:\nPay him back...?\n\nEdgeworth:\nPay me back? For what? I don't remember ever doing anything for you.\n\nPhoenix:\nNever mind... I guess you don't really need to know.\n\nEdgeworth:\nHuh... My letter of request. Please give it to Detective Gumshoe.\n\nEdgeworth's Request put in pocket.\n\nPhoenix:\nWell, I guess we should... ... W-what's that!?\n\nMaya:\nE-earthquake! Nick! It's a big one! Whaaaaa! I-it's calming down... ... Whew... that was scary!\n\nPhoenix:\n...? Huh? Where's Edgeworth?\n\nMaya:\n... There. He's on the floor in a ball, shivering. I guess he doesn't do so well with earthquakes.\n\nPhoenix:\n(I've heard of running, but curling up in a ball?)\n\nMaya:\nWell, I guess we're done. Mr. Edgeworth doesn't seem like he's going to stand up any time soon. Let's go, Nick.\n\nPhoenix:\nUh.. right. We have to give Edgeworth's letter of request to Detective Gumshoe.\n\nDecember 25\nPolice Department\nCriminal Affairs\nGumshoe:\nWhat's going on here!?\n\nMaya:\nEek!\n\nPhoenix:\nW-what's wrong, Detective?\n\nGumshoe:\nThis wild lady comes in here just a while ago... Says she came 'to talk to y'all after hearing what Mr. Wright had to say'! What's this all about, pal!?\n\nPhoenix:\n(Lotta Hart...)\n\nGumshoe:\nWhy are you going around finding more witnesses!? You want to give Mr. Edgeworth the death sentence, pal!?\n\nPhoenix:\nN-no, not at all... Just... I mean, she did see something. There's nothing I can do about that. I can't go around covering up evidence!\n\nGumshoe:\nEr... You trying to say something about the way I do my job?\n\nPhoenix:\nNo sir!\n\nExamine Detective\n\nPhoenix:\nThat must be one of the detectives. He's mumbling something to himself.\n\nPolice:\n'Never talk to people in the neighborhood... Turn all the lights in the room off, and close the curtains...'\n\nPhoenix:\n... He must be doing image training for a stake-out.\n\nAbout Lotta's testimony\n\nPhoenix:\nSo... what did Ms. Hart say?\n\nGumshoe:\nShe says she saw Mr. Edgeworth fire the pistol.\n\nMaya:\nWhat!?\n\nGumshoe:\nShe even had a photograph to prove it.\n\nPhoenix:\nRight. I saw it too... But you really can't tell from the photo who it is shooting.\n\nGumshoe:\nThat's why she said she's going to enlarge the photo. She said 'it'll drop the quality a mite, but should let us see who's who!'\n\nMaya:\nShe can do that!?\n\nPhoenix:\n(Okay, so there's going to be an enlarged photograph that shows Edgeworth in the act. Great. Just great.)\n\nGumshoe:\nIn any case, she's going to be the one testifying tomorrow.\n\nMaya:\nHuh? What happened to the other witness?\n\nGumshoe:\nWell... Apparently, there was a cancellation.\n\nPhoenix:\n(A 'cancellation'...!?)\n\nAbout Tomorrow's trial\n\nGumshoe:\nI'm afraid tomorrow is going to be life or death for poor Mr. Edgeworth. We got a witness who says she saw the very moment of the murder. And we got a photo taken when the shot rang out.\n\nPhoenix:\n(I'd say that sounds like a pretty unwinnable case... But wait... What did Mia used to say? If he's innocent, there's got to be something I've overlooked...)\n\nAbout Edgeworth\n\nGumshoe:\nIt sound like Mr. Edgeworth is going to ask the state to assign a public defender. I was just asked to file the paperwork. But you still got time, pal! Go talk to him again, for me, please! You have to convince him! You have to make him let you defend him! Please! I know you're the only one who can do it, pal. You're the only one who can save Mr. Edgeworth!\n\nPresent Edgeworth's Request\n\nPresent Anything else\n\nGumshoe:\nHey, pal, there's only one thing I want to see from you! And that's a letter of request from Mr. Edgeworth for you to be his defense attorney!\n\nPhoenix:\nLook what I got.\n\nGumshoe:\n... Hey, you did it, pal! Glad I waited till the last minute to file those papers! I'll rip 'em up and start new ones for you!\n\nPhoenix:\nThanks, Detective. Well, see you in court tomorrow, then.\n\nGumshoe:\nGood luck, pal.\n\nGumshoe:\nHey! You guys feel that earthquake a little while back? I was worried!\n\nMaya:\nWorried? We're fine! I've lived out here my whole life. I'm pretty used to them by now.\n\nGumshoe:\nOh, I wasn't worried about you two. I was worried about Mr. Edgeworth!\n\nPhoenix:\n(Oh, right...) He did seem to over-react a little, now that you mention it.\n\nGumshoe:\nYeah, well, I'm not surprised. It was a pretty big quake. I'm going to go check on him. You two go eat and get your rest for tomorrow's trial. Later!\n\nMaya:\n... I wonder what it is with Mr. Edgeworth and earthquakes?\n\nPhoenix:\nI wonder... He was never that scared of them when he was in school.\n\nPhoenix:\n(Then again, I was only in the same class as him for 4th grade. He transferred to another school after that. I wonder what happened to Edgeworth...)\n\nTo be continued.",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [
          {
            "name": "Popper",
            "description": "TODO"
          },
          {
            "name": "Lotta's Camera",
            "description": "TODO"
          },
          {
            "name": "Lake Photo",
            "description": "TODO"
          },
          {
            "name": "Gourdy Article",
            "description": "TODO"
          },
          {
            "name": "Misty Fey's Photo",
            "description": "TODO"
          },
          {
            "name": "Edgeworth's Request",
            "description": "TODO"
          }
        ],
        "people": [
          {
            "name": "Phoenix Wright",
            "description": "TODO"
          },
          {
            "name": "Miles Edgeworth",
            "description": "TODO"
          },
          {
            "name": "Robert Hammond",
            "description": "TODO"
          },
          {
            "name": "Lotta Hart",
            "description": "TODO"
          },
          {
            "name": "Maya Fey",
            "description": "TODO"
          },
          {
            "name": "Detective Dick Gumshoe",
            "description": "TODO"
          },
          {
            "name": "Larry Butz",
            "description": "TODO"
          },
          {
            "name": "Marvin Grossberg",
            "description": "TODO"
          }
		]
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Phoenix Wright",
        "is_correct": 0, 
        "response": "Phoenix:\nUm... the defendant... is me, right?\n\nMia:\nWright! Have you completely lost your mind? Focus! The defendant is the person on trial! You're his lawyer!\n\nPhoenix:\nUm, er, eh? Oh yeah, right! Eh heh heh.\n\nMia:\nThis is no laughing matter! You did pass the bar, didn't you?\n\nJudge:\nSorry, I couldn't hear your answer. I'll ask once more:\nPlease state the name of the defendant in this case."
      },
      {
        "choice": "Larry Butz",
        "is_correct": 1, 
        "response": ""
      },
      {
        "choice": "Mia Fey",
        "is_correct": 0, 
        "response": "Phoenix:\nThe, um, defendant? That's... er... Mia Fey?\n\nMia:\nWrong, Wright. Look, I have to leave. I have to go home. I'm... I'm expecting a delivery.\n\nPhoenix:\nAw, c'mon Chief. There's no need to be going so soon, is there?\n\nMia:\nWright! Listen: the defendant is the one on trial--your client! I mean, that's about as basic as you can get!\n\nPhoenix:\n(I've put my foot in it this time! I've got to relax!)\n\nJudge:\nSorry, I couldn't hear your answer. I'll ask once more:\nPlease state the name of the defendant in this case."
      }
    ]
  },
  "1":{
    "context": "Phoenix:\nThe defendant? Well, that's Larry Butz, Your Honor.\n\nJudge:\nCorrect. Just keep your wits about you and you'll do fine. Next question: This is a murder trial. Tell me, what's the victim's name?\n\nPhoenix:\n(Whew, I know this one! Glad I read the case report cover to cover so many times. It's... wait... Uh-oh! No... no way! I forgot! I'm drawing a total blank here!)\n\nMia:\nPhoenix! Are you absolutely SURE you're up to this? You don't even know the victim's name!?\n\nPhoenix:\nOh, the victim! O-Of course I know the victim's name! I, um, just forgot. ... Temporarily.\n\nMia:\nI think I feel a migraine coming on. Look, the victim's name is listed in the Court Record. Just touch the Court Record button to check it at anytime, okay? Remember to check it often. Do it for me, please. I'm begging you.\n\nJudge:\nMr. Wright. Who is the victim in this case?",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Mia Fey",
        "is_correct": 0, 
        "response": "Phoenix:\nUm... Mia Fey?\n\nMia:\nW-W-What!? How can I be the victim!?\n\nPhoenix:\nOh! Right! Sorry! I, er, it was the first name that popped into my head, and--\n\nMia:\nThe Court Record button! Remember to use it when you are in a pinch.\n\nJudge:\nLet me ask that one again:\nLet's hear your answer. Who is the victim in this case?"
      },
      {
        "choice": "Cinder Block",
        "is_correct": 0, 
        "response": "Phoenix:\nOh, um, wasn't it Ms. Block? Ms. Cinder Block?\n\nJudge:\nThe person in question was a victim of murder, not ill-conceived naming, Mr. Wright.\n\nMia:\nWright? If you forget something, just touch the Court Record button to help you remember. A mistake in court could cost you the case.\n\nJudge:\nI ask you again:\nLet's hear your answer. Who is the victim in this case?"
      },
      {
        "choice": "Cindy Stone",
        "is_correct": 1, 
        "response": ""
      }
    ]
  },
  "2":{
    "context": "Phoenix:\nUm... the victim's name is Cindy Stone.\n\nJudge:\nCorrect. Now, tell me, what was the cause of death? She died because she was...?",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Poisoned",
        "is_correct": 0, 
        "response": "Phoenix:\nOh, right! Wasn't she, um, poisoned by er... poison?\n\nJudge:\nYou're asking me!?\n\nPhoenix:\nUm... Chief! Help me out!\n\nMia:\nCheck the court record. The Court Record button... remember?\n\nPhoenix:\n(Geez. Give a guy a break!)\n\nJudge:\nLet me ask again.\nShe died because she was...?"
      },
      {
        "choice": "Hit with a blunt object",
        "is_correct": 1, 
        "response": ""
      },
      {
        "choice": "Strangled",
        "is_correct": 0, 
        "response": "Phoenix:\nRight... she was strangled, wasn't she?\n\nMia:\nPlease tell me that was you talking to yourself.\n\nJudge:\nIf you wish to hang yourself, Mr. Wright, you're welcome to, but not inside my courtroom. I suppose there's nothing to do but give you another try:\nShe died because she was...?"
      }
    ]
  },
  "3":{
    "context": "Phoenix:\nShe was struck once, by a blunt object.\n\nJudge:\nCorrect. You've answered all my questions. I see no reason why we shouldn't proceed. You seem much more relaxed, Mr. Wright. Good for you.\n\nPhoenix:\nThank you, Your Honor. (Because I don't FEEL relaxed, that's for sure.)\n\nJudge:\nWell, then... First, a question for the prosecution. Mr. Payne?\n\nPayne:\nYes, Your Honor?\n\nJudge:\nAs Mr. Wright just told us, the victim was struck with a blunt object. Would you explain to the court just what that 'object' was?\n\nPayne:\nThe murder weapon was this statue of 'The Thinker.' It was found lying on the floor, next to the victim.\n\nJudge:\nI see... the court accepts it into evidence.\n\nStatue added to the Court Record.\n\nMia:\nWright... Be sure to pay attention to any evidence added during the trial. That evidence is the only ammunition you have in court. Touch the Court Record button to check the Court Record frequently.\n\nJudge:\nMr. Payne, the prosecution may call its first witness.\n\nPayne:\nThe prosecution calls the defendant, Mr. Butz, to the stand.\n\nPhoenix:\nUm, Chief, what do I do now?\n\nMia:\nPay attention. You don't want to miss any information that might help your client's case. You'll get your chance to respond to the prosecution later, so be ready! Let's just hope he doesn't say anything... unfortunate.\n\nPhoenix:\n(Uh oh, Larry gets excited easily... this could be bad.)\n\nPayne:\nAhem. Mr. Butz. Is it not true that the victim had recently dumped you?\n\nButz:\nHey, watch it buddy! We were great together! We were Romeo and Juliet, Cleopatra and Mark Anthony!\n\nPhoenix:\n(Um... didn't they all die?)\n\nButz:\nI wasn't dumped! She just wasn't taking my phone calls. Or seeing me... Ever. WHAT'S IT TO YOU, ANYWAY!?\n\nPayne:\nMr. Butz, what you describe is generally what we mean by 'dumped.' In fact, she had completely abandoned you... and was seeing other men! She had just returned from overseas with one of them the day before the murder!\n\nButz:\nWhaddya mean, 'one of them'!? Lies! All of it, lies! I don't believe a word of it!\n\nPayne:\nYour Honor, the victim's passport. According to this, she was in Paris until the day before she died.\n\nPassport added to the Court Record.\n\nJudge:\nHmm... Indeed, she appears to have returned the day before the murder.\n\nButz:\nDude... no way...\n\nPayne:\nThe victim was a model, but did not have a large income. It appears that she had several 'Sugar Daddies.'\n\nButz:\nDaddies? Sugar?\n\nPayne:\nYes. Older men, who gave her money and gifts. She took their money and used it to support her lifestyle.\n\nButz:\nDuuude!\n\nPayne:\nWe can clearly see what kind of woman this Ms. Stone was. Tell me, Mr. Butz, what do you think of her now?\n\nMia:\nWright... I don't think you want him to answer that question.\n\nPhoenix:\n(Yeah... Larry has a way of running his mouth in all the wrong directions. Should I...?)",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [
          {
            "name": "Statue",
            "description": "A statue in the shape of The Thinker'. It's rather heavy."
          },
          {
            "name": "Passport",
            "description": "The victim apparently arrived home from Paris on 7/30, the day before the murder."
          }
		],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Wait and see what happens",
        "is_correct": 1, 
        "response": "Phoenix:\n(Might be better not to get involved in this one...)\n\nPayne:\nWell, Mr. Butz?\n\nButz:\nDude, no way! That cheatin' she-dog!"
      },
      {
        "choice": "Stop him from answering",
        "is_correct": 1, 
        "response": "Phoenix:\nMy client had no idea the victim was seeing other men! That question is irrelevant to this case!\n\nPayne:\nOof! *wince*\n\nButz:\nDude! Nick! Whaddya mean, 'irrelevant'!? That cheatin' she-dog!"
      }
    ]
  },
  "4":{
    "context": "Butz:\nI'm gonna die. I'm just gonna drop dead! Yeah, and when I meet her in the afterlife... I'm going to get to the bottom of this!\n\nJudge:\nLet's continue with the trial, shall we?\n\nPayne:\nI believe the accused's motive is clear to everyone.\n\nJudge:\nYes, quite.\n\nPhoenix:\n(Oh boy. This is so not looking good.)\n\nPayne:\nNext question! You went to the victim's apartment on the day of the murder, did you not?\n\nButz:\nGulp!\n\nPayne:\nWell, did you, or did you not?\n\nButz:\nHeh? Heh heh. Well, maybe I did, and maybe I didn't!\n\nPhoenix:\n(Uh oh. He went. What do I do?)",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Have him answer honestly",
        "is_correct": 1, 
        "response": "Phoenix:\n(I know! I'll send him a signal...)\n\n(TELL THE TRUTH)\n\nButz:\nEr... Yeah! Yeah! I was there! I went!\n\nJudge:\nOrder! Well, Mr. Butz?\n\nButz:\nDude, chill! She wasn't home, man... So, like, I didn't see her.\n\nPayne:\nObjection\n\nPayne:\nYour Honor, the defendant is lying.\n\nJudge:\nLying?\n\nPayne:\nThe prosecution would like to call a witness who can prove Mr. Butz is lying."
      },
      {
        "choice": "Stop him from answering",
        "is_correct": 1, 
        "response": "Phoenix:\n(I'll send him a signal...)\n\n(LIE LIKE A DOG)\n\nButz:\nUm, well, see, it's like this: I don't remember.\n\nPayne:\nYou 'don't remember'? Well then, we'll just have to remind you!\n\nPhoenix:\n(I got a bad feeling about this...)\n\nPayne:\nWe have a witness that can prove he DID go to the victim's apartment that day!"
      }
    ]
  },
  "5":{
    "context": "Judge:\nWell, that simplifies matters. Who is your witness?\n\nPayne:\nThe man who found the victim's body. Just before making the gruesome discovery... He saw the defendant fleeing the scene of the crime!\n\nJudge:\nOrder! Order in the court! Mr. Payne, the prosecution may call its witness.\n\nPayne:\nYes, Your Honor.\n\nPhoenix:\n(This is bad...)\n\nPayne:\nOn the day of the murder, my witness was selling newspapers at the victim's building. Please bring Mr. Frank Sahwit to the stand!\n\nPayne:\nMr. Sahwit, you sell newspaper subscriptions, is this correct?\n\nSahwit:\nOh, oh yes! Newspapers, yes!\n\nJudge:\nMr. Sahwit, you may proceed with your testimony. Please tell the court what you saw on the day of the murder.\n\nWitness Testimony\n-- Witness's Account --\nSahwit:\nI was going door-to-door, selling subscriptions when I saw a man fleeing an apartment.\nI thought he must be in a hurry because he left the door half-open behind him.\nThinking it strange, I looked inside the apartment.\nThen I saw her lying there... A woman... not moving... dead!\nI quailed in fright and found myself unable to go inside.\nI thought to call the police immediately!\nHowever, the phone in her apartment wasn't working.\nI went to a nearby park and found a public phone.\nI remember the time exactly: It was 1:00 PM.\nThe man who ran was, without a doubt, the defendant sitting right over there.\n\nJudge:\nHmm...\n\nPhoenix:\n(Larry! Why didn't you tell the truth? I can't defend you against a testimony like that!)\n\nJudge:\nIncidentally, why wasn't the phone in the victim's apartment working?\n\nPayne:\nYour Honor, at the time of the murder, there was a blackout in the building.\n\nJudge:\nAren't phones supposed to work during a blackout?\n\nPayne:\nYes, Your Honor... However, some cordless phones do not function normally. The phone that Mr. Sahwit used was one of those. Your Honor... I have a record of the blackout, for your perusal.\n\nBlackout Record added to the Court Record.\n\nJudge:\nNow, Mr. Wright...\n\nPhoenix:\nYes! Er... yes, Your Honor?\n\nJudge:\nYou may begin your cross-examination.\n\nPhoenix:\nC-Cross-examination, Your Honor?\n\nMia:\nAlright, Wright, this is it. The real deal!\n\nPhoenix:\nUh... what exactly am I supposed to do?\n\nMia:\nWhy, you expose the lies in the testimony the witness just gave!\n\nPhoenix:\nLies! What?! He was lying!?\n\nMia:\nYour client is innocent, right? Then that witness must have lied in his testimony! Or is your client really... guilty?\n\nPhoenix:\n!!! How do I prove he's not?\n\nMia:\nYou hold the key! It's in the evidence! Compare the witness's testimony to the evidence at hand. There's bound to be a contradiction in there! First, find contradictions between the Court Record and the witness's testimony. Then, once you've found the contradicting evidence... present it and rub it in the witness's face!\n\nPhoenix:\nUm... okay.\n\nMia:\nTouch the Court Record button and point out contradictions in the testimony!",
    "category": "cross_examination",
    "court_record": {
      "add": {
        "objects": [
          {
            "name": "Blackout Record",
            "description": "Electricity to Ms. Stone's building was out from noon to 6 PM on the day of the crime."
          }
		],
        "people": [
		  {
            "name": "Frank Sahwit",
            "description": "TODO"
		  }
		]
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "testimonies": [
      {
        "testimony": "I was going door-to-door, selling subscriptions when I saw a man fleeing an apartment.",
        "critical_press": 0, 
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nIsn't a man leaving an apartment a common sight? I find it odd you would take notice of him...\n\nSahwit:\nEr... heh. I don't know. He just seemed strange to me, that's all. Like he was mad, and yet frightened at the same time. Just like... a criminal fleeing the scene of a crime!\n\nPhoenix:\nThe defense requests that the witness refrain from conjecture!\n\nPayne:\nOf course. What the witness means is that the man he saw looked suspicious. So, what happened next?"
      },
      {
        "testimony": "I thought he must be in a hurry because he left the door half-open behind him.",
        "critical_press": 0, 
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nHalf-open... you say?\n\nSahwit:\nYes, yes, the door was open halfway. Yes. I watched for a moment, but no one came to close the door. 'That's odd, in a big city like this,' I thought...\n\nPayne:\nI see. And what happened next?"
      },
      {
        "testimony": "Thinking it strange, I looked inside the apartment.",
        "critical_press": 0, 
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nWhat gave you the idea to do that?\n\nSahwit:\nWell, the door was half-open, you see. Isn't it only human to want to... peek? We climb mountains because they are there! It's the same thing.\n\nPayne:\nTruer words have never been spoken! Anyone would look inside!\n\nPhoenix:\n(Hmm... why did Payne cut him off so quickly?)\n\nPayne:\nSo you looked into the apartment. What happened then?"
      },
      {
        "testimony": "Then I saw her lying there... A woman... not moving... dead!",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nAre you sure she was dead?\n\nSahwit:\nW-Well, no, I guess I wasn't. But, she wasn't moving at all, and there was blood everywhere.\n\nPhoenix:\n(I guess that would look fatal to anyone...) Very well, what happened next?"
      },
      {
        "testimony": "I quailed in fright and found myself unable to go inside.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nSo, you didn't touch ANYTHING in the apartment?\n\nSahwit:\nUm, yes. I mean no! Nothing.\n\nPhoenix:\nOkay. What happened next?"
      },
      {
        "testimony": "I thought to call the police immediately!",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nYou 'thought' to call the police? Does that mean you didn't actually call them!?\n\nPayne:\nPlease, please... Listen to the rest of the testimony. You thought to call the police... What happened next?"
      },
      {
        "testimony": "However, the phone in her apartment wasn't working.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nThe phone in her apartment wasn't working?\n\nSahwit:\nYes. I mean, no, no it wasn't. Right.\n\nPhoenix:\nBut you said you didn't go into the apartment... or did you!?\n\nSahwit:\nOh, oh, that? I can explain that! There was a cordless phone on a shelf in the entranceway. I reached inside and tried using that to call...\n\nPayne:\nAnd the phone wasn't working, correct? What happened next?"
      },
      {
        "testimony": "I went to a nearby park and found a public phone.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nWhy use a public phone?\n\nSahwit:\nWell, you see, I don't have a cell phone. And, being the middle of the afternoon, there was no answer at the nearby apartments.\n\nPhoenix:\nAh, right... what time did you call again?"
      },
      {
        "testimony": "I remember the time exactly: It was 1:00 PM.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\n1:00 PM! Are you certain?\n\nSahwit:\nYes. Absolutely.\n\nPhoenix:\n(Hmm... He seems really confident.)\n\nMia:\n1:00 PM? Wright. Doesn't that seem strange to you? Present some evidence to contradict him!",
		"correct_present": ["Cindy's Autopsy Report"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "The man who ran was, without a doubt, the defendant sitting right over there.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nAre you absolutely, 100% positive?\n\nSahwit:\nYes, it was him. No mistake about it.\n\nPayne:\nThe witness says he's certain!"
      }
    ]
  },
  "6":{
    "context": "Phoenix:\nYou found the body at 1:00 PM. You're sure?\n\nSahwit:\nYes. It was 1:00 PM, for certain.\n\nPhoenix:\nFrankly, I find that hard to believe! Your statement directly contradicts the autopsy report. The autopsy notes the time of death at sometime after 4PM. There was nobody to... er... no 'body' to find at 1:00 PM! How do you explain this three-hour gap?\n\nSahwit:\n!!! Oh, that! Oh, er...\n\nPayne:\nObjection\n\nPayne:\nThis is trivial! The witness merely forgot the time!\n\nJudge:\nAfter his testimony, I find that hard to believe. Mr. Sahwit... Why were you so certain that you found the body at 1:00 PM?\n\nSahwit:\nI.. er... well, I... Gee, that's a really good question!\n\nMia:\nGreat job, Wright! Way to put him on the spot! That's all you have to do: point out contradictions! Lies always beget more lies! See through one, and their whole story falls apart!\n\nSahwit:\nWait! I remember now!\n\nJudge:\nWould you care to give your testimony again?\n\nWitness Testimony\n-- The Time of Discovery --\nSahwit:\nYou see, when I found the body, I heard the time.\nThere was a voice saying the time... It was probably coming from the television.\nOh, but it was three hours off, wasn't it?\nI guess the victim must have been watching a video of a taped program!\nThat's why I thought it was 1:00 PM!\nTerribly sorry about the misunderstanding...\n\nJudge:\nHmm... I see. You heard a voice saying the time on a taped program. Mr. Wright, you may cross-examine the witness.\n\nMia:\nWright! You know what to do!\n\nPhoenix:\nI've got this one.",
    "category": "cross_examination",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "testimonies": [
      {
        "testimony": "You see, when I found the body, I heard the time.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nYou said 'heard'... Not 'saw'?\n\nSahwit:\nYes, heard. All I saw was the body lying there... I didn't think to look at anything else, least of all my watch.\n\nPhoenix:\nHmm... Isn't that a little strange? So you're saying you 'heard' something. But if you were so shocked by the body, you wouldn't hear anything at all!\n\nPayne:\nObjection\n\nPayne:\nThe witness did say he actually heard the time. It's ludicrous to suggest he 'wouldn't hear anything'!\n\nJudge:\nHmm... I have to agree with the prosecution. Witness, continue your testimony.",
		"correct_present": ["Blackout Record"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "There was a voice saying the time... It was probably coming from the television.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nAre you sure it was a television and not... a radio?\n\nSahwit:\nWell, no, I guess it might have been a radio.\n\nPayne:\nIncidentally, there was no radio on the premises. There was only one large television.\n\nMia:\nWright! I can't put my finger on it, but something about this seems fishy. Something about 'hearing' the television...\n\nPayne:\nThe witness has testified. He heard the time.",
		"correct_present": ["Blackout Record"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "Oh, but it was three hours off, wasn't it?",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nHow do you explain the gap!\n\nJudge:\nWell, witness? Can you explain this?",
		"correct_present": ["Blackout Record"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "I guess the victim must have been watching a video of a taped program!",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nA.. video?\n\nSahwit:\nYes, that would explain why the time was wrong!\n\nPhoenix:\nTrue, true...\n\nMia:\nWright! I think the problem lies someplace else...\n\nJudge:\nWe're agreed that you heard the time at the scene, then.",
		"correct_present": ["Blackout Record"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "That's why I thought it was 1:00 PM!",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nAre you sure the voice you heard said it was 1:00 PM?\n\nSahwit:\nYes, I can practically hear it now. It was quite clear.\n\nJudge:\nMr. Payne, has the prosecution verified this testimony?\n\nPayne:\nMy apologies, Your Honor. I, too, have only just learned that the witness 'heard' the time.\n\nSahwit:\nOh, I'm really sorry. I only remembered it just now.",
		"correct_present": ["Blackout Record"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "Terribly sorry about the misunderstanding...",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nWell, you just watch it! (Hmm... Not much point pressing him on that one, was there?)"
      }
    ]
  },
  "7":{
    "context": "Phoenix:\nHold it right there! The prosecution has said there was a blackout at the time of the discovery! And this record proves it!\n\nSahwit:\n...!\n\nPhoenix:\nYou couldn't have heard a television... or a video!\n\nSahwit:\nGah!!! I... well... urk!\n\nJudge:\nThe defense has a point. Do you have an explanation for this, Mr. Sahwit?\n\nSahwit:\nNo, I... I find it quite puzzling myself! Quite! ... Aah! W-wait! I remember now!\n\nJudge:\nMr. Sahwit? The court would prefer to hear an accurate testimony from the very beginning. These constant corrections are harming your credibility. That, and you seem rather... distraught.\n\nSahwit:\n...! M-my apologies, Your Honor! It... er, it must have been the shock of finding the body!\n\nJudge:\nVery well, Mr. Sahwit. Let's hear your testimony once more please.\n\nWitness Testimony\n-- Hearing the Time --\nSahwit:\nActually, I didn't 'hear' the time... I 'saw' it!\nThere was a table clock in the apartment, wasn't there!\nYeah, the murder weapon! The killer used it to hit the victim!\nThat must have been what I saw.\n\nJudge:\nYou saw a clock? I guess that would explain it. The defense may cross-examine the witness.\n\nPhoenix:\nGladly.\n\n",
    "category": "cross_examination",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "testimonies": [
      {
        "testimony": "Actually, I didn't 'hear' the time... I 'saw' it!",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nThat strikes me as a very suspicious mistake.\n\nSahwit:\nYes, I can see how you'd be a little doubtful... I'm really sorry. I only just remembered that table clock!\n\nJudge:\nA 'table clock'?"
      },
      {
        "testimony": "There was a table clock in the apartment, wasn't there!",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nA 'table clock'? Was there a clock at the scene?\n\nJudge:\nThis is the first I've heard of it!",
		"correct_present": ["Statue"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "Yeah, the murder weapon! The killer used it to hit the victim!",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nThe... murder weapon?\n\nSahwit:\nYes, the table clock that was used as a weapon! That's what I just said. Did you doze off in the middle of my testimony or something?\n\nPhoenix:\n(Something's fishy here...)",
		"correct_present": ["Statue"],
		"present_response": "Phoenix:\nObjection!"
      },
      {
        "testimony": "That must have been what I saw.",
        "critical_press": 0,
        "press_response": "Phoenix:\nHoldit\n\nPhoenix:\nWhy didn't you tell us that in the first place?\n\nSahwit:\nI guess it just slipped my mind! I'm not really sure how it happened myself...\n\nPayne:\nThe witness says he saw the table clock. End of story.",
		"correct_present": ["Statue"],
		"present_response": "Phoenix:\nObjection!"
      }
    ]
  },
  "8":{
    "context": "Phoenix:\nWait just a moment! The murder weapon wasn't a clock. It was this statue! Now how is this supposed to be a clock?\n\nSahwit:\nWhaa!? Y-you with your 'objections,' and your 'evidence'... Just who do you think you are!?\n\nPhoenix:\nJust answer the question, Mr. Sahwit.\n\nSahwit:\nHey, I... I saw it there, okay! That's a clock!\n\nPayne:\nYour Honor! If I may...\n\nJudge:\nYes, Mr. Payne?\n\nPayne:\nAs the witness stated, this statue is indeed a clock. The neck is a switch. You just tilt it, and it says the time out loud. As it doesn't look like a clock, I submitted it as a statue. My apologies.\n\nJudge:\nI see. So the murder weapon was a table clock after all. Well, Mr. Wright? It appears that the witness's testimony was correct. This is a clock. Do you have any problems with his testimony now?",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "No",
        "is_correct": 1, 
        "response": "Phoenix:\nI guess not. There was a clock on the scene, so, no problem.\n\nMia:\nWright! Are you out of your mind!? That clock doesn't look like a clock at all! The witness couldn't have possibly known it was a clock just by seeing it! He said himself, he never entered the apartment! It was in his testimony!\n\nPhoenix:\nHey! You're right!\n\nJudge:\nIs something the matter? Does the defense have anything to add?\n\nPhoenix:\nYes... Yes I do!"
      },
      {
        "choice": "Yes",
        "is_correct": 1, 
        "response": "Phoenix:\nYour Honor, there is a gaping hole in the witness's testimony!"
      }
    ]
  },
  "9":{
    "context": "Phoenix:\nThe only way he could have known the weapon was a clock is to hold it in his hand. Yet the witness testified that he never entered the apartment! Clearly, a contradiction!\n\nJudge:\nHmm... indeed!\n\nPhoenix:\nThe witness knew it was a clock, because he...",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Went into the apartment",
        "is_correct": 1, 
        "response": ""
      },
      {
        "choice": "Knew the victim",
        "is_correct": 0, 
        "response": "Phoenix:\nTell me, isn't it true that you knew the victim? In fact, you were one of her 'sugar daddies'! Be frank with us, Mr. Sahwit!\n\nSahwit:\nHmph. 'Frank'? I'm always 'Frank'!\n\nPayne:\nYour Honor. We have complete records of the victim's relationships. Mr. Frank Sahwit does not appear anywhere.\n\nPhoenix:\nHuh? Oh, really?\n\nJudge:\nPlease, Mr. Wright... Is 'Huh' the best response you can muster up? Try to refrain from making off-the-cuff accusations in the future.\n\nPhoenix:\nY-yes, Your Honor. Let me think this over.\nThe witness knew it was a clock, because he..."
      }
    ]
  },
  "10":{
    "context": "Phoenix:\nYou're lying! You were inside the apartment on the day of the murder!\n\nSahwit:\nOh yeah? Prove it! Prove I went in there!\n\nPhoenix:\nI'll do better than that! I can prove you were the one who killed her! You struck her with the clock, and the shock of the blow triggered the clock's voice! That was the sound you heard!\n\nJudge:\nOrder in the court! Intriguing. Please continue, Mr. Wright.\n\nPhoenix:\nYes, Your Honor. Mr. Sahwit. The sound must have left quite an impression on you. Understandable, since the murder weapon spoke just as you hit the victim! That voice was burned into your mind. That's why you were so certain about the time!\n\nPayne:\nObjection\n\nPayne:\nW-w-what's the meaning of this? This is all baseless conjecture!\n\nPhoenix:\nBaseless...? Just look at the witness's face!\n\nSahwit:\nNgh... grrrah!\n\nJudge:\nWould the witness care to elaborate? Did you strike the victim with the clock?\n\nSahwit:\nI... I...! That... that day... I... I never! Look... I... the clock... I heard, no! I mean, I saw...Saw... nggg! Gwaaaaaaaaaaaaah! Shutupshutupshutup! I hate you! I-it was him, I tell you! I saw him! H-he killed her and he should burn! Burn! Give him death!\n\nJudge:\nOrder! Order in the court I say!\n\nPayne:\nYour Honor, a-a moment please! There isn't a shred of evidence supporting the defense's claims!\n\nJudge:\nMr. Wright!\n\nPhoenix:\nYour Honor?\n\nJudge:\nYou claim the sound the witness heard came from the clock... Do you have any evidence?\n\nPhoenix:\n(The whole case is riding on this! I'd better think it through carefully!) Yes, Your Honor. The sound Mr. Sahwit heard was definitely this clock. A fact which is clear if you simply...",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Examine the clock's batteries",
        "is_correct": 0, 
        "response": "Phoenix:\nAll you have to do is examine the batteries!\n\nJudge:\nIndeed? The batteries are... in the right way. The clock seems to be working fine. What exactly did you mean, Mr. Wright?\n\nPhoenix:\nYes, the clock was working fine!\n\nPayne:\nYes, and...?\n\nPhoenix:\n... Umm, I'm sorry, I think I got confused back there with all those testimonies.\n\nJudge:\nMr. Wright! I expect more from a lawyer in this court. Even if it is your first day. I'm afraid I have to penalize you! Try to think things through more carefully.\n\nPhoenix:\nY-yes, Your Honor. As I was saying...\n(The whole case is riding on this! I'd better think it through carefully!) Yes, Your Honor. The sound Mr. Sahwit heard was definitely this clock. A fact which is clear if you simply..."
      },
      {
        "choice": "Ask the neighbors",
        "is_correct": 0, 
        "response": "Phoenix:\nAll you have to do is talk to the victim's neighbors!\n\nJudge:\nTalk to the neighbors...?\n\nPhoenix:\nI'm sure one of them heard the clock tell the time when the incident occurred!\n\nJudge:\nI see... Does the prosecution have anything to say, Mr. Payne?\n\nPayne:\nWe have already made all the necessary inquiries. Everyone living near the victim's apartment was out at the time of the murder. Furthermore, even if a neighbor had heard the clock, that would not prove that Mr. Sahwit had heard anything.\n\nJudge:\nHmm... That is true. I believe you may be wrong, Mr. Wright. You'll receive a penalty for that, unfortunately.\n\nPhoenix:\nI-I'm sorry, Your Honor! Let me think about it again!\n(The whole case is riding on this! I'd better think it through carefully!) Yes, Your Honor. The sound Mr. Sahwit heard was definitely this clock. A fact which is clear if you simply..."
      },
      {
        "choice": "Try sounding the clock",
        "is_correct": 1, 
        "response": ""
      }
    ]
  },
  "11":{
    "context": "Phoenix:\nLet's sound the clock now, here in this court. Your Honor, may I have the clock? I ask the court to listen very carefully...\n\n...*beep*...\n[I think it's 8:25.]\n\nJudge:\nThat certainly is a strange way to announce the time.\n\nPhoenix:\nWell, he is 'The Thinker,' after all.\n\nJudge:\nSo, we've heard the clock. What are your conclusions, Mr. Wright?\n\nPhoenix:\nMr. Payne... can you tell me what time it is now?\n\nPayne:\nIt's 11:25... Ack!\n\nPhoenix:\nAs you can see, this clock is exactly three hours slow! Precisely the discrepancy between what Mr. Sahwit heard and the actual time of death! So, Mr. Sahwit... Try to talk your way out of this one!\n\nSahwit:\n... ...Hah! Hah hah! You forgot one thing!\n\nPhoenix:\n(Uh oh... what's he talking about...?)\n\nSahwit:\nWhile it may seem like that clock IS running three hours slow... It proves nothing! How do you know it was running three days slow on the day of the murder!? If you can't prove that, you don't have a case!\n\nPhoenix:\n...! (He's right! How am I going to prove that!? Dammit! I was so close!)\n\nJudge:\nMr. Wright? It seems you lack the critical evidence to support your claim.\n\nPhoenix:\n...! Yes, Your Honor.\n\nJudge:\nThis means I cannot let you indict the witness. Unfortunately... This ends the cross-examination of Mr. Frank Sahwit.\n\nSahwit:\nI come all the way down here to testify, and look what happens! You treat me like a criminal! A criminal! You lawyers are all slime!\n\nPhoenix:\n(Grr! I almost had him! Sorry, Larry... I failed you. There's nothing I can do about it now...)\n\nMia:\nNot so fast, Mr. Sahwit!\n\nPhoenix:\nMia! I mean, Chief!\n\nMia:\nListen up, Wright! Don't throw this one away, not like this! Think!\n\nPhoenix:\nBut, Chief, it's over. I can't prove the clock was slow the day of the murder! Nobody can prove that!\n\nMia:\nUm... well, yes. But that doesn't mean you can't still win! Try thinking out of the box! Don't waste time doubting the facts. Assume the clock was three hours slow and... Think through it! Ask yourself, 'Why was the clock three hours slow'? Figure out the reason, and you'll have your proof! Right, Wright? Can you think of a reason as to why the clock would be three hours slow?",
    "category": "multiple_choice",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "choices": [
      {
        "choice": "Yes",
        "is_correct": 1, 
        "response": "Phoenix:\n... Wait! Maybe I can prove it!\n\nMia:\nYou must have evidence somewhere that can prove it, Wright! Find it and let them have it!\n\nJudge:\nWell, Mr. Wright? You say the clock was already running slow on the day of the murder... Have you found evidence to support this claim?\n\nPhoenix:\nOf course. There is a piece of evidence in the Court Record that can prove my claim beyond a doubt!\n\nSahwit:\nHah! Tough words! Let's see you pull this one off!"
      },
      {
        "choice": "No",
        "is_correct": 1, 
        "response": "Phoenix:\nH-how am I supposed to know that!?\n\nMia:\nI know you can figure it out! There must be some evidence in the Court Record... Something that can show why that clock was three hours slow! Find it, and he won't have a foot to stand on!\n\nJudge:\nMr. Wright?\n\nPhoenix:\nY-y-yes, Your Honor!\n\nJudge:\nYou say the clock was already running slow on the day of the murder... Do you have evidence to prove this?\n\nPhoenix:\n(This is it... all or nothing!) Yes, Your Honor. I believe I have the evidence that can prove my claim!\n\nSahwit:\nHah hah! I'd like to see THAT!"
      }
    ]
  },
  "12":{
    "context": "Judge:\nLet's see this evidence that proves why the clock was running slow!",
    "category": "present",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "present": 
	  {
		"correct_present": ["Passport"],
		"correct_present_response": "Phoenix:\nTakethat",
		"wrong_present_response": "Phoenix:\nTakethat\n\nJudge:\nUm, excuse me. This proves your claim... how? I can't see what that evidence has to do with the clock.\n\nPhoenix:\n(D'oh! That wasn't it!) One more chance... Give me just one more chance!\n\nJudge:\nAlright, Mr. Wright, but time is not on your side. Be quick about it."
	  }
  },
  "13":{
    "context": "Phoenix:\nThe victim had just returned home from abroad the day before the murder. As we all know, the time difference between here and Paris is nine hours! When it's 4:00 PM here, it's 1:00 AM the next day there. The clock wasn't three hours slow, it was nine hours fast! The victim hadn't reset her clock since returning home! That's why the time you heard when you struck her dead in her apartment was wrong! Proof enough for you, Mr. Sahwit? Or should I say... Mr. Did It!\n\nSahwit:\nNgh! ...!\n\nJudge:\nO-order! Order, I say!\n\nJudge:\nWell... This case has certainly turned out differently than we all expected. Mr. Payne... your witness?\n\nPayne:\nHe... er... he was arrested and has been taken away, Your Honor.\n\nJudge:\nVery well. Mr. Wright?\n\nPhoenix:\nYes, Your Honor.\n\nJudge:\nI have to say, I'm impressed. I don't think I've ever seen someone complete a defense so quickly... and find the true culprit at the same time!\n\nPhoenix:\nThank you, Your Honor.\n\nJudge:\nAt this point, this is only a formality, but... This court finds the defendant, Mr. Larry Butz...\n\nNot Guilty\n\nJudge:\nAnd with that... The court is adjourned.\n\nPhoenix:\nIt turns out that Frank Sahwit was a common burglar! He posed as a newspaper sales-man to check and see when people were out of the house! That day... When Larry went to her apartment, the victim wasn't home. After he left, Mr. Sahwit let himself in to do his dirty work! While he was searching her place, the victim returned! Flustered, Mr. Sahwit grabbed the nearest blunt object he could find...\n\nAugust 3, 2:32 PM\nDistrict Court\nDefendant Lobby No. 2\n\nPhoenix:\n(Whew... I still can't believe we won!)\n\nMia:\nWright! Good job in there! Congratulations!\n\nPhoenix:\nTh-thanks, Chief. I owe it all to you.\n\nMia:\nNot at all, not at all! You fought your own battles in there. It's been a while since I've seen a trial end on such a satisfying note!\n\nPhoenix:\n(I've never seen the chief looking this happy... If she's this glad, imagine how Larry must feel!)\n\nButz:\nMy life is over...\n\nPhoenix:\nLarry! You're supposed to be happy! What's wrong now!?\n\nButz:\nAww, Nick... Don't worry 'bout me! I'll be dead and gone soon!\n\nPhoenix:\nGood! Wait, no! I mean... Bad! Bad bad bad! Larry, you're innocent! The case is closed.\n\nButz:\n... But... but my Cindy-windy's gone, man! Gone forever!\n\nPhoenix:\n(Larry, she was a... Nah... Never mind.)\n\nMia:\nCongratulations, Harry!\n\nButz:\nH-Harry...?\n\nMia:\nYes, you! I can practically see the headlines now: 'Harry Butz, Innocent!'\n\nButz:\nHeh... um... thanks! I really owe you one. I won't forget this, ever! Let's celebrate! Dinner? Movie? My treat!\n\nMia:\nOh, no, I couldn't.\n\nPhoenix:\n(Hey, I was the one who got you off the hook!)\n\nButz:\nOh, hey! H-here, take this! It's a present!\n\nMia:\nA present? For me? Wait... Wasn't this the evidence that...\n\nButz:\nActually, I made this clock for her! I made one for her and one for me.\n\nMia:\nR-really? You? You made this? ... Well, thank you. I'll keep it as a memento.\n\nButz:\nYo, Nick... Can you believe it? I was so into that chick... And... and she was just playing me for a fool! Don't that make you wanna just cry? *sob*\n\nPhoenix:\nLarry...\n\nMia:\n... Are you so sure?\n\nButz:\nEx-squeeze me?\n\nMia:\nI think she thought quite a lot of you, in her own way.\n\nButz:\nNah, you don't gotta sympathize with me, 'sokay.\n\nMia:\nOh, I'm not just sympathizing, really. Isn't that right, Wright? Don't you have something to show your friend? Something that proves how she felt about him?\n\nPhoenix:\nH-huh? Oh, yeah, right! (What the heck is she talking about?)",
    "category": "present",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "present": 
	  {
		"correct_present": ["Statue"],
		"correct_present_response": "Phoenix:\nTakethat\n\nPhoenix:\nCheck this out, Larry. Proof Positive you weren't just some chump to her.\n\nButz:\nHuh...? What about that clock?\n\nPhoenix:\nThis is the clock YOU made for her, Larry! And she took it with her when she traveled.\n\nButz:\nWhatever. She probably just needed a clock, that's all.\n\nPhoenix:\nYou think so? It's a pretty heavy clock to take traveling.\n\nButz:\n...\n\nPhoenix:\nWell, make of it what you will.\n\nButz:\n... Hey, Nick. I'm glad I asked you to be my lawyer. Really, I am. Thanks.\n\nPhoenix:\n(Hope that made him feel a little better...)",
		"wrong_present_response": "Phoenix:\nTakethat\n\nPhoenix:\nHere you go, Larry. Proof.\n\nButz:\n... Eh... heh heh? It's okay, Nick. Don't worry about me. I'll forget about her soon enough. Look, I'm gonna head home. Thanks a ton, eh?\n\nPhoenix:\n(Guess that wasn't the right thing to show him...)"
	  }
  },
  "14":{
    "context": "Mia:\nWright? I hope you see the importance of evidence now. Also, hopefully you realize, things change depending on how you look at them. People, too. We never really know if our clients are guilty or innocent. All we can do is believe in them. And in order to believe in them, you have to believe in yourself. Wright... Listen. Learn. Grow strong. Never let go of what you believe in. Never.\n\nMia:\nWell, I think our work here is done! Shall we be off?\n\nPhoenix:\nYeah, I guess so!\n\nMia:\nSay, how about dinner. On me? We'll drink a toast to innocent Butz!\n\nPhoenix:\nYeah!\n\nMia:\nOh, speaking of Harry... You were saying part of why you became a lawyer was because of him.\n\nPhoenix:\nEr, yeah. Part, at least.\n\nMia:\nYou'll have to tell me more about it sometime! Maybe... over drinks?\n\nPhoenix:\nAnd so, my first trial came to a close. Larry slapped me on the back and said, 'Gee, Nick, it's good to have friends!' But I'm pretty sure he's not going to pay us. Unless you count the clock he gave Mia. ... I didn't know it then... but that clock was soon going to be at the center of another incident. And my promise to tell the chief about me and Larry... would be one promise that I wouldn't be able to keep.",
    "category": "fin",
    "court_record": {
      "add": {
        "objects": [],
        "people": []
      },
      "modify": {
        "objects": [],
        "people": []
      }
    },
    "actions": []
  }
}