{
  "previousContext": "",
  "characters": [
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Mia Fey",
      "age": "27",
      "gender": "Female",
      "description1": "Chief Attorney at Fey & Co.. My boss, and a very good defense attorney.",
      "description2": "The victim. Chief attorney at Fey & Co. Law Offices, and an excellent defense lawyer."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Maya Fey",
      "age": "17",
      "gender": "Female",
      "description1": "Mia's little sister. Found bent over her sister's body, crying.",
      "description2": "The defendant. Mia's little sister, and a spirit medium in training.",
      "description3": "Mia's little sister. Currently training to become a spirit medium."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Dick Gumshoe",
      "age": "30",
      "gender": "Male",
      "description1": "Detective at the local precinct. In charge of the initial investigation."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Miles Edgeworth",
      "age": "24",
      "gender": "Male",
      "description1": "A gifted prosecutor, and a ruthless man who'd do anything to get a \"guilty\" verdict."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "April May",
      "age": "23",
      "gender": "Female",
      "description1": "An eye witness to the events. Testifies that she saw Maya commit the murder.",
      "description2": "Stayed with someone else in the hotel on the night of the murder. Tapped Mia's phone."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Marvin Grossberg",
      "age": "64",
      "gender": "Male",
      "description1": "A veteran defense attorney, and Mia's mentor."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Bellboy",
      "age": "26",
      "gender": "Male",
      "description1": "Bellboy at the Gatewater Hotel.",
      "description2": "Delivered room service to Miss May at the time of the murder. Also checked her in."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Redd White",
      "age": "39",
      "gender": "Male",
      "description1": "An eye witness. CEO of the information gathering company, Bluecorp."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "No one would believe I was a defense attorney if I didn't carry this."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "The Thinker",
      "type": "Weapons",
      "obtained": "Retrieved at Fey Law Office.",
      "description1": "The murder weapon. Looks like a statue, but it's actually a clock. Made by Larry Butz.",
      "description2": "Clock in the form of a statue. The clock's gears have been removed. Made by Larry Butz."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Glass Shards",
      "type": "Evidence",
      "obtained": "Retrieved at Fey Law Office.",
      "description1": "The broken remains of a glass light stand. Broken beyond all recognition."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Receipt",
      "type": "Evidence",
      "obtained": "Retrieved at Fey Law Office.",
      "description1": "A department store receipt with letters written in blood on the back.",
      "description2": "Receipt for a glass light stand. The date of purchase is the day before the murder."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Maya's Memo",
      "type": "Documents",
      "obtained": "Received from Maya Fey.",
      "description1": "\"A conversation I had with my sister is recorded on my cell phone.\""
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Mia's Autopsy Report",
      "type": "Reports",
      "obtained": "Received from Detective Dick Gumshoe.",
      "description1": "Time of death: 9/5 at 9:00PM. Cause: single blunt force trauma. Death was instantaneous.",
      "description2": "Died from a blow by a blunt object. May have lived for a few minutes after being hit."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Maya's Cell Phone",
      "type": "Other",
      "obtained": "Received from Detective Dick Gumshoe.",
      "description1": "Holds a conversation between the Chief and Maya. Click here for details."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Wiretap",
      "type": "Evidence",
      "obtained": "Retrieved at Gatewater Hotel.",
      "description1": "Found in Miss May's hotel room."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Floor Plans",
      "type": "Maps",
      "obtained": "Submitted as evidence during the trial.",
      "description1": "The murder scene, the Fey & Co. Law Offices. Click here for details."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "May Testimony",
      "type": "Documents",
      "obtained": "Received from Miss April May.",
      "description1": "\"The victim dodged an attack then ran to the right, but she was caught and struck.\""
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Photograph",
      "type": "Photographs",
      "obtained": "Retrieved at Grossberg Law Offices.",
      "description1": "On the back the words \"DL-6 Incident - Exhibit A\" are written in pencil."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Photograph",
      "type": "Photographs",
      "obtained": "Retrieved at Grossberg Law Offices.",
      "description1": "On the back the words \"DL-6 Incident - Exhibit B\" are written in pencil."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Bellboy's Affidavit",
      "type": "Documents",
      "obtained": "Received from the bellboy.",
      "description1": "Describes the man who stayed with Miss May in the hotel on the night of the murder."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Newspaper Clipping",
      "type": "Other",
      "obtained": "Retrieved at Fey Law Office.",
      "description1": "Article about politician's suicide. The word \"White\" is written in pen at the top."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Mia's Memo",
      "type": "Documents",
      "obtained": "Received from Mia Fey.",
      "description1": "A list of people's names in Mia's handwriting."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "Turnabout Sisters\n\n\n\n\n\n\n\n\n\nTranscript\n\nTranscript (JP)Part 1\n\nPart 2\n\nPart 3\n\nPart 4September 9, 9:52 AMDistrict CourtDefendant Lobby No. 1Maya:\nWell... I guess this is it!Phoenix:\nYeah. One way or another, this case gets decided today.Maya:\nAaa! Ph-Phoenix! Look!Phoenix:\n(...! Prosecutor... Edgeworth.)Edgeworth:\nI received a call from the public prosecutor's office yesterday.Phoenix:\n?Edgeworth:\nHe told me that whatever Mr. White says today, it will be the \"absolute truth.\" No matter how you try to attack his testimony... If I raise an objection, I have it on good faith that the judge will listen to me.Phoenix:\n(What, does White have the judge in his pocket, too!?) So... you're saying I'm going to be guilty. End of story?Edgeworth:\n... I will do anything to get my verdict, Mr. Wright. Anything.Maya:\nWhy... Why!? How can you torment an innocent person like this!?Edgeworth:\n\"Innocent\"...? How can we know that? The guilty will always lie, to avoid being found out. There's no way to tell who is guilty and who is innocent! All that I can hope to do is get every defendant declared \"guilty\"! So I make that my policy.Phoenix:\nEdgeworth... You've changed.Maya:\nHmm? Phoenix! You know him!?Edgeworth:\nDon't expect any special treatment, Phoenix Wright.Maya:\nPh-Phoenix...?Phoenix:\nWell... court will be starting soon. (Changed from [Well... court will be opening for session soon.] in the original release)Maya:\nWhat? But wait! Your defense attorney isn't even here yet! They're not... (Changed from [Your defense attorney isn't even here yet! He's not...] in the original release)Phoenix:\nI'll be defending myself.Maya:\nWhaaaat!?Phoenix:\nOkay, let's do this.September 9, 10:00 AMDistrict CourtCourtroom No. 1Judge:\nThe court is now in session for the trial of Mr. Phoenix Wright.Edgeworth:\nThe prosecution is ready, Your Honor.Phoenix:\nThe defense is ready, Your Honor.Judge:\nMr. Wright... Are you sure you're up to doing this?Phoenix:\nYes, Your Honor. I will be defending myself.Judge:\nUnderstood. Very well. Mr. Edgeworth, your opening statement, please.Edgeworth:\nAs the details of the event are already quite clear to the court, today we will hear the testimony of a witness to the defendant's crime. (Changed from [today we will hear the testimony of another witness to the defendant's crime.] in the original release)Judge:\nI see. The prosecution may call its witness.Phoenix:\n(That went far too smoothly! Why didn't the judge ask Edgeworth why his witness didn't testify before!? It's like... it's like he already knows why! Hmm. If anyone's going to raise an objection about this, I suppose it's me...)Objection\n\n\n\n\n\n\n\nPhoenix:\nMr. Edgeworth, you owe an explanation to the court! Why didn't this witness testify in the trial against Ms. Maya Fey!?\nEdgeworth:\nHmph. I'm ever so sorry! Mr. White is a busy man, and besides... at the time, I thought that Ms. May's opinion was all that would be needed. Again, my sincerest apologies to the court.\nJudge:\nExcellent, Mr. Edgeworth. I appreciate your demeanor.\nEdgeworth:\n...\nPhoenix:\n(Great. He gets to show off and I get nowhere.)\nLeads to:\n\"I would like to call Mr. Redd White to the stand!\"Let it go\n\n\n\n\n\n\n\nPhoenix:\n(Forget it. I smell a trap.)\nLeads to:\n\"I would like to call Mr. Redd White to the stand!\"Edgeworth:\nI would like to call Mr. Redd White to the stand!Edgeworth:\nPlease state your full name.White:\nYou wish to know the title of my personage?Edgeworth:\nEr... your name?White:\nYes! That is what I said! Oh dear, do my locutions confuse?Edgeworth:\nName!Phoenix:\n(These two are great together...)White:\nMy name is Redd White. But my friends call me Blanco Nino. I am the CEO, or to use a more common term, the President, of Bluecorp.Edgeworth:\nDid you know the victim, Ms. Mia Fey?White:\nThat would be a negatory! No, I did not.Edgeworth:\n... You were at the Gatewater Hotel the night of the murder?White:\nCorrect.Edgeworth:\nAnd you witnessed the murder from there?White:\nAhem. Why tell you what you already know?Judge:\nVery well, Mr. White. You may begin your testimony.Phoenix:\n(If I can't rip this guy's testimony apart, I'm done for. Why do I always feel like it's the end of the world and I'm the last man standing?)White:\nHo hoh hoh. I hope you have made your peace with God, Mr. Lawyer!Phoenix:\n...!Maya:\nLet him have it, Phoenix!Witness Testimony-- Witness's Account --White:\nLet's see, it was about 9:00, I believe.\nI was quietly perusifying... er, that's \"reading\" to you, some papers by the window.\nThen I heard a bedlam coming from outside!\nSurprised, I turned to look at the building across the way.\nIt was then I saw him: a spiky-haired man attacking a woman with long hair!\nNeedless to say that man was none other than you, Mr. Lawyer!\nI called Miss May over at once. She, too, was flabbergasted of course.\nThe victim, she... she ran away, but you gave chase!\nFinally there was a terrible impaction! Then it was all over...Judge:\nHmm... If things occurred as you testify, then I'm afraid the defendant is guilty. Very well, defendant... er, I mean, Mr. Wright. Your cross-examination...Phoenix:\nYes, Your Honor.Cross Examination",
      "testimonies": [
        {
          "testimony": "Let's see, it was about 9:00, I believe.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "I was quietly perusifying... er, that's \"reading\" to you, some papers by the window.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "Then I heard a bedlam coming from outside!",
          "person": "White",
          "present": []
        },
        {
          "testimony": "Surprised, I turned to look at the building across the way.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "It was then I saw him: a spiky-haired man attacking a woman with long hair!",
          "person": "White",
          "present": []
        },
        {
          "testimony": "Needless to say that man was none other than you, Mr. Lawyer!",
          "person": "White",
          "present": []
        },
        {
          "testimony": "I called Miss May over at once. She, too, was surprised of course.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "The victim, she... she ran away, but you gave chase!",
          "person": "White",
          "present": []
        },
        {
          "testimony": "The victim ran to the left, and you gave chase!",
          "person": "White",
          "present": [
            "May Testimony"
          ],
          "source": {
            "evidence_span": "The victim dodged an attack then ran to the right",
            "testimony_span": "The victim ran to the left",
            "explanation": "The direction to which the victim ran in the witness' testimony contradicts a previous testimony.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "Finally there was a terrible impaction! Then it was all over...",
          "person": "White",
          "present": []
        }
      ],
      "noPresent": false,
      "difficulty": "easy",
      "is_self_contained": "yes"
    },
    {
      "category": "cross_examination",
      "newContext": "-- Witness's Account --White:\nLet's see, it was about 9:00, I believe.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHow do you know what time it was?\nWhite:\nBecause I am always abso-posi-lutely perfect, you know?\nPhoenix:\nNo no no, you're not getting away with that!\nWhite:\nYou are so mistrusting, Mr. Lawyer! So... what was the proper term for \"secretary\" again...? Anyway, Miss May ordered room service for 9:00. It happened soon after the room service arrived.\nPhoenix:\n(Hmm. That's what Miss May said, too.)\n\n\n\nPress further\n\n\n\n\n\n\n\nPhoenix:\nTrue, the bellboy who brought the coffee saw Miss May. But he testified that he did not see you at the time!\nWhite:\nAhem. This is your concern? Silly Lawyer! Miss May received the coffee outside the room! Of course he could not see me. He would need X-ray vision to pull off something like that!\nPhoenix:\n(Hmm...)\nEdgeworth:\nTell us, what were you doing at the time?\nLeads back to cross-examination\n\n\n\n\nHold back\n\n\n\n\n\n\n\nPhoenix:\n(I don't see anything to gain by attacking him on this point any further.) Okay, what were you doing at the time?\nLeads back to cross-examinationWhite:\nI was quietly perusifying... er, that's \"reading\" to you, some papers by the window.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nBy window, you mean the one directly across from the Fey & Co. Law Office?\nWhite:\nCorrect! That is the only window, you see.\nPhoenix:\nAnd there you were reading... papers?\nWhite:\nCorrect! The Gatewater is a businessman's hotel, and I am a busy man who had business to do!White:\nThen I heard a bedlam coming from outside!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nA \"bedlam\"?\nWhite:\nIt must have been when you attacked, I assume.\nEdgeworth:\nWe see. Continue.White:\nSurprised, I turned to look at the building across the way.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo you were reading your papers until you heard that sound?\nWhite:\nBut of course. I am no snoop, peeping out of windows at night.\nPhoenix:\n(No snoop? Yeah, right! You've made a career out of snooping!)White:\nIt was then I saw him: a spiky-haired man attacking a woman with long hair!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nS-spiky-haired!?White:\nNeedless to say that man was none other than you, Mr. Lawyer!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat you just said directly conflicts with Miss May's testimony! Miss May clearly stated that the assailant looked like a \"girl\"!\nWhite:\nI've always been proud of my eyesight, Mr. Lawyer.\nPhoenix:\nJust what is your eyesight?\nWhite:\nCounting both eyes... 40!\nPhoenix:\n40!? Don't add them together!\nJudge:\nI think the witness is trying to say his eyesight is good.\nPhoenix:\n(Hey, whose side is the judge on, anyway?)\nEdgeworth:\nAnd what did you do then?White:\nI called Miss May over at once. She, too, was surprised of course.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat was Miss May doing at that time?\nWhite:\nShe had just finished watching a soap opera on the TV, and was weeping openly.\nPhoenix:\nDid you know she had been tapping the Fey office phone?\nEdgeworth:\n\nEdgeworth:\nIrrelevant! That has nothing to do with the case at hand.\nWhite:\nI care not. I will answer the lawyer's bold inquiry. Miss May was acting alone when she tapped the phone of this Fey woman.\nPhoenix:\nYou'd make a good politician, Mr. White.\nWhite:\nHo hoh! After all, I am \"El Presidente.\"\nJudge:\nPlease continue.White:\nThe victim, she... she ran away, but you gave chase!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nCan you be a little more detailed about that? I think it's worth knowing exactly what happened.\nWhite:\nOf course! Comprende! I understand! The victim was attacked, by you, and ran to the left. You gave chase, and struck her down!\nEdgeworth:\nAre you sure?\nWhite:\nAs you know, I am always abso-posi-lutely perfect!\nJudge:\nPerhaps you could change your testimony to reflect this new detail.\nChanges statement from \"The victim, she... she ran away, but you gave chase!\" to \"The victim ran to the left, and you gave chase!\"White:\nThe victim ran to the left, and you gave chase!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAre you sure about that?\nWhite:\nHow many times must I say it? I am abso-posi-lutely perfect! End of story!\nPhoenix:\n(How many times must I hear that?)\nMaya:\nPsst! Phoenix! Doesn't something about that strike you as a little odd?Present May Testimony\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Wait right there!\"White:\nFinally there was a terrible impaction! Then it was all over...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nUm... \"impaction\"? Don't you mean just \"impact\"?\nWhite:\nRidiculosity! I think you need to brush up on your language skills!\nPhoenix:\n(On second thought, perhaps I'd better leave the whole language thing alone...)Phoenix:\n(Did Edgeworth \"prep\" this guy, too, I wonder? Anyway, I'd better find a weakness in there...)Phoenix:\nWait right there! Mr. White, you've dug your own grave!White:\nWhat is this!?Phoenix:\nYou said the victim ran to the \"left.\" But that directly contradicts Miss May's testimony! She clearly stated that the victim ran \"right\"!White:\n...! Oh hoh hoh. It is simple. You have misheard her.Phoenix:\nI think not. Look at the floor plans... The killer was here. And the victim, here. If the victim ran to the left, as you claim she did... She would have been running directly away from the door! She would have been running into a dead end! Don't you find that odd?White:\n! Very strange... I did see her run to the left... I did.Maya:\nPhoenix... look at his face. I don't think he's lying about this one.Phoenix:\nTrue. (Maybe he really did see the victim run left...? So he did witness the killing...? Wait a second!)Judge:\nMr. Wright?Phoenix:\nYes, Your Honor?Judge:\nMiss May says \"right,\" and Mr. White says \"left.\" Can you explain this contradiction to the court?Mr. White is right\n\n\n\n\n\n\n\nPhoenix:\nAs Mr. White testified, Mia ran to the left.\nJudge:\nBut... But if that's the case... Why would she run in the opposite direction from the door?\nPhoenix:\nShe did not. She was running towards the door, Your Honor.\nEdgeworth:\nBwah! Now you're the one making a contradiction, Mr. Wright!\nPhoenix:\nNot at all.\nLeads to:\n\"Obviously, the witness was not viewing the crime from the hotel!\"Miss May is right\n\n\n\n\n\n\n\nPhoenix:\nAs Miss May has stated, Mia ran to the right after she was attacked.\nWhite:\nWhat is this? I am not fashioning fabrications, I assure you! That lady ran to the left! I am sure of it!\nPhoenix:\nThen there can be only one explanation.\nEdgeworth:\nEh...? And that is?\nLeads to:\n\"Obviously, the witness was not viewing the crime from the hotel!\"Both are right\n\n\n\n\n\n\n\nPhoenix:\nBoth witnesses are telling the truth. (For once...)\nEdgeworth:\nHah! I doubt it! Er, rather, that does not clear up the contradiction!\nPhoenix:\nThere is one scenario that would explain their conflicting accounts.\nEdgeworth:\nWhat!?\nLeads to:\n\"Obviously, the witness was not viewing the crime from the hotel!\"Phoenix:\nObviously, the witness was not viewing the crime from the hotel!Judge:\nMr. Wright! What do you mean?Edgeworth:\nYes, what do you mean, he was not \"viewing the crime from the hotel\"!? If he was not in the hotel, where could he have been!?Phoenix:\nIn the law offices of Fey & Co., of course! More specifically, he was standing here! (Time to show the court where Mr. White was standing!) (Changed from [Show the court where Mr. White was standing!] in the original release)Present killer's location\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"This is where he was!\"Present victim's location\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThat's where he was!\nEdgeworth:\nM-Mr. Wright! We are not fools! How could he have been exactly where the victim was standing!?\nPhoenix:\n(Oh... oh, right!)\nJudge:\nMr. Wright! What is the meaning of this!?\nPhoenix:\nSorry, Your Honor! Sorry! Let me try that again...\nLeads back to:\n\"Time to the court where Mr. White was standing!\"Present anywhere else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThat's where he was!\nJudge:\nHold it right there, Mr. Wright! If he was there during the very act of murder... That would make him an accomplice!\nEdgeworth:\n\nEdgeworth:\nImpossible! There was no one other than the criminal and victim in the room! There is no evidence, no proof to the contrary! None!\nPhoenix:\nS-sorry! Er... let me try that again!\nLeads back to:\n\"Time to show the court where Mr. White was standing!\"Phoenix:\nThis is where he was! Look! When the victim ran for the door... If he was watching from this point, to him it would appear that she ran to the \"left.\"Edgeworth:\nPlease! This is no time for jokes in ill taste! That is where the killer was standing!Judge:\nOrder! I will have order! Anyone disturbing the order of this courtroom will be held in contempt! Mr. Wright! What are you suggesting!?White:\nR-r-rapscallion!!!Edgeworth:Edgeworth:\nThe postulations of the defense are a distortion of the truth, Your Honor!Judge:\nIndeed. They do seem a bit far-fetched...White:\n... Ho hoh hoh! You provide us with so much entertainment, Mr. Lawyer!Phoenix:\n(What now!? He's... laughing!?)White:\nThe hilarity of the moment made me remember something... It appears I have been unclear, and for this, I apologize. Mr. Your Honor... Might I be allowed to testify once more?Judge:\nVery well, let's hear your revised testimony.Phoenix:\n(Good luck. You can't fix a broken testimony, buddy!)Witness Testimony-- She Ran to the \"Left\" --White:\nMiss May's testimony was correct... as was mine!\nWhen you assaulted the girl, she first ran to the left.\nAnd then you hit her, savagely! That is what I saw.\nNext, with the last of her strength, she ran to the right.\nYou chased her, and delivered the final blow.\nThat is what Miss May saw.\nYou see? You hit her twice!\nDon't you remember, Mr. Lawyer?Judge:\nHmm... That does seem to make sense. Will you be cross-examining the witness's testimony?Phoenix:\nYou bet I will! I mean, yes, Your Honor.Cross Examination",
      "testimonies": [
        {
          "testimony": "Miss May's testimony was correct... as was mine!",
          "person": "White",
          "present": []
        },
        {
          "testimony": "When you assaulted the girl, she first ran to the left.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "And then you hit her, savagely! That is what I saw.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "Next, with the last of her strength, she ran to the right.",
          "person": "White",
          "present": [
            "Mia's Autopsy Report"
          ],
          "source": {
            "evidence_span": "Cause: single blunt force trauma.",
            "testimony_span": "with the last of her strength, she ran to the right",
            "explanation": "The victim was only hit once, not two.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "You chased her, and delivered the final blow.",
          "person": "White",
          "present": [
            "Mia's Autopsy Report"
          ],
          "source": {
            "evidence_span": "Cause: single blunt force trauma.",
            "testimony_span": "delivered the final blow.",
            "explanation": "The victim was only hit once, not two.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "That is what Miss May saw.",
          "person": "White",
          "present": [
            "Mia's Autopsy Report"
          ],
          "source": {
            "evidence_span": "Cause: single blunt force trauma.",
            "testimony_span": "N/A",
            "explanation": "The victim was only hit once, not two.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "You see? You hit her twice!",
          "person": "White",
          "present": [
            "Mia's Autopsy Report"
          ],
          "source": {
            "evidence_span": "Cause: single blunt force trauma.",
            "testimony_span": "You hit her twice!",
            "explanation": "The victim was only hit once, not two.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        }
      ],
      "noPresent": false,
      "difficulty": "easy",
      "is_self_contained": "yes"
    },
    {
      "category": "cross_examination",
      "newContext": "-- She Ran to the \"Left\" --White:\nMiss May's testimony was correct... as was mine!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat do you mean by that!\nWhite:\nThat is what I am about to explain! You Americans, always so impatient! It does not become you.\nPhoenix:\n(Hey buddy, you're an American, too!)White:\nWhen you assaulted the girl, she first ran to the left.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat do you mean \"first\"?\nWhite:\n\"First\"? That is what comes before what happens \"next.\" You do speak English, right? Please, sit back, relax. I will try to use simple words for your benefit. First, she ran to the left, and then...White:\nAnd then you hit her, savagely! That is what I saw.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nI didn't hit anyone!\nWhite:\nNow, now, Mr. Wright. There is no point hiding things from this court.\nPhoenix:\nI'm not hiding anything!\nEdgeworth:\n\nEdgeworth:\nThe prosecution requests that the defense refrain from interrupting the testimony!\nJudge:\nMr. Wright, you have been warned.\nPhoenix:\n(Why's he mad at me!?)White:\nNext, with the last of her strength, she ran to the right.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat do you mean \"next\"!?\nWhite:\n\"Next\" is what comes after \"first.\"\nPhoenix:\nI know that!\nWhite:\nThen that is all you need to know, Mr. Lawyer. As I said, she turned and made a desperate dash to the right.Present Mia's Autopsy Report\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Mr. White!\"White:\nYou chased her, and delivered the final blow.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nStop saying it was me!\nWhite:\nBut, it was you.\nEdgeworth:\n\nEdgeworth:\nMr. Wright! If you claim that it was NOT you, then show us proof!\nPhoenix:\n(Argh! Can I do nothing right? Nothing!?)\nWhite:\nMay I continue?Present Mia's Autopsy Report\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Mr. White!\"White:\nThat is what Miss May saw.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo each of you saw different parts...?\nWhite:\nAbso-posi-lutely! That's right, of course!\nPhoenix:\n(Where did he pick up that annoying phrase...?)\nWhite:\nAnyway, moving along!Present Mia's Autopsy Report\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Mr. White!\"White:\nYou see? You hit her twice!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo were you watching both times?\nWhite:\nI suppose I was. And please excuse me for not testifying to this sooner!Present Mia's Autopsy Report\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Mr. White!\"Maya:\nWhat do you think Phoenix?Phoenix:\nI think we've got him right where we want him! He slipped! Let him laugh for now. I'll soon wipe that smile off his face!Phoenix:\nMr. White! The victim died from a single blow! ([single] was in quotation marks in the original release)White:\n...!Phoenix:\nWhat do you have to say to that?White:\nEr... Erp!Phoenix:\n(Now's my chance to hit him where it counts!) Mr. White. Wasn't it you who told this court you were \"abso-posi-lutely perfect\"?White:\nMmph. I will refrain from using this phrase from now on.Phoenix:\nYour Honor, if you could ask the witness for a new testimony...Edgeworth:Edgeworth:\nThe witness is obviously confused, Your Honor! I would like to request a 10 minute break!Judge:\nYes... yes, quite.Phoenix:Phoenix:\nThe witness is confused because he's lying! I emphatically request that there be no break, Your Honor!(Yeah! We want justice...!)\n(Don't let him get away!)Judge:\nVery well. If the witness would care to revise his testimony...Phoenix:\n(The crowd's on my side! No slipping out of this now, White!)Judge:\nMr. White?White:\nO... okay...Witness Testimony-- The Two Accounts --White:\nUmm, well, see--I looked at the other window when I heard that thing fall.\nThen, the next moment, I saw Miss Mia run to the left!\nThe killer, you, attacked her... but she dodged.\nUmm... and then...\nShe turned, and ran for the door!\nThen you did her in with a single blow! Thwap!Judge:\nHmm. \"Thwap\" indeed. Very well, you may begin the cross-examination.White:\nMr. Your Honor... My stomach, you see, it is hurting...Phoenix:\nDeal with it. This is almost over.White:\n...!Cross Examination",
      "testimonies": [
        {
          "testimony": "Umm, well, see--I looked at the other window when I heard that thing fall.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "A light stand was lying on the floor when I looked.",
          "person": "White",
          "present": [
            "Glass Shards",
            "Floor Plans"
          ],
          "source": {
            "evidence_span": "The stand is not within a visible area looking from the office.",
            "testimony_span": "A light stand was lying on the floor when I looked.",
            "explanation": "The witness could not have seen the light stand, viewing from the office.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "Then, the next moment, I saw Miss Mia run to the left!",
          "person": "White",
          "present": []
        },
        {
          "testimony": "The killer, you, attacked her... but she dodged.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "She turned, and ran for the door!",
          "person": "White",
          "present": []
        },
        {
          "testimony": "Then you did her in with a single blow! Thwap!",
          "person": "White",
          "present": []
        }
      ],
      "noPresent": false,
      "difficulty": "easy",
      "is_self_contained": "yes"
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Two Accounts --White:\nUmm, well, see--I looked at the other window when I heard that thing fall.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou heard \"that thing fall\"? What exactly was \"that thing\"?\nWhite:\nHuh? Oh... oh, that? Umm... the glass light stand!\nPhoenix:\n(Right... the one that had fallen over at the scene.)\nMaya:\nPhoenix! Doesn't something about that strike you as odd?\n\n\n\nYeah, very odd\n\n\n\n\n\n\n\nPhoenix:\n(Yeah, that is odd. I'll press further.) Mr. White.\nWhite:\nHuh? W-what?\nPhoenix:\nYou're saying you saw the glass light stand?\nWhite:\nY-yes.\nPhoenix:\nThen change your testimony to reflect that!\nWhite:\nS-sorry. My bad...\nJudge:\nThe witness will revise his testimony.\nWhite:\nOkay okay. Of course.\nChanges statement from \"Umm, well, see--I looked at the other window when I heard that thing fall.\" to \"A light stand was lying on the floor when I looked.\"\n\n\n\n\nNope\n\n\n\n\n\n\n\nPhoenix:\nHuh? No, not really. Please continue your cross-examination.\nLeads back to cross-examinationWhite:\nA light stand was lying on the floor when I looked.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe \"glass stand was lying on the floor\"? That's the first I've heard of this. Why didn't you tell us about the stand before?\nWhite:\nW-why? Me? W-well... I was instructed not to... wait! One moment! Give me a minute to gather my thoughts. I am so... so confused.\nPhoenix:\n(White's falling apart.)\nEdgeworth:\n\nEdgeworth:\nYour Honor! Please, I ask that you do not allow the witness to be badgered any further!\nJudge:\nM-Mr. Wright. Please refrain from badgering the witness...\nPhoenix:\nYes, Your Honor. (Edgeworth is on the ropes!)\nJudge:\nVery well. The witness may continue his account.Present Glass Shards\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nMr. White. It was impossible for you to have seen the light stand!\nWhite:\nWhaaaat!?\nPhoenix:\nThe stand broke into pieces when it fell!\nWhite:\nOoof!\nPhoenix:\nJust by seeing the broken pieces you would have no idea it was a light stand! So tell me, exactly when was it that you saw the stand? Answer the question!\nWhite:\n...! I-isn't it obvious? I saw the stand before it fell over!\nPhoenix:\nSo... you saw the stand before the victim was attacked, then?\nWhite:\nC-correct! That would be no problemo, right?\nPhoenix:\n(Hmm...)\n\n\n\nNo problemo\n\n\n\n\n\n\n\nPhoenix:\nRight. I guess there isn't a problem.\nJudge:\nVery well. Now...\nMaya:\nPh-Phoenix! Wait!\nPhoenix:\nHuh? What?\nMaya:\nHe saw the stand through the office window before it fell over... That's what he's saying, right?\nPhoenix:\nYeah, I guess so.\nMaya:\nHow could that be possible?\nPhoenix:\nHuh...? Why not?\nMaya:\nThere's no way he could have seen it! And you have proof!\nPhoenix:\n... Oh!\nJudge:\nSomething wrong, Mr. Wright?\nPhoenix:\nSorry, Your Honor! I guess there is a problemo, er, I mean, a problem.\nJudge:\nI see. Please try to think before you speak, Mr. Wright.\nPhoenix:\nSorry, Your Honor. But, I have proof!\nLeads to:\n\"A person in the hotel could not have seen the stand before it fell over!\"\n\n\n\n\nBig problemo\n\n\n\n\n\n\n\nPhoenix:\nThere's a big problemo, er, I mean problem here.\nWhite:\nWhat problem is this?\nPhoenix:\nMr. White, let me make sure I have this straight... You saw the glass light stand through the window, from the hotel... before the incident occurred?\nWhite:\nCorrect! That is so! It's conclusive, definitive, undeniable... unimpeachable!\nPhoenix:\nNo, it's impossible! You couldn't have seen the stand!\nJudge:\nWhat? Why couldn't he? You have proof?\nPhoenix:\nI sure do, Your Honor!\nLeads to:\n\"A person in the hotel could not have seen the stand before it fell over!\"\n\n\nPhoenix:\nA person in the hotel could not have seen the stand before it fell over!\n\n\n\nPresent Floor Plans\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Look at this!\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThis is the proof! ...\nJudge:\nSomething the matter?\nPhoenix:\nN-no... it's just...\nMaya:\nPhoenix... I don't think that's what you meant.\nPhoenix:\n(I don't think so either.)\nJudge:\nMr. Wright. The courtroom is no place to play practical jokes.\nPhoenix:\nI'm sorry, Your Honor. Let me try that again.\nLeads back to:\n\"A person in the hotel could not have seen the stand before it fell over!\"Present Floor Plans\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nMr. White. It was impossible for you to have seen the glass stand!\nWhite:\nWhaaaat!?\nLeads to:\n\"Look at this!\"White:\nThen, the next moment, I saw Miss Mia run to the left!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n\"Miss Mia\"...? Mr. White, did you know the victim personally?\nWhite:\nNo no no, triple no! How would I? How could I!\nEdgeworth:\n\nEdgeworth:\nI see nothing odd about the witness knowing the name of the victim. Mr. Wright! I will not have you harrying the witness!\nPhoenix:\n(You're looking a little flustered, Edgeworth!)White:\nThe killer, you, attacked her... but she dodged.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nNow before, you said that she was hit before she ran.\nWhite:\nY-yes, I must have been confused. But don't worry! We all know what happened now.White:\nShe turned, and ran for the door!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat did you do then?\nWhite:\nI gave chase, of course! ...! No! No! Not me. Th-the killer, I mean! He gave chase!\nEdgeworth:\n\nEdgeworth:\nMr. White, please try to remain calm. Mr. Wright here is only trying to fluster you with baseless accusations!\nWhite:\nOh... oh right. Thank you, Miles.White:\nThen you did her in with a single blow! Thwap!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n\"Thwap\"...? That doesn't sound like the \"savage\" attack from your earlier testimony...\nWhite:\nHo! Hoh hoh! Yes, well, I am a man of peace, you see.Maya:\nPhoenix! He's getting a lot less talkative.Phoenix:\nHe's probably afraid I'll catch him on something! (But it won't be easy!)Phoenix:\nLook at this!Judge:\nThese are the floor plans to the scene of the murder, yes?Phoenix:\nCorrect, Your Honor. Now, look... If you were to look through the window at the office... This is the area you would be able to see! Here! Well...? Note that the stand is not within the visible area! Well, Mr. White! What do you have to say to that!?White:\nEr... erp! Ri... dicu... losity...Phoenix:\nMr. White. If you were in the Gatewater hotel as you claim, you could not have seen the stand before it fell over! In fact, you wouldn't have been able to see it after it fell, either! There's no way you could have recognized the broken shards as a glass light stand! So, when did you see the stand, Mr. White? It must have been the moment that it fell! And the only place you could have seen that from... is inside the Fey Law Offices! In other words, you were at the scene of the crime, when the murder took place!White:\nGaaaaaaaaaaaaaaaaaaaaa!!Judge:\nMr... White?White:\n...Phoenix:\nMr. White.White:\n...Phoenix:\nYou did it, didn't you?White:\n... Mr. Your Honor. I... I... Miss Mia... ...Phoenix:\n(Heh. Looks like we're about to get our verdict!)Edgeworth:Edgeworth:\nThat's far enough, Phoenix Wright!Phoenix:\nW-what!? (Urk! I forgot about Edgeworth!)Edgeworth:\nMr. White...White:\n...Edgeworth:\nI think the time has come. Shouldn't you confess your crime now, hmm?White:\nW... what?Edgeworth:\nI said, you should confess your crime. Ergo, confess that you placed the wiretap!Phoenix:\nThe w-wiretap!?Judge:\nOrder! Order! Mr. Edgeworth! Explain to the court what you mean by this!Edgeworth:\nDistinguished members of of the court... Mr. White is slightly confused. Allow me to explain.Phoenix:\n(I really don't like the way this is headed...)Edgeworth:\nAs you know, Mr. White is the CEO of Bluecorp. He ordered his secretary, Miss April May, to tap the law offices of Ms. Fey.Judge:\nWhat does that have to do...?Edgeworth:\nYour Honor. The question is: when was the wiretap placed in the office, and by who?Phoenix:\nNo! You wouldn't!Edgeworth:\nMr. White. In order to place the wiretap, you entered Ms. Fey's office. Am I correct...?White:\n... ! C-correct! You are most correct, Miles!Phoenix:\nGive me a break!White:\nYes... in order to place the wiretap, I breached the Fey & Co. Law Offices! That is when I saw that accursed light stand!Judge:\nNow I'm confused. Please explain to the court what all this means, Mr. Edgeworth!Edgeworth:\nGladly, Your Honor. Mr. Phoenix Wright has made his position quite clear. He has determined that Mr. White knew the glass stand was in the office. He has shown that there was only one time Mr. White could have seen the stand: at the very moment of the murder! ([at] was capitalized in the original release) Thus, Mr. Wright would like you to believe that Mr. White was the murderer!Judge:\nI see.Edgeworth:\nHowever! It is a fact that Mr. White had been to that office well before the murder took place! When he went to place the wiretap! (Changed from [He went to place the wiretap!] in the original release) He could have seen the glass light stand then. Ergo, Mr. Phoenix Wright's theory is revealed for the baseless conjecture it is!Judge:\nMr. White! You will testify to the court about this wiretapping! (Changed from [You will testify to the court about this wiretap!] in the original release)White:\nAhem. Leave it to me!Phoenix:\n(I... I feel faint.)Witness Testimony-- The Wiretapping --White:\nIt was the beginning of September... the week before the murder.\nI had entered the Fey & Co. Law Offices.\nOf course, I had done so to place the wiretap.\nThat is when I saw this glass light stand.Judge:\nHmm... So, you saw the stand before the night of the incident... And this is how you were able to identify what had fallen over. By the sound?White:\nCorrect! That is right.Judge:\nI see. Very well, Mr. Wright, you may cross-examine.Phoenix:\n(Gah! What am I supposed to do now...!?)Maya:\nGood luck, Phoenix...Cross Examination",
      "testimonies": [
        {
          "testimony": "It was the beginning of September... the week before the murder.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "I had entered the Fey & Co. Law Offices.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "Of course, I had done so to place the wiretap.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "That is when I saw this glass light stand.",
          "person": "White",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Wiretapping --White:\nIt was the beginning of September... the week before the murder.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nD-do you have proof!?\nEdgeworth:\n\nEdgeworth:\nMiss April May knew the details of Ms. Fey's phone conversation! This proves that the wiretap was placed before the murder!\nPhoenix:\nHuh... right.White:\nI had entered the Fey & Co. Law Offices.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas it really you that went into the office? Or was it Miss May?\nEdgeworth:\n\nEdgeworth:\nUnidentified fingerprints several days old were found in the Fey & Co. Law Offices. Those were obviously Mr. White's.\nPhoenix:\n(And if I know Edgeworth, he's already run a check on those prints...)\nEdgeworth:\nNow, Mr. White. Tell us why you went to the Fey & Co. Law Offices.White:\nOf course, I had done so to place the wiretap.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhy did you tap Mia's phone!?\nEdgeworth:\n\nEdgeworth:\nThat has no bearing on the current case, Your Honor.\nWhite:\nBluecorp is a detective agency of sorts. We have a responsibility to protect client confidentiality!White:\nThat is when I saw this glass light stand.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhy did you notice something as innocuous as a light stand!?\nWhite:\nThe light stand was made entirely out of glass. It was quite stylish, so I guess it made a lasting impression on me. Such a beautacious thing deserves attention, does it not? That is all.Phoenix:\n(Dammit! There's nothing there for me to press him on! Oh well... maybe he's rattled enough that I can bluff something out of him!)After pressing first, second, and fourth statements, then pressing third statement:Phoenix:\n(Uh oh! Don't tell me I've run out of ammo!)Edgeworth:\nTsk tsk. I'm afraid that's as far as you go, Mr. Wright. The time has come for you to admit your defeat! You fought... honorably.Phoenix:\n(No more... I can't take this anymore...)Judge:\nMr. Wright? Are you giving up?Phoenix:\n... Y-yes, Your Honor.???:(Phoenix!)Phoenix:\n...????:(Phoenix! Over here!)Phoenix:\n(I know that voice! ... M-Mia!?)Mia:\nNever give up, Phoenix!Phoenix:\n...!!!! M-M-Mia...!Phoenix:\nWhere... Where am I? The waiting lobby...? What happened? ... Oh, right... I lost the trial. I was... hallucinating. ...Mia:\nAh, you're finally awake.Phoenix:\nGak!Mia:\nH-hey! Phoenix! ... \"Gak\"? That's no way to greet an old friend! Phoenix, I want you to look at me.Phoenix:\nY-You're... M-Maya...?Mia:\nDidn't you know the Fey women have strong psychic powers...? When you accepted your defeat in court... It appears that was enough of a shock to awaken Maya's true powers.Phoenix:\nSo... Maya is channeling you, Mia?Mia:\nThat's right. I am Maya, but I'm also Mia. Now, I want you to listen to me, Phoenix. Maya never gave up. You can't either! That's what I came here to tell you.Phoenix:\n...! B-but!Mia:\nWe don't have much time, Phoenix. Now listen. You've already won.Phoenix:\nHuh...?Mia:\nYou have that Receipt in the court record, right?Phoenix:\nUm... oh, yeah! The one you wrote \"Maya\" on...?Mia:\nPhoenix! White wrote that, not me!Phoenix:\nSo... so what do I do with it?Mia:\nLook at the front of the receipt!Phoenix:\nThe... front? (It's a regular receipt... Looks like it's from a famous department store. \"$1,000.00\"... Wow, big spender! ([Wow] lowercase in the original release) \"Item\"... \"glass light stand\"...! \"Date of purchase\"... \"September 4\"...) ...! September 4!Mia:\nThat's right, Phoenix. I bought that stand the day before I was killed!Phoenix:\nWhoa!Mia:\nNow, what did Mr. White say in his testimony?White:\nIt was the beginning of September... the week before the murder.Phoenix:\nHe said he saw the stand the week before the murder!Mia:\nThere you go! I think the court is about to reconvene! Go do it, Phoenix! You know you're innocent, now you just have to prove it!Phoenix:\nRight!Receipt updated in the Court Record.September 9, 1:16 PMDistrict CourtCourtroom No. 1Judge:\nThe court will now reconvene for the trial of Mr. Phoenix Wright. Is the defendant... rather, are you alright, Mr. Wright?Phoenix:\nYes. Sorry, Your Honor. I'm fine now.Judge:\nThen, let's start where we left off.Edgeworth:\nYour Honor. There is nothing to go back to! The cross-examination of Mr. White is finished! All that is required now is for you to pass judgment on the defendant Phoenix Wright!Judge:\nHmm...Phoenix:\nYour Honor! Please, give me one more chance. I promise you, this is the last time I'll ask you!Judge:\nHmm... But, as Mr. Edgeworth has noted, the trial is more or less finished. Mr. Edgeworth, do you have an opinion on this matter?Edgeworth:\nI say... let us give Mr. Phoenix Wright his \"last chance.\"Judge:\nVery well! You may begin your cross-examination.Cross Examination",
      "testimonies": [
        {
          "testimony": "It was the beginning of September... the week before the murder.",
          "person": "White",
          "present": [
            "Receipt"
          ],
          "source": {
            "evidence_span": "The date of purchase is the day before the murder.",
            "testimony_span": "the week before the murder",
            "explanation": "The date of purchase remembered by the witness contradicts the date indicated by the receipt.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "I had entered the Fey & Co. Law Offices.",
          "person": "White",
          "present": [
            "Receipt"
          ],
          "source": {
            "evidence_span": "The date of purchase is the day before the murder.",
            "testimony_span": "N/A",
            "explanation": "The date of purchase remembered by the witness contradicts the date indicated by the receipt.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "Of course, I had done so to place the wiretap.",
          "person": "White",
          "present": [
            "Receipt"
          ],
          "source": {
            "evidence_span": "The date of purchase is the day before the murder.",
            "testimony_span": "N/A",
            "explanation": "The date of purchase remembered by the witness contradicts the date indicated by the receipt.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "That is when I saw this glass light stand.",
          "person": "White",
          "present": [
            "Receipt"
          ],
          "source": {
            "evidence_span": "The date of purchase is the day before the murder.",
            "testimony_span": "N/A",
            "explanation": "The date of purchase remembered by the witness contradicts the date indicated by the receipt.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        }
      ],
      "noPresent": false,
      "difficulty": "easy",
      "is_self_contained": "yes"
    }
  ]
}