{
  "previousContext": "Turnabout SistersTranscriptTranscript (JP)Part 1Part 2Part 3Part 4Episode 2Turnabout SistersCellular:Brrring... Brrrrring...*beep*???:Hello? This is Maya.Mia:Hey Maya, it's me.???:Mia! What's up? You haven't called in a while.Mia:Sorry, I've been so busy. How you been????:Well, LONELY. And it's all YOUR fault. Nah, I'm just teasing. I've been great! I'm finally getting used to having my own place.Mia:That's good to hear. Actually, I'm calling because I have a favor to ask.???:I know, I know. You want me to hold evidence for you?Mia:Sharp as always! There's a lot of buzz about the upcoming trial... I just don't feel safe keeping the evidence here.???:I gotcha. So, what is it this time?Mia:It's... a clock.???:A clock?Mia:Yeah, it's made to look like that statue, \"The Thinker.\" And it tells you the time! I thought you might like it. You always liked toys.???:Hey! I'm not a little girl anymore, Sis!Mia:Now, now. You know I'm only teasing. Ah, I should probably tell you, the clock isn't talking right now.???:Huh? It's not working? That's lame!Mia:I had to take the clockwork out. Sorry. I put some papers inside it instead.???:Papers? Is that the evidence, then? Hmm, well... there's a possibility that it might turn out that way, yes.Mia:Can you come by the office tonight, say 9:00, to pick it up? I'll be in a pretrial meeting until then.???:Okay, Sis, but I expect dinner! Something good! Like... burgers! I could really go for a good burger.Mia:Okay, okay. We'll hit the usual joint.???:Alright! It's a deal! Okay, Sis, see you soon!Mia:Yep. I'll be waiting, Maya.Cellular:*beep*[Conversation recorded. September 5, 9:27 AM]September 5, 8:57 PMFey & Co. Law Offices???:Now, Miss Fey, I'll take what's mine... the papers.Mia:I'm sorry, but I can't give you what I don't have.???:Miss Fey, you are a poor liar. Why, I see it right over there... That must be \"The Thinker\" that swallowed those papers.Mia:How could you know...????:Ho hoh. You are not cogniferous of my background? Gathering information is my business, you see.Mia:I... I should have been more careful.???:Ho hoh. My dear Miss Fey... I am so very sorry. But I am afraid I must ask you for one more thing. Your eternal silence... Farewell, Miss Fey.Mia:!!!Red... White... Blue...Episode 2Turnabout SistersSeptember 5, 9:08 PMFey & Co. Law OfficesPhoenix:Uh oh, I'm late. Huh, that's strange. The chief must have gone home already. She said her sister was coming over so we should all go out for dinner... ... What's that smell...? Blood...? Mia! (Maybe she's in her office!)ExamineAnywherePhoenix:I smell blood... and that can't be good! I have to check and see if Mia... the Chief's okay!Phoenix:That smell... Blood!???:... *sob* Sis...Phoenix:(Someone's there!) ...! Chief? Chief...?Chief!!!Phoenix:Who are you????:...Phoenix:(The strange girl dropped out cold. I left her lying on the office sofa. I went back to the chief where she lay under the window. Her body was still warm... I could feel it when I held her shoulder. Then, all too quickly, it began to fade... Until finally she was cold.)Phoenix:Chief...ExamineBroken glassPhoenix:Some shards of glass are scattered on the floor. They seem to be the remains of a glass light stand.ChairPhoenix:The chief's chair. A simple, functional design. Feels pretty good to sit in, too.Mia Fey's bodyPhoenix:Chief... It's hard seeing her like this, but if there are any clues here... She was struck on the head with a blunt object. She probably died instantly. \"The Thinker\" lying next to her must have been the murder weapon.The Thinker added to the Court Record.Phoenix:Hmm... there are some glass shards near the chief's body. Must be pieces of the glass light stand lying broken in the back of the room.Glass Shards added to the Court Record.Phoenix:Nothing else that seems like a clue here... Hmm...? A piece of paper! It must have fallen from Mia's hand! What could it be?Mia Fey's body (subsequent times)Phoenix:It's painful to look... but I have to, for Mia's sake. Looks like she was hit in the head with a blunt weapon. She probably died instantly.\"Maya\" scrap of paper (after examining Mia Fey's body; before clearing all Talk options at Fey & Co. Law Offices)Phoenix:! A word is written in blood on this scrap of paper! \"Maya\"...? Did Mia write this? This piece of paper is a receipt from a department store, dated yesterday.Receipt added to the Court Record.Phoenix:(I think that's enough snooping around for now. I'd better call the police... and find out what that girl was doing here.)\"Maya\" scrap of paper (after examining Mia Fey's body; after clearing all Talk options at Fey & Co. Law Offices)Phoenix:! A word is written in blood on this scrap of paper! \"Maya\"...? Did Mia write this? This piece of paper is a receipt from a department store, dated yesterday. (Wait a second! \"Maya\"...! Was Mia trying to tell us something about that girl? I think I'd better show her this receipt. I never thought there'd be a use for evidence like this outside the courtroom!)Receipt added to the Court Record.Phoenix:(I think that's enough snooping around for now. I'd better call the police... and find out what that girl was doing here.)\"Maya\" scrap of paper (subsequent times; before clearing all Talk options at Fey & Co. Law Offices)Phoenix:! A word is written in blood on this scrap of paper! \"Maya\"...? Did Mia write this? This piece of paper is a receipt from a department store, dated yesterday. (I think that's enough snooping around for now. I'd better call the police... and find out what that girl was doing here.)\"Maya\" scrap of paper (subsequent times; after clearing all Talk options at Fey & Co. Law Offices)Phoenix:! A word is written in blood on this scrap of paper! \"Maya\"...? Did Mia write this? This piece of paper is a receipt from a department store, dated yesterday. (Wait a second! \"Maya\"...! Was Mia trying to tell us something about that girl? I think I'd better show her this receipt. I never thought there'd be a use for evidence like this outside the courtroom! I think that's enough snooping around for now. I'd better call the police... and find out what that girl was doing here.)\"The Thinker\" statuePhoenix:It's encrusted with dried blood. How ironic that this became the murder weapon... again.WindowPhoenix:There's a large building right across from the office. The \"Gatewater Hotel.\" A nice, luxurious place.BookshelfPhoenix:All the chief's important documents are packed in here. This is where she filed her case records and recent rulings.ComputerPhoenix:Surprisingly, the chief was never good with machines. About all she used this PC for was e-mail. She picked up this ancient model at some garage sale for practically nothing.DeskPhoenix:A perfectly normal office desk. The chief had a very particular policy about office décor: \"Spend big on stuff the clients use, but keep your own stuff simple.\"Ledger bookPhoenix:The Fey & Co. ledger book. Everything is written in the chief's ultra-neat handwriting. It's a small office, but it makes a good bit of money.Corded phonePhoenix:Right! I'd better call the police! ...? That's funny... A few of the screws on the receiver are missing... It looks like someone was halfway through taking it apart.???:Police!? Please, come quick!Phoenix:(Wh-what was that!? Someone screaming from outside the window!?) ...! She's staring right at me! She's holding a phone in her hand...Corded phone (subsequent times)Phoenix:The phone receiver is missing a few screws. I'd better not use it.Fey & Co. Law OfficesIf Fey & Co. Law Offices is being visited for the first time, before Receipt is added to the Court RecordPhoenix:...! (That girl just now... where'd she go!? I put her right there on that sofa...! Uh oh... I hope she didn't run on me.) Yipes! (Don't scare me like that...) Umm... Excuse me but, who are you????:...Phoenix:It's okay. I work here.Maya:Maya... Maya Fey.Phoenix:Maya... Fey?If Fey & Co. Law Offices is being visited for the first time, after Receipt is added to the Court RecordPhoenix:...! (That girl just now... where'd she go!? I put her right there on that sofa...! Uh oh... I hope she didn't run on me.) Yipes! (Don't scare me like that...) Umm... Excuse me but, who are you????:...Phoenix:It's okay. I work here.Maya:Maya... Maya Fey.Phoenix:Maya... Fey? (\"Maya\"...? So Mia was writing this girl's name! Maybe I should show her the receipt? I never thought there'd be a use for evidence like this outside the courtroom!)ExamineBookshelfPhoenix:You couldn't cram more legal books in here, even if you wanted to. Few can gaze upon the shelves without feeling insignificant.DoorPhoenix:The door to the chief's office. It's slightly open. I'd better not touch the door knob.PaintingPhoenix:A large painting. I guess you'd call this \"modern art.\" I, on the other hand, call it a mistake.Reception deskPhoenix:The reception desk. I usually sit here.SofaPhoenix:This sofa is for clients. It's leather... a real luxury model.Writing deskPhoenix:A small writing desk cluttered with office supplies.TalkWhat happenedPhoenix:(She seems to be in shock. I don't want to disturb her, but I have to know...) Um... excuse me? Can you tell me what happened?Maya:... I came in... The room was dark. And Sis... Sis...!Phoenix:(So she was already dead.)You and the ChiefPhoenix:So, you're the chief's...?Maya:Sister. I'm her younger sister.Phoenix:And you were here... visiting? This late at night?Maya:Yes. She said she wanted me to keep some evidence for her.Phoenix:Evidence...?Maya:Yes... I-it was that clock... It was \"The Thinker.\"PresentThe ThinkerPhoenix:Um, about \"The Thinker\"...Maya:! The Th-Thinker... That was... Oh, Sis! *sob*Phoenix:(Hmm, probably shouldn't have asked her about the murder weapon...)Glass ShardsPhoenix:This was lying next to the chief.Maya:I know. I saw it there too. I thought they might be pieces of the light stand.Phoenix:Hmm. Maybe. (Never heard of a glass light stand before...)Receipt (before examining corded phone in Office)Phoenix:Before Mia died, she wrote a message with her own blood. She wrote it on the back of this receipt.Maya:! Th-th-that's MY name! W-why!? Why would she write my name?Phoenix:Please, just calm down.Maya:W-why would Sis write my name?Phoenix:(Uh-oh. Now I've done it... I'd better hurry up and call the police!)Receipt (after examining corded phone in Office)Phoenix:Before Mia died, she wrote a message with her own blood. She wrote it on the back of this receipt.Maya:! Th-th-that's MY name! W-why!? Why would she write my name?Phoenix:Please, just calm down.Maya:W-why would Sis write my name?Phoenix:(Uh-oh. Now I've done it...)Anything elseMaya:I'm sorry, I've never seen that before.After examining corded phone in Office and presenting Receipt in Fey & Co. Law Offices:*whee-ooo* *whee-ooo*... *whee-ooo* *whee-ooo*...Phoenix:! The police! (Sounds like they're coming this way!)Freeze! Police!Gumshoe:Alright, I'm Detective Dick Gumshoe, see?Phoenix:(Gumshoe...? What an odd name.)Gumshoe:We received a report from the building across the way, see. Got a person saying they saw a murder.Phoenix:(It must have been that woman I saw.)Gumshoe:Anyway, I don't want either of you moving one inch, 'kay?Phoenix:(Great. Just great. Maya... Wait, she wouldn't have... nah.)Gumshoe:Whoaaaaaaaaaaaah! Scuze me!Maya:Eek!Gumshoe:This word \"Maya\" here mean anything to you?Maya:...! Um... that... That's my name...Gumshoe:WHAAAAT!? The victim drew this here note in her own blood, see? With her dying breath, she wrote down the killer's name!Maya:K-killer...? I'm not--Gumshoe:Case closed! You're coming down to the precinct, ma'am.Maya:W-what?Phoenix:Mia's younger sister, Maya, was arrested on the spot. I was taken in for questioning and didn't get out until the next morning. My eyes were heavy... but I couldn't sleep. I sat around, waiting for visiting hours to begin at the detention center. I had to talk to Maya as soon as possible.September 6, 9:07 AMDetention CenterVisitor's RoomPhoenix:(Wow, they have poor Maya locked up like a criminal.)Maya:Oh! It's you! The lawyer... G-good morning.Phoenix:Good morning! (She looks so tired...)Maya:Um... Are you going to be my attorney?Phoenix:Well, that's what I wanted to talk to you about...It's up to youPhoenix:(I'd better give it to her straight...) It's up to you.Maya:Up... to me?Phoenix:Yes. I don't think this is something I should decide. After all, you're the one in trouble here.Maya:... They're never going to believe me... are they? Even you, when you found me in the office. You looked at me like I had done it!Leads to:\"Did I look at her like that?\"Of course I willPhoenix:(First things first, I better get her cheered up...) Yeah, of course I will! Cheer up!Maya:R-really...?Phoenix:(Whoa! Did I say the wrong thing? She looks sadder now!) Um... what... what's wrong? You don't think I can do it?Maya:... No... no one could! Who would believe me? Even you, when you found me in the office. You looked at me like I had done it!Leads to:\"Did I look at her like that?\"Sorry, not a chancePhoenix:(Maybe if I joke a bit she'll cheer up...) Hah hah! No way, Jose! Just kidding...Maya:... ... ...Phoenix:(Eh heh. Whoops. That didn't go so well.)Maya:...Heh...Phoenix:Huh? M-Maya...? Was that a... chuckle?Maya:What? N-no! ... It wasn't very believable, was it?Phoenix:(Not really...)Maya:I-I'm sorry! I just thought, since you'd made a joke... Please, don't mind me! You're doing just fine!Phoenix:(Who's trying to cheer up who here!?)Maya:... I knew it. No one will believe me.Phoenix:What?Maya:Even you-- when you found me in the office. You looked at me like I had done it!Leads to:\"Did I look at her like that?\"Phoenix:(Did I look at her like that?) No, no! I never thought...Maya:I-it's okay. I understand. ... And... I've also heard about you.Phoenix:Heard...? Heard what about me?Maya:I... was talking to my sister on the phone the other day...Mia:\"Today was my junior partner's first time in court.\"Maya:Wow! Really? How'd that go?Mia:\"It was quite the scene! Honestly, I was on edge the whole time. It's been a while...\"Maya:Hah! So, he crashed and burned?Mia:\"...He's a genius. One of those 'strike fear into the hearts of evil' types... The only thing he's lacking is... experience.\"Maya:Huh, sounds like it was fun! Well, I know who to go to if I ever get into trouble now!Mia:\"I don't know, Maya. I think you might want to wait... give him three more years. That is, unless you want to be found guilty.\"Maya:That's what she said!Phoenix:...Maya:I-I'm sorry! I didn't mean to trouble you...Phoenix:No, it's okay. It's true, I guess. But... at the same time, I can't just sit and watch! When I think of the person who did this to Mia...Maya:... I know...ExamineSecurity cameraPhoenix:Smile for the camera...Security guardPhoenix:This guard monitors the visitor's room. He hasn't moved an inch. A real pro, this guy.TalkMayaPhoenix:There's something I've been wanting to ask you...Maya:Yes?Phoenix:What's with that outfit?Maya:Oh, this? This is what all acolytes wear. It's my uniform, you could say.Phoenix:A-acolytes? Like people in religious training? What is it you do?Maya:Oh! It's nothing strange, really! I'm a spirit medium. ...In training.Phoenix:A s-spirit medium!? (I'm pretty sure that qualifies as strange.)The day of the crimePhoenix:Could you tell me about the day of the murder?Maya:Yes! Let's see... that morning, I got a call from my sister. She wanted me to hold onto a piece of evidence for an upcoming trial.Phoenix:Evidence?Maya:Yes. That clock shaped like \"The Thinker.\"Phoenix:(The one Larry made...) How could that have been evidence in a case?Maya:Um, right, she said something about that... ... I remember! Do you want to hear it in her own voice?Phoenix:H-her own voice!?Maya:Yes. I'm pretty sure our conversation is on my cell phone.Phoenix:You recorded it!Maya:Yeah! I forgot how to delete those things.The day of the crime (after clearing \"Your cell phone\" Talk option)Phoenix:Could you tell me about the day of the murder? Sorry... I know it must be hard.Maya:No, it's okay. All I've been doing the last few hours is talking about it. I've kind of gotten used to it... Let's see... that morning, I got a call from my sister. She wanted me to hold onto a piece of evidence for an upcoming trial.Phoenix:(That's \"The Thinker\" clock that Larry made. It practically qualifies as a serial murderer by now.) So then, when did you arrive at the office?Maya:It was right around 9:00. The lights were off and... I could smell blood. Th-then I found her. My sister...Phoenix:Thanks, Maya. That's all I need to hear for now.Your cell phone (appears after \"The day of the crime\")Phoenix:So, you say you have a conversation with your sister on your cell phone? Let's hear it!Maya:Right! Oh! I just remembered: that detective took my cell phone. Sorry.Phoenix:Oh, right. (Of course...) Next time I see Detective Gumshoe I'll ask him for it.Maya:I'll write you a note so you don't forget, okay?Phoenix:Sure, thanks.Maya's Memo added to the Court Record.Your cell phone (subsequent times)Phoenix:So, you say you have a conversation with your sister on your cell phone? Let's hear it!Maya:Right! Oh! I just remembered: that detective took my cell phone. Sorry.Phoenix:Oh, right. (Of course...) Next time I see Detective Gumshoe I'll ask him for it.Maya:I'll write you a note so you don't forget, okay?Phoenix:Sure, thanks.Spirit mediums (appears after \"Maya\")Phoenix:So you're an acolyte. A, er, medium-in-training.Maya:That's right. The Fey family, especially the women, have always been very sensitive to the spirit world.Phoenix:Wait a second, you said the \"Fey Family\"? So, Mia was into this stuff too?Maya:Of course! She left the mountain to \"follow her career,\" she said. Her powers were first-class, too!Phoenix:(I... I had no idea.) Hmm... Wait...!Maya:What?Phoenix:So, you're a real, honest-to-goodness spirit medium? With E.S.P. and all that?Maya:Yes. ...In training.Phoenix:Well, can't you contact Mia's spirit, then? We can just ask her who killed her!Maya:...! I-I'm sorry... I'm still in training. I couldn't do something on that level...Phoenix:(Hmm... I thought that would be too easy.)PresentThe ThinkerPhoenix:I wanted to ask you about the murder weapon...Maya:Poor Sis... *sniff*Phoenix:(Hmm. Better not ask her about this now.)Glass ShardsPhoenix:This was lying next to the chief's body...Maya:I saw that too. They said they thought these were pieces of a broken light stand.Phoenix:Yeah, that seems about right. (Though I'd never heard of a glass light stand before this...)ReceiptPhoenix:Remember that receipt?Maya:Y-you mean the one with my name on it?Phoenix:Any idea why she...Maya:Absolutely none! Um... Do you trust me?I trust youPhoenix:I trust you.Maya:Why? Don't you think I did it, too?Phoenix:No, I don't. (It's just a hunch, but...)Maya:That detective thinks I did it.Phoenix:...Leads back to Court RecordI don't trust youPhoenix:...Maya:I didn't think you'd believe me. You're just like the detective.Phoenix:I'm sorry... I don't like lying just to make people feel better. But it doesn't mean that I've decided you did it! (She seemed so lost at the crime scene.)Leads back to Court RecordMaya's MemoPhoenix:I wanted to ask you about your cell phone...Maya:That detective took it when they brought me in.Phoenix:(So, Gumshoe took it... I'll have to try to get it back next time I see him...)Anything elseMaya:Sorry... I've never seen that before.After clearing all Talk options:Maya:... Um...!Phoenix:Huh? Something the matter?Maya:Um... I was wondering, could I ask you a favor?Phoenix:...?Maya:This is the address of a famous lawyer. My sister gave me this a long time ago. She said if I was ever in trouble, I should call him. And, well, I'm in trouble. Do you think you could go ask him to represent me?Phoenix:(Hmm...)AcceptPhoenix:Sure, why not? I'll go ask.Maya:Thank you so much! I have no one else to turn to...Phoenix:...? Say, what about your parents...?Maya:... ... ...Phoenix:I... I see. Don't worry, leave it to me.Maya:Thank you! The trial's tomorrow... at 10:00.Phoenix:W-what!? Tomorrow!?Maya:Tomorrow.Phoenix:What if this guy refuses!?Leads to:\"They told me that if I don't find one, the state will pick an attorney to defend me.\"RefusePhoenix:I'm sorry... I think this is the kind of thing you should really do yourself.Maya:...You're right. ...Phoenix:Something wrong?Maya:Actually, I asked the police to contact him, and they tried calling a few times. Nobody could get a hold of him!Phoenix:They couldn't find him?Maya:I have no one left to ask!Phoenix:...? Say, what about your parents...?Maya:... ... ...Phoenix:O-okay! Don't worry, I'll go ask him for you.Maya:Y-you will? Thank you so much!Phoenix:I'm just worried what will happen if I can't find him.Leads to:\"They told me that if I don't find one, the state will pick an attorney to defend me.\"Maya:They told me that if I don't find one, the state will pick an attorney to defend me.Phoenix:When will that happen?Maya:They're giving me until 4:00 this afternoon.Phoenix:(And visiting hours are almost up... I'd better hurry!) Right, I'll be back!September 6Fey & Co. Law OfficesPhoenix:(The office is filled with police officers. They're all busily searching for clues...)???:Hey! You there! This is a crime scene, pal! No trespassing! Umm... Sorry, don't I know you from somewhere? Wait, you're that Butz guy, aren't you!Phoenix:No, no, Phoenix Wright. (How could anyone mistake me for Larry!?)???:Ah, guess I got the wrong name, Mr. Wright. Sorry 'bout that. That Butz guy, he was a killer! And you're no killer! Right?Phoenix:(He WAS proven innocent...) Umm... right. And you were...Detective GumshoePhoenix:Um... Gumshoe, wasn't it? Dick Gumshoe????:Right! At your service. Hang on! That's Detective Gumshoe to you, pal!Leads to:\"Anyway, get the name right. And don't go calling me \"Dick\"...\"Detective SuedeshoesPhoenix:Um... Suedeshoes, wasn't it????:That's me! Don't step on my blue suede shoes... Wait! That's a song, pal! My name's Dick Gumshoe... W-wait! That's Detective Gumshoe to you, pal!Leads to:\"Anyway, get the name right. And don't go calling me \"Dick\"...\"Detective GumtreePhoenix:Um... Gumtree, was it? Detective Gumtree????:G-Gumtree...? Gum doesn't grow on trees, pal! And I'm the one in charge here so don't push your luck!Phoenix:(Whatever you say, Detective...)Leads to:\"Anyway, get the name right. And don't go calling me \"Dick\"...\"Gumshoe:Anyway, get the name right. And don't go calling me \"Dick\"...Police:Hey, Dick! Get over here!Gumshoe:Y-yes, sir! B-be right there! Umm... ahem! You're her lawyer, right, pal? If you got business here, you'd better do it quick!Phoenix:(Whew! He thinks I'm Maya's lawyer...!)ExamineBookshelfPhoenix:There's a horrendous amount of legal books here. Scarier still is that Mia probably read all of these.HouseplantPhoenix:Mia's favorite potted plant. I remember it had this bizarre name no one could ever remember.???:\"Cordyline stricta,\" pal!Phoenix:(Who was that!?)Mia's deskPhoenix:Mia's desk. Perfectly clean, as always. The only thing it's missing is... Mia.Movie posterPhoenix:An old movie poster. Apparently, this was the first movie that made Mia cry when she saw it. I'll have to check it out one of these days.WindowPhoenix:The sky is blue, and so am I... There's that hotel, right across the way.TalkMiaPhoenix:About Ms. Fey... did you do an autopsy?Gumshoe:Hmm? You want to know the results, eh?Phoenix:...Gumshoe:Now don't you look at me like that, pal! It's no use! She might have been your boss, but that doesn't mean you get any special treatment. Alright, alright. You can see the report, but that's all!Autopsy Report added to the Court Record.Mia (subsequent times)Phoenix:So, Mia's death was instantaneous.Gumshoe:That's right, pal. She was... a beautiful person.Phoenix:You knew her, Detective?Gumshoe:Sure. All of us down at the precinct knew Ms. Fey. Much as it pains me to say this, she was a darn good lawyer. Hey, what are you looking at? I just got a little dust in my eye, that's all.MayaPhoenix:Um, about Maya...Gumshoe:Yeah! I'm looking forward to the trial! Sorry, pal, but this is one trial you aren't going to win!Phoenix:W-why do you say that?Gumshoe:The city's put Prosecutor Edgeworth on the prosecution!Phoenix:(Edgeworth...)Gumshoe:I'm sure you know what that means, you being a lawyer and all.Edgeworth (appears after \"Maya\")Phoenix:Prosecutor Edgeworth...Gumshoe:That's right, pal! Mr. Miles Edgeworth himself! Wait... you do know him, don't you!?Of course I do!Phoenix:I know him. He's a feared prosecutor. He doesn't feel pain, he doesn't feel remorse. He won't stop until he gets his \"guilty\" verdict.Gumshoe:Aww, don't talk about him that way. You make him barely sound human! Still, I'm afraid this pretty much decides the case.Phoenix:(So, Edgeworth is on this one... He hasn't lost a case since he became prosecutor at the incredibly young age of 20. Of course, there are rumors of back-alley deals and forged evidence...)Leads to:\"All I know for sure is that Edgeworth hates crime with an almost abnormal passion.\"Of course not!Phoenix:Never heard of him.Gumshoe:Whoa! And you call yourself a lawyer, pal!? About four years ago, this Edgeworth guy became a prosecutor at the age of 20! Everyone says he's a genius. Surprised you don't know him!Phoenix:(Of course I know him... I was just playing dumb. He's a cold, heartless machine who'll do anything to get a \"guilty\" verdict! There are rumors of back-alley deals and forged evidence...)Leads to:\"All I know for sure is that Edgeworth hates crime with an almost abnormal passion.\"Phoenix:(All I know for sure is that Edgeworth hates crime with an almost abnormal passion. I never imagined I'd be facing him so soon...)PresentThe ThinkerPhoenix:I was wondering, do you know anything about this?Gumshoe:That statue? That's the murder weapon.Phoenix:(Huh? He thinks the clock is just a statue, too... I'm starting to wish I'd never seen this thing.)Glass ShardsPhoenix:There was broken glass at the crime scene, right?Gumshoe:Hmm? Oh, that? Seems like a glass stand next to the victim fell over. The glass shards were pieces of the broken stand.ReceiptPhoenix:There was a piece of paper next to the victim, wasn't there?Gumshoe:Yeah. The one with the killer's name written on it!Phoenix:Are you sure that Mia wrote it herself?Gumshoe:Given the condition of the writing, it's hard to say if it's her handwriting or not.Phoenix:(So there's no proof that Mia wrote it.)Maya's MemoPhoenix:I was wondering... did you see Maya Fey's cell phone?Gumshoe:Oh that? I have that.Phoenix:Do you think you could give it back?Gumshoe:Sure! I mean, wait a second, pal! Tricky lawyer!Phoenix:(Uh-oh, he's on to me!)Tell him straightPhoenix:(Hmm... if I tell him why I want it there's no way he'll give it to me!)Gumshoe:Something the matter?Phoenix:Oh, no, it's just... You know, Detective!Gumshoe:Nope. I know nothing, pal!Phoenix:That cell phone has a lot of numbers on it... like her boyfriend's... A cell phone holds all a little girl's sweetest and spiciest secrets!Gumshoe:Urk? Y-you're trying to confuse me! Sorry, pal. I already checked all the numbers in memory!Phoenix:Impressive! You're quite the detective.Gumshoe:Uh huh. Oh, here, you can have the phone back. There weren't any suspicious call records in there, after all.Leads to:\"Seems he didn't notice the recorded conversation...\"Tell him not-so-straightPhoenix:(Okay, I can't be straight with this guy... but what should I tell him?)Gumshoe:Something the matter?Phoenix:Oh, no, um... T-that carrying strap on the cell phone...Gumshoe:This? Hmm... it says \"The Steel Samurai: Warrior of Neo Olde Tokyo\"... \"The Steel Samurai\"... that action hero on TV?Phoenix:Yeah, you see that strap is a collector's item... She... was worried it might get lost if it went down to the precinct.Gumshoe:That what she said?Phoenix:Um. Yes.Gumshoe:... Okay, pal. I wrote down all the numbers she called anyway. Here you go.Leads to:\"Seems he didn't notice the recorded conversation...\"Phoenix:(Seems he didn't notice the recorded conversation...)Maya's Cell Phone received from Detective Gumshoe. (Changed from [Received: Maya's Cell Phone.] in the original release) Check the Court Record to hear the recorded conversation.Mia's Autopsy ReportPhoenix:Thanks for this!Gumshoe:Don't mention it, pal. When it comes to dealing with lawyers, \"fight fair and square,\" is our motto!Phoenix:(I don't know how I feel, seeing everything written up like this... It makes Mia's death seem so... routine.)Maya's Cell PhonePhoenix:(Seems he didn't notice the recorded conversation...)Anything elseGumshoe:Hmm? What's that? Sorry, pal, but I got no info for the likes of you!After clearing \"Mia\" and \"Maya\" Talk options and presenting Maya's Memo:Phoenix:(I guess I've asked all the questions I need to.)Gumshoe:You all done, pal?Phoenix:Um, yes, thank you. I'll be heading out now.Gumshoe:Oh, wait. One more thing I wanted to mention to you. I don't suppose you're planning on talking to that witness. Anyway, you'd better not! No influencing the witness with your lawyerly ways, pal!Phoenix:... (Come to think of it, I had completely forgotten about her...) The... witness?Gumshoe:Yeah, Miss April May. I'm sorry 'bout this... But I can't tell you anything about her!Phoenix:(Well, you just told me her name. Miss May, huh?) So you've sent her home already, then?Gumshoe:Ahah! You're trying your lawyerly tricks on me now! She's not to go outside her room until the trial!Phoenix:(So... she's still in the hotel across the way.) I guess I should know better than to try to get a detective to leak information.Gumshoe:You got that right, pal!Phoenix:(Time to pay a visit to Miss May!)September 6Grossberg Law OfficesPhoenix:(According to the receptionist, the big boss is \"out\". She couldn't say when he'd be back. It must be hard to keep track of everything when you're a famous lawyer... Not to mention run an office like this. I guess I'll just have to come back later.)ExamineBookshelfPhoenix:Expensive-looking mahogany bookshelves, filled with expensive-looking books. Hmm... funny... they don't look like they've ever been read.DeskPhoenix:A solid mahogany desk. The wood's been polished to a deep luster.PaintingPhoenix:That painting has been bugging me ever since I stepped in here. The oil paint is so thick it's practically giving me a stuffed nose. I'm sure the price is nothing to sneeze at either, for that matter.Potted plantPhoenix:An expensive potted plant. No idea what kind of plant it is, but it's probably the most expensive one available.TablePhoenix:A table for clients. Hmm... an elegant ebony case, and if I'm not mistaken, that lighter's made of solid gold. Even I can tell someone here's got money to burn.Detention Center (after visitng Grossberg Law Offices, but before examining open drawer in Gatewater Hotel - Room 303)Maya:Hey! What is it? Did you meet the lawyer?Phoenix:Sorry. I haven't seen him yet.Maya:I see...Phoenix:(Hmm. I'd better go see if I can find this elite lawyer she's talking about.)TalkYour familyPhoenix:What about your family?Maya:I only had my sister. My father died when I was very young. And I don't know where my mother is.Phoenix:(Don't know...? So she could still be alive?)Your mother (appears after \"Your family\")Maya:The women in my family have been mediums for generations. They say a lotta spiritual power runs in our blood. (Changed from [They say that E.S.P. runs in our blood.] in the original release) About fifteen years ago, our family was involved in an... incident. There was a man, and he... he... He ruined our mother's life.Phoenix:(\"Ruined\"...?)Maya:After that, she disappeared. Several years after that, my sister announced she would \"become a lawyer\" and she left the mountain.Phoenix:... So, you live by yourself?Maya:Yes. I've gotten used to it. Oh, also... I had to become independent, or I would lose my powers! (Changed from [I had to become independent, or I would lose my E.S.P.!] in the original release)Phoenix:(I feel bad for her, all by herself up on that mountain...)Your mother's enemy (appears after \"Your mother\")Phoenix:So, who was this man who, um, \"ruined\" your mother?Maya:About 15 years ago... there was an unusual murder case. It made quite a stir, everyone was talking about it, apparently. The police were running out of leads, and they were getting desperate...Phoenix:Wait... they didn't use a spirit medium, did they?Maya:The police convinced my mother to try to contact the victim.Phoenix:Wow... So, what happened?Maya:The case was solved... we thought.Phoenix:You \"thought\"...?Maya:The man my mother helped the police capture was innocent.Phoenix:...!Maya:The police's consultation with a medium had all been carried out in secret, of course. But... A man found out about it and leaked it to the press. He told all the papers that my mother was a fraud, and the media jumped on it big time. She... my mother... became the laughing stock of the nation.Phoenix:I see.Maya:... White...Phoenix:Excuse me? White?Maya:That was his name. My sister told me.Phoenix:White? Hmm...PresentMaya's Cell PhonePhoenix:Hey, I got your cell phone back.Maya:Oh! Say... Can I listen to my sister's voice?Phoenix:... (Maya's eyes closed... She listened to every word with such intensity... Before long, tears began to roll down her cheeks.) ...Maya:Thank you.September 6Gatewater Hotel - Room 303April:Well! Hello there, handsome.Phoenix:Umm... hi. (Smooth, Wright, real smooth.)April:You're the lawyer, aren't you? The detective told me... He said, \"Don't say nothing to that lawyer, pal!\" Tee hee!Phoenix:(Memo to self: thank Detective Gumshoe for making my job harder.)April:Gee! This is all like something out of a movie! It's all so exciting I can hardly contain myself! Ooh! Let me go freshen up so I can look the part of the beautiful eyewitness!Phoenix:(I pity the lawyer that has to cross-examine this one.)ExamineBedPhoenix:A simple bed. It's been recently made. Nothing eye-catching here.FlowersPhoenix:The flowers are fake, as expected. I know sunflowers and tulips, but that's about the extent of my floral knowledge.Open drawerLeads to:\"There's a screwdriver stuck in this drawer.\"PaintingPhoenix:Ah. A still-scene painting. Wait, should that be \"still life\"? Whatever. One of those is hanging on the wall.TablePhoenix:A bottle and two glasses are on the table. Somebody must be staying with her.WindowPhoenix:The late summer sunlight streams through the window. There's the Fey & Co. Law Offices building, of course. You can see the inside of the room pretty clearly from here. I think it would be a little difficult to recognize a face from this distance, though.Phoenix:(There's a screwdriver stuck in this drawer. I wonder what's inside? Let's take a look...)April:Hey! H-h-hey!!! What are you doing!? No touching! Oooh. Bad boy! Y-you really shouldn't pry around in other people's rooms, now. You wouldn't want to make me upset, would you?Phoenix:(Upset!? I thought she was going to explode for a second there! I wonder what could be inside the drawer?)ExamineOpen drawerPhoenix:(Hmm... what's inside I wonder?)April:*cough* *cough*Phoenix:(Maybe later...)TalkWhat you witnessedPhoenix:Do you think you could tell me something? I need you to describe what you observed at the time of the incident.April:Ooh. \"Observe,\" \"incident\"! You sound just like a lawyer in the movies! I like a man with a big... vocabulary.Phoenix:(Umm... *gulp* Better not encourage her.) Er... you know that thing that occur... um... happened the other day? The bad thing? What did you see when it happened? I don't suppose you could tell me about it? Pretty please?April:Let me see... Um, well... Dream on! If you want to know, you'll just have to come to the court tomorrow, Mr. Lawyer!Phoenix:(Oh boy.)Miss MayPhoenix:Um, could you... just who exactly are you?April:Oooh, Mr. Lawyer! Are you hitting on me?Phoenix:N-n-no! Hey! I'm just doing my job here!April:Tee hee! You know, you're cute when you blush.Phoenix:(Believe me, this is the first time in my life I've blushed this much...) Umm... eh heh. Right... can you just tell me what it is you do?April:Well... No! Tee hee! And you had your little hopes up, didn't you!Phoenix:(Oh boy.)This roomPhoenix:I see there are two glasses on the table. Is someone staying here with you?April:Oooh! What amazing powers of observation! You must be one of those famous detectives, like on television!Phoenix:Oh, no, not me, I'm, er, just a lawyer!April:Say, Mr. Big Detective, why don't you go look for clues... in the garbage? Hmm? Miss May doesn't like nosey little lawyers... Hmph!Phoenix:(Oh boy.)PresentAnythingApril:Excuse me, but I'm a witness? Police witness? You understand? How could I possibly give you any information in good conscience, hmm? Me... \"the witness\"! It's just like the movie!Grossberg Law Offices (after examining open drawer in Gatewater Hotel - Room 303)Phoenix:(Hmm... seems like Mr. Grossberg is out. Well, maybe I should just wait here for him to come back.)???:*Ah-HHHHEM!*Phoenix:(If that wasn't the most over-the-top clearing of the throat I've ever heard!)Grossberg:Ah hah! So, you're the one they say has been looking for me?Phoenix:Uh... y-yes, that's me! (He looks even... grander than I imagined!)Grossberg:Hmm...? That badge on your collar...? Ah, so you're a lawyer, are you now?Phoenix:Y-yes, well... yes.Grossberg:And what do you want? I'm not particularly busy these days... Please, proceed!Phoenix:(Not busy...? Then how come no one could get in touch with you?)Grossberg:Hmm? Something the matter? You came to see the one-and-only Marvin Grossberg, did you not? Well, here I am, boy! What do you want? Out with it!Phoenix:Um... w-well, sir, actually it's about Maya. Maya Fey.Grossberg:...! Ah... yes. Maya Fey. Go on.Phoenix:(Hmm? Why the strange reaction?)Grossberg:A-cha-cha. I'm really quite busy here, son. I can't go taking cases on a day's notice! No, it's quite impossible.Phoenix:W-wait a second! How did you know the trial was tomorrow!?Grossberg:Urk? Ahem! A-anyway... I'm afraid it's entirely impossible for me to represent her. Sorry. End of discussion.Phoenix:(What's going on!? He refused me before I even got a chance to ask him! What do I tell Maya...?)TalkYour refusalPhoenix:How can you just refuse like that! Please, tell me why you won't take the case!Grossberg:Hmm? Eh, ahem! Well, you see it's just... I'm busy, you see!Phoenix:But the client is Mia Fey's sister!Grossberg:Hmm... ahem.Phoenix:Mia trusted you... She knew her sister would be in good hands.Grossberg:Yes, yes, of course I know that. However! I'm sorry but, I must refuse. Sorry. Good-bye.Phoenix:Creep. Fine. I don't have time to argue with you anyway. I'll go look elsewhere.Grossberg:*grumble*... Think not.Phoenix:Huh? Did you say something?Grossberg:I think not, I said.Phoenix:Wh-what do you mean?Grossberg:I'm terribly, terribly sorry. But I'm afraid that no lawyer worth their salt will take on this particular case. Terribly sorry, m'boy.Phoenix:Why!?Grossberg:I... I cannot say. ... I beg your pardon, but could you leave? Now? I've nothing more to discuss with you.Phoenix:(What's going on here!?)MiaPhoenix:How did you know Mia Fey...?Grossberg:... She... worked here. A long time ago. Quite the apprentice, that one. Learned my techniques in the blink of an eye! She left one day, quite suddenly... She had a mission, you see.Phoenix:A \"mission\"?Grossberg:You could see it in her eyes. She followed it with a burning passion. Never looked back, that one.That paintingPhoenix:That's... quite a painting.Grossberg:Ahah! You noticed! It's my pride and joy! Impressive, isn't it? Well? ISN'T IT? The color of the sky! The hue of the sea! The weave of the straw hat! It's worth at least three million. I have no intention of parting with it, of course. No, I won't sell it! Not even to you!Phoenix:(I wasn't interested...)Grossberg:It's not for sale!Phoenix:I'm not buying! (Geez!)PresentAnythingGrossberg:Very sorry, but I've got nothing to say regarding this matter.Fey & Co. Law OfficesPhoenix:... (Looks like Detective Gumshoe has gone home. The police are still keeping themselves busy in the chief's office. No one has time to talk to me. Guess I'll head out.)ExamineHouseplantPhoenix:Mia's favorite potted plant. I guess I'll have to water it now...Detention Center (after examining open drawer in Gatewater Hotel - Room 303, then visitng Grossberg Law Offices)Phoenix:Hmm... Maya's not here. She must be in questioning. They probably won't let her out for a while. Maybe I'd better go talk to that lawyer again.After clearing all Talk options in Grossberg Law Offices:September 6, 3:42 PMDetention CenterVisitor's RoomPhoenix:Hiya.Maya:Oh! You're back! Did you find the lawyer?Phoenix:Um... well... (What do I tell her?) Well, see... (Just be honest!) I... I really don't think you should use that guy. He... didn't seem healthy. He was all skin and bones!Maya:... What really happened?Phoenix:...Maya:You don't mean... He refused to help?Phoenix:Urp.Maya:... I see. I've been abandoned, then.After clearing \"Your mother's enemy\" Talk option in Detention Center - Visitor's Room, if all Talk options have been cleared in Grossberg Law OfficesLeads to:\"Just a little longer now before the state-appointed lawyer comes, I guess...\"Maya:Just a little longer now before the state-appointed lawyer comes, I guess...Phoenix:... (4:00 PM. Time's up. What should I do? Do I just leave her and go home...?)Go homePhoenix:(There's nothing left here for me to do... She'll be better off with a state-appointed lawyer.) I think I'd better get home now.Maya:Good-bye.Phoenix:It was a few days later when I found out how the story ended. The result of the trial was in the newspaper. \"Guilty.\" I'll probably never meet her again. Did I make the right choice? Will I ever know? Mia... if you can hear me, please, tell me! ...Phoenix:Not! I can't let that happen! I'm not leaving here until she takes me as her lawyer!Leads to:\"I've made up my mind!\"Defend MayaLeads to:\"I've made up my mind!\"Phoenix:I've made up my mind! I'm going to defend you whether you want me to or not!Maya:! Why?Phoenix:Why? Well...I can't abandon youPhoenix:... (No one is as sad as a person without any friends. I know... I've been there. A long time ago. Why did I become a lawyer in the first place...? Because someone has to look out for the people who have no one on their side.) Maya...Leads to:\"I won't abandon you. You can count on me.\"Someone else is the culpritPhoenix:You aren't the culprit! Someone else is!Maya:H-how do you know?Phoenix:I, um, I have a hunch... (Given the evidence, it would be easy to assume that Maya was the killer. But there's something about this whole thing that smells... fishy. That witness's strange behavior... was that all an act? And the way that lawyer refused to help out Maya... But more than all that, she has no one left to help her! Nothing is more sad, or more lonely than that. I know... I've been there. A long, long time ago. Why did I become a lawyer in the first place...? Because someone has to look out for the people who have no one on their side.) Maya...Leads to:\"I won't abandon you. You can count on me.\"I don't know whyPhoenix:To be honest, I don't know.Maya:You don't know?Phoenix:(Is this girl sitting in front of me the killer? All the evidence seems to say \"yes.\" But there's something about this whole thing that smells... fishy. That witness's strange behavior... was that all an act? And the way that lawyer refused to help out Maya... But more than all that, she has no one left to help her! Nothing is more sad, or more lonely than that. I know... I've been there. A long, long time ago. Why did I become a lawyer in the first place...? Because someone has to look out for the people who have no one on their side.) There's only one thing I know for certain.Leads to:\"I won't abandon you. You can count on me.\"Phoenix:I won't abandon you. You can count on me.Maya:... That's so kind of you... *sniff*... ...Phoenix:Well! Let's fight this one and get you out of here!Maya:R-right! Thank you!Phoenix:(Whew, she smiled at last. She looks like an entirely different person!) One last question... You are innocent, right?Maya:Yes! And I trust you... So you trust me, too, okay?Phoenix:It's a deal. (So, what next... There's something that's been bugging me... Just what was inside that strange woman's drawer? It was when I tried to look into the drawer that she got all defensive. There has to be something in there!)Gatewater HotelBellboy:Good afternoon, sir!Phoenix:Excuse me, you are...?Bellboy:Ah, I beg your pardon, sir! I am the bellboy of this establishment, at your service, sir.Phoenix:Oh, right.Bellboy:I've just come up to deliver room service, sir.Phoenix:Um... do you know where Miss May might be?Bellboy:Ah. I believe our guest Miss May is currently using the, er, facilities...? If you've no need of anything, I'll be taking my leave. Please, stay as long as you like. Enjoy...Phoenix:Yeah... Wait... no! Hey! ... (Why does it seem like every time I come here, I end up embarrassing myself? Wait... now's my chance to snoop around a bit!)Bellboy:Ah, I almost forgot!Phoenix:Gah! Y-you came back quick!Bellboy:Might I ask you to inform Miss May that there is a message for her? Please tell her that Mr. White, of Bluecorp phoned.Phoenix:Oh, right. Sure. (Mr. White... of Bluecorp? Where have I heard that name?)Maya:White... That was his name. My sister told me.Phoenix:(\"White\" was the name of the guy who ruined Mia and Maya's mother! Could it be a coincidence?)ExamineOpen drawerLeads to:\"There's a screwdriver sticking out of that half-open drawer.\"Phoenix:There's a screwdriver sticking out of that half-open drawer. Now's my chance to see what's inside! ...! What do we have here! A... wiretap? Hmm! What would a woman like her be doing with a thing like this?Wiretap added to the Court Record.Phoenix:There is definitely something suspicious about this \"Miss May\"! Why would she have something like this in her hotel room? There's a story behind all this, I know it! Alright... I'll be using this bit of evidence in tomorrow's trial, that's for sure. For Maya's sake... I'll get to this woman's bottom! Wait... I mean ... you know what I mean.April:Oh, bellboy...? Still there?Phoenix:(Uh oh, time to scram! I look forward to tangoing with you tomorrow, Miss May! In court!)To be continued.Nothing to examine during investigationPhoenix:No clues here.",
  "characters": [
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Mia Fey",
      "age": "27",
      "gender": "Female",
      "description1": "Chief Attorney at Fey & Co.. My boss, and a very good defense attorney.",
      "description2": "The victim. Chief attorney at Fey & Co. Law Offices, and an excellent defense lawyer."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Maya Fey",
      "age": "17",
      "gender": "Female",
      "description1": "Mia's little sister. Found bent over her sister's body, crying.",
      "description2": "The defendant. Mia's little sister, and a spirit medium in training.",
      "description3": "Mia's little sister. Currently training to become a spirit medium."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Dick Gumshoe",
      "age": "30",
      "gender": "Male",
      "description1": "Detective at the local precinct. In charge of the initial investigation."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Miles Edgeworth",
      "age": "24",
      "gender": "Male",
      "description1": "A gifted prosecutor, and a ruthless man who'd do anything to get a \"guilty\" verdict."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "April May",
      "age": "23",
      "gender": "Female",
      "description1": "An eye witness to the events. Testifies that she saw Maya commit the murder.",
      "description2": "Stayed with someone else in the hotel on the night of the murder. Tapped Mia's phone."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Marvin Grossberg",
      "age": "64",
      "gender": "Male",
      "description1": "A veteran defense attorney, and Mia's mentor."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Bellboy",
      "age": "26",
      "gender": "Male",
      "description1": "Bellboy at the Gatewater Hotel.",
      "description2": "Delivered room service to Miss May at the time of the murder. Also checked her in."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Redd White",
      "age": "39",
      "gender": "Male",
      "description1": "An eye witness. CEO of the information gathering company, Bluecorp."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "No one would believe I was a defense attorney if I didn't carry this."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "The Thinker",
      "type": "Weapons",
      "obtained": "Retrieved at Fey Law Office.",
      "description1": "The murder weapon. Looks like a statue, but it's actually a clock. Made by Larry Butz.",
      "description2": "Clock in the form of a statue. The clock's gears have been removed. Made by Larry Butz."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Glass Shards",
      "type": "Evidence",
      "obtained": "Retrieved at Fey Law Office.",
      "description1": "The broken remains of a glass light stand. Broken beyond all recognition."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Receipt",
      "type": "Evidence",
      "obtained": "Retrieved at Fey Law Office.",
      "description1": "A department store receipt with letters written in blood on the back.",
      "description2": "Receipt for a glass light stand. The date of purchase is the day before the murder."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Maya's Memo",
      "type": "Documents",
      "obtained": "Received from Maya Fey.",
      "description1": "\"A conversation I had with my sister is recorded on my cell phone.\""
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Mia's Autopsy Report",
      "type": "Reports",
      "obtained": "Received from Detective Dick Gumshoe.",
      "description1": "Time of death: 9/5 at 9:00PM. Cause: single blunt force trauma. Death was instantaneous.",
      "description2": "Died from a blow by a blunt object. May have lived for a few minutes after being hit."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Maya's Cell Phone",
      "type": "Other",
      "obtained": "Received from Detective Dick Gumshoe.",
      "description1": "Holds a conversation between the Chief and Maya. Click here for details."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Wiretap",
      "type": "Evidence",
      "obtained": "Retrieved at Gatewater Hotel.",
      "description1": "Found in Miss May's hotel room."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Floor Plans",
      "type": "Maps",
      "obtained": "Submitted as evidence during the trial.",
      "description1": "The murder scene, the Fey & Co. Law Offices. Click here for details."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "May Testimony",
      "type": "Documents",
      "obtained": "Received from Miss April May.",
      "description1": "\"The victim dodged an attack then ran to the right, but she was caught and struck.\""
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Photograph",
      "type": "Photographs",
      "obtained": "Retrieved at Grossberg Law Offices.",
      "description1": "On the back the words \"DL-6 Incident - Exhibit A\" are written in pencil."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Photograph",
      "type": "Photographs",
      "obtained": "Retrieved at Grossberg Law Offices.",
      "description1": "On the back the words \"DL-6 Incident - Exhibit B\" are written in pencil."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Bellboy's Affidavit",
      "type": "Documents",
      "obtained": "Received from the bellboy.",
      "description1": "Describes the man who stayed with Miss May in the hotel on the night of the murder."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Newspaper Clipping",
      "type": "Other",
      "obtained": "Retrieved at Fey Law Office.",
      "description1": "Article about politician's suicide. The word \"White\" is written in pen at the top."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Mia's Memo",
      "type": "Documents",
      "obtained": "Received from Mia Fey.",
      "description1": "A list of people's names in Mia's handwriting."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "Turnabout SistersTranscriptTranscript (JP)Part 1Part 2Part 3Part 4September 7, 10:00 AMDistrict CourtCourtroom No. 1Judge:The court is now in session for the trial of Ms. Maya Fey.Edgeworth:The prosecution is ready, Your Honor.Phoenix:The defense is ready, Your Honor. (Miles Edgeworth... I'd better not show any signs of weakness today, or he'll be on me in an instant.)Judge:Mr. Edgeworth. Please give the court your opening statement.Edgeworth:Thank you, Your Honor. The defendant, Ms. Maya Fey, was at the scene of the crime. The prosecution has evidence she committed this murder... and we have a witness who saw her do it. The prosecution sees no reason to doubt the facts of this case, Your Honor.Judge:I see. Thank you, Mr. Edgeworth. Let's begin then.Edgeworth:If we may call our first witness, Your Honor. (Changed from [You may call your first witness.] in the original release) The prosecution calls the chief officer at the scene, Detective Gumshoe!Edgeworth:Witness, please state your name and profession to the court.Gumshoe:Sir! My name's Dick Gumshoe, sir! I'm the detective in charge of homicides down at the precinct, sir!Edgeworth:Detective Gumshoe. Please, describe for us the details of this murder.Gumshoe:Very well, sir! Let me use this floor map of the office to explain. The body was found by this window, here.Edgeworth:And the cause of death?Gumshoe:Loss of blood due to being struck by a blunt object, sir! The murder weapon was a statue of \"The Thinker\" found next to the body, sir! It was heavy enough to be a deadly weapon, even in a girl's hands, sir!Judge:The court accepts the statue as evidence.Phoenix:(They're still calling it a \"statue\"...)Floor Plans added to the Court Record.Edgeworth:Now, Detective...Gumshoe:Y-yes sir!Edgeworth:You immediately arrested Ms. Maya Fey, who was found at the scene, correct? Can you tell me why?Gumshoe:Yes sir! I had hard evidence she did it, sir!Judge:Hmm. Detective Gumshoe. Please testify to the court about this \"hard evidence.\"Witness Testimony-- Maya Fey's Arrest --Gumshoe:As soon as the phone call came in, I rushed to the scene!There were two people there already:The defendant, Ms. Maya Fey, and the lawyer, Mr. Phoenix Wright.I immediately arrested Ms. Maya Fey!Why? We had a witness account describing her!The witness saw Ms. Maya Fey at the very moment of the murder!Judge:Hmm... The very moment, you say. Very well. Mr. Wright, you may begin your cross-examination.Phoenix:Y-yes, Your Honor. (Cross-examine what...? I couldn't see a single contradiction in that testimony...)...whoosh...SMACK!Phoenix:(Hey! Maya just threw something at me... What's this? \"When my sister couldn't find any contradictions in a witness's testimony she would bluff it and press the witness on every detail! The witness always slips up and says something wrong... It worked lots of times!\" Heh... I should have expected Maya would know some of her sister's tricks! Alright. Let's give this a try!)Judge:Something the matter?Phoenix:No, Your Honor. I'd like to begin my cross-examination.Cross ExaminationCross Examination-- Maya Fey's Arrest --Gumshoe:As soon as the phone call came in, I rushed to the scene!PressPhoenix:Phoenix:Who did you say you got a call from?Gumshoe:Hey pal, don't play dumb! You know who! The call was from a customer at the Gatewater Hotel, right across from the crime scene!Phoenix:(Hmm... okay, I pressed. Not sure it did much, though.) Right. Please continue.Gumshoe:There were two people there already:PressPhoenix:Phoenix:Detective Gumshoe, how long would you say it took, between you receiving the call, and your arrival at the scene of the crime?Gumshoe:Hmm, right... I'd say it was about 3 minutes!Phoenix:Th-that's pretty fast!Gumshoe:Our motto this month is \"quick response\"! That's how I got there before the killer got away!Edgeworth:Indeed! So, tell us who the two people you found on the scene were.Gumshoe:Yes sir!Gumshoe:The defendant, Ms. Maya Fey, and the lawyer, Mr. Phoenix Wright.PressPhoenix:Phoenix:Are you absolutely sure it was us?Gumshoe:Listen pal, your dumb act will only get you so far! With her funky hippie clothes and your spiky hair? You two stand out like... like suspicious people at a crime scene!Phoenix:(Well... he does have a point about her. She is pretty unmistakable. I should pick my points to press with a little more care...)Gumshoe:I immediately arrested Ms. Maya Fey!PressPhoenix:Phoenix:Why's that? What's your reason?Gumshoe:Why? We had a witness account describing her!PressPhoenix:Leads to:\"Hold on just one second!\"Gumshoe:The witness saw Ms. Maya Fey at the very moment of the murder!PressPhoenix:Leads to:\"Hold on just one second!\"Phoenix:(I can't see a single contradiction in there! I'll just have to take Maya's advice and press him on anything suspicious!)",
      "testimonies": [
        {
          "testimony": "As soon as the phone call came in, I rushed to the scene!",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "There were two people there already:",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "The defendant, Ms. Maya Fey, and the lawyer, Mr. Phoenix Wright.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "I immediately arrested Ms. Maya Fey!",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "Why? We had a witness account describing her!",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "The witness saw Ms. Maya Fey at the very moment of the murder!",
          "person": "Gumshoe",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- Maya Fey's Arrest --Gumshoe:As soon as the phone call came in, I rushed to the scene!PressPhoenix:Phoenix:Who did you say you got a call from?Gumshoe:Hey pal, don't play dumb! You know who! The call was from a customer at the Gatewater Hotel, right across from the crime scene!Phoenix:(Hmm... okay, I pressed. Not sure it did much, though.) Right. Please continue.Gumshoe:There were two people there already:PressPhoenix:Phoenix:Detective Gumshoe, how long would you say it took, between you receiving the call, and your arrival at the scene of the crime?Gumshoe:Hmm, right... I'd say it was about 3 minutes!Phoenix:Th-that's pretty fast!Gumshoe:Our motto this month is \"quick response\"! That's how I got there before the killer got away!Edgeworth:Indeed! So, tell us who the two people you found on the scene were.Gumshoe:Yes sir!Gumshoe:The defendant, Ms. Maya Fey, and the lawyer, Mr. Phoenix Wright.PressPhoenix:Phoenix:Are you absolutely sure it was us?Gumshoe:Listen pal, your dumb act will only get you so far! With her funky hippie clothes and your spiky hair? You two stand out like... like suspicious people at a crime scene!Phoenix:(Well... he does have a point about her. She is pretty unmistakable. I should pick my points to press with a little more care...)Gumshoe:I immediately arrested Ms. Maya Fey!PressPhoenix:Phoenix:Why's that? What's your reason?Gumshoe:Why? We had a witness account describing her!PressPhoenix:Leads to:\"Hold on just one second!\"Gumshoe:The witness saw Ms. Maya Fey at the very moment of the murder!PressPhoenix:Leads to:\"Hold on just one second!\"Phoenix:(I can't see a single contradiction in there! I'll just have to take Maya's advice and press him on anything suspicious!)Phoenix:Hold on just one second!Gumshoe:Y-yeah?Phoenix:If I heard correctly... You said you arrested her because you had \"hard evidence\" she did it, correct?Gumshoe:Huh? Did... did I say that? Me?Phoenix:I heard you say it!Judge:You did say it.Edgeworth:You said it.Phoenix:Exactly what about this suspicious woman in pink's claim was \"hard evidence\"!?Gumshoe:Wh-what!? Miss May isn't suspicious, and she sure isn't pink, pal! W-well, I guess she is pink...Judge:That's enough, Detective Gumshoe. Do you have any more solid proof other than her claims, Detective?Gumshoe:Umm...Phoenix:(Hmm! I guess pressing can have its advantages!)Gumshoe:... Yes.Phoenix:(Gah!)Gumshoe:Sorry, I got the order of things mixed up in my testimony, Your Honor Sir! There was something I should have told you about first, Your Honor!Judge:Very well, Detective. Let's hear your testimony again.Witness Testimony-- Hard Evidence --Gumshoe:After securing the suspect, I examined the scene of the crime with my own eyes.I found a memo written on a piece of paper next to the victim's body!On it, the word \"Maya\" was written clearly in blood!Lab test results showed that the blood was the victim's!Also, there was blood found on the victim's finger!Before she died, the victim wrote the killer's name!How you like that? That's my \"hard evidence\"!Judge:Hmm... Before we begin cross-examination, I have a question for you, Detective.Gumshoe:Y-Your Honor?Judge:Why didn't you testify about this vital piece of evidence the first time!?Gumshoe:Ah... eh... I know. I'm real embarrassed I forgot about it, Your Honor Sir.Judge:Try to be more careful! Very well, the defense may begin its cross-examination.Cross ExaminationCross Examination-- Hard Evidence --Gumshoe:After securing the suspect, I examined the scene of the crime with my own eyes.PressPhoenix:Phoenix:And did you find any evidence?Gumshoe:Now, now, don't jump the gun on me, pal. Just listen. I'm getting to the good part!Phoenix:(I got a bad feeling about this...)Gumshoe:I found a memo written on a piece of paper next to the victim's body!PressPhoenix:Phoenix:Just because you found it next to the body doesn't mean the victim wrote it!Gumshoe:Ho hoh! Then who did write it, smarty-pants?Phoenix:Wh-who? Um...The killerPhoenix:Th-the killer! Anyone can see that!Gumshoe:Hoh. You're saying the killer wrote her OWN name!? Buddy, please!Phoenix:She was framed!Edgeworth:Edgeworth:Hold on. If that's the case, where's your evidence?Phoenix:Ah... (Urk!)Edgeworth:Hah! I guess that was a bit of a tall order for you. Those without evidence shouldn't open their mouths, Mr. Wright.Gumshoe:Yeah, pal!Phoenix:(Argh...!)Leads to:\"Well, Detective? Tell us what was written on that memo you found.\"Miss MayPhoenix:Well... it could have been the witness, Miss May!Edgeworth:Edgeworth:Hold on. The witness was in her hotel room, not the office. Try pulling the other leg, Mr. Wright!Gumshoe:Yeah, and while you're at it, pull mine too, pal!Phoenix:(Argh...!)Leads to:\"Well, Detective? Tell us what was written on that memo you found.\"I didPhoenix:It... it could have been me!Gumshoe:What! S-so it was you!Phoenix:No, no, no, I'm just saying it COULD have been me! Can you prove it wasn't?Edgeworth:Edgeworth:Hold on. So, you admit to this? You admit that you wrote the note?Phoenix:Uh...Edgeworth:Listen to me, Mr. Wright. This is a court of law, and I expect you to refrain from making thoughtless statements! Amateur!Phoenix:(...!)Leads to:\"Well, Detective? Tell us what was written on that memo you found.\"Edgeworth:Well, Detective? Tell us what was written on that memo you found.Present Mia's Autopsy ReportPhoenix:Leads to:\"Detective Gumshoe!\"Gumshoe:On it, the word \"Maya\" was written clearly in blood!PressPhoenix:Phoenix:Do you have proof it was Mia who wrote that!?Gumshoe:Of course I do, pal!Phoenix:(Uh oh... he sounded pretty confident. This might not be good...)Present Mia's Autopsy ReportPhoenix:Leads to:\"Detective Gumshoe!\"Gumshoe:Lab test results showed that the blood was the victim's!PressPhoenix:Phoenix:What kind of \"tests\" were these again?Gumshoe:Huh? What kind? Umm... well... I hear they take the, um, little bits in the blood, the... er... hemo... hemogl... Hermo... goblins... hobgob... Er...? Herma-goblin bobbin... I-I refuse to testify on this matter, sir! I'm no expert on blood tests!Judge:Yes, that was quite clear. You may continue with your testimony.Gumshoe:Th-thanks, pal. I mean Your Honor Sir.Edgeworth:Detective Gumshoe.Gumshoe:Y-yeah?Edgeworth:I think you can expect a pleasant bonus in your next pay check.Gumshoe:Oh? Oh hoh hoh.Phoenix:(That was a mess...)Gumshoe:Right! Where was I?Present Mia's Autopsy ReportPhoenix:Leads to:\"Detective Gumshoe!\"Gumshoe:Also, there was blood found on the victim's finger!PressPhoenix:Phoenix:On which hand was the bloody finger, Detective?Gumshoe:The right hand!Phoenix:(Hmm... she WAS right handed...)Gumshoe:Hah hah hah! Nice try!Phoenix:(Uh oh... I guess it wasn't too hard to see what I was getting at there.)Present Mia's Autopsy ReportPhoenix:Leads to:\"Detective Gumshoe!\"Gumshoe:Before she died, the victim wrote the killer's name!PressPhoenix:Phoenix:Detective Gumshoe! Do you get a lot of cases where the victim actually writes the killer's name?Gumshoe:Sure! It happens all the time in books and the movies!Phoenix:This isn't a movie, Detective.Gumshoe:Oof!Phoenix:Let's talk about reality, shall we?Gumshoe:Umm... I guess, I haven't heard of many cases... no.Phoenix:Don't you find it a little odd that the victim would write down a name? Especially the name of her own sister?Gumshoe:Ah, yeah, actually, you got a point, pal.Edgeworth:Edgeworth:Stop right there. The witness's opinion on the matter is irrelevant! The facts are clear: the victim wrote down the name of the accused... The victim told us the name of her killer!Judge:Order! Order!Phoenix:(That didn't go so well...)Gumshoe:Th-that's right! What he said!Present Mia's Autopsy ReportPhoenix:Leads to:\"Detective Gumshoe!\"Phoenix:(That's his whole testimony... Okay, there has to be a contradiction in there somewhere. Let's find it!)",
      "testimonies": [
        {
          "testimony": "After securing the suspect, I examined the scene of the crime with my own eyes.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "I found a memo written on a piece of paper next to the victim's body!",
          "person": "Gumshoe",
          "present": [
            "Mia's Autopsy Report"
          ],
          "source": {
            "evidence_span": "Death was instantaneous.",
            "testimony_span": "I found a memo written on a piece of paper next to the victim's body!",
            "explanation": "If the victim died immediately, they could not have written a memo after being assaulted.",
            "is_self_contained": "yes",
            "context_span": "",
            "difficulty": "common sense"
          }
        },
        {
          "testimony": "On it, the word \"Maya\" was written clearly in blood!",
          "person": "Gumshoe",
          "present": [
            "Mia's Autopsy Report"
          ],
          "source": {
            "evidence_span": "Death was instantaneous.",
            "testimony_span": "the word \"Maya\" was written clearly in blood",
            "explanation": "If the victim died immediately, they could not have written a memo after being assaulted.",
            "is_self_contained": "yes",
            "context_span": "",
            "difficulty": "common sense"
          }
        },
        {
          "testimony": "Lab test results showed that the blood was the victim's!",
          "person": "Gumshoe",
          "present": [
            "Mia's Autopsy Report"
          ],
          "source": {
            "evidence_span": "Death was instantaneous.",
            "testimony_span": "the blood was the victim's",
            "explanation": "If the victim died immediately, they could not have written a memo after being assaulted.",
            "is_self_contained": "yes",
            "context_span": "",
            "difficulty": "common sense"
          }
        },
        {
          "testimony": "Also, there was blood found on the victim's finger!",
          "person": "Gumshoe",
          "present": [
            "Mia's Autopsy Report"
          ],
          "source": {
            "evidence_span": "Death was instantaneous.",
            "testimony_span": "there was blood found on the victim's finger",
            "explanation": "If the victim died immediately, they could not have written a memo after being assaulted.",
            "is_self_contained": "yes",
            "context_span": "",
            "difficulty": "common sense"
          }
        },
        {
          "testimony": "Before she died, the victim wrote the killer's name!",
          "person": "Gumshoe",
          "present": [
            "Mia's Autopsy Report"
          ],
          "source": {
            "evidence_span": "Death was instantaneous.",
            "testimony_span": "Before she died, the victim wrote the killer's name!",
            "explanation": "If the victim died immediately, they could not have written a memo after being assaulted.",
            "is_self_contained": "yes",
            "context_span": "",
            "difficulty": "common sense"
          }
        }
      ],
      "summarizedContext": "Officer Gumshoe is describing the crime scene as he found it.",
      "noPresent": false,
      "difficulty": "common sense",
      "labels": [
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims the victim wrote a memo before dying.",
        "Fact 2: The evidence suggests the victim died immediately after being struck.",
        "Prop 1: If someone dies immediately, they cannot write a memo after being assaulted."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- Hard Evidence --Gumshoe:After securing the suspect, I examined the scene of the crime with my own eyes.PressPhoenix:Phoenix:And did you find any evidence?Gumshoe:Now, now, don't jump the gun on me, pal. Just listen. I'm getting to the good part!Phoenix:(I got a bad feeling about this...)Gumshoe:I found a memo written on a piece of paper next to the victim's body!PressPhoenix:Phoenix:Just because you found it next to the body doesn't mean the victim wrote it!Gumshoe:Ho hoh! Then who did write it, smarty-pants?Phoenix:Wh-who? Um...The killerPhoenix:Th-the killer! Anyone can see that!Gumshoe:Hoh. You're saying the killer wrote her OWN name!? Buddy, please!Phoenix:She was framed!Edgeworth:Edgeworth:Hold on. If that's the case, where's your evidence?Phoenix:Ah... (Urk!)Edgeworth:Hah! I guess that was a bit of a tall order for you. Those without evidence shouldn't open their mouths, Mr. Wright.Gumshoe:Yeah, pal!Phoenix:(Argh...!)Leads to:\"Well, Detective? Tell us what was written on that memo you found.\"Miss MayPhoenix:Well... it could have been the witness, Miss May!Edgeworth:Edgeworth:Hold on. The witness was in her hotel room, not the office. Try pulling the other leg, Mr. Wright!Gumshoe:Yeah, and while you're at it, pull mine too, pal!Phoenix:(Argh...!)Leads to:\"Well, Detective? Tell us what was written on that memo you found.\"I didPhoenix:It... it could have been me!Gumshoe:What! S-so it was you!Phoenix:No, no, no, I'm just saying it COULD have been me! Can you prove it wasn't?Edgeworth:Edgeworth:Hold on. So, you admit to this? You admit that you wrote the note?Phoenix:Uh...Edgeworth:Listen to me, Mr. Wright. This is a court of law, and I expect you to refrain from making thoughtless statements! Amateur!Phoenix:(...!)Leads to:\"Well, Detective? Tell us what was written on that memo you found.\"Edgeworth:Well, Detective? Tell us what was written on that memo you found.Present Mia's Autopsy ReportPhoenix:Leads to:\"Detective Gumshoe!\"Gumshoe:On it, the word \"Maya\" was written clearly in blood!PressPhoenix:Phoenix:Do you have proof it was Mia who wrote that!?Gumshoe:Of course I do, pal!Phoenix:(Uh oh... he sounded pretty confident. This might not be good...)Present Mia's Autopsy ReportPhoenix:Leads to:\"Detective Gumshoe!\"Gumshoe:Lab test results showed that the blood was the victim's!PressPhoenix:Phoenix:What kind of \"tests\" were these again?Gumshoe:Huh? What kind? Umm... well... I hear they take the, um, little bits in the blood, the... er... hemo... hemogl... Hermo... goblins... hobgob... Er...? Herma-goblin bobbin... I-I refuse to testify on this matter, sir! I'm no expert on blood tests!Judge:Yes, that was quite clear. You may continue with your testimony.Gumshoe:Th-thanks, pal. I mean Your Honor Sir.Edgeworth:Detective Gumshoe.Gumshoe:Y-yeah?Edgeworth:I think you can expect a pleasant bonus in your next pay check.Gumshoe:Oh? Oh hoh hoh.Phoenix:(That was a mess...)Gumshoe:Right! Where was I?Present Mia's Autopsy ReportPhoenix:Leads to:\"Detective Gumshoe!\"Gumshoe:Also, there was blood found on the victim's finger!PressPhoenix:Phoenix:On which hand was the bloody finger, Detective?Gumshoe:The right hand!Phoenix:(Hmm... she WAS right handed...)Gumshoe:Hah hah hah! Nice try!Phoenix:(Uh oh... I guess it wasn't too hard to see what I was getting at there.)Present Mia's Autopsy ReportPhoenix:Leads to:\"Detective Gumshoe!\"Gumshoe:Before she died, the victim wrote the killer's name!PressPhoenix:Phoenix:Detective Gumshoe! Do you get a lot of cases where the victim actually writes the killer's name?Gumshoe:Sure! It happens all the time in books and the movies!Phoenix:This isn't a movie, Detective.Gumshoe:Oof!Phoenix:Let's talk about reality, shall we?Gumshoe:Umm... I guess, I haven't heard of many cases... no.Phoenix:Don't you find it a little odd that the victim would write down a name? Especially the name of her own sister?Gumshoe:Ah, yeah, actually, you got a point, pal.Edgeworth:Edgeworth:Stop right there. The witness's opinion on the matter is irrelevant! The facts are clear: the victim wrote down the name of the accused... The victim told us the name of her killer!Judge:Order! Order!Phoenix:(That didn't go so well...)Gumshoe:Th-that's right! What he said!Present Mia's Autopsy ReportPhoenix:Leads to:\"Detective Gumshoe!\"Phoenix:(That's his whole testimony... Okay, there has to be a contradiction in there somewhere. Let's find it!)Phoenix:Detective Gumshoe! There's one thing I want you to clarify for me here. You say that the victim, Mia Fey, wrote this note. That she was accusing the defendant, Maya Fey? That's really what you're saying?Gumshoe:Wh-what? This isn't one of those lawyer tricks, now, is it? Of course she wrote it! Who else could have!?Phoenix:You have it backwards, Detective.Gumshoe:B-backwards?Phoenix:The victim is the only person who absolutely could NOT have written it! This is a report from your department, Detective. \"Immediate death due to a blow from a blunt object.\" She died immediately!Gumshoe:But...!Phoenix:No \"but\"-ing your way out of this one, Detective!Judge:Order! Order! The defense has a point. Someone who died immediately wouldn't have the time to write anything down.Edgeworth:Edgeworth:Mr. Wright. I beg your pardon, but when exactly did you obtain that autopsy report?Phoenix:Wh-when...!?The day of the murderPhoenix:I... I'm pretty sure it was the day of the murder.Gumshoe:You're wrong there, pal! We didn't write an autopsy report 'til the day after!Phoenix:Oh. Right.Leads to:\"The prosecution's point being...?\"The day after the murderPhoenix:It was the day after the murder...Leads to:\"The prosecution's point being...?\"I forgetPhoenix:I'm... sorry, I forgot.Edgeworth:Hah! Forgot, you say?Gumshoe:It was the day after the murder, Your Honor Sir. I was the one who handed it to him myself! Personally!Phoenix:Oh. R-right.Leads to:\"The prosecution's point being...?\"Judge:The prosecution's point being...?Edgeworth:That autopsy report is outdated, Your Honor.Phoenix:Wh-what!?Edgeworth:A second autopsy was performed yesterday, at my request! \"Death was almost immediate due to a blow from a blunt object... But there is a possibility the victim lived for several minutes after the blow.\" I received these results this morning.Phoenix:N-no way!Edgeworth:Your Honor! It's quite easy to imagine that the victim did have time to write \"Maya\"! That is all.Judge:I see!Phoenix:(Damn you, Edgeworth! I should have known you'd have something up your sleeve!)Edgeworth:Why, Mr. Wright, you look shocked! Something you want to say?You're a sham, Edgeworth!Phoenix:Mr. Edgeworth... I've heard there's nothing you won't do to get your verdict... What reason could you possibly have had to request a second autopsy report?Judge:Mr. Wright! The defense will refrain from personal attacks on the prosecution!Edgeworth:No matter, Your Honor... Mr. Wright. Say what you will, the evidence in this report is undeniable.Leads to:\"Your Honor, I submit this report to the court.\"The detective's a sham!Phoenix:Detective Gumshoe! You're a sham! How could you give me a faulty report!?Gumshoe:Huh? I-I thought...Edgeworth:Detective Gumshoe.Gumshoe:Urp!Edgeworth:I'm disappointed in you, handing him the wrong report like that.Gumshoe:Eh...? I... I'm sorry, sir.Edgeworth:You are at fault, Detective. This isn't going to look good on your evaluation next month.Gumshoe:W-what? B-but... *sigh*Leads to:\"Your Honor, I submit this report to the court.\"I'm a sham!Phoenix:Detective Gumshoe. Are you calling me a fool because I believed your report?Gumshoe:Huh? Me? I-I'm not... huh?Edgeworth:Detective Gumshoe.Gumshoe:Urp!Edgeworth:I'm disappointed in you, handing him the wrong report like that.Gumshoe:Eh...? I... I'm sorry, sir.Edgeworth:You are at fault, Detective. This isn't going to look good on your evaluation next month.Gumshoe:W-what? B-but... *sigh*Leads to:\"Your Honor, I submit this report to the court.\"Edgeworth:Your Honor, I submit this report to the court.Judge:U-understood. The court accepts the evidence.Autopsy Report updated in the Court Record.Edgeworth:Well, Your Honor? The evidence strongly suggests the victim was identifying the killer.Judge:I suppose that's the obvious conclusion, yes.Phoenix:(Darn! This isn't good!)Edgeworth:The prosecution would like to call its next witness. This poor, innocent girl saw the murder with her own eyes!Judge:Let the witness Miss April May take the stand.Phoenix:(Exactly what part of her is \"innocent\"...?)Edgeworth:Witness, your name, please.April:April May! At your service! *wink*Judge:Order! An introduction should not require any reaction from the crowd! The witness will refrain from wanton winking! ([wanton] misspelled as [wonton] in the original release)April:Aww... Yes, Your Honor.Phoenix:(This is not good... She's already captured the heart of every man in the court!)Edgeworth:Tell us, where were you on the night of September 5, when the murder occurred?April:Um... gee... I was, like, in my hotel room? Tee hee. I checked in right after lunch.Edgeworth:And this hotel is directly across from the Fey & Co. Law Offices?April:Mmm... that's right, big boy.Judge:Please testify to the court about what you saw.Witness Testimony-- Witness's Account --April:It was, like, 9:00 at night. I looked out the window, y'know!And then, oooh! I saw a woman with long hair being attacked!The one attacking her was the mousey girl sitting in the defendant's chair!Then the woman, like, dodged to one side and ran away!But that girl, she caught up to her and... and... She hit her!Then the woman with long hair...She kinda... slumped.The end. That's all I saw. Every little bitsy witsy! *wink*Judge:Hmm...Edgeworth:Well, Your Honor?Judge:I see. It is a remarkably solid testimony. I don't see a need to trouble the witness any...Phoenix:W-wait, Your Honor!Judge:Yes, Mr. Wright?Phoenix:What about my cross-examination!?Judge:I thought the witness's testimony just now was quite... firm. Didn't you?Edgeworth:Mr. Wright... I understand you were Ms. Mia Fey's understudy, were you not? You must know her techniques well. Her cowardly way of finding tiny faults in perfectly good testimonies...Phoenix:H-hey! How dare you!Judge:Well, Mr. Wright? Will you cross-examine the witness?Yes, I'm doing itPhoenix:I'll gladly proceed with the cross-examination. (If only because I have a feeling Edgeworth doesn't want me to! She has to have some weakness!)Leads to:\"Very well, you may begin your cross-examination!\"No thanksPhoenix:No... you're right. I guess there wouldn't be much point.Edgeworth:Heh heh heh. I'm glad you saw the error of your ways so soon! Your Honor. The prosecution rests its case!Phoenix:(Wh-what? That's it!?)Judge:Very well.Phoenix:W-wait! Hold on!Judge:Yes, Mr. Wright? Changed your mind? Will you cross-examine the witness?Phoenix:Yes yes yes! (I'd better, or I'll lose on the spot!)Leads to:\"Very well, you may begin your cross-examination!\"Judge:Very well, you may begin your cross-examination!Cross ExaminationCross Examination-- Witness's Account --April:It was, like, 9:00 at night. I looked out the window, y'know!PressPhoenix:Phoenix:Why did you do that?April:Huh? \"Why\"? Like, why what?Phoenix:Why did you look out the window? Were you expecting to see something?April:Oh, well, um... gee!Phoenix:(What? That's it? She can't get out of this question that easily!)April:I sort of, y'know. I had a feeling!Phoenix:(Well, I have a feeling she's trying to avoid the question! Maybe I should press a little harder on this one?)Go for itPhoenix:(Let's see how far I can run with this...) Surely, you must have had a reason to look out your window at that time of night!April:I... oooh!Edgeworth:Edgeworth:Mr. Wright! I will not have you badgering my witness!Phoenix:B-badgering?Edgeworth:You insist on needling her with these trivial questions. I really don't think it should be allowed.(Yeah! Yeah! Stop him!)(The poor girl!)Judge:Order! Mr. Wright, you have been warned.Phoenix:(Poor girl!? What about poor me!?)Leads to:\"You looked out the window. What did you see next?\"Back downPhoenix:(If I go too deep, I might not come back out alive... I'll back off for now.)Leads to:\"You looked out the window. What did you see next?\"Edgeworth:You looked out the window. What did you see next?April:And then, oooh! I saw a woman with long hair being attacked!PressPhoenix:Phoenix:The woman with long hair... that was Mia Fey?April:Um-hmm! Slender, sort of, well, some people might say pretty, if that's your thing.Phoenix:(Your... thing?)Edgeworth:And the person attacking her?April:The one attacking her was the mousey girl sitting in the defendant's chair!PressPhoenix:Phoenix:How do you know she was the defendant?April:Huh? Well... y'know! S-she had a girlish physique. Women know these things. Look... I-I just know, okay?Edgeworth:There was only one person at the scene of the crime with a short, girlish figure. The testimony is bulletproof, Your Honor.Phoenix:(He's right...)Yep, he's rightPhoenix:(Her testimony certainly does make sense... And everyone in the court keeps siding with her. I'd better not press too hard on this one.)Edgeworth:So then, tell us what happened to the victim.Leads back to cross-examinationI question the testimonyLeads to:\"Hold on a minute! That testimony stinks!\"April:Then the woman, like, dodged to one side and ran away!PressPhoenix:Phoenix:She \"dodged\"? Dodged what!?April:Well... the attack!Edgeworth:Please, continue your testimony.April:But that girl, she caught up to her and... and... She hit her!PressPhoenix:Phoenix:How did you know it was my client!?April:Huh? Well, I... gee! First of all, she had a girl's physique! And, and secondly, she was... she was small! Who else could it be but her!Phoenix:(She has a point...)You're rightPhoenix:(Her testimony certainly does make sense... And everyone in the court keeps siding with her. I'd better not press too hard on this one. Maybe I should just listen to the testimony again.)Leads back to cross-examinationI question your testimonyLeads to:\"Hold on a minute! That testimony stinks!\"Phoenix:(Hmm... that's it? Nothing really jumps out as a contradiction... There's got to be something in there somewhere! Maybe I'd better just press her on the facts a bit!)",
      "testimonies": [
        {
          "testimony": "It was, like, 9:00 at night. I looked out the window, y'know!",
          "person": "April",
          "present": []
        },
        {
          "testimony": "And then, oooh! I saw a woman with long hair being attacked!",
          "person": "April",
          "present": []
        },
        {
          "testimony": "The one attacking her was the mousey girl sitting in the defendant's chair!",
          "person": "April",
          "present": []
        },
        {
          "testimony": "Then the woman, like, dodged to one side and ran away!",
          "person": "April",
          "present": []
        },
        {
          "testimony": "But that girl, she caught up to her and... and... She hit her!",
          "person": "April",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- Witness's Account --April:It was, like, 9:00 at night. I looked out the window, y'know!PressPhoenix:Phoenix:Why did you do that?April:Huh? \"Why\"? Like, why what?Phoenix:Why did you look out the window? Were you expecting to see something?April:Oh, well, um... gee!Phoenix:(What? That's it? She can't get out of this question that easily!)April:I sort of, y'know. I had a feeling!Phoenix:(Well, I have a feeling she's trying to avoid the question! Maybe I should press a little harder on this one?)Go for itPhoenix:(Let's see how far I can run with this...) Surely, you must have had a reason to look out your window at that time of night!April:I... oooh!Edgeworth:Edgeworth:Mr. Wright! I will not have you badgering my witness!Phoenix:B-badgering?Edgeworth:You insist on needling her with these trivial questions. I really don't think it should be allowed.(Yeah! Yeah! Stop him!)(The poor girl!)Judge:Order! Mr. Wright, you have been warned.Phoenix:(Poor girl!? What about poor me!?)Leads to:\"You looked out the window. What did you see next?\"Back downPhoenix:(If I go too deep, I might not come back out alive... I'll back off for now.)Leads to:\"You looked out the window. What did you see next?\"Edgeworth:You looked out the window. What did you see next?April:And then, oooh! I saw a woman with long hair being attacked!PressPhoenix:Phoenix:The woman with long hair... that was Mia Fey?April:Um-hmm! Slender, sort of, well, some people might say pretty, if that's your thing.Phoenix:(Your... thing?)Edgeworth:And the person attacking her?April:The one attacking her was the mousey girl sitting in the defendant's chair!PressPhoenix:Phoenix:How do you know she was the defendant?April:Huh? Well... y'know! S-she had a girlish physique. Women know these things. Look... I-I just know, okay?Edgeworth:There was only one person at the scene of the crime with a short, girlish figure. The testimony is bulletproof, Your Honor.Phoenix:(He's right...)Yep, he's rightPhoenix:(Her testimony certainly does make sense... And everyone in the court keeps siding with her. I'd better not press too hard on this one.)Edgeworth:So then, tell us what happened to the victim.Leads back to cross-examinationI question the testimonyLeads to:\"Hold on a minute! That testimony stinks!\"April:Then the woman, like, dodged to one side and ran away!PressPhoenix:Phoenix:She \"dodged\"? Dodged what!?April:Well... the attack!Edgeworth:Please, continue your testimony.April:But that girl, she caught up to her and... and... She hit her!PressPhoenix:Phoenix:How did you know it was my client!?April:Huh? Well, I... gee! First of all, she had a girl's physique! And, and secondly, she was... she was small! Who else could it be but her!Phoenix:(She has a point...)You're rightPhoenix:(Her testimony certainly does make sense... And everyone in the court keeps siding with her. I'd better not press too hard on this one. Maybe I should just listen to the testimony again.)Leads back to cross-examinationI question your testimonyLeads to:\"Hold on a minute! That testimony stinks!\"Phoenix:(Hmm... that's it? Nothing really jumps out as a contradiction... There's got to be something in there somewhere! Maybe I'd better just press her on the facts a bit!)Phoenix:Hold on a minute! That testimony stinks!April:W-what!?Phoenix:Miss May, I'm willing to bet that...You saw nothingPhoenix:Did you really see the defendant at all!?Leads to:\"Urp!\"You're lyingPhoenix:Are you telling the truth? Did you really see the defendant!?Leads to:\"Urp!\"April:Urp!Judge:Mr. Wright! What's the meaning of this?April:Yes, what is the meaning! Somebody tell me because I'm clueless! About this, I mean!Phoenix:Okay... If you had really witnessed my client, Maya Fey... You would have noticed her clothes before noticing her physique!April:...!Phoenix:No one wears clothes like this on a daily basis! Except her! And I'm no expert on fashion, but her hairdo looks far from normal to me! However, the witness's testimony mentions neither of these things! The testimony is bogus!April:But... but!Judge:Still, we don't know if she was dressed that way the night of the murder...Phoenix:She was, Your Honor! I saw her. And so did Detective Gumshoe! What do you say to that, Miss May?April:Rowr! What are you trying to say, you mean lawyer! I-I saw what I saw. I... just didn't think all the trifling little details were necessary, darling.Judge:Miss May. The court would like to remind you to please omit nothing in your testimony.April:I'm sorry, Your Honor. I'll be a good girl. I promise. *wink*Judge:Your testimony again, if you would.Phoenix:(Damn, I almost had her!)Witness Testimony-- Witness's Account --April:I did see everything! I did!The victim--the woman--dodged the first attack and ran off to the right.Then the girl in the hippie clothes ran after her...And she hit her with that weapon! I saw it! I did!That... that clock! Um... the kinda statue-y clock? \"The Thinker,\" I think?Well? Does the accuracy of my report not startle you? Tee hee!Judge:I... see. I only wish you had been so detailed from the beginning. Please begin the cross-examination.Cross ExaminationCross Examination-- Witness's Account --April:I did see everything! I did!PressPhoenix:Phoenix:So, you saw me then, too?April:Of course! I'd remember that spiky hair anywhere!Phoenix:(Spiky...?)Judge:The witness will refrain from personal attacks on the defense attorney.April:Aww, was I a bad girl? I'm sowwy.Judge:Very well... continue.April:The victim--the woman--dodged the first attack and ran off to the right.PressPhoenix:Phoenix:Is that \"right\" as in your right, as you looked from the hotel?April:Um... which hand do I hold my knife in again...? Right! It was my right hand! Right?Edgeworth:Satisfied, Mr. Wright? Please continue.April:Then the girl in the hippie clothes ran after her...PressPhoenix:Phoenix:How convenient for you to remember her \"hippie\" clothes!April:That's what you--I mean, that's what she was wearing! Oh, and her hair was all done up like a bun!Phoenix:(*sigh*...)Judge:What happened then?April:And she hit her with that weapon! I saw it! I did!PressPhoenix:Phoenix:Where did this weapon come from?April:She picked it up from the desk!Judge:I see. What sort of weapon was it?April:That... that clock! Um... the kinda statue-y clock? \"The Thinker,\" I think?PressPhoenix:Phoenix:A... clock? (Didn't this come up in another testimony recently...?)April:W-well? Don't look so sour, Mr. Lawyer. You can't win them all.Phoenix:(No... but I have a feeling I'm on to something now!)Present The ThinkerPhoenix:Leads to:\"Miss May.\"Phoenix:(Her previous testimony must have been what Edgeworth wanted her to say... So this was the testimony in her own words...? Time to press and squeeze the truth out of her! Figuratively, of course.)",
      "testimonies": [
        {
          "testimony": "I did see everything! I did!",
          "person": "April",
          "present": []
        },
        {
          "testimony": "The victim--the woman--dodged the first attack and ran off to the right.",
          "person": "April",
          "present": []
        },
        {
          "testimony": "Then the girl in the hippie clothes ran after her...",
          "person": "April",
          "present": []
        },
        {
          "testimony": "And she hit her with that weapon! I saw it! I did!",
          "person": "April",
          "present": []
        },
        {
          "testimony": "That... that clock! Um... the kinda statue-y clock? \"The Thinker,\" I think?",
          "person": "April",
          "present": [
            "The Thinker"
          ],
          "source": {
            "evidence_span": "Looks like a statue, but it's actually a clock.",
            "testimony_span": "That... that clock! Um... the kinda statue-y clock?",
            "explanation": "One cannot know by looking that the statue is a clock.",
            "is_self_contained": "yes",
            "context_span": "",
            "difficulty": "common sense"
          }
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness April is describing when the victim got hit.",
      "difficulty": "common sense",
      "labels": [
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims the murder weapon is a clock.",
        "Fact 2: The evidence suggests the clock looks like a statue.",
        "Prop 1: If A looks like B from the outside, one would believe A is B just by looking."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- Witness's Account --April:I did see everything! I did!PressPhoenix:Phoenix:So, you saw me then, too?April:Of course! I'd remember that spiky hair anywhere!Phoenix:(Spiky...?)Judge:The witness will refrain from personal attacks on the defense attorney.April:Aww, was I a bad girl? I'm sowwy.Judge:Very well... continue.April:The victim--the woman--dodged the first attack and ran off to the right.PressPhoenix:Phoenix:Is that \"right\" as in your right, as you looked from the hotel?April:Um... which hand do I hold my knife in again...? Right! It was my right hand! Right?Edgeworth:Satisfied, Mr. Wright? Please continue.April:Then the girl in the hippie clothes ran after her...PressPhoenix:Phoenix:How convenient for you to remember her \"hippie\" clothes!April:That's what you--I mean, that's what she was wearing! Oh, and her hair was all done up like a bun!Phoenix:(*sigh*...)Judge:What happened then?April:And she hit her with that weapon! I saw it! I did!PressPhoenix:Phoenix:Where did this weapon come from?April:She picked it up from the desk!Judge:I see. What sort of weapon was it?April:That... that clock! Um... the kinda statue-y clock? \"The Thinker,\" I think?PressPhoenix:Phoenix:A... clock? (Didn't this come up in another testimony recently...?)April:W-well? Don't look so sour, Mr. Lawyer. You can't win them all.Phoenix:(No... but I have a feeling I'm on to something now!)Present The ThinkerPhoenix:Leads to:\"Miss May.\"Phoenix:(Her previous testimony must have been what Edgeworth wanted her to say... So this was the testimony in her own words...? Time to press and squeeze the truth out of her! Figuratively, of course.)Phoenix:Miss May. What you said just now was quite... revealing.April:Revealing? Oooh, you'd like that, wouldn't you. Naughty Mr. Lawyer...Phoenix:You just said that this statue of \"The Thinker\" was a clock. But there's no way of knowing that just by looking at it!April:Urp!Phoenix:Another person in much the same position as you recently called this a \"clock,\" too... And he was found guilty... of murder!Judge:Order! Order!Phoenix:Miss May. Can you explain how you know this was a clock?April:Oooh... urp!Edgeworth:Edgeworth:The witness saw the murder with her own eyes! That's all that's important here! The defense is trying to confuse the issue with trivial concerns!Judge:Yes... yes, of course. You will withdraw your question, Mr. Wright.Phoenix:Phoenix:But questions are all I have, Your Honor! And as you may recall, I've caught murderers with these questions before! (Well, only once...)Judge:... ... Objection sustained. You may continue to question the witness.Phoenix:(Whew, that was close. If he stopped me there, the trial would be over!)April:Huh? What? So... what happens now?Phoenix:What happens now is you answer my question! How did you know it was a clock?April:What...! Th-that's... ...Because... I heard it? Yes! I heard it say the time!Phoenix:So, you've been to the law offices of Fey & Co.!April:N-n-no! Hey, I didn't say that! Why would I go there! I heard from my hotel room. Hee hee!Edgeworth:The law offices of Fey & Co., where the murder took place, are very close to the hotel. She could easily have heard the clock!Judge:Hmm. Well, Mr. Wright? Are you satisfied?Phoenix:No, Your Honor! (I can't give up now!) I'm not satisfied because...She couldn't have heard itPhoenix:You were at the hotel! There's no way you could have heard a clock go off in the building next door!Edgeworth:Edgeworth:You have proof that she could not?Phoenix:Uh...Edgeworth:Amateurs, amateurs. Listen to me, Mr. Wright. In the courtroom, proof is everything. Without it, you have nothing. You ARE nothing.Phoenix:Then I would like to propose a test to see if she really could have heard...Edgeworth:The prosecution denies your request!Phoenix:Wh-what!? On what grounds?Edgeworth:This is a trivial matter with no direct bearing on the case at hand!Judge:Indeed. Objection sustained.Phoenix:(Damn! Time to switch directions... quick!)Judge:Ready to proceed, Mr. Wright?Leads back to:\"No, Your Honor!\"It couldn't have rungLeads to:\"Your Honor, members of the court...\"Phoenix:Your Honor, members of the court... It is inconceivable that the clock in question rang!It's emptyPhoenix:That clock is missing its clockwork!Judge:H-how could you possibly...?Phoenix:Just have a look... Right now! (Changed from [Just have a look... As soon as you can!] in the original release)Judge:... Oh!Phoenix:See anything interesting, Your Honor?Judge:It is as the defense says!Leads to:\"This clock is missing its clockwork!\"It's brokenPhoenix:I-I think it's broken! That clock's busted!Judge:You \"think\"?Phoenix:J-just look at it! Your Honor, please examine the clock!Judge:Hmm... Oh!Phoenix:See anything interesting, Your Honor?Judge:Well, I'm not sure I would call this \"broken,\" but I doubt it could ring...!Leads to:\"This clock is missing its clockwork!\"The batteries are deadPhoenix:The batteries on that clock must be dead!Judge:\"Must be,\" Mr. Wright?Phoenix:Your Honor, if you would inspect the clock...!Judge:Hmm... very well. ... Oh!Phoenix:Well, Your Honor? Are they...?Judge:This clock has graver problems than dead batteries!Leads to:\"This clock is missing its clockwork!\"Judge:This clock is missing its clockwork! It's quite empty! Mr. Wright! Would you care to explain to the court the meaning of this?Phoenix:It is as you can see. The \"clock\" was empty. It couldn't have rung! Therefore, this witness... is a big, fat liar!April:F-fat!?Phoenix:Well, Miss May?Edgeworth:Tsk tsk.Phoenix:?Edgeworth:Quite a show you've put on for us, Mr. Wright.Phoenix:(He knew the clock was empty! Somehow... he knew!)Edgeworth:I'm afraid you've forgotten one thing, however. Indeed, the clock is empty. As you say... it can't ring. However, we must ask: when was the clockwork removed? If it was after the witness heard the clock, then there is no contradiction!Judge:! Hmm! That's true. That is a possibility. The clock might have been emptied after she heard it.Edgeworth:And that is exactly what happened, Your Honor!Judge:Well, Mr. Wright? Can you prove when the clockwork was removed?Edgeworth:Ho hoh! Impossible, of course...Phoenix:I have proof.Edgeworth:W-what!?Phoenix:Wasn't it you who told me \"proof is everything\"? Well, I was listening. And now I'll show you the \"proof\" you like so much! The evidence that proves when the clockwork was removed is...Present Maya's Cell PhonePhoenix:Leads to:\"Take a look at this!\"Present anything elsePhoenix:Phoenix:What do you say to that?April:W-what? I don't rightly understand what that's supposed to mean!Judge:I don't rightly understand either.Edgeworth:Ho hoh!Phoenix:(Uh oh... I think I blew it.)Judge:Mr. Wright, please refrain from flippant presentations of evidence in the future.Phoenix:S-sorry, Your Honor!Leads back to:\"The evidence that proves when the clockwork was removed is...\"Phoenix:Take a look at this!Judge:Hmm. That's a very cute cell phone.April:Ooh hoo! You have a girlie phone!Phoenix:W-wait! Wait! This isn't my phone! Listen! This is the defendant's cell phone, and it contains a recording... A recording of a conversation she had with the victim on the day of the murder!Judge:Order! Order!Edgeworth:The defendant's cell phone!? Th-this wasn't brought to my attention!Phoenix:Perhaps Detective Gumshoe overlooked it?Edgeworth:*grumble* (The good detective better remember he's up for evaluation soon...)Phoenix:(I gotta say, I'm starting to feel bad for the big fella.) (Changed from [My heart goes out to you, Edgeworth. Not.] in the original release) Let's hear the conversation.Cellular:*beep*...Maya:[So you just want me to hold on to \"The Thinker\" for you, then?]Mia:[If you could. Ah... I should probably tell you, the clock isn't talking right now.]Maya:[Huh? It's not working? That's lame!]Mia:[I had to take the clockwork out, sorry.]...[September 5, 9:27 AM]Cellular:*beep*Phoenix:Your Honor, I think this makes it clear the clockwork was already gone by the time this was recorded, (Changed from [I think this recording makes it clear that the clockwork was already gone...] in the original release) which was well before the witness even arrived at her hotel! (Changed from [and this was recorded in the morning, before the witness even arrived at her hotel!] in the original release)April:Muh... muh... muh!?Phoenix:Well, Miss May? Would you care to explain this to the court? Just how did you know that weapon was a clock!?April:... W-well...! Well, isn't it o-obvious? I saw that clock before! Um... what store was that again? I-I go to so many! Oops! I forgot! *wink*Judge:So the witness had seen it before. That would make sense. Does the defense have any objections, Mr. Wright?YesLeads to:\"The witness claims she had \"seen it before.\"\"NoPhoenix:Oh right... well, if she had seen it before, I guess... (Wait a second!)Judge:Then, the court would like--Phoenix:Hold on! P-please wait, Your Honor!Judge:Y-yes...? So you do have an objection?Phoenix:Um, yes, well...Judge:Mr. Wright!Phoenix:Sorry, Your Honor, it's just...Leads to:\"The witness claims she had \"seen it before.\"\"Phoenix:The witness claims she had \"seen it before.\" But this directly contradicts a piece of evidence already submitted to this court!Judge:Well then, let's see it. Please produce this evidence that will prove the witness had not seen the clock before.Present The ThinkerPhoenix:Leads to:\"It's simple.\"Present anything elsePhoenix:Phoenix:Here is undeniable proof!Edgeworth:Hah!? Please, this is a court case, not some surrealist performance art piece!Judge:Hmm... Perhaps the defense would like to change its mind?Leads back to:\"Please produce this evidence that will prove the witness had not seen the clock before.\"Phoenix:It's simple. This clock was never in any store, ever!April:W-whaaat!?Phoenix:A friend of mine made that clock. Only two exist in the world. And the one that isn't here is in police custody!April:I-impossible! Everything is sold in stores!Phoenix:Miss May, I think it's high time you went shopping for a better excuse...?April:Mmpf...Phoenix:Oh? Excuses not on sale today?April:Oooh? Oh ho ho. Mmmrrrrph! Ooooorrrrrrr ggggghhhhhhh... hhh!!! What's it to you, porcupine-head!? That stupid clock doesn't matter, okay!? She did it! And she should die for it! Die!Judge:W-w-whoa! Let's not get ahead of ourselves. T-this is a court of law, and the witness will remain calm!April:Hrrrgh... hrrrh... Hrrr... heh. Oh? Oh! Oh? Oh hoh ho! S-silly me! *grunt* Did I, um, like... lose it? I guess I did. Tee hee! *wink*Phoenix:(S-scary...)Judge:Miss May, let me ask. Tell me, how did you know the weapon was a clock?April:...Judge:Hmm... oh dear. Does the defense have an opinion on this... behavior?Phoenix:(Okay, this is it!) Yes, Your Honor. Allow me to explain how I see the truth of the matter. Miss April May, you knew the weapon was a clock because...You held itPhoenix:(This is familiar territory. I'll just use the same approach as with Larry.) Miss May held that very clock in her hands!Judge:Mr. Wright! When was this!?Phoenix:When she used it to strike the victim! When else?Judge:Order! Order! Mr. Wright! What is the meaning of this!?Phoenix:April May, you killed Mia Fey, I say! And when you struck, the force of the impact made \"The Thinker\" ring! That's when you heard it!Edgeworth:Edgeworth:... Tsk tsk. You truly are a work of art, Mr. Phoenix Wright.Phoenix:W-what's that supposed to mean!?Edgeworth:It was you who just proved that \"The Thinker\" was empty!Phoenix:Oh... (Urk! Of course it wouldn't ring!)Edgeworth:What's more, the witness has a rock-solid alibi. Miss May? Perhaps you could explain to the poor, misguided Mr. Wright? You were in the hotel at the time of the murder.Phoenix:(S-she can't prove it! She did it!)April:It would be MY pleasure!Phoenix:N-no way!April:Yes way, Mr. Lawyer. Tee hee? Didn't the murder take place at 9:00 at night? Gee, that's the exact time I ordered some room service from the hotel bellboy!Edgeworth:Incidentally, the bellboy corroborates the witness's story. Ergo, she was not at the crime scene! Rock solid!Judge:Mr. Wright! You've just made a serious accusation to a perfectly innocent woman!Phoenix:S-sorry, Your Honor. (That... didn't go so well. But, if that's the case... Then how did she know \"The Thinker\" was a clock!? ... Wait!) Your Honor, I figured it out! There is one other way Miss April May could have known it was a clock! One way alone! And I have proof!Judge:Well... proof, you say? Then, the court will examine your proof, Mr. Wright. How did the witness know \"The Thinker\" was a clock?Present Maya's Cell PhonePhoenix:Phoenix:The defendant's cell phone.Judge:Yes, we've seen that already.Phoenix:Take another listen to the conversation between the defendant and victim.Cellular:*beep*...Maya:[Mia! What's up? You haven't called in a while.]Mia:[Well, actually there's something I want you to hold on to for me.]Maya:[Again? What's it this time?]Mia:[It's... a clock. It's made to look like that statue, \"The Thinker.\" And it tells you the time!]...Judge:They do mention \"The Thinker.\" But how would the witness know of this conversation? Do you have proof that she knew of the conversation?Present WiretapPhoenix:Leads to:\"Have a look at this.\"Present anything elsePhoenix:Phoenix:(Wait... no, this can't be right! I can't afford any mistakes now!)Judge:Mr. Wright! Your evidence, please!Leads back to:\"Do you have proof that she knew of the conversation?\"Phoenix:Have a look at this.April:Ah! Oooh! Th-that!? Eh heh...Phoenix:I found this in Miss May's room.Judge:Mr. Wright! Please explain to the court what this is!Phoenix:Miss April May! You used a wiretap to listen to this conversation! That's how you knew \"The Thinker\" was a clock! Am I wrong!?April:I... I...Edgeworth:Edgeworth:Your Honor, this is ridiculous!Phoenix:Your Honor, look at the witness's face? Does she seem amused to you!? The defense demands an answer.April:La... laaa... lrrrrgf!Judge:Witness, answer the question. Did you tap her phone?April:...Judge:Miss May!April:Shut up, all of you! What gives you the right to talk to ME like that! You... you LAWYER!......April:I-it's no fair! All of you g-ganging up on me like that... Oh, so I'm the bad girl, is that it? Is that it!? Uh... uh... uwaaaaaaah!Phoenix:(That did it! The court's seen the real Miss April May now! Now to deal the final blow!)You did it, didn't you?Phoenix:Miss May, confess. You did it, didn't you?April:Are you out of your mind!? Oh wait, I forgot... you're a lawyer! You must be! At the time of the murder... I was in my hotel room, getting room service! How could I have killed her? If you don't believe me, just ask the bellboy!Leads to:\"Well, does the defense have anything to say?\"Why the wiretap?Phoenix:Miss May... Why did you tap her phone?April:...Phoenix:Answer the question!April:Do I have to? Isn't this a murder trial? Isn't tippity-tapping er... irrelevant?Phoenix:(Gah! She's saying exactly what Edgeworth wants her to say.) Miss May. You were tapping the victim's phone! I hardly call that \"irrelevant\"!Judge:While this court does not condone the defense's tone of voice, he has a point. (Changed from [While this court does not condone the defense's tone of speech, he has a point.] in the original release) Well, Miss May? Do you have an explanation for the court? Can you prove you had nothing to do with this murder, even though you tapped her phone?April:At the time of the murder... I was in my hotel room, getting room service! How could I have killed her? If you don't believe me, just ask the bellboy!Leads to:\"Well, does the defense have anything to say?\"Present WiretapPhoenix:Phoenix:Have a look at this.April:Ah! Oooh! Th-that!? Eh heh...Phoenix:I found this in Miss May's room.Judge:Mr. Wright! Please explain to the court what this is!Phoenix:Miss April May? You were tapping the victim, Ms. Mia Fey's phone, were you not?April:Oooh. Oooooh!Edgeworth:Edgeworth:Your Honor, this is irrelevant!Judge:I'm not entirely sure that it is. Objection overruled. It troubles me that our witness was in possession of a wiretap.Edgeworth:This is outrageous! Does the defense truly claim that the witness was tapping her phone?Phoenix:Absolutely!Edgeworth:Even if that was the case, (which it's not) you still have to prove one thing! Did the victim ever say that the weapon was a clock on the phone? Can you prove that? I THINK NOT!Phoenix:Oh yeah? I THINK I CAN! It's simple!Edgeworth:WHAAAAT!?Phoenix:Here's my proof. The proof that the victim said, on the phone, that the weapon was a clock is...Present Maya's Cell PhonePhoenix:Leads to:\"I present the defendant's cell phone.\"Present anything elsePhoenix:Phoenix:This! I think...Judge:That's not going to prove anything, Mr. Wright. I think...Phoenix:W-wait! That was just a warm up!Judge:Hmm! Okay, once again. And I expect real proof this time!Leads back to:\"The proof that the victim said, on the phone, that the weapon was a clock is...\"Phoenix:I present the defendant's cell phone.Judge:Yes, we've seen that.Phoenix:Listen once more to the conversation between the defendant and the victim.Cellular:*beep*...Maya:[Mia! What's up? You haven't called in a while.]Mia:[Well, actually there's something I want you to hold on to for me.]Maya:[Again? What's it this time?]Mia:[It's... a clock. It's made to look like that statue, \"The Thinker.\" And it tells you the time!]...Phoenix:Miss April May! You used a wiretap to listen to this conversation! That's how you knew \"The Thinker\" was a clock! Am I wrong!?April:I... I...Edgeworth:Edgeworth:Your Honor, this is ridiculous!Phoenix:Your Honor, look at the witness's face? Does she seem amused to you!? The defense demands an answer.April:La... laaa... lrrrrgf!Judge:Witness, answer the question. Did you tap her phone?April:...Judge:Miss May!April:Shut up, all of you! What gives you the right to talk to ME like that! You... you LAWYER!......April:I-it's no fair! All of you g-ganging up on me like that... Oh, so I'm the bad girl, is that it? Is that it!? Uh... uh... uwaaaaaaah!Phoenix:(That did it! The court's seen the real Miss April May now! Now to deal the final blow!)You did it, didn't you?Phoenix:Miss May, confess. You did it, didn't you?April:Are you out of your mind!? Oh wait, I forgot... you're a lawyer! You must be! At the time of the murder... I was in my hotel room, getting room service! How could I have killed her? If you don't believe me, just ask the bellboy!Leads to:\"Well, does the defense have anything to say?\"Why the wiretap?Phoenix:Miss May... Why did you tap her phone?April:...Phoenix:Answer the question!April:Do I have to? Isn't this a murder trial? Isn't tippity-tapping er... irrelevant?Phoenix:(Gah! She's saying exactly what Edgeworth wants her to say.) Miss May. You were tapping the victim's phone! I hardly call that \"irrelevant\"!Judge:While this court does not condone the defense's tone of voice, he has a point. (Changed from [While this court does not condone the defense's tone of speech, he has a point.] in the original release) Well, Miss May? Do you have an explanation for the court? Can you prove you had nothing to do with this murder, even though you tapped her phone?April:At the time of the murder... I was in my hotel room, getting room service! How could I have killed her? If you don't believe me, just ask the bellboy!Leads to:\"Well, does the defense have anything to say?\"Present anything elsePhoenix:Phoenix:This evidence reveals the truth of the matter!Judge:What does it reveal, exactly?Edgeworth:The mad delusions of the defense, perhaps?Phoenix:(Uh oh, bad reaction. Maybe that wasn't the thing...)Judge:I'm afraid it has revealed a certain over-eagerness... Let me ask again:Leads back to:\"How did the witness know \"The Thinker\" was a clock?\"You had heard about itPhoenix:The witness had never held the clock in her hand! However, she had heard that it was a clock!Judge:She \"heard\"...?Phoenix:That is correct, Your Honor. There is no other way she could have known \"The Thinker\" was a clock! And I can show you the proof!Judge:Well, this is interesting. Let's see it, then. Show me evidence proving that the witness had \"heard\" the murder weapon was a clock.Present Maya's Cell PhonePhoenix:Phoenix:The defendant's cell phone.Judge:Yes, we've seen that already.Phoenix:Take another listen to the conversation between the defendant and victim.Cellular:*beep*...Maya:[Mia! What's up? You haven't called in a while.]Mia:[Well, actually there's something I want you to hold on to for me.]Maya:[Again? What's it this time?]Mia:[It's... a clock. It's made to look like that statue, \"The Thinker.\" And it tells you the time!]...Judge:They do mention \"The Thinker.\" But how would the witness know of this conversation? Do you have proof that she knew of the conversation?Present WiretapPhoenix:Leads to:\"Have a look at this.\"Present anything elsePhoenix:Phoenix:(Wait... no, this can't be right! I can't afford any mistakes now!)Judge:Mr. Wright! Your evidence, please!Leads back to:\"Do you have proof that she knew of the conversation?\"Phoenix:Have a look at this.April:Ah! Oooh! Th-that!? Eh heh...Phoenix:I found this in Miss May's room.Judge:Mr. Wright! Please explain to the court what this is!Phoenix:Miss April May! You used a wiretap to listen to this conversation! That's how you knew \"The Thinker\" was a clock! Am I wrong!?April:I... I...Edgeworth:Edgeworth:Your Honor, this is ridiculous!Phoenix:Your Honor, look at the witness's face? Does she seem amused to you!? The defense demands an answer.April:La... laaa... lrrrrgf!Judge:Witness, answer the question. Did you tap her phone?April:...Judge:Miss May!April:Shut up, all of you! What gives you the right to talk to ME like that! You... you LAWYER!......April:I-it's no fair! All of you g-ganging up on me like that... Oh, so I'm the bad girl, is that it? Is that it!? Uh... uh... uwaaaaaaah!Phoenix:(That did it! The court's seen the real Miss April May now! Now to deal the final blow!)You did it, didn't you?Phoenix:Miss May!April:What is it you little shrimp! Talk to me in that tone of voice will you!?Phoenix:You killed her, didn't you!Judge:Order! There will be order!April:What? How can you possibly say that!? Are you mad? A-all I did was a little wiretap... Oops!Phoenix:So you admit you tapped her phone!April:Heh... heh... hrrah! B-but wait! I didn't do ANYTHING bad like murder! I'm a good girl!Phoenix:Really? Can you prove it!? (No way can she prove it!)April:You think you're so smart, Mr. Lawyer... But I can prove it! And I will!Phoenix:You can't be serious! No way!April:Way, I say! Way! Oh, and I assure you I'm serious, Mr. Lawyer! Hmph! Okay? So, the killing happened around 9:00 at night? Why, that's just when I was getting room service from that sweet bellboy...Phoenix:R-room service!?April:Ice coffee, I believe it was? Ice coffee? You know? Like normal coffee, but COLD. If you don't drink it quick, the ice melts and then you have... regular cold coffee.Phoenix:I-ice coffee...!?April:Think I'm making this up? Ask the bellboy! *wink*Edgeworth:Ergo, the witness was not on the scene at the time of the murder!Phoenix:!Judge:So, where does that leave us...?Edgeworth:It is my great displeasure to inform you... That the witness appears to have been tapping the victim's telephone. However! That is a separate crime, with no bearing on the current case whatsoever! Her testimony stands! She saw the defendant, Maya Fey, commit murder!Phoenix:(No! They're going to let her just walk away! There's no way I can win this unless I tie Miss May to the murder somehow...)Leads to:\"Well, does the defense have anything to say?\"Why the wiretap?Phoenix:Why did you tap her phone?April:...Phoenix:Answer the question!April:Do I have to? Isn't this a murder trial? Isn't tippity-tapping er... irrelevant?Phoenix:(Gah! She's saying exactly what Edgeworth wants her to say.) Miss May. You were tapping the victim's phone! I hardly call that \"irrelevant\"!Judge:While this court does not condone the defense's tone of voice, he has a point. (Changed from [While this court does not condone the defense's tone of speech, he has a point.] in the original release) Well, Miss May? Do you have an explanation for the court? Can you prove you had nothing to do with this murder, even though you tapped her phone?Phoenix:(Hah! I'd like to see her pull THAT off!)April:Mr. Lawyer, I saw that evil, evil grin! You were probably thinking \"I'd like to see her pull THAT off,\" weren't you!Phoenix:(Damn... she's good!)April:Well you're not the first man who's thought that! And of course... I can, and will!Phoenix:You can't be serious! No way!April:Way, I say! Way! Oh, and I assure you I'm serious, Mr. Lawyer! Hmph! Okay? So, the killing happened around 9:00 at night? Why, that's just when I was getting room service from that sweet bellboy...Phoenix:R-room service!?April:Ice coffee, I believe it was? Ice coffee? You know? Like normal coffee, but COLD. If you don't drink it quick, the ice melts and then you have... regular cold coffee.Phoenix:I-ice coffee...!?April:Think I'm making this up? Ask the bellboy! *wink*Edgeworth:Ergo, the witness was not on the scene at the time of the murder!Phoenix:!Judge:So, where does that leave us...?Edgeworth:It is my great displeasure to inform you... That the witness appears to have been tapping the victim's telephone. However! That is a separate crime, with no bearing on the current case whatsoever! Her testimony stands! She saw the defendant, Maya Fey, commit murder!Phoenix:(No! They're going to let her just walk away! There's no way I can win this unless I tie Miss May to the murder somehow...)Leads to:\"Well, does the defense have anything to say?\"Present WiretapPhoenix:Phoenix:Have a look at this.April:Ah! Oooh! Th-that!? Eh heh...Phoenix:I found this in Miss May's room.Judge:Mr. Wright! Please explain to the court what this is!Phoenix:Miss April May? You were tapping the victim, Ms. Mia Fey's phone, were you not?April:Oooh. Oooooh!Edgeworth:Edgeworth:Your Honor, this is irrelevant!Judge:I'm not entirely sure that it is. Objection overruled. It troubles me that our witness was in possession of a wiretap.Edgeworth:This is outrageous! Does the defense truly claim that the witness was tapping her phone?Phoenix:Absolutely!Edgeworth:Even if that was the case, (which it's not) you still have to prove one thing! Did the victim ever say that the weapon was a clock on the phone? Can you prove that? I THINK NOT!Phoenix:Oh yeah? I THINK I CAN! It's simple!Edgeworth:WHAAAAT!?Phoenix:Here's my proof. The proof that the victim said, on the phone, that the weapon was a clock is...Present Maya's Cell PhonePhoenix:Leads to:\"I present the defendant's cell phone.\"Present anything elsePhoenix:Phoenix:This! I think...Judge:That's not going to prove anything, Mr. Wright. I think...Phoenix:W-wait! That was just a warm up!Judge:Hmm! Okay, once again. And I expect real proof this time!Leads back to:\"The proof that the victim said, on the phone, that the weapon was a clock is...\"Phoenix:I present the defendant's cell phone.Judge:Yes, we've seen that.Phoenix:Listen once more to the conversation between the defendant and the victim.Cellular:*beep*...Maya:[Mia! What's up? You haven't called in a while.]Mia:[Well, actually there's something I want you to hold on to for me.]Maya:[Again? What's it this time?]Mia:[It's... a clock. It's made to look like that statue, \"The Thinker.\" And it tells you the time!]...Phoenix:Miss April May! You used a wiretap to listen to this conversation! That's how you knew \"The Thinker\" was a clock! Am I wrong!?April:I... I...Edgeworth:Edgeworth:Your Honor, this is ridiculous!Phoenix:Your Honor, look at the witness's face? Does she seem amused to you!? The defense demands an answer.April:La... laaa... lrrrrgf!Judge:Witness, answer the question. Did you tap her phone?April:...Judge:Miss May!April:Shut up, all of you! What gives you the right to talk to ME like that! You... you LAWYER!......April:I-it's no fair! All of you g-ganging up on me like that... Oh, so I'm the bad girl, is that it? Is that it!? Uh... uh... uwaaaaaaah!Phoenix:(That did it! The court's seen the real Miss April May now! Now to deal the final blow!)You did it, didn't you?Phoenix:Miss May!April:What is it you little shrimp! Talk to me in that tone of voice will you!?Phoenix:You killed her, didn't you!Judge:Order! There will be order!April:What? How can you possibly say that!? Are you mad? A-all I did was a little wiretap... Oops!Phoenix:So you admit you tapped her phone!April:Heh... heh... hrrah! B-but wait! I didn't do ANYTHING bad like murder! I'm a good girl!Phoenix:Really? Can you prove it!? (No way can she prove it!)April:You think you're so smart, Mr. Lawyer... But I can prove it! And I will!Phoenix:You can't be serious! No way!April:Way, I say! Way! Oh, and I assure you I'm serious, Mr. Lawyer! Hmph! Okay? So, the killing happened around 9:00 at night? Why, that's just when I was getting room service from that sweet bellboy...Phoenix:R-room service!?April:Ice coffee, I believe it was? Ice coffee? You know? Like normal coffee, but COLD. If you don't drink it quick, the ice melts and then you have... regular cold coffee.Phoenix:I-ice coffee...!?April:Think I'm making this up? Ask the bellboy! *wink*Edgeworth:Ergo, the witness was not on the scene at the time of the murder!Phoenix:!Judge:So, where does that leave us...?Edgeworth:It is my great displeasure to inform you... That the witness appears to have been tapping the victim's telephone. However! That is a separate crime, with no bearing on the current case whatsoever! Her testimony stands! She saw the defendant, Maya Fey, commit murder!Phoenix:(No! They're going to let her just walk away! There's no way I can win this unless I tie Miss May to the murder somehow...)Leads to:\"Well, does the defense have anything to say?\"Why the wiretap?Phoenix:Why did you tap her phone?April:...Phoenix:Answer the question!April:Do I have to? Isn't this a murder trial? Isn't tippity-tapping er... irrelevant?Phoenix:(Gah! She's saying exactly what Edgeworth wants her to say.) Miss May. You were tapping the victim's phone! I hardly call that \"irrelevant\"!Judge:While this court does not condone the defense's tone of voice, he has a point. (Changed from [While this court does not condone the defense's tone of speech, he has a point.] in the original release) Well, Miss May? Do you have an explanation for the court? Can you prove you had nothing to do with this murder, even though you tapped her phone?Phoenix:(Hah! I'd like to see her pull THAT off!)April:Mr. Lawyer, I saw that evil, evil grin! You were probably thinking \"I'd like to see her pull THAT off,\" weren't you!Phoenix:(Damn... she's good!)April:Well you're not the first man who's thought that! And of course... I can, and will!Phoenix:You can't be serious! No way!April:Way, I say! Way! Oh, and I assure you I'm serious, Mr. Lawyer! Hmph! Okay? So, the killing happened around 9:00 at night? Why, that's just when I was getting room service from that sweet bellboy...Phoenix:R-room service!?April:Ice coffee, I believe it was? Ice coffee? You know? Like normal coffee, but COLD. If you don't drink it quick, the ice melts and then you have... regular cold coffee.Phoenix:I-ice coffee...!?April:Think I'm making this up? Ask the bellboy! *wink*Edgeworth:Ergo, the witness was not on the scene at the time of the murder!Phoenix:!Judge:So, where does that leave us...?Edgeworth:It is my great displeasure to inform you... That the witness appears to have been tapping the victim's telephone. However! That is a separate crime, with no bearing on the current case whatsoever! Her testimony stands! She saw the defendant, Maya Fey, commit murder!Phoenix:(No! They're going to let her just walk away! There's no way I can win this unless I tie Miss May to the murder somehow...)Leads to:\"Well, does the defense have anything to say?\"Present anything elsePhoenix:Phoenix:This is my evidence!Judge:I'm afraid I'm not sure where you are going with all of this, Mr. Wright.Phoenix:Um... \"where\"? Well, it's not so much a place as a... er...Edgeworth:Come to the end of your bluff, Mr. Wright?Phoenix:W-wait! Wait! That was, uh, practice! Here's the real evidence!Judge:Mr. Wright, this court does not condone the presentation of evidence for \"practice.\" Let's see your evidence, for real this time, Mr. Wright.Leads back to:\"Show me evidence proving that the witness had \"heard\" the murder weapon was a clock.\"Judge:Well, does the defense have anything to say?Phoenix:Um, well... (Come on, think of something!)Call the bellboy as a witnessPhoenix:The defense would like to call the hotel bellboy as a witness! There's something suspicious there, and I'm going to get to the bottom of it!April:I think you've sunken quite low enough already.Edgeworth:Edgeworth:I object to calling the bellboy!Phoenix:W-why? What's your reason?Edgeworth:Because I hold that the wiretapping had nothing to do with the killing!Phoenix:...!Edgeworth:However... If you agree to one condition, I'll consent to calling this witness.Phoenix:Condition...?Edgeworth:If Miss April May's alibi is not called into question after you examine the bellboy... Then you will recognize that Miss April May was not the killer, thus she is innocent! Therefore you must accept the verdict of \"guilty\" for Ms. Maya Fey! That is my condition.Phoenix:(What...!? I'd better find something suspicious in that bellboy's testimony... Otherwise Maya will be declared \"guilty\" on the spot! What should I do...?)Accept the conditionPhoenix:(Alright! I've got nothing to lose! Except for... well, everything!) Understood. I accept your condition.Edgeworth:Hmph. Fool... You fell right into my trap!Phoenix:(Uh oh!) Uh... um, wait...Leads to:\"Very well! The court calls the hotel bellboy to the stand!\"Give upPhoenix:(Grr! I can't accept those conditions!) Very well. The defense will refrain from calling the bellboy as a witness.Judge:I see. You may continue your cross-examination, Mr. Wright.Phoenix:Right. On with the cross-examination.Edgeworth:What exactly do you have left to examine, Mr. Wright? Miss April May has admitted to the wiretap, yes. But that bears no relevance to the case at hand: murder! There's no way you can prove any connection!Phoenix:(Uh oh! Think! This can't be the end... but I'm out of evidence!)Judge:Then I believe the cross-examination is over. Mr. Edgeworth, does the prosecution have any other witnesses to call?Edgeworth:None, Your Honor. She's the last.Phoenix:(What!? B-but that means... Maya's guilty...!?) W-wait! Your Honor!Judge:Yes, Mr. Wright?Phoenix:The defense would like to call the bellboy after all!Edgeworth:... Tsk tsk tsk... As I thought!Phoenix:...?Edgeworth:May I remind you, dear Mr. Wright. Should you question the bellboy... and Miss April May's alibi prove to be solid... then, by default, your client Ms. Maya Fey will be pronounced \"guilty\"! Are you prepared to accept my condition?Phoenix:(Edgeworth... He's got me backed into a corner... But I don't see any other way to take this!) I accept!Leads to:\"Very well! The court calls the hotel bellboy to the stand!\"Continue examining Miss MayPhoenix:Right. On with the cross-examination.Edgeworth:What exactly do you have left to examine, Mr. Wright? Miss April May has admitted to the wiretap, yes. But that bears no relevance to the case at hand: murder! There's no way you can prove any connection!Phoenix:(Uh oh! Think! This can't be the end... but I'm out of evidence!)Judge:Then I believe the cross-examination is over. Mr. Edgeworth, does the prosecution have any other witnesses to call?Edgeworth:None, Your Honor. She's the last.Phoenix:(What!? B-but that means... Maya's guilty...!?) W-wait! Your Honor!Judge:Yes, Mr. Wright?Phoenix:The defense would like to call the bellboy after all!Edgeworth:... Tsk tsk tsk... As I thought!Phoenix:...?Edgeworth:May I remind you, dear Mr. Wright. Should you question the bellboy... and Miss April May's alibi prove to be solid... then, by default, your client Ms. Maya Fey will be pronounced \"guilty\"! Are you prepared to accept my condition?Phoenix:(Edgeworth... He's got me backed into a corner... But I don't see any other way to take this!) I accept!Leads to:\"Very well! The court calls the hotel bellboy to the stand!\"Judge:Very well! The court calls the hotel bellboy to the stand!Edgeworth:I believe we're ready for the witness to testify. He certainly does look like a bellboy.Bellboy:Yes, sir. I received your summons in the middle of work, sir. I'm happy to be of service.Judge:That tea set looks rather heavy, so without further ado, the witness may begin his testimony.Bellboy:Very good, sir!Witness Testimony-- Miss May's Room Service --Bellboy:I am the head bellboy at the fine Gatewater Hotel, in business for four generations!I believe I received a call after 8:00 in the evening from our guest, Miss May.She asked for an ice coffee to be brought to her at 9:00, on the dot, sir.I brought it to her at precisely the requested time, of course.And I delivered the ice coffee to our guest Miss May, herself.Judge:I see. The defense may begin its cross-examination.Phoenix:R-right! I'm ready. (I hope... This is it... If I can't prove Miss May was involved with the murder now... Maya will be finished!)Cross ExaminationCross Examination-- Miss May's Room Service --Bellboy:I am the head bellboy at the fine Gatewater Hotel, in business for four generations!PressPhoenix:Phoenix:What exactly is it you do at the hotel?Bellboy:Why, anything required of me, sir. I check in guests, I check out guests. I clean rooms, I make beds. I even deliver room service, sir. I checked Miss May in personally.Phoenix:Are you always so... so prim?Judge:Mr. Wright. You will refrain from asking frivolous questions...Bellboy:I believe I received a call after 8:00 in the evening from our guest, Miss May.PressPhoenix:Phoenix:Are you sure it was Miss May on the phone?Bellboy:Absolutely, sir.Phoenix:H-how can you be so certain!?Bellboy:I checked Miss May in personally, sir. Not only did I see her in all her stunning radiance, but I also heard her voice. And then I saw THEM, and I... Ahem. Er... ahem! The point being, I remembered her quite well, sir.Judge:Yes, what then?Bellboy:She asked for an ice coffee to be brought to her at 9:00, on the dot, sir.PressPhoenix:Phoenix:9:00 \"on the dot,\" you say?Bellboy:Yes. I confirmed that detail several times. She was watching a program on the TV, and wished to drink after she finished, sir.Phoenix:(9:00... the time of the murder!)Bellboy:I brought it to her at precisely the requested time, of course.PressPhoenix:Phoenix:\"Precisely\" 9:00, then?Bellboy:Precisely, exactly, and most definitely, sir, 9:00 PM.Phoenix:How can you be so sure!?Bellboy:Miss May was quite insistent that it be brought then. \"Oh, bellboy? Tee hee! I'd like, like, ice coffee at exactly 9:00!\" Something like that, sir. Therefore, I knocked on her door at the crack of 9:00, sir.Phoenix:(Why would she be so particular about the time?)Bellboy:And I delivered the ice coffee to our guest Miss May, herself.PressPhoenix:Phoenix:You are sure it was Miss April May herself?Bellboy:Ab-SO-lutely, sir.Phoenix:\"Ab-SO-lutely\"...?Bellboy:Yes, sir. As in, \"so very absolutely,\" sir. It's an endearing mannerism of mine.Phoenix:How come you're so very certain!?Bellboy:Well, when I brought the room service, sir... S-she... the guest, sir, favored me w-with a, um, an \"embrasser,\" sir.Phoenix:\"Embrasser\"!? Is that French for \"embrace\"?Bellboy:It's French for \"kiss,\" sir. But not a french kiss, sir! More of a peck on the cheek.Phoenix:Wh-why would she have done that...?Bellboy:I believe, perhaps, she was momentarily swayed by my prim demeanor, sir. It was a moment I shall never, ever forget, sir.Phoenix:(Sounds pretty fishy to me... I think our Miss May was up to something and wanted the bellboy to remember her!)Phoenix:(This bellboy wouldn't have any reason to lie... But I have to find something to use in his testimony! One more time. I'll press him until he spills the beans... or his tea!)",
      "testimonies": [
        {
          "testimony": "I am the head bellboy at the fine Gatewater Hotel, in business for four generations!",
          "person": "Bellboy",
          "present": []
        },
        {
          "testimony": "I believe I received a call after 8:00 in the evening from our guest, Miss May.",
          "person": "Bellboy",
          "present": []
        },
        {
          "testimony": "She asked for an ice coffee to be brought to her at 9:00, on the dot, sir.",
          "person": "Bellboy",
          "present": []
        },
        {
          "testimony": "I brought it to her at precisely the requested time, of course.",
          "person": "Bellboy",
          "present": []
        },
        {
          "testimony": "And I delivered the ice coffee to our guest Miss May, herself.",
          "person": "Bellboy",
          "present": []
        }
      ],
      "noPresent": true
    }
  ]
}