{
  "previousContext": "Episode 2Turnabout Sisters\nCellular:\nBrrring... Brrrrring...\n*beep*\n???:\nHello? This is Maya.\nMia:\nHey Maya, it's me.\n???:\nMia! What's up? You haven't called in a while.\nMia:\nSorry, I've been so busy. How you been?\n???:\nWell, LONELY. And it's all YOUR fault. Nah, I'm just teasing. I've been great! I'm finally getting used to having my own place.\nMia:\nThat's good to hear. Actually, I'm calling because I have a favor to ask.\n???:\nI know, I know. You want me to hold evidence for you?\nMia:\nSharp as always! There's a lot of buzz about the upcoming trial... I just don't feel safe keeping the evidence here.\n???:\nI gotcha. So, what is it this time?\nMia:\nIt's... a clock.\n???:\nA clock?\nMia:\nYeah, it's made to look like that statue, \"The Thinker.\" And it tells you the time! I thought you might like it. You always liked toys.\n???:\nHey! I'm not a little girl anymore, Sis!\nMia:\nNow, now. You know I'm only teasing. Ah, I should probably tell you, the clock isn't talking right now.\n???:\nHuh? It's not working? That's lame!\nMia:\nI had to take the clockwork out. Sorry. I put some papers inside it instead.\n???:\nPapers? Is that the evidence, then? Hmm, well... there's a possibility that it might turn out that way, yes.\nMia:\nCan you come by the office tonight, say 9:00, to pick it up? I'll be in a pretrial meeting until then.\n???:\nOkay, Sis, but I expect dinner! Something good! Like... burgers! I could really go for a good burger.\nMia:\nOkay, okay. We'll hit the usual joint.\n???:\nAlright! It's a deal! Okay, Sis, see you soon!\nMia:\nYep. I'll be waiting, Maya.\nCellular:\n*beep*\n[Conversation recorded. September 5, 9:27 AM]\nSeptember 5, 8:57 PMFey & Co. Law Offices\n???:\nNow, Miss Fey, I'll take what's mine... the papers.\nMia:\nI'm sorry, but I can't give you what I don't have.\n???:\nMiss Fey, you are a poor liar. Why, I see it right over there... That must be \"The Thinker\" that swallowed those papers.\nMia:\nHow could you know...?\n???:\nHo hoh. You are not cogniferous of my background? Gathering information is my business, you see.\nMia:\nI... I should have been more careful.\n???:\nHo hoh. My dear Miss Fey... I am so very sorry. But I am afraid I must ask you for one more thing. Your eternal silence... Farewell, Miss Fey.\nMia:\n!!!\nRed... White... Blue...\nEpisode 2Turnabout Sisters\nSeptember 5, 9:08 PMFey & Co. Law Offices\nPhoenix:\nUh oh, I'm late. Huh, that's strange. The chief must have gone home already. She said her sister was coming over so we should all go out for dinner... ... What's that smell...? Blood...? Mia! (Maybe she's in her office!)\nPhoenix:\nThat smell... Blood!\n???:\n... *sob* Sis...\nPhoenix:\n(Someone's there!) ...! Chief? Chief...?\nChief!!!\nPhoenix:\nWho are you?\n???:\n...\nPhoenix:\n(The strange girl dropped out cold. I left her lying on the office sofa. I went back to the chief where she lay under the window. Her body was still warm... I could feel it when I held her shoulder. Then, all too quickly, it began to fade... Until finally she was cold.)\nPhoenix:\nChief...\nFey & Co. Law Offices\nAfter examining corded phone in Office and presenting Receipt in Fey & Co. Law Offices:\n*whee-ooo* *whee-ooo*... *whee-ooo* *whee-ooo*...\nPhoenix:\n! The police! (Sounds like they're coming this way!)\nFreeze! Police!\nGumshoe:\nAlright, I'm Detective Dick Gumshoe, see?\nPhoenix:\n(Gumshoe...? What an odd name.)\nGumshoe:\nWe received a report from the building across the way, see. Got a person saying they saw a murder.\nPhoenix:\n(It must have been that woman I saw.)\nGumshoe:\nAnyway, I don't want either of you moving one inch, 'kay?\nPhoenix:\n(Great. Just great. Maya... Wait, she wouldn't have... nah.)\nGumshoe:\nWhoaaaaaaaaaaaah! Scuze me!\nMaya:\nEek!\nGumshoe:\nThis word \"Maya\" here mean anything to you?\nMaya:\n...! Um... that... That's my name...\nGumshoe:\nWHAAAAT!? The victim drew this here note in her own blood, see? With her dying breath, she wrote down the killer's name!\nMaya:\nK-killer...? I'm not--\nGumshoe:\nCase closed! You're coming down to the precinct, ma'am.\nMaya:\nW-what?\nPhoenix:\nMia's younger sister, Maya, was arrested on the spot. I was taken in for questioning and didn't get out until the next morning. My eyes were heavy... but I couldn't sleep. I sat around, waiting for visiting hours to begin at the detention center. I had to talk to Maya as soon as possible.\nSeptember 6, 9:07 AMDetention CenterVisitor's Room\nPhoenix:\n(Wow, they have poor Maya locked up like a criminal.)\nMaya:\nOh! It's you! The lawyer... G-good morning.\nPhoenix:\nGood morning! (She looks so tired...)\nMaya:\nUm... Are you going to be my attorney?\nPhoenix:\nWell, that's what I wanted to talk to you about...\nPhoenix:\n(Did I look at her like that?) No, no! I never thought...\nMaya:\nI-it's okay. I understand. ... And... I've also heard about you.\nPhoenix:\nHeard...? Heard what about me?\nMaya:\nI... was talking to my sister on the phone the other day...\nMia:\n\"Today was my junior partner's first time in court.\"\nMaya:\nWow! Really? How'd that go?\nMia:\n\"It was quite the scene! Honestly, I was on edge the whole time. It's been a while...\"\nMaya:\nHah! So, he crashed and burned?\nMia:\n\"...He's a genius. One of those 'strike fear into the hearts of evil' types... The only thing he's lacking is... experience.\"\nMaya:\nHuh, sounds like it was fun! Well, I know who to go to if I ever get into trouble now!\nMia:\n\"I don't know, Maya. I think you might want to wait... give him three more years. That is, unless you want to be found guilty.\"\nMaya:\nThat's what she said!\nPhoenix:\n...\nMaya:\nI-I'm sorry! I didn't mean to trouble you...\nPhoenix:\nNo, it's okay. It's true, I guess. But... at the same time, I can't just sit and watch! When I think of the person who did this to Mia...\nMaya:\n... I know...\nAfter clearing all Talk options:\nMaya:\n... Um...!\nPhoenix:\nHuh? Something the matter?\nMaya:\nUm... I was wondering, could I ask you a favor?\nPhoenix:\n...?\nMaya:\nThis is the address of a famous lawyer. My sister gave me this a long time ago. She said if I was ever in trouble, I should call him. And, well, I'm in trouble. Do you think you could go ask him to represent me?\nPhoenix:\n(Hmm...)\nMaya:\nThey told me that if I don't find one, the state will pick an attorney to defend me.\nPhoenix:\nWhen will that happen?\nMaya:\nThey're giving me until 4:00 this afternoon.\nPhoenix:\n(And visiting hours are almost up... I'd better hurry!) Right, I'll be back!\nSeptember 6Fey & Co. Law Offices\nPhoenix:\n(The office is filled with police officers. They're all busily searching for clues...)\n???:\nHey! You there! This is a crime scene, pal! No trespassing! Umm... Sorry, don't I know you from somewhere? Wait, you're that Butz guy, aren't you!\nPhoenix:\nNo, no, Phoenix Wright. (How could anyone mistake me for Larry!?)\n???:\nAh, guess I got the wrong name, Mr. Wright. Sorry 'bout that. That Butz guy, he was a killer! And you're no killer! Right?\nPhoenix:\n(He WAS proven innocent...) Umm... right. And you were...\nGumshoe:\nAnyway, get the name right. And don't go calling me \"Dick\"...\nPolice:\nHey, Dick! Get over here!\nGumshoe:\nY-yes, sir! B-be right there! Umm... ahem! You're her lawyer, right, pal? If you got business here, you'd better do it quick!\nPhoenix:\n(Whew! He thinks I'm Maya's lawyer...!)\nAfter clearing \"Mia\" and \"Maya\" Talk options and presenting Maya's Memo:\nPhoenix:\n(I guess I've asked all the questions I need to.)\nGumshoe:\nYou all done, pal?\nPhoenix:\nUm, yes, thank you. I'll be heading out now.\nGumshoe:\nOh, wait. One more thing I wanted to mention to you. I don't suppose you're planning on talking to that witness. Anyway, you'd better not! No influencing the witness with your lawyerly ways, pal!\nPhoenix:\n... (Come to think of it, I had completely forgotten about her...) The... witness?\nGumshoe:\nYeah, Miss April May. I'm sorry 'bout this... But I can't tell you anything about her!\nPhoenix:\n(Well, you just told me her name. Miss May, huh?) So you've sent her home already, then?\nGumshoe:\nAhah! You're trying your lawyerly tricks on me now! She's not to go outside her room until the trial!\nPhoenix:\n(So... she's still in the hotel across the way.) I guess I should know better than to try to get a detective to leak information.\nGumshoe:\nYou got that right, pal!\nPhoenix:\n(Time to pay a visit to Miss May!)\nSeptember 6Grossberg Law Offices\nPhoenix:\n(According to the receptionist, the big boss is \"out\". She couldn't say when he'd be back. It must be hard to keep track of everything when you're a famous lawyer... Not to mention run an office like this. I guess I'll just have to come back later.)\nDetention Center (after visitng Grossberg Law Offices, but before examining open drawer in Gatewater Hotel - Room 303)\nMaya:\nHey! What is it? Did you meet the lawyer?\nPhoenix:\nSorry. I haven't seen him yet.\nMaya:\nI see...\nPhoenix:\n(Hmm. I'd better go see if I can find this elite lawyer she's talking about.)\nSeptember 6Gatewater Hotel - Room 303\nApril:\nWell! Hello there, handsome.\nPhoenix:\nUmm... hi. (Smooth, Wright, real smooth.)\nApril:\nYou're the lawyer, aren't you? The detective told me... He said, \"Don't say nothing to that lawyer, pal!\" Tee hee!\nPhoenix:\n(Memo to self: thank Detective Gumshoe for making my job harder.)\nApril:\nGee! This is all like something out of a movie! It's all so exciting I can hardly contain myself! Ooh! Let me go freshen up so I can look the part of the beautiful eyewitness!\nPhoenix:\n(I pity the lawyer that has to cross-examine this one.)\nPhoenix:\n(There's a screwdriver stuck in this drawer. I wonder what's inside? Let's take a look...)\nApril:\nHey! H-h-hey!!! What are you doing!? No touching! Oooh. Bad boy! Y-you really shouldn't pry around in other people's rooms, now. You wouldn't want to make me upset, would you?\nPhoenix:\n(Upset!? I thought she was going to explode for a second there! I wonder what could be inside the drawer?)\nGrossberg Law Offices (after examining open drawer in Gatewater Hotel - Room 303)\nPhoenix:\n(Hmm... seems like Mr. Grossberg is out. Well, maybe I should just wait here for him to come back.)\n???:\n*Ah-HHHHEM!*\nPhoenix:\n(If that wasn't the most over-the-top clearing of the throat I've ever heard!)\nGrossberg:\nAh hah! So, you're the one they say has been looking for me?\nPhoenix:\nUh... y-yes, that's me! (He looks even... grander than I imagined!)\nGrossberg:\nHmm...? That badge on your collar...? Ah, so you're a lawyer, are you now?\nPhoenix:\nY-yes, well... yes.\nGrossberg:\nAnd what do you want? I'm not particularly busy these days... Please, proceed!\nPhoenix:\n(Not busy...? Then how come no one could get in touch with you?)\nGrossberg:\nHmm? Something the matter? You came to see the one-and-only Marvin Grossberg, did you not? Well, here I am, boy! What do you want? Out with it!\nPhoenix:\nUm... w-well, sir, actually it's about Maya. Maya Fey.\nGrossberg:\n...! Ah... yes. Maya Fey. Go on.\nPhoenix:\n(Hmm? Why the strange reaction?)\nGrossberg:\nA-cha-cha. I'm really quite busy here, son. I can't go taking cases on a day's notice! No, it's quite impossible.\nPhoenix:\nW-wait a second! How did you know the trial was tomorrow!?\nGrossberg:\nUrk? Ahem! A-anyway... I'm afraid it's entirely impossible for me to represent her. Sorry. End of discussion.\nPhoenix:\n(What's going on!? He refused me before I even got a chance to ask him! What do I tell Maya...?)\nFey & Co. Law Offices\nPhoenix:\n... (Looks like Detective Gumshoe has gone home. The police are still keeping themselves busy in the chief's office. No one has time to talk to me. Guess I'll head out.)\nDetention Center (after examining open drawer in Gatewater Hotel - Room 303, then visitng Grossberg Law Offices)\nPhoenix:\nHmm... Maya's not here. She must be in questioning. They probably won't let her out for a while. Maybe I'd better go talk to that lawyer again.\nAfter clearing all Talk options in Grossberg Law Offices:\nSeptember 6, 3:42 PMDetention CenterVisitor's Room\nPhoenix:\nHiya.\nMaya:\nOh! You're back! Did you find the lawyer?\nPhoenix:\nUm... well... (What do I tell her?) Well, see... (Just be honest!) I... I really don't think you should use that guy. He... didn't seem healthy. He was all skin and bones!\nMaya:\n... What really happened?\nPhoenix:\n...\nMaya:\nYou don't mean... He refused to help?\nPhoenix:\nUrp.\nMaya:\n... I see. I've been abandoned, then.\nMaya:\nJust a little longer now before the state-appointed lawyer comes, I guess...\nPhoenix:\n... (4:00 PM. Time's up. What should I do? Do I just leave her and go home...?)\nPhoenix:\nI've made up my mind! I'm going to defend you whether you want me to or not!\nMaya:\n! Why?\nPhoenix:\nWhy? Well...\nPhoenix:\nI won't abandon you. You can count on me.\nMaya:\n... That's so kind of you... *sniff*... ...\nPhoenix:\nWell! Let's fight this one and get you out of here!\nMaya:\nR-right! Thank you!\nPhoenix:\n(Whew, she smiled at last. She looks like an entirely different person!) One last question... You are innocent, right?\nMaya:\nYes! And I trust you... So you trust me, too, okay?\nPhoenix:\nIt's a deal. (So, what next... There's something that's been bugging me... Just what was inside that strange woman's drawer? It was when I tried to look into the drawer that she got all defensive. There has to be something in there!)\nGatewater Hotel\nBellboy:\nGood afternoon, sir!\nPhoenix:\nExcuse me, you are...?\nBellboy:\nAh, I beg your pardon, sir! I am the bellboy of this establishment, at your service, sir.\nPhoenix:\nOh, right.\nBellboy:\nI've just come up to deliver room service, sir.\nPhoenix:\nUm... do you know where Miss May might be?\nBellboy:\nAh. I believe our guest Miss May is currently using the, er, facilities...? If you've no need of anything, I'll be taking my leave. Please, stay as long as you like. Enjoy...\nPhoenix:\nYeah... Wait... no! Hey! ... (Why does it seem like every time I come here, I end up embarrassing myself? Wait... now's my chance to snoop around a bit!)\nBellboy:\nAh, I almost forgot!\nPhoenix:\nGah! Y-you came back quick!\nBellboy:\nMight I ask you to inform Miss May that there is a message for her? Please tell her that Mr. White, of Bluecorp phoned.\nPhoenix:\nOh, right. Sure. (Mr. White... of Bluecorp? Where have I heard that name?)\nMaya:\nWhite... That was his name. My sister told me.\nPhoenix:\n(\"White\" was the name of the guy who ruined Mia and Maya's mother! Could it be a coincidence?)\nPhoenix:\nThere's a screwdriver sticking out of that half-open drawer. Now's my chance to see what's inside! ...! What do we have here! A... wiretap? Hmm! What would a woman like her be doing with a thing like this?\nWiretap added to the Court Record.\nPhoenix:\nThere is definitely something suspicious about this \"Miss May\"! Why would she have something like this in her hotel room? There's a story behind all this, I know it! Alright... I'll be using this bit of evidence in tomorrow's trial, that's for sure. For Maya's sake... I'll get to this woman's bottom! Wait... I mean ... you know what I mean.\nApril:\nOh, bellboy...? Still there?\nPhoenix:\n(Uh oh, time to scram! I look forward to tangoing with you tomorrow, Miss May! In court!)\nTo be continued.\n\nSeptember 7, 10:00 AMDistrict CourtCourtroom No. 1\nJudge:\nThe court is now in session for the trial of Ms. Maya Fey.\nEdgeworth:\nThe prosecution is ready, Your Honor.\nPhoenix:\nThe defense is ready, Your Honor. (Miles Edgeworth... I'd better not show any signs of weakness today, or he'll be on me in an instant.)\nJudge:\nMr. Edgeworth. Please give the court your opening statement.\nEdgeworth:\nThank you, Your Honor. The defendant, Ms. Maya Fey, was at the scene of the crime. The prosecution has evidence she committed this murder... and we have a witness who saw her do it. The prosecution sees no reason to doubt the facts of this case, Your Honor.\nJudge:\nI see. Thank you, Mr. Edgeworth. Let's begin then.\nEdgeworth:\nIf we may call our first witness, Your Honor. (Changed from [You may call your first witness.] in the original release) The prosecution calls the chief officer at the scene, Detective Gumshoe!\nEdgeworth:\nWitness, please state your name and profession to the court.\nGumshoe:\nSir! My name's Dick Gumshoe, sir! I'm the detective in charge of homicides down at the precinct, sir!\nEdgeworth:\nDetective Gumshoe. Please, describe for us the details of this murder.\nGumshoe:\nVery well, sir! Let me use this floor map of the office to explain. The body was found by this window, here.\nEdgeworth:\nAnd the cause of death?\nGumshoe:\nLoss of blood due to being struck by a blunt object, sir! The murder weapon was a statue of \"The Thinker\" found next to the body, sir! It was heavy enough to be a deadly weapon, even in a girl's hands, sir!\nJudge:\nThe court accepts the statue as evidence.\nPhoenix:\n(They're still calling it a \"statue\"...)\nFloor Plans added to the Court Record.\nEdgeworth:\nNow, Detective...\nGumshoe:\nY-yes sir!\nEdgeworth:\nYou immediately arrested Ms. Maya Fey, who was found at the scene, correct? Can you tell me why?\nGumshoe:\nYes sir! I had hard evidence she did it, sir!\nJudge:\nHmm. Detective Gumshoe. Please testify to the court about this \"hard evidence.\"\nWitness Testimony\n-- Maya Fey's Arrest --\nGumshoe:\nAs soon as the phone call came in, I rushed to the scene!\nThere were two people there already:\nThe defendant, Ms. Maya Fey, and the lawyer, Mr. Phoenix Wright.\nI immediately arrested Ms. Maya Fey!\nWhy? We had a witness account describing her!\nThe witness saw Ms. Maya Fey at the very moment of the murder!\nJudge:\nHmm... The very moment, you say. Very well. Mr. Wright, you may begin your cross-examination.\nPhoenix:\nY-yes, Your Honor. (Cross-examine what...? I couldn't see a single contradiction in that testimony...)\n...whoosh...SMACK!\nPhoenix:\n(Hey! Maya just threw something at me... What's this? \"When my sister couldn't find any contradictions in a witness's testimony she would bluff it and press the witness on every detail! The witness always slips up and says something wrong... It worked lots of times!\" Heh... I should have expected Maya would know some of her sister's tricks! Alright. Let's give this a try!)\nJudge:\nSomething the matter?\nPhoenix:\nNo, Your Honor. I'd like to begin my cross-examination.\nCross Examination\n-- Maya Fey's Arrest --\nGumshoe:\nAs soon as the phone call came in, I rushed to the scene!\nGumshoe:\nThere were two people there already:\nGumshoe:\nThe defendant, Ms. Maya Fey, and the lawyer, Mr. Phoenix Wright.\nGumshoe:\nI immediately arrested Ms. Maya Fey!\nGumshoe:\nWhy? We had a witness account describing her!\nGumshoe:\nThe witness saw Ms. Maya Fey at the very moment of the murder!\nPhoenix:\n(I can't see a single contradiction in there! I'll just have to take Maya's advice and press him on anything suspicious!)\nPhoenix:\nHold on just one second!\nGumshoe:\nY-yeah?\nPhoenix:\nIf I heard correctly... You said you arrested her because you had \"hard evidence\" she did it, correct?\nGumshoe:\nHuh? Did... did I say that? Me?\nPhoenix:\nI heard you say it!\nJudge:\nYou did say it.\nEdgeworth:\nYou said it.\nPhoenix:\nExactly what about this suspicious woman in pink's claim was \"hard evidence\"!?\nGumshoe:\nWh-what!? Miss May isn't suspicious, and she sure isn't pink, pal! W-well, I guess she is pink...\nJudge:\nThat's enough, Detective Gumshoe. Do you have any more solid proof other than her claims, Detective?\nGumshoe:\nUmm...\nPhoenix:\n(Hmm! I guess pressing can have its advantages!)\nGumshoe:\n... Yes.\nPhoenix:\n(Gah!)\nGumshoe:\nSorry, I got the order of things mixed up in my testimony, Your Honor Sir! There was something I should have told you about first, Your Honor!\nJudge:\nVery well, Detective. Let's hear your testimony again.\nWitness Testimony\n-- Hard Evidence --\nGumshoe:\nAfter securing the suspect, I examined the scene of the crime with my own eyes.\nI found a memo written on a piece of paper next to the victim's body!\nOn it, the word \"Maya\" was written clearly in blood!\nLab test results showed that the blood was the victim's!\nAlso, there was blood found on the victim's finger!\nBefore she died, the victim wrote the killer's name!\nHow you like that? That's my \"hard evidence\"!\nJudge:\nHmm... Before we begin cross-examination, I have a question for you, Detective.\nGumshoe:\nY-Your Honor?\nJudge:\nWhy didn't you testify about this vital piece of evidence the first time!?\nGumshoe:\nAh... eh... I know. I'm real embarrassed I forgot about it, Your Honor Sir.\nJudge:\nTry to be more careful! Very well, the defense may begin its cross-examination.\nCross Examination\n-- Hard Evidence --\nGumshoe:\nAfter securing the suspect, I examined the scene of the crime with my own eyes.\nGumshoe:\nI found a memo written on a piece of paper next to the victim's body!\nGumshoe:\nOn it, the word \"Maya\" was written clearly in blood!\nGumshoe:\nLab test results showed that the blood was the victim's!\nGumshoe:\nAlso, there was blood found on the victim's finger!\nGumshoe:\nBefore she died, the victim wrote the killer's name!\nPhoenix:\n(That's his whole testimony... Okay, there has to be a contradiction in there somewhere. Let's find it!)\nPhoenix:\nDetective Gumshoe! There's one thing I want you to clarify for me here. You say that the victim, Mia Fey, wrote this note. That she was accusing the defendant, Maya Fey? That's really what you're saying?\nGumshoe:\nWh-what? This isn't one of those lawyer tricks, now, is it? Of course she wrote it! Who else could have!?\nPhoenix:\nYou have it backwards, Detective.\nGumshoe:\nB-backwards?\nPhoenix:\nThe victim is the only person who absolutely could NOT have written it! This is a report from your department, Detective. \"Immediate death due to a blow from a blunt object.\" She died immediately!\nGumshoe:\nBut...!\nPhoenix:\nNo \"but\"-ing your way out of this one, Detective!\nJudge:\nOrder! Order! The defense has a point. Someone who died immediately wouldn't have the time to write anything down.\nEdgeworth:\nEdgeworth:\nMr. Wright. I beg your pardon, but when exactly did you obtain that autopsy report?\nPhoenix:\nWh-when...!?\nJudge:\nThe prosecution's point being...?\nEdgeworth:\nThat autopsy report is outdated, Your Honor.\nPhoenix:\nWh-what!?\nEdgeworth:\nA second autopsy was performed yesterday, at my request! \"Death was almost immediate due to a blow from a blunt object... But there is a possibility the victim lived for several minutes after the blow.\" I received these results this morning.\nPhoenix:\nN-no way!\nEdgeworth:\nYour Honor! It's quite easy to imagine that the victim did have time to write \"Maya\"! That is all.\nJudge:\nI see!\nPhoenix:\n(Damn you, Edgeworth! I should have known you'd have something up your sleeve!)\nEdgeworth:\nWhy, Mr. Wright, you look shocked! Something you want to say?\nEdgeworth:\nYour Honor, I submit this report to the court.\nJudge:\nU-understood. The court accepts the evidence.\nAutopsy Report updated in the Court Record.\nEdgeworth:\nWell, Your Honor? The evidence strongly suggests the victim was identifying the killer.\nJudge:\nI suppose that's the obvious conclusion, yes.\nPhoenix:\n(Darn! This isn't good!)\nEdgeworth:\nThe prosecution would like to call its next witness. This poor, innocent girl saw the murder with her own eyes!\nJudge:\nLet the witness Miss April May take the stand.\nPhoenix:\n(Exactly what part of her is \"innocent\"...?)\nEdgeworth:\nWitness, your name, please.\nApril:\nApril May! At your service! *wink*\nJudge:\nOrder! An introduction should not require any reaction from the crowd! The witness will refrain from wanton winking! ([wanton] misspelled as [wonton] in the original release)\nApril:\nAww... Yes, Your Honor.\nPhoenix:\n(This is not good... She's already captured the heart of every man in the court!)\nEdgeworth:\nTell us, where were you on the night of September 5, when the murder occurred?\nApril:\nUm... gee... I was, like, in my hotel room? Tee hee. I checked in right after lunch.\nEdgeworth:\nAnd this hotel is directly across from the Fey & Co. Law Offices?\nApril:\nMmm... that's right, big boy.\nJudge:\nPlease testify to the court about what you saw.\nWitness Testimony\n-- Witness's Account --\nApril:\nIt was, like, 9:00 at night. I looked out the window, y'know!\nAnd then, oooh! I saw a woman with long hair being attacked!\nThe one attacking her was the mousey girl sitting in the defendant's chair!\nThen the woman, like, dodged to one side and ran away!\nBut that girl, she caught up to her and... and... She hit her!\nThen the woman with long hair...\nShe kinda... slumped.\nThe end. That's all I saw. Every little bitsy witsy! *wink*\nJudge:\nHmm...\nEdgeworth:\nWell, Your Honor?\nJudge:\nI see. It is a remarkably solid testimony. I don't see a need to trouble the witness any...\nPhoenix:\nW-wait, Your Honor!\nJudge:\nYes, Mr. Wright?\nPhoenix:\nWhat about my cross-examination!?\nJudge:\nI thought the witness's testimony just now was quite... firm. Didn't you?\nEdgeworth:\nMr. Wright... I understand you were Ms. Mia Fey's understudy, were you not? You must know her techniques well. Her cowardly way of finding tiny faults in perfectly good testimonies...\nPhoenix:\nH-hey! How dare you!\nJudge:\nWell, Mr. Wright? Will you cross-examine the witness?\nJudge:\nVery well, you may begin your cross-examination!\nCross Examination\n-- Witness's Account --\nApril:\nIt was, like, 9:00 at night. I looked out the window, y'know!\nApril:\nAnd then, oooh! I saw a woman with long hair being attacked!\nApril:\nThe one attacking her was the mousey girl sitting in the defendant's chair!\nApril:\nThen the woman, like, dodged to one side and ran away!\nApril:\nBut that girl, she caught up to her and... and... She hit her!\nPhoenix:\n(Hmm... that's it? Nothing really jumps out as a contradiction... There's got to be something in there somewhere! Maybe I'd better just press her on the facts a bit!)\nPhoenix:\nHold on a minute! That testimony stinks!\nApril:\nW-what!?\nPhoenix:\nMiss May, I'm willing to bet that...\nApril:\nUrp!\nJudge:\nMr. Wright! What's the meaning of this?\nApril:\nYes, what is the meaning! Somebody tell me because I'm clueless! About this, I mean!\nPhoenix:\nOkay... If you had really witnessed my client, Maya Fey... You would have noticed her clothes before noticing her physique!\nApril:\n...!\nPhoenix:\nNo one wears clothes like this on a daily basis! Except her! And I'm no expert on fashion, but her hairdo looks far from normal to me! However, the witness's testimony mentions neither of these things! The testimony is bogus!\nApril:\nBut... but!\nJudge:\nStill, we don't know if she was dressed that way the night of the murder...\nPhoenix:\nShe was, Your Honor! I saw her. And so did Detective Gumshoe! What do you say to that, Miss May?\nApril:\nRowr! What are you trying to say, you mean lawyer! I-I saw what I saw. I... just didn't think all the trifling little details were necessary, darling.\nJudge:\nMiss May. The court would like to remind you to please omit nothing in your testimony.\nApril:\nI'm sorry, Your Honor. I'll be a good girl. I promise. *wink*\nJudge:\nYour testimony again, if you would.\nPhoenix:\n(Damn, I almost had her!)\nWitness Testimony\n-- Witness's Account --\nApril:\nI did see everything! I did!\nThe victim--the woman--dodged the first attack and ran off to the right.\nThen the girl in the hippie clothes ran after her...\nAnd she hit her with that weapon! I saw it! I did!\nThat... that clock! Um... the kinda statue-y clock? \"The Thinker,\" I think?\nWell? Does the accuracy of my report not startle you? Tee hee!\nJudge:\nI... see. I only wish you had been so detailed from the beginning. Please begin the cross-examination.\nCross Examination\n-- Witness's Account --\nApril:\nI did see everything! I did!\nApril:\nThe victim--the woman--dodged the first attack and ran off to the right.\nApril:\nThen the girl in the hippie clothes ran after her...\nApril:\nAnd she hit her with that weapon! I saw it! I did!\nApril:\nThat... that clock! Um... the kinda statue-y clock? \"The Thinker,\" I think?\nPhoenix:\n(Her previous testimony must have been what Edgeworth wanted her to say... So this was the testimony in her own words...? Time to press and squeeze the truth out of her! Figuratively, of course.)\nPhoenix:\nMiss May. What you said just now was quite... revealing.\nApril:\nRevealing? Oooh, you'd like that, wouldn't you. Naughty Mr. Lawyer...\nPhoenix:\nYou just said that this statue of \"The Thinker\" was a clock. But there's no way of knowing that just by looking at it!\nApril:\nUrp!\nPhoenix:\nAnother person in much the same position as you recently called this a \"clock,\" too... And he was found guilty... of murder!\nJudge:\nOrder! Order!\nPhoenix:\nMiss May. Can you explain how you know this was a clock?\nApril:\nOooh... urp!\nEdgeworth:\nEdgeworth:\nThe witness saw the murder with her own eyes! That's all that's important here! The defense is trying to confuse the issue with trivial concerns!\nJudge:\nYes... yes, of course. You will withdraw your question, Mr. Wright.\nPhoenix:\nPhoenix:\nBut questions are all I have, Your Honor! And as you may recall, I've caught murderers with these questions before! (Well, only once...)\nJudge:\n... ... Objection sustained. You may continue to question the witness.\nPhoenix:\n(Whew, that was close. If he stopped me there, the trial would be over!)\nApril:\nHuh? What? So... what happens now?\nPhoenix:\nWhat happens now is you answer my question! How did you know it was a clock?\nApril:\nWhat...! Th-that's... ...Because... I heard it? Yes! I heard it say the time!\nPhoenix:\nSo, you've been to the law offices of Fey & Co.!\nApril:\nN-n-no! Hey, I didn't say that! Why would I go there! I heard from my hotel room. Hee hee!\nEdgeworth:\nThe law offices of Fey & Co., where the murder took place, are very close to the hotel. She could easily have heard the clock!\nJudge:\nHmm. Well, Mr. Wright? Are you satisfied?\nPhoenix:\nNo, Your Honor! (I can't give up now!) I'm not satisfied because...\nPhoenix:\nYour Honor, members of the court... It is inconceivable that the clock in question rang!\nJudge:\nThis clock is missing its clockwork! It's quite empty! Mr. Wright! Would you care to explain to the court the meaning of this?\nPhoenix:\nIt is as you can see. The \"clock\" was empty. It couldn't have rung! Therefore, this witness... is a big, fat liar!\nApril:\nF-fat!?\nPhoenix:\nWell, Miss May?\nEdgeworth:\nTsk tsk.\nPhoenix:\n?\nEdgeworth:\nQuite a show you've put on for us, Mr. Wright.\nPhoenix:\n(He knew the clock was empty! Somehow... he knew!)\nEdgeworth:\nI'm afraid you've forgotten one thing, however. Indeed, the clock is empty. As you say... it can't ring. However, we must ask: when was the clockwork removed? If it was after the witness heard the clock, then there is no contradiction!\nJudge:\n! Hmm! That's true. That is a possibility. The clock might have been emptied after she heard it.\nEdgeworth:\nAnd that is exactly what happened, Your Honor!\nJudge:\nWell, Mr. Wright? Can you prove when the clockwork was removed?\nEdgeworth:\nHo hoh! Impossible, of course...\nPhoenix:\nI have proof.\nEdgeworth:\nW-what!?\nPhoenix:\nWasn't it you who told me \"proof is everything\"? Well, I was listening. And now I'll show you the \"proof\" you like so much! The evidence that proves when the clockwork was removed is...\nPhoenix:\nTake a look at this!\nJudge:\nHmm. That's a very cute cell phone.\nApril:\nOoh hoo! You have a girlie phone!\nPhoenix:\nW-wait! Wait! This isn't my phone! Listen! This is the defendant's cell phone, and it contains a recording... A recording of a conversation she had with the victim on the day of the murder!\nJudge:\nOrder! Order!\nEdgeworth:\nThe defendant's cell phone!? Th-this wasn't brought to my attention!\nPhoenix:\nPerhaps Detective Gumshoe overlooked it?\nEdgeworth:\n*grumble* (The good detective better remember he's up for evaluation soon...)\nPhoenix:\n(I gotta say, I'm starting to feel bad for the big fella.) (Changed from [My heart goes out to you, Edgeworth. Not.] in the original release) Let's hear the conversation.\nCellular:\n*beep*\n...\nMaya:\n[So you just want me to hold on to \"The Thinker\" for you, then?]\nMia:\n[If you could. Ah... I should probably tell you, the clock isn't talking right now.]\nMaya:\n[Huh? It's not working? That's lame!]\nMia:\n[I had to take the clockwork out, sorry.]\n...[September 5, 9:27 AM]\nCellular:\n*beep*\nPhoenix:\nYour Honor, I think this makes it clear the clockwork was already gone by the time this was recorded, (Changed from [I think this recording makes it clear that the clockwork was already gone...] in the original release) which was well before the witness even arrived at her hotel! (Changed from [and this was recorded in the morning, before the witness even arrived at her hotel!] in the original release)\nApril:\nMuh... muh... muh!?\nPhoenix:\nWell, Miss May? Would you care to explain this to the court? Just how did you know that weapon was a clock!?\nApril:\n... W-well...! Well, isn't it o-obvious? I saw that clock before! Um... what store was that again? I-I go to so many! Oops! I forgot! *wink*\nJudge:\nSo the witness had seen it before. That would make sense. Does the defense have any objections, Mr. Wright?\nPhoenix:\nThe witness claims she had \"seen it before.\" But this directly contradicts a piece of evidence already submitted to this court!\nJudge:\nWell then, let's see it. Please produce this evidence that will prove the witness had not seen the clock before.\nPhoenix:\nIt's simple. This clock was never in any store, ever!\nApril:\nW-whaaat!?\nPhoenix:\nA friend of mine made that clock. Only two exist in the world. And the one that isn't here is in police custody!\nApril:\nI-impossible! Everything is sold in stores!\nPhoenix:\nMiss May, I think it's high time you went shopping for a better excuse...?\nApril:\nMmpf...\nPhoenix:\nOh? Excuses not on sale today?\nApril:\nOooh? Oh ho ho. Mmmrrrrph! Ooooorrrrrrr ggggghhhhhhh... hhh!!! What's it to you, porcupine-head!? That stupid clock doesn't matter, okay!? She did it! And she should die for it! Die!\nJudge:\nW-w-whoa! Let's not get ahead of ourselves. T-this is a court of law, and the witness will remain calm!\nApril:\nHrrrgh... hrrrh... Hrrr... heh. Oh? Oh! Oh? Oh hoh ho! S-silly me! *grunt* Did I, um, like... lose it? I guess I did. Tee hee! *wink*\nPhoenix:\n(S-scary...)\nJudge:\nMiss May, let me ask. Tell me, how did you know the weapon was a clock?\nApril:\n...\nJudge:\nHmm... oh dear. Does the defense have an opinion on this... behavior?\nPhoenix:\n(Okay, this is it!) Yes, Your Honor. Allow me to explain how I see the truth of the matter. Miss April May, you knew the weapon was a clock because...\nJudge:\nWell, does the defense have anything to say?\nPhoenix:\nUm, well... (Come on, think of something!)\nJudge:\nVery well! The court calls the hotel bellboy to the stand!\nEdgeworth:\nI believe we're ready for the witness to testify. He certainly does look like a bellboy.\nBellboy:\nYes, sir. I received your summons in the middle of work, sir. I'm happy to be of service.\nJudge:\nThat tea set looks rather heavy, so without further ado, the witness may begin his testimony.\nBellboy:\nVery good, sir!\nWitness Testimony\n-- Miss May's Room Service --\nBellboy:\nI am the head bellboy at the fine Gatewater Hotel, in business for four generations!\nI believe I received a call after 8:00 in the evening from our guest, Miss May.\nShe asked for an ice coffee to be brought to her at 9:00, on the dot, sir.\nI brought it to her at precisely the requested time, of course.\nAnd I delivered the ice coffee to our guest Miss May, herself.\nJudge:\nI see. The defense may begin its cross-examination.\nPhoenix:\nR-right! I'm ready. (I hope... This is it... If I can't prove Miss May was involved with the murder now... Maya will be finished!)\nCross Examination\n-- Miss May's Room Service --\nBellboy:\nI am the head bellboy at the fine Gatewater Hotel, in business for four generations!\nBellboy:\nI believe I received a call after 8:00 in the evening from our guest, Miss May.\nBellboy:\nShe asked for an ice coffee to be brought to her at 9:00, on the dot, sir.\nBellboy:\nI brought it to her at precisely the requested time, of course.\nBellboy:\nAnd I delivered the ice coffee to our guest Miss May, herself.\nPhoenix:\n(This bellboy wouldn't have any reason to lie... But I have to find something to use in his testimony! One more time. I'll press him until he spills the beans... or his tea!)\nAfter pressing fourth and fifth statements:\nPhoenix:\n... It's no good! (There's nothing there! Is... is that it!?)\nEdgeworth:\nTsk tsk. Finally, you understand. This bellboy has absolutely no reason to lie! Now... If you have any decency, you will end this rather tedious cross-examination here!\nJudge:\nHmm. It was a bit tedious. The witness may leave the stand.\nPhoenix:\n(I can't let this happen... can I?)\nPhoenix:\nW-wait! Please wait!\nJudge:\nYes? Does the defense have something to add?\nPhoenix:\nOne last question... let me ask one last question!\nEdgeworth:\nEdgeworth:\nYour Honor, I must object. This charade of justice has gone on long enough!\nJudge:\nNow, now, Mr. Edgeworth. Alright Mr. Wright. I'll give you one more question, that's all.\nPhoenix:\n(Okay. This is really it, now. This is my last chance! What do I ask him about...!?)\nEdgeworth:\nI object! That was... objectionable!\nJudge:\n... Objection overruled. The witness will answer the question.\nBellboy:\nEr... yes, I see.\nPhoenix:\nWhy did you not mention this in your testimony!?\nBellboy:\nW-well, sir, you er... you didn't ask!\nPhoenix:\n(Nice try!) That's the sort of thing you're normally supposed to mention!\nBellboy:\nAh, yes, quite. Indeed... It was the, er, good barrister there, Mr. Edgeworth, who...\nPhoenix:\n!\nBellboy:\nHe asked me not to mention it if I wasn't specifically asked, sir.\nEdgeworth:\nOof! Y-you fool!\nPhoenix:\nI've done it... I've won!\nPhoenix:\nMiss April May checked into a twin room... with a man. Correct?\nBellboy:\nYes, sir.\nPhoenix:\nThen, when you brought them room service, you didn't see that man in the room...?\nBellboy:\nThat's right, sir.\nJudge:\nHmm...\nPhoenix:\nYour Honor! We have just learned of another person involved who may have been the murderer! In light of this new fact, I hold that it's impossible to judge the defendant. (Changed from [In this new light, I hold that it's impossible to judge the defendant.] in the original release) You agree, Mr. Edgeworth?\nEdgeworth:\nAnd who, Mr. Wright! Who is this \"other person\"! (Changed from [Who! Who is this 'other person'!] in the original release)\nPhoenix:\nSimple, it was...\nPhoenix:\nThe man who checked in with Miss May!\nEdgeworth:\nOof!\nPhoenix:\nYour Honor! As has been previously revealed, Miss April May was tapping the victim's phone. Yet Miss May herself has an alibi at the time of the murder. However, that does not clear the man that was with her! The bellboy saw no one else in the room at the time of the murder!!!\nEdgeworth:\nM-my, what a convenient little setup... but it's too late...\nPhoenix:\n\"Too late\"? I suppose you'd like it if it was too late, wouldn't you... After all, it was you who hid the presence of the other man from this court!\nEdgeworth:\nOof! Upstart... amateur...! T-these accusations are... ludicrous!\nJudge:\nEnough! The court acknowledges the defense's argument. I expect the prosecution and defense to look into this matter fully! Am I understood?\nEdgeworth:\nYes... *gasp* Yes, Your Honor.\nJudge:\nThat is all today for the trial of Maya Fey. Court is adjourned!\nSeptember 7, 2:24 PMDistrict CourtDefendant Lobby No. 1\nMaya:\nMr. Wright! You were amazing in there!\nPhoenix:\nR-really?\nMaya:\nI think I might be your newest fan!\nPhoenix:\nOh, I was just \"doing my job\" you know... heh heh.\nMaya:\nThen again, that other attorney was pretty cool, too...\nPhoenix:\nHuh?\nMaya:\nThat face of his! With his eyes wide, and trembling lips! It sent shivers up my spine!\nPhoenix:\nHmm... if you say so.\nMaya:\nSo, what happens with me? Do I get to go home now?\nPhoenix:\nUm, well... (Changed from [Well, no.] in the original release) No, I don't think so. Not yet. (Changed from [I don't think so. Not yet.] in the original release)\nMaya:\nOh... I see.\nPhoenix:\nBut I got a great lead in today's trial!\nMaya:\nA \"lead\"?\nPhoenix:\nThat man with Miss May! He's the key!\nMaya:\nOh! I get it. What happened to Miss May after that, anyway?\nPhoenix:\nI heard they arrested her. I guess she's learning her charms won't work everywhere. She's probably at the detention center now. I may have to go down there later. Anyway. This case is far from closed.\nMaya:\nYes sir!\nPhoenix:\nI'm going to find out more about this man.\nMaya:\nDo you think he was the one who...?\nPhoenix:\nMaybe so.\nMaya:\nSis...\nPhoenix:\nDon't worry, I'll find him by tomorrow. I promise.\nMaya:\nI'm counting on you!\nPhoenix:\nI asked for a full record of April May's testimony. I thought it might come in handy during the trial tomorrow. But now that I have it, I'm not so sure. Most of her testimony was all lies... In fact, there's only one part that hasn't been stricken from the record. (Changed from [In fact, there's only one part that got left on the record.] in the original release)\nMay Testimony added to the Court Record.\nPhoenix:\nI don't know how much good this will do me at all, now. Anyway, time to hit the pavement and do some investigating! Maya doesn't belong in that detention center, and it's up to me to set her free! (Changed from [Maya doesn't belong in that detention center, and it's up to me to get her free!] in the original release)\nTo be continued.\n\nSeptember 7, 3:11 PMDetention CenterVisitor's Room\nApril:\nWell hello! I didn't expect anyone to visit me in such a dank place as this... It's really quite... moving. Not! You stinking lawyer! I hope you die! Have you come to laugh? Yes, laugh at the fallen Miss May!\nPhoenix:\nNo, not really, there's something I wanted to ask.\nApril:\nUnfortunately, there is nothing I want to BE asked. Haven't you done enough questioning, you...! Spiky-head!\nPhoenix:\n(Here we go again...) Please, you're scaring the security guard.\nApril:\n... So? What is it you wish to ask of me, then? Hmm?\nPhoenix:\n(For starters, how did you get to be so totally whacked!?)\nSeptember 7Fey & Co. Law Offices\nPhoenix:\nLooks like forensics is taking the day off today. Detective Gumshoe's nowhere in sight. The police really gave this place a working over. I doubt there are any valuable clues left. Suppose it can't hurt to take a look around, though.\nSeptember 7Grossberg Law Offices\nPhoenix:\n(Huh. Looks like Grossberg is out today... again. Maybe he's avoiding me for some reason?)\nDetention Center (after visiting Grossberg Law Offices)\nApril:\nYOU AGAIN!? Can't you take a hint and stay gone?\nPhoenix:\nHey, the only reason I'm back here is because YOU won't talk to me!\nApril:\nOh, so it's MY fault now? You don't just have spiky hair, you also have a spiky heart.\nPhoenix:\n(That does it. When this case is done I'm shaving my head.)\nSeptember 7Gatewater HotelRoom 303\nBellboy:\nAh, welcome, sir! Quite the performance today, if I dare say so myself.\nPhoenix:\nOh, um, thanks. Sorry for putting you on the spot like that.\nBellboy:\nNo, no, not at all, sir! Your efforts today can only help the Gatewater's \"rep,\" as they say.\nPhoenix:\nHuh? \"Rep\"?\nBellboy:\nYes! Our reputation will swell as the hotel where the murderer used a wiretap! We can charge a premium for the room, of course. It will be great for business, sir!\nPhoenix:\nWhoa, whoa! Miss May hasn't been charged with murder.\nBellboy:\nI, too, will become famous! \"The Bellboy who brought the murderer ice coffee\"...!\nPhoenix:\n(Why do I feel like we're both stuck in the same bad dream...)\nBellboy:\nSo! You are our honored guest. Please let me know if there is anything I can bring you!\nGrossberg Law Offices (after Bellboy's Affidavit is added to the Court Record)\nPhoenix:\n(*sigh* He's out again? Huh? No more photos on the desk...)\nDetention Center\nGatewater Hotel (after presenting Bellboy's Affidavit in Detention Center - Visitor's Room)\nPhoenix:\nHmm. The bellboy seems to be out. Huh? The sound of water coming from the shower...\nBellboy:\n\"La-dee-da! Money-Makin'... Money-Makin'... I got the Money-Makin' bluuuues...\"\nPhoenix:\nSomeone seems to enjoy washing the showers.\nGrossberg Law Offices (after presenting Bellboy's Affidavit in Detention Center - Visitor's Room)\nPhoenix:\n(Alright, this is getting ridiculous. Where the heck is that loafer?)\nGrossberg:\n*Ah-HHHHEM!*\nPhoenix:\n(Ah, that old familiar clearing of the throat...)\nGrossberg:\nAh hah! You again.\nPhoenix:\nUm, hello, Mr. Grossberg.\nGrossberg:\n... Well, well. You were quite the thing, my boy.\nPhoenix:\nExcuse me...?\nGrossberg:\nThe trial! The trial!\nPhoenix:\n(He was there...?)\nGrossberg:\nReminded me of myself when I was a youth!\nPhoenix:\n(I guess something got passed down through Mia... maybe?)\nGrossberg:\nIt brings back memories, it does! \"Ah... the days of my youth... like the scent of fresh lemon...\" you see. ... I apologize.\nPhoenix:\n?\nGrossberg:\nI... It was all a bit too much for me, my boy. Seeing you today, I... well, I... ...\nPhoenix:\n(I appreciate the reminiscing, but I'd much rather you gave me some information!)\nAfter selecting \"Push her hard\" upon presenting Bellboy's Affidavit in Detention Center - Visitor's Room, or selecting \"Ease her fears\" upon presenting Bellboy's Affidavit in Detention Center - Visitor's Room, then presenting Photograph (DL-6 Incident - Exhibit B) in Grossberg Law Offices:\nSeptember 7Bluecorp Inc.CEO's Office\nPhoenix:\n... (What's with the surreal décor...?)\n???:\nWelcome! Please furnish me with the title of your personage!\nPhoenix:\n(What the...?)\nWhite:\nYour name! What's your name? I was just inquirably asking the title that you go by.\nPhoenix:\nUh... Wright. Phoenix Wright. (\"Inquirably\"...?)\nWhite:\nMr. Wright, is it? Right, I see... Splendiferous. Perhaps I have intimidated you with my giantesque vocabulary...?\nPhoenix:\n(What is this guy's problem!)\nWhite:\nI'm Redd White, CEO of Bluecorp. You know, Corporate Expansion Official? My business dealings bring me into contact with the elite of the elite. So I'm afraid I am not used to conversing with the wordily-challenged.\nPhoenix:\n(What a fruitcake!)\nWhite:\nHmmm, let me guess... You are an attorney fresh out of law school, are you not? That's the only explanation for why you would come to meet me like this!\nPhoenix:\n(What does he mean by that?)\nWhite:\nNo matter. So, what business does a \"mighty\" lawyer have with a man such as myself?\nPhoenix:\n(Yipes! This guy's arrogance meter is off the scale!)\nWhite:\n... Mr. Wrong, was it?\nPhoenix:\nWright.\nWhite:\nIt appears you do not fully grasp your position here. I ask again. Who are you?\nPhoenix:\nUmm... huh? A lawyer?\nWhite:\nNo, my feeble friend. A \"mere\" lawyer. Worth nothing. Zilch. Zippo. Nada! Just like that sorry excuse for an attorney, Grodyburger!\nPhoenix:\n(Wh-what!?) Ungh! Oof...! Unh... uhhh... (He... he punched me!)\nWhite:\nWell, Mr. Lawyer. What will you do, eh? Charge me with assault? Charge away, I welcome it! For it is YOU who will be found guilty!\nPhoenix:\nWhat...?\nWhite:\nHeed my exposition! The police, the courts, they all do my bidding.\nPhoenix:\n(So you say... But I wonder... Is that kind of control really possible?)\nWhite:\nI don't expect you to understand. It is a world beyond your compensation. ... You came here from Grodyburger's, I presume?\nPhoenix:\nMr. Grossberg's... yes.\nWhite:\nThen you must ask him: Why is it that this painting of his hangs here? Perhaps then he will tell you? Perhaps he will explain how a man can live life purely for personal profit! ... Go now! Skedaddle! There is nothing more to discuss!\nDetention Center (after visiting Bluecorp)\nPhoenix:\nApparently, Miss May is in questioning. I doubt they'll let me talk to her today.\nGrossberg Law Offices (after selecting \"\"I've seen it before\" or \"When did you get it?\" upon selecting \"That painting\" Talk option in Bluecorp)\nGrossberg:\n... ... ...\nPhoenix:\n(Huh? I don't think he's noticed me standing here. Maybe I should... clear my throat?) Aaa-HHHEM!\nGrossberg:\nJumping Jehosephats! Oh! You!\nPhoenix:\nWhat's wrong? You looked so pensive... like an old man at the end of his days.\nGrossberg:\nHmm? I'm not senile yet! I was just thinking about this whole mess...\nPhoenix:\n(Something's really bothering him, that much is clear.)\nGrossberg:\nRedd White is a man who makes his living through intimidation. Bluecorp is a company that excels in finding people's weaknesses, I'm afraid. I've been paying them for 15 years now...\nPhoenix:\n(15 years...!)\nGrossberg:\nAll because of the \"DL-6 Incident,\" as you may have guessed.\nPhoenix:\n(The name on the back of those photographs!)\nGrossberg:\nAs you suspected, I could not stand in defense of Maya because of this. White would have destroyed me if I did.\nPhoenix:\n(So that's the connection!)\nGrossberg:\nIt is hard for me to tell you this, my boy. But arresting Redd White will be nigh on impossible.\nPhoenix:\nImpossible? Why!?\nGrossberg:\nHe has information on everyone. It gives him an iron grip! He owns judges, attorneys, prosecutors, police... and politicians.\nPhoenix:\nWhat!?\nGrossberg:\nThey are bound, unable to do harm to themselves, and therefore, to him. Don't look at me like that. What you see is nothing more than the weight of many years.\nFey & Co. Law Offices (after clearing \"Reason for blackmail\" Talk option in Grossberg Law Offices)\nPhoenix:\nIt's funny, looking at this room, it seems... so normal. Hard to imagine a murder took place here. Mr. Grossberg said there would be clues... Maybe I should have another look.\nGrossberg Law Offices\nBluecorp (after Newspaper Clipping is added to the Court Record)\nWhite:\nWell, aren't you persistent.\nPhoenix:\nSorry, but there's something I have to ask you.\nWhite:\nMr. Lawyer, I really hate having to repeat myself... But it seems the message has not yet penetrated your thick skull... Stop bothering me! If you try my patience further, I fear a nasty accident may occur. Do I make myself clear?\nPhoenix:\n(Transparent...)\nPhoenix:\nYou were blackmailing him!\nWhite:\nBlackmail?\nPhoenix:\nNot just him, either. You were threatening and coercing hundreds of others! You were involved in all of the suicide cases that Mia investigated! This company is built on blackmail! I'm right, aren't I?\nWhite:\nWhat a bizarre accusation. Mr. Wrong... What is it that you should be doing now? Investigating me? No no no. I think not! You should be searching for the one who killed Miss Mia!\nInterphone:\n*beep*\n[Secretary's Office, hello?]\nWhite:\nMr. Wrong will be leaving now.\nInterphone:\n[Yes, sir. I'll send someone right away.]\nPhoenix:\nWait a second, Mr. White...\nWhite:\nJust what are you insinuating?\nPhoenix:\nMia was on to you. She was keeping tabs. For this reason you had April May tapping her phone. Then, Mia was murdered, and all the documents about you mysteriously disappeared. So, the culprit would be...?\nWhite:\n...\nPhoenix:\nEven a child could work it out, Mr. White. You did it!\nWhite:\n...\nInterphone:\n*beep*\n[Secretary's office.]\nWhite:\nWe won't be needing an escort for Mr. Wrong. Instead, please connect me to the public prosecutor's office.\nInterphone\n[Of course, sir. One moment please...] ... [White? That you? What are you doing calling me at a time like this!?]\nWhite:\nHello. Chief Prosecutor? I've changed my mind. I want to testify tomorrow.\nInterphone:\n[What's this about?]\nWhite:\nThe Mia Fey case. I witnessed the murder, you see. And, thus, as a very important witness, I would like to testify.\nInterphone:\n[What? Why now? I thought you said you didn't want to go to court?]\nWhite:\nQuietude...! I told you I changed my mind, didn't I? Oh, and one other thing. Send the police over here right away. The man is standing right in front of me. He looks dazed but could be violent!\nInterphone:\n[What? What man?]\nWhite:\nAre you even listening? The executioner! The hatchet-man! The liquidator... The killer, man!\nPhoenix:\nWhat!?\nInterphone:\n[Mr. White... this isn't another one of those...]\nWhite:\nChief Prosecutor. I do not believe you are in a position to freely offer your opinions to me, correct? I'm telling you to send the police, now!\nInterphone:\n*beep*\nWhite:\n... Did I not tell you, Mr. Wrong? You are a mere lawyer! As was Miss Mia.\nPhoenix:\nHow dare you!\nWhite:\nI'll point the finger at you, and you will be tried as Miss Mia's killer! The case is as good as settled. No lawyer of any worth will defend you. I have friends in the local lawyer's association, you see. You'll be given a lawyer so stupendously inept that they make even you look competent.\nPhoenix:\n(I... I feel faint.)\nGumshoe:\nDetective Gumshoe, reporting, sir! Aaa! Butz! Hairy Butz!\nPhoenix:\nWright, actually. Phoenix Wright. And my friend's name is \"Larry\"...\nGumshoe:\nOh, right! Sorry, pal. Butz was that murderer, right?\nWhite:\nDetective Gumshoe. I present to you, the man who killed Miss Mia Fey!\nGumshoe:\nW-what!?\nWhite:\nTake this despicable human being into custody. ... Farewell, Mr. Wrong!\nSeptember 8, 3:37 PMDetention CenterVisitor's Room\nPhoenix:\nI can't believe it's only been a day since the first trial. My trial begins tomorrow. White's going to set a trap for me. And the prosecution will be in on it, of course. Edgeworth, included. An attorney was assigned to me by the state, yesterday. I refused. I had an idea.\nMaya:\n... Wright! Mr. Wright!\nPhoenix:\nOh, Maya! Great, they let you out of detention.\nMaya:\nJust now, yes. It's all thanks to you!\nPhoenix:\nHah. Now I'm afraid we've switched places.\nMaya:\nWhat? You mean, you...?\nPhoenix:\nI explained what had happened to Maya. ...\nMaya:\nI don't believe it! How many people does that man need to destroy before he's satisfied!? My mother... My sister... And now you! This has gone too far! Mr. Wright, please tell me, is there anything I can do?\nPhoenix:\nUm... well...\nPhoenix:\n... W-wait. Wait wait wait.\nMaya:\nWhat what what?\nPhoenix:\nI'm kidding! It was a joke!\nMaya:\nNo way!\nPhoenix:\nNo really, I was kidding. But thanks. It's good to know you're on my side. (And there really isn't anything you can do for me anyway...)\nMaya:\nBut... but I can't just sit here and do nothing! I've got to give that man a piece of my mind!\nPhoenix:\n(Just a piece...?) Okay. Then, come to the court tomorrow.\nMaya:\nO-okay! I'll be there! I'll show them a thing or two!\nPhoenix:\nTimes may change, yet with crime it's the same old story. (Changed from [It's the beginning of a new century, yet with crime it's the same old story.] in the original release) In fact, it's gotten worse. Lengthy court proceedings are no longer realistic. Beginning a few years ago, a limit of three days was put on initial court trials. Almost all finish in a day. Most with a guilty verdict. I never thought I would end up in the defendant's chair myself for this case. (Changed from [I never thought I would end up in the defendant's chair myself.] in the original release) With the true culprit appearing as the star witness. (Changed from [Tomorrow the true culprit will appear as a witness.] in the original release) This is it! Tomorrow, it's me or him! (Changed from [This is it! It's me or him!] in the original release)\nTo be continued.",
  "characters": [
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Mia Fey",
      "age": "27",
      "gender": "Female",
      "description1": "Chief Attorney at Fey & Co.. My boss, and a very good defense attorney.",
      "description2": "The victim. Chief attorney at Fey & Co. Law Offices, and an excellent defense lawyer."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Maya Fey",
      "age": "17",
      "gender": "Female",
      "description1": "Mia's little sister. Found bent over her sister's body, crying.",
      "description2": "The defendant. Mia's little sister, and a spirit medium in training.",
      "description3": "Mia's little sister. Currently training to become a spirit medium."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Dick Gumshoe",
      "age": "30",
      "gender": "Male",
      "description1": "Detective at the local precinct. In charge of the initial investigation."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Miles Edgeworth",
      "age": "24",
      "gender": "Male",
      "description1": "A gifted prosecutor, and a ruthless man who'd do anything to get a \"guilty\" verdict."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "April May",
      "age": "23",
      "gender": "Female",
      "description1": "An eye witness to the events. Testifies that she saw Maya commit the murder.",
      "description2": "Stayed with someone else in the hotel on the night of the murder. Tapped Mia's phone."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Marvin Grossberg",
      "age": "64",
      "gender": "Male",
      "description1": "A veteran defense attorney, and Mia's mentor."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Bellboy",
      "age": "26",
      "gender": "Male",
      "description1": "Bellboy at the Gatewater Hotel.",
      "description2": "Delivered room service to Miss May at the time of the murder. Also checked her in."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Redd White",
      "age": "39",
      "gender": "Male",
      "description1": "An eye witness. CEO of the information gathering company, Bluecorp."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "No one would believe I was a defense attorney if I didn't carry this."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "The Thinker",
      "type": "Weapons",
      "obtained": "Retrieved at Fey Law Office.",
      "description1": "The murder weapon. Looks like a statue, but it's actually a clock. Made by Larry Butz.",
      "description2": "Clock in the form of a statue. The clock's gears have been removed. Made by Larry Butz."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Glass Shards",
      "type": "Evidence",
      "obtained": "Retrieved at Fey Law Office.",
      "description1": "The broken remains of a glass light stand. Broken beyond all recognition."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Receipt",
      "type": "Evidence",
      "obtained": "Retrieved at Fey Law Office.",
      "description1": "A department store receipt with letters written in blood on the back.",
      "description2": "Receipt for a glass light stand. The date of purchase is the day before the murder."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Maya's Memo",
      "type": "Documents",
      "obtained": "Received from Maya Fey.",
      "description1": "\"A conversation I had with my sister is recorded on my cell phone.\""
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Mia's Autopsy Report",
      "type": "Reports",
      "obtained": "Received from Detective Dick Gumshoe.",
      "description1": "Time of death: 9/5 at 9:00PM. Cause: single blunt force trauma. Death was instantaneous.",
      "description2": "Died from a blow by a blunt object. May have lived for a few minutes after being hit."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Maya's Cell Phone",
      "type": "Other",
      "obtained": "Received from Detective Dick Gumshoe.",
      "description1": "Holds a conversation between the Chief and Maya. Click here for details."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Wiretap",
      "type": "Evidence",
      "obtained": "Retrieved at Gatewater Hotel.",
      "description1": "Found in Miss May's hotel room."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Floor Plans",
      "type": "Maps",
      "obtained": "Submitted as evidence during the trial.",
      "description1": "The murder scene, the Fey & Co. Law Offices. The stand is blocked from view looking from the office."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "May Testimony",
      "type": "Documents",
      "obtained": "Received from Miss April May.",
      "description1": "\"The victim dodged an attack then ran to the right, but she was caught and struck.\""
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Photograph",
      "type": "Photographs",
      "obtained": "Retrieved at Grossberg Law Offices.",
      "description1": "On the back the words \"DL-6 Incident - Exhibit A\" are written in pencil."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Photograph",
      "type": "Photographs",
      "obtained": "Retrieved at Grossberg Law Offices.",
      "description1": "On the back the words \"DL-6 Incident - Exhibit B\" are written in pencil."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Bellboy's Affidavit",
      "type": "Documents",
      "obtained": "Received from the bellboy.",
      "description1": "Describes the man who stayed with Miss May in the hotel on the night of the murder."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Newspaper Clipping",
      "type": "Other",
      "obtained": "Retrieved at Fey Law Office.",
      "description1": "Article about politician's suicide. The word \"White\" is written in pen at the top."
    },
    {
      "currentChapter": "Turnabout Sisters",
      "name": "Mia's Memo",
      "type": "Documents",
      "obtained": "Received from Mia Fey.",
      "description1": "A list of people's names in Mia's handwriting."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "Turnabout Sisters\n\n\n\n\n\n\n\n\n\nTranscript\n\nTranscript (JP)Part 1\n\nPart 2\n\nPart 3\n\nPart 4September 9, 9:52 AMDistrict CourtDefendant Lobby No. 1Maya:\nWell... I guess this is it!Phoenix:\nYeah. One way or another, this case gets decided today.Maya:\nAaa! Ph-Phoenix! Look!Phoenix:\n(...! Prosecutor... Edgeworth.)Edgeworth:\nI received a call from the public prosecutor's office yesterday.Phoenix:\n?Edgeworth:\nHe told me that whatever Mr. White says today, it will be the \"absolute truth.\" No matter how you try to attack his testimony... If I raise an objection, I have it on good faith that the judge will listen to me.Phoenix:\n(What, does White have the judge in his pocket, too!?) So... you're saying I'm going to be guilty. End of story?Edgeworth:\n... I will do anything to get my verdict, Mr. Wright. Anything.Maya:\nWhy... Why!? How can you torment an innocent person like this!?Edgeworth:\n\"Innocent\"...? How can we know that? The guilty will always lie, to avoid being found out. There's no way to tell who is guilty and who is innocent! All that I can hope to do is get every defendant declared \"guilty\"! So I make that my policy.Phoenix:\nEdgeworth... You've changed.Maya:\nHmm? Phoenix! You know him!?Edgeworth:\nDon't expect any special treatment, Phoenix Wright.Maya:\nPh-Phoenix...?Phoenix:\nWell... court will be starting soon. (Changed from [Well... court will be opening for session soon.] in the original release)Maya:\nWhat? But wait! Your defense attorney isn't even here yet! They're not... (Changed from [Your defense attorney isn't even here yet! He's not...] in the original release)Phoenix:\nI'll be defending myself.Maya:\nWhaaaat!?Phoenix:\nOkay, let's do this.September 9, 10:00 AMDistrict CourtCourtroom No. 1Judge:\nThe court is now in session for the trial of Mr. Phoenix Wright.Edgeworth:\nThe prosecution is ready, Your Honor.Phoenix:\nThe defense is ready, Your Honor.Judge:\nMr. Wright... Are you sure you're up to doing this?Phoenix:\nYes, Your Honor. I will be defending myself.Judge:\nUnderstood. Very well. Mr. Edgeworth, your opening statement, please.Edgeworth:\nAs the details of the event are already quite clear to the court, today we will hear the testimony of a witness to the defendant's crime. (Changed from [today we will hear the testimony of another witness to the defendant's crime.] in the original release)Judge:\nI see. The prosecution may call its witness.Phoenix:\n(That went far too smoothly! Why didn't the judge ask Edgeworth why his witness didn't testify before!? It's like... it's like he already knows why! Hmm. If anyone's going to raise an objection about this, I suppose it's me...)Objection\n\n\n\n\n\n\n\nPhoenix:\nMr. Edgeworth, you owe an explanation to the court! Why didn't this witness testify in the trial against Ms. Maya Fey!?\nEdgeworth:\nHmph. I'm ever so sorry! Mr. White is a busy man, and besides... at the time, I thought that Ms. May's opinion was all that would be needed. Again, my sincerest apologies to the court.\nJudge:\nExcellent, Mr. Edgeworth. I appreciate your demeanor.\nEdgeworth:\n...\nPhoenix:\n(Great. He gets to show off and I get nowhere.)\nLeads to:\n\"I would like to call Mr. Redd White to the stand!\"Let it go\n\n\n\n\n\n\n\nPhoenix:\n(Forget it. I smell a trap.)\nLeads to:\n\"I would like to call Mr. Redd White to the stand!\"Edgeworth:\nI would like to call Mr. Redd White to the stand!Edgeworth:\nPlease state your full name.White:\nYou wish to know the title of my personage?Edgeworth:\nEr... your name?White:\nYes! That is what I said! Oh dear, do my locutions confuse?Edgeworth:\nName!Phoenix:\n(These two are great together...)White:\nMy name is Redd White. But my friends call me Blanco Nino. I am the CEO, or to use a more common term, the President, of Bluecorp.Edgeworth:\nDid you know the victim, Ms. Mia Fey?White:\nThat would be a negatory! No, I did not.Edgeworth:\n... You were at the Gatewater Hotel the night of the murder?White:\nCorrect.Edgeworth:\nAnd you witnessed the murder from there?White:\nAhem. Why tell you what you already know?Judge:\nVery well, Mr. White. You may begin your testimony.Phoenix:\n(If I can't rip this guy's testimony apart, I'm done for. Why do I always feel like it's the end of the world and I'm the last man standing?)White:\nHo hoh hoh. I hope you have made your peace with God, Mr. Lawyer!Phoenix:\n...!Maya:\nLet him have it, Phoenix!Witness Testimony-- Witness's Account --White:\nLet's see, it was about 9:00, I believe.\nI was quietly perusifying... er, that's \"reading\" to you, some papers by the window.\nThen I heard a bedlam coming from outside!\nSurprised, I turned to look at the building across the way.\nIt was then I saw him: a spiky-haired man attacking a woman with long hair!\nNeedless to say that man was none other than you, Mr. Lawyer!\nI called Miss May over at once. She, too, was flabbergasted of course.\nThe victim, she... she ran away, but you gave chase!\nFinally there was a terrible impaction! Then it was all over...Judge:\nHmm... If things occurred as you testify, then I'm afraid the defendant is guilty. Very well, defendant... er, I mean, Mr. Wright. Your cross-examination...Phoenix:\nYes, Your Honor.Cross Examination",
      "testimonies": [
        {
          "testimony": "Let's see, it was about 9:00, I believe.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "I was quietly perusifying... er, that's \"reading\" to you, some papers by the window.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "Then I heard a bedlam coming from outside!",
          "person": "White",
          "present": []
        },
        {
          "testimony": "Surprised, I turned to look at the building across the way.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "It was then I saw him: a spiky-haired man attacking a woman with long hair!",
          "person": "White",
          "present": []
        },
        {
          "testimony": "Needless to say that man was none other than you, Mr. Lawyer!",
          "person": "White",
          "present": []
        },
        {
          "testimony": "I called Miss May over at once. She, too, was surprised of course.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "The victim, she... she ran away, but you gave chase!",
          "person": "White",
          "present": []
        },
        {
          "testimony": "The victim ran to the left, and you gave chase!",
          "person": "White",
          "present": [
            "May Testimony"
          ],
          "source": {
            "evidence_span": "The victim dodged an attack then ran to the right",
            "testimony_span": "The victim ran to the left",
            "explanation": "The direction to which the victim ran in the witness' testimony contradicts a previous testimony.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "easy"
          }
        },
        {
          "testimony": "Finally there was a terrible impaction! Then it was all over...",
          "person": "White",
          "present": []
        }
      ],
      "noPresent": false,
      "difficulty": "easy",
      "labels": [
        "spatial"
      ],
      "reasoning": [
        "Fact 1: The witness claims the victim ran to the left.",
        "Fact 2: The evidence suggests the victim ran to the right."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- Witness's Account --White:\nLet's see, it was about 9:00, I believe.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHow do you know what time it was?\nWhite:\nBecause I am always abso-posi-lutely perfect, you know?\nPhoenix:\nNo no no, you're not getting away with that!\nWhite:\nYou are so mistrusting, Mr. Lawyer! So... what was the proper term for \"secretary\" again...? Anyway, Miss May ordered room service for 9:00. It happened soon after the room service arrived.\nPhoenix:\n(Hmm. That's what Miss May said, too.)\n\n\n\nPress further\n\n\n\n\n\n\n\nPhoenix:\nTrue, the bellboy who brought the coffee saw Miss May. But he testified that he did not see you at the time!\nWhite:\nAhem. This is your concern? Silly Lawyer! Miss May received the coffee outside the room! Of course he could not see me. He would need X-ray vision to pull off something like that!\nPhoenix:\n(Hmm...)\nEdgeworth:\nTell us, what were you doing at the time?\nLeads back to cross-examination\n\n\n\n\nHold back\n\n\n\n\n\n\n\nPhoenix:\n(I don't see anything to gain by attacking him on this point any further.) Okay, what were you doing at the time?\nLeads back to cross-examinationWhite:\nI was quietly perusifying... er, that's \"reading\" to you, some papers by the window.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nBy window, you mean the one directly across from the Fey & Co. Law Office?\nWhite:\nCorrect! That is the only window, you see.\nPhoenix:\nAnd there you were reading... papers?\nWhite:\nCorrect! The Gatewater is a businessman's hotel, and I am a busy man who had business to do!White:\nThen I heard a bedlam coming from outside!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nA \"bedlam\"?\nWhite:\nIt must have been when you attacked, I assume.\nEdgeworth:\nWe see. Continue.White:\nSurprised, I turned to look at the building across the way.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo you were reading your papers until you heard that sound?\nWhite:\nBut of course. I am no snoop, peeping out of windows at night.\nPhoenix:\n(No snoop? Yeah, right! You've made a career out of snooping!)White:\nIt was then I saw him: a spiky-haired man attacking a woman with long hair!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nS-spiky-haired!?White:\nNeedless to say that man was none other than you, Mr. Lawyer!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat you just said directly conflicts with Miss May's testimony! Miss May clearly stated that the assailant looked like a \"girl\"!\nWhite:\nI've always been proud of my eyesight, Mr. Lawyer.\nPhoenix:\nJust what is your eyesight?\nWhite:\nCounting both eyes... 40!\nPhoenix:\n40!? Don't add them together!\nJudge:\nI think the witness is trying to say his eyesight is good.\nPhoenix:\n(Hey, whose side is the judge on, anyway?)\nEdgeworth:\nAnd what did you do then?White:\nI called Miss May over at once. She, too, was surprised of course.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat was Miss May doing at that time?\nWhite:\nShe had just finished watching a soap opera on the TV, and was weeping openly.\nPhoenix:\nDid you know she had been tapping the Fey office phone?\nEdgeworth:\n\nEdgeworth:\nIrrelevant! That has nothing to do with the case at hand.\nWhite:\nI care not. I will answer the lawyer's bold inquiry. Miss May was acting alone when she tapped the phone of this Fey woman.\nPhoenix:\nYou'd make a good politician, Mr. White.\nWhite:\nHo hoh! After all, I am \"El Presidente.\"\nJudge:\nPlease continue.White:\nThe victim, she... she ran away, but you gave chase!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nCan you be a little more detailed about that? I think it's worth knowing exactly what happened.\nWhite:\nOf course! Comprende! I understand! The victim was attacked, by you, and ran to the left. You gave chase, and struck her down!\nEdgeworth:\nAre you sure?\nWhite:\nAs you know, I am always abso-posi-lutely perfect!\nJudge:\nPerhaps you could change your testimony to reflect this new detail.\nChanges statement from \"The victim, she... she ran away, but you gave chase!\" to \"The victim ran to the left, and you gave chase!\"White:\nThe victim ran to the left, and you gave chase!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAre you sure about that?\nWhite:\nHow many times must I say it? I am abso-posi-lutely perfect! End of story!\nPhoenix:\n(How many times must I hear that?)\nMaya:\nPsst! Phoenix! Doesn't something about that strike you as a little odd?Present May Testimony\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Wait right there!\"White:\nFinally there was a terrible impaction! Then it was all over...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nUm... \"impaction\"? Don't you mean just \"impact\"?\nWhite:\nRidiculosity! I think you need to brush up on your language skills!\nPhoenix:\n(On second thought, perhaps I'd better leave the whole language thing alone...)Phoenix:\n(Did Edgeworth \"prep\" this guy, too, I wonder? Anyway, I'd better find a weakness in there...)Phoenix:\nWait right there! Mr. White, you've dug your own grave!White:\nWhat is this!?Phoenix:\nYou said the victim ran to the \"left.\" But that directly contradicts Miss May's testimony! She clearly stated that the victim ran \"right\"!White:\n...! Oh hoh hoh. It is simple. You have misheard her.Phoenix:\nI think not. Look at the floor plans... The killer was here. And the victim, here. If the victim ran to the left, as you claim she did... She would have been running directly away from the door! She would have been running into a dead end! Don't you find that odd?White:\n! Very strange... I did see her run to the left... I did.Maya:\nPhoenix... look at his face. I don't think he's lying about this one.Phoenix:\nTrue. (Maybe he really did see the victim run left...? So he did witness the killing...? Wait a second!)Judge:\nMr. Wright?Phoenix:\nYes, Your Honor?Judge:\nMiss May says \"right,\" and Mr. White says \"left.\" Can you explain this contradiction to the court?Mr. White is right\n\n\n\n\n\n\n\nPhoenix:\nAs Mr. White testified, Mia ran to the left.\nJudge:\nBut... But if that's the case... Why would she run in the opposite direction from the door?\nPhoenix:\nShe did not. She was running towards the door, Your Honor.\nEdgeworth:\nBwah! Now you're the one making a contradiction, Mr. Wright!\nPhoenix:\nNot at all.\nLeads to:\n\"Obviously, the witness was not viewing the crime from the hotel!\"Miss May is right\n\n\n\n\n\n\n\nPhoenix:\nAs Miss May has stated, Mia ran to the right after she was attacked.\nWhite:\nWhat is this? I am not fashioning fabrications, I assure you! That lady ran to the left! I am sure of it!\nPhoenix:\nThen there can be only one explanation.\nEdgeworth:\nEh...? And that is?\nLeads to:\n\"Obviously, the witness was not viewing the crime from the hotel!\"Both are right\n\n\n\n\n\n\n\nPhoenix:\nBoth witnesses are telling the truth. (For once...)\nEdgeworth:\nHah! I doubt it! Er, rather, that does not clear up the contradiction!\nPhoenix:\nThere is one scenario that would explain their conflicting accounts.\nEdgeworth:\nWhat!?\nLeads to:\n\"Obviously, the witness was not viewing the crime from the hotel!\"Phoenix:\nObviously, the witness was not viewing the crime from the hotel!Judge:\nMr. Wright! What do you mean?Edgeworth:\nYes, what do you mean, he was not \"viewing the crime from the hotel\"!? If he was not in the hotel, where could he have been!?Phoenix:\nIn the law offices of Fey & Co., of course! More specifically, he was standing here! (Time to show the court where Mr. White was standing!) (Changed from [Show the court where Mr. White was standing!] in the original release)Present killer's location\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"This is where he was!\"Present victim's location\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThat's where he was!\nEdgeworth:\nM-Mr. Wright! We are not fools! How could he have been exactly where the victim was standing!?\nPhoenix:\n(Oh... oh, right!)\nJudge:\nMr. Wright! What is the meaning of this!?\nPhoenix:\nSorry, Your Honor! Sorry! Let me try that again...\nLeads back to:\n\"Time to the court where Mr. White was standing!\"Present anywhere else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThat's where he was!\nJudge:\nHold it right there, Mr. Wright! If he was there during the very act of murder... That would make him an accomplice!\nEdgeworth:\n\nEdgeworth:\nImpossible! There was no one other than the criminal and victim in the room! There is no evidence, no proof to the contrary! None!\nPhoenix:\nS-sorry! Er... let me try that again!\nLeads back to:\n\"Time to show the court where Mr. White was standing!\"Phoenix:\nThis is where he was! Look! When the victim ran for the door... If he was watching from this point, to him it would appear that she ran to the \"left.\"Edgeworth:\nPlease! This is no time for jokes in ill taste! That is where the killer was standing!Judge:\nOrder! I will have order! Anyone disturbing the order of this courtroom will be held in contempt! Mr. Wright! What are you suggesting!?White:\nR-r-rapscallion!!!Edgeworth:Edgeworth:\nThe postulations of the defense are a distortion of the truth, Your Honor!Judge:\nIndeed. They do seem a bit far-fetched...White:\n... Ho hoh hoh! You provide us with so much entertainment, Mr. Lawyer!Phoenix:\n(What now!? He's... laughing!?)White:\nThe hilarity of the moment made me remember something... It appears I have been unclear, and for this, I apologize. Mr. Your Honor... Might I be allowed to testify once more?Judge:\nVery well, let's hear your revised testimony.Phoenix:\n(Good luck. You can't fix a broken testimony, buddy!)Witness Testimony-- She Ran to the \"Left\" --White:\nMiss May's testimony was correct... as was mine!\nWhen you assaulted the girl, she first ran to the left.\nAnd then you hit her, savagely! That is what I saw.\nNext, with the last of her strength, she ran to the right.\nYou chased her, and delivered the final blow.\nThat is what Miss May saw.\nYou see? You hit her twice!\nDon't you remember, Mr. Lawyer?Judge:\nHmm... That does seem to make sense. Will you be cross-examining the witness's testimony?Phoenix:\nYou bet I will! I mean, yes, Your Honor.Cross Examination",
      "testimonies": [
        {
          "testimony": "Miss May's testimony was correct... as was mine!",
          "person": "White",
          "present": []
        },
        {
          "testimony": "When you assaulted the girl, she first ran to the left.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "And then you hit her, savagely! That is what I saw.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "Next, with the last of her strength, she ran to the right.",
          "person": "White",
          "present": [
            "Mia's Autopsy Report"
          ],
          "source": {
            "evidence_span": "Cause: single blunt force trauma.",
            "testimony_span": "with the last of her strength, she ran to the right",
            "explanation": "The victim was only hit once, not two.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "easy"
          }
        },
        {
          "testimony": "You chased her, and delivered the final blow.",
          "person": "White",
          "present": [
            "Mia's Autopsy Report"
          ],
          "source": {
            "evidence_span": "Cause: single blunt force trauma.",
            "testimony_span": "delivered the final blow.",
            "explanation": "The victim was only hit once, not two.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "easy"
          }
        },
        {
          "testimony": "That is what Miss May saw.",
          "person": "White",
          "present": [
            "Mia's Autopsy Report"
          ],
          "source": {
            "evidence_span": "Cause: single blunt force trauma.",
            "testimony_span": "N/A",
            "explanation": "The victim was only hit once, not two.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "easy"
          }
        },
        {
          "testimony": "You see? You hit her twice!",
          "person": "White",
          "present": [
            "Mia's Autopsy Report"
          ],
          "source": {
            "evidence_span": "Cause: single blunt force trauma.",
            "testimony_span": "You hit her twice!",
            "explanation": "The victim was only hit once, not two.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "easy"
          }
        }
      ],
      "noPresent": false,
      "difficulty": "easy",
      "labels": [
        "numerical"
      ],
      "reasoning": [
        "Fact 1: The witness claims the victim was hit twice.",
        "Fact 2: The evidence suggests the victim was hit once."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- She Ran to the \"Left\" --White:\nMiss May's testimony was correct... as was mine!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat do you mean by that!\nWhite:\nThat is what I am about to explain! You Americans, always so impatient! It does not become you.\nPhoenix:\n(Hey buddy, you're an American, too!)White:\nWhen you assaulted the girl, she first ran to the left.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat do you mean \"first\"?\nWhite:\n\"First\"? That is what comes before what happens \"next.\" You do speak English, right? Please, sit back, relax. I will try to use simple words for your benefit. First, she ran to the left, and then...White:\nAnd then you hit her, savagely! That is what I saw.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nI didn't hit anyone!\nWhite:\nNow, now, Mr. Wright. There is no point hiding things from this court.\nPhoenix:\nI'm not hiding anything!\nEdgeworth:\n\nEdgeworth:\nThe prosecution requests that the defense refrain from interrupting the testimony!\nJudge:\nMr. Wright, you have been warned.\nPhoenix:\n(Why's he mad at me!?)White:\nNext, with the last of her strength, she ran to the right.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat do you mean \"next\"!?\nWhite:\n\"Next\" is what comes after \"first.\"\nPhoenix:\nI know that!\nWhite:\nThen that is all you need to know, Mr. Lawyer. As I said, she turned and made a desperate dash to the right.Present Mia's Autopsy Report\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Mr. White!\"White:\nYou chased her, and delivered the final blow.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nStop saying it was me!\nWhite:\nBut, it was you.\nEdgeworth:\n\nEdgeworth:\nMr. Wright! If you claim that it was NOT you, then show us proof!\nPhoenix:\n(Argh! Can I do nothing right? Nothing!?)\nWhite:\nMay I continue?Present Mia's Autopsy Report\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Mr. White!\"White:\nThat is what Miss May saw.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo each of you saw different parts...?\nWhite:\nAbso-posi-lutely! That's right, of course!\nPhoenix:\n(Where did he pick up that annoying phrase...?)\nWhite:\nAnyway, moving along!Present Mia's Autopsy Report\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Mr. White!\"White:\nYou see? You hit her twice!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo were you watching both times?\nWhite:\nI suppose I was. And please excuse me for not testifying to this sooner!Present Mia's Autopsy Report\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Mr. White!\"Maya:\nWhat do you think Phoenix?Phoenix:\nI think we've got him right where we want him! He slipped! Let him laugh for now. I'll soon wipe that smile off his face!Phoenix:\nMr. White! The victim died from a single blow! ([single] was in quotation marks in the original release)White:\n...!Phoenix:\nWhat do you have to say to that?White:\nEr... Erp!Phoenix:\n(Now's my chance to hit him where it counts!) Mr. White. Wasn't it you who told this court you were \"abso-posi-lutely perfect\"?White:\nMmph. I will refrain from using this phrase from now on.Phoenix:\nYour Honor, if you could ask the witness for a new testimony...Edgeworth:Edgeworth:\nThe witness is obviously confused, Your Honor! I would like to request a 10 minute break!Judge:\nYes... yes, quite.Phoenix:Phoenix:\nThe witness is confused because he's lying! I emphatically request that there be no break, Your Honor!(Yeah! We want justice...!)\n(Don't let him get away!)Judge:\nVery well. If the witness would care to revise his testimony...Phoenix:\n(The crowd's on my side! No slipping out of this now, White!)Judge:\nMr. White?White:\nO... okay...Witness Testimony-- The Two Accounts --White:\nUmm, well, see--I looked at the other window when I heard that thing fall.\nThen, the next moment, I saw Miss Mia run to the left!\nThe killer, you, attacked her... but she dodged.\nUmm... and then...\nShe turned, and ran for the door!\nThen you did her in with a single blow! Thwap!Judge:\nHmm. \"Thwap\" indeed. Very well, you may begin the cross-examination.White:\nMr. Your Honor... My stomach, you see, it is hurting...Phoenix:\nDeal with it. This is almost over.White:\n...!Cross Examination",
      "testimonies": [
        {
          "testimony": "Umm, well, see--I looked at the other window when I heard that thing fall.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "A light stand was lying on the floor when I looked.",
          "person": "White",
          "present": [
            "Glass Shards",
            "Floor Plans"
          ],
          "source": {
            "evidence_span": "The stand is blocked from view looking from the office.",
            "testimony_span": "A light stand was lying on the floor when I looked.",
            "explanation": "The witness could not have seen the light stand, viewing from the office.",
            "is_self_contained": "no",
            "context_span": "If he was not in the hotel, where could he have been!?Phoenix:\nIn the law offices of Fey & Co., of course!",
            "difficulty": "easy"
          }
        },
        {
          "testimony": "Then, the next moment, I saw Miss Mia run to the left!",
          "person": "White",
          "present": []
        },
        {
          "testimony": "The killer, you, attacked her... but she dodged.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "She turned, and ran for the door!",
          "person": "White",
          "present": []
        },
        {
          "testimony": "Then you did her in with a single blow! Thwap!",
          "person": "White",
          "present": []
        }
      ],
      "noPresent": false,
      "difficulty": "easy",
      "labels": [
        "spatial",
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims he saw a lightstand.",
        "Fact 2: The evidence suggests the lightstand is blocked from view from the office.",
        "Fact 3: The context suggests the witness was in the office.",
        "Prop 1: If something is blocked from view, it cannot be seen."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Two Accounts --White:\nUmm, well, see--I looked at the other window when I heard that thing fall.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou heard \"that thing fall\"? What exactly was \"that thing\"?\nWhite:\nHuh? Oh... oh, that? Umm... the glass light stand!\nPhoenix:\n(Right... the one that had fallen over at the scene.)\nMaya:\nPhoenix! Doesn't something about that strike you as odd?\n\n\n\nYeah, very odd\n\n\n\n\n\n\n\nPhoenix:\n(Yeah, that is odd. I'll press further.) Mr. White.\nWhite:\nHuh? W-what?\nPhoenix:\nYou're saying you saw the glass light stand?\nWhite:\nY-yes.\nPhoenix:\nThen change your testimony to reflect that!\nWhite:\nS-sorry. My bad...\nJudge:\nThe witness will revise his testimony.\nWhite:\nOkay okay. Of course.\nChanges statement from \"Umm, well, see--I looked at the other window when I heard that thing fall.\" to \"A light stand was lying on the floor when I looked.\"\n\n\n\n\nNope\n\n\n\n\n\n\n\nPhoenix:\nHuh? No, not really. Please continue your cross-examination.\nLeads back to cross-examinationWhite:\nA light stand was lying on the floor when I looked.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe \"glass stand was lying on the floor\"? That's the first I've heard of this. Why didn't you tell us about the stand before?\nWhite:\nW-why? Me? W-well... I was instructed not to... wait! One moment! Give me a minute to gather my thoughts. I am so... so confused.\nPhoenix:\n(White's falling apart.)\nEdgeworth:\n\nEdgeworth:\nYour Honor! Please, I ask that you do not allow the witness to be badgered any further!\nJudge:\nM-Mr. Wright. Please refrain from badgering the witness...\nPhoenix:\nYes, Your Honor. (Edgeworth is on the ropes!)\nJudge:\nVery well. The witness may continue his account.Present Glass Shards\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nMr. White. It was impossible for you to have seen the light stand!\nWhite:\nWhaaaat!?\nPhoenix:\nThe stand broke into pieces when it fell!\nWhite:\nOoof!\nPhoenix:\nJust by seeing the broken pieces you would have no idea it was a light stand! So tell me, exactly when was it that you saw the stand? Answer the question!\nWhite:\n...! I-isn't it obvious? I saw the stand before it fell over!\nPhoenix:\nSo... you saw the stand before the victim was attacked, then?\nWhite:\nC-correct! That would be no problemo, right?\nPhoenix:\n(Hmm...)\n\n\n\nNo problemo\n\n\n\n\n\n\n\nPhoenix:\nRight. I guess there isn't a problem.\nJudge:\nVery well. Now...\nMaya:\nPh-Phoenix! Wait!\nPhoenix:\nHuh? What?\nMaya:\nHe saw the stand through the office window before it fell over... That's what he's saying, right?\nPhoenix:\nYeah, I guess so.\nMaya:\nHow could that be possible?\nPhoenix:\nHuh...? Why not?\nMaya:\nThere's no way he could have seen it! And you have proof!\nPhoenix:\n... Oh!\nJudge:\nSomething wrong, Mr. Wright?\nPhoenix:\nSorry, Your Honor! I guess there is a problemo, er, I mean, a problem.\nJudge:\nI see. Please try to think before you speak, Mr. Wright.\nPhoenix:\nSorry, Your Honor. But, I have proof!\nLeads to:\n\"A person in the hotel could not have seen the stand before it fell over!\"\n\n\n\n\nBig problemo\n\n\n\n\n\n\n\nPhoenix:\nThere's a big problemo, er, I mean problem here.\nWhite:\nWhat problem is this?\nPhoenix:\nMr. White, let me make sure I have this straight... You saw the glass light stand through the window, from the hotel... before the incident occurred?\nWhite:\nCorrect! That is so! It's conclusive, definitive, undeniable... unimpeachable!\nPhoenix:\nNo, it's impossible! You couldn't have seen the stand!\nJudge:\nWhat? Why couldn't he? You have proof?\nPhoenix:\nI sure do, Your Honor!\nLeads to:\n\"A person in the hotel could not have seen the stand before it fell over!\"\n\n\nPhoenix:\nA person in the hotel could not have seen the stand before it fell over!\n\n\n\nPresent Floor Plans\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Look at this!\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThis is the proof! ...\nJudge:\nSomething the matter?\nPhoenix:\nN-no... it's just...\nMaya:\nPhoenix... I don't think that's what you meant.\nPhoenix:\n(I don't think so either.)\nJudge:\nMr. Wright. The courtroom is no place to play practical jokes.\nPhoenix:\nI'm sorry, Your Honor. Let me try that again.\nLeads back to:\n\"A person in the hotel could not have seen the stand before it fell over!\"Present Floor Plans\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nMr. White. It was impossible for you to have seen the glass stand!\nWhite:\nWhaaaat!?\nLeads to:\n\"Look at this!\"White:\nThen, the next moment, I saw Miss Mia run to the left!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n\"Miss Mia\"...? Mr. White, did you know the victim personally?\nWhite:\nNo no no, triple no! How would I? How could I!\nEdgeworth:\n\nEdgeworth:\nI see nothing odd about the witness knowing the name of the victim. Mr. Wright! I will not have you harrying the witness!\nPhoenix:\n(You're looking a little flustered, Edgeworth!)White:\nThe killer, you, attacked her... but she dodged.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nNow before, you said that she was hit before she ran.\nWhite:\nY-yes, I must have been confused. But don't worry! We all know what happened now.White:\nShe turned, and ran for the door!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat did you do then?\nWhite:\nI gave chase, of course! ...! No! No! Not me. Th-the killer, I mean! He gave chase!\nEdgeworth:\n\nEdgeworth:\nMr. White, please try to remain calm. Mr. Wright here is only trying to fluster you with baseless accusations!\nWhite:\nOh... oh right. Thank you, Miles.White:\nThen you did her in with a single blow! Thwap!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n\"Thwap\"...? That doesn't sound like the \"savage\" attack from your earlier testimony...\nWhite:\nHo! Hoh hoh! Yes, well, I am a man of peace, you see.Maya:\nPhoenix! He's getting a lot less talkative.Phoenix:\nHe's probably afraid I'll catch him on something! (But it won't be easy!)Phoenix:\nLook at this!Judge:\nThese are the floor plans to the scene of the murder, yes?Phoenix:\nCorrect, Your Honor. Now, look... If you were to look through the window at the office... This is the area you would be able to see! Here! Well...? Note that the stand is not within the visible area! Well, Mr. White! What do you have to say to that!?White:\nEr... erp! Ri... dicu... losity...Phoenix:\nMr. White. If you were in the Gatewater hotel as you claim, you could not have seen the stand before it fell over! In fact, you wouldn't have been able to see it after it fell, either! There's no way you could have recognized the broken shards as a glass light stand! So, when did you see the stand, Mr. White? It must have been the moment that it fell! And the only place you could have seen that from... is inside the Fey Law Offices! In other words, you were at the scene of the crime, when the murder took place!White:\nGaaaaaaaaaaaaaaaaaaaaa!!Judge:\nMr... White?White:\n...Phoenix:\nMr. White.White:\n...Phoenix:\nYou did it, didn't you?White:\n... Mr. Your Honor. I... I... Miss Mia... ...Phoenix:\n(Heh. Looks like we're about to get our verdict!)Edgeworth:Edgeworth:\nThat's far enough, Phoenix Wright!Phoenix:\nW-what!? (Urk! I forgot about Edgeworth!)Edgeworth:\nMr. White...White:\n...Edgeworth:\nI think the time has come. Shouldn't you confess your crime now, hmm?White:\nW... what?Edgeworth:\nI said, you should confess your crime. Ergo, confess that you placed the wiretap!Phoenix:\nThe w-wiretap!?Judge:\nOrder! Order! Mr. Edgeworth! Explain to the court what you mean by this!Edgeworth:\nDistinguished members of of the court... Mr. White is slightly confused. Allow me to explain.Phoenix:\n(I really don't like the way this is headed...)Edgeworth:\nAs you know, Mr. White is the CEO of Bluecorp. He ordered his secretary, Miss April May, to tap the law offices of Ms. Fey.Judge:\nWhat does that have to do...?Edgeworth:\nYour Honor. The question is: when was the wiretap placed in the office, and by who?Phoenix:\nNo! You wouldn't!Edgeworth:\nMr. White. In order to place the wiretap, you entered Ms. Fey's office. Am I correct...?White:\n... ! C-correct! You are most correct, Miles!Phoenix:\nGive me a break!White:\nYes... in order to place the wiretap, I breached the Fey & Co. Law Offices! That is when I saw that accursed light stand!Judge:\nNow I'm confused. Please explain to the court what all this means, Mr. Edgeworth!Edgeworth:\nGladly, Your Honor. Mr. Phoenix Wright has made his position quite clear. He has determined that Mr. White knew the glass stand was in the office. He has shown that there was only one time Mr. White could have seen the stand: at the very moment of the murder! ([at] was capitalized in the original release) Thus, Mr. Wright would like you to believe that Mr. White was the murderer!Judge:\nI see.Edgeworth:\nHowever! It is a fact that Mr. White had been to that office well before the murder took place! When he went to place the wiretap! (Changed from [He went to place the wiretap!] in the original release) He could have seen the glass light stand then. Ergo, Mr. Phoenix Wright's theory is revealed for the baseless conjecture it is!Judge:\nMr. White! You will testify to the court about this wiretapping! (Changed from [You will testify to the court about this wiretap!] in the original release)White:\nAhem. Leave it to me!Phoenix:\n(I... I feel faint.)Witness Testimony-- The Wiretapping --White:\nIt was the beginning of September... the week before the murder.\nI had entered the Fey & Co. Law Offices.\nOf course, I had done so to place the wiretap.\nThat is when I saw this glass light stand.Judge:\nHmm... So, you saw the stand before the night of the incident... And this is how you were able to identify what had fallen over. By the sound?White:\nCorrect! That is right.Judge:\nI see. Very well, Mr. Wright, you may cross-examine.Phoenix:\n(Gah! What am I supposed to do now...!?)Maya:\nGood luck, Phoenix...Cross Examination",
      "testimonies": [
        {
          "testimony": "It was the beginning of September... the week before the murder.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "I had entered the Fey & Co. Law Offices.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "Of course, I had done so to place the wiretap.",
          "person": "White",
          "present": []
        },
        {
          "testimony": "That is when I saw this glass light stand.",
          "person": "White",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Wiretapping --White:\nIt was the beginning of September... the week before the murder.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nD-do you have proof!?\nEdgeworth:\n\nEdgeworth:\nMiss April May knew the details of Ms. Fey's phone conversation! This proves that the wiretap was placed before the murder!\nPhoenix:\nHuh... right.White:\nI had entered the Fey & Co. Law Offices.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas it really you that went into the office? Or was it Miss May?\nEdgeworth:\n\nEdgeworth:\nUnidentified fingerprints several days old were found in the Fey & Co. Law Offices. Those were obviously Mr. White's.\nPhoenix:\n(And if I know Edgeworth, he's already run a check on those prints...)\nEdgeworth:\nNow, Mr. White. Tell us why you went to the Fey & Co. Law Offices.White:\nOf course, I had done so to place the wiretap.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhy did you tap Mia's phone!?\nEdgeworth:\n\nEdgeworth:\nThat has no bearing on the current case, Your Honor.\nWhite:\nBluecorp is a detective agency of sorts. We have a responsibility to protect client confidentiality!White:\nThat is when I saw this glass light stand.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhy did you notice something as innocuous as a light stand!?\nWhite:\nThe light stand was made entirely out of glass. It was quite stylish, so I guess it made a lasting impression on me. Such a beautacious thing deserves attention, does it not? That is all.Phoenix:\n(Dammit! There's nothing there for me to press him on! Oh well... maybe he's rattled enough that I can bluff something out of him!)After pressing first, second, and fourth statements, then pressing third statement:Phoenix:\n(Uh oh! Don't tell me I've run out of ammo!)Edgeworth:\nTsk tsk. I'm afraid that's as far as you go, Mr. Wright. The time has come for you to admit your defeat! You fought... honorably.Phoenix:\n(No more... I can't take this anymore...)Judge:\nMr. Wright? Are you giving up?Phoenix:\n... Y-yes, Your Honor.???:(Phoenix!)Phoenix:\n...????:(Phoenix! Over here!)Phoenix:\n(I know that voice! ... M-Mia!?)Mia:\nNever give up, Phoenix!Phoenix:\n...!!!! M-M-Mia...!Phoenix:\nWhere... Where am I? The waiting lobby...? What happened? ... Oh, right... I lost the trial. I was... hallucinating. ...Mia:\nAh, you're finally awake.Phoenix:\nGak!Mia:\nH-hey! Phoenix! ... \"Gak\"? That's no way to greet an old friend! Phoenix, I want you to look at me.Phoenix:\nY-You're... M-Maya...?Mia:\nDidn't you know the Fey women have strong psychic powers...? When you accepted your defeat in court... It appears that was enough of a shock to awaken Maya's true powers.Phoenix:\nSo... Maya is channeling you, Mia?Mia:\nThat's right. I am Maya, but I'm also Mia. Now, I want you to listen to me, Phoenix. Maya never gave up. You can't either! That's what I came here to tell you.Phoenix:\n...! B-but!Mia:\nWe don't have much time, Phoenix. Now listen. You've already won.Phoenix:\nHuh...?Mia:\nYou have that Receipt in the court record, right?Phoenix:\nUm... oh, yeah! The one you wrote \"Maya\" on...?Mia:\nPhoenix! White wrote that, not me!Phoenix:\nSo... so what do I do with it?Mia:\nLook at the front of the receipt!Phoenix:\nThe... front? (It's a regular receipt... Looks like it's from a famous department store. \"$1,000.00\"... Wow, big spender! ([Wow] lowercase in the original release) \"Item\"... \"glass light stand\"...! \"Date of purchase\"... \"September 4\"...) ...! September 4!Mia:\nThat's right, Phoenix. I bought that stand the day before I was killed!Phoenix:\nWhoa!Mia:\nNow, what did Mr. White say in his testimony?White:\nIt was the beginning of September... the week before the murder.Phoenix:\nHe said he saw the stand the week before the murder!Mia:\nThere you go! I think the court is about to reconvene! Go do it, Phoenix! You know you're innocent, now you just have to prove it!Phoenix:\nRight!Receipt updated in the Court Record.September 9, 1:16 PMDistrict CourtCourtroom No. 1Judge:\nThe court will now reconvene for the trial of Mr. Phoenix Wright. Is the defendant... rather, are you alright, Mr. Wright?Phoenix:\nYes. Sorry, Your Honor. I'm fine now.Judge:\nThen, let's start where we left off.Edgeworth:\nYour Honor. There is nothing to go back to! The cross-examination of Mr. White is finished! All that is required now is for you to pass judgment on the defendant Phoenix Wright!Judge:\nHmm...Phoenix:\nYour Honor! Please, give me one more chance. I promise you, this is the last time I'll ask you!Judge:\nHmm... But, as Mr. Edgeworth has noted, the trial is more or less finished. Mr. Edgeworth, do you have an opinion on this matter?Edgeworth:\nI say... let us give Mr. Phoenix Wright his \"last chance.\"Judge:\nVery well! You may begin your cross-examination.Cross Examination",
      "testimonies": [
        {
          "testimony": "It was the beginning of September... the week before the murder.",
          "person": "White",
          "present": [
            "Receipt"
          ],
          "source": {
            "evidence_span": "The date of purchase is the day before the murder.",
            "testimony_span": "the week before the murder",
            "explanation": "The date of purchase remembered by the witness contradicts the date indicated by the receipt.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "easy"
          }
        },
        {
          "testimony": "I had entered the Fey & Co. Law Offices.",
          "person": "White",
          "present": [
            "Receipt"
          ],
          "source": {
            "evidence_span": "The date of purchase is the day before the murder.",
            "testimony_span": "N/A",
            "explanation": "The date of purchase remembered by the witness contradicts the date indicated by the receipt.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "easy"
          }
        },
        {
          "testimony": "Of course, I had done so to place the wiretap.",
          "person": "White",
          "present": [
            "Receipt"
          ],
          "source": {
            "evidence_span": "The date of purchase is the day before the murder.",
            "testimony_span": "N/A",
            "explanation": "The date of purchase remembered by the witness contradicts the date indicated by the receipt.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "easy"
          }
        },
        {
          "testimony": "That is when I saw this glass light stand.",
          "person": "White",
          "present": [
            "Receipt"
          ],
          "source": {
            "evidence_span": "The date of purchase is the day before the murder.",
            "testimony_span": "N/A",
            "explanation": "The date of purchase remembered by the witness contradicts the date indicated by the receipt.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "easy"
          }
        }
      ],
      "noPresent": false,
      "difficulty": "easy",
      "labels": [
        "temporal",
        "numerical"
      ],
      "reasoning": [
        "Fact 1: The witness claims he saw the lightstand a week before the murder.",
        "Fact 2: The evidence suggests the lightstand was bought one day before the murder.",
        "Prop 1: The time to buy something must precede the time that something can be seen."
      ]
    }
  ]
}