{
  "previousContext": "Episode 4Turnabout Goodbyes\nIt's been, what, 15 years?\nAbout that, yes.\n15 years is a long time to wait... You can't imagine how much I've suffered...\nYou... suffered?\nAnd now... the perfect opportunity presents itself. At last... I shall have my revenge!\nWhat!?\n...Merry Christmas.\nDecember 25, 10:08 AMWright & Co. Law Offices\nMaya:\nHey, hey, Nick! Do you know if there's any good waterfalls around here?\nPhoenix:\nWaterfalls...? Dare I ask why?\nMaya:\nDuh, Nick! Isn't it obvious? I need a waterfall to stand under! Preferably a freezing one!\nPhoenix:\n... Oh... Is that part of your spirit medium training?\nMaya:\nOf course! Except, I've been slacking off lately... I need to brave the elements and be forged anew under the rushing spring waters!\nPhoenix:\nUmm... Okay... I don't know about any falls per se, but Gourd Lake is pretty close...\nMaya:\nOh. Darn.\nPhoenix:\nSorry, but them's the breaks. Couldn't you just take a cold shower or something?\nMaya:\n... Good idea!\nPhoenix:\n(So much for the rushing spring waters...)\nTV:\nNext in the news... A large, unidentified animal was sighted at Gourd Lake! The town is buzzing with excitement! Locals are calling it \"Gourdy\" in a tip of the hat to Nessie, the Loch Ness monster. Though its namesake, Nessie, proved to be a hoax... locals are confident their Gourdy is the real deal. ...\nPhoenix:\n*yawn* Bor-ing. Can't they show real news for a change?\nMaya:\nNick?\nPhoenix:\n?\nMaya:\nThe water pressure's kind of low in that shower.\nPhoenix:\n... You want more pressure, huh? Why don't you go down to the fire department and have them spray you with the hose?\nMaya:\n... Good idea, Nick!\nPhoenix:\n(Apparently, Fey blood is no aid in detecting sarcasm...) (Changed from [Apparently, E.S.P. is no aid in detecting sarcasm...] in the original release)\nTV:\nWe interrupt this program to bring you a special news bulletin! Strange occurrences continue at Gourd Lake... But this time, it's murder!\nPhoenix:\n(Gourd Lake again?)\nTV:\nThe body of a man was found in the lake early this morning. A suspect was apprehended. Sources inside the police department revealed... that the suspect's name is Miles Edgeworth, age 24. Edgeworth was an up-and-coming prosecution attorney, known for his skill and connections. He was guaranteed a long and rewarding career... Has he thrown it all away?\nPhoenix:\n(...? E-Edgeworth!?) What's going on!? Edgeworth would never do something like--\nMaya:\nNick?\nPhoenix:\nYipes! M-Maya!\nMaya:\nThe fireman yelled at me when I called him.\nPhoenix:\nWe've got bigger things to worry about than that! They arrested Edgeworth!\nMaya:\nWhat? You mean, the prosecutor?\nPhoenix:\nYeah, he's a suspect... in a murder!\nMaya:\nWhaaaaat!? When? Where? Whom? Why? How?\nPhoenix:\nI-I don't know!\nMaya:\nLet's go find out, Nick!\nDecember 25Detention CenterVisitor's Room\nMaya:\nYou know, Nick... We've all been in here one time or another, haven't we?\nPhoenix:\nI guess it comes with the territory.\nMaya:\nI'm not sure it's something we should mention to too many people... Aah!\nPhoenix:\n... Hey! Edgeworth! Come back!\nEdgeworth:\nWhat are you doing here!?\nMaya:\nNick, I don't think he's in a very good mood.\nPhoenix:\nWell, he is in detention. Were you in a good mood when you were here?\nEdgeworth:\nSo, you've come to laugh at the fallen attorney? Then laugh, laugh! Well? Why aren't you laughing?\nMaya:\nNick... Should we be laughing?\nPhoenix:\nNah. It's a trick. Laugh and he'll get mad... or burst into tears. Edgeworth. We don't have so much free time we can spend it coming down here to laugh at you.\nEdgeworth:\n... Yes you do.\nPhoenix:\n(Actually, he's right.)\nEdgeworth:\n... I hoped you wouldn't come. I didn't want you to see me. Not like this.\nPhoenix:\n(I didn't want to see you like this, either. Believe me.) (Changed from [Hey, I didn't want to see you either, believe me.] in the original release)\nDecember 25Gourd Lake ParkEntrance\nMaya:\nThis is where it happened?\nPhoenix:\nYeah. Gourd Lake is in the middle of this park.\nMaya:\nI can see some police walking around in there.\nPhoenix:\nQuestioning people, probably.\nMaya:\nHey! Isn't that Detective Gumshoe over there?\nGumshoe:\nWell, pal!? There's enough of us here! Anyone found anything?\nPolice:\nS-sorry, sir... Nothing.\nGumshoe:\nIdiot! The trial's tomorrow! We need clues, on the double!\nPolice:\nB-but, sir... There weren't any clues... that's why we arrested that attorney, Mr. Edgeworth! It's clear, sir. He's the one who--\nGumshoe:\nShaddup! Just you try saying that again! I'll... I'll... I'll make you sorry if you do! (Changed from [I'll... er... I'll make you sorry if you do!] in the original release) So just... just, get outta my face, pal! (Changed from [I mean... just, get outta my face, pal!] in the original release)\nPolice:\nY-yes, sir!\nMaya:\nDetective Gumshoe's kinda scary today!\nGumshoe:\nRecruits... peh! ... Aah!\nMaya:\nEek!\nGumshoe:\nHey, you're that Harry guy! Harry Butz!\nPhoenix:\nWright! Phoenix Wright! (Will he ever learn my name!?)\nGumshoe:\nAnd just what are you doing here, pal? Investigating!?\nPhoenix:\nHuh? Um, well, yes. I suppose.\nGumshoe:\nWell, I'm here to help! Ask me anything you want! Bring it!\nMaya:\nHe seems different than usual. I wonder what's up? Umm... Mr. Edgeworth hasn't actually asked us to defend him yet...\nGumshoe:\nHuh!? Oh? Y-you don't say...\nAfter clearing all Talk options:\nPolice:\nDetective Gumshoe, sir!\nGumshoe:\nWhat? Find something!?\nPolice:\nUm, no, sir. Not yet. But there was a call from the precinct. They want to hold an investigation briefing...\nGumshoe:\nA briefing? Right! I'm off! Oh... Sorry, pal. I guess you heard. I gotta go. Any last things you want to ask me about before I head back?\nPhoenix:\nYou're not coming back, Detective?\nGumshoe:\nErm... Probably not, pal.\nPhoenix:\nSo, what should we do if we have something to talk to you about...?\nGumshoe:\nAh, right. Here, I'll show you how to get to the precinct. Come down and see me anytime.\nDetective Gumshoe gave you directions to the police station.\nPhoenix:\nOh, hey! Detective Gumshoe!\nGumshoe:\nW-what!?\nPhoenix:\nUm, we'd like to take a look around in the park. Can we walk around?\nGumshoe:\nYeah! No problem, pal. You got my permission.\nMaya:\nYou know, Nick. I think there's something to be said for talking to people when they're busy.\nPhoenix:\nYeah. They don't have time to think about not giving you information...\nMaya:\nRight! Now, let's get investigating!\nDecember 25Police DepartmentCriminal Affairs\nMaya:\n... Looks like Detective Gumshoe isn't here.\nChief:\nSomething wrong, miss? Hmm? Turning yourself in? Okay, what did you do? Shoplifting? Larceny? Public indecency...?\nMaya:\nN-no! None of those things! We're looking for Detective Gumshoe... is he around?\nChief:\nGumshoe? Oh yeah. He's in a meeting right now. I don't think he'll be out any time soon.\nMaya:\nOkay, we'll come back.\nChief:\nYou do that. Oh, and go straight home and stay out of trouble. No more shoplifting, you got that?\nMaya:\n... Do I look like a criminal or something?\nDecember 25Gourd LakePublic Beach\nMaya:\nWowsers! This is \"Gourd Lake\"?\nPhoenix:\nYup. I'm not sure it warrants a \"wowsers,\" though.\nMaya:\nHmm. Probably not. But hey, look at that snack stand!\nPhoenix:\n\"Samurai Dogs\"...?\nMaya:\nI wanna Samurai Dog! Please! I bet they're great!\nPhoenix:\nWith a name like Samurai Dog, how could they not be?\nMaya:\nThey're a little behind the times, though. The kids are all into \"The Pink Princess\" now. I mean, like, y'know!?\nPhoenix:\n(Nope.)\nWright & Co. Law Offices\nDetention Center\nDecember 25Boat Rental Shop\nMaya:\nNick... what is this place?\nPhoenix:\nA boat rental shop. Closed for Christmas it seems. I guess a murder taking place on one of the boats won't be good for business, either.\nMaya:\nBoats... I've never ridden on a boat.\nPhoenix:\nReally? Well, how about we go out on one when the trial is finished?\nMaya:\nHey, good idea! You bet!\nDecember 25Gourd Lake Woods\nMaya:\nI like it here, Nick. Look... someone's camping!\nPhoenix:\nThey've got guts, camping at the scene of a murder.\nMaya:\nHey, hey, Nick! If they were camping here last night, they might know about the murder!\nPhoenix:\n(That's true...) Good call, Maya. Let's go talk to them.\nPhoenix:\nThis camera has a mic and some sort of attachment. It must take pictures when triggered by a noise.\nMaya:\nWow! Cool! Let's try it out! *cough* \"Hi, I'm Nick!\" ... Maybe I'm not saying it loud enough. \"HEY! I'M NICK!!!\" ... Huh. NIIIIIIIIII......IIIIIIIIIICK!\nPhoenix:\nWill you stop that?\nMaya:\nMaybe it's broken?\nPhoenix:\nD-don't kick it! Maybe it isn't set up to respond to voices?\nMaya:\nWell what then? These things? (Changed from [Well what then? I know!] in the original release)\nPhoenix:\nThe party poppers...? (Changed from [The party popper...?] in the original release)\n*BANG*\nklik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik\nMaya:\n... Well. It responded. (Changed from [... Yep. It responded.] in the original release)\n???:\nYaaaaaaaaaaaaaaw! Hey, you! Git yer hands offa' that!\nMaya:\nEek!\n???:\nWhat in the Sam Hill...!? Look what ya done now! There goes a whole roll of film!\nMaya:\nAh? Wha... huh? S-sorry!\n???:\nSorry's nice but it don't pay my bills! Y'all know how much a roll of that film costs!?\nMaya:\nI-I'll pay you back!\n???:\nWhat were ya'll thinkin' settin' off a party-popper in a place like this?\nMaya:\nUh... well...\n???:\nWhat! Don't try to play stupid with me just 'cause you think I'm some country bumpkin! Yeah, I know how y'all Yanks think! \"I say, those southern folks talk with that exaggerated drawl, why they must be dumb!\" Well let me tell you, just because I might be dumb don't mean we all are!\nMaya:\nN-Nick, help!\n???:\nAnd who are you, now? Her chaperone?\nPhoenix:\nYeah, uh, no, rather, uhh... we're sort of... friends?\n???:\nJus' figure out what y'all are gonna say and say it for bejeezum's sake! Gawd, I'd rather sit through one of papa's drawls than listen to you stutter all day.\nPhoenix:\n(Oh boy... I guess we should pay her for the film...)\n???:\nWatch it!\nPhoenix:\nYes ma'am. (On second thought, I'll pay later...)\nMaya:\nI'm really sorry!\nPhoenix:\nI, er, this is my badge.\n???:\nHuh? Aren't badges supposed t' be all shiny and impressive? You a cop or something?\nPhoenix:\nUmm... I'm a lawyer.\n???:\nWh-what!? Y'all ain't gonna try and pull one o' them lawsuits on me over that film now? Cause I'll have you know I'm a fighter and I wrassled meaner looking' things'n you!\nPhoenix:\nN-no, that's not it at all. We're here investigating a murder that took place here, on the lake.\n???:\nA murder...? ... Sounds cool! Why didn't y'all say that in the first place! Go ahead, ask me anything ya like!\nPhoenix:\n(Finally! Some cooperation!)\n???:\nYou too. Y'all can come out of hiding now. I won't bite. Hard.\nPhoenix:\n(Come to think of it, where did Maya get to?)\nMaya:\nS-sorry... I-I was feeling a little overwhelmed. The culture gap and all...\n???:\nNever you mind, honey. I kin' talk Yank for ya if... ahem... if it pleases you?\nMaya:\nTh-thanks. I think I'll be okay.\nLotta:\nGreat then! I'm Lotta, Lotta Hart, but y'all can call me Lotta! I'm here photographing meteor showers for a research project. Mighty pleased ta meet ya!\nPhoenix:\nLotta?\nLotta:\nYeah?\nPhoenix:\nSo, your camera... it triggers on loud explosion noises?\nLotta:\nAyup.\nPhoenix:\nActually, the victim in the case we're researching--he was shot with a pistol.\nLotta:\nA pistol...?\nPhoenix:\nRight. Now wouldn't a gunshot make a similar noise to our party popper...?\nLotta:\nI guess it would.\nPhoenix:\nYour camera... didn't get a picture of the murder, did it?\nLotta:\n... Hey! Y'all are pretty bright!\nPhoenix:\nHuh?\nLotta:\nI see what yer sayin'... Tell ya what, I'll have a look-see at my film.\nPhoenix:\nIt would have been a photo taken late last night...\nLotta:\nI checked 'em once, don't remember if there was anything on 'em though. But what if I got sumtin'! I could be witness to a genuine murder! Yeehaw! I'll go check that film. Y'all come back now, y'hear?\nMaya:\nShe went inside her SUV. I guess we should come back later...\nWright & Co. Law Offices\nAfter presenting Lotta's Camera in Gourd Lake Woods:\nDecember 25Police DepartmentCriminal Affairs\nMaya:\n... I guess Detective Gumshoe is still in that meeting.\nGumshoe:\nHey! Thanks for coming down, pal!\nMaya:\nDetective Gumshoe!\nGumshoe:\nWe just finished the meeting. For better or for worse...\nPhoenix:\n(I get the feeling we're in for some bad news...)\nWright & Co. Law Offices (after clearing \"The autopsy report\" Talk option in Police Department - Criminal Affairs)\nMaya:\n...\nPhoenix:\nWhat is it?\nMaya:\nOh. Nothing... Just, something's been bothering me. ... Could you show me that autopsy report once more? ... ... ... Hey! I-I remember now! This guy! This is a lawyer that was at that office Mia worked at! I met him once when I went there to hang out with Sis!\nPhoenix:\nThat office...? Wait! You mean Grossberg's office?\nMaya:\nRight! That guy!\nPhoenix:\n(That was the last name I expected to come up... Maybe I should go talk to him... for old time's sake.)\nDecember 25Grossberg Law Offices\nPhoenix:\nIt's been a while since I was here last. Mr. Grossberg is out as usual.\nMaya:\nHey, Nick. Look at the wall.\nPhoenix:\n(That painting is still missing... Mia must have known about the deal with Mr. Grossberg and Redd White... She kept track of all of White's extortion and blackmail rackets.)\nDetention Center\nAfter clearing \"The autopsy report\" Talk option in Police Department - Criminal Affairs:\nDecember 25Gourd Lake Woods\nLotta:\nHey y'all!\nMaya:\nLotta!\nLotta:\nWait up a sec! We got bingo!\nMaya:\nBingo...?\nLotta:\nMy automatic camera took two pictures last night!\nMaya:\nHey!\nLotta:\nThis is them. Take a look!\nPhoenix:\nWait...!\nLotta:\nSee? See? He's shooting him with that pistol!\nPhoenix:\nI-it looks like that, yes.\nMaya:\nBut you can't really tell who that is shooting.\nLotta:\nYeah, well there was enough fog out there last night t' strangle a bullfrog. But, y'know... Seeing these photos reminded me of something.\nMaya:\nWhat...?\nLotta:\nI saw the murder happen. I'm a witness!\nMaya:\nWhaaaaaaa!?\nPhoenix:\nA-are you serious!?\nLotta:\nCourse!\nPhoenix:\n(How do you forget... never mind.)\nLotta:\nY'all reckon I should tell the cops?\nLotta:\nHey, so, I'm off to talk to the cops. Y'all can have this photo. Later.\nPhoenix:\nW-w-wait! Lotta!\nLotta:\nWhat? Can't y'all see I'm kinda busy?\nPhoenix:\nT-tell us what you saw, too! Please?\nLotta:\nNice try, honey, but I wasn't born yesterday. I'm a witness, and that means I'm on the side of justice, and that means the cops! I'd sooner eat the south side of a north-bound skunk than tell you!\nMaya:\nL-Lotta!\nLotta:\nDon't let it get your skivvies in a bunch. Friends today, enemies tomorrow! Or was that the other way round? No matter. I'm gone! Hey! Maybe they'll let me do some testifying! Hot darn!\nMaya:\nShe left... ... Well, that's one more witness. What do we do now, Nick?\nPhoenix:\n(Well, if she saw something, there's not much we can do about it. The question is: what exactly did she see...? I guess we'll find out in the trial tomorrow.)\nLake Photo added to the Court Record.\nDecember 25Gourd LakePublic Beach\nMaya:\nLooks like the police have given up their interviewing. (Changed from [Looks like the police have given up their questioning.] in the original release)\n???:\nHey!\nMaya:\nAah! N-Nick! I think Santa's mad at you!\n???:\nLong time no see, Nick.\nMaya:\nNick... you know Santa!? Wow... Nick and St. Nick... Hey! I see the connection!\nPhoenix:\nDon't be ridiculous!\n???:\nDude, it's me!\nPhoenix:\nL... Larry! What are you doing here!?\nButz:\nIsn't it obvious? I'm working my day job! I sell Samurai Dogs! Want one? Gotta get money for dates, you know, My girl Kiyance deserves the best!\nPhoenix:\n(K-Kiyance...? Not another model, I hope...)\nButz:\nOh, Kiyance's a fine, fine woman, Nick. It was her idea that I wear this costume! She was all \"You go girlfriend!\" Y'know? She bought this costume for me!\nPhoenix:\nThat... that's great, Larry.\nMaya:\nWow! A Santa costume! She must be really nice!\nButz:\nWhoa! Cute! Nick! Who's she? She's not your...?\nPhoenix:\nNot my... what? N-no, she's not!\nMaya:\nI'm his partner, Maya Fey. I'm, uh, the little sister.\nButz:\nSister...? ... Wow, Nick, must be tough. Working nine to five, having to take care of a little sister...\nMaya:\nN-no, I'm not Nick's sister, I'm my older sister's little sister...\nButz:\nHuh. Sounds great!\nPhoenix:\n(Don't worry, Maya, he's not listening...)\nDecember 25Police DepartmentCriminal Affairs\nMaya:\n... Not a Gumshoe in sight.\nPolice:\nIf you're looking for Detective Gumshoe, he's in the questioning room. Apparently, an important witness turned up. He'll be in there for a while.\nMaya:\nLotta Hart... it has to be.\nPhoenix:\nUh oh...\nDetention Center\nAfter clearing all Talk options in Gourd Lake - Public Beach:\nDecember 25Grossberg Law Offices\nGrossberg:\n*Ah-HHHHEM!*\nPhoenix:\n(Ah, that old familiar clearing of the throat!)\nGrossberg:\nAh hah! You're Mia's... something, are you not?\nPhoenix:\nI was her understudy, yes. Phoenix Wright.\nGrossberg:\nAh hah! And you, you're Mia's... something too, are you not?\nMaya:\nHer little sister, yes!\nGrossberg:\nYou've grown! You've come to look a lot like your sister, you know? It takes me back. \"Ahh... the days of my youth... like the scent of fresh lemon...\" you see.\nPhoenix:\nUm, Mr. Grossberg, sir?\nGrossberg:\nHmm...? Ah, yes. I beg your pardon. Of course you came here to discuss something. What is it then? Something the matter?\nWright & Co. Law Offices\nDecember 25Detention CenterVisitor's Room\nEdgeworth:\nWhat's this? I was hoping you'd gotten my message the first time.\nPhoenix:\nEdgeworth, what about your defense?\nEdgeworth:\n...! It's no concern of yours.\nPhoenix:\n(Guess he hasn't found anyone yet.)\nAfter clearing all Talk options and presenting Lake Photo:\nEdgeworth:\n... Wright.\nPhoenix:\n?\nEdgeworth:\nIt pains me to ask you this now...\nMaya:\nI know! You want us to defend you!\nEdgeworth:\nYes... Will you?\nPhoenix:\nThis is my chance to finally pay you back.\nMaya:\nPay him back...?\nEdgeworth:\nPay me back? For what? I don't remember ever doing anything for you.\nPhoenix:\nNever mind... I guess you don't really need to know.\nEdgeworth:\nHuh... My letter of request. Please give it to Detective Gumshoe.\nEdgeworth's Request put in pocket.\nPhoenix:\nWell, I guess we should... ... W-what's that!?\nMaya:\nE-earthquake! Nick! It's a big one! Whaaaaa! I-it's calming down... ... Whew... that was scary!\nPhoenix:\n...? Huh? Where's Edgeworth?\nMaya:\n... There. He's on the floor in a ball, shivering. I guess he doesn't do so well with earthquakes.\nPhoenix:\n(I've heard of running, but curling up in a ball?)\nMaya:\nWell, I guess we're done. Mr. Edgeworth doesn't seem like he's going to stand up any time soon. Let's go, Nick.\nPhoenix:\nUh.. right. We have to give Edgeworth's letter of request to Detective Gumshoe.\nAfter Edgeworth's Request is added to the Court Record:\nDecember 25Police DepartmentCriminal Affairs\nGumshoe:\nWhat's going on here!?\nMaya:\nEek!\nPhoenix:\nW-what's wrong, Detective?\nGumshoe:\nThis wild lady comes in here just a while ago... Says she came \"to talk to y'all after hearing what Mr. Wright had to say\"! What's this all about, pal!?\nPhoenix:\n(Lotta Hart...)\nGumshoe:\nWhy are you going around finding more witnesses!? You want to give Mr. Edgeworth the death sentence, pal!?\nPhoenix:\nN-no, not at all... Just... I mean, she did see something. There's nothing I can do about that. I can't go around covering up evidence!\nGumshoe:\nEr... You trying to say something about the way I do my job?\nPhoenix:\nNo sir!\nPhoenix:\nLook what I got.\nGumshoe:\n... Hey, you did it, pal! Glad I waited till the last minute to file those papers! I'll rip 'em up and start new ones for you!\nPhoenix:\nThanks, Detective. Well, see you in court tomorrow, then.\nGumshoe:\nGood luck, pal. Hey! You guys feel that earthquake a little while back? I was worried!\nMaya:\nWorried? We're fine! I've lived out here my whole life. I'm pretty used to them by now.\nGumshoe:\nOh, I wasn't worried about you two. I was worried about Mr. Edgeworth!\nPhoenix:\n(Oh, right...) He did seem to over-react a little, now that you mention it.\nGumshoe:\nYeah, well, I'm not surprised. It was a pretty big quake. I'm going to go check on him. You two go eat and get your rest for tomorrow's trial. Later!\nMaya:\n... I wonder what it is with Mr. Edgeworth and earthquakes?\nPhoenix:\nI wonder... He was never that scared of them when he was in school.\nPhoenix:\n(Then again, I only really got to know him in 4th grade. (Changed from [Then again, I was only in the same class as him for 4th grade.] in the original release) He transferred to another school after that. I wonder what happened to Edgeworth...)\nTo be continued.",
  "characters": [
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Maya Fey",
      "age": "17",
      "gender": "Female",
      "description1": "Mia's little sister. Currently training to become a spirit medium."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Miles Edgeworth",
      "age": "24",
      "gender": "Male",
      "description1": "A gifted prosecutor, and a ruthless man who'd do anything to get a \"guilty\" verdict.",
      "description2": "A gifted prosecutor. The defendant in this case."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Dick Gumshoe",
      "age": "30",
      "gender": "Male",
      "description1": "Detective at the local precinct. In charge of the initial investigation."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Lotta Hart",
      "age": "22",
      "gender": "Female",
      "description1": "Claims to be a research student. She's camped out to photograph shooting stars.",
      "description2": "Claims to be an investigative photographer. Trying to photograph Gourdy."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Larry Butz",
      "age": "23",
      "gender": "Male",
      "description1": "A friend and former classmate. Also my first client. Often the cause of trouble."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Marvin Grossberg",
      "age": "64",
      "gender": "Male",
      "description1": "A veteran defense attorney, and Mia's mentor."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Robert Hammond",
      "age": "48",
      "gender": "Male",
      "description1": "The victim in this case. Also, the defense attorney in the DL-6 Incident."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Misty Fey",
      "age": "46",
      "gender": "Female",
      "description1": "Mia and Maya's mother, and a spirit medium. Disappeared after the DL-6 Incident."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Gregory Edgeworth",
      "age": "deceased",
      "gender": "Male",
      "description1": "Victim in the DL-6 Incident, 15 years ago. A defense attorney and Miles's father."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Manfred von Karma",
      "age": "65",
      "gender": "Male",
      "description1": "Veteran prosecutor who hasn't lost a case in his 40-year career. Edgeworth's mentor."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Old Caretaker → Yanni Yogi",
      "age": "?? → 52",
      "gender": "Male",
      "description1": "Caretaker of the boat rental shop in Gourd Lake Park. Thinks he runs a restaurant.",
      "description2": "Suspect in the DL-6 Incident. Former court bailiff, now runs a boat rental shop."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "No one would believe I was a defense attorney if I didn't carry this."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Popper",
      "type": "Other",
      "obtained": "Retrieved from the Gourd Lake Public Beach.",
      "description1": "A classic party noisemaker. Pull the string, it goes \"bang\". Not very clue-worthy."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Lotta's Camera",
      "type": "Other",
      "obtained": "Retrieved from the Gourd Lake Woods.",
      "description1": "Set to automatically take a picture when a loud noise is detected. Faces the lake."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Autopsy Report → Robert's Autopsy Report",
      "type": "Reports",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "Time of death: sometime on the 24th or 25th. Cause: one bullet shot to the heart.",
      "description2": "Time of death: sometime on the 24th or 25th. Shot from approximately one meter away."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Lake Photo",
      "type": "Photographs",
      "obtained": "Received from Lotta Hart.",
      "description1": "Taken automatically on 12/25 at 12:15 AM. Click here for details."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Gourdy Article",
      "type": "Other",
      "obtained": "Received from Larry Butz.",
      "description1": "Article about a monster sighted at Gourd Lake. Click here for details."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Misty Fey's Photo",
      "type": "Photographs",
      "obtained": "Received from Marvin Grossberg.",
      "description1": "An old photograph. \"DL-6 Incident - Exhibit A\" is written on the back."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Edgeworth's Request",
      "type": "Documents",
      "obtained": "Received from Miles Edgeworth.",
      "description1": "Document proving Edgeworth's request for an attorney."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Overhead Map",
      "type": "Maps",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Overhead map of Gourd Lake. Click here for details."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Pistol Bullet",
      "type": "Weapons",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Found in the victim's body. Fired from a 22-caliber pistol.",
      "description2": "Found in the victim's body. The ballistic markings match the murder weapon's barrel."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Pistol",
      "type": "Weapons",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "The murder weapon. 22-caliber. Fired 3 times. Bears prints from Edgeworth's right hand."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Lotta's Deposition",
      "type": "Documents",
      "obtained": "Submitted as evidence during the trial.",
      "description1": "\"I heard two sounds like gunshots just after midnight on 12/25.\""
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Missile",
      "type": "Other",
      "obtained": "Borrowed from Detective Dick Gumshoe.",
      "description1": "A K-9 unit in training. Very cute, with shiny eyes."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Fishing Pole",
      "type": "Other",
      "obtained": "Borrowed from Detective Dick Gumshoe.",
      "description1": "Detective Gumshoe's personal fishing pole. Sadly flimsy and of dubious utility."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Metal Detector",
      "type": "Other",
      "obtained": "Borrowed from Detective Dick Gumshoe.",
      "description1": "Makes a noise when metallic objects are near. A useful detection device."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Air Tank",
      "type": "Other",
      "obtained": "Retrieved front of the Boat rental shop.",
      "description1": "An empty air tank. The valve is open, and a banner of flags is wrapped around it."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Second Lake Photo",
      "type": "Photographs",
      "obtained": "Received from Lotta Hart.",
      "description1": "Shows an empty lake. Taken automatically on 12/24 at 11:50 PM."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Parrot",
      "type": "Other",
      "obtained": "Retrieved at the Caretaker's Shack.",
      "description1": "The erstwhile companion of the boat rental shop caretaker. Answers to the name \"Polly\"."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "DL-6 Case File",
      "type": "Reports",
      "obtained": "Retrieved from the Records Room.",
      "description1": "File on the DL-6 Incident. Click here for details."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "DL-6 Incident Photo",
      "type": "Photographs",
      "obtained": "Retrieved from the Records Room.",
      "description1": "Photograph of the scene of the murder. Click here for details."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "Letter from the Safe",
      "type": "Documents",
      "obtained": "Retrieved at the Caretaker's Shack.",
      "description1": "\"Get your revenge on Miles Edgeworth.\" This note details the murder and set up."
    },
    {
      "currentChapter": "Turnabout Goodbyes",
      "name": "DL-6 Bullet",
      "type": "Evidence",
      "obtained": "Retrieved from the Records Room.",
      "description1": "Taken from Gregory Edgeworth's heart. Still bears clear ballistic markings."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "Turnabout Goodbyes\n\n\n\n\n\n\n\n\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 4\n\nPart 5\n\nPart 6December 26, 9:44 AMDistrict CourtDefendant Lobby No. 2Phoenix:\nKarma...? (ellipsis and question mark highlighted in the original release)Edgeworth:\nThat's right, Manfred von Karma. He's the best prosecutor there is. He hasn't lost a case in his 40-year career. He is a god of prosecution, Wright! A god!Maya:\nNot a single case?Edgeworth:\nHe'll do anything to get a guilty verdict, anything.Phoenix:\nHmm. Sounds like someone else I know, Edgeworth.Edgeworth:\nHmph. You don't understand. I mean he'll really do anything. Manfred von Karma is a man to be feared.Phoenix:\n(That's quite a claim coming from someone who forges evidence...)Edgeworth:\nHe taught me what it really means to \"prosecute.\"Phoenix:\nWh-what!?Edgeworth:\nJust picture a prosecutor as vicious as me... multiplied by a factor of ten.Maya:\nUgh... So... so was he your teacher, then, Mr. Edgeworth?Edgeworth:\nSomething like that...Maya:\nAnd now he's trying to get you found guilty!? What a creep! Oh, wait... Maybe he's planning on losing on purpose to help you out.Edgeworth:\nNot a chance... He hasn't lost once in 40 years. 40 years! He's as ruthless as me, times twenty!Maya:\nThat's pretty ruthless...Edgeworth:\nLike I said. He's a god among prosecutors.Phoenix:\n(I guess that's something like Mia was to me. Speaking of Mia...) Um, Maya?Maya:\nUh huh?Phoenix:\nWe could really be using Mia's help right now... don't you think?Maya:\nOh...Phoenix:\n?Maya:\nI can't. Sorry. I tried, I really tried, but I couldn't reach.Phoenix:\nYou couldn't \"reach\"?Maya:\nI think it's because I haven't been training. My powers are weak again...Phoenix:\nOh man, what bad timing!Maya:\nI'm really sorry. I'll try my best!Phoenix:\nI hope so!Edgeworth:\nWhat are you whispering about?Phoenix:\nO-oh, it's nothing. Well, it's time. Let's head in...December 26, 10:00 AMDistrict CourtCourtroom No. 3Judge:\nCourt is now in session for the trial of Mr. Miles Edgeworth.Phoenix:\nThe defense is ready, Your Honor.Karma:\n...Judge:\nErr, Mr. von Karma? Is the prosecution ready?Karma:\n... Fool... You seriously think that I would stand here were I not completely prepared?Judge:\nR-right, my apologies!Phoenix:\n(He's even got the Judge scared!)Judge:\nVery well, your opening statement, please.Karma:\n... Decisive evidence... A decisive witness... What else could possibly be required?Judge:\nAh... er, nothing of course. That should be fine. The prosecution may call its first witness.Maya:\nWhat's with this guy? Is he royalty or something?Phoenix:\nHow am I supposed to fight against this!?Karma:\nI call the detective in charge of this case, Detective Dick Gumshoe.Phoenix:\n(Okay, Gumshoe's first... Let's see how this goes.)Karma:\nDescribe the incident. Now!Gumshoe:\nY-yessir!Phoenix:\n(Detective Gumshoe looks nervous...)Gumshoe:\nEr, please take a look at the map. The murder happened late Christmas Eve, around midnight. There was one boat in the very middle of the lake. There were two men on the boat. Now, there happened to be a woman camping here on the edge of the lake. At 12:10 AM, she heard two pistol shots. Then the boat started to move. It went towards the boat rental shop.Karma:\nHmm.Overhead Map added to the Court Record.Karma:\nTestify to the court about your arrest. Now!Judge:\nW-w-wait! Mr. von Karma...Karma:\nYes?Judge:\nActually, I'm the one that's supposed to be handling these proceedings...Karma:\nWrong. There is only one thing you need to do here. You will slam down your gavel and say the word \"guilty.\" That is your role!Judge:\nY-yes, of course. You're quite right.Phoenix:\n(No, he's not!!!)Witness Testimony-- The Arrest of Edgeworth --Gumshoe:\nA man called into the station around 30 minutes after midnight.\nWe headed to the scene of the crime as fast as we could.\nThat's where we found Mr. Edgeworth.\nNow, I didn't suspect him of anything at all.\nBut... the next morning, a body was found in the lake.\nSo we had to arrest Mr. Edgeworth.Judge:\nHmm... I see. Very well...Karma:\nBegin your cross-examination, attorney. Now!Judge:\n...Cross Examination",
      "testimonies": [
        {
          "testimony": "A man called into the station around 30 minutes after midnight.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "We headed to the scene of the crime as fast as we could.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "That's where we found Mr. Edgeworth.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "Now, I didn't suspect him of anything at all.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "But... the next morning, a body was found in the lake.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "So we had to arrest Mr. Edgeworth.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "The murder weapon we found in the boat was decisive evidence.",
          "person": "Gumshoe",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Arrest of Edgeworth --Gumshoe:\nA man called into the station around 30 minutes after midnight.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou received a call from a \"man\"?\nGumshoe:\nEr... yup.\nPhoenix:\nBut you said there was a woman camping there? She was the one who heard the two gunshots, right?\nKarma:\n\nKarma:\nThat woman and the \"man\" who called in the report are two different people, obviously!\nPhoenix:\nDifferent people?\nKarma:\nThere were two witnesses!\nPhoenix:\n(Urk!)\nKarma:\nTheir testimonies were quite similar however. Today I've summoned the woman who was camping.\nPhoenix:\n(The woman who was camping... Lotta Hart.)\nKarma:\nWhat happened next, Detective?Gumshoe:\nWe headed to the scene of the crime as fast as we could.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHow long was it between receiving the report and your arrival at the lake?\nGumshoe:\nEr, well... I'd say it was about three minutes.\nPhoenix:\nThat's pretty fast!\nGumshoe:\nOur motto for the month is \"get there quick.\"\nKarma:\n\nKarma:\nDetective! You will refrain from casually revealing department secrets!\nGumshoe:\nY-yessir! Sorry, sir!\nKarma:\nDo that, and you'll be able to look forward to your next salary review.\nGumshoe:\nSo much to look forward to, these days...\nKarma:\nThis is no time for daydreaming! Continue!\nGumshoe:\nY-yessir!Gumshoe:\nThat's where we found Mr. Edgeworth.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat was Mr. Edgeworth like when you saw him then?\nGumshoe:\nWell... From what I saw, he looked pretty relaxed. Not like a murderer at all, really.\nKarma:\n\nKarma:\nDetective! The court requires the facts, NOT your opinion! How many years have you been on the force!? Facts only, Detective! Hard, cold, objective facts!\nGumshoe:\nY-y-yessir!\nPhoenix:\n(Man, he's got his share of objections...)Gumshoe:\nNow, I didn't suspect him of anything at all.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhy didn't you think he was suspicious?\nGumshoe:\nYou should know! We have a deep, trusting relationship with the prosecutors.\nKarma:\n\nKarma:\nDetective! The court isn't interested in your musings! \"Deep\"? \"Trusting\"? Poppycock! I've never heard so many flippant comments from an active detective on the force!\nGumshoe:\nMmph!\nPhoenix:\n(Detective Gumshoe doesn't look so good...)\nKarma:\nContinue! Now!Gumshoe:\nBut... the next morning, a body was found in the lake.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nDid you find any clues on the body?\nGumshoe:\nA single bullet was recovered from the body. He was shot through the heart... fatally.\nKarma:\nJudge! Here's the bullet... It didn't strike bone, so its shape is well preserved.\nJudge:\nVery well. The court accepts this bullet into evidence.\nPistol Bullet added to the Court Record.Press (subsequent times)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nDid you find any clues on the body?\nGumshoe:\nA single bullet was recovered from the body. He was shot through the heart... fatally.Gumshoe:\nSo we had to arrest Mr. Edgeworth.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nW-why is that?\nGumshoe:\nWell, we found the murder weapon in the boat.\nPhoenix:\nThe murder weapon...?\nGumshoe:\nA pistol.\nJudge:\nDetective Gumshoe... That is a vital piece of information. Please revise your testimony.\nGumshoe:\nRight! S-sorry, Your Honor.\nChanges statement from \"So we had to arrest Mr. Edgeworth.\" to \"The murder weapon we found in the boat was decisive evidence.\"Gumshoe:\nThe murder weapon we found in the boat was decisive evidence.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat about the pistol made it \"decisive evidence\"?\nKarma:\nTsk tsk tsk...\nPhoenix:\n(Ack! He has the same evil laugh as Edgeworth...)\nGumshoe:\nThere were fingerprints on the pistol found in the boat. They were clear prints from Mr. Edgeworth's right hand.\nPhoenix:\nWh-what!?\nJudge:\nOrder! Order! So Mr. Edgeworth's fingerprints were found on the murder weapon!?\nGumshoe:\nY-yes, Your Honor.\nKarma:\nJudge! This is the weapon in question.\nJudge:\nA-accepted into evidence.\nPistol added to the Court Record.Press (subsequent times)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat about the pistol made it \"decisive evidence\"?\nKarma:\nTsk tsk tsk...\nPhoenix:\n(Ack! He has the same evil laugh as Edgeworth...)\nGumshoe:\nThere were fingerprints on the pistol found in the boat. They were clear prints from Mr. Edgeworth's right hand.\nPhoenix:\nWh-what!?Maya:\nNick. Doesn't it seem like Detective Gumshoe is being a little vague?Phoenix:\nI bet von Karma is feeding him lines! His testimony's probably filled with landmines just waiting for me to press.Maya:\nWhat do we do?Phoenix:\nGrit our teeth and press, I guess. What else can we do?Maya:\nWell said, Nick! You're the man!After pressing fifth statement and pressing modified sixth statement:Karma:\nMembers of the court... We now have the pistol used in the murder, and the bullet found in the body! Detective!Gumshoe:\nY-y-yessir!Karma:\nWas the bullet found in the body fired from this pistol?Gumshoe:\nYes. The ballistic markings on the bullet match the pistol.Judge:\nHmm...Maya:\nHey, Nick! What does he mean, \"ballistic markings\"?Karma:\nShocking! To imagine someone here does not know something as basic as ballistic markings!Maya:\nN-Nick! He's glaring at me!Karma:\nTsk... very well, I'll explain. Actually, Judge! You do it.Judge:\nEh? M-me? ... Erm, ahem. Ballistic markings are like the \"fingerprints\" of a gun. The barrel leaves distinctive marks on each bullet it fires. You can examine these \"ballistic fingerprints\" to see which gun fired the shot. It's quite accurate.Karma:\nIndeed. This leads to one, inevitable conclusion: the bullet found in the victim's heart... was, without a doubt, fired from this pistol. This pistol which, as you may recall, was covered with the defendant's own fingerprints!Judge:\nO-order! Order!Phoenix:\n(This is bad... This makes it look like Edgeworth did it!)Karma:\nWell, Judge?Judge:\nI'd say it's almost decisive, yes. Honestly, I could declare a verdict at this point. However...Karma:\nYou wish to hear the witness speak, no doubt. Very well. I am somewhat fatigued, and so I will take a brief break. I will call my witness after the recess. Which will last ten minutes. Judge!Judge:\nY-yes?Karma:\nWhat are you doing? A ten minute recess! Now!Judge:\nB-but, wait, I...Karma:\nJust bang your flimsy gavel and get on with it, man!Judge:\nY-yes! Ahem. This court will take a ten minute recess.Phoenix:\n(Who's running this court, anyway!?)December 26, 11:09 AMDistrict CourtDefendant Lobby No. 2Phoenix:\nEdgeworth! What's going on here!? Your fingerprints were on the murder weapon!Edgeworth:\nUh... hmm...Phoenix:\nAnd that foggy photo makes one thing clear... The only one who could have shot that man was the person in the photo!Edgeworth:\nTrue...Phoenix:\nWas that you in the boat?Edgeworth:\n... Yes. It was me.Phoenix:\nWhat!?Edgeworth:\nBut... you must believe me. I didn't shoot him.Phoenix:\nTh-then who did!?Edgeworth:\nI... don't know.Phoenix:\nYou don't know!? Weren't you right there!?Edgeworth:\n... I heard a gunshot from very close by. Then... the other man fell from the boat. I can't say why, but... I thought, at the time, that he had shot himself!Phoenix:\nY-you mean it was a suicide!?Edgeworth:\n... That's the only explanation I can come up with.Phoenix:\nHuh... (How am I going to convince anyone of that!?) Say, Maya?Maya:\nHuh? Wh-what?Phoenix:\nAny progress with Mia?Maya:\nOh... Sorry. It's no good.Phoenix:\nUgh...Maya:\nI know... I'm no good for anything, am I, Nick? If I can't call my sister, I might as well not be here, right?No, I need you here\n\n\n\n\n\n\n\nPhoenix:\nNo, of course not, I need you here! I can see you're always trying to help out. Even if you don't actually help... it's the thought that counts, right?\nMaya:\nIt's okay Nick, you don't have to make me feel better.\nLeads to:\n\"I don't know anything about trials, or defense...\"Yeah, you're useless\n\n\n\n\n\n\n\nPhoenix:\nUm, well, actually... (You don't know law, you don't have any trial experience or techniques... Yeah, you're pretty much useless... but I can't say that!)\nMaya:\nIt's okay Nick. You don't have to say anything. Your face said it for you.\nPhoenix:\n(Whoops!) N-no, o-of course we... I'm sorry.\nMaya:\nIt's okay Nick.\nLeads to:\n\"I don't know anything about trials, or defense...\"Maya:\nI don't know anything about trials, or defense... What's more, I'm a spirit medium who can't even contact spirits...Phoenix:\nAww, everyone has their off days! I mean, I've just been getting lucky lately... But you never know when my luck is going to run out!Maya:\nReally...?Edgeworth:\nW-w-whoa! Wright! Don't jinx this case any worse than it already is! It's bad for my heart...Phoenix:\nOh? Oh! S-sorry... (Whoops!)Judge:\nCourt is back in session. Mr. von Karma, call your witness.Karma:\nYes. Will Ms. Lotta Hart take the stand?Karma:\nLotta Hart, you are a research student at a university?Lotta:\nThat I am.Karma:\nGood. Begin by telling us what you saw the night of the incident. And don't add anything trivial or subjective. Understand?Lotta:\n... Y'all need to learn some manners.Karma:\nUNDERSTAND?Lotta:\nY-yeah, I understand, I understand!Judge:\nEr... very well. Your testimony, please.Witness Testimony-- Witness's Account --Lotta:\nIt was Christmas Eve, just after midnight, I reckon.\nI was in my car.\nI heard this \"bang\" come up from the lake.\nWhen I looked out the window, I saw two gents in a boat.\nThen there was another \"bang\"...\nThere wasn't nary a thing on the lake but that boat.Karma:\nEnough.Lotta:\nHuh?Karma:\nJudge! She happened to take a photo of the incident! This is that photo. Accept it as evidence.Judge:\nW-well! This is a surprise! This looks like... the very moment of the murder! O-Order! I will remove you from the court if I do not have order immediately!Karma:\nAs the witness testified, she looked at the lake when she heard the shot. There were no other boats on that lake! So, the man in the boat with the victim must have been the one who shot him... Yes. It was the defendant, Miles Edgeworth!!!Judge:\nOrder! Order! Order...! I will have order!Karma:\n... Well, Judge?Judge:\nThe evidence is... decisive. I have very little doubt about this case. Very well, this court finds the defendant...Phoenix:Phoenix:\nW-wait! Your Honor! I haven't cross-examined the witness yet!Karma:\nA cross-examination? We have photographic proof! What question can there possibly be!? This photo is worth a thousand words... and they all read \"guilty\"! You lose. Or... Do you claim to have found a contradiction in her testimony!?Phoenix:\n...!Karma:\nVery well. If you have to, you may cross-examine the witness. You will only flounder and ask meaningless questions! You will fail to find anything! And then, I will have you held in contempt of court!Maya:\nUh, Nick... contempt...?Phoenix:\n\"Contempt of court,\" you know?Maya:\nI... guess I understand. Well... what are you going to do? Do you really think there was a contradiction with the facts in her testimony?I think there was\n\n\n\n\n\n\n\nPhoenix:\nI... think I noticed one little thing...\nMaya:\nWow, I'm impressed, Nick! I didn't notice anything! Right! Let's take him on!\nPhoenix:\nY-yeah... (I got a bad feeling about this...)\nLeads to:\n\"I understand... I will cross-examine the witness!\"I think there wasn't\n\n\n\n\n\n\n\nPhoenix:\nHonestly, I found nothing.\nMaya:\nI dunno, I thought her testimony was strange. She was so vague about everything!\nPhoenix:\nI bet von Karma probably fed her her lines.\nMaya:\nBut... But if you don't cross-examine her, the judge will...\nPhoenix:\nHe'll bang down that \"flimsy gavel\" of his and declare Edgeworth guilty.\nMaya:\nI guess we'll just have to bluff it.\nPhoenix:\nBut if we mess up... contempt of court.\nMaya:\nHey, if we lose we'll be held in public contempt!\nPhoenix:\nEr... right.\nLeads to:\n\"I understand... I will cross-examine the witness!\"Phoenix:\nI understand... I will cross-examine the witness!Karma:\nTsk tsk tsk... Very well!Judge:\nI pray for your sake this isn't a waste of time.Cross Examination",
      "testimonies": [
        {
          "testimony": "It was Christmas Eve, just after midnight, I reckon.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "I was in my car.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "I heard this \"bang\" come up from the lake.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "When I looked out the window, I saw two gents in a boat.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "Then there was another \"bang\"...",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "There wasn't nary a thing on the lake but that boat.",
          "person": "Lotta",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- Witness's Account --Lotta:\nIt was Christmas Eve, just after midnight, I reckon.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n\"Just after midnight,\" you say? In other words, it was no longer Christmas Eve... but Christmas Day!\nLotta:\nHuh? Uh, yeah, well, yes.\nKarma:\n\nKarma:\nI know you want to find contradictions, but really!\nPhoenix:\nMmmph.\nJudge:\nI hope your next contradiction is a little more relevant to the trial.Lotta:\nI was in my car.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhy were you camping there, anyway?\nLotta:\nI'm a research student at my university. I was taking pictures to use in my research.\nPhoenix:\n(What research? This all sounds suspicious...)\n\n\n\nPress further\n\n\n\n\n\n\n\nPhoenix:\nMs. Hart. Could you be more specific about your \"research\"?\nKarma:\n\nKarma:\nWhat does the witness's motive in camping by the lake have to do with this case!? The answer \"is nothing\"! I object to this line of questioning! Objection sustained!\nJudge:\nW-w-wait, now, I'm the one who says that!\nKarma:\nWell, then say it already!\nJudge:\nObjection sustained.\nPhoenix:\n(Thanks for nothing, Your Honor...)\nLeads back to cross-examination\n\n\n\n\nHold back\n\n\n\n\n\n\n\nPhoenix:\n(I think I'll let that one slide for now.)\nLeads back to cross-examinationLotta:\nI heard this \"bang\" come up from the lake.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo, you weren't looking at the lake at that time?\nLotta:\nNope. I looked after I heard that noise.\nKarma:\n\nKarma:\nShe's said that already! I asked you to find \"contradictions\"! Not leisurely chat with the witness!\nPhoenix:\n(Urk...)Lotta:\nWhen I looked out the window, I saw two gents in a boat.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nCould you clearly see the two men?\nLotta:\nJust look at the picture! Clear enough for you?\nPhoenix:\n(Uh oh...)\n\n\n\nPress further\n\n\n\n\n\n\n\nPhoenix:\nWait a second! I wasn't asking you about the photo! I was asking if YOU saw the two men!\nLotta:\nUh, yeah, well, of course...\nKarma:\n\nKarma:\nThe witness has testified that she saw them! There's also a photo! You'd best look elsewhere for your precious contradictions!\nPhoenix:\n(He jumped in quick... He's hiding something!)\nLeads back to cross-examination\n\n\n\n\nHold back\n\n\n\n\n\n\n\nPhoenix:\n(I think I'd best let that one slide...)\nLeads back to cross-examinationLotta:\nThen there was another \"bang\"...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWere you watching the very moment the shot rang out?\nLotta:\nWell, yeah, sure...\nKarma:\n\nKarma:\nYou're asking meaningless questions! Meaningless! \"Contradictions,\" Mr. Wright. Not meaningless babble!\nPhoenix:\n(von Karma, I think I hate you. He's trying to keep me from talking to the witness... To what end...?)Lotta:\nThere wasn't nary a thing on the lake but that boat.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAre you sure about that?\nLotta:\nYeah, sure as a country gal can be!\nPhoenix:\n(That sounds pretty sure.)\n\n\n\nPress further\n\n\n\n\n\n\n\nPhoenix:\nHow come you're so sure?\nLotta:\nWell, heck, I scanned the whole lake.\nPhoenix:\n(\"Scanned the whole lake\"? It almost sounds like she was more interested in the lake than the boat...) Ms. Hart... you--\nKarma:\n\nKarma:\nMr. Wright! The witness has answered the question in full.\nPhoenix:\nMmph!\nKarma:\nNo need for further questions! Objection sustained!\nJudge:\nU-uh, that's what I'm...\nKarma:\nSustained!\nJudge:\nY-yes, of course.\nPhoenix:\n(Oh great... What am I supposed to do now?)\nLeads back to cross-examination\n\n\n\n\nHold back\n\n\n\n\n\n\n\nPhoenix:\n(Lotta seems pretty sure of herself. I'd better not forge blindly ahead here. Still... this whole thing stinks.)\nLeads back to cross-examinationPhoenix:\n(Th-there weren't any contradictions in there!)Maya:\nSorry, Nick. If only my sister were here...Phoenix:\n(Maya's really taking this hard.)After selecting \"Press further\" upon pressing second, fourth, and sixth statements, and pressing fifth statement:Judge:\nEnough! I think we've heard all we need to hear, Mr. Wright. It seems you are unable to find a contradiction in the testimony worth noting.Phoenix:\nB-but, Your Honor!Karma:\nYou keep your promise!Judge:\nMr. Wright. I am afraid that I will have to penalize any further outbursts... By holding you in contempt of court!Karma:\nAnd if that happens, you'll have to leave the courtroom immediately! Understood...?Phoenix:\nUh... uh huh.Maya:\nNick...! Lotta's testimony is fishy, Nick! Real fishy!Phoenix:\nI... know what you mean. But... If I can't say anything, what can I do?Judge:\nI believe we've covered the evidence sufficiently to make a decision.Karma:\nThen, pass your judgment!Judge:\nVery well. Mr. Miles Edgeworth, please take the stand.???:Judge:\nWh-who was that!?Maya:\nIt... was me.Phoenix:\n(Maya!)Judge:\nI-is something wrong? D-do you need to use the facilities?Maya:\nNo, I do not! Lotta Hart! Your testimony stinks! It's unclear whether you were actually looking at the lake! It's highly doubtful that you actually say Mr. Edgeworth! Tell us the truth! This is a matter of life or death!Lotta:\n...!Maya:\nLotta! Did you really clearly see Mr. Edgeworth that night!? Did you see him fire that pistol!?Judge:\nYou will stand down! The court does not acknowledge the defense's outburst!Maya:\nAnswer me, Lotta!Lotta:\nWhat's the big idea, treating me like some kind of criminal!? I saw him! I swear it! I saw Edgeworth...Karma:Karma:\nEnough! Judge... Declare the defense in contempt of court!Judge:\nY-yes... yes, of course. I'm sorry, but you WERE warned. Guard! Escort Mr. Wright out of the courtroom! He is in contempt of court, and must leave.Phoenix:\n(No... No...!)Wait!Maya:\nI-I was the one who made the outburst, Your Honor! Nick is innocent!Karma:\nHah! What's the difference? All that remains is for the guilty verdict to be declared! Isn't that right, Mr. Phoenix Wright!?Wrong\n\n\n\n\n\n\n\nPhoenix:\nWrong!\nKarma:\nWhat!?\nLeads to:\n\"Did you hear what Ms. Hart just said?\"Right\n\n\n\n\n\n\n\nPhoenix:\n(Dammit, he's right...)\nMaya:\nN-Nick! There must be something we can do!\nPhoenix:\nI... don't think there is. The cross-examination is over already!\nMaya:\nB-but... but didn't Lotta just say she saw him? She did, Nick! She just said that she saw Mr. Edgeworth! She didn't say that in her testimony, did she?\nPhoenix:\n...! Y-you're right! Your Honor!\nLeads to:\n\"Did you hear what Ms. Hart just said?\"Phoenix:\nDid you hear what Ms. Hart just said? She said she clearly saw Mr. Edgeworth! That was not in the testimony! That changes her testimony, and I have a right to cross-examine her again!Judge:\nOrder! Order! Order! Order! Order! Order!Karma:\nYou're in contempt of court! It's too late for wild claims! Judge! Sustain my objection!Judge:\n... ... I'm sorry, Mr. von Karma, but I cannot.Karma:\nWhat!?Judge:\nMs. Lotta Hart has made a new testimony. The defense does have a right to cross-examine her again.Karma:\nB-but he is in contempt of court!Maya:\nNo, I am! If you're going to arrest someone, arrest me!Judge:\nHmm... Very well. Maya Fey! You will leave the courtroom immediately.Maya:\nNick! I did what I could... You have to do the rest! Good luck!Phoenix:\nM-Maya...!Karma:\nPeh! I care not for this melodrama! Listen well, Mr. Wright! I do not tolerate badgering of my witnesses!Phoenix:\n(I'm running out of time... I'd better find a contradiction in here or else...)Judge:\nMr. Wright! Begin your cross-examination!Cross Examination",
      "testimonies": [
        {
          "testimony": "I saw it clear as day. The man on the boat was Mr. Edgeworth!",
          "person": "Lotta",
          "present": [
            "Lake Photo"
          ],
          "source": {
            "evidence_span": "The fog is dense.",
            "testimony_span": "I saw it clear as day.",
            "explanation": "The witness could not have seen things clearly on the lake because of the fog.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "easy"
          }
        }
      ],
      "noPresent": false,
      "difficulty": "easy",
      "labels": [
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims she saw the man on the boat clear as day.",
        "Fact 2: The evidence suggests the fog on the lake is dense.",
        "Prop 1: If the fog is dense, one cannot see things clearly on the lake."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- That Last Statement --Lotta:\nI saw it clear as day. The man on the boat was Mr. Edgeworth!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWell, what about the other man?\nKarma:\n\nKarma:\nYou cannot expect to be allowed to blithely ignore your promise, Mr. Wright! I believe you claimed there was a contradiction in the witness's testimony! Well, find it! If you can!\nJudge:\nMr. Wright, I have to assign you a penalty.\nPhoenix:\n(Damn...!)Present Lake Photo\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Got you.\"Phoenix:\n(That's it...? Uh oh. I don't know if I can find anything in that... What will Maya say...?)Phoenix:\nGot you. Got you, Ms. Hart! Finally!Lotta:\nWh-what!? You got what?Phoenix:\nLook at this photograph.Lotta:\nThe photo I took...?Phoenix:\nThe very same. There's something I want you to see in this photo... it's quite clearly visible. The fog, Ms. Hart.Lotta:\nSo... so?Phoenix:\nThis picture was taken with professional, high quality film, correct? Yet even it could not capture the faces of the men on the boat! Yet you claim you saw Mr. Edgeworth! How!?Lotta:\nWhut!? Wha--!Judge:\nMr. Wright has a point!Karma:Karma:\nThat's why I told her not to say that in her testimony! Please!Phoenix:\nYet, now she has said it, Mr. von Karma. How could you possibly see Mr. Edgeworth!? Explain yourself!Judge:\nMs. Hart.Lotta:\nWhat!Judge:\nCould you see the defendant that night?Lotta:\nO-of course! I said I could and I meant I could!Judge:\nThen, please testify as to the circumstances of your sighting.Phoenix:\n(I did it! I finally found a hole in von Karma's carefully vague testimony!)Witness Testimony-- How Edgeworth Was Seen --Lotta:\nYer right. It was a cold night, and the fog was thick as grits.\nSo, once I was finished setting up my camera, I got back in the car.\nStill, I brought my binoculars with me.\nWhen I heard that noise out on the lake, I looked with my binoculars.\nSee? No problem!Judge:\nHmm...You used binoculars? Very well. You may begin your cross-examination, Mr. Wright.Phoenix:\n(This one'd better be good!)Cross Examination",
      "testimonies": [
        {
          "testimony": "Yer right. It was a cold night, and the mist was thick as grits.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "So, once I was finished setting up my camera, I got back in the car.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "Still, I brought my binoculars with me.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "The camera was set up to take pictures of a meteor shower.",
          "person": "Lotta",
          "present": [
            "Lotta's Camera",
            "Lake Photo"
          ],
          "source": {
            "evidence_span": "Faces the lake.",
            "testimony_span": "The camera was set up to take pictures of a meteor shower.",
            "explanation": "A camera to shoot the stars would not be pointing towards the lake.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "common sense"
          }
        },
        {
          "testimony": "When I heard that noise out on the lake, I looked with my binoculars.",
          "person": "Lotta",
          "present": []
        }
      ],
      "noPresent": false,
      "difficulty": "common sense",
      "labels": [
        "object property",
        "spacial"
      ],
      "reasoning": [
        "Fact 1: The witness claims the camera is for taking pictures of a meteor shower.",
        "Fact 2: The evidence suggests the camera is facing the lake.",
        "Prop 1: If one wants to take pictures of a meteor shower, the camera should be facing the sky."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- How Edgeworth Was Seen --Lotta:\nYer right. It was a cold night, and the mist was thick as grits.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo? How could you see Edgeworth!?\nLotta:\nNow, just hold your horses for a second! You hasty Yankee types'd never find a gal where I'm from.\nJudge:\nDefense attorneys have trouble with that as it is.\nPhoenix:\n(Nobody loves me...)Lotta:\nSo, once I was finished setting up my camera, I got back in the car.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYour \"camera\"...?\nLotta:\nYeah. It's got an automatic...\nKarma:\n\nKarma:\nThe issue we are concerned with here is Ms. Hart seeing Mr. Edgeworth! The camera has nothing to do with this at all!\nJudge:\nObjection sustained.\nPhoenix:\n(Argh! He's not letting her answer any of my questions!)Lotta:\nStill, I brought my binoculars with me.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n\"Binoculars\"?\nLotta:\nYeah, binoculars.\nPhoenix:\nYesterday, you mentioned that you were out looking for shooting stars, correct?\nLotta:\nWell... yeah.\nPhoenix:\nWouldn't you need a telescope, not binoculars, for that?\nLotta:\n...!\nPhoenix:\nI've got doubts about your camera, too! Was that really to take pictures of meteor showers?\nKarma:\n\nKarma:\nThe camera is irrelevant to this case!\nPhoenix:\nYou can't say that for certain!\nJudge:\nHmm... Mr. Wright. Is the camera really relevant to this case? If you believe it is, you may continue with this line of questioning.\nKarma:\nBut know this! If you find nothing with this, there will be consequences!\nJudge:\nWell, Mr. Wright? Do you wish to press further about the camera?\n\n\n\nPress further\n\n\n\n\n\n\n\nPhoenix:\n(This is make-it-or-break-it time!) The camera is of utmost importance, Your Honor. It is, perhaps, the key to this entire case! Therefore, I will continue my line of questioning! (Wow! Maybe I went a little overboard there...)\nJudge:\nVery well! Ms. Hart! You will testify to the court about the camera!\nLotta:\nYeah, yeah, I hear ya.\nChanges statement from \"Still, I brought my binoculars with me.\" to \"The camera was set up to take pictures of a meteor shower.\"\n\n\n\n\nHold back\n\n\n\n\n\n\n\nPhoenix:\nOkay, Your Honor... I withdraw my question. (I have to remember who I'm dealing with! I bet von Karma wants to trap me so he can put me in contempt! I think I'll hang back for now and see what happens.)\nKarma:\nHah!\nLeads back to cross-examinationLotta:\nThe camera was set up to take pictures of a meteor shower.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nMs. Hart. What made you choose that lake to photograph meteors? You know the fog gets thick on that lake. It's not very suited to stargazing.\nLotta:\nYeah, well... Y'see, I... I guess I wasn't thinking too straight! Har!\nKarma:\n\nKarma:\nMr. Wright! I will not have you badgering my witness because of her challenged intellect!\nLotta:\nNow wait a minute!\nKarma:\nContinue your testimony. You were saying how it was that you saw Edgeworth?\nLotta:\nGrr...\nKarma:\nNo unnecessary comments, please.Present Lotta's Camera\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou were photographing shooting stars? That's a lie!\nLotta:\nS-says who!?\nPhoenix:\nI saw the camera you set up yesterday. It was pointed directly at the lake! You have to point a camera upwards to take photos of the stars, Ms. Hart!\nLeads to:\n\"Ooof!\"Present Lake Photo\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou were photographing shooting stars? That's a lie!\nLotta:\nS-says who!?\nPhoenix:\nTake a look at this photograph. This was taken on an automatic setting, was it not?\nLotta:\nY-yeah, that's right.\nPhoenix:\nYou have to point a camera upwards to take photos of the stars, Ms. Hart! But, as this photograph clearly shows... The camera was pointed directly at the lake!\nLeads to:\n\"Ooof!\"Lotta:\nWhen I heard that noise out on the lake, I looked with my binoculars.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nIf there was a heavy fog, how would binoculars change that at all?\nLotta:\nWhat do you mean?\nPhoenix:\nEven binoculars can't see through fog! But... you say you clearly saw him?\nLotta:\nEr... I did... yeah.\nKarma:\nEnough! There is no room for doubt in her testimony!\nPhoenix:\n(Hmm. She sounded pretty doubtful to me! But... I have to find a clear contradiction first.)Phoenix:\n(I don't care how many von Karmic objections I get... I'm going to find a hole in this testimony if it's the last thing I do!)Lotta:\nOoof!Judge:\nMr. Wright! What are you driving at?Phoenix:\nThe witness was not at the lake to photograph shooting stars, Your Honor!Lotta:\n...!Judge:\nW-well then, what exactly was she photographing?Show evidence\n\n\n\n\n\n\n\nLeads to:\n\"Your Honor! Take a look at this...\"I don't know\n\n\n\n\n\n\n\nPhoenix:\nWell... that I don't know.\nKarma:\n\nKarma:\nWhat the witness takes photos of is entirely her business! This has nothing to do with the case! Not to mention that you can't even show us another reason why she might have been there. Mr. Wright... If you are out of material, I suggest we end this mockery of a cross-examination.\nPhoenix:\n(Uh oh... I can't let the trial end like this! I have to show them something!)\nLeads to:\n\"Your Honor! Take a look at this...\"Phoenix:\nYour Honor! Take a look at this... What was Ms. Hart trying to photograph at the lake?Present Gourdy Article\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Ms. Hart.\"Present anything else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWell, Your Honor? What do you think?\nJudge:\nI... think I'm confused.\nKarma:\nWrong again, Mr. Wright. So very wrong. You can't get through this one with your weak bluffs!\nPhoenix:\nY-Your Honor! Enough playing around! Here's the real evidence!\nJudge:\n\"Enough playing around\" is my line, Mr. Wright!\nPhoenix:\nUh...\nLeads back to:\n\"What was Ms. Hart trying to photograph at the lake?\"Phoenix:\nMs. Hart. This is what you were trying to photograph!Judge:\nWhat's this? A newspaper article? \"Gourdy\"...? Ah, the sighting at Gourd Lake...Phoenix:\nWell, Ms. Hart?Lotta:\nI... I never heard of no lake monster! You got proof or something? Let's see you prove that I was down at the lake trying to photograph this \"Gourdy.\"I don't have proof\n\n\n\n\n\n\n\nPhoenix:\nWell, I don't have proof...\nKarma:\n\nKarma:\nBah! Your ineptitude is entertaining, Mr. Wright, but enough is enough! I've had enough of baseless claims made without a hair of evidence to support them!\nPhoenix:\n\nPhoenix:\nWell all right, if that's how you want to play... I'll show you evidence!\nJudge:\nMr. Wright! Are you sure about this?\nPhoenix:\n(I'm sure sick of that smarmy prosecutor putting me down! Or... did he taunt me so I'd get mad and make a mistake?)\nLeads to:\n\"Very well, let's see it.\"I have proof\n\n\n\n\n\n\n\nPhoenix:\nI have it! Proof!\nJudge:\nHmm... Intriguing!\nLeads to:\n\"Very well, let's see it.\"Judge:\nVery well, let's see it. And... no joking around this time, please. Here is proof that the witness was trying to photograph Gourdy, the lake monster!Present Lotta's Camera\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe proof, Ms. Hart, is your own camera!\nLotta:\n...!\nPhoenix:\nYou camera was set to take photos in response to loud noises, correct? Thus this photograph here, taken when a gun fired on the lake.\nLotta:\n...\nPhoenix:\nAnd here, this article about \"Gourdy.\" According to this article... Gourdy made a loud noise when it emerged! Well? You were trying to photograph Gourdy, weren't you! That's why you had set your camera to respond to loud noises!\nLeads to:\n\"Order! Order!\"Present Gourdy Article\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe proof is this article about Gourdy the lake monster!\nLotta:\n...!\nPhoenix:\nAccording to this article... When Gourdy breaks through the water, it makes a loud noise! Which is why you set up your camera with that microphone! You had it set to respond to loud noises! And that's how you got this picture when the pistol fired!\nLeads to:\n\"Order! Order!\"Present anything else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHere's my proof! It's simple!\nJudge:\n... If it's simple... then why have you obviously made an error, Mr. Wright?\nPhoenix:\nUrk...?\nLotta:\nWhat's that!?\nKarma:\nGo home. Consider a career change.\nPhoenix:\n(Gah! How can they so casually toss aside this eviden... Oh. Whoops. Wrong evidence.)\nJudge:\nLuckily for you, I'm in a patient mood, Mr. Wright. One more time please.\nLeads back to:\n\"Here is proof that the witness was trying to photograph Gourdy, the lake monster!\"Judge:\nOrder! Order! I see... I, too, thought it was a little strange.Phoenix:\n(Yeah, sure!) Well, Ms. Hart? You were camping there to try and take a photo of Gourdy, weren't you?Lotta:\n... Yeah. Not bad. Are all you lawyers that smart? So, smart boy, I was down there trying to photograph Gourdy, you got me. So what?Phoenix:\nHuh...?Lotta:\nThat don't change what I saw, does it?Karma:\nExactly! What you just used several precious minutes of our time to prove... is nothing more than that the witness is an idiot who thinks monsters exist!Lotta:\nH-hey!Karma:\nBut, as she so succinctly said, so what!? It changes nothing!Phoenix:\n(Not true! You were hiding the whole thing about Gourdy for some reason, I know it! But what could it have been...? Whatever it is, I'm getting to the bottom of this!)Judge:\nMs. Hart. Why did you hide the fact that you were searching for Gourdy from the court? Please revise your testimony.Lotta:\n... Right. Fine, I'll testify. It won't change nothing, though.Phoenix:\n(Something will change... it has to! And I'm going to spot it!)Karma:\n...Witness Testimony-- Lotta's New Testimony --Lotta:\nActually, I'm not a research student at a university.\nI'm an investigative photographer.\nImagine what a scoop it'd be if I got a picture of that monster!\nThat's why I was camping out by the lake.\nBut, that's all I was hiding.\nWhen I heard the \"bang\" I looked right straight out at that lake.\nThere wasn't much else to look at, so I just watched that boat the whole time.\nThen I saw a flash, near one of the men's hands, and I heard another gunshot.\nI was looking right at that boat, the whole time, cross my heart and hope to fry.Judge:\nHmm... Well, Mr. Wright. You may cross-examine the witness.Karma:Karma:\nThe witness's testimony is unchanged from before! Whether she is a research student or a photographer has no bearing on this case! There is no need to waste more of our time with another pointless cross-examination!Judge:\nEr... hmm.Phoenix:Phoenix:\nI claim the defense's right to cross-examine the witness, Your Honor! (von Karma's up to something, I know it! He doesn't want me to cross-examine her because... why? Was there a contradiction?)Judge:\nVery well. You may begin the cross-examination. You seem sure of yourself, you must have something in mind.Karma:\nHah! That would be a first!Phoenix:\n(Hah hah, very funny.)Judge:\nYou understand that this is your last chance at a cross-examination, Mr. Wright? If there is no problem with the testimony this time, we will let the witness leave. I will announce my verdict at that time, Mr. Wright. Understood?Phoenix:\nYes, Your Honor.Cross Examination",
      "testimonies": [
        {
          "testimony": "Actually, I'm not a research student at a university.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "I'm an investigative photographer.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "Imagine what a scoop it'd be if I got a picture of that monster!",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "That's why I was camping out by the lake.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "But, that's all I was hiding.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "When I heard the \"bang\" I looked right straight out at that lake.",
          "person": "Lotta",
          "present": [
            "Gourdy Article"
          ],
          "source": {
            "evidence_span": "Article about a monster sighted at Gourd Lake.",
            "testimony_span": "N/A",
            "explanation": "The witness was at the lake for the monster sighting, so they did have specific things to look for.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "medium"
          }
        },
        {
          "testimony": "There wasn't much else to look at, so I just watched that boat the whole time.",
          "person": "Lotta",
          "present": [
            "Gourdy Article"
          ],
          "source": {
            "evidence_span": "Article about a monster sighted at Gourd Lake.",
            "testimony_span": "There wasn't much else to look at",
            "explanation": "The witness was at the lake for the monster sighting, so they did have specific things to look for.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "medium"
          }
        },
        {
          "testimony": "Then I saw a flash, near one of the men's hands, and I heard another gunshot.",
          "person": "Lotta",
          "present": [
            "Gourdy Article"
          ],
          "source": {
            "evidence_span": "Article about a monster sighted at Gourd Lake.",
            "testimony_span": "N/A",
            "explanation": "The witness was at the lake for the monster sighting, so they did have specific things to look for.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "medium"
          }
        }
      ],
      "noPresent": false,
      "difficulty": "medium",
      "labels": [
        "behavior"
      ],
      "reasoning": [
        "Fact 1: The witness claims she has not much to look at on the lake.",
        "Fact 2: The evidence suggests the witness was at the lake for the monster sighting.",
        "Prop 1: If someone is interested in sighting of a mythical beast, they would have specific things to look for."
      ]
    }
  ]
}