{
  "previousContext": "Turnabout GoodbyesTranscriptPart 1Part 2Part 3Part 4Part 5Part 6Episode 4Turnabout GoodbyesIt's been, what, 15 years?About that, yes.15 years is a long time to wait... You can't imagine how much I've suffered...You... suffered?And now... the perfect opportunity presents itself. At last... I shall have my revenge!What!?...Merry Christmas.December 25, 10:08 AMWright & Co. Law OfficesMaya:Hey, hey, Nick! Do you know if there's any good waterfalls around here?Phoenix:Waterfalls...? Dare I ask why?Maya:Duh, Nick! Isn't it obvious? I need a waterfall to stand under! Preferably a freezing one!Phoenix:... Oh... Is that part of your spirit medium training?Maya:Of course! Except, I've been slacking off lately... I need to brave the elements and be forged anew under the rushing spring waters!Phoenix:Umm... Okay... I don't know about any falls per se, but Gourd Lake is pretty close...Maya:Oh. Darn.Phoenix:Sorry, but them's the breaks. Couldn't you just take a cold shower or something?Maya:... Good idea!Phoenix:(So much for the rushing spring waters...)TV:Next in the news... A large, unidentified animal was sighted at Gourd Lake! The town is buzzing with excitement! Locals are calling it \"Gourdy\" in a tip of the hat to Nessie, the Loch Ness monster. Though its namesake, Nessie, proved to be a hoax... locals are confident their Gourdy is the real deal. ...Phoenix:*yawn* Bor-ing. Can't they show real news for a change?Maya:Nick?Phoenix:?Maya:The water pressure's kind of low in that shower.Phoenix:... You want more pressure, huh? Why don't you go down to the fire department and have them spray you with the hose?Maya:... Good idea, Nick!Phoenix:(Apparently, Fey blood is no aid in detecting sarcasm...) (Changed from [Apparently, E.S.P. is no aid in detecting sarcasm...] in the original release)TV:We interrupt this program to bring you a special news bulletin! Strange occurrences continue at Gourd Lake... But this time, it's murder!Phoenix:(Gourd Lake again?)TV:The body of a man was found in the lake early this morning. A suspect was apprehended. Sources inside the police department revealed... that the suspect's name is Miles Edgeworth, age 24. Edgeworth was an up-and-coming prosecution attorney, known for his skill and connections. He was guaranteed a long and rewarding career... Has he thrown it all away?Phoenix:(...? E-Edgeworth!?) What's going on!? Edgeworth would never do something like--Maya:Nick?Phoenix:Yipes! M-Maya!Maya:The fireman yelled at me when I called him.Phoenix:We've got bigger things to worry about than that! They arrested Edgeworth!Maya:What? You mean, the prosecutor?Phoenix:Yeah, he's a suspect... in a murder!Maya:Whaaaaat!? When? Where? Whom? Why? How?Phoenix:I-I don't know!Maya:Let's go find out, Nick!ExamineBookshelfPhoenix:Difficult-looking legal books stand in a formidable row. They mock me. I tried reading one, and it made my head hurt. When I closed it, it slipped out of my hand. Then my foot hurt too.Charley the plantPhoenix:Mia's favorite plant. Its name is \"Charley.\" Maya's gotten the knack of watering it lately. Charley's been perking up these days.DeskPhoenix:Mia's desk. If we had more clients, I would probably sit here more often. Lately, I've been spending more time on the couch, watching TV.Movie posterPhoenix:Maya brought in a poster of the Steel Samurai the other day. We had a big fight over whether to put it up or not. I know she's just waiting for a chance to sneak it up on the wall.WindowPhoenix:Looks like it's cleaning day again at the hotel across the way. I hear they're planning a second branch outside the city. I can see the bellboy, getting the angle of that screwdriver in the drawer just right.TalkWhat to doPhoenix:Well, what should we do?Maya:What do you mean!? Let's investigate! We should talk to Mr. Edgeworth, and check out the crime scene!Phoenix:(You're right... We need more information! Save aimlessness and confusion for later!)Any ideasPhoenix:Well? Got any good ideas?Maya:Not really. I do my best thinking when I'm standing underneath a waterfall.PresentAttorney's BadgePhoenix:You know, I think it's developing a nice luster.Maya:I'll look at your badge later, Nick. We've got work to do!Phoenix:(I suppose you're right...)December 25Detention CenterVisitor's RoomMaya:You know, Nick... We've all been in here one time or another, haven't we?Phoenix:I guess it comes with the territory.Maya:I'm not sure it's something we should mention to too many people... Aah!Phoenix:... Hey! Edgeworth! Come back!Edgeworth:What are you doing here!?Maya:Nick, I don't think he's in a very good mood.Phoenix:Well, he is in detention. Were you in a good mood when you were here?Edgeworth:So, you've come to laugh at the fallen attorney? Then laugh, laugh! Well? Why aren't you laughing?Maya:Nick... Should we be laughing?Phoenix:Nah. It's a trick. Laugh and he'll get mad... or burst into tears. Edgeworth. We don't have so much free time we can spend it coming down here to laugh at you.Edgeworth:... Yes you do.Phoenix:(Actually, he's right.)Edgeworth:... I hoped you wouldn't come. I didn't want you to see me. Not like this.Phoenix:(I didn't want to see you like this, either. Believe me.) (Changed from [Hey, I didn't want to see you either, believe me.] in the original release)ExamineSurveillance cameraPhoenix:Smile for the camera...Security guardPhoenix:This guard monitors the visitor's room. He hasn't moved an inch since I came in. A real pro. Or maybe he's just nervous with Edgeworth in the room.TalkWhat happenedPhoenix:Edgeworth. Tell me what happened.Edgeworth:... Why should I? What are you going to do about it?Maya:Duh! We're going to help you, that's what!Edgeworth:...! ... Help me? You? Don't be ridiculous.Phoenix:Sorry...?Edgeworth:You're a novice! You've only been in three trials!Phoenix:H-hey!Edgeworth:Sure, you got lucky and won all three... But your luck's bound to run out some day! You need real skill, Wright. Experience!Phoenix:...Maya:Nick! He's insulting you! Nick? Why am I always the one who has to get angry!?Gourd LakePhoenix:The murder took place at Gourd Lake, correct?Edgeworth:Yes... late last night.Phoenix:The lake is a long way away from your offices and the court... Why were you down there?Edgeworth:... I see no need to tell you.Maya:M-Mr. Edgeworth! You... you didn't really...?Edgeworth:... Gourdy.Maya:Huh?Edgeworth:I went to see Gourdy.Maya:\"Gourdy\"? What's that!?Phoenix:I'll... tell you later. (Why won't Edgeworth talk to us?)Did you do it (appears after \"What happened\", \"Gourd Lake\", and presenting Attorney's Badge)Phoenix:Edgeworth... this is really hard for me to ask... But... you didn't do it, right? Right?Edgeworth:... Think what you will. I have only one request.Phoenix:Huh?Edgeworth:Stay out of this case.Maya:Why!? B-but Nick is trying to help you!Edgeworth:I know...! I know that! But I don't want your help, okay?Maya:!!! Why not?Edgeworth:... Look, just go away, and leave me alone!Maya:Nick... Mr. Edgeworth did it, didn't he.Phoenix:Maya! Let's go investigate elsewhere.Maya:But, Nick...PresentAttorney's BadgeEdgeworth:Your attorney's badge...?Phoenix:Edgeworth. Let me defend you.Edgeworth:... Hah! Hah hah! Good one, Wright. But I'm not that hard up. Not yet.Maya:Wh-what do you mean by that?Edgeworth:Me? Trust a wet-behind-the-ears lawyer with only three trials under his belt? Never!Maya:Wh-what!?Edgeworth:My case is near hopeless, Wright. Every defense attorney I've talked to has turned me down.Phoenix:What?Edgeworth:Simply put, they were afraid they'd lose. It occurred to me that it might be my fault that they lack confidence. After all, I did get every single one of their clients declared \"guilty.\"Phoenix:I don't believe it!Edgeworth:Regardless, I don't want you involved in this. You in particular I cannot ask to do this.December 25Gourd Lake ParkEntranceMaya:This is where it happened?Phoenix:Yeah. Gourd Lake is in the middle of this park.Maya:I can see some police walking around in there.Phoenix:Questioning people, probably.Maya:Hey! Isn't that Detective Gumshoe over there?Gumshoe:Well, pal!? There's enough of us here! Anyone found anything?Police:S-sorry, sir... Nothing.Gumshoe:Idiot! The trial's tomorrow! We need clues, on the double!Police:B-but, sir... There weren't any clues... that's why we arrested that attorney, Mr. Edgeworth! It's clear, sir. He's the one who--Gumshoe:Shaddup! Just you try saying that again! I'll... I'll... I'll make you sorry if you do! (Changed from [I'll... er... I'll make you sorry if you do!] in the original release) So just... just, get outta my face, pal! (Changed from [I mean... just, get outta my face, pal!] in the original release)Police:Y-yes, sir!Maya:Detective Gumshoe's kinda scary today!Gumshoe:Recruits... peh! ... Aah!Maya:Eek!Gumshoe:Hey, you're that Harry guy! Harry Butz!Phoenix:Wright! Phoenix Wright! (Will he ever learn my name!?)Gumshoe:And just what are you doing here, pal? Investigating!?Phoenix:Huh? Um, well, yes. I suppose.Gumshoe:Well, I'm here to help! Ask me anything you want! Bring it!Maya:He seems different than usual. I wonder what's up? Umm... Mr. Edgeworth hasn't actually asked us to defend him yet...Gumshoe:Huh!? Oh? Y-you don't say...ExamineTreesPhoenix:I feel winter's chill from the bare leaf trees today... *sigh* What is it about winter that turns people into poets?Maya:I don't know, but my toes are starting to feel numb.Phoenix:(Yes... my poetry has that effect on some people.)SignPhoenix:The sign says \"Gourd Lake Nature Park.\" This place is full of families picnicking on the weekend.Maya:But... no waterfall.Phoenix:Not many picnickers come here for spiritual training, Maya.TalkWhat happenedPhoenix:Detective Gumshoe? Do you know what happened here?Gumshoe:Huh? You don't know, pal?Phoenix:No...Gumshoe:Wow, okay, Mr. Head-in-the-fluffy-pink-clouds Lawyer.Phoenix:Head-in-the... huh?Gumshoe:Never mind, I'll tell you. It happened last night, about 15 minutes after midnight. There was a boat out on Gourd Lake. In that boat were two men. One of those men shot the other with a pistol.Maya:And... the shooter was Mr. Edgeworth?Gumshoe:A cop who arrived on the scene arrested him.Maya:How did they get there so fast? (Changed from [How did he get there so fast?] in the original release)Gumshoe:Well... There was a witness. When the report came in, we raced to the lake.Phoenix:A witness?EdgeworthMaya:You don't think Mr. Edgeworth is a... murderer, do you!? (Changed from [You don't think Mr. Edgeworth is a... murderer!?] in the original release)Gumshoe:Absolutely not! It's impossible! I don't care if there's a witness either! I don't believe a lick of it!Maya:R-right! Who cares what the witness says!Phoenix:(I care!)Maya:... You really believe in him, don't you, Detective?Gumshoe:Course I do! But... the police are pretty sure he's the killer. Nobody's even really taking this investigation that seriously.Maya:Oh no!Gumshoe:After all the help Mr. Edgeworth has been to us... Hard to imagine that no one's standing up to take his side.Maya:Well, at least you are, Detective. At least you are.Defense requestMaya:Do you know who will be Mr. Edgeworth's defense attorney in tomorrow's trial?Gumshoe:He hasn't got one yet.Maya:What? The trial IS tomorrow, isn't it?Gumshoe:Well, I don't know the whole story... But apparently no one he's been talking to will take his case.Maya:W-why not?Gumshoe:Mr. Edgeworth won't tell me! When you guys showed up, I figured he'd asked you to defend him.Phoenix:U-unfortunately not...Gumshoe:Well, pal, then you got a job to do! Help out Mr. Edgeworth! Prove that badge you wear isn't just some fancy piece of metal! Prove it to me, pal! Show me you're an attorney!Defense request (after presenting Attorney's Badge in Detention Center - Visitor's Room)Maya:I-is it true? No one will take Mr. Edgeworth's case?Gumshoe:Yeah... He's a bit of a celebrity. If you defended him, and lost, your reputation'd be sure to suffer. What's more... The case against him is... well, it's pretty solid.Phoenix:(I suppose it would be if they have a witness.)Gumshoe:Hey! Pal! Don't tell me your going to turn your back on him too!? Remember the Steel Samurai case? (Changed from [Remember the Steel Samurai!] in the original release) Mr. Edgeworth helped you get your client declared innocent!Phoenix:I... I know. I went to Edgeworth. I tried. He really doesn't want us to represent him. Especially not us, he said.Gumshoe:What!? W-well, that doesn't make any sense, pal! You should have heard him talking about you after that trial! (Changed from [You should have heard him talking about you after the Steel Samurai case!] in the original release) He kept saying \"Wright, Wright, Wright,\" over and over.Maya:... Nick? I'm not sure that's a good sign.Phoenix:Neither am I...Gumshoe:Why wouldn't he want your help? I don't get it.The witness (appears after \"What happened\")Phoenix:Who was this witness?Gumshoe:Er, sorry, pal. That's confidential. Anyway, the witness saw everything, apparently. I'm sure they'll turn up at the trial tomorrow.Phoenix:Was there only that one witness?Gumshoe:Yep. It was pretty cold out on the lake last night. And, it was Christmas Eve after all. Still, we're being thorough. You never know when you're going to turn up another witness. That's why we're here today, checking things out. So far, we're coming up empty...Maya:Oh! It's Christmas today! I'd forgotten. What are you getting me for Christmas, Nick?Phoenix:Talk to Santa.PresentAttorney's BadgeGumshoe:That badge! You're showing that to the wrong guy, pal! You gotta show that to someone who needs it!After clearing all Talk options:Police:Detective Gumshoe, sir!Gumshoe:What? Find something!?Police:Um, no, sir. Not yet. But there was a call from the precinct. They want to hold an investigation briefing...Gumshoe:A briefing? Right! I'm off! Oh... Sorry, pal. I guess you heard. I gotta go. Any last things you want to ask me about before I head back?The autopsy reportMaya:Well, yes. Do you have any information on the victim...?Gumshoe:Sorry... They haven't worked up the autopsy report yet. I'm still waiting for it myself. Actually... Say, if you get the time, drop by the precinct! We can talk more there, pal!Leads to:\"You're not coming back, Detective?\"How to get in touch with youLeads to:\"You're not coming back, Detective?\"Phoenix:You're not coming back, Detective?Gumshoe:Erm... Probably not, pal.Phoenix:So, what should we do if we have something to talk to you about...?Gumshoe:Ah, right. Here, I'll show you how to get to the precinct. Come down and see me anytime.Detective Gumshoe gave you directions to the police station.Phoenix:Oh, hey! Detective Gumshoe!Gumshoe:W-what!?Phoenix:Um, we'd like to take a look around in the park. Can we walk around?Gumshoe:Yeah! No problem, pal. You got my permission.Maya:You know, Nick. I think there's something to be said for talking to people when they're busy.Phoenix:Yeah. They don't have time to think about not giving you information...Maya:Right! Now, let's get investigating!December 25Police DepartmentCriminal AffairsMaya:... Looks like Detective Gumshoe isn't here.Chief:Something wrong, miss? Hmm? Turning yourself in? Okay, what did you do? Shoplifting? Larceny? Public indecency...?Maya:N-no! None of those things! We're looking for Detective Gumshoe... is he around?Chief:Gumshoe? Oh yeah. He's in a meeting right now. I don't think he'll be out any time soon.Maya:Okay, we'll come back.Chief:You do that. Oh, and go straight home and stay out of trouble. No more shoplifting, you got that?Maya:... Do I look like a criminal or something?ExaminePosterPhoenix:A poster of a female police officer... Wait, no. That's the latest \"Babes in Uniform\" calendar. My bad.DetectivePhoenix:That must be one of the detectives. He's mumbling something to himself.Police:\"...your mama could see you know she'd be crying'... ...a break and spit it out, you lowlife scumbag...\"Phoenix:... He must be doing image training for interrogations.DeskPhoenix:These are the detectives' desks. There are computers and files on each one. Funny, they're a lot tidier than I'd expect. I guess the detectives don't spend a lot of time at their desks.Blue BadgerPhoenix:Hey, is that the police department's mascot...?Chief:That's the \"Blue Badger\"! It was my idea! I made it! It's my mascot!Phoenix:I... see. How nice.Chief:I'll get him assigned mascot of the Criminal Affairs Dept. if it's the last thing I do!Phoenix:Um, good luck!ChiefPhoenix:This must be the chief of the detectives here. He's glued to his computer screen.Chief:Wha...!? \"Gourd Lake...!\" \"Gourdy sighted\"!!! I don't believe it!Phoenix:(Shouldn't you be reading something more important...?)December 25Gourd LakePublic BeachMaya:Wowsers! This is \"Gourd Lake\"?Phoenix:Yup. I'm not sure it warrants a \"wowsers,\" though.Maya:Hmm. Probably not. But hey, look at that snack stand!Phoenix:\"Samurai Dogs\"...?Maya:I wanna Samurai Dog! Please! I bet they're great!Phoenix:With a name like Samurai Dog, how could they not be?Maya:They're a little behind the times, though. The kids are all into \"The Pink Princess\" now. I mean, like, y'know!?Phoenix:(Nope.)ExamineLakeMaya:Wow. Gourd Lake is really big.Phoenix:Yeah.Maya:Say, Nick. Why is it called \"Gourd Lake\"?Phoenix:Oh. Well, a long time ago, they used to grow gourds here.Maya:Whoa! No way! I was sure it was because the lake looked like a gourd when viewed from above! You know, like an hourglass shape?Phoenix:Well, it is shaped like a gourd, actually. But that's just a coincidence.Maya:Oh. Okay.Trash canPhoenix:The trashcan is empty. At least the place is well maintained.BenchPhoenix:A lineup of plastic benches. I guess the idea is you buy a dog and eat it here. I doubt anyone would sit here and eat on a day like this. Except maybe Maya... if she had a Samurai Dog.SignPhoenix:Huh... I almost didn't see that signpost. \"Left - Boat docks\" \"Right - Exit\"Vendor standPhoenix:A hotdog stand. It's closed... The Christmas fringe looks a little half-baked. The banner reads \"Samurai Dogs\"... Somebody needs to redecorate.PopperMaya:Huh. Someone left some poppers here. You know, you pull the string... (Changed from [Huh. Someone left one of those poppers here. You know, you pull the string...] in the original release)Phoenix:...And it goes \"pop.\" Yeah, I know the ones. You see them a lot around New Year's.Maya:Hey, Nick! They might be a clue! (Changed from [Hey, Nick! It might be a clue!] in the original release) Let's take them. (Changed from [Let's take it.] in the original release)Phoenix:C'mon, admit it. You just want to pop them, right? (Changed from [C'mon, admit it. You just want to pop it, right?] in the original release)Maya:Was it that obvious?Phoenix:(Poppers... hmm.) (Changed from [A popper... hmm.] in the original release)Take them (Changed from [Take it] in the original release)Phoenix:I suppose it couldn't hurt. Huh? Where'd they go? (Changed from [Huh? Where'd it go?] in the original release)Maya:Into my pocket. (Changed from [I already put it in my pocket.] in the original release)Poppers put in pocket. (Changed from [Popper put in pocket.] in the original release)Leads back to examinationLeave them (Changed from [Leave it] in the original release)Phoenix:Nah, let's leave them. (Changed from [Nah, let's leave it.] in the original release)Maya:Aww, listen to your inner child a little, Nick!Phoenix:(Maybe if you outer child would be quiet for just a moment, Maya!)Leads back to examinationWright & Co. Law OfficesPresentAnything elseMaya:Nick! If we don't hurry Mr. Edgeworth will get the death sentence!!!Phoenix:Whoa! O-okay! Let's go check things out.Detention CenterPresentAnything elseEdgeworth:What's that? I'm not in the mood for idle banter, Wright.December 25Boat Rental ShopMaya:Nick... what is this place?Phoenix:A boat rental shop. Closed for Christmas it seems. I guess a murder taking place on one of the boats won't be good for business, either.Maya:Boats... I've never ridden on a boat.Phoenix:Really? Well, how about we go out on one when the trial is finished?Maya:Hey, good idea! You bet!ExamineTreesPhoenix:There's more forest off that way. I doubt I'd find any helpful clues in there.ShopPhoenix:A small boat rental shop. Doesn't look like anyone is around. They're probably closed because it's Christmas.BoatsPhoenix:There are some boats floating at the dock. Was one of these boats used in the murder, I wonder?Maya:Nick?Phoenix:Huh?Maya:I changed my mind. I don't really want to go for a boat ride.December 25Gourd Lake WoodsMaya:I like it here, Nick. Look... someone's camping!Phoenix:They've got guts, camping at the scene of a murder.Maya:Hey, hey, Nick! If they were camping here last night, they might know about the murder!Phoenix:(That's true...) Good call, Maya. Let's go talk to them.ExamineCameraMaya:Hey, Nick. Check out this camera!Phoenix:Yeah... what's with the big mic and that box on top, I wonder? It looks like some sort of automatic system for taking a photo when a noise is heard.Maya:Wow! Hey, let's see if it works! *cough* \"Hi, I'm Nick!\" ... Maybe I'm not saying it loud enough. \"YO! I'M NICK!!!\" ... Huh. NIIIIIIIIII......IIIIIIIIIICK!Phoenix:Will you stop that?Maya:I think it's broken, Nick.Phoenix:D-don't kick it! (It must not be set up to respond to voices.)Camera (after Popper is added to the Court Record)Leads to:\"This camera has a mic and some sort of attachment.\"TreesPhoenix:The trees grow quite thick here. Further back, the trees fade into the shadow where the sunlight can't reach them.SignPhoenix:The sign says \"No Camping.\" Funny place to pick to pitch your tent.Maya:Wait, what if the sign said \"No Setting Tents on Fire\"?Phoenix:... I don't think they have signs like that.Maya:Oh...SheetPhoenix:There's food and some magazines on the sheet. It takes a pretty tough skin to camp in this cold.CampfireMaya:Hey, Nick!Phoenix:What, don't tell me you're hungry again?Maya:No, no. I was just wondering, why are camping pots and pans made of aluminum?Phoenix:... They didn't talk about that in any of the law books.Maya:So, there's no law saying they have to be made out of aluminum, then!Phoenix:(I'm not having this conversation...)SUVPhoenix:This SUV has seen better days. It's dented all over. I can't believe anyone would drive their car down here.Phoenix:This camera has a mic and some sort of attachment. It must take pictures when triggered by a noise.Maya:Wow! Cool! Let's try it out! *cough* \"Hi, I'm Nick!\" ... Maybe I'm not saying it loud enough. \"HEY! I'M NICK!!!\" ... Huh. NIIIIIIIIII......IIIIIIIIIICK!Phoenix:Will you stop that?Maya:Maybe it's broken?Phoenix:D-don't kick it! Maybe it isn't set up to respond to voices?Maya:Well what then? These things? (Changed from [Well what then? I know!] in the original release)Phoenix:The party poppers...? (Changed from [The party popper...?] in the original release)*BANG*klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klikMaya:... Well. It responded. (Changed from [... Yep. It responded.] in the original release)???:Yaaaaaaaaaaaaaaw! Hey, you! Git yer hands offa' that!Maya:Eek!???:What in the Sam Hill...!? Look what ya done now! There goes a whole roll of film!Maya:Ah? Wha... huh? S-sorry!???:Sorry's nice but it don't pay my bills! Y'all know how much a roll of that film costs!?Maya:I-I'll pay you back!???:What were ya'll thinkin' settin' off a party-popper in a place like this?Maya:Uh... well...???:What! Don't try to play stupid with me just 'cause you think I'm some country bumpkin! Yeah, I know how y'all Yanks think! \"I say, those southern folks talk with that exaggerated drawl, why they must be dumb!\" Well let me tell you, just because I might be dumb don't mean we all are!Maya:N-Nick, help!???:And who are you, now? Her chaperone?Phoenix:Yeah, uh, no, rather, uhh... we're sort of... friends????:Jus' figure out what y'all are gonna say and say it for bejeezum's sake! Gawd, I'd rather sit through one of papa's drawls than listen to you stutter all day.Phoenix:(Oh boy... I guess we should pay her for the film...)???:Watch it!Phoenix:Yes ma'am. (On second thought, I'll pay later...)Maya:I'm really sorry!ExamineCameraPhoenix:This camera is rigged to respond to noise. But it only responds to loud noises... like a party popper.TalkAny optionPhoenix:Ummm...???:What!? Can't ya see I'm changin' the film on my camera here! Someone--I'm not namin' any names--but someone used up a WHOLE ROLL.Maya:Sorry...Phoenix:(That didn't work... I wonder if I have anything to show her that would get her attention...)PresentAttorney's BadgeLeads to:\"I, er, this is my badge.\"Phoenix:I, er, this is my badge.???:Huh? Aren't badges supposed t' be all shiny and impressive? You a cop or something?Phoenix:Umm... I'm a lawyer.???:Wh-what!? Y'all ain't gonna try and pull one o' them lawsuits on me over that film now? Cause I'll have you know I'm a fighter and I wrassled meaner looking' things'n you!Phoenix:N-no, that's not it at all. We're here investigating a murder that took place here, on the lake.???:A murder...? ... Sounds cool! Why didn't y'all say that in the first place! Go ahead, ask me anything ya like!Phoenix:(Finally! Some cooperation!)???:You too. Y'all can come out of hiding now. I won't bite. Hard.Phoenix:(Come to think of it, where did Maya get to?)Maya:S-sorry... I-I was feeling a little overwhelmed. The culture gap and all...???:Never you mind, honey. I kin' talk Yank for ya if... ahem... if it pleases you?Maya:Th-thanks. I think I'll be okay.Lotta:Great then! I'm Lotta, Lotta Hart, but y'all can call me Lotta! I'm here photographing meteor showers for a research project. Mighty pleased ta meet ya!TalkWhat happenedLotta:Oh yeah, when was that murder, anyway? I ain't seen much television lately.Phoenix:It happened late in the night on Christmas Eve.Lotta:That so? Christmas Eve?Phoenix:A man on a boat was shot... Did you see anything?Lotta:Well, lemme see. A boat, ya say? I reckon I mighta seen one... not sure though. Y'all gotta remember I've been watching this here lake for a good three days now. I seen enough boats to choke a mule. Kinda hard to remember which I seen when.LottaMaya:So, what is it you do, Lotta?Lotta:Huh? Me? Hah hah. Y'all don't really want to know that, do ya? Actually, I'm a research student at Country U., right in the heart of the heartland.Maya:Wow! Neat! Nick! She's a research student at a university! Country U.!Phoenix:Uh... so I hear.Maya:So, when did you come up here?Lotta:Hmm, lemme see... I guess it was 'bout three days ago.Phoenix:What are you photographing?Lotta:D-didn't I tell y'all that already? Meteors! Yep, meteor showers!Phoenix:(Falling stars...?)The camera (appears after \"What happened\")Maya:That's quite a camera you have there.Lotta:Y'all better know it! It's German-made. A genuine Solingen!Phoenix:(Isn't that where they make knives...?)Maya:Umm... So, what's that device you have stuck to the camera?Lotta:Huh? Device?Maya:It started moving all by itself when I fired my party popper...Lotta:Oh that? That triggers the shutter whenever it detects certain sounds. It's programmed to pick up loud noises right now.Maya:A programmable camera! Neat!Lotta's Camera added to the Court Record.The camera (subsequent times)Maya:That's quite a camera you have there.Lotta:Y'all better know it! It's German-made. A genuine Solingen!Phoenix:(Isn't that where they make knives...?)Maya:Umm... So, what's that device you have stuck to the camera?Lotta:Huh? Device?Maya:It started moving all by itself when I fired my party popper...Lotta:Oh that? That triggers the shutter whenever it detects certain sounds. It's programmed to pick up loud noises right now.Maya:A programmable camera! Neat!PresentAttorney's BadgeLotta:So yer a lawyer, huh? Tell the truth, yer badge is a lot more impressive than you are.Maya:Hah hah!Phoenix:*glare*Maya:Hah... hah... oh. Ahem.Lotta's CameraLeads to:\"Lotta?\"Phoenix:Lotta?Lotta:Yeah?Phoenix:So, your camera... it triggers on loud explosion noises?Lotta:Ayup.Phoenix:Actually, the victim in the case we're researching--he was shot with a pistol.Lotta:A pistol...?Phoenix:Right. Now wouldn't a gunshot make a similar noise to our party popper...?Lotta:I guess it would.Phoenix:Your camera... didn't get a picture of the murder, did it?Lotta:... Hey! Y'all are pretty bright!Phoenix:Huh?Lotta:I see what yer sayin'... Tell ya what, I'll have a look-see at my film.Phoenix:It would have been a photo taken late last night...Lotta:I checked 'em once, don't remember if there was anything on 'em though. But what if I got sumtin'! I could be witness to a genuine murder! Yeehaw! I'll go check that film. Y'all come back now, y'hear?Maya:She went inside her SUV. I guess we should come back later...Wright & Co. Law OfficesPresentLotta's CameraMaya:Who was that with the camrea...? Lotta something? Let's go talk to her about that photograph!After presenting Lotta's Camera in Gourd Lake Woods:December 25Police DepartmentCriminal AffairsMaya:... I guess Detective Gumshoe is still in that meeting.Gumshoe:Hey! Thanks for coming down, pal!Maya:Detective Gumshoe!Gumshoe:We just finished the meeting. For better or for worse...Phoenix:(I get the feeling we're in for some bad news...)ExamineDetectivePhoenix:That must be one of the detectives. He's mumbling something to himself.Police:\"All right, hands against the wall, all o' you... Don't even think about escaping! I got eyes in the back of my head!\"Phoenix:... He must be doing image training for arrests.TalkThe victimPhoenix:Do you know anything about the victim yet?Gumshoe:No, no... Still can't I.D. him.Maya:Has Mr. Edgeworth said anything?Gumshoe:Not a word.The meetingPhoenix:So, how did the meeting go?Gumshoe:I can't tell you, pal! You're a lawyer!Phoenix:T-true...Gumshoe:... Y'know... I don't know what to believe anymore. Sure, Mr. Edgeworth's human like you or me. Still... I get the feeling that if he'd done something wrong, he wouldn't go hiding it. That's just the kind of guy he is. Why can't anyone else see that?Maya:So, they think that Mr. Edgeworth did it...?Gumshoe:Well, the trial's starting tomorrow, as scheduled.Maya:I see...Gumshoe:...Phoenix:Umm... hey, in the end you did tell us about the meeting!Gumshoe:... Don't go telling anyone else, pal.Phoenix:Y-yes, sir!Gumshoe:And... do me a favor! Stand by Mr. Edgeworth! He needs help, and you're the ones to help him! I'm sure he's got some reason why he won't talk to us.Maya:Thanks, Detective Gumshoe.Trusting Edgeworth (appears after \"The meeting\")Maya:Detective Gumshoe... How come you trust Mr. Edgeworth so much?Gumshoe:Well, I'd think that was obvious. We got a strong working relationship, us two. We trust each other, and that's how it works.Maya:A \"working relationship\"?Gumshoe:See, Mr. Edgeworth always gets his defendants declared \"guilty\" every time. Yeah, his methods might be a little extreme at times. But... there's a reason! He trusts our investigation, see? He trusts us to get the right man! That's why I work extra hard, pal. We've got to earn that trust he places in us.Maya:I see...Gumshoe:Mr. Edgeworth is a man you can trust... And you have my word on that!The autopsy report (appears after \"Trusting Edgeworth\")Phoenix:I was wondering, did you ever get that autopsy report?Gumshoe:Oh, that? Yeah, I made a copy for you.Autopsy Report added to the Court Record. (Changed from [Added Autopsy Report to the Court Record.] in the original release)Phoenix:Thank you.Maya:...Nick?Phoenix:Huh?Maya:Can you show me that photo of the victim? ... That face...!Phoenix:Someone you know?Maya:I... I don't know. I just have this feeling that I met him somewhere a long time ago. ...The autopsy report (subsequent times)Maya:...Phoenix:(Maya seems lost in thought.) You remember anything?Maya:...Phoenix:(Guess not.)PresentAutopsy ReportGumshoe:Well, I hope it helps you, pal.Phoenix:Thanks, Detective.Anything elseGumshoe:Sorry, I'm drawing a blank right now.Wright & Co. Law Offices (after clearing \"The autopsy report\" Talk option in Police Department - Criminal Affairs)Maya:...Phoenix:What is it?Maya:Oh. Nothing... Just, something's been bothering me. ... Could you show me that autopsy report once more? ... ... ... Hey! I-I remember now! This guy! This is a lawyer that was at that office Mia worked at! I met him once when I went there to hang out with Sis!Phoenix:That office...? Wait! You mean Grossberg's office?Maya:Right! That guy!Phoenix:(That was the last name I expected to come up... Maybe I should go talk to him... for old time's sake.)TalkWhat to doPhoenix:Well, what should we do?Maya:Hmm... The police have pretty much made up their minds that Mr. Edgeworth did it. And Mr. Edgeworth won't tell us anything. I guess we could go look for clues down by the lake?Phoenix:Right.Any ideasPhoenix:Well? Penny for your thoughts?Maya:Thoughts... Thoughts... Yeah, why won't Mr. Edgeworth tell us anything? And... and... And why did he refuse to ask for our help? What a jerk!PresentAutopsy ReportMaya:Nick... This person was a lawyer at Grossberg's office. Let's go talk to him! Mr. Grossberg, I mean, not the dead guy.December 25Grossberg Law OfficesPhoenix:It's been a while since I was here last. Mr. Grossberg is out as usual.Maya:Hey, Nick. Look at the wall.Phoenix:(That painting is still missing... Mia must have known about the deal with Mr. Grossberg and Redd White... She kept track of all of White's extortion and blackmail rackets.)ExamineBookshelfPhoenix:Expensive-looking mahogany bookshelves, filled with expensive-looking books. Hmm... funny... they don't look like they've ever been read.Maya:Well then let's take them back to our office! He won't miss them!Phoenix:Uh, we don't need them.Maya:Then, can we take that wooden bear?Phoenix:(Hmm. It is kind of cute.)DeskPhoenix:A solid mahogany desk. The wood's been polished to a deep luster.Maya:Hey, Nick! I want a desk like that in our office too!Phoenix:I don't know. I don't think I'm ready to sit at a desk like that yet.Maya:Huh? I meant for me!Phoenix:You'd better start saving your allowance, then.Vacant wallMaya:Why is the wall there a different color?Phoenix:A big painting was hanging there until recently.Maya:Huh. What happened to it?Phoenix:Uh... well, he gave it to someone.Maya:I bet he gave it to some romantic interest! Love blooms eternal, Nick!Phoenix:Uh... yeah.Potted plantPhoenix:An expensive potted plant. No idea what kind of plant it is, but it's probably the most expensive one available.Maya:I think our Charley is cuter.Phoenix:Right. He's a really cute... plant.TablePhoenix:A table for clients. Hmm... an elegant ebony case, and if I'm not mistaken, that lighter's made of solid gold. Even I can tell someone here's got money to burn.Maya:We should put things on our client table too.Phoenix:I'm not really into smoking.Maya:We could put out candy, or gum.Phoenix:Classy...Detention CenterPresentAutopsy ReportEdgeworth:... I'm sorry. I can't think of anything I want to say about that.After clearing \"The autopsy report\" Talk option in Police Department - Criminal Affairs:December 25Gourd Lake WoodsLotta:Hey y'all!Maya:Lotta!Lotta:Wait up a sec! We got bingo!Maya:Bingo...?Lotta:My automatic camera took two pictures last night!Maya:Hey!Lotta:This is them. Take a look!Phoenix:Wait...!Lotta:See? See? He's shooting him with that pistol!Phoenix:I-it looks like that, yes.Maya:But you can't really tell who that is shooting.Lotta:Yeah, well there was enough fog out there last night t' strangle a bullfrog. But, y'know... Seeing these photos reminded me of something.Maya:What...?Lotta:I saw the murder happen. I'm a witness!Maya:Whaaaaaaa!?Phoenix:A-are you serious!?Lotta:Course!Phoenix:(How do you forget... never mind.)Lotta:Y'all reckon I should tell the cops?I reckon soPhoenix:I... reckon so!Lotta:What's that? Now don't y'all go tryin' to mock my accent! I'm a sensitive lady!Leads to:\"Hey, so, I'm off to talk to the cops.\"I reckon noPhoenix:I... reckon no!Lotta:What's that? Now don't y'all think y'all can pull one over on me just cause you speak the lingo! I know enough to know that when you see a murder, you'd best tell the cops! It's my obligation as a citizen!Leads to:\"Hey, so, I'm off to talk to the cops.\"Lotta:Hey, so, I'm off to talk to the cops. Y'all can have this photo. Later.Phoenix:W-w-wait! Lotta!Lotta:What? Can't y'all see I'm kinda busy?Phoenix:T-tell us what you saw, too! Please?Lotta:Nice try, honey, but I wasn't born yesterday. I'm a witness, and that means I'm on the side of justice, and that means the cops! I'd sooner eat the south side of a north-bound skunk than tell you!Maya:L-Lotta!Lotta:Don't let it get your skivvies in a bunch. Friends today, enemies tomorrow! Or was that the other way round? No matter. I'm gone! Hey! Maybe they'll let me do some testifying! Hot darn!Maya:She left... ... Well, that's one more witness. What do we do now, Nick?Phoenix:(Well, if she saw something, there's not much we can do about it. The question is: what exactly did she see...? I guess we'll find out in the trial tomorrow.)Lake Photo added to the Court Record.ExamineCameraPhoenix:An expensive-looking camera faces the lake. Next to it is a large microphone and a blue plastic sheet. Hmm. Looks like a computer is attached to the camera.December 25Gourd LakePublic BeachMaya:Looks like the police have given up their interviewing. (Changed from [Looks like the police have given up their questioning.] in the original release)???:Hey!Maya:Aah! N-Nick! I think Santa's mad at you!???:Long time no see, Nick.Maya:Nick... you know Santa!? Wow... Nick and St. Nick... Hey! I see the connection!Phoenix:Don't be ridiculous!???:Dude, it's me!Phoenix:L... Larry! What are you doing here!?Butz:Isn't it obvious? I'm working my day job! I sell Samurai Dogs! Want one? Gotta get money for dates, you know, My girl Kiyance deserves the best!Phoenix:(K-Kiyance...? Not another model, I hope...)Butz:Oh, Kiyance's a fine, fine woman, Nick. It was her idea that I wear this costume! She was all \"You go girlfriend!\" Y'know? She bought this costume for me!Phoenix:That... that's great, Larry.Maya:Wow! A Santa costume! She must be really nice!Butz:Whoa! Cute! Nick! Who's she? She's not your...?Phoenix:Not my... what? N-no, she's not!Maya:I'm his partner, Maya Fey. I'm, uh, the little sister.Butz:Sister...? ... Wow, Nick, must be tough. Working nine to five, having to take care of a little sister...Maya:N-no, I'm not Nick's sister, I'm my older sister's little sister...Butz:Huh. Sounds great!Phoenix:(Don't worry, Maya, he's not listening...)ExamineBenchMaya:Hey, Nick, benches! Let's take a break... maybe have a dog?Phoenix:I think not. It's too cold to sit and eat hotdogs out here!Maya:Wimpy city boy! You should try standing under a freezing waterfall some time!StandPhoenix:I can't get over the Samurai Dogs...Maya:The \"Original\" Samurai Dogs, no less.Butz:Hey, man, whoever calls their product the \"original\" first wins!Phoenix:Why don't you add \"world-famous\" to the sign?Butz:Hey, good idea!Phoenix:(What have I done...?)TalkWhat happenedPhoenix:Hey, Larry. There was a murder here last night... And since you work here... Have you heard anything? (Changed from [You work here. Have you heard anything?] in the original release)Maya:Nick, you're wasting your time. Last night was Christmas Eve! He was with Kiyance, obviously! He wouldn't have been standing out here in the cold!Butz:Oof!Maya:?Phoenix:I think what you just said caught him off guard, Maya.Butz:N-no, it's just... Kiyance's not in town right now. She... she's in Hawaii on a photo shoot.Phoenix:(A model. I knew it.) Well, anyway, there was a murder here on the lake. The trial's tomorrow.Butz:Huh. Neat.Phoenix:The defendant is Edgeworth. Miles Edgeworth.Maya:Um, Nick? Why would Larry know Edgeworth...?Butz:Whoa, Nick! You don't mean THAT Miles Edgeworth!? Old Edgey!?Phoenix:Yeah. He's a murder suspect.Butz:Wh-whoa! Murder?Maya:Huh? You know Mr. Edgeworth, Larry?Butz:Yeah! Of course! Edgey was in the same class as us in grade school!Maya:Whaaaaaaaaat!?Samurai DogsMaya:Umm... umm... tell me about the dogs!Butz:Huh? Oh, you mean the Samurai Dogs?Maya:W-why are they Samurai Dogs? I... I mean they kind of look gourd-shaped.Butz:Oh, well originally, they were Gourd Dogs! Y'know, like \"guard dogs\"?Maya:Ouch...Butz:The Samurai thing was Kiyance's idea. Oh, she's my woman, y'know. She was all \"change the name and you go girlfriend!\" She made me that banner! Man, the kids can't get enough of those Samurai Dogs!Maya:Err... Something about that just seems... wrong.Butz:Oh, and guess what? We're getting a ton of customers here at the lake, what with the big news!Maya:The \"big news\"...?Butz:Yeah! Gourdy!Maya:G-\"Gourdy\"...?Edgeworth (appears after \"What happened\")Maya:So, Mr. Edgeworth was your classmate, Larry?Butz:Yeah, Nick, him, and I used to hang out all the time.Maya:Wow... I never knew.Butz:Don't get me wrong. He's always been kind of a stick in the mud. Studying all the time, trying to \"be like father.\"Maya:Like his father...?Butz:Yeah. Edgey's pop was a famous defense lawyer back in the day.Maya:Wow. Wait... You said \"defense lawyer\"?Butz:Yeah.Maya:Wait a second! But Mr. Edgeworth is a prosecuting attorney!Butz:What? Edgey's got a proboscis on his knee!?Maya:No, no--he's a \"prosecuting attorney.\" That's like the total opposite of a defense lawyer!Butz:... Huh. Go figure! He always used to talk about defending the \"weak\" who were \"unable to defend themselves.\" Man, he used to go on and on about man's duty to society and all that. What a bore! I wonder what changed his mind, though? Do you know, Nick?Phoenix:...Maya:Nick...?Gourdy (appears after \"Samurai Dogs\")Maya:Umm... what's \"Gourdy\"?Butz:Huh? You mean you don't know? It's here, in this very lake! A giant, mysterious monster! Gourdy!Maya:A... monster?Butz:Yeah. Check it out. This is an article from yesterday's newspaper. There's a photo!Maya:Wow! It's r-really real! Nick! A monster! A real monster!Phoenix:Umm... yeah. (It's probably just a log or something... right?) Hey... there's a quote here from the person who took the photo. Hmm? What's this? \"I set the camera to automatic, and when we got into the frame... I heard a loud 'bang'! Like an explosion... followed by the sound of something slipping into the water...\"Maya:I wish I could have seen it!Phoenix:(Why would there be a sound like an explosion...?) Larry. Could I borrow this article from you?Butz:Sure, no problem. That'll be one million dollars!Maya:O-one million...?Phoenix:(Grow up, Larry.)Gourdy Article added to the Court Record.Gourdy (subsequent times)Maya:Hey Nick, show me that article once more. \"I set the camera to automatic, and when we got into the frame... I heard a loud 'bang'! Like an explosion... followed by the sound of something slipping into the water...\" How romantic! And cool! I mean, to think, a real monster!Butz:Yeah. I'm just glad I'm selling more dogs!PresentAttorney's BadgeButz:Huh? Oh, that's your attorney's badge, isn't it? Dude, you really helped me out back in that trial. S-sorry, I can't really pay you.Phoenix:(Cause you blow it all on \"Kiyance\"...!)Butz:But... you can have all the dogs you want!Maya:R-really!?Phoenix:Larry... If you let her at your dogs, you won't have any left for the other customers.Butz:Hey, no problem. If that's what makes her happy, y'know?Phoenix:(How many times do I have to remind you that it was ME who got you off the hook!)Lotta's CameraButz:Whazzat?Phoenix:It's a camera. You take pictures with it.Butz:Huh?Maya:L-Larry! You mean you don't know what a camera is!?Butz:C-course I know! Hey, you're looking at a bona fide junior high graduate! I was talking about the weird contraption on that camera!Phoenix:Oh, that. Well... it's hard to explain. Just forget about it.Butz:Well don't go showing me it, then! Geez!Autopsy ReportPhoenix:Hey Larry, you know this guy?Butz:Who's this?Phoenix:I don't know. That' why I asked you.Butz:Who's this, Maya?Maya:Well...Lake PhotoButz:W-what's this? You know, my eyes have been getting pretty bad lately, Nick...Phoenix:Actually, the photo's blurry, Larry. It was taken last night.Butz:Last night...?Anything elseButz:Sorry, Nick. I don't know much about that. I'm just a simple vendor of Samurai Dogs, dig?December 25Police DepartmentCriminal AffairsMaya:... Not a Gumshoe in sight.Police:If you're looking for Detective Gumshoe, he's in the questioning room. Apparently, an important witness turned up. He'll be in there for a while.Maya:Lotta Hart... it has to be.Phoenix:Uh oh...ExamineDetectivePhoenix:That must be one of the detectives. He's mumbling something to himself.Police:\"...move in the crowd. Wear drab clothes... Never enter the target's field of vision...\"Phoenix:... He must be doing image training for trailing.Detention CenterPresentLake PhotoEdgeworth:Hmph... Who would have thought there'd be a photo...?Phoenix:Edgeworth... Did you shoot him?Edgeworth:... What do you think, Wright?Phoenix:I don't think you're the kind to point a gun at anyone, no.Maya:So you didn't shoot him?Edgeworth:No, I didn't. It wasn't me.After clearing all Talk options in Gourd Lake - Public Beach:December 25Grossberg Law OfficesGrossberg:*Ah-HHHHEM!*Phoenix:(Ah, that old familiar clearing of the throat!)Grossberg:Ah hah! You're Mia's... something, are you not?Phoenix:I was her understudy, yes. Phoenix Wright.Grossberg:Ah hah! And you, you're Mia's... something too, are you not?Maya:Her little sister, yes!Grossberg:You've grown! You've come to look a lot like your sister, you know? It takes me back. \"Ahh... the days of my youth... like the scent of fresh lemon...\" you see.Phoenix:Um, Mr. Grossberg, sir?Grossberg:Hmm...? Ah, yes. I beg your pardon. Of course you came here to discuss something. What is it then? Something the matter?TalkWhat happenedPhoenix:There was a murder last night...Grossberg:A murder?Phoenix:You haven't heard...?Grossberg:I, er, just got up, you see.Phoenix:Well, Miles Edgeworth shot someone with a pistol.Grossberg:Edgeworth!? What!? W-who!?Phoenix:Well, the identity of the victim is still unknown.Grossberg:T-this is terrible news indeed!Phoenix:(I guess he hadn't heard anything...)That paintingPhoenix:Mr. Grossberg? Whatever happened to that painting?Grossberg:Oh, yes... I do not think it shall ever be coming back home to this office. I can't exactly claim it as stolen... I suppose it's my just desserts. Old, bitter desserts.Robert Hammond (appears after presenting Autopsy Report)Phoenix:Who is this Hammond guy, anyway?Grossberg:Mr. Hammond... He was the defense attorney in that case...Phoenix:\"That case\"...?Grossberg:Yes, the \"DL-6 Incident.\"Phoenix:\"DL-6\"...? (Why does that sound so familiar?)Grossberg:Perhaps you remember?Phoenix:(I'm sure someone mentioned it during the trial for Mia's murder.)Grossberg:That was the incident where the police were so at a loss they used a spirit medium.Maya:...! Wait... you don't mean? Was that medium my mother?Grossberg:Yes, my dear. The spirit medium, Misty Fey, your mother, contacted the spirit of the victim. But... the case was a loss. No conviction was made.The DL-6 Incident (appears after \"Robert Hammond\")Grossberg:The DL-6 Incident, yes... Happened 15 years ago. A very strange case, indeed.Phoenix:They never caught the criminal, right?Grossberg:Correct. Misty Fey used her powers to talk to the spirit of the late victim. Her testimony led to charges being laid against one man. But Mr. Hammond won the case and the suspect was declared innocent.Maya:... And the police blamed my mother, calling her a fraud. You were the one who helped her out then, right, Mr. Grossberg?Grossberg:Er... y-yes. Yes, quite.Maya:Thank you!Grossberg:N-no... please. D-don't mention it.Phoenix:... (DL-6... Never thought I'd hear that name again...)Maya:But wait... What does this case have anything to do with Mr. Edgeworth?Grossberg:It has everything to do with Mr. Edgeworth, my dear! The victim in the DL-6 Incident was none other than his father, Gregory Edgeworth!Maya:Wh-what!? His father!?Grossberg:... If you want to know more, you should ask him yourself. Show him this... I'm sure he'll talk to you.Maya:Wait... This is a photograph of my mother!Misty Fey's Photo added to the Court Record.The DL-6 Incident (subsequent times)Grossberg:The DL-6 Incident, yes... Happened 15 years ago. A very strange case, indeed.Phoenix:They never caught the criminal, right?Grossberg:Correct. Misty Fey used her powers to talk to the spirit of the late victim. Her testimony led to charges being laid against one man. But Mr. Hammond won the case and the suspect was declared innocent.Maya:... And the police blamed my mother, calling her a fraud. You were the one who helped her out then, right, Mr. Grossberg?Grossberg:Er... y-yes. Yes, quite.Maya:Thank you!Grossberg:N-no... please. D-don't mention it.Phoenix:... (DL-6... Never thought I'd hear that name again...)Maya:But wait... What does this case have anything to do with Mr. Edgeworth?Grossberg:It has everything to do with Mr. Edgeworth, my dear! The victim in the DL-6 Incident was none other than his father, Gregory Edgeworth!Maya:Wh-what!? His father!?Grossberg:... If you want to know more, you should ask him yourself.PresentAttorney's BadgeGrossberg:You've really grown up in the past few years, my dear! How proud Mia would be if she could see you now!Maya:She said she was more worried about me than anything.Phoenix:Aww, just go on and take the compliment, will you?Lotta's CameraGrossberg:So, this camera on the lake takes a photo whenever it hears an explosion sound?Maya:That's what she said.Grossberg:And it just happened to be set up on the beach, pointing out on the lake?Maya:Yes... she said it was to photograph \"shooting stars.\"Grossberg:Hmm. Shooting stars... explosions... what's the connection? I'd be suspicious of this witness of yours.Autopsy ReportGrossberg:Hmm? Strange... I feel as though I've seen this man somewhere before! ... Aaaaaaaaaaaaah!Phoenix:Did you remember!?Grossberg:He was a lawyer! Here, in my office! That's Hammond! Robert Hammond!Maya:Mr. Hammond...?Grossberg:And you say this is the man Miles Edgeworth shot?Lake PhotoGrossberg:So this is the moment the crime took place, eh?Phoenix:Yes.Grossberg:You can't really say for sure that's Edgeworth. I'm not sure whether that's a good thing or a bad thing. Not sure at all...Misty Fey's PhotoGrossberg:Misty Fey. Mother of Mia and Maya Fey. Show this photograph to Miles Edgeworth. He'll have something to say to you then.Anything elseGrossberg:Er... my apologies. I'm not sure I can help you with that.Wright & Co. Law OfficesPresentMisty Fey's PhotoMaya:My mother... ...Phoenix:(Now that I've shown her the picture, I can't think of anything to say... That probably wasn't the best thing to do.)December 25Detention CenterVisitor's RoomEdgeworth:What's this? I was hoping you'd gotten my message the first time.Phoenix:Edgeworth, what about your defense?Edgeworth:...! It's no concern of yours.Phoenix:(Guess he hasn't found anyone yet.)TalkWhat happenedPhoenix:Can I ask you about the murder?Edgeworth:Wright. I'll ask you again, just leave me alone.Phoenix:...Edgeworth:Please try to understand. I'm not doing this to prove I'm tough, or because I look down on you. I just don't want you anywhere near this case. Understand?Gourd LakePhoenix:Why did you go to Gourd Lake?Edgeworth:I have no intention of telling you.Phoenix:Nor, apparently, would you tell Detective Gumshoe.Edgeworth:!Maya:Detective Gumshoe was really worried about you!Edgeworth:...The DL-6 Incident (appears after presenting Misty Fey's Photo)Edgeworth:The \"DL-6 Incident\"... was when my father died. Right before my eyes... He was shot and killed, and I saw it all.Maya:...!Edgeworth:My memories from that time are... foggy. I suppose it's a self-defense mechanism. In any case, a suspect was arrested... a man. It's pretty clear he was the only one who could have killed my father. The spirit medium they used to talk to my late father said the same thing. It was an attorney by the name of Robert Hammond that cleared the suspect's name.Phoenix:And Hammond... is the victim in the Gourd Lake murder?Edgeworth:Correct.Maya:Umm... That spirit medium... that was my mom.Edgeworth:What? You mean you're...? ... It's strange. I thought that terrible incident was about to end, and now... this.Phoenix:\"About to end\"?Edgeworth:The DL-6 Incident happened 15 years ago. 15 years ago... on December 28.Maya:December 28?Edgeworth:The statute of limitations on the case runs out in three days.Phoenix:What!?Maya:Um, Nick? What does that mean?Phoenix:When a case's statute of limitations runs out, legally, the case never happened.Edgeworth:Three days from now, DL-6 will be closed... forever.The suspect (appears after \"The DL-6 Incident\")Maya:What happened to the suspect? The one who got off innocent?Edgeworth:I don't know... He disappeared from public view. Nobody knows where to. If he's still alive, he'd be about 50 years old now.Phoenix:(I guess I can understand why he'd go into hiding... It'd be hard to live a normal life after being a murder suspect in such a big case.)Your father (appears after \"The DL-6 Incident\")Maya:Umm... so, was your father a lawyer?Edgeworth:He was... Gregory Edgeworth. He was quite famous at the time, apparently.Maya:So, you were sort of trying to follow in his footsteps.Edgeworth:... I'd rather not talk about it.PresentAttorney's BadgeEdgeworth:Your attorney's badge...? I can't say I really want to see one of those right now.Misty Fey's PhotoEdgeworth:...! ...Phoenix:Edgeworth?Edgeworth:It's only been a matter of hours since you last visited. Yet you've made incredible progress in your investigation. I'll admit it, I'm impressed, Wright. You were always single-minded in your work, though. Once you start on something, you always see it through, don't you?Phoenix:About the \"DL-6 Incident\"...Edgeworth:Right... DL-6. I didn't want you to find out about it. That is why I refused your offer to defend me. I'm sorry if it sounded like I thought you weren't up to the job. I just wanted to keep you away from DL-6.Phoenix:So... do you still think it would have been better for me to stay away?Edgeworth:I don't know. But... I see no point in hiding anything from you now. Very well. Ask whatever you like, and I will answer to the best of my abilities.Removes \"What happened\" and \"Gourd Lake\" Talk options, adds \"The DL-6 Incident\" Talk optionAfter clearing all Talk options and presenting Lake Photo:Edgeworth:... Wright.Phoenix:?Edgeworth:It pains me to ask you this now...Maya:I know! You want us to defend you!Edgeworth:Yes... Will you?Of course we willPhoenix:Ah, who could have guessed this day would come?Edgeworth:Not me.Leads to:\"This is my chance to finally pay you back.\"Of course we won'tPhoenix:Sorry, charley! No way!Edgeworth:Wright...Maya:Nick...!? ...Phoenix:H-hey, don't look so serious, guys! I was kidding! Just a little joke!Edgeworth:There was nothing little...Maya:...or joke-like about it!Phoenix:(I thought it was funny...)Maya:Nick! Do it over!Phoenix:Yes, Your Honor. How could I refuse you, Edgeworth?Edgeworth:Thank you, Wright.Leads to:\"This is my chance to finally pay you back.\"Phoenix:This is my chance to finally pay you back.Maya:Pay him back...?Edgeworth:Pay me back? For what? I don't remember ever doing anything for you.Phoenix:Never mind... I guess you don't really need to know.Edgeworth:Huh... My letter of request. Please give it to Detective Gumshoe.Edgeworth's Request put in pocket.Phoenix:Well, I guess we should... ... W-what's that!?Maya:E-earthquake! Nick! It's a big one! Whaaaaa! I-it's calming down... ... Whew... that was scary!Phoenix:...? Huh? Where's Edgeworth?Maya:... There. He's on the floor in a ball, shivering. I guess he doesn't do so well with earthquakes.Phoenix:(I've heard of running, but curling up in a ball?)Maya:Well, I guess we're done. Mr. Edgeworth doesn't seem like he's going to stand up any time soon. Let's go, Nick.Phoenix:Uh.. right. We have to give Edgeworth's letter of request to Detective Gumshoe.ExamineSecurity guardPhoenix:This guard monitors the visitor's room. He hasn't moved an inch since I came in. A real pro.After Edgeworth's Request is added to the Court Record:December 25Police DepartmentCriminal AffairsGumshoe:What's going on here!?Maya:Eek!Phoenix:W-what's wrong, Detective?Gumshoe:This wild lady comes in here just a while ago... Says she came \"to talk to y'all after hearing what Mr. Wright had to say\"! What's this all about, pal!?Phoenix:(Lotta Hart...)Gumshoe:Why are you going around finding more witnesses!? You want to give Mr. Edgeworth the death sentence, pal!?Phoenix:N-no, not at all... Just... I mean, she did see something. There's nothing I can do about that. I can't go around covering up evidence!Gumshoe:Er... You trying to say something about the way I do my job?Phoenix:No sir!ExamineDetectivePhoenix:That must be one of the detectives. He's mumbling something to himself.Police:\"Never talk to people in the neighborhood... Turn all the lights in the room off, and close the curtains...\"Phoenix:... He must be doing image training for a stake-out.TalkLotta's testimonyPhoenix:So... what did Ms. Hart say?Gumshoe:She says she saw Mr. Edgeworth fire the pistol.Maya:What!?Gumshoe:She even had a photograph to prove it.Phoenix:Right. I saw it too... But you really can't tell from the photo who it is shooting.Gumshoe:That's why she said she's going to enlarge the photo. She said \"it'll drop the quality a mite, but should let us see who's who!\"Maya:She can do that!?Phoenix:(Okay, so there's going to be an enlarged photograph that shows Edgeworth in the act. Great. Just great.)Gumshoe:In any case, she's going to be the one testifying tomorrow.Maya:Huh? What happened to the other witness?Gumshoe:Well... Apparently, there was a cancellation.Phoenix:(A \"cancellation\"...!?)Tomorrow's trialGumshoe:I'm afraid tomorrow is going to be life or death for poor Mr. Edgeworth. We got a witness who says she saw the very moment of the murder. And we got a photo taken when the shot rang out.Phoenix:(I'd say that sounds like a pretty unwinnable case... But wait... What did Mia used to say? If he's innocent, there's got to be something I've overlooked...)EdgeworthGumshoe:It sound like Mr. Edgeworth is going to ask the state to assign a public defender. I was just asked to file the paperwork. But you still got time, pal! Go talk to him again, for me, please! You have to convince him! You have to make him let you defend him! Please! I know you're the only one who can do it, pal. You're the only one who can save Mr. Edgeworth!PresentEdgeworth's RequestLeads to:\"Look what I got.\"Anything elseGumshoe:Hey, pal, there's only one thing I want to see from you! And that's a letter of request from Mr. Edgeworth for you to be his defense attorney!Phoenix:Look what I got.Gumshoe:... Hey, you did it, pal! Glad I waited till the last minute to file those papers! I'll rip 'em up and start new ones for you!Phoenix:Thanks, Detective. Well, see you in court tomorrow, then.Gumshoe:Good luck, pal. Hey! You guys feel that earthquake a little while back? I was worried!Maya:Worried? We're fine! I've lived out here my whole life. I'm pretty used to them by now.Gumshoe:Oh, I wasn't worried about you two. I was worried about Mr. Edgeworth!Phoenix:(Oh, right...) He did seem to over-react a little, now that you mention it.Gumshoe:Yeah, well, I'm not surprised. It was a pretty big quake. I'm going to go check on him. You two go eat and get your rest for tomorrow's trial. Later!Maya:... I wonder what it is with Mr. Edgeworth and earthquakes?Phoenix:I wonder... He was never that scared of them when he was in school.Phoenix:(Then again, I only really got to know him in 4th grade. (Changed from [Then again, I was only in the same class as him for 4th grade.] in the original release) He transferred to another school after that. I wonder what happened to Edgeworth...)To be continued.Nothing to examine during investigationPhoenix:No clues here.Turnabout GoodbyesTranscriptPart 1Part 2Part 3Part 4Part 5Part 6December 26, 9:44 AMDistrict CourtDefendant Lobby No. 2Phoenix:Karma...? (ellipsis and question mark highlighted in the original release)Edgeworth:That's right, Manfred von Karma. He's the best prosecutor there is. He hasn't lost a case in his 40-year career. He is a god of prosecution, Wright! A god!Maya:Not a single case?Edgeworth:He'll do anything to get a guilty verdict, anything.Phoenix:Hmm. Sounds like someone else I know, Edgeworth.Edgeworth:Hmph. You don't understand. I mean he'll really do anything. Manfred von Karma is a man to be feared.Phoenix:(That's quite a claim coming from someone who forges evidence...)Edgeworth:He taught me what it really means to \"prosecute.\"Phoenix:Wh-what!?Edgeworth:Just picture a prosecutor as vicious as me... multiplied by a factor of ten.Maya:Ugh... So... so was he your teacher, then, Mr. Edgeworth?Edgeworth:Something like that...Maya:And now he's trying to get you found guilty!? What a creep! Oh, wait... Maybe he's planning on losing on purpose to help you out.Edgeworth:Not a chance... He hasn't lost once in 40 years. 40 years! He's as ruthless as me, times twenty!Maya:That's pretty ruthless...Edgeworth:Like I said. He's a god among prosecutors.Phoenix:(I guess that's something like Mia was to me. Speaking of Mia...) Um, Maya?Maya:Uh huh?Phoenix:We could really be using Mia's help right now... don't you think?Maya:Oh...Phoenix:?Maya:I can't. Sorry. I tried, I really tried, but I couldn't reach.Phoenix:You couldn't \"reach\"?Maya:I think it's because I haven't been training. My powers are weak again...Phoenix:Oh man, what bad timing!Maya:I'm really sorry. I'll try my best!Phoenix:I hope so!Edgeworth:What are you whispering about?Phoenix:O-oh, it's nothing. Well, it's time. Let's head in...December 26, 10:00 AMDistrict CourtCourtroom No. 3Judge:Court is now in session for the trial of Mr. Miles Edgeworth.Phoenix:The defense is ready, Your Honor.Karma:...Judge:Err, Mr. von Karma? Is the prosecution ready?Karma:... Fool... You seriously think that I would stand here were I not completely prepared?Judge:R-right, my apologies!Phoenix:(He's even got the Judge scared!)Judge:Very well, your opening statement, please.Karma:... Decisive evidence... A decisive witness... What else could possibly be required?Judge:Ah... er, nothing of course. That should be fine. The prosecution may call its first witness.Maya:What's with this guy? Is he royalty or something?Phoenix:How am I supposed to fight against this!?Karma:I call the detective in charge of this case, Detective Dick Gumshoe.Phoenix:(Okay, Gumshoe's first... Let's see how this goes.)Karma:Describe the incident. Now!Gumshoe:Y-yessir!Phoenix:(Detective Gumshoe looks nervous...)Gumshoe:Er, please take a look at the map. The murder happened late Christmas Eve, around midnight. There was one boat in the very middle of the lake. There were two men on the boat. Now, there happened to be a woman camping here on the edge of the lake. At 12:10 AM, she heard two pistol shots. Then the boat started to move. It went towards the boat rental shop.Karma:Hmm.Overhead Map added to the Court Record.Karma:Testify to the court about your arrest. Now!Judge:W-w-wait! Mr. von Karma...Karma:Yes?Judge:Actually, I'm the one that's supposed to be handling these proceedings...Karma:Wrong. There is only one thing you need to do here. You will slam down your gavel and say the word \"guilty.\" That is your role!Judge:Y-yes, of course. You're quite right.Phoenix:(No, he's not!!!)Witness Testimony-- The Arrest of Edgeworth --Gumshoe:A man called into the station around 30 minutes after midnight.We headed to the scene of the crime as fast as we could.That's where we found Mr. Edgeworth.Now, I didn't suspect him of anything at all.But... the next morning, a body was found in the lake.So we had to arrest Mr. Edgeworth.Judge:Hmm... I see. Very well...Karma:Begin your cross-examination, attorney. Now!Judge:...Cross Examination-- The Arrest of Edgeworth --Gumshoe:A man called into the station around 30 minutes after midnight.PressPhoenix:Phoenix:You received a call from a \"man\"?Gumshoe:Er... yup.Phoenix:But you said there was a woman camping there? She was the one who heard the two gunshots, right?Karma:Karma:That woman and the \"man\" who called in the report are two different people, obviously!Phoenix:Different people?Karma:There were two witnesses!Phoenix:(Urk!)Karma:Their testimonies were quite similar however. Today I've summoned the woman who was camping.Phoenix:(The woman who was camping... Lotta Hart.)Karma:What happened next, Detective?Gumshoe:We headed to the scene of the crime as fast as we could.PressPhoenix:Phoenix:How long was it between receiving the report and your arrival at the lake?Gumshoe:Er, well... I'd say it was about three minutes.Phoenix:That's pretty fast!Gumshoe:Our motto for the month is \"get there quick.\"Karma:Karma:Detective! You will refrain from casually revealing department secrets!Gumshoe:Y-yessir! Sorry, sir!Karma:Do that, and you'll be able to look forward to your next salary review.Gumshoe:So much to look forward to, these days...Karma:This is no time for daydreaming! Continue!Gumshoe:Y-yessir!Gumshoe:That's where we found Mr. Edgeworth.PressPhoenix:Phoenix:What was Mr. Edgeworth like when you saw him then?Gumshoe:Well... From what I saw, he looked pretty relaxed. Not like a murderer at all, really.Karma:Karma:Detective! The court requires the facts, NOT your opinion! How many years have you been on the force!? Facts only, Detective! Hard, cold, objective facts!Gumshoe:Y-y-yessir!Phoenix:(Man, he's got his share of objections...)Gumshoe:Now, I didn't suspect him of anything at all.PressPhoenix:Phoenix:Why didn't you think he was suspicious?Gumshoe:You should know! We have a deep, trusting relationship with the prosecutors.Karma:Karma:Detective! The court isn't interested in your musings! \"Deep\"? \"Trusting\"? Poppycock! I've never heard so many flippant comments from an active detective on the force!Gumshoe:Mmph!Phoenix:(Detective Gumshoe doesn't look so good...)Karma:Continue! Now!Gumshoe:But... the next morning, a body was found in the lake.PressPhoenix:Phoenix:Did you find any clues on the body?Gumshoe:A single bullet was recovered from the body. He was shot through the heart... fatally.Karma:Judge! Here's the bullet... It didn't strike bone, so its shape is well preserved.Judge:Very well. The court accepts this bullet into evidence.Pistol Bullet added to the Court Record.Press (subsequent times)Phoenix:Phoenix:Did you find any clues on the body?Gumshoe:A single bullet was recovered from the body. He was shot through the heart... fatally.Gumshoe:So we had to arrest Mr. Edgeworth.PressPhoenix:Phoenix:W-why is that?Gumshoe:Well, we found the murder weapon in the boat.Phoenix:The murder weapon...?Gumshoe:A pistol.Judge:Detective Gumshoe... That is a vital piece of information. Please revise your testimony.Gumshoe:Right! S-sorry, Your Honor.Changes statement from \"So we had to arrest Mr. Edgeworth.\" to \"The murder weapon we found in the boat was decisive evidence.\"Gumshoe:The murder weapon we found in the boat was decisive evidence.PressPhoenix:Phoenix:What about the pistol made it \"decisive evidence\"?Karma:Tsk tsk tsk...Phoenix:(Ack! He has the same evil laugh as Edgeworth...)Gumshoe:There were fingerprints on the pistol found in the boat. They were clear prints from Mr. Edgeworth's right hand.Phoenix:Wh-what!?Judge:Order! Order! So Mr. Edgeworth's fingerprints were found on the murder weapon!?Gumshoe:Y-yes, Your Honor.Karma:Judge! This is the weapon in question.Judge:A-accepted into evidence.Pistol added to the Court Record.Press (subsequent times)Phoenix:Phoenix:What about the pistol made it \"decisive evidence\"?Karma:Tsk tsk tsk...Phoenix:(Ack! He has the same evil laugh as Edgeworth...)Gumshoe:There were fingerprints on the pistol found in the boat. They were clear prints from Mr. Edgeworth's right hand.Phoenix:Wh-what!?Maya:Nick. Doesn't it seem like Detective Gumshoe is being a little vague?Phoenix:I bet von Karma is feeding him lines! His testimony's probably filled with landmines just waiting for me to press.Maya:What do we do?Phoenix:Grit our teeth and press, I guess. What else can we do?Maya:Well said, Nick! You're the man!After pressing fifth statement and pressing modified sixth statement:Karma:Members of the court... We now have the pistol used in the murder, and the bullet found in the body! Detective!Gumshoe:Y-y-yessir!Karma:Was the bullet found in the body fired from this pistol?Gumshoe:Yes. The ballistic markings on the bullet match the pistol.Judge:Hmm...Maya:Hey, Nick! What does he mean, \"ballistic markings\"?Karma:Shocking! To imagine someone here does not know something as basic as ballistic markings!Maya:N-Nick! He's glaring at me!Karma:Tsk... very well, I'll explain. Actually, Judge! You do it.Judge:Eh? M-me? ... Erm, ahem. Ballistic markings are like the \"fingerprints\" of a gun. The barrel leaves distinctive marks on each bullet it fires. You can examine these \"ballistic fingerprints\" to see which gun fired the shot. It's quite accurate.Karma:Indeed. This leads to one, inevitable conclusion: the bullet found in the victim's heart... was, without a doubt, fired from this pistol. This pistol which, as you may recall, was covered with the defendant's own fingerprints!Judge:O-order! Order!Phoenix:(This is bad... This makes it look like Edgeworth did it!)Karma:Well, Judge?Judge:I'd say it's almost decisive, yes. Honestly, I could declare a verdict at this point. However...Karma:You wish to hear the witness speak, no doubt. Very well. I am somewhat fatigued, and so I will take a brief break. I will call my witness after the recess. Which will last ten minutes. Judge!Judge:Y-yes?Karma:What are you doing? A ten minute recess! Now!Judge:B-but, wait, I...Karma:Just bang your flimsy gavel and get on with it, man!Judge:Y-yes! Ahem. This court will take a ten minute recess.Phoenix:(Who's running this court, anyway!?)December 26, 11:09 AMDistrict CourtDefendant Lobby No. 2Phoenix:Edgeworth! What's going on here!? Your fingerprints were on the murder weapon!Edgeworth:Uh... hmm...Phoenix:And that foggy photo makes one thing clear... The only one who could have shot that man was the person in the photo!Edgeworth:True...Phoenix:Was that you in the boat?Edgeworth:... Yes. It was me.Phoenix:What!?Edgeworth:But... you must believe me. I didn't shoot him.Phoenix:Th-then who did!?Edgeworth:I... don't know.Phoenix:You don't know!? Weren't you right there!?Edgeworth:... I heard a gunshot from very close by. Then... the other man fell from the boat. I can't say why, but... I thought, at the time, that he had shot himself!Phoenix:Y-you mean it was a suicide!?Edgeworth:... That's the only explanation I can come up with.Phoenix:Huh... (How am I going to convince anyone of that!?) Say, Maya?Maya:Huh? Wh-what?Phoenix:Any progress with Mia?Maya:Oh... Sorry. It's no good.Phoenix:Ugh...Maya:I know... I'm no good for anything, am I, Nick? If I can't call my sister, I might as well not be here, right?No, I need you herePhoenix:No, of course not, I need you here! I can see you're always trying to help out. Even if you don't actually help... it's the thought that counts, right?Maya:It's okay Nick, you don't have to make me feel better.Leads to:\"I don't know anything about trials, or defense...\"Yeah, you're uselessPhoenix:Um, well, actually... (You don't know law, you don't have any trial experience or techniques... Yeah, you're pretty much useless... but I can't say that!)Maya:It's okay Nick. You don't have to say anything. Your face said it for you.Phoenix:(Whoops!) N-no, o-of course we... I'm sorry.Maya:It's okay Nick.Leads to:\"I don't know anything about trials, or defense...\"Maya:I don't know anything about trials, or defense... What's more, I'm a spirit medium who can't even contact spirits...Phoenix:Aww, everyone has their off days! I mean, I've just been getting lucky lately... But you never know when my luck is going to run out!Maya:Really...?Edgeworth:W-w-whoa! Wright! Don't jinx this case any worse than it already is! It's bad for my heart...Phoenix:Oh? Oh! S-sorry... (Whoops!)Judge:Court is back in session. Mr. von Karma, call your witness.Karma:Yes. Will Ms. Lotta Hart take the stand?Karma:Lotta Hart, you are a research student at a university?Lotta:That I am.Karma:Good. Begin by telling us what you saw the night of the incident. And don't add anything trivial or subjective. Understand?Lotta:... Y'all need to learn some manners.Karma:UNDERSTAND?Lotta:Y-yeah, I understand, I understand!Judge:Er... very well. Your testimony, please.Witness Testimony-- Witness's Account --Lotta:It was Christmas Eve, just after midnight, I reckon.I was in my car.I heard this \"bang\" come up from the lake.When I looked out the window, I saw two gents in a boat.Then there was another \"bang\"...There wasn't nary a thing on the lake but that boat.Karma:Enough.Lotta:Huh?Karma:Judge! She happened to take a photo of the incident! This is that photo. Accept it as evidence.Judge:W-well! This is a surprise! This looks like... the very moment of the murder! O-Order! I will remove you from the court if I do not have order immediately!Karma:As the witness testified, she looked at the lake when she heard the shot. There were no other boats on that lake! So, the man in the boat with the victim must have been the one who shot him... Yes. It was the defendant, Miles Edgeworth!!!Judge:Order! Order! Order...! I will have order!Karma:... Well, Judge?Judge:The evidence is... decisive. I have very little doubt about this case. Very well, this court finds the defendant...Phoenix:Phoenix:W-wait! Your Honor! I haven't cross-examined the witness yet!Karma:A cross-examination? We have photographic proof! What question can there possibly be!? This photo is worth a thousand words... and they all read \"guilty\"! You lose. Or... Do you claim to have found a contradiction in her testimony!?Phoenix:...!Karma:Very well. If you have to, you may cross-examine the witness. You will only flounder and ask meaningless questions! You will fail to find anything! And then, I will have you held in contempt of court!Maya:Uh, Nick... contempt...?Phoenix:\"Contempt of court,\" you know?Maya:I... guess I understand. Well... what are you going to do? Do you really think there was a contradiction with the facts in her testimony?I think there wasPhoenix:I... think I noticed one little thing...Maya:Wow, I'm impressed, Nick! I didn't notice anything! Right! Let's take him on!Phoenix:Y-yeah... (I got a bad feeling about this...)Leads to:\"I understand... I will cross-examine the witness!\"I think there wasn'tPhoenix:Honestly, I found nothing.Maya:I dunno, I thought her testimony was strange. She was so vague about everything!Phoenix:I bet von Karma probably fed her her lines.Maya:But... But if you don't cross-examine her, the judge will...Phoenix:He'll bang down that \"flimsy gavel\" of his and declare Edgeworth guilty.Maya:I guess we'll just have to bluff it.Phoenix:But if we mess up... contempt of court.Maya:Hey, if we lose we'll be held in public contempt!Phoenix:Er... right.Leads to:\"I understand... I will cross-examine the witness!\"Phoenix:I understand... I will cross-examine the witness!Karma:Tsk tsk tsk... Very well!Judge:I pray for your sake this isn't a waste of time.Cross Examination-- Witness's Account --Lotta:It was Christmas Eve, just after midnight, I reckon.PressPhoenix:Phoenix:\"Just after midnight,\" you say? In other words, it was no longer Christmas Eve... but Christmas Day!Lotta:Huh? Uh, yeah, well, yes.Karma:Karma:I know you want to find contradictions, but really!Phoenix:Mmmph.Judge:I hope your next contradiction is a little more relevant to the trial.Lotta:I was in my car.PressPhoenix:Phoenix:Why were you camping there, anyway?Lotta:I'm a research student at my university. I was taking pictures to use in my research.Phoenix:(What research? This all sounds suspicious...)Press furtherPhoenix:Ms. Hart. Could you be more specific about your \"research\"?Karma:Karma:What does the witness's motive in camping by the lake have to do with this case!? The answer \"is nothing\"! I object to this line of questioning! Objection sustained!Judge:W-w-wait, now, I'm the one who says that!Karma:Well, then say it already!Judge:Objection sustained.Phoenix:(Thanks for nothing, Your Honor...)Leads back to cross-examinationHold backPhoenix:(I think I'll let that one slide for now.)Leads back to cross-examinationLotta:I heard this \"bang\" come up from the lake.PressPhoenix:Phoenix:So, you weren't looking at the lake at that time?Lotta:Nope. I looked after I heard that noise.Karma:Karma:She's said that already! I asked you to find \"contradictions\"! Not leisurely chat with the witness!Phoenix:(Urk...)Lotta:When I looked out the window, I saw two gents in a boat.PressPhoenix:Phoenix:Could you clearly see the two men?Lotta:Just look at the picture! Clear enough for you?Phoenix:(Uh oh...)Press furtherPhoenix:Wait a second! I wasn't asking you about the photo! I was asking if YOU saw the two men!Lotta:Uh, yeah, well, of course...Karma:Karma:The witness has testified that she saw them! There's also a photo! You'd best look elsewhere for your precious contradictions!Phoenix:(He jumped in quick... He's hiding something!)Leads back to cross-examinationHold backPhoenix:(I think I'd best let that one slide...)Leads back to cross-examinationLotta:Then there was another \"bang\"...PressPhoenix:Phoenix:Were you watching the very moment the shot rang out?Lotta:Well, yeah, sure...Karma:Karma:You're asking meaningless questions! Meaningless! \"Contradictions,\" Mr. Wright. Not meaningless babble!Phoenix:(von Karma, I think I hate you. He's trying to keep me from talking to the witness... To what end...?)Lotta:There wasn't nary a thing on the lake but that boat.PressPhoenix:Phoenix:Are you sure about that?Lotta:Yeah, sure as a country gal can be!Phoenix:(That sounds pretty sure.)Press furtherPhoenix:How come you're so sure?Lotta:Well, heck, I scanned the whole lake.Phoenix:(\"Scanned the whole lake\"? It almost sounds like she was more interested in the lake than the boat...) Ms. Hart... you--Karma:Karma:Mr. Wright! The witness has answered the question in full.Phoenix:Mmph!Karma:No need for further questions! Objection sustained!Judge:U-uh, that's what I'm...Karma:Sustained!Judge:Y-yes, of course.Phoenix:(Oh great... What am I supposed to do now?)Leads back to cross-examinationHold backPhoenix:(Lotta seems pretty sure of herself. I'd better not forge blindly ahead here. Still... this whole thing stinks.)Leads back to cross-examinationPhoenix:(Th-there weren't any contradictions in there!)Maya:Sorry, Nick. If only my sister were here...Phoenix:(Maya's really taking this hard.)After selecting \"Press further\" upon pressing second, fourth, and sixth statements, and pressing fifth statement:Judge:Enough! I think we've heard all we need to hear, Mr. Wright. It seems you are unable to find a contradiction in the testimony worth noting.Phoenix:B-but, Your Honor!Karma:You keep your promise!Judge:Mr. Wright. I am afraid that I will have to penalize any further outbursts... By holding you in contempt of court!Karma:And if that happens, you'll have to leave the courtroom immediately! Understood...?Phoenix:Uh... uh huh.Maya:Nick...! Lotta's testimony is fishy, Nick! Real fishy!Phoenix:I... know what you mean. But... If I can't say anything, what can I do?Judge:I believe we've covered the evidence sufficiently to make a decision.Karma:Then, pass your judgment!Judge:Very well. Mr. Miles Edgeworth, please take the stand.???:Judge:Wh-who was that!?Maya:It... was me.Phoenix:(Maya!)Judge:I-is something wrong? D-do you need to use the facilities?Maya:No, I do not! Lotta Hart! Your testimony stinks! It's unclear whether you were actually looking at the lake! It's highly doubtful that you actually say Mr. Edgeworth! Tell us the truth! This is a matter of life or death!Lotta:...!Maya:Lotta! Did you really clearly see Mr. Edgeworth that night!? Did you see him fire that pistol!?Judge:You will stand down! The court does not acknowledge the defense's outburst!Maya:Answer me, Lotta!Lotta:What's the big idea, treating me like some kind of criminal!? I saw him! I swear it! I saw Edgeworth...Karma:Karma:Enough! Judge... Declare the defense in contempt of court!Judge:Y-yes... yes, of course. I'm sorry, but you WERE warned. Guard! Escort Mr. Wright out of the courtroom! He is in contempt of court, and must leave.Phoenix:(No... No...!)Wait!Maya:I-I was the one who made the outburst, Your Honor! Nick is innocent!Karma:Hah! What's the difference? All that remains is for the guilty verdict to be declared! Isn't that right, Mr. Phoenix Wright!?WrongPhoenix:Wrong!Karma:What!?Leads to:\"Did you hear what Ms. Hart just said?\"RightPhoenix:(Dammit, he's right...)Maya:N-Nick! There must be something we can do!Phoenix:I... don't think there is. The cross-examination is over already!Maya:B-but... but didn't Lotta just say she saw him? She did, Nick! She just said that she saw Mr. Edgeworth! She didn't say that in her testimony, did she?Phoenix:...! Y-you're right! Your Honor!Leads to:\"Did you hear what Ms. Hart just said?\"Phoenix:Did you hear what Ms. Hart just said? She said she clearly saw Mr. Edgeworth! That was not in the testimony! That changes her testimony, and I have a right to cross-examine her again!Judge:Order! Order! Order! Order! Order! Order!Karma:You're in contempt of court! It's too late for wild claims! Judge! Sustain my objection!Judge:... ... I'm sorry, Mr. von Karma, but I cannot.Karma:What!?Judge:Ms. Lotta Hart has made a new testimony. The defense does have a right to cross-examine her again.Karma:B-but he is in contempt of court!Maya:No, I am! If you're going to arrest someone, arrest me!Judge:Hmm... Very well. Maya Fey! You will leave the courtroom immediately.Maya:Nick! I did what I could... You have to do the rest! Good luck!Phoenix:M-Maya...!Karma:Peh! I care not for this melodrama! Listen well, Mr. Wright! I do not tolerate badgering of my witnesses!Phoenix:(I'm running out of time... I'd better find a contradiction in here or else...)Judge:Mr. Wright! Begin your cross-examination!Cross Examination-- That Last Statement --Lotta:I saw it clear as day. The man on the boat was Mr. Edgeworth!PressPhoenix:Phoenix:Well, what about the other man?Karma:Karma:You cannot expect to be allowed to blithely ignore your promise, Mr. Wright! I believe you claimed there was a contradiction in the witness's testimony! Well, find it! If you can!Judge:Mr. Wright, I have to assign you a penalty.Phoenix:(Damn...!)Present Lake PhotoPhoenix:Leads to:\"Got you.\"Phoenix:(That's it...? Uh oh. I don't know if I can find anything in that... What will Maya say...?)Phoenix:Got you. Got you, Ms. Hart! Finally!Lotta:Wh-what!? You got what?Phoenix:Look at this photograph.Lotta:The photo I took...?Phoenix:The very same. There's something I want you to see in this photo... it's quite clearly visible. The fog, Ms. Hart.Lotta:So... so?Phoenix:This picture was taken with professional, high quality film, correct? Yet even it could not capture the faces of the men on the boat! Yet you claim you saw Mr. Edgeworth! How!?Lotta:Whut!? Wha--!Judge:Mr. Wright has a point!Karma:Karma:That's why I told her not to say that in her testimony! Please!Phoenix:Yet, now she has said it, Mr. von Karma. How could you possibly see Mr. Edgeworth!? Explain yourself!Judge:Ms. Hart.Lotta:What!Judge:Could you see the defendant that night?Lotta:O-of course! I said I could and I meant I could!Judge:Then, please testify as to the circumstances of your sighting.Phoenix:(I did it! I finally found a hole in von Karma's carefully vague testimony!)Witness Testimony-- How Edgeworth Was Seen --Lotta:Yer right. It was a cold night, and the fog was thick as grits.So, once I was finished setting up my camera, I got back in the car.Still, I brought my binoculars with me.When I heard that noise out on the lake, I looked with my binoculars.See? No problem!Judge:Hmm...You used binoculars? Very well. You may begin your cross-examination, Mr. Wright.Phoenix:(This one'd better be good!)Cross Examination-- How Edgeworth Was Seen --Lotta:Yer right. It was a cold night, and the mist was thick as grits.PressPhoenix:Phoenix:So? How could you see Edgeworth!?Lotta:Now, just hold your horses for a second! You hasty Yankee types'd never find a gal where I'm from.Judge:Defense attorneys have trouble with that as it is.Phoenix:(Nobody loves me...)Lotta:So, once I was finished setting up my camera, I got back in the car.PressPhoenix:Phoenix:Your \"camera\"...?Lotta:Yeah. It's got an automatic...Karma:Karma:The issue we are concerned with here is Ms. Hart seeing Mr. Edgeworth! The camera has nothing to do with this at all!Judge:Objection sustained.Phoenix:(Argh! He's not letting her answer any of my questions!)Lotta:Still, I brought my binoculars with me.PressPhoenix:Phoenix:\"Binoculars\"?Lotta:Yeah, binoculars.Phoenix:Yesterday, you mentioned that you were out looking for shooting stars, correct?Lotta:Well... yeah.Phoenix:Wouldn't you need a telescope, not binoculars, for that?Lotta:...!Phoenix:I've got doubts about your camera, too! Was that really to take pictures of meteor showers?Karma:Karma:The camera is irrelevant to this case!Phoenix:You can't say that for certain!Judge:Hmm... Mr. Wright. Is the camera really relevant to this case? If you believe it is, you may continue with this line of questioning.Karma:But know this! If you find nothing with this, there will be consequences!Judge:Well, Mr. Wright? Do you wish to press further about the camera?Press furtherPhoenix:(This is make-it-or-break-it time!) The camera is of utmost importance, Your Honor. It is, perhaps, the key to this entire case! Therefore, I will continue my line of questioning! (Wow! Maybe I went a little overboard there...)Judge:Very well! Ms. Hart! You will testify to the court about the camera!Lotta:Yeah, yeah, I hear ya.Changes statement from \"Still, I brought my binoculars with me.\" to \"The camera was set up to take pictures of a meteor shower.\"Hold backPhoenix:Okay, Your Honor... I withdraw my question. (I have to remember who I'm dealing with! I bet von Karma wants to trap me so he can put me in contempt! I think I'll hang back for now and see what happens.)Karma:Hah!Leads back to cross-examinationLotta:The camera was set up to take pictures of a meteor shower.PressPhoenix:Phoenix:Ms. Hart. What made you choose that lake to photograph meteors? You know the fog gets thick on that lake. It's not very suited to stargazing.Lotta:Yeah, well... Y'see, I... I guess I wasn't thinking too straight! Har!Karma:Karma:Mr. Wright! I will not have you badgering my witness because of her challenged intellect!Lotta:Now wait a minute!Karma:Continue your testimony. You were saying how it was that you saw Edgeworth?Lotta:Grr...Karma:No unnecessary comments, please.Present Lotta's CameraPhoenix:Phoenix:You were photographing shooting stars? That's a lie!Lotta:S-says who!?Phoenix:I saw the camera you set up yesterday. It was pointed directly at the lake! You have to point a camera upwards to take photos of the stars, Ms. Hart!Leads to:\"Ooof!\"Present Lake PhotoPhoenix:Phoenix:You were photographing shooting stars? That's a lie!Lotta:S-says who!?Phoenix:Take a look at this photograph. This was taken on an automatic setting, was it not?Lotta:Y-yeah, that's right.Phoenix:You have to point a camera upwards to take photos of the stars, Ms. Hart! But, as this photograph clearly shows... The camera was pointed directly at the lake!Leads to:\"Ooof!\"Lotta:When I heard that noise out on the lake, I looked with my binoculars.PressPhoenix:Phoenix:If there was a heavy fog, how would binoculars change that at all?Lotta:What do you mean?Phoenix:Even binoculars can't see through fog! But... you say you clearly saw him?Lotta:Er... I did... yeah.Karma:Enough! There is no room for doubt in her testimony!Phoenix:(Hmm. She sounded pretty doubtful to me! But... I have to find a clear contradiction first.)Phoenix:(I don't care how many von Karmic objections I get... I'm going to find a hole in this testimony if it's the last thing I do!)Lotta:Ooof!Judge:Mr. Wright! What are you driving at?Phoenix:The witness was not at the lake to photograph shooting stars, Your Honor!Lotta:...!Judge:W-well then, what exactly was she photographing?Show evidenceLeads to:\"Your Honor! Take a look at this...\"I don't knowPhoenix:Well... that I don't know.Karma:Karma:What the witness takes photos of is entirely her business! This has nothing to do with the case! Not to mention that you can't even show us another reason why she might have been there. Mr. Wright... If you are out of material, I suggest we end this mockery of a cross-examination.Phoenix:(Uh oh... I can't let the trial end like this! I have to show them something!)Leads to:\"Your Honor! Take a look at this...\"Phoenix:Your Honor! Take a look at this... What was Ms. Hart trying to photograph at the lake?Present Gourdy ArticlePhoenix:Leads to:\"Ms. Hart.\"Present anything elsePhoenix:Phoenix:Well, Your Honor? What do you think?Judge:I... think I'm confused.Karma:Wrong again, Mr. Wright. So very wrong. You can't get through this one with your weak bluffs!Phoenix:Y-Your Honor! Enough playing around! Here's the real evidence!Judge:\"Enough playing around\" is my line, Mr. Wright!Phoenix:Uh...Leads back to:\"What was Ms. Hart trying to photograph at the lake?\"Phoenix:Ms. Hart. This is what you were trying to photograph!Judge:What's this? A newspaper article? \"Gourdy\"...? Ah, the sighting at Gourd Lake...Phoenix:Well, Ms. Hart?Lotta:I... I never heard of no lake monster! You got proof or something? Let's see you prove that I was down at the lake trying to photograph this \"Gourdy.\"I don't have proofPhoenix:Well, I don't have proof...Karma:Karma:Bah! Your ineptitude is entertaining, Mr. Wright, but enough is enough! I've had enough of baseless claims made without a hair of evidence to support them!Phoenix:Phoenix:Well all right, if that's how you want to play... I'll show you evidence!Judge:Mr. Wright! Are you sure about this?Phoenix:(I'm sure sick of that smarmy prosecutor putting me down! Or... did he taunt me so I'd get mad and make a mistake?)Leads to:\"Very well, let's see it.\"I have proofPhoenix:I have it! Proof!Judge:Hmm... Intriguing!Leads to:\"Very well, let's see it.\"Judge:Very well, let's see it. And... no joking around this time, please. Here is proof that the witness was trying to photograph Gourdy, the lake monster!Present Lotta's CameraPhoenix:Phoenix:The proof, Ms. Hart, is your own camera!Lotta:...!Phoenix:You camera was set to take photos in response to loud noises, correct? Thus this photograph here, taken when a gun fired on the lake.Lotta:...Phoenix:And here, this article about \"Gourdy.\" According to this article... Gourdy made a loud noise when it emerged! Well? You were trying to photograph Gourdy, weren't you! That's why you had set your camera to respond to loud noises!Leads to:\"Order! Order!\"Present Gourdy ArticlePhoenix:Phoenix:The proof is this article about Gourdy the lake monster!Lotta:...!Phoenix:According to this article... When Gourdy breaks through the water, it makes a loud noise! Which is why you set up your camera with that microphone! You had it set to respond to loud noises! And that's how you got this picture when the pistol fired!Leads to:\"Order! Order!\"Present anything elsePhoenix:Phoenix:Here's my proof! It's simple!Judge:... If it's simple... then why have you obviously made an error, Mr. Wright?Phoenix:Urk...?Lotta:What's that!?Karma:Go home. Consider a career change.Phoenix:(Gah! How can they so casually toss aside this eviden... Oh. Whoops. Wrong evidence.)Judge:Luckily for you, I'm in a patient mood, Mr. Wright. One more time please.Leads back to:\"Here is proof that the witness was trying to photograph Gourdy, the lake monster!\"Judge:Order! Order! I see... I, too, thought it was a little strange.Phoenix:(Yeah, sure!) Well, Ms. Hart? You were camping there to try and take a photo of Gourdy, weren't you?Lotta:... Yeah. Not bad. Are all you lawyers that smart? So, smart boy, I was down there trying to photograph Gourdy, you got me. So what?Phoenix:Huh...?Lotta:That don't change what I saw, does it?Karma:Exactly! What you just used several precious minutes of our time to prove... is nothing more than that the witness is an idiot who thinks monsters exist!Lotta:H-hey!Karma:But, as she so succinctly said, so what!? It changes nothing!Phoenix:(Not true! You were hiding the whole thing about Gourdy for some reason, I know it! But what could it have been...? Whatever it is, I'm getting to the bottom of this!)Judge:Ms. Hart. Why did you hide the fact that you were searching for Gourdy from the court? Please revise your testimony.Lotta:... Right. Fine, I'll testify. It won't change nothing, though.Phoenix:(Something will change... it has to! And I'm going to spot it!)Karma:...Witness Testimony-- Lotta's New Testimony --Lotta:Actually, I'm not a research student at a university.I'm an investigative photographer.Imagine what a scoop it'd be if I got a picture of that monster!That's why I was camping out by the lake.But, that's all I was hiding.When I heard the \"bang\" I looked right straight out at that lake.There wasn't much else to look at, so I just watched that boat the whole time.Then I saw a flash, near one of the men's hands, and I heard another gunshot.I was looking right at that boat, the whole time, cross my heart and hope to fry.Judge:Hmm... Well, Mr. Wright. You may cross-examine the witness.Karma:Karma:The witness's testimony is unchanged from before! Whether she is a research student or a photographer has no bearing on this case! There is no need to waste more of our time with another pointless cross-examination!Judge:Er... hmm.Phoenix:Phoenix:I claim the defense's right to cross-examine the witness, Your Honor! (von Karma's up to something, I know it! He doesn't want me to cross-examine her because... why? Was there a contradiction?)Judge:Very well. You may begin the cross-examination. You seem sure of yourself, you must have something in mind.Karma:Hah! That would be a first!Phoenix:(Hah hah, very funny.)Judge:You understand that this is your last chance at a cross-examination, Mr. Wright? If there is no problem with the testimony this time, we will let the witness leave. I will announce my verdict at that time, Mr. Wright. Understood?Phoenix:Yes, Your Honor.Cross Examination-- Lotta's New Testimony --Lotta:Actually, I'm not a research student at a university.PressPhoenix:Phoenix:Then what manner of person are you!?Lotta:I'm not sure I'm high-falutin' enough to be called a \"manner\" of anything.Lotta:I'm an investigative photographer.PressPhoenix:Phoenix:An \"investigative photographer\"?Lotta:Yep. You get your photo, and sell it to the press. It's that kind of business. Hey, I was taking pictures at my sister's graduation last year... N' guess what!Phoenix:Umm... what?Lotta:There was a yoofoh just a' hanging in the sky!Phoenix:A \"yoofoh\"...?Lotta:You know, an \"Unidentified Flying Object\"? A yoofoh! That's when I had sort of a revelation. I knew I should become an investigative photographer!Phoenix:I... I see. (Kind of a shaky basis for a career...)Lotta:Imagine what a scoop it'd be if I got a picture of that monster!PressPhoenix:Phoenix:Is \"Gourdy\" really all that newsworthy?Lotta:Heck yeah! They even had him up on the TV!Phoenix:(I'm not sure that appearing on the local news \"rumor of the month\" show qualifies. Last month's show was \"Bigfoot Sighted on Acorn Hill,\" I believe.)Lotta:Hey! They also had a picture of him in the newspaper! For real!Judge:Mr. Wright. This is one fight I do not believe you can win. Let's keep moving, shall we?Phoenix:Yes, Your Honor.Lotta:That's why I was camping out by the lake.PressPhoenix:Phoenix:That's why you put the automatic senior on your camera?Lotta:Yep. Borrowed it from a friend at a university. It analyzes every sound it picks up, and when it gets a \"bang!\"...Phoenix:It snaps a shot.Lotta:Yep.Phoenix:So, how many pictures has it taken so far?Lotta:The only time the camera triggered was that night.Phoenix:(Hmm...)Lotta:But, that's all I was hiding.PressPhoenix:Phoenix:I think it's time you told us why you felt you had to hide your true purpose at the lake.Lotta:Heck, if word got out what I was up to, the lake'd be swarmin' with competitors!Phoenix:Competitors...?Lotta:Yeah! Second-rate shutterbugs trying to steal my scoop!Phoenix:Ah... Is that the only reason you were hiding the truth?Lotta:W-well, actually...Karma:Karma:Mr. Wright! I'll not have you asking questions with no relevance to this case!!!Phoenix:(Whatever you say, von Karma. I know you told her to keep quiet.)Lotta:When I heard the \"bang\" I looked right straight out at that lake.PressPhoenix:Phoenix:Exactly what sort of sound was it?Lotta:Well, I never heard one before so I can't say for sure... but it sounded like a gunshot. It was a lot sharper a sound than I would have expected.Phoenix:(Hmmm...)Present Gourdy ArticlePhoenix:Leads to:\"Ms. Hart!\"Lotta:There wasn't much else to look at, so I just watched that boat the whole time.PressPhoenix:Phoenix:There wasn't \"much else to look at\"?Lotta:Yep.Phoenix:(I dunno. If she heard a bang... and she thought Gourdy was out there... I kind of doubt she'd waste any time looking at a boat.)Lotta:What? What did I do now? What're you giving me that look for?Phoenix:(Definitely suspicious... Maybe it's time for some evidence...)Karma:Witness! Continue.Lotta:Hold your hushpuppies, pops, I'm getting there.Present Gourdy ArticlePhoenix:Leads to:\"Ms. Hart!\"Lotta:Then I saw a flash, near one of the men's hands, and I heard another gunshot.PressPhoenix:Phoenix:Was there nothing on the lake but the boat at that time?Lotta:Huh? Wait, so you're thinking maybe he was shot from some other place? I don't think so, nope. The lake was smooth as glass, and nobody was on the shore, neither.Phoenix:(Hmm...)Present Gourdy ArticlePhoenix:Leads to:\"Ms. Hart!\"Phoenix:(I'd better find some sort of contradiction in this testimony... I won't be able to beat von Karma any other way... There has to be something!)Phoenix:Ms. Hart! Were you REALLY looking at that boat!?Lotta:W-what's with you!? Course I was looking at it! It was the only thing out there! Any normal person'd be looking at it!Phoenix:I agree, any normal person would. But you are far from normal!Lotta:Wh-what!? Y'all wanna step over here and say that!?Phoenix:You were camping at the lake to take a picture of Gourdy! Think about it-- What would you do if you heard a loud noise? You'd be scanning the lake for any sign of Gourdy, that's what! You wouldn't give the boat a second thought!Lotta:Aah!Judge:Order! Continue, Mr. Wright!Phoenix:You testified that you were watching the boat through binoculars! However, you wouldn't need binoculars to watch that boat! You needed them to search for Gourdy... and that's what you were doing!Lotta:...! ... ...Phoenix:Well!?Lotta:Hmph... Well, now that y'all mention it... I did sort of take my binoculars and kind of scan the lake a bit... I mean, Gourdy might be out there, n' all...Judge:M-Ms. Hart! A-are you saying that you were NOT watching the boat, then?Lotta:... S-sorry, y'all. I wasn't fibbing, really. I was, just... I thought y'know, I could be witness to a murder n' all! I kinda got excited. I was sure I was watching that boat... till now.Judge:... This... this is totally uncalled for--Lotta:B-but hey! You got the photograph! You got proof!Judge:Hmm... Still, we can't see who is shooting who in this.Lotta:Right! Right! That's why I took this photo n'...Karma:Karma:Witness... That's enough. You've had a long day. Shut your pie-hole.Lotta:Sh-shut my what!?Phoenix:(What was she going to say? She took the photo... and what? Wait a second...)Gumshoe:She even had a photograph to prove it.Phoenix:But you really can't tell from the photo who is shooting.Gumshoe:That's why she said she's going to enlarge the photo. She said \"it'll drop the quality a mite, but should let us see who's who!\"Phoenix:(She enlarged that photo! Why won't von Karma let her show it? I've got a hunch! I bet that enlarged photo shows something bad for von Karma! This is my chance! If I'm wrong, though, it'll mean prison for Edgeworth... or worse. What should I do!?)Make her show the enlargementLeads to:\"Ms. Hart! Look at this photograph.\"Wait and see what happensPhoenix:(If this is a trap... I'd better hold back and see how things go. But... if I wait now, the cross-examination will be over! Can I really risk that!?)Do nothingJudge:This hereby ends the cross-examination of Ms. Lotta Hart.Karma:And none too soon. That was a flagrant waste of my time.Judge:Mr. von Karma, do you have anything to add?Karma:I stated everything I needed to when this trial began. Decisive evidence. A decisive witness. What else could possibly be required?Judge:Nothing, of course.Phoenix:(Oh no! I should have pressed further!)Judge:This court sees no reason to further prolong the trial. Nor is there any need for more time to decide the case against the defendant. This case is extremely clear. I see no room for misinterpretation of the facts. This court find the defendant, Mr. Miles Edgeworth...GuiltyJudge:The accused will surrender to the court immediately, to be held pending trial at a higher court within a month from today's date. That is all. The court is adjourned!Game overRethink positionPhoenix:(I have to fight now or I could lose everything!)Leads to:\"Ms. Hart! Look at this photograph.\"Phoenix:Ms. Hart! Look at this photograph. You enlarged this photograph, did you not?Lotta:Y-yeah! I did!Phoenix:Why has that enlargement not been presented to the court!?Karma:Karma:B-because it does not exist!Lotta:What're y'all talking about!? You were the one who told me not to show it in court in the first place! You old fool!Judge:What's the meaning of this, Mr. von Karma!Karma:Er... erm...Phoenix:Ms. Hart! Show the photo to the court! Show us the enlargement!Karma:Karma:The prosecution objects to the submission of this evidence!Judge:Objection... denied. The witness will show the enlargement to the court.Lotta:Here it is.Judge:Hmm. We still cannot see who is firing in this. It could be the defendant... or maybe it's not. Regardless, I'll accept this as evidence.Lake Photo added to the Court Record.Karma:Happy now, Mr. Wright?Phoenix:Hmm... (There has to be something!)Karma:You asked for the enlargement, you got the enlargement. And little good it has done any of us! That's why I requested she not show it!Judge:Hmm... I suppose this means that the cross-examination...Karma:Is over! Obviously!Judge:Then, I would like to close the cross-examination of Ms. Lotta Hart.Karma:And none too soon. That was a flagrant waste of my time.Judge:Mr. von Karma, do you have anything to add?Karma:I stated everything I needed to when this trial began. Decisive evidence. A decisive witness. What else could possibly be required?Judge:Nothing, of course. Then, I believe it is time for me to declare my verdict.Phoenix:(Wait... it's not supposed to go like this! There has to be a clue in this photo... somewhere! This is bad! Real bad! What should I do!?)Object to the enlargementLeads to:\"Your Honor!\"Show other evidencePhoenix:W-wait! Your Honor, This evidence...Karma:Karma:I believe we have spent enough time talking about evidence!Judge:Hmm... indeed. We've heard opinions on every piece of evidence but this enlargement. I see no point in retracing our steps.Leads back to:\"This is bad! Real bad! What should I do!?\"Wait and seePhoenix:(Uh oh... think of something! No good... I guess I'll just sit back and see how this turns out.)Judge:Very well! Allow me to state my verdict.Phoenix:(Oh no! I should have pressed further!)Judge:This court sees no reason to further prolong the trial. Nor is there any need for more time to decide the case against the defendant. This case is extremely clear. I see no room for misinterpretation of the facts. This court find the defendant, Mr. Miles Edgeworth...GuiltyJudge:The accused will surrender to the court immediately, to be held pending trial at a higher court within a month from today's date. That is all. The court is adjourned!Game overPhoenix:Your Honor! There is something decidedly strange with this enlargement!Judge:W-what might that be? Mr. Wright... You will show the court what you mean! What about this photo is \"strange\"?Phoenix:(Okay... here goes nothing! I'll show the judge what's strange about this photo.)Present shooter's hand or pistolPhoenix:Leads to:\"Here, Your Honor!\"Present shooterPhoenix:Phoenix:Here, your honor!Judge:The shooter...? I'm not sure I understand. What about the shooter is strange? Can you be more specific?Phoenix:(Specific, right...)Leads back to:\"I'll show the judge what's strange about this photo.\"Present anywhere elsePhoenix:Phoenix:Here, Your Honor!Judge:Where...? Mr. Wright, I understand you're in a tight spot. However! You have nothing to gain by making baseless claims of faulty evidence!Phoenix:Y-Your Honor! Never mind that... my, my finger slipped! Please let me show you again!Judge:Hmm...Leads back to:\"I'll show the judge what's strange about this photo.\"Phoenix:Here, Your Honor!Judge:The shooter...? I'm not sure I understand. What about the shooter is strange?Phoenix:Look at the hand holding the pistol, Your Honor!Judge:The hand...?Phoenix:That hand directly contradicts another piece of evidence!Judge:This man's left hand does what...!?Phoenix:Let me show you. I'll show you the evidence that left hand contradicts!Present PistolPhoenix:Leads to:\"The evidence is clear.\"Present anything elsePhoenix:Phoenix:(Hmm... I'm not sure this warrants a \"take that!\" I'd better think this one through!)Judge:Mr. Wright, please hurry up. We haven't got all day.Phoenix:Y-yes, Your Honor! Right away!Leads back to:\"I'll show you the evidence that left hand contradicts!\"Phoenix:The evidence is clear. The man in this photograph is holding that pistol in his left hand. However! The prints on the murder weapon were from Edgeworth's \"right hand\"! Ergo! The man shooting the pistol in this photograph... Is not Mr. Edgeworth!!!Judge:Now that everyone in the courtroom has quieted down... I would like to reconvene this court of law! Mr. Wright.Phoenix:Yes, Your Honor.Judge:You have given us definitive proof today. We now know that it was not Mr. Edgeworth who fired the pistol that night. However... This leaves us with a rather large problem. If Mr. Edgeworth didn't do it, then who shot our victim?Karma:Precisely! As we have seen, there were no other people on the lake that night! Who but the defendant could have shot the victim!?Ms. HartPhoenix:Who else but the witness, Ms. Lotta Hart!Judge:Wh-what!? Do you have proof of this!?Phoenix:(Proof-shmoof! Always with the proof! Oh... wait, I do need proof, don't I.)Judge:Mr. Wright! I'll have you remember this is a court of law!Phoenix:(Uh oh. The Judge is mad.)Karma:Let me ask again!Leads back to:\"Who but the defendant could have shot the victim!?\"The victim himselfLeads to:\"There is only one explanation remaining!\"LarryPhoenix:(Wait, wait--I can't do that. Sacrifice one friend to save another? What's the point!?)Karma:Well, Wright! Your answer!Leads back to:\"Who but the defendant could have shot the victim!?\"Phoenix:There is only one explanation remaining! The man who shot the victim was none other than... the victim himself!!!Judge:Order! Order! So... you are saying that the victim committed suicide?Phoenix:Yes, Your Honor. I can think of no other explanation.Judge:Hmm... Indeed, that does seem to be the only remaining option.Karma:Karma:I'm so very, very sorry, Mr. Wright. But suicide is out of the question.Phoenix:Wh-what!?Karma:An examination of the victim's wound reveals the distance at which he was shot.Phoenix:The... distance?Karma:The victim was clearly shot from further than a meter away!Phoenix:A meter! Th-that's three feet!Karma:There is no way it could have been suicide!Judge:Order! Order! Mr. von Karma! Are you sure of the accuracy of your data!?Karma:Of course! I had already considered the possibility of suicide, you see.Autopsy Report updated in the Court Record.Judge:Hmm... I see. Very well, allow me to state my opinion. Considering the situation, the shooter had to be the defendant, Mr. Edgeworth. However! The prints on the gun reveal that the shooter was not Mr. Edgeworth. This is a conundrum. Therefore, I would like to suspend proceedings for this trial for the day. The court orders the defense and the prosecution to further investigate this matter. Understood?Phoenix:Yes, Your Honor.Karma:...Judge:That is all. The court is adjourned.December 26, 1:15 PMDistrict CourtDefendant Lobby No. 2Phoenix:Whew, that was a close one.Edgeworth:...Phoenix:Hey! Don't you have anything to say!?Edgeworth:No. I have yet to be declared innocent, Wright.Phoenix:Well, yeah, but... What happened out there on that lake, anyway!? If he didn't commit suicide, then who...? The shooter was about a meter away, too!Edgeworth:... W-what? Don't give me that look! I did not kill him!Phoenix:I was just kidding around.Edgeworth:Hmph.Phoenix:Look... I'm going to go check on Maya.Edgeworth:Oh... Wright.Phoenix:What?Edgeworth:Tell her something for me.Phoenix:What?Edgeworth:... ... ... Tell... Tell her to watch what she says in court. That's all.Phoenix:(Would it kill you to just state how you really feel with a \"thanks\", Edgeworth?) (Changed from [Yeah, I'm sure she'll be happy to hear you say that, Edgeworth. Jerk!] in the original release)Phoenix:I requisitioned a transcript of Lotta's entire testimony. I thought it might give me some ammunition for the trial tomorrow. Of course she didn't see the shooter... So the only part of her testimony that stood was the \"bang\" she heard.Lotta's Deposition added to the Court Record.To be continued.Presenting wrong evidence during testimonyPhoenix:Phoenix:Your Honor! That statement contradicts this evidence!Judge:...? It does? I don't see anything contradictory...Phoenix:Huh? Really?Judge:Objection overruled. Try to think before you make accusations, Mr. Wright!Phoenix:(Whoops! That didn't go so well.)Presenting wrong evidence during testimonyPhoenix:Phoenix:Your Honor! What do you think about the witness's statement?Judge:Uh... I'm not sure I follow?Phoenix:It clearly, er, contradicts the... um... I thought...Judge:You don't sound very convinced, Mr. Wright. Objection overruled.Phoenix:(I don't think that won me any points with the judge...)Presenting wrong evidence during testimonyPhoenix:Phoenix:This evidence clearly reveals the contradiction in that statement, Your Honor!Judge:How exactly are that evidence and the statement just now related...?Phoenix:They aren't, are they...Judge:Not at all. Mr. Wright, please think the facts over before making accusations.Phoenix:(I don't think that won me any points with the judge...)Presenting wrong evidence during testimonyPhoenix:Phoenix:The witness's statement is clearly faulty, Your Honor!Judge:... I'm sorry, but I can see nothing faulty. Unfortunately, I will have to penalize you, Mr. Wright.Phoenix:(Ugh. I must be on the wrong track?)Too many penaltiesJudge:This court sees no reason to further prolong the trial. Nor is there any need for more time to decide the case against the defendant. This case is extremely clear. I see no room for misinterpretation of the facts. This court find the defendant, Mr. Miles Edgeworth...GuiltyJudge:The accused will surrender to the court immediately, to be held pending trial at a higher court within a month from today's date. That is all. The court is adjourned!",
  "turns": []
}