{
  "previousContext": "Turnabout Goodbyes\nTranscript\nPart 1\nPart 2\nPart 3\nPart 4\nPart 5\nPart 6\nEpisode 4Turnabout Goodbyes\nIt's been, what, 15 years?\nAbout that, yes.\n15 years is a long time to wait... You can't imagine how much I've suffered...\nYou... suffered?\nAnd now... the perfect opportunity presents itself. At last... I shall have my revenge!\nWhat!?\n...Merry Christmas.\nDecember 25, 10:08 AMWright & Co. Law Offices\nMaya:\nHey, hey, Nick! Do you know if there's any good waterfalls around here?\nPhoenix:\nWaterfalls...? Dare I ask why?\nMaya:\nDuh, Nick! Isn't it obvious? I need a waterfall to stand under! Preferably a freezing one!\nPhoenix:\n... Oh... Is that part of your spirit medium training?\nMaya:\nOf course! Except, I've been slacking off lately... I need to brave the elements and be forged anew under the rushing spring waters!\nPhoenix:\nUmm... Okay... I don't know about any falls per se, but Gourd Lake is pretty close...\nMaya:\nOh. Darn.\nPhoenix:\nSorry, but them's the breaks. Couldn't you just take a cold shower or something?\nMaya:\n... Good idea!\nPhoenix:\n(So much for the rushing spring waters...)\nTV:\nNext in the news... A large, unidentified animal was sighted at Gourd Lake! The town is buzzing with excitement! Locals are calling it \"Gourdy\" in a tip of the hat to Nessie, the Loch Ness monster. Though its namesake, Nessie, proved to be a hoax... locals are confident their Gourdy is the real deal. ...\nPhoenix:\n*yawn* Bor-ing. Can't they show real news for a change?\nMaya:\nNick?\nPhoenix:\n?\nMaya:\nThe water pressure's kind of low in that shower.\nPhoenix:\n... You want more pressure, huh? Why don't you go down to the fire department and have them spray you with the hose?\nMaya:\n... Good idea, Nick!\nPhoenix:\n(Apparently, Fey blood is no aid in detecting sarcasm...) (Changed from [Apparently, E.S.P. is no aid in detecting sarcasm...] in the original release)\nTV:\nWe interrupt this program to bring you a special news bulletin! Strange occurrences continue at Gourd Lake... But this time, it's murder!\nPhoenix:\n(Gourd Lake again?)\nTV:\nThe body of a man was found in the lake early this morning. A suspect was apprehended. Sources inside the police department revealed... that the suspect's name is Miles Edgeworth, age 24. Edgeworth was an up-and-coming prosecution attorney, known for his skill and connections. He was guaranteed a long and rewarding career... Has he thrown it all away?\nPhoenix:\n(...? E-Edgeworth!?) What's going on!? Edgeworth would never do something like--\nMaya:\nNick?\nPhoenix:\nYipes! M-Maya!\nMaya:\nThe fireman yelled at me when I called him.\nPhoenix:\nWe've got bigger things to worry about than that! They arrested Edgeworth!\nMaya:\nWhat? You mean, the prosecutor?\nPhoenix:\nYeah, he's a suspect... in a murder!\nMaya:\nWhaaaaat!? When? Where? Whom? Why? How?\nPhoenix:\nI-I don't know!\nMaya:\nLet's go find out, Nick!\nExamine\nBookshelf\nPhoenix:\nDifficult-looking legal books stand in a formidable row. They mock me. I tried reading one, and it made my head hurt. When I closed it, it slipped out of my hand. Then my foot hurt too.\nCharley the plant\nPhoenix:\nMia's favorite plant. Its name is \"Charley.\" Maya's gotten the knack of watering it lately. Charley's been perking up these days.\nDesk\nPhoenix:\nMia's desk. If we had more clients, I would probably sit here more often. Lately, I've been spending more time on the couch, watching TV.\nMovie poster\nPhoenix:\nMaya brought in a poster of the Steel Samurai the other day. We had a big fight over whether to put it up or not. I know she's just waiting for a chance to sneak it up on the wall.\nWindow\nPhoenix:\nLooks like it's cleaning day again at the hotel across the way. I hear they're planning a second branch outside the city. I can see the bellboy, getting the angle of that screwdriver in the drawer just right.\nTalk\nWhat to do\nPhoenix:\nWell, what should we do?\nMaya:\nWhat do you mean!? Let's investigate! We should talk to Mr. Edgeworth, and check out the crime scene!\nPhoenix:\n(You're right... We need more information! Save aimlessness and confusion for later!)\nAny ideas\nPhoenix:\nWell? Got any good ideas?\nMaya:\nNot really. I do my best thinking when I'm standing underneath a waterfall.\nPresent\nAttorney's Badge\nPhoenix:\nYou know, I think it's developing a nice luster.\nMaya:\nI'll look at your badge later, Nick. We've got work to do!\nPhoenix:\n(I suppose you're right...)\nDecember 25Detention CenterVisitor's Room\nMaya:\nYou know, Nick... We've all been in here one time or another, haven't we?\nPhoenix:\nI guess it comes with the territory.\nMaya:\nI'm not sure it's something we should mention to too many people... Aah!\nPhoenix:\n... Hey! Edgeworth! Come back!\nEdgeworth:\nWhat are you doing here!?\nMaya:\nNick, I don't think he's in a very good mood.\nPhoenix:\nWell, he is in detention. Were you in a good mood when you were here?\nEdgeworth:\nSo, you've come to laugh at the fallen attorney? Then laugh, laugh! Well? Why aren't you laughing?\nMaya:\nNick... Should we be laughing?\nPhoenix:\nNah. It's a trick. Laugh and he'll get mad... or burst into tears. Edgeworth. We don't have so much free time we can spend it coming down here to laugh at you.\nEdgeworth:\n... Yes you do.\nPhoenix:\n(Actually, he's right.)\nEdgeworth:\n... I hoped you wouldn't come. I didn't want you to see me. Not like this.\nPhoenix:\n(I didn't want to see you like this, either. Believe me.) (Changed from [Hey, I didn't want to see you either, believe me.] in the original release)\nExamine\nSurveillance camera\nPhoenix:\nSmile for the camera...\nSecurity guard\nPhoenix:\nThis guard monitors the visitor's room. He hasn't moved an inch since I came in. A real pro. Or maybe he's just nervous with Edgeworth in the room.\nTalk\nWhat happened\nPhoenix:\nEdgeworth. Tell me what happened.\nEdgeworth:\n... Why should I? What are you going to do about it?\nMaya:\nDuh! We're going to help you, that's what!\nEdgeworth:\n...! ... Help me? You? Don't be ridiculous.\nPhoenix:\nSorry...?\nEdgeworth:\nYou're a novice! You've only been in three trials!\nPhoenix:\nH-hey!\nEdgeworth:\nSure, you got lucky and won all three... But your luck's bound to run out some day! You need real skill, Wright. Experience!\nPhoenix:\n...\nMaya:\nNick! He's insulting you! Nick? Why am I always the one who has to get angry!?\nGourd Lake\nPhoenix:\nThe murder took place at Gourd Lake, correct?\nEdgeworth:\nYes... late last night.\nPhoenix:\nThe lake is a long way away from your offices and the court... Why were you down there?\nEdgeworth:\n... I see no need to tell you.\nMaya:\nM-Mr. Edgeworth! You... you didn't really...?\nEdgeworth:\n... Gourdy.\nMaya:\nHuh?\nEdgeworth:\nI went to see Gourdy.\nMaya:\n\"Gourdy\"? What's that!?\nPhoenix:\nI'll... tell you later. (Why won't Edgeworth talk to us?)\nDid you do it (appears after \"What happened\", \"Gourd Lake\", and presenting Attorney's Badge)\nPhoenix:\nEdgeworth... this is really hard for me to ask... But... you didn't do it, right? Right?\nEdgeworth:\n... Think what you will. I have only one request.\nPhoenix:\nHuh?\nEdgeworth:\nStay out of this case.\nMaya:\nWhy!? B-but Nick is trying to help you!\nEdgeworth:\nI know...! I know that! But I don't want your help, okay?\nMaya:\n!!! Why not?\nEdgeworth:\n... Look, just go away, and leave me alone!\nMaya:\nNick... Mr. Edgeworth did it, didn't he.\nPhoenix:\nMaya! Let's go investigate elsewhere.\nMaya:\nBut, Nick...\nPresent\nAttorney's Badge\nEdgeworth:\nYour attorney's badge...?\nPhoenix:\nEdgeworth. Let me defend you.\nEdgeworth:\n... Hah! Hah hah! Good one, Wright. But I'm not that hard up. Not yet.\nMaya:\nWh-what do you mean by that?\nEdgeworth:\nMe? Trust a wet-behind-the-ears lawyer with only three trials under his belt? Never!\nMaya:\nWh-what!?\nEdgeworth:\nMy case is near hopeless, Wright. Every defense attorney I've talked to has turned me down.\nPhoenix:\nWhat?\nEdgeworth:\nSimply put, they were afraid they'd lose. It occurred to me that it might be my fault that they lack confidence. After all, I did get every single one of their clients declared \"guilty.\"\nPhoenix:\nI don't believe it!\nEdgeworth:\nRegardless, I don't want you involved in this. You in particular I cannot ask to do this.\nDecember 25Gourd Lake ParkEntrance\nMaya:\nThis is where it happened?\nPhoenix:\nYeah. Gourd Lake is in the middle of this park.\nMaya:\nI can see some police walking around in there.\nPhoenix:\nQuestioning people, probably.\nMaya:\nHey! Isn't that Detective Gumshoe over there?\nGumshoe:\nWell, pal!? There's enough of us here! Anyone found anything?\nPolice:\nS-sorry, sir... Nothing.\nGumshoe:\nIdiot! The trial's tomorrow! We need clues, on the double!\nPolice:\nB-but, sir... There weren't any clues... that's why we arrested that attorney, Mr. Edgeworth! It's clear, sir. He's the one who--\nGumshoe:\nShaddup! Just you try saying that again! I'll... I'll... I'll make you sorry if you do! (Changed from [I'll... er... I'll make you sorry if you do!] in the original release) So just... just, get outta my face, pal! (Changed from [I mean... just, get outta my face, pal!] in the original release)\nPolice:\nY-yes, sir!\nMaya:\nDetective Gumshoe's kinda scary today!\nGumshoe:\nRecruits... peh! ... Aah!\nMaya:\nEek!\nGumshoe:\nHey, you're that Harry guy! Harry Butz!\nPhoenix:\nWright! Phoenix Wright! (Will he ever learn my name!?)\nGumshoe:\nAnd just what are you doing here, pal? Investigating!?\nPhoenix:\nHuh? Um, well, yes. I suppose.\nGumshoe:\nWell, I'm here to help! Ask me anything you want! Bring it!\nMaya:\nHe seems different than usual. I wonder what's up? Umm... Mr. Edgeworth hasn't actually asked us to defend him yet...\nGumshoe:\nHuh!? Oh? Y-you don't say...\nExamine\nTrees\nPhoenix:\nI feel winter's chill from the bare leaf trees today... *sigh* What is it about winter that turns people into poets?\nMaya:\nI don't know, but my toes are starting to feel numb.\nPhoenix:\n(Yes... my poetry has that effect on some people.)\nSign\nPhoenix:\nThe sign says \"Gourd Lake Nature Park.\" This place is full of families picnicking on the weekend.\nMaya:\nBut... no waterfall.\nPhoenix:\nNot many picnickers come here for spiritual training, Maya.\nTalk\nWhat happened\nPhoenix:\nDetective Gumshoe? Do you know what happened here?\nGumshoe:\nHuh? You don't know, pal?\nPhoenix:\nNo...\nGumshoe:\nWow, okay, Mr. Head-in-the-fluffy-pink-clouds Lawyer.\nPhoenix:\nHead-in-the... huh?\nGumshoe:\nNever mind, I'll tell you. It happened last night, about 15 minutes after midnight. There was a boat out on Gourd Lake. In that boat were two men. One of those men shot the other with a pistol.\nMaya:\nAnd... the shooter was Mr. Edgeworth?\nGumshoe:\nA cop who arrived on the scene arrested him.\nMaya:\nHow did they get there so fast? (Changed from [How did he get there so fast?] in the original release)\nGumshoe:\nWell... There was a witness. When the report came in, we raced to the lake.\nPhoenix:\nA witness?\nEdgeworth\nMaya:\nYou don't think Mr. Edgeworth is a... murderer, do you!? (Changed from [You don't think Mr. Edgeworth is a... murderer!?] in the original release)\nGumshoe:\nAbsolutely not! It's impossible! I don't care if there's a witness either! I don't believe a lick of it!\nMaya:\nR-right! Who cares what the witness says!\nPhoenix:\n(I care!)\nMaya:\n... You really believe in him, don't you, Detective?\nGumshoe:\nCourse I do! But... the police are pretty sure he's the killer. Nobody's even really taking this investigation that seriously.\nMaya:\nOh no!\nGumshoe:\nAfter all the help Mr. Edgeworth has been to us... Hard to imagine that no one's standing up to take his side.\nMaya:\nWell, at least you are, Detective. At least you are.\nDefense request\nMaya:\nDo you know who will be Mr. Edgeworth's defense attorney in tomorrow's trial?\nGumshoe:\nHe hasn't got one yet.\nMaya:\nWhat? The trial IS tomorrow, isn't it?\nGumshoe:\nWell, I don't know the whole story... But apparently no one he's been talking to will take his case.\nMaya:\nW-why not?\nGumshoe:\nMr. Edgeworth won't tell me! When you guys showed up, I figured he'd asked you to defend him.\nPhoenix:\nU-unfortunately not...\nGumshoe:\nWell, pal, then you got a job to do! Help out Mr. Edgeworth! Prove that badge you wear isn't just some fancy piece of metal! Prove it to me, pal! Show me you're an attorney!\nDefense request (after presenting Attorney's Badge in Detention Center - Visitor's Room)\nMaya:\nI-is it true? No one will take Mr. Edgeworth's case?\nGumshoe:\nYeah... He's a bit of a celebrity. If you defended him, and lost, your reputation'd be sure to suffer. What's more... The case against him is... well, it's pretty solid.\nPhoenix:\n(I suppose it would be if they have a witness.)\nGumshoe:\nHey! Pal! Don't tell me your going to turn your back on him too!? Remember the Steel Samurai case? (Changed from [Remember the Steel Samurai!] in the original release) Mr. Edgeworth helped you get your client declared innocent!\nPhoenix:\nI... I know. I went to Edgeworth. I tried. He really doesn't want us to represent him. Especially not us, he said.\nGumshoe:\nWhat!? W-well, that doesn't make any sense, pal! You should have heard him talking about you after that trial! (Changed from [You should have heard him talking about you after the Steel Samurai case!] in the original release) He kept saying \"Wright, Wright, Wright,\" over and over.\nMaya:\n... Nick? I'm not sure that's a good sign.\nPhoenix:\nNeither am I...\nGumshoe:\nWhy wouldn't he want your help? I don't get it.\nThe witness (appears after \"What happened\")\nPhoenix:\nWho was this witness?\nGumshoe:\nEr, sorry, pal. That's confidential. Anyway, the witness saw everything, apparently. I'm sure they'll turn up at the trial tomorrow.\nPhoenix:\nWas there only that one witness?\nGumshoe:\nYep. It was pretty cold out on the lake last night. And, it was Christmas Eve after all. Still, we're being thorough. You never know when you're going to turn up another witness. That's why we're here today, checking things out. So far, we're coming up empty...\nMaya:\nOh! It's Christmas today! I'd forgotten. What are you getting me for Christmas, Nick?\nPhoenix:\nTalk to Santa.\nPresent\nAttorney's Badge\nGumshoe:\nThat badge! You're showing that to the wrong guy, pal! You gotta show that to someone who needs it!\nAfter clearing all Talk options:\nPolice:\nDetective Gumshoe, sir!\nGumshoe:\nWhat? Find something!?\nPolice:\nUm, no, sir. Not yet. But there was a call from the precinct. They want to hold an investigation briefing...\nGumshoe:\nA briefing? Right! I'm off! Oh... Sorry, pal. I guess you heard. I gotta go. Any last things you want to ask me about before I head back?\nThe autopsy report\nMaya:\nWell, yes. Do you have any information on the victim...?\nGumshoe:\nSorry... They haven't worked up the autopsy report yet. I'm still waiting for it myself. Actually... Say, if you get the time, drop by the precinct! We can talk more there, pal!\nLeads to:\n\"You're not coming back, Detective?\"\nHow to get in touch with you\nLeads to:\n\"You're not coming back, Detective?\"\nPhoenix:\nYou're not coming back, Detective?\nGumshoe:\nErm... Probably not, pal.\nPhoenix:\nSo, what should we do if we have something to talk to you about...?\nGumshoe:\nAh, right. Here, I'll show you how to get to the precinct. Come down and see me anytime.\nDetective Gumshoe gave you directions to the police station.\nPhoenix:\nOh, hey! Detective Gumshoe!\nGumshoe:\nW-what!?\nPhoenix:\nUm, we'd like to take a look around in the park. Can we walk around?\nGumshoe:\nYeah! No problem, pal. You got my permission.\nMaya:\nYou know, Nick. I think there's something to be said for talking to people when they're busy.\nPhoenix:\nYeah. They don't have time to think about not giving you information...\nMaya:\nRight! Now, let's get investigating!\nDecember 25Police DepartmentCriminal Affairs\nMaya:\n... Looks like Detective Gumshoe isn't here.\nChief:\nSomething wrong, miss? Hmm? Turning yourself in? Okay, what did you do? Shoplifting? Larceny? Public indecency...?\nMaya:\nN-no! None of those things! We're looking for Detective Gumshoe... is he around?\nChief:\nGumshoe? Oh yeah. He's in a meeting right now. I don't think he'll be out any time soon.\nMaya:\nOkay, we'll come back.\nChief:\nYou do that. Oh, and go straight home and stay out of trouble. No more shoplifting, you got that?\nMaya:\n... Do I look like a criminal or something?\nExamine\nPoster\nPhoenix:\nA poster of a female police officer... Wait, no. That's the latest \"Babes in Uniform\" calendar. My bad.\nDetective\nPhoenix:\nThat must be one of the detectives. He's mumbling something to himself.\nPolice:\n\"...your mama could see you know she'd be crying'... ...a break and spit it out, you lowlife scumbag...\"\nPhoenix:\n... He must be doing image training for interrogations.\nDesk\nPhoenix:\nThese are the detectives' desks. There are computers and files on each one. Funny, they're a lot tidier than I'd expect. I guess the detectives don't spend a lot of time at their desks.\nBlue Badger\nPhoenix:\nHey, is that the police department's mascot...?\nChief:\nThat's the \"Blue Badger\"! It was my idea! I made it! It's my mascot!\nPhoenix:\nI... see. How nice.\nChief:\nI'll get him assigned mascot of the Criminal Affairs Dept. if it's the last thing I do!\nPhoenix:\nUm, good luck!\nChief\nPhoenix:\nThis must be the chief of the detectives here. He's glued to his computer screen.\nChief:\nWha...!? \"Gourd Lake...!\" \"Gourdy sighted\"!!! I don't believe it!\nPhoenix:\n(Shouldn't you be reading something more important...?)\nDecember 25Gourd LakePublic Beach\nMaya:\nWowsers! This is \"Gourd Lake\"?\nPhoenix:\nYup. I'm not sure it warrants a \"wowsers,\" though.\nMaya:\nHmm. Probably not. But hey, look at that snack stand!\nPhoenix:\n\"Samurai Dogs\"...?\nMaya:\nI wanna Samurai Dog! Please! I bet they're great!\nPhoenix:\nWith a name like Samurai Dog, how could they not be?\nMaya:\nThey're a little behind the times, though. The kids are all into \"The Pink Princess\" now. I mean, like, y'know!?\nPhoenix:\n(Nope.)\nExamine\nLake\nMaya:\nWow. Gourd Lake is really big.\nPhoenix:\nYeah.\nMaya:\nSay, Nick. Why is it called \"Gourd Lake\"?\nPhoenix:\nOh. Well, a long time ago, they used to grow gourds here.\nMaya:\nWhoa! No way! I was sure it was because the lake looked like a gourd when viewed from above! You know, like an hourglass shape?\nPhoenix:\nWell, it is shaped like a gourd, actually. But that's just a coincidence.\nMaya:\nOh. Okay.\nTrash can\nPhoenix:\nThe trashcan is empty. At least the place is well maintained.\nBench\nPhoenix:\nA lineup of plastic benches. I guess the idea is you buy a dog and eat it here. I doubt anyone would sit here and eat on a day like this. Except maybe Maya... if she had a Samurai Dog.\nSign\nPhoenix:\nHuh... I almost didn't see that signpost. \"Left - Boat docks\" \"Right - Exit\"\nVendor stand\nPhoenix:\nA hotdog stand. It's closed... The Christmas fringe looks a little half-baked. The banner reads \"Samurai Dogs\"... Somebody needs to redecorate.\nPopper\nMaya:\nHuh. Someone left some poppers here. You know, you pull the string... (Changed from [Huh. Someone left one of those poppers here. You know, you pull the string...] in the original release)\nPhoenix:\n...And it goes \"pop.\" Yeah, I know the ones. You see them a lot around New Year's.\nMaya:\nHey, Nick! They might be a clue! (Changed from [Hey, Nick! It might be a clue!] in the original release) Let's take them. (Changed from [Let's take it.] in the original release)\nPhoenix:\nC'mon, admit it. You just want to pop them, right? (Changed from [C'mon, admit it. You just want to pop it, right?] in the original release)\nMaya:\nWas it that obvious?\nPhoenix:\n(Poppers... hmm.) (Changed from [A popper... hmm.] in the original release)\nTake them (Changed from [Take it] in the original release)\nPhoenix:\nI suppose it couldn't hurt. Huh? Where'd they go? (Changed from [Huh? Where'd it go?] in the original release)\nMaya:\nInto my pocket. (Changed from [I already put it in my pocket.] in the original release)\nPoppers put in pocket. (Changed from [Popper put in pocket.] in the original release)\nLeads back to examination\nLeave them (Changed from [Leave it] in the original release)\nPhoenix:\nNah, let's leave them. (Changed from [Nah, let's leave it.] in the original release)\nMaya:\nAww, listen to your inner child a little, Nick!\nPhoenix:\n(Maybe if you outer child would be quiet for just a moment, Maya!)\nLeads back to examination\nWright & Co. Law Offices\nPresent\nAnything else\nMaya:\nNick! If we don't hurry Mr. Edgeworth will get the death sentence!!!\nPhoenix:\nWhoa! O-okay! Let's go check things out.\nDetention Center\nPresent\nAnything else\nEdgeworth:\nWhat's that? I'm not in the mood for idle banter, Wright.\nDecember 25Boat Rental Shop\nMaya:\nNick... what is this place?\nPhoenix:\nA boat rental shop. Closed for Christmas it seems. I guess a murder taking place on one of the boats won't be good for business, either.\nMaya:\nBoats... I've never ridden on a boat.\nPhoenix:\nReally? Well, how about we go out on one when the trial is finished?\nMaya:\nHey, good idea! You bet!\nExamine\nTrees\nPhoenix:\nThere's more forest off that way. I doubt I'd find any helpful clues in there.\nShop\nPhoenix:\nA small boat rental shop. Doesn't look like anyone is around. They're probably closed because it's Christmas.\nBoats\nPhoenix:\nThere are some boats floating at the dock. Was one of these boats used in the murder, I wonder?\nMaya:\nNick?\nPhoenix:\nHuh?\nMaya:\nI changed my mind. I don't really want to go for a boat ride.\nDecember 25Gourd Lake Woods\nMaya:\nI like it here, Nick. Look... someone's camping!\nPhoenix:\nThey've got guts, camping at the scene of a murder.\nMaya:\nHey, hey, Nick! If they were camping here last night, they might know about the murder!\nPhoenix:\n(That's true...) Good call, Maya. Let's go talk to them.\nExamine\nCamera\nMaya:\nHey, Nick. Check out this camera!\nPhoenix:\nYeah... what's with the big mic and that box on top, I wonder? It looks like some sort of automatic system for taking a photo when a noise is heard.\nMaya:\nWow! Hey, let's see if it works! *cough* \"Hi, I'm Nick!\" ... Maybe I'm not saying it loud enough. \"YO! I'M NICK!!!\" ... Huh. NIIIIIIIIII......IIIIIIIIIICK!\nPhoenix:\nWill you stop that?\nMaya:\nI think it's broken, Nick.\nPhoenix:\nD-don't kick it! (It must not be set up to respond to voices.)\nCamera (after Popper is added to the Court Record)\nLeads to:\n\"This camera has a mic and some sort of attachment.\"\nTrees\nPhoenix:\nThe trees grow quite thick here. Further back, the trees fade into the shadow where the sunlight can't reach them.\nSign\nPhoenix:\nThe sign says \"No Camping.\" Funny place to pick to pitch your tent.\nMaya:\nWait, what if the sign said \"No Setting Tents on Fire\"?\nPhoenix:\n... I don't think they have signs like that.\nMaya:\nOh...\nSheet\nPhoenix:\nThere's food and some magazines on the sheet. It takes a pretty tough skin to camp in this cold.\nCampfire\nMaya:\nHey, Nick!\nPhoenix:\nWhat, don't tell me you're hungry again?\nMaya:\nNo, no. I was just wondering, why are camping pots and pans made of aluminum?\nPhoenix:\n... They didn't talk about that in any of the law books.\nMaya:\nSo, there's no law saying they have to be made out of aluminum, then!\nPhoenix:\n(I'm not having this conversation...)\nSUV\nPhoenix:\nThis SUV has seen better days. It's dented all over. I can't believe anyone would drive their car down here.\nPhoenix:\nThis camera has a mic and some sort of attachment. It must take pictures when triggered by a noise.\nMaya:\nWow! Cool! Let's try it out! *cough* \"Hi, I'm Nick!\" ... Maybe I'm not saying it loud enough. \"HEY! I'M NICK!!!\" ... Huh. NIIIIIIIIII......IIIIIIIIIICK!\nPhoenix:\nWill you stop that?\nMaya:\nMaybe it's broken?\nPhoenix:\nD-don't kick it! Maybe it isn't set up to respond to voices?\nMaya:\nWell what then? These things? (Changed from [Well what then? I know!] in the original release)\nPhoenix:\nThe party poppers...? (Changed from [The party popper...?] in the original release)\n*BANG*\nklik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik\nMaya:\n... Well. It responded. (Changed from [... Yep. It responded.] in the original release)\n???:\nYaaaaaaaaaaaaaaw! Hey, you! Git yer hands offa' that!\nMaya:\nEek!\n???:\nWhat in the Sam Hill...!? Look what ya done now! There goes a whole roll of film!\nMaya:\nAh? Wha... huh? S-sorry!\n???:\nSorry's nice but it don't pay my bills! Y'all know how much a roll of that film costs!?\nMaya:\nI-I'll pay you back!\n???:\nWhat were ya'll thinkin' settin' off a party-popper in a place like this?\nMaya:\nUh... well...\n???:\nWhat! Don't try to play stupid with me just 'cause you think I'm some country bumpkin! Yeah, I know how y'all Yanks think! \"I say, those southern folks talk with that exaggerated drawl, why they must be dumb!\" Well let me tell you, just because I might be dumb don't mean we all are!\nMaya:\nN-Nick, help!\n???:\nAnd who are you, now? Her chaperone?\nPhoenix:\nYeah, uh, no, rather, uhh... we're sort of... friends?\n???:\nJus' figure out what y'all are gonna say and say it for bejeezum's sake! Gawd, I'd rather sit through one of papa's drawls than listen to you stutter all day.\nPhoenix:\n(Oh boy... I guess we should pay her for the film...)\n???:\nWatch it!\nPhoenix:\nYes ma'am. (On second thought, I'll pay later...)\nMaya:\nI'm really sorry!\nExamine\nCamera\nPhoenix:\nThis camera is rigged to respond to noise. But it only responds to loud noises... like a party popper.\nTalk\nAny option\nPhoenix:\nUmmm...\n???:\nWhat!? Can't ya see I'm changin' the film on my camera here! Someone--I'm not namin' any names--but someone used up a WHOLE ROLL.\nMaya:\nSorry...\nPhoenix:\n(That didn't work... I wonder if I have anything to show her that would get her attention...)\nPresent\nAttorney's Badge\nLeads to:\n\"I, er, this is my badge.\"\nPhoenix:\nI, er, this is my badge.\n???:\nHuh? Aren't badges supposed t' be all shiny and impressive? You a cop or something?\nPhoenix:\nUmm... I'm a lawyer.\n???:\nWh-what!? Y'all ain't gonna try and pull one o' them lawsuits on me over that film now? Cause I'll have you know I'm a fighter and I wrassled meaner looking' things'n you!\nPhoenix:\nN-no, that's not it at all. We're here investigating a murder that took place here, on the lake.\n???:\nA murder...? ... Sounds cool! Why didn't y'all say that in the first place! Go ahead, ask me anything ya like!\nPhoenix:\n(Finally! Some cooperation!)\n???:\nYou too. Y'all can come out of hiding now. I won't bite. Hard.\nPhoenix:\n(Come to think of it, where did Maya get to?)\nMaya:\nS-sorry... I-I was feeling a little overwhelmed. The culture gap and all...\n???:\nNever you mind, honey. I kin' talk Yank for ya if... ahem... if it pleases you?\nMaya:\nTh-thanks. I think I'll be okay.\nLotta:\nGreat then! I'm Lotta, Lotta Hart, but y'all can call me Lotta! I'm here photographing meteor showers for a research project. Mighty pleased ta meet ya!\nTalk\nWhat happened\nLotta:\nOh yeah, when was that murder, anyway? I ain't seen much television lately.\nPhoenix:\nIt happened late in the night on Christmas Eve.\nLotta:\nThat so? Christmas Eve?\nPhoenix:\nA man on a boat was shot... Did you see anything?\nLotta:\nWell, lemme see. A boat, ya say? I reckon I mighta seen one... not sure though. Y'all gotta remember I've been watching this here lake for a good three days now. I seen enough boats to choke a mule. Kinda hard to remember which I seen when.\nLotta\nMaya:\nSo, what is it you do, Lotta?\nLotta:\nHuh? Me? Hah hah. Y'all don't really want to know that, do ya? Actually, I'm a research student at Country U., right in the heart of the heartland.\nMaya:\nWow! Neat! Nick! She's a research student at a university! Country U.!\nPhoenix:\nUh... so I hear.\nMaya:\nSo, when did you come up here?\nLotta:\nHmm, lemme see... I guess it was 'bout three days ago.\nPhoenix:\nWhat are you photographing?\nLotta:\nD-didn't I tell y'all that already? Meteors! Yep, meteor showers!\nPhoenix:\n(Falling stars...?)\nThe camera (appears after \"What happened\")\nMaya:\nThat's quite a camera you have there.\nLotta:\nY'all better know it! It's German-made. A genuine Solingen!\nPhoenix:\n(Isn't that where they make knives...?)\nMaya:\nUmm... So, what's that device you have stuck to the camera?\nLotta:\nHuh? Device?\nMaya:\nIt started moving all by itself when I fired my party popper...\nLotta:\nOh that? That triggers the shutter whenever it detects certain sounds. It's programmed to pick up loud noises right now.\nMaya:\nA programmable camera! Neat!\nLotta's Camera added to the Court Record.\nThe camera (subsequent times)\nMaya:\nThat's quite a camera you have there.\nLotta:\nY'all better know it! It's German-made. A genuine Solingen!\nPhoenix:\n(Isn't that where they make knives...?)\nMaya:\nUmm... So, what's that device you have stuck to the camera?\nLotta:\nHuh? Device?\nMaya:\nIt started moving all by itself when I fired my party popper...\nLotta:\nOh that? That triggers the shutter whenever it detects certain sounds. It's programmed to pick up loud noises right now.\nMaya:\nA programmable camera! Neat!\nPresent\nAttorney's Badge\nLotta:\nSo yer a lawyer, huh? Tell the truth, yer badge is a lot more impressive than you are.\nMaya:\nHah hah!\nPhoenix:\n*glare*\nMaya:\nHah... hah... oh. Ahem.\nLotta's Camera\nLeads to:\n\"Lotta?\"\nPhoenix:\nLotta?\nLotta:\nYeah?\nPhoenix:\nSo, your camera... it triggers on loud explosion noises?\nLotta:\nAyup.\nPhoenix:\nActually, the victim in the case we're researching--he was shot with a pistol.\nLotta:\nA pistol...?\nPhoenix:\nRight. Now wouldn't a gunshot make a similar noise to our party popper...?\nLotta:\nI guess it would.\nPhoenix:\nYour camera... didn't get a picture of the murder, did it?\nLotta:\n... Hey! Y'all are pretty bright!\nPhoenix:\nHuh?\nLotta:\nI see what yer sayin'... Tell ya what, I'll have a look-see at my film.\nPhoenix:\nIt would have been a photo taken late last night...\nLotta:\nI checked 'em once, don't remember if there was anything on 'em though. But what if I got sumtin'! I could be witness to a genuine murder! Yeehaw! I'll go check that film. Y'all come back now, y'hear?\nMaya:\nShe went inside her SUV. I guess we should come back later...\nWright & Co. Law Offices\nPresent\nLotta's Camera\nMaya:\nWho was that with the camrea...? Lotta something? Let's go talk to her about that photograph!\nAfter presenting Lotta's Camera in Gourd Lake Woods:\nDecember 25Police DepartmentCriminal Affairs\nMaya:\n... I guess Detective Gumshoe is still in that meeting.\nGumshoe:\nHey! Thanks for coming down, pal!\nMaya:\nDetective Gumshoe!\nGumshoe:\nWe just finished the meeting. For better or for worse...\nPhoenix:\n(I get the feeling we're in for some bad news...)\nExamine\nDetective\nPhoenix:\nThat must be one of the detectives. He's mumbling something to himself.\nPolice:\n\"All right, hands against the wall, all o' you... Don't even think about escaping! I got eyes in the back of my head!\"\nPhoenix:\n... He must be doing image training for arrests.\nTalk\nThe victim\nPhoenix:\nDo you know anything about the victim yet?\nGumshoe:\nNo, no... Still can't I.D. him.\nMaya:\nHas Mr. Edgeworth said anything?\nGumshoe:\nNot a word.\nThe meeting\nPhoenix:\nSo, how did the meeting go?\nGumshoe:\nI can't tell you, pal! You're a lawyer!\nPhoenix:\nT-true...\nGumshoe:\n... Y'know... I don't know what to believe anymore. Sure, Mr. Edgeworth's human like you or me. Still... I get the feeling that if he'd done something wrong, he wouldn't go hiding it. That's just the kind of guy he is. Why can't anyone else see that?\nMaya:\nSo, they think that Mr. Edgeworth did it...?\nGumshoe:\nWell, the trial's starting tomorrow, as scheduled.\nMaya:\nI see...\nGumshoe:\n...\nPhoenix:\nUmm... hey, in the end you did tell us about the meeting!\nGumshoe:\n... Don't go telling anyone else, pal.\nPhoenix:\nY-yes, sir!\nGumshoe:\nAnd... do me a favor! Stand by Mr. Edgeworth! He needs help, and you're the ones to help him! I'm sure he's got some reason why he won't talk to us.\nMaya:\nThanks, Detective Gumshoe.\nTrusting Edgeworth (appears after \"The meeting\")\nMaya:\nDetective Gumshoe... How come you trust Mr. Edgeworth so much?\nGumshoe:\nWell, I'd think that was obvious. We got a strong working relationship, us two. We trust each other, and that's how it works.\nMaya:\nA \"working relationship\"?\nGumshoe:\nSee, Mr. Edgeworth always gets his defendants declared \"guilty\" every time. Yeah, his methods might be a little extreme at times. But... there's a reason! He trusts our investigation, see? He trusts us to get the right man! That's why I work extra hard, pal. We've got to earn that trust he places in us.\nMaya:\nI see...\nGumshoe:\nMr. Edgeworth is a man you can trust... And you have my word on that!\nThe autopsy report (appears after \"Trusting Edgeworth\")\nPhoenix:\nI was wondering, did you ever get that autopsy report?\nGumshoe:\nOh, that? Yeah, I made a copy for you.\nAutopsy Report added to the Court Record. (Changed from [Added Autopsy Report to the Court Record.] in the original release)\nPhoenix:\nThank you.\nMaya:\n...Nick?\nPhoenix:\nHuh?\nMaya:\nCan you show me that photo of the victim? ... That face...!\nPhoenix:\nSomeone you know?\nMaya:\nI... I don't know. I just have this feeling that I met him somewhere a long time ago. ...\nThe autopsy report (subsequent times)\nMaya:\n...\nPhoenix:\n(Maya seems lost in thought.) You remember anything?\nMaya:\n...\nPhoenix:\n(Guess not.)\nPresent\nAutopsy Report\nGumshoe:\nWell, I hope it helps you, pal.\nPhoenix:\nThanks, Detective.\nAnything else\nGumshoe:\nSorry, I'm drawing a blank right now.\nWright & Co. Law Offices (after clearing \"The autopsy report\" Talk option in Police Department - Criminal Affairs)\nMaya:\n...\nPhoenix:\nWhat is it?\nMaya:\nOh. Nothing... Just, something's been bothering me. ... Could you show me that autopsy report once more? ... ... ... Hey! I-I remember now! This guy! This is a lawyer that was at that office Mia worked at! I met him once when I went there to hang out with Sis!\nPhoenix:\nThat office...? Wait! You mean Grossberg's office?\nMaya:\nRight! That guy!\nPhoenix:\n(That was the last name I expected to come up... Maybe I should go talk to him... for old time's sake.)\nTalk\nWhat to do\nPhoenix:\nWell, what should we do?\nMaya:\nHmm... The police have pretty much made up their minds that Mr. Edgeworth did it. And Mr. Edgeworth won't tell us anything. I guess we could go look for clues down by the lake?\nPhoenix:\nRight.\nAny ideas\nPhoenix:\nWell? Penny for your thoughts?\nMaya:\nThoughts... Thoughts... Yeah, why won't Mr. Edgeworth tell us anything? And... and... And why did he refuse to ask for our help? What a jerk!\nPresent\nAutopsy Report\nMaya:\nNick... This person was a lawyer at Grossberg's office. Let's go talk to him! Mr. Grossberg, I mean, not the dead guy.\nDecember 25Grossberg Law Offices\nPhoenix:\nIt's been a while since I was here last. Mr. Grossberg is out as usual.\nMaya:\nHey, Nick. Look at the wall.\nPhoenix:\n(That painting is still missing... Mia must have known about the deal with Mr. Grossberg and Redd White... She kept track of all of White's extortion and blackmail rackets.)\nExamine\nBookshelf\nPhoenix:\nExpensive-looking mahogany bookshelves, filled with expensive-looking books. Hmm... funny... they don't look like they've ever been read.\nMaya:\nWell then let's take them back to our office! He won't miss them!\nPhoenix:\nUh, we don't need them.\nMaya:\nThen, can we take that wooden bear?\nPhoenix:\n(Hmm. It is kind of cute.)\nDesk\nPhoenix:\nA solid mahogany desk. The wood's been polished to a deep luster.\nMaya:\nHey, Nick! I want a desk like that in our office too!\nPhoenix:\nI don't know. I don't think I'm ready to sit at a desk like that yet.\nMaya:\nHuh? I meant for me!\nPhoenix:\nYou'd better start saving your allowance, then.\nVacant wall\nMaya:\nWhy is the wall there a different color?\nPhoenix:\nA big painting was hanging there until recently.\nMaya:\nHuh. What happened to it?\nPhoenix:\nUh... well, he gave it to someone.\nMaya:\nI bet he gave it to some romantic interest! Love blooms eternal, Nick!\nPhoenix:\nUh... yeah.\nPotted plant\nPhoenix:\nAn expensive potted plant. No idea what kind of plant it is, but it's probably the most expensive one available.\nMaya:\nI think our Charley is cuter.\nPhoenix:\nRight. He's a really cute... plant.\nTable\nPhoenix:\nA table for clients. Hmm... an elegant ebony case, and if I'm not mistaken, that lighter's made of solid gold. Even I can tell someone here's got money to burn.\nMaya:\nWe should put things on our client table too.\nPhoenix:\nI'm not really into smoking.\nMaya:\nWe could put out candy, or gum.\nPhoenix:\nClassy...\nDetention Center\nPresent\nAutopsy Report\nEdgeworth:\n... I'm sorry. I can't think of anything I want to say about that.\nAfter clearing \"The autopsy report\" Talk option in Police Department - Criminal Affairs:\nDecember 25Gourd Lake Woods\nLotta:\nHey y'all!\nMaya:\nLotta!\nLotta:\nWait up a sec! We got bingo!\nMaya:\nBingo...?\nLotta:\nMy automatic camera took two pictures last night!\nMaya:\nHey!\nLotta:\nThis is them. Take a look!\nPhoenix:\nWait...!\nLotta:\nSee? See? He's shooting him with that pistol!\nPhoenix:\nI-it looks like that, yes.\nMaya:\nBut you can't really tell who that is shooting.\nLotta:\nYeah, well there was enough fog out there last night t' strangle a bullfrog. But, y'know... Seeing these photos reminded me of something.\nMaya:\nWhat...?\nLotta:\nI saw the murder happen. I'm a witness!\nMaya:\nWhaaaaaaa!?\nPhoenix:\nA-are you serious!?\nLotta:\nCourse!\nPhoenix:\n(How do you forget... never mind.)\nLotta:\nY'all reckon I should tell the cops?\nI reckon so\nPhoenix:\nI... reckon so!\nLotta:\nWhat's that? Now don't y'all go tryin' to mock my accent! I'm a sensitive lady!\nLeads to:\n\"Hey, so, I'm off to talk to the cops.\"\nI reckon no\nPhoenix:\nI... reckon no!\nLotta:\nWhat's that? Now don't y'all think y'all can pull one over on me just cause you speak the lingo! I know enough to know that when you see a murder, you'd best tell the cops! It's my obligation as a citizen!\nLeads to:\n\"Hey, so, I'm off to talk to the cops.\"\nLotta:\nHey, so, I'm off to talk to the cops. Y'all can have this photo. Later.\nPhoenix:\nW-w-wait! Lotta!\nLotta:\nWhat? Can't y'all see I'm kinda busy?\nPhoenix:\nT-tell us what you saw, too! Please?\nLotta:\nNice try, honey, but I wasn't born yesterday. I'm a witness, and that means I'm on the side of justice, and that means the cops! I'd sooner eat the south side of a north-bound skunk than tell you!\nMaya:\nL-Lotta!\nLotta:\nDon't let it get your skivvies in a bunch. Friends today, enemies tomorrow! Or was that the other way round? No matter. I'm gone! Hey! Maybe they'll let me do some testifying! Hot darn!\nMaya:\nShe left... ... Well, that's one more witness. What do we do now, Nick?\nPhoenix:\n(Well, if she saw something, there's not much we can do about it. The question is: what exactly did she see...? I guess we'll find out in the trial tomorrow.)\nLake Photo added to the Court Record.\nExamine\nCamera\nPhoenix:\nAn expensive-looking camera faces the lake. Next to it is a large microphone and a blue plastic sheet. Hmm. Looks like a computer is attached to the camera.\nDecember 25Gourd LakePublic Beach\nMaya:\nLooks like the police have given up their interviewing. (Changed from [Looks like the police have given up their questioning.] in the original release)\n???:\nHey!\nMaya:\nAah! N-Nick! I think Santa's mad at you!\n???:\nLong time no see, Nick.\nMaya:\nNick... you know Santa!? Wow... Nick and St. Nick... Hey! I see the connection!\nPhoenix:\nDon't be ridiculous!\n???:\nDude, it's me!\nPhoenix:\nL... Larry! What are you doing here!?\nButz:\nIsn't it obvious? I'm working my day job! I sell Samurai Dogs! Want one? Gotta get money for dates, you know, My girl Kiyance deserves the best!\nPhoenix:\n(K-Kiyance...? Not another model, I hope...)\nButz:\nOh, Kiyance's a fine, fine woman, Nick. It was her idea that I wear this costume! She was all \"You go girlfriend!\" Y'know? She bought this costume for me!\nPhoenix:\nThat... that's great, Larry.\nMaya:\nWow! A Santa costume! She must be really nice!\nButz:\nWhoa! Cute! Nick! Who's she? She's not your...?\nPhoenix:\nNot my... what? N-no, she's not!\nMaya:\nI'm his partner, Maya Fey. I'm, uh, the little sister.\nButz:\nSister...? ... Wow, Nick, must be tough. Working nine to five, having to take care of a little sister...\nMaya:\nN-no, I'm not Nick's sister, I'm my older sister's little sister...\nButz:\nHuh. Sounds great!\nPhoenix:\n(Don't worry, Maya, he's not listening...)\nExamine\nBench\nMaya:\nHey, Nick, benches! Let's take a break... maybe have a dog?\nPhoenix:\nI think not. It's too cold to sit and eat hotdogs out here!\nMaya:\nWimpy city boy! You should try standing under a freezing waterfall some time!\nStand\nPhoenix:\nI can't get over the Samurai Dogs...\nMaya:\nThe \"Original\" Samurai Dogs, no less.\nButz:\nHey, man, whoever calls their product the \"original\" first wins!\nPhoenix:\nWhy don't you add \"world-famous\" to the sign?\nButz:\nHey, good idea!\nPhoenix:\n(What have I done...?)\nTalk\nWhat happened\nPhoenix:\nHey, Larry. There was a murder here last night... And since you work here... Have you heard anything? (Changed from [You work here. Have you heard anything?] in the original release)\nMaya:\nNick, you're wasting your time. Last night was Christmas Eve! He was with Kiyance, obviously! He wouldn't have been standing out here in the cold!\nButz:\nOof!\nMaya:\n?\nPhoenix:\nI think what you just said caught him off guard, Maya.\nButz:\nN-no, it's just... Kiyance's not in town right now. She... she's in Hawaii on a photo shoot.\nPhoenix:\n(A model. I knew it.) Well, anyway, there was a murder here on the lake. The trial's tomorrow.\nButz:\nHuh. Neat.\nPhoenix:\nThe defendant is Edgeworth. Miles Edgeworth.\nMaya:\nUm, Nick? Why would Larry know Edgeworth...?\nButz:\nWhoa, Nick! You don't mean THAT Miles Edgeworth!? Old Edgey!?\nPhoenix:\nYeah. He's a murder suspect.\nButz:\nWh-whoa! Murder?\nMaya:\nHuh? You know Mr. Edgeworth, Larry?\nButz:\nYeah! Of course! Edgey was in the same class as us in grade school!\nMaya:\nWhaaaaaaaaat!?\nSamurai Dogs\nMaya:\nUmm... umm... tell me about the dogs!\nButz:\nHuh? Oh, you mean the Samurai Dogs?\nMaya:\nW-why are they Samurai Dogs? I... I mean they kind of look gourd-shaped.\nButz:\nOh, well originally, they were Gourd Dogs! Y'know, like \"guard dogs\"?\nMaya:\nOuch...\nButz:\nThe Samurai thing was Kiyance's idea. Oh, she's my woman, y'know. She was all \"change the name and you go girlfriend!\" She made me that banner! Man, the kids can't get enough of those Samurai Dogs!\nMaya:\nErr... Something about that just seems... wrong.\nButz:\nOh, and guess what? We're getting a ton of customers here at the lake, what with the big news!\nMaya:\nThe \"big news\"...?\nButz:\nYeah! Gourdy!\nMaya:\nG-\"Gourdy\"...?\nEdgeworth (appears after \"What happened\")\nMaya:\nSo, Mr. Edgeworth was your classmate, Larry?\nButz:\nYeah, Nick, him, and I used to hang out all the time.\nMaya:\nWow... I never knew.\nButz:\nDon't get me wrong. He's always been kind of a stick in the mud. Studying all the time, trying to \"be like father.\"\nMaya:\nLike his father...?\nButz:\nYeah. Edgey's pop was a famous defense lawyer back in the day.\nMaya:\nWow. Wait... You said \"defense lawyer\"?\nButz:\nYeah.\nMaya:\nWait a second! But Mr. Edgeworth is a prosecuting attorney!\nButz:\nWhat? Edgey's got a proboscis on his knee!?\nMaya:\nNo, no--he's a \"prosecuting attorney.\" That's like the total opposite of a defense lawyer!\nButz:\n... Huh. Go figure! He always used to talk about defending the \"weak\" who were \"unable to defend themselves.\" Man, he used to go on and on about man's duty to society and all that. What a bore! I wonder what changed his mind, though? Do you know, Nick?\nPhoenix:\n...\nMaya:\nNick...?\nGourdy (appears after \"Samurai Dogs\")\nMaya:\nUmm... what's \"Gourdy\"?\nButz:\nHuh? You mean you don't know? It's here, in this very lake! A giant, mysterious monster! Gourdy!\nMaya:\nA... monster?\nButz:\nYeah. Check it out. This is an article from yesterday's newspaper. There's a photo!\nMaya:\nWow! It's r-really real! Nick! A monster! A real monster!\nPhoenix:\nUmm... yeah. (It's probably just a log or something... right?) Hey... there's a quote here from the person who took the photo. Hmm? What's this? \"I set the camera to automatic, and when we got into the frame... I heard a loud 'bang'! Like an explosion... followed by the sound of something slipping into the water...\"\nMaya:\nI wish I could have seen it!\nPhoenix:\n(Why would there be a sound like an explosion...?) Larry. Could I borrow this article from you?\nButz:\nSure, no problem. That'll be one million dollars!\nMaya:\nO-one million...?\nPhoenix:\n(Grow up, Larry.)\nGourdy Article added to the Court Record.\nGourdy (subsequent times)\nMaya:\nHey Nick, show me that article once more. \"I set the camera to automatic, and when we got into the frame... I heard a loud 'bang'! Like an explosion... followed by the sound of something slipping into the water...\" How romantic! And cool! I mean, to think, a real monster!\nButz:\nYeah. I'm just glad I'm selling more dogs!\nPresent\nAttorney's Badge\nButz:\nHuh? Oh, that's your attorney's badge, isn't it? Dude, you really helped me out back in that trial. S-sorry, I can't really pay you.\nPhoenix:\n(Cause you blow it all on \"Kiyance\"...!)\nButz:\nBut... you can have all the dogs you want!\nMaya:\nR-really!?\nPhoenix:\nLarry... If you let her at your dogs, you won't have any left for the other customers.\nButz:\nHey, no problem. If that's what makes her happy, y'know?\nPhoenix:\n(How many times do I have to remind you that it was ME who got you off the hook!)\nLotta's Camera\nButz:\nWhazzat?\nPhoenix:\nIt's a camera. You take pictures with it.\nButz:\nHuh?\nMaya:\nL-Larry! You mean you don't know what a camera is!?\nButz:\nC-course I know! Hey, you're looking at a bona fide junior high graduate! I was talking about the weird contraption on that camera!\nPhoenix:\nOh, that. Well... it's hard to explain. Just forget about it.\nButz:\nWell don't go showing me it, then! Geez!\nAutopsy Report\nPhoenix:\nHey Larry, you know this guy?\nButz:\nWho's this?\nPhoenix:\nI don't know. That' why I asked you.\nButz:\nWho's this, Maya?\nMaya:\nWell...\nLake Photo\nButz:\nW-what's this? You know, my eyes have been getting pretty bad lately, Nick...\nPhoenix:\nActually, the photo's blurry, Larry. It was taken last night.\nButz:\nLast night...?\nAnything else\nButz:\nSorry, Nick. I don't know much about that. I'm just a simple vendor of Samurai Dogs, dig?\nDecember 25Police DepartmentCriminal Affairs\nMaya:\n... Not a Gumshoe in sight.\nPolice:\nIf you're looking for Detective Gumshoe, he's in the questioning room. Apparently, an important witness turned up. He'll be in there for a while.\nMaya:\nLotta Hart... it has to be.\nPhoenix:\nUh oh...\nExamine\nDetective\nPhoenix:\nThat must be one of the detectives. He's mumbling something to himself.\nPolice:\n\"...move in the crowd. Wear drab clothes... Never enter the target's field of vision...\"\nPhoenix:\n... He must be doing image training for trailing.\nDetention Center\nPresent\nLake Photo\nEdgeworth:\nHmph... Who would have thought there'd be a photo...?\nPhoenix:\nEdgeworth... Did you shoot him?\nEdgeworth:\n... What do you think, Wright?\nPhoenix:\nI don't think you're the kind to point a gun at anyone, no.\nMaya:\nSo you didn't shoot him?\nEdgeworth:\nNo, I didn't. It wasn't me.\nAfter clearing all Talk options in Gourd Lake - Public Beach:\nDecember 25Grossberg Law Offices\nGrossberg:\n*Ah-HHHHEM!*\nPhoenix:\n(Ah, that old familiar clearing of the throat!)\nGrossberg:\nAh hah! You're Mia's... something, are you not?\nPhoenix:\nI was her understudy, yes. Phoenix Wright.\nGrossberg:\nAh hah! And you, you're Mia's... something too, are you not?\nMaya:\nHer little sister, yes!\nGrossberg:\nYou've grown! You've come to look a lot like your sister, you know? It takes me back. \"Ahh... the days of my youth... like the scent of fresh lemon...\" you see.\nPhoenix:\nUm, Mr. Grossberg, sir?\nGrossberg:\nHmm...? Ah, yes. I beg your pardon. Of course you came here to discuss something. What is it then? Something the matter?\nTalk\nWhat happened\nPhoenix:\nThere was a murder last night...\nGrossberg:\nA murder?\nPhoenix:\nYou haven't heard...?\nGrossberg:\nI, er, just got up, you see.\nPhoenix:\nWell, Miles Edgeworth shot someone with a pistol.\nGrossberg:\nEdgeworth!? What!? W-who!?\nPhoenix:\nWell, the identity of the victim is still unknown.\nGrossberg:\nT-this is terrible news indeed!\nPhoenix:\n(I guess he hadn't heard anything...)\nThat painting\nPhoenix:\nMr. Grossberg? Whatever happened to that painting?\nGrossberg:\nOh, yes... I do not think it shall ever be coming back home to this office. I can't exactly claim it as stolen... I suppose it's my just desserts. Old, bitter desserts.\nRobert Hammond (appears after presenting Autopsy Report)\nPhoenix:\nWho is this Hammond guy, anyway?\nGrossberg:\nMr. Hammond... He was the defense attorney in that case...\nPhoenix:\n\"That case\"...?\nGrossberg:\nYes, the \"DL-6 Incident.\"\nPhoenix:\n\"DL-6\"...? (Why does that sound so familiar?)\nGrossberg:\nPerhaps you remember?\nPhoenix:\n(I'm sure someone mentioned it during the trial for Mia's murder.)\nGrossberg:\nThat was the incident where the police were so at a loss they used a spirit medium.\nMaya:\n...! Wait... you don't mean? Was that medium my mother?\nGrossberg:\nYes, my dear. The spirit medium, Misty Fey, your mother, contacted the spirit of the victim. But... the case was a loss. No conviction was made.\nThe DL-6 Incident (appears after \"Robert Hammond\")\nGrossberg:\nThe DL-6 Incident, yes... Happened 15 years ago. A very strange case, indeed.\nPhoenix:\nThey never caught the criminal, right?\nGrossberg:\nCorrect. Misty Fey used her powers to talk to the spirit of the late victim. Her testimony led to charges being laid against one man. But Mr. Hammond won the case and the suspect was declared innocent.\nMaya:\n... And the police blamed my mother, calling her a fraud. You were the one who helped her out then, right, Mr. Grossberg?\nGrossberg:\nEr... y-yes. Yes, quite.\nMaya:\nThank you!\nGrossberg:\nN-no... please. D-don't mention it.\nPhoenix:\n... (DL-6... Never thought I'd hear that name again...)\nMaya:\nBut wait... What does this case have anything to do with Mr. Edgeworth?\nGrossberg:\nIt has everything to do with Mr. Edgeworth, my dear! The victim in the DL-6 Incident was none other than his father, Gregory Edgeworth!\nMaya:\nWh-what!? His father!?\nGrossberg:\n... If you want to know more, you should ask him yourself. Show him this... I'm sure he'll talk to you.\nMaya:\nWait... This is a photograph of my mother!\nMisty Fey's Photo added to the Court Record.\nThe DL-6 Incident (subsequent times)\nGrossberg:\nThe DL-6 Incident, yes... Happened 15 years ago. A very strange case, indeed.\nPhoenix:\nThey never caught the criminal, right?\nGrossberg:\nCorrect. Misty Fey used her powers to talk to the spirit of the late victim. Her testimony led to charges being laid against one man. But Mr. Hammond won the case and the suspect was declared innocent.\nMaya:\n... And the police blamed my mother, calling her a fraud. You were the one who helped her out then, right, Mr. Grossberg?\nGrossberg:\nEr... y-yes. Yes, quite.\nMaya:\nThank you!\nGrossberg:\nN-no... please. D-don't mention it.\nPhoenix:\n... (DL-6... Never thought I'd hear that name again...)\nMaya:\nBut wait... What does this case have anything to do with Mr. Edgeworth?\nGrossberg:\nIt has everything to do with Mr. Edgeworth, my dear! The victim in the DL-6 Incident was none other than his father, Gregory Edgeworth!\nMaya:\nWh-what!? His father!?\nGrossberg:\n... If you want to know more, you should ask him yourself.\nPresent\nAttorney's Badge\nGrossberg:\nYou've really grown up in the past few years, my dear! How proud Mia would be if she could see you now!\nMaya:\nShe said she was more worried about me than anything.\nPhoenix:\nAww, just go on and take the compliment, will you?\nLotta's Camera\nGrossberg:\nSo, this camera on the lake takes a photo whenever it hears an explosion sound?\nMaya:\nThat's what she said.\nGrossberg:\nAnd it just happened to be set up on the beach, pointing out on the lake?\nMaya:\nYes... she said it was to photograph \"shooting stars.\"\nGrossberg:\nHmm. Shooting stars... explosions... what's the connection? I'd be suspicious of this witness of yours.\nAutopsy Report\nGrossberg:\nHmm? Strange... I feel as though I've seen this man somewhere before! ... Aaaaaaaaaaaaah!\nPhoenix:\nDid you remember!?\nGrossberg:\nHe was a lawyer! Here, in my office! That's Hammond! Robert Hammond!\nMaya:\nMr. Hammond...?\nGrossberg:\nAnd you say this is the man Miles Edgeworth shot?\nLake Photo\nGrossberg:\nSo this is the moment the crime took place, eh?\nPhoenix:\nYes.\nGrossberg:\nYou can't really say for sure that's Edgeworth. I'm not sure whether that's a good thing or a bad thing. Not sure at all...\nMisty Fey's Photo\nGrossberg:\nMisty Fey. Mother of Mia and Maya Fey. Show this photograph to Miles Edgeworth. He'll have something to say to you then.\nAnything else\nGrossberg:\nEr... my apologies. I'm not sure I can help you with that.\nWright & Co. Law Offices\nPresent\nMisty Fey's Photo\nMaya:\nMy mother... ...\nPhoenix:\n(Now that I've shown her the picture, I can't think of anything to say... That probably wasn't the best thing to do.)\nDecember 25Detention CenterVisitor's Room\nEdgeworth:\nWhat's this? I was hoping you'd gotten my message the first time.\nPhoenix:\nEdgeworth, what about your defense?\nEdgeworth:\n...! It's no concern of yours.\nPhoenix:\n(Guess he hasn't found anyone yet.)\nTalk\nWhat happened\nPhoenix:\nCan I ask you about the murder?\nEdgeworth:\nWright. I'll ask you again, just leave me alone.\nPhoenix:\n...\nEdgeworth:\nPlease try to understand. I'm not doing this to prove I'm tough, or because I look down on you. I just don't want you anywhere near this case. Understand?\nGourd Lake\nPhoenix:\nWhy did you go to Gourd Lake?\nEdgeworth:\nI have no intention of telling you.\nPhoenix:\nNor, apparently, would you tell Detective Gumshoe.\nEdgeworth:\n!\nMaya:\nDetective Gumshoe was really worried about you!\nEdgeworth:\n...\nThe DL-6 Incident (appears after presenting Misty Fey's Photo)\nEdgeworth:\nThe \"DL-6 Incident\"... was when my father died. Right before my eyes... He was shot and killed, and I saw it all.\nMaya:\n...!\nEdgeworth:\nMy memories from that time are... foggy. I suppose it's a self-defense mechanism. In any case, a suspect was arrested... a man. It's pretty clear he was the only one who could have killed my father. The spirit medium they used to talk to my late father said the same thing. It was an attorney by the name of Robert Hammond that cleared the suspect's name.\nPhoenix:\nAnd Hammond... is the victim in the Gourd Lake murder?\nEdgeworth:\nCorrect.\nMaya:\nUmm... That spirit medium... that was my mom.\nEdgeworth:\nWhat? You mean you're...? ... It's strange. I thought that terrible incident was about to end, and now... this.\nPhoenix:\n\"About to end\"?\nEdgeworth:\nThe DL-6 Incident happened 15 years ago. 15 years ago... on December 28.\nMaya:\nDecember 28?\nEdgeworth:\nThe statute of limitations on the case runs out in three days.\nPhoenix:\nWhat!?\nMaya:\nUm, Nick? What does that mean?\nPhoenix:\nWhen a case's statute of limitations runs out, legally, the case never happened.\nEdgeworth:\nThree days from now, DL-6 will be closed... forever.\nThe suspect (appears after \"The DL-6 Incident\")\nMaya:\nWhat happened to the suspect? The one who got off innocent?\nEdgeworth:\nI don't know... He disappeared from public view. Nobody knows where to. If he's still alive, he'd be about 50 years old now.\nPhoenix:\n(I guess I can understand why he'd go into hiding... It'd be hard to live a normal life after being a murder suspect in such a big case.)\nYour father (appears after \"The DL-6 Incident\")\nMaya:\nUmm... so, was your father a lawyer?\nEdgeworth:\nHe was... Gregory Edgeworth. He was quite famous at the time, apparently.\nMaya:\nSo, you were sort of trying to follow in his footsteps.\nEdgeworth:\n... I'd rather not talk about it.\nPresent\nAttorney's Badge\nEdgeworth:\nYour attorney's badge...? I can't say I really want to see one of those right now.\nMisty Fey's Photo\nEdgeworth:\n...! ...\nPhoenix:\nEdgeworth?\nEdgeworth:\nIt's only been a matter of hours since you last visited. Yet you've made incredible progress in your investigation. I'll admit it, I'm impressed, Wright. You were always single-minded in your work, though. Once you start on something, you always see it through, don't you?\nPhoenix:\nAbout the \"DL-6 Incident\"...\nEdgeworth:\nRight... DL-6. I didn't want you to find out about it. That is why I refused your offer to defend me. I'm sorry if it sounded like I thought you weren't up to the job. I just wanted to keep you away from DL-6.\nPhoenix:\nSo... do you still think it would have been better for me to stay away?\nEdgeworth:\nI don't know. But... I see no point in hiding anything from you now. Very well. Ask whatever you like, and I will answer to the best of my abilities.\nRemoves \"What happened\" and \"Gourd Lake\" Talk options, adds \"The DL-6 Incident\" Talk option\nAfter clearing all Talk options and presenting Lake Photo:\nEdgeworth:\n... Wright.\nPhoenix:\n?\nEdgeworth:\nIt pains me to ask you this now...\nMaya:\nI know! You want us to defend you!\nEdgeworth:\nYes... Will you?\nOf course we will\nPhoenix:\nAh, who could have guessed this day would come?\nEdgeworth:\nNot me.\nLeads to:\n\"This is my chance to finally pay you back.\"\nOf course we won't\nPhoenix:\nSorry, charley! No way!\nEdgeworth:\nWright...\nMaya:\nNick...!? ...\nPhoenix:\nH-hey, don't look so serious, guys! I was kidding! Just a little joke!\nEdgeworth:\nThere was nothing little...\nMaya:\n...or joke-like about it!\nPhoenix:\n(I thought it was funny...)\nMaya:\nNick! Do it over!\nPhoenix:\nYes, Your Honor. How could I refuse you, Edgeworth?\nEdgeworth:\nThank you, Wright.\nLeads to:\n\"This is my chance to finally pay you back.\"\nPhoenix:\nThis is my chance to finally pay you back.\nMaya:\nPay him back...?\nEdgeworth:\nPay me back? For what? I don't remember ever doing anything for you.\nPhoenix:\nNever mind... I guess you don't really need to know.\nEdgeworth:\nHuh... My letter of request. Please give it to Detective Gumshoe.\nEdgeworth's Request put in pocket.\nPhoenix:\nWell, I guess we should... ... W-what's that!?\nMaya:\nE-earthquake! Nick! It's a big one! Whaaaaa! I-it's calming down... ... Whew... that was scary!\nPhoenix:\n...? Huh? Where's Edgeworth?\nMaya:\n... There. He's on the floor in a ball, shivering. I guess he doesn't do so well with earthquakes.\nPhoenix:\n(I've heard of running, but curling up in a ball?)\nMaya:\nWell, I guess we're done. Mr. Edgeworth doesn't seem like he's going to stand up any time soon. Let's go, Nick.\nPhoenix:\nUh.. right. We have to give Edgeworth's letter of request to Detective Gumshoe.\nExamine\nSecurity guard\nPhoenix:\nThis guard monitors the visitor's room. He hasn't moved an inch since I came in. A real pro.\nAfter Edgeworth's Request is added to the Court Record:\nDecember 25Police DepartmentCriminal Affairs\nGumshoe:\nWhat's going on here!?\nMaya:\nEek!\nPhoenix:\nW-what's wrong, Detective?\nGumshoe:\nThis wild lady comes in here just a while ago... Says she came \"to talk to y'all after hearing what Mr. Wright had to say\"! What's this all about, pal!?\nPhoenix:\n(Lotta Hart...)\nGumshoe:\nWhy are you going around finding more witnesses!? You want to give Mr. Edgeworth the death sentence, pal!?\nPhoenix:\nN-no, not at all... Just... I mean, she did see something. There's nothing I can do about that. I can't go around covering up evidence!\nGumshoe:\nEr... You trying to say something about the way I do my job?\nPhoenix:\nNo sir!\nExamine\nDetective\nPhoenix:\nThat must be one of the detectives. He's mumbling something to himself.\nPolice:\n\"Never talk to people in the neighborhood... Turn all the lights in the room off, and close the curtains...\"\nPhoenix:\n... He must be doing image training for a stake-out.\nTalk\nLotta's testimony\nPhoenix:\nSo... what did Ms. Hart say?\nGumshoe:\nShe says she saw Mr. Edgeworth fire the pistol.\nMaya:\nWhat!?\nGumshoe:\nShe even had a photograph to prove it.\nPhoenix:\nRight. I saw it too... But you really can't tell from the photo who it is shooting.\nGumshoe:\nThat's why she said she's going to enlarge the photo. She said \"it'll drop the quality a mite, but should let us see who's who!\"\nMaya:\nShe can do that!?\nPhoenix:\n(Okay, so there's going to be an enlarged photograph that shows Edgeworth in the act. Great. Just great.)\nGumshoe:\nIn any case, she's going to be the one testifying tomorrow.\nMaya:\nHuh? What happened to the other witness?\nGumshoe:\nWell... Apparently, there was a cancellation.\nPhoenix:\n(A \"cancellation\"...!?)\nTomorrow's trial\nGumshoe:\nI'm afraid tomorrow is going to be life or death for poor Mr. Edgeworth. We got a witness who says she saw the very moment of the murder. And we got a photo taken when the shot rang out.\nPhoenix:\n(I'd say that sounds like a pretty unwinnable case... But wait... What did Mia used to say? If he's innocent, there's got to be something I've overlooked...)\nEdgeworth\nGumshoe:\nIt sound like Mr. Edgeworth is going to ask the state to assign a public defender. I was just asked to file the paperwork. But you still got time, pal! Go talk to him again, for me, please! You have to convince him! You have to make him let you defend him! Please! I know you're the only one who can do it, pal. You're the only one who can save Mr. Edgeworth!\nPresent\nEdgeworth's Request\nLeads to:\n\"Look what I got.\"\nAnything else\nGumshoe:\nHey, pal, there's only one thing I want to see from you! And that's a letter of request from Mr. Edgeworth for you to be his defense attorney!\nPhoenix:\nLook what I got.\nGumshoe:\n... Hey, you did it, pal! Glad I waited till the last minute to file those papers! I'll rip 'em up and start new ones for you!\nPhoenix:\nThanks, Detective. Well, see you in court tomorrow, then.\nGumshoe:\nGood luck, pal. Hey! You guys feel that earthquake a little while back? I was worried!\nMaya:\nWorried? We're fine! I've lived out here my whole life. I'm pretty used to them by now.\nGumshoe:\nOh, I wasn't worried about you two. I was worried about Mr. Edgeworth!\nPhoenix:\n(Oh, right...) He did seem to over-react a little, now that you mention it.\nGumshoe:\nYeah, well, I'm not surprised. It was a pretty big quake. I'm going to go check on him. You two go eat and get your rest for tomorrow's trial. Later!\nMaya:\n... I wonder what it is with Mr. Edgeworth and earthquakes?\nPhoenix:\nI wonder... He was never that scared of them when he was in school.\nPhoenix:\n(Then again, I only really got to know him in 4th grade. (Changed from [Then again, I was only in the same class as him for 4th grade.] in the original release) He transferred to another school after that. I wonder what happened to Edgeworth...)\nTo be continued.\nNothing to examine during investigation\nPhoenix:\nNo clues here.\nTurnabout Goodbyes\nTranscript\nPart 1\nPart 2\nPart 3\nPart 4\nPart 5\nPart 6\nDecember 26, 9:44 AMDistrict CourtDefendant Lobby No. 2\nPhoenix:\nKarma...? (ellipsis and question mark highlighted in the original release)\nEdgeworth:\nThat's right, Manfred von Karma. He's the best prosecutor there is. He hasn't lost a case in his 40-year career. He is a god of prosecution, Wright! A god!\nMaya:\nNot a single case?\nEdgeworth:\nHe'll do anything to get a guilty verdict, anything.\nPhoenix:\nHmm. Sounds like someone else I know, Edgeworth.\nEdgeworth:\nHmph. You don't understand. I mean he'll really do anything. Manfred von Karma is a man to be feared.\nPhoenix:\n(That's quite a claim coming from someone who forges evidence...)\nEdgeworth:\nHe taught me what it really means to \"prosecute.\"\nPhoenix:\nWh-what!?\nEdgeworth:\nJust picture a prosecutor as vicious as me... multiplied by a factor of ten.\nMaya:\nUgh... So... so was he your teacher, then, Mr. Edgeworth?\nEdgeworth:\nSomething like that...\nMaya:\nAnd now he's trying to get you found guilty!? What a creep! Oh, wait... Maybe he's planning on losing on purpose to help you out.\nEdgeworth:\nNot a chance... He hasn't lost once in 40 years. 40 years! He's as ruthless as me, times twenty!\nMaya:\nThat's pretty ruthless...\nEdgeworth:\nLike I said. He's a god among prosecutors.\nPhoenix:\n(I guess that's something like Mia was to me. Speaking of Mia...) Um, Maya?\nMaya:\nUh huh?\nPhoenix:\nWe could really be using Mia's help right now... don't you think?\nMaya:\nOh...\nPhoenix:\n?\nMaya:\nI can't. Sorry. I tried, I really tried, but I couldn't reach.\nPhoenix:\nYou couldn't \"reach\"?\nMaya:\nI think it's because I haven't been training. My powers are weak again...\nPhoenix:\nOh man, what bad timing!\nMaya:\nI'm really sorry. I'll try my best!\nPhoenix:\nI hope so!\nEdgeworth:\nWhat are you whispering about?\nPhoenix:\nO-oh, it's nothing. Well, it's time. Let's head in...\nDecember 26, 10:00 AMDistrict CourtCourtroom No. 3\nJudge:\nCourt is now in session for the trial of Mr. Miles Edgeworth.\nPhoenix:\nThe defense is ready, Your Honor.\nKarma:\n...\nJudge:\nErr, Mr. von Karma? Is the prosecution ready?\nKarma:\n... Fool... You seriously think that I would stand here were I not completely prepared?\nJudge:\nR-right, my apologies!\nPhoenix:\n(He's even got the Judge scared!)\nJudge:\nVery well, your opening statement, please.\nKarma:\n... Decisive evidence... A decisive witness... What else could possibly be required?\nJudge:\nAh... er, nothing of course. That should be fine. The prosecution may call its first witness.\nMaya:\nWhat's with this guy? Is he royalty or something?\nPhoenix:\nHow am I supposed to fight against this!?\nKarma:\nI call the detective in charge of this case, Detective Dick Gumshoe.\nPhoenix:\n(Okay, Gumshoe's first... Let's see how this goes.)\nKarma:\nDescribe the incident. Now!\nGumshoe:\nY-yessir!\nPhoenix:\n(Detective Gumshoe looks nervous...)\nGumshoe:\nEr, please take a look at the map. The murder happened late Christmas Eve, around midnight. There was one boat in the very middle of the lake. There were two men on the boat. Now, there happened to be a woman camping here on the edge of the lake. At 12:10 AM, she heard two pistol shots. Then the boat started to move. It went towards the boat rental shop.\nKarma:\nHmm.\nOverhead Map added to the Court Record.\nKarma:\nTestify to the court about your arrest. Now!\nJudge:\nW-w-wait! Mr. von Karma...\nKarma:\nYes?\nJudge:\nActually, I'm the one that's supposed to be handling these proceedings...\nKarma:\nWrong. There is only one thing you need to do here. You will slam down your gavel and say the word \"guilty.\" That is your role!\nJudge:\nY-yes, of course. You're quite right.\nPhoenix:\n(No, he's not!!!)\nWitness Testimony\n-- The Arrest of Edgeworth --\nGumshoe:\nA man called into the station around 30 minutes after midnight.\nWe headed to the scene of the crime as fast as we could.\nThat's where we found Mr. Edgeworth.\nNow, I didn't suspect him of anything at all.\nBut... the next morning, a body was found in the lake.\nSo we had to arrest Mr. Edgeworth.\nJudge:\nHmm... I see. Very well...\nKarma:\nBegin your cross-examination, attorney. Now!\nJudge:\n...\nCross Examination\n-- The Arrest of Edgeworth --\nGumshoe:\nA man called into the station around 30 minutes after midnight.\nPress\nPhoenix:\nPhoenix:\nYou received a call from a \"man\"?\nGumshoe:\nEr... yup.\nPhoenix:\nBut you said there was a woman camping there? She was the one who heard the two gunshots, right?\nKarma:\nKarma:\nThat woman and the \"man\" who called in the report are two different people, obviously!\nPhoenix:\nDifferent people?\nKarma:\nThere were two witnesses!\nPhoenix:\n(Urk!)\nKarma:\nTheir testimonies were quite similar however. Today I've summoned the woman who was camping.\nPhoenix:\n(The woman who was camping... Lotta Hart.)\nKarma:\nWhat happened next, Detective?\nGumshoe:\nWe headed to the scene of the crime as fast as we could.\nPress\nPhoenix:\nPhoenix:\nHow long was it between receiving the report and your arrival at the lake?\nGumshoe:\nEr, well... I'd say it was about three minutes.\nPhoenix:\nThat's pretty fast!\nGumshoe:\nOur motto for the month is \"get there quick.\"\nKarma:\nKarma:\nDetective! You will refrain from casually revealing department secrets!\nGumshoe:\nY-yessir! Sorry, sir!\nKarma:\nDo that, and you'll be able to look forward to your next salary review.\nGumshoe:\nSo much to look forward to, these days...\nKarma:\nThis is no time for daydreaming! Continue!\nGumshoe:\nY-yessir!\nGumshoe:\nThat's where we found Mr. Edgeworth.\nPress\nPhoenix:\nPhoenix:\nWhat was Mr. Edgeworth like when you saw him then?\nGumshoe:\nWell... From what I saw, he looked pretty relaxed. Not like a murderer at all, really.\nKarma:\nKarma:\nDetective! The court requires the facts, NOT your opinion! How many years have you been on the force!? Facts only, Detective! Hard, cold, objective facts!\nGumshoe:\nY-y-yessir!\nPhoenix:\n(Man, he's got his share of objections...)\nGumshoe:\nNow, I didn't suspect him of anything at all.\nPress\nPhoenix:\nPhoenix:\nWhy didn't you think he was suspicious?\nGumshoe:\nYou should know! We have a deep, trusting relationship with the prosecutors.\nKarma:\nKarma:\nDetective! The court isn't interested in your musings! \"Deep\"? \"Trusting\"? Poppycock! I've never heard so many flippant comments from an active detective on the force!\nGumshoe:\nMmph!\nPhoenix:\n(Detective Gumshoe doesn't look so good...)\nKarma:\nContinue! Now!\nGumshoe:\nBut... the next morning, a body was found in the lake.\nPress\nPhoenix:\nPhoenix:\nDid you find any clues on the body?\nGumshoe:\nA single bullet was recovered from the body. He was shot through the heart... fatally.\nKarma:\nJudge! Here's the bullet... It didn't strike bone, so its shape is well preserved.\nJudge:\nVery well. The court accepts this bullet into evidence.\nPistol Bullet added to the Court Record.\nPress (subsequent times)\nPhoenix:\nPhoenix:\nDid you find any clues on the body?\nGumshoe:\nA single bullet was recovered from the body. He was shot through the heart... fatally.\nGumshoe:\nSo we had to arrest Mr. Edgeworth.\nPress\nPhoenix:\nPhoenix:\nW-why is that?\nGumshoe:\nWell, we found the murder weapon in the boat.\nPhoenix:\nThe murder weapon...?\nGumshoe:\nA pistol.\nJudge:\nDetective Gumshoe... That is a vital piece of information. Please revise your testimony.\nGumshoe:\nRight! S-sorry, Your Honor.\nChanges statement from \"So we had to arrest Mr. Edgeworth.\" to \"The murder weapon we found in the boat was decisive evidence.\"\nGumshoe:\nThe murder weapon we found in the boat was decisive evidence.\nPress\nPhoenix:\nPhoenix:\nWhat about the pistol made it \"decisive evidence\"?\nKarma:\nTsk tsk tsk...\nPhoenix:\n(Ack! He has the same evil laugh as Edgeworth...)\nGumshoe:\nThere were fingerprints on the pistol found in the boat. They were clear prints from Mr. Edgeworth's right hand.\nPhoenix:\nWh-what!?\nJudge:\nOrder! Order! So Mr. Edgeworth's fingerprints were found on the murder weapon!?\nGumshoe:\nY-yes, Your Honor.\nKarma:\nJudge! This is the weapon in question.\nJudge:\nA-accepted into evidence.\nPistol added to the Court Record.\nPress (subsequent times)\nPhoenix:\nPhoenix:\nWhat about the pistol made it \"decisive evidence\"?\nKarma:\nTsk tsk tsk...\nPhoenix:\n(Ack! He has the same evil laugh as Edgeworth...)\nGumshoe:\nThere were fingerprints on the pistol found in the boat. They were clear prints from Mr. Edgeworth's right hand.\nPhoenix:\nWh-what!?\nMaya:\nNick. Doesn't it seem like Detective Gumshoe is being a little vague?\nPhoenix:\nI bet von Karma is feeding him lines! His testimony's probably filled with landmines just waiting for me to press.\nMaya:\nWhat do we do?\nPhoenix:\nGrit our teeth and press, I guess. What else can we do?\nMaya:\nWell said, Nick! You're the man!\nAfter pressing fifth statement and pressing modified sixth statement:\nKarma:\nMembers of the court... We now have the pistol used in the murder, and the bullet found in the body! Detective!\nGumshoe:\nY-y-yessir!\nKarma:\nWas the bullet found in the body fired from this pistol?\nGumshoe:\nYes. The ballistic markings on the bullet match the pistol.\nJudge:\nHmm...\nMaya:\nHey, Nick! What does he mean, \"ballistic markings\"?\nKarma:\nShocking! To imagine someone here does not know something as basic as ballistic markings!\nMaya:\nN-Nick! He's glaring at me!\nKarma:\nTsk... very well, I'll explain. Actually, Judge! You do it.\nJudge:\nEh? M-me? ... Erm, ahem. Ballistic markings are like the \"fingerprints\" of a gun. The barrel leaves distinctive marks on each bullet it fires. You can examine these \"ballistic fingerprints\" to see which gun fired the shot. It's quite accurate.\nKarma:\nIndeed. This leads to one, inevitable conclusion: the bullet found in the victim's heart... was, without a doubt, fired from this pistol. This pistol which, as you may recall, was covered with the defendant's own fingerprints!\nJudge:\nO-order! Order!\nPhoenix:\n(This is bad... This makes it look like Edgeworth did it!)\nKarma:\nWell, Judge?\nJudge:\nI'd say it's almost decisive, yes. Honestly, I could declare a verdict at this point. However...\nKarma:\nYou wish to hear the witness speak, no doubt. Very well. I am somewhat fatigued, and so I will take a brief break. I will call my witness after the recess. Which will last ten minutes. Judge!\nJudge:\nY-yes?\nKarma:\nWhat are you doing? A ten minute recess! Now!\nJudge:\nB-but, wait, I...\nKarma:\nJust bang your flimsy gavel and get on with it, man!\nJudge:\nY-yes! Ahem. This court will take a ten minute recess.\nPhoenix:\n(Who's running this court, anyway!?)\nDecember 26, 11:09 AMDistrict CourtDefendant Lobby No. 2\nPhoenix:\nEdgeworth! What's going on here!? Your fingerprints were on the murder weapon!\nEdgeworth:\nUh... hmm...\nPhoenix:\nAnd that foggy photo makes one thing clear... The only one who could have shot that man was the person in the photo!\nEdgeworth:\nTrue...\nPhoenix:\nWas that you in the boat?\nEdgeworth:\n... Yes. It was me.\nPhoenix:\nWhat!?\nEdgeworth:\nBut... you must believe me. I didn't shoot him.\nPhoenix:\nTh-then who did!?\nEdgeworth:\nI... don't know.\nPhoenix:\nYou don't know!? Weren't you right there!?\nEdgeworth:\n... I heard a gunshot from very close by. Then... the other man fell from the boat. I can't say why, but... I thought, at the time, that he had shot himself!\nPhoenix:\nY-you mean it was a suicide!?\nEdgeworth:\n... That's the only explanation I can come up with.\nPhoenix:\nHuh... (How am I going to convince anyone of that!?) Say, Maya?\nMaya:\nHuh? Wh-what?\nPhoenix:\nAny progress with Mia?\nMaya:\nOh... Sorry. It's no good.\nPhoenix:\nUgh...\nMaya:\nI know... I'm no good for anything, am I, Nick? If I can't call my sister, I might as well not be here, right?\nNo, I need you here\nPhoenix:\nNo, of course not, I need you here! I can see you're always trying to help out. Even if you don't actually help... it's the thought that counts, right?\nMaya:\nIt's okay Nick, you don't have to make me feel better.\nLeads to:\n\"I don't know anything about trials, or defense...\"\nYeah, you're useless\nPhoenix:\nUm, well, actually... (You don't know law, you don't have any trial experience or techniques... Yeah, you're pretty much useless... but I can't say that!)\nMaya:\nIt's okay Nick. You don't have to say anything. Your face said it for you.\nPhoenix:\n(Whoops!) N-no, o-of course we... I'm sorry.\nMaya:\nIt's okay Nick.\nLeads to:\n\"I don't know anything about trials, or defense...\"\nMaya:\nI don't know anything about trials, or defense... What's more, I'm a spirit medium who can't even contact spirits...\nPhoenix:\nAww, everyone has their off days! I mean, I've just been getting lucky lately... But you never know when my luck is going to run out!\nMaya:\nReally...?\nEdgeworth:\nW-w-whoa! Wright! Don't jinx this case any worse than it already is! It's bad for my heart...\nPhoenix:\nOh? Oh! S-sorry... (Whoops!)\nJudge:\nCourt is back in session. Mr. von Karma, call your witness.\nKarma:\nYes. Will Ms. Lotta Hart take the stand?\nKarma:\nLotta Hart, you are a research student at a university?\nLotta:\nThat I am.\nKarma:\nGood. Begin by telling us what you saw the night of the incident. And don't add anything trivial or subjective. Understand?\nLotta:\n... Y'all need to learn some manners.\nKarma:\nUNDERSTAND?\nLotta:\nY-yeah, I understand, I understand!\nJudge:\nEr... very well. Your testimony, please.\nWitness Testimony\n-- Witness's Account --\nLotta:\nIt was Christmas Eve, just after midnight, I reckon.\nI was in my car.\nI heard this \"bang\" come up from the lake.\nWhen I looked out the window, I saw two gents in a boat.\nThen there was another \"bang\"...\nThere wasn't nary a thing on the lake but that boat.\nKarma:\nEnough.\nLotta:\nHuh?\nKarma:\nJudge! She happened to take a photo of the incident! This is that photo. Accept it as evidence.\nJudge:\nW-well! This is a surprise! This looks like... the very moment of the murder! O-Order! I will remove you from the court if I do not have order immediately!\nKarma:\nAs the witness testified, she looked at the lake when she heard the shot. There were no other boats on that lake! So, the man in the boat with the victim must have been the one who shot him... Yes. It was the defendant, Miles Edgeworth!!!\nJudge:\nOrder! Order! Order...! I will have order!\nKarma:\n... Well, Judge?\nJudge:\nThe evidence is... decisive. I have very little doubt about this case. Very well, this court finds the defendant...\nPhoenix:\nPhoenix:\nW-wait! Your Honor! I haven't cross-examined the witness yet!\nKarma:\nA cross-examination? We have photographic proof! What question can there possibly be!? This photo is worth a thousand words... and they all read \"guilty\"! You lose. Or... Do you claim to have found a contradiction in her testimony!?\nPhoenix:\n...!\nKarma:\nVery well. If you have to, you may cross-examine the witness. You will only flounder and ask meaningless questions! You will fail to find anything! And then, I will have you held in contempt of court!\nMaya:\nUh, Nick... contempt...?\nPhoenix:\n\"Contempt of court,\" you know?\nMaya:\nI... guess I understand. Well... what are you going to do? Do you really think there was a contradiction with the facts in her testimony?\nI think there was\nPhoenix:\nI... think I noticed one little thing...\nMaya:\nWow, I'm impressed, Nick! I didn't notice anything! Right! Let's take him on!\nPhoenix:\nY-yeah... (I got a bad feeling about this...)\nLeads to:\n\"I understand... I will cross-examine the witness!\"\nI think there wasn't\nPhoenix:\nHonestly, I found nothing.\nMaya:\nI dunno, I thought her testimony was strange. She was so vague about everything!\nPhoenix:\nI bet von Karma probably fed her her lines.\nMaya:\nBut... But if you don't cross-examine her, the judge will...\nPhoenix:\nHe'll bang down that \"flimsy gavel\" of his and declare Edgeworth guilty.\nMaya:\nI guess we'll just have to bluff it.\nPhoenix:\nBut if we mess up... contempt of court.\nMaya:\nHey, if we lose we'll be held in public contempt!\nPhoenix:\nEr... right.\nLeads to:\n\"I understand... I will cross-examine the witness!\"\nPhoenix:\nI understand... I will cross-examine the witness!\nKarma:\nTsk tsk tsk... Very well!\nJudge:\nI pray for your sake this isn't a waste of time.\nCross Examination\n-- Witness's Account --\nLotta:\nIt was Christmas Eve, just after midnight, I reckon.\nPress\nPhoenix:\nPhoenix:\n\"Just after midnight,\" you say? In other words, it was no longer Christmas Eve... but Christmas Day!\nLotta:\nHuh? Uh, yeah, well, yes.\nKarma:\nKarma:\nI know you want to find contradictions, but really!\nPhoenix:\nMmmph.\nJudge:\nI hope your next contradiction is a little more relevant to the trial.\nLotta:\nI was in my car.\nPress\nPhoenix:\nPhoenix:\nWhy were you camping there, anyway?\nLotta:\nI'm a research student at my university. I was taking pictures to use in my research.\nPhoenix:\n(What research? This all sounds suspicious...)\nPress further\nPhoenix:\nMs. Hart. Could you be more specific about your \"research\"?\nKarma:\nKarma:\nWhat does the witness's motive in camping by the lake have to do with this case!? The answer \"is nothing\"! I object to this line of questioning! Objection sustained!\nJudge:\nW-w-wait, now, I'm the one who says that!\nKarma:\nWell, then say it already!\nJudge:\nObjection sustained.\nPhoenix:\n(Thanks for nothing, Your Honor...)\nLeads back to cross-examination\nHold back\nPhoenix:\n(I think I'll let that one slide for now.)\nLeads back to cross-examination\nLotta:\nI heard this \"bang\" come up from the lake.\nPress\nPhoenix:\nPhoenix:\nSo, you weren't looking at the lake at that time?\nLotta:\nNope. I looked after I heard that noise.\nKarma:\nKarma:\nShe's said that already! I asked you to find \"contradictions\"! Not leisurely chat with the witness!\nPhoenix:\n(Urk...)\nLotta:\nWhen I looked out the window, I saw two gents in a boat.\nPress\nPhoenix:\nPhoenix:\nCould you clearly see the two men?\nLotta:\nJust look at the picture! Clear enough for you?\nPhoenix:\n(Uh oh...)\nPress further\nPhoenix:\nWait a second! I wasn't asking you about the photo! I was asking if YOU saw the two men!\nLotta:\nUh, yeah, well, of course...\nKarma:\nKarma:\nThe witness has testified that she saw them! There's also a photo! You'd best look elsewhere for your precious contradictions!\nPhoenix:\n(He jumped in quick... He's hiding something!)\nLeads back to cross-examination\nHold back\nPhoenix:\n(I think I'd best let that one slide...)\nLeads back to cross-examination\nLotta:\nThen there was another \"bang\"...\nPress\nPhoenix:\nPhoenix:\nWere you watching the very moment the shot rang out?\nLotta:\nWell, yeah, sure...\nKarma:\nKarma:\nYou're asking meaningless questions! Meaningless! \"Contradictions,\" Mr. Wright. Not meaningless babble!\nPhoenix:\n(von Karma, I think I hate you. He's trying to keep me from talking to the witness... To what end...?)\nLotta:\nThere wasn't nary a thing on the lake but that boat.\nPress\nPhoenix:\nPhoenix:\nAre you sure about that?\nLotta:\nYeah, sure as a country gal can be!\nPhoenix:\n(That sounds pretty sure.)\nPress further\nPhoenix:\nHow come you're so sure?\nLotta:\nWell, heck, I scanned the whole lake.\nPhoenix:\n(\"Scanned the whole lake\"? It almost sounds like she was more interested in the lake than the boat...) Ms. Hart... you--\nKarma:\nKarma:\nMr. Wright! The witness has answered the question in full.\nPhoenix:\nMmph!\nKarma:\nNo need for further questions! Objection sustained!\nJudge:\nU-uh, that's what I'm...\nKarma:\nSustained!\nJudge:\nY-yes, of course.\nPhoenix:\n(Oh great... What am I supposed to do now?)\nLeads back to cross-examination\nHold back\nPhoenix:\n(Lotta seems pretty sure of herself. I'd better not forge blindly ahead here. Still... this whole thing stinks.)\nLeads back to cross-examination\nPhoenix:\n(Th-there weren't any contradictions in there!)\nMaya:\nSorry, Nick. If only my sister were here...\nPhoenix:\n(Maya's really taking this hard.)\nAfter selecting \"Press further\" upon pressing second, fourth, and sixth statements, and pressing fifth statement:\nJudge:\nEnough! I think we've heard all we need to hear, Mr. Wright. It seems you are unable to find a contradiction in the testimony worth noting.\nPhoenix:\nB-but, Your Honor!\nKarma:\nYou keep your promise!\nJudge:\nMr. Wright. I am afraid that I will have to penalize any further outbursts... By holding you in contempt of court!\nKarma:\nAnd if that happens, you'll have to leave the courtroom immediately! Understood...?\nPhoenix:\nUh... uh huh.\nMaya:\nNick...! Lotta's testimony is fishy, Nick! Real fishy!\nPhoenix:\nI... know what you mean. But... If I can't say anything, what can I do?\nJudge:\nI believe we've covered the evidence sufficiently to make a decision.\nKarma:\nThen, pass your judgment!\nJudge:\nVery well. Mr. Miles Edgeworth, please take the stand.\n???:\nJudge:\nWh-who was that!?\nMaya:\nIt... was me.\nPhoenix:\n(Maya!)\nJudge:\nI-is something wrong? D-do you need to use the facilities?\nMaya:\nNo, I do not! Lotta Hart! Your testimony stinks! It's unclear whether you were actually looking at the lake! It's highly doubtful that you actually say Mr. Edgeworth! Tell us the truth! This is a matter of life or death!\nLotta:\n...!\nMaya:\nLotta! Did you really clearly see Mr. Edgeworth that night!? Did you see him fire that pistol!?\nJudge:\nYou will stand down! The court does not acknowledge the defense's outburst!\nMaya:\nAnswer me, Lotta!\nLotta:\nWhat's the big idea, treating me like some kind of criminal!? I saw him! I swear it! I saw Edgeworth...\nKarma:\nKarma:\nEnough! Judge... Declare the defense in contempt of court!\nJudge:\nY-yes... yes, of course. I'm sorry, but you WERE warned. Guard! Escort Mr. Wright out of the courtroom! He is in contempt of court, and must leave.\nPhoenix:\n(No... No...!)\nWait!\nMaya:\nI-I was the one who made the outburst, Your Honor! Nick is innocent!\nKarma:\nHah! What's the difference? All that remains is for the guilty verdict to be declared! Isn't that right, Mr. Phoenix Wright!?\nWrong\nPhoenix:\nWrong!\nKarma:\nWhat!?\nLeads to:\n\"Did you hear what Ms. Hart just said?\"\nRight\nPhoenix:\n(Dammit, he's right...)\nMaya:\nN-Nick! There must be something we can do!\nPhoenix:\nI... don't think there is. The cross-examination is over already!\nMaya:\nB-but... but didn't Lotta just say she saw him? She did, Nick! She just said that she saw Mr. Edgeworth! She didn't say that in her testimony, did she?\nPhoenix:\n...! Y-you're right! Your Honor!\nLeads to:\n\"Did you hear what Ms. Hart just said?\"\nPhoenix:\nDid you hear what Ms. Hart just said? She said she clearly saw Mr. Edgeworth! That was not in the testimony! That changes her testimony, and I have a right to cross-examine her again!\nJudge:\nOrder! Order! Order! Order! Order! Order!\nKarma:\nYou're in contempt of court! It's too late for wild claims! Judge! Sustain my objection!\nJudge:\n... ... I'm sorry, Mr. von Karma, but I cannot.\nKarma:\nWhat!?\nJudge:\nMs. Lotta Hart has made a new testimony. The defense does have a right to cross-examine her again.\nKarma:\nB-but he is in contempt of court!\nMaya:\nNo, I am! If you're going to arrest someone, arrest me!\nJudge:\nHmm... Very well. Maya Fey! You will leave the courtroom immediately.\nMaya:\nNick! I did what I could... You have to do the rest! Good luck!\nPhoenix:\nM-Maya...!\nKarma:\nPeh! I care not for this melodrama! Listen well, Mr. Wright! I do not tolerate badgering of my witnesses!\nPhoenix:\n(I'm running out of time... I'd better find a contradiction in here or else...)\nJudge:\nMr. Wright! Begin your cross-examination!\nCross Examination\n-- That Last Statement --\nLotta:\nI saw it clear as day. The man on the boat was Mr. Edgeworth!\nPress\nPhoenix:\nPhoenix:\nWell, what about the other man?\nKarma:\nKarma:\nYou cannot expect to be allowed to blithely ignore your promise, Mr. Wright! I believe you claimed there was a contradiction in the witness's testimony! Well, find it! If you can!\nJudge:\nMr. Wright, I have to assign you a penalty.\nPhoenix:\n(Damn...!)\nPresent Lake Photo\nPhoenix:\nLeads to:\n\"Got you.\"\nPhoenix:\n(That's it...? Uh oh. I don't know if I can find anything in that... What will Maya say...?)\nPhoenix:\nGot you. Got you, Ms. Hart! Finally!\nLotta:\nWh-what!? You got what?\nPhoenix:\nLook at this photograph.\nLotta:\nThe photo I took...?\nPhoenix:\nThe very same. There's something I want you to see in this photo... it's quite clearly visible. The fog, Ms. Hart.\nLotta:\nSo... so?\nPhoenix:\nThis picture was taken with professional, high quality film, correct? Yet even it could not capture the faces of the men on the boat! Yet you claim you saw Mr. Edgeworth! How!?\nLotta:\nWhut!? Wha--!\nJudge:\nMr. Wright has a point!\nKarma:\nKarma:\nThat's why I told her not to say that in her testimony! Please!\nPhoenix:\nYet, now she has said it, Mr. von Karma. How could you possibly see Mr. Edgeworth!? Explain yourself!\nJudge:\nMs. Hart.\nLotta:\nWhat!\nJudge:\nCould you see the defendant that night?\nLotta:\nO-of course! I said I could and I meant I could!\nJudge:\nThen, please testify as to the circumstances of your sighting.\nPhoenix:\n(I did it! I finally found a hole in von Karma's carefully vague testimony!)\nWitness Testimony\n-- How Edgeworth Was Seen --\nLotta:\nYer right. It was a cold night, and the fog was thick as grits.\nSo, once I was finished setting up my camera, I got back in the car.\nStill, I brought my binoculars with me.\nWhen I heard that noise out on the lake, I looked with my binoculars.\nSee? No problem!\nJudge:\nHmm...You used binoculars? Very well. You may begin your cross-examination, Mr. Wright.\nPhoenix:\n(This one'd better be good!)\nCross Examination\n-- How Edgeworth Was Seen --\nLotta:\nYer right. It was a cold night, and the mist was thick as grits.\nPress\nPhoenix:\nPhoenix:\nSo? How could you see Edgeworth!?\nLotta:\nNow, just hold your horses for a second! You hasty Yankee types'd never find a gal where I'm from.\nJudge:\nDefense attorneys have trouble with that as it is.\nPhoenix:\n(Nobody loves me...)\nLotta:\nSo, once I was finished setting up my camera, I got back in the car.\nPress\nPhoenix:\nPhoenix:\nYour \"camera\"...?\nLotta:\nYeah. It's got an automatic...\nKarma:\nKarma:\nThe issue we are concerned with here is Ms. Hart seeing Mr. Edgeworth! The camera has nothing to do with this at all!\nJudge:\nObjection sustained.\nPhoenix:\n(Argh! He's not letting her answer any of my questions!)\nLotta:\nStill, I brought my binoculars with me.\nPress\nPhoenix:\nPhoenix:\n\"Binoculars\"?\nLotta:\nYeah, binoculars.\nPhoenix:\nYesterday, you mentioned that you were out looking for shooting stars, correct?\nLotta:\nWell... yeah.\nPhoenix:\nWouldn't you need a telescope, not binoculars, for that?\nLotta:\n...!\nPhoenix:\nI've got doubts about your camera, too! Was that really to take pictures of meteor showers?\nKarma:\nKarma:\nThe camera is irrelevant to this case!\nPhoenix:\nYou can't say that for certain!\nJudge:\nHmm... Mr. Wright. Is the camera really relevant to this case? If you believe it is, you may continue with this line of questioning.\nKarma:\nBut know this! If you find nothing with this, there will be consequences!\nJudge:\nWell, Mr. Wright? Do you wish to press further about the camera?\nPress further\nPhoenix:\n(This is make-it-or-break-it time!) The camera is of utmost importance, Your Honor. It is, perhaps, the key to this entire case! Therefore, I will continue my line of questioning! (Wow! Maybe I went a little overboard there...)\nJudge:\nVery well! Ms. Hart! You will testify to the court about the camera!\nLotta:\nYeah, yeah, I hear ya.\nChanges statement from \"Still, I brought my binoculars with me.\" to \"The camera was set up to take pictures of a meteor shower.\"\nHold back\nPhoenix:\nOkay, Your Honor... I withdraw my question. (I have to remember who I'm dealing with! I bet von Karma wants to trap me so he can put me in contempt! I think I'll hang back for now and see what happens.)\nKarma:\nHah!\nLeads back to cross-examination\nLotta:\nThe camera was set up to take pictures of a meteor shower.\nPress\nPhoenix:\nPhoenix:\nMs. Hart. What made you choose that lake to photograph meteors? You know the fog gets thick on that lake. It's not very suited to stargazing.\nLotta:\nYeah, well... Y'see, I... I guess I wasn't thinking too straight! Har!\nKarma:\nKarma:\nMr. Wright! I will not have you badgering my witness because of her challenged intellect!\nLotta:\nNow wait a minute!\nKarma:\nContinue your testimony. You were saying how it was that you saw Edgeworth?\nLotta:\nGrr...\nKarma:\nNo unnecessary comments, please.\nPresent Lotta's Camera\nPhoenix:\nPhoenix:\nYou were photographing shooting stars? That's a lie!\nLotta:\nS-says who!?\nPhoenix:\nI saw the camera you set up yesterday. It was pointed directly at the lake! You have to point a camera upwards to take photos of the stars, Ms. Hart!\nLeads to:\n\"Ooof!\"\nPresent Lake Photo\nPhoenix:\nPhoenix:\nYou were photographing shooting stars? That's a lie!\nLotta:\nS-says who!?\nPhoenix:\nTake a look at this photograph. This was taken on an automatic setting, was it not?\nLotta:\nY-yeah, that's right.\nPhoenix:\nYou have to point a camera upwards to take photos of the stars, Ms. Hart! But, as this photograph clearly shows... The camera was pointed directly at the lake!\nLeads to:\n\"Ooof!\"\nLotta:\nWhen I heard that noise out on the lake, I looked with my binoculars.\nPress\nPhoenix:\nPhoenix:\nIf there was a heavy fog, how would binoculars change that at all?\nLotta:\nWhat do you mean?\nPhoenix:\nEven binoculars can't see through fog! But... you say you clearly saw him?\nLotta:\nEr... I did... yeah.\nKarma:\nEnough! There is no room for doubt in her testimony!\nPhoenix:\n(Hmm. She sounded pretty doubtful to me! But... I have to find a clear contradiction first.)\nPhoenix:\n(I don't care how many von Karmic objections I get... I'm going to find a hole in this testimony if it's the last thing I do!)\nLotta:\nOoof!\nJudge:\nMr. Wright! What are you driving at?\nPhoenix:\nThe witness was not at the lake to photograph shooting stars, Your Honor!\nLotta:\n...!\nJudge:\nW-well then, what exactly was she photographing?\nShow evidence\nLeads to:\n\"Your Honor! Take a look at this...\"\nI don't know\nPhoenix:\nWell... that I don't know.\nKarma:\nKarma:\nWhat the witness takes photos of is entirely her business! This has nothing to do with the case! Not to mention that you can't even show us another reason why she might have been there. Mr. Wright... If you are out of material, I suggest we end this mockery of a cross-examination.\nPhoenix:\n(Uh oh... I can't let the trial end like this! I have to show them something!)\nLeads to:\n\"Your Honor! Take a look at this...\"\nPhoenix:\nYour Honor! Take a look at this... What was Ms. Hart trying to photograph at the lake?\nPresent Gourdy Article\nPhoenix:\nLeads to:\n\"Ms. Hart.\"\nPresent anything else\nPhoenix:\nPhoenix:\nWell, Your Honor? What do you think?\nJudge:\nI... think I'm confused.\nKarma:\nWrong again, Mr. Wright. So very wrong. You can't get through this one with your weak bluffs!\nPhoenix:\nY-Your Honor! Enough playing around! Here's the real evidence!\nJudge:\n\"Enough playing around\" is my line, Mr. Wright!\nPhoenix:\nUh...\nLeads back to:\n\"What was Ms. Hart trying to photograph at the lake?\"\nPhoenix:\nMs. Hart. This is what you were trying to photograph!\nJudge:\nWhat's this? A newspaper article? \"Gourdy\"...? Ah, the sighting at Gourd Lake...\nPhoenix:\nWell, Ms. Hart?\nLotta:\nI... I never heard of no lake monster! You got proof or something? Let's see you prove that I was down at the lake trying to photograph this \"Gourdy.\"\nI don't have proof\nPhoenix:\nWell, I don't have proof...\nKarma:\nKarma:\nBah! Your ineptitude is entertaining, Mr. Wright, but enough is enough! I've had enough of baseless claims made without a hair of evidence to support them!\nPhoenix:\nPhoenix:\nWell all right, if that's how you want to play... I'll show you evidence!\nJudge:\nMr. Wright! Are you sure about this?\nPhoenix:\n(I'm sure sick of that smarmy prosecutor putting me down! Or... did he taunt me so I'd get mad and make a mistake?)\nLeads to:\n\"Very well, let's see it.\"\nI have proof\nPhoenix:\nI have it! Proof!\nJudge:\nHmm... Intriguing!\nLeads to:\n\"Very well, let's see it.\"\nJudge:\nVery well, let's see it. And... no joking around this time, please. Here is proof that the witness was trying to photograph Gourdy, the lake monster!\nPresent Lotta's Camera\nPhoenix:\nPhoenix:\nThe proof, Ms. Hart, is your own camera!\nLotta:\n...!\nPhoenix:\nYou camera was set to take photos in response to loud noises, correct? Thus this photograph here, taken when a gun fired on the lake.\nLotta:\n...\nPhoenix:\nAnd here, this article about \"Gourdy.\" According to this article... Gourdy made a loud noise when it emerged! Well? You were trying to photograph Gourdy, weren't you! That's why you had set your camera to respond to loud noises!\nLeads to:\n\"Order! Order!\"\nPresent Gourdy Article\nPhoenix:\nPhoenix:\nThe proof is this article about Gourdy the lake monster!\nLotta:\n...!\nPhoenix:\nAccording to this article... When Gourdy breaks through the water, it makes a loud noise! Which is why you set up your camera with that microphone! You had it set to respond to loud noises! And that's how you got this picture when the pistol fired!\nLeads to:\n\"Order! Order!\"\nPresent anything else\nPhoenix:\nPhoenix:\nHere's my proof! It's simple!\nJudge:\n... If it's simple... then why have you obviously made an error, Mr. Wright?\nPhoenix:\nUrk...?\nLotta:\nWhat's that!?\nKarma:\nGo home. Consider a career change.\nPhoenix:\n(Gah! How can they so casually toss aside this eviden... Oh. Whoops. Wrong evidence.)\nJudge:\nLuckily for you, I'm in a patient mood, Mr. Wright. One more time please.\nLeads back to:\n\"Here is proof that the witness was trying to photograph Gourdy, the lake monster!\"\nJudge:\nOrder! Order! I see... I, too, thought it was a little strange.\nPhoenix:\n(Yeah, sure!) Well, Ms. Hart? You were camping there to try and take a photo of Gourdy, weren't you?\nLotta:\n... Yeah. Not bad. Are all you lawyers that smart? So, smart boy, I was down there trying to photograph Gourdy, you got me. So what?\nPhoenix:\nHuh...?\nLotta:\nThat don't change what I saw, does it?\nKarma:\nExactly! What you just used several precious minutes of our time to prove... is nothing more than that the witness is an idiot who thinks monsters exist!\nLotta:\nH-hey!\nKarma:\nBut, as she so succinctly said, so what!? It changes nothing!\nPhoenix:\n(Not true! You were hiding the whole thing about Gourdy for some reason, I know it! But what could it have been...? Whatever it is, I'm getting to the bottom of this!)\nJudge:\nMs. Hart. Why did you hide the fact that you were searching for Gourdy from the court? Please revise your testimony.\nLotta:\n... Right. Fine, I'll testify. It won't change nothing, though.\nPhoenix:\n(Something will change... it has to! And I'm going to spot it!)\nKarma:\n...\nWitness Testimony\n-- Lotta's New Testimony --\nLotta:\nActually, I'm not a research student at a university.\nI'm an investigative photographer.\nImagine what a scoop it'd be if I got a picture of that monster!\nThat's why I was camping out by the lake.\nBut, that's all I was hiding.\nWhen I heard the \"bang\" I looked right straight out at that lake.\nThere wasn't much else to look at, so I just watched that boat the whole time.\nThen I saw a flash, near one of the men's hands, and I heard another gunshot.\nI was looking right at that boat, the whole time, cross my heart and hope to fry.\nJudge:\nHmm... Well, Mr. Wright. You may cross-examine the witness.\nKarma:\nKarma:\nThe witness's testimony is unchanged from before! Whether she is a research student or a photographer has no bearing on this case! There is no need to waste more of our time with another pointless cross-examination!\nJudge:\nEr... hmm.\nPhoenix:\nPhoenix:\nI claim the defense's right to cross-examine the witness, Your Honor! (von Karma's up to something, I know it! He doesn't want me to cross-examine her because... why? Was there a contradiction?)\nJudge:\nVery well. You may begin the cross-examination. You seem sure of yourself, you must have something in mind.\nKarma:\nHah! That would be a first!\nPhoenix:\n(Hah hah, very funny.)\nJudge:\nYou understand that this is your last chance at a cross-examination, Mr. Wright? If there is no problem with the testimony this time, we will let the witness leave. I will announce my verdict at that time, Mr. Wright. Understood?\nPhoenix:\nYes, Your Honor.\nCross Examination\n-- Lotta's New Testimony --\nLotta:\nActually, I'm not a research student at a university.\nPress\nPhoenix:\nPhoenix:\nThen what manner of person are you!?\nLotta:\nI'm not sure I'm high-falutin' enough to be called a \"manner\" of anything.\nLotta:\nI'm an investigative photographer.\nPress\nPhoenix:\nPhoenix:\nAn \"investigative photographer\"?\nLotta:\nYep. You get your photo, and sell it to the press. It's that kind of business. Hey, I was taking pictures at my sister's graduation last year... N' guess what!\nPhoenix:\nUmm... what?\nLotta:\nThere was a yoofoh just a' hanging in the sky!\nPhoenix:\nA \"yoofoh\"...?\nLotta:\nYou know, an \"Unidentified Flying Object\"? A yoofoh! That's when I had sort of a revelation. I knew I should become an investigative photographer!\nPhoenix:\nI... I see. (Kind of a shaky basis for a career...)\nLotta:\nImagine what a scoop it'd be if I got a picture of that monster!\nPress\nPhoenix:\nPhoenix:\nIs \"Gourdy\" really all that newsworthy?\nLotta:\nHeck yeah! They even had him up on the TV!\nPhoenix:\n(I'm not sure that appearing on the local news \"rumor of the month\" show qualifies. Last month's show was \"Bigfoot Sighted on Acorn Hill,\" I believe.)\nLotta:\nHey! They also had a picture of him in the newspaper! For real!\nJudge:\nMr. Wright. This is one fight I do not believe you can win. Let's keep moving, shall we?\nPhoenix:\nYes, Your Honor.\nLotta:\nThat's why I was camping out by the lake.\nPress\nPhoenix:\nPhoenix:\nThat's why you put the automatic senior on your camera?\nLotta:\nYep. Borrowed it from a friend at a university. It analyzes every sound it picks up, and when it gets a \"bang!\"...\nPhoenix:\nIt snaps a shot.\nLotta:\nYep.\nPhoenix:\nSo, how many pictures has it taken so far?\nLotta:\nThe only time the camera triggered was that night.\nPhoenix:\n(Hmm...)\nLotta:\nBut, that's all I was hiding.\nPress\nPhoenix:\nPhoenix:\nI think it's time you told us why you felt you had to hide your true purpose at the lake.\nLotta:\nHeck, if word got out what I was up to, the lake'd be swarmin' with competitors!\nPhoenix:\nCompetitors...?\nLotta:\nYeah! Second-rate shutterbugs trying to steal my scoop!\nPhoenix:\nAh... Is that the only reason you were hiding the truth?\nLotta:\nW-well, actually...\nKarma:\nKarma:\nMr. Wright! I'll not have you asking questions with no relevance to this case!!!\nPhoenix:\n(Whatever you say, von Karma. I know you told her to keep quiet.)\nLotta:\nWhen I heard the \"bang\" I looked right straight out at that lake.\nPress\nPhoenix:\nPhoenix:\nExactly what sort of sound was it?\nLotta:\nWell, I never heard one before so I can't say for sure... but it sounded like a gunshot. It was a lot sharper a sound than I would have expected.\nPhoenix:\n(Hmmm...)\nPresent Gourdy Article\nPhoenix:\nLeads to:\n\"Ms. Hart!\"\nLotta:\nThere wasn't much else to look at, so I just watched that boat the whole time.\nPress\nPhoenix:\nPhoenix:\nThere wasn't \"much else to look at\"?\nLotta:\nYep.\nPhoenix:\n(I dunno. If she heard a bang... and she thought Gourdy was out there... I kind of doubt she'd waste any time looking at a boat.)\nLotta:\nWhat? What did I do now? What're you giving me that look for?\nPhoenix:\n(Definitely suspicious... Maybe it's time for some evidence...)\nKarma:\nWitness! Continue.\nLotta:\nHold your hushpuppies, pops, I'm getting there.\nPresent Gourdy Article\nPhoenix:\nLeads to:\n\"Ms. Hart!\"\nLotta:\nThen I saw a flash, near one of the men's hands, and I heard another gunshot.\nPress\nPhoenix:\nPhoenix:\nWas there nothing on the lake but the boat at that time?\nLotta:\nHuh? Wait, so you're thinking maybe he was shot from some other place? I don't think so, nope. The lake was smooth as glass, and nobody was on the shore, neither.\nPhoenix:\n(Hmm...)\nPresent Gourdy Article\nPhoenix:\nLeads to:\n\"Ms. Hart!\"\nPhoenix:\n(I'd better find some sort of contradiction in this testimony... I won't be able to beat von Karma any other way... There has to be something!)\nPhoenix:\nMs. Hart! Were you REALLY looking at that boat!?\nLotta:\nW-what's with you!? Course I was looking at it! It was the only thing out there! Any normal person'd be looking at it!\nPhoenix:\nI agree, any normal person would. But you are far from normal!\nLotta:\nWh-what!? Y'all wanna step over here and say that!?\nPhoenix:\nYou were camping at the lake to take a picture of Gourdy! Think about it-- What would you do if you heard a loud noise? You'd be scanning the lake for any sign of Gourdy, that's what! You wouldn't give the boat a second thought!\nLotta:\nAah!\nJudge:\nOrder! Continue, Mr. Wright!\nPhoenix:\nYou testified that you were watching the boat through binoculars! However, you wouldn't need binoculars to watch that boat! You needed them to search for Gourdy... and that's what you were doing!\nLotta:\n...! ... ...\nPhoenix:\nWell!?\nLotta:\nHmph... Well, now that y'all mention it... I did sort of take my binoculars and kind of scan the lake a bit... I mean, Gourdy might be out there, n' all...\nJudge:\nM-Ms. Hart! A-are you saying that you were NOT watching the boat, then?\nLotta:\n... S-sorry, y'all. I wasn't fibbing, really. I was, just... I thought y'know, I could be witness to a murder n' all! I kinda got excited. I was sure I was watching that boat... till now.\nJudge:\n... This... this is totally uncalled for--\nLotta:\nB-but hey! You got the photograph! You got proof!\nJudge:\nHmm... Still, we can't see who is shooting who in this.\nLotta:\nRight! Right! That's why I took this photo n'...\nKarma:\nKarma:\nWitness... That's enough. You've had a long day. Shut your pie-hole.\nLotta:\nSh-shut my what!?\nPhoenix:\n(What was she going to say? She took the photo... and what? Wait a second...)\nGumshoe:\nShe even had a photograph to prove it.\nPhoenix:\nBut you really can't tell from the photo who is shooting.\nGumshoe:\nThat's why she said she's going to enlarge the photo. She said \"it'll drop the quality a mite, but should let us see who's who!\"\nPhoenix:\n(She enlarged that photo! Why won't von Karma let her show it? I've got a hunch! I bet that enlarged photo shows something bad for von Karma! This is my chance! If I'm wrong, though, it'll mean prison for Edgeworth... or worse. What should I do!?)\nMake her show the enlargement\nLeads to:\n\"Ms. Hart! Look at this photograph.\"\nWait and see what happens\nPhoenix:\n(If this is a trap... I'd better hold back and see how things go. But... if I wait now, the cross-examination will be over! Can I really risk that!?)\nDo nothing\nJudge:\nThis hereby ends the cross-examination of Ms. Lotta Hart.\nKarma:\nAnd none too soon. That was a flagrant waste of my time.\nJudge:\nMr. von Karma, do you have anything to add?\nKarma:\nI stated everything I needed to when this trial began. Decisive evidence. A decisive witness. What else could possibly be required?\nJudge:\nNothing, of course.\nPhoenix:\n(Oh no! I should have pressed further!)\nJudge:\nThis court sees no reason to further prolong the trial. Nor is there any need for more time to decide the case against the defendant. This case is extremely clear. I see no room for misinterpretation of the facts. This court find the defendant, Mr. Miles Edgeworth...\nGuilty\nJudge:\nThe accused will surrender to the court immediately, to be held pending trial at a higher court within a month from today's date. That is all. The court is adjourned!\nGame over\nRethink position\nPhoenix:\n(I have to fight now or I could lose everything!)\nLeads to:\n\"Ms. Hart! Look at this photograph.\"\nPhoenix:\nMs. Hart! Look at this photograph. You enlarged this photograph, did you not?\nLotta:\nY-yeah! I did!\nPhoenix:\nWhy has that enlargement not been presented to the court!?\nKarma:\nKarma:\nB-because it does not exist!\nLotta:\nWhat're y'all talking about!? You were the one who told me not to show it in court in the first place! You old fool!\nJudge:\nWhat's the meaning of this, Mr. von Karma!\nKarma:\nEr... erm...\nPhoenix:\nMs. Hart! Show the photo to the court! Show us the enlargement!\nKarma:\nKarma:\nThe prosecution objects to the submission of this evidence!\nJudge:\nObjection... denied. The witness will show the enlargement to the court.\nLotta:\nHere it is.\nJudge:\nHmm. We still cannot see who is firing in this. It could be the defendant... or maybe it's not. Regardless, I'll accept this as evidence.\nLake Photo added to the Court Record.\nKarma:\nHappy now, Mr. Wright?\nPhoenix:\nHmm... (There has to be something!)\nKarma:\nYou asked for the enlargement, you got the enlargement. And little good it has done any of us! That's why I requested she not show it!\nJudge:\nHmm... I suppose this means that the cross-examination...\nKarma:\nIs over! Obviously!\nJudge:\nThen, I would like to close the cross-examination of Ms. Lotta Hart.\nKarma:\nAnd none too soon. That was a flagrant waste of my time.\nJudge:\nMr. von Karma, do you have anything to add?\nKarma:\nI stated everything I needed to when this trial began. Decisive evidence. A decisive witness. What else could possibly be required?\nJudge:\nNothing, of course. Then, I believe it is time for me to declare my verdict.\nPhoenix:\n(Wait... it's not supposed to go like this! There has to be a clue in this photo... somewhere! This is bad! Real bad! What should I do!?)\nObject to the enlargement\nLeads to:\n\"Your Honor!\"\nShow other evidence\nPhoenix:\nW-wait! Your Honor, This evidence...\nKarma:\nKarma:\nI believe we have spent enough time talking about evidence!\nJudge:\nHmm... indeed. We've heard opinions on every piece of evidence but this enlargement. I see no point in retracing our steps.\nLeads back to:\n\"This is bad! Real bad! What should I do!?\"\nWait and see\nPhoenix:\n(Uh oh... think of something! No good... I guess I'll just sit back and see how this turns out.)\nJudge:\nVery well! Allow me to state my verdict.\nPhoenix:\n(Oh no! I should have pressed further!)\nJudge:\nThis court sees no reason to further prolong the trial. Nor is there any need for more time to decide the case against the defendant. This case is extremely clear. I see no room for misinterpretation of the facts. This court find the defendant, Mr. Miles Edgeworth...\nGuilty\nJudge:\nThe accused will surrender to the court immediately, to be held pending trial at a higher court within a month from today's date. That is all. The court is adjourned!\nGame over\nPhoenix:\nYour Honor! There is something decidedly strange with this enlargement!\nJudge:\nW-what might that be? Mr. Wright... You will show the court what you mean! What about this photo is \"strange\"?\nPhoenix:\n(Okay... here goes nothing! I'll show the judge what's strange about this photo.)\nPresent shooter's hand or pistol\nPhoenix:\nLeads to:\n\"Here, Your Honor!\"\nPresent shooter\nPhoenix:\nPhoenix:\nHere, your honor!\nJudge:\nThe shooter...? I'm not sure I understand. What about the shooter is strange? Can you be more specific?\nPhoenix:\n(Specific, right...)\nLeads back to:\n\"I'll show the judge what's strange about this photo.\"\nPresent anywhere else\nPhoenix:\nPhoenix:\nHere, Your Honor!\nJudge:\nWhere...? Mr. Wright, I understand you're in a tight spot. However! You have nothing to gain by making baseless claims of faulty evidence!\nPhoenix:\nY-Your Honor! Never mind that... my, my finger slipped! Please let me show you again!\nJudge:\nHmm...\nLeads back to:\n\"I'll show the judge what's strange about this photo.\"\nPhoenix:\nHere, Your Honor!\nJudge:\nThe shooter...? I'm not sure I understand. What about the shooter is strange?\nPhoenix:\nLook at the hand holding the pistol, Your Honor!\nJudge:\nThe hand...?\nPhoenix:\nThat hand directly contradicts another piece of evidence!\nJudge:\nThis man's left hand does what...!?\nPhoenix:\nLet me show you. I'll show you the evidence that left hand contradicts!\nPresent Pistol\nPhoenix:\nLeads to:\n\"The evidence is clear.\"\nPresent anything else\nPhoenix:\nPhoenix:\n(Hmm... I'm not sure this warrants a \"take that!\" I'd better think this one through!)\nJudge:\nMr. Wright, please hurry up. We haven't got all day.\nPhoenix:\nY-yes, Your Honor! Right away!\nLeads back to:\n\"I'll show you the evidence that left hand contradicts!\"\nPhoenix:\nThe evidence is clear. The man in this photograph is holding that pistol in his left hand. However! The prints on the murder weapon were from Edgeworth's \"right hand\"! Ergo! The man shooting the pistol in this photograph... Is not Mr. Edgeworth!!!\nJudge:\nNow that everyone in the courtroom has quieted down... I would like to reconvene this court of law! Mr. Wright.\nPhoenix:\nYes, Your Honor.\nJudge:\nYou have given us definitive proof today. We now know that it was not Mr. Edgeworth who fired the pistol that night. However... This leaves us with a rather large problem. If Mr. Edgeworth didn't do it, then who shot our victim?\nKarma:\nPrecisely! As we have seen, there were no other people on the lake that night! Who but the defendant could have shot the victim!?\nMs. Hart\nPhoenix:\nWho else but the witness, Ms. Lotta Hart!\nJudge:\nWh-what!? Do you have proof of this!?\nPhoenix:\n(Proof-shmoof! Always with the proof! Oh... wait, I do need proof, don't I.)\nJudge:\nMr. Wright! I'll have you remember this is a court of law!\nPhoenix:\n(Uh oh. The Judge is mad.)\nKarma:\nLet me ask again!\nLeads back to:\n\"Who but the defendant could have shot the victim!?\"\nThe victim himself\nLeads to:\n\"There is only one explanation remaining!\"\nLarry\nPhoenix:\n(Wait, wait--I can't do that. Sacrifice one friend to save another? What's the point!?)\nKarma:\nWell, Wright! Your answer!\nLeads back to:\n\"Who but the defendant could have shot the victim!?\"\nPhoenix:\nThere is only one explanation remaining! The man who shot the victim was none other than... the victim himself!!!\nJudge:\nOrder! Order! So... you are saying that the victim committed suicide?\nPhoenix:\nYes, Your Honor. I can think of no other explanation.\nJudge:\nHmm... Indeed, that does seem to be the only remaining option.\nKarma:\nKarma:\nI'm so very, very sorry, Mr. Wright. But suicide is out of the question.\nPhoenix:\nWh-what!?\nKarma:\nAn examination of the victim's wound reveals the distance at which he was shot.\nPhoenix:\nThe... distance?\nKarma:\nThe victim was clearly shot from further than a meter away!\nPhoenix:\nA meter! Th-that's three feet!\nKarma:\nThere is no way it could have been suicide!\nJudge:\nOrder! Order! Mr. von Karma! Are you sure of the accuracy of your data!?\nKarma:\nOf course! I had already considered the possibility of suicide, you see.\nAutopsy Report updated in the Court Record.\nJudge:\nHmm... I see. Very well, allow me to state my opinion. Considering the situation, the shooter had to be the defendant, Mr. Edgeworth. However! The prints on the gun reveal that the shooter was not Mr. Edgeworth. This is a conundrum. Therefore, I would like to suspend proceedings for this trial for the day. The court orders the defense and the prosecution to further investigate this matter. Understood?\nPhoenix:\nYes, Your Honor.\nKarma:\n...\nJudge:\nThat is all. The court is adjourned.\nDecember 26, 1:15 PMDistrict CourtDefendant Lobby No. 2\nPhoenix:\nWhew, that was a close one.\nEdgeworth:\n...\nPhoenix:\nHey! Don't you have anything to say!?\nEdgeworth:\nNo. I have yet to be declared innocent, Wright.\nPhoenix:\nWell, yeah, but... What happened out there on that lake, anyway!? If he didn't commit suicide, then who...? The shooter was about a meter away, too!\nEdgeworth:\n... W-what? Don't give me that look! I did not kill him!\nPhoenix:\nI was just kidding around.\nEdgeworth:\nHmph.\nPhoenix:\nLook... I'm going to go check on Maya.\nEdgeworth:\nOh... Wright.\nPhoenix:\nWhat?\nEdgeworth:\nTell her something for me.\nPhoenix:\nWhat?\nEdgeworth:\n... ... ... Tell... Tell her to watch what she says in court. That's all.\nPhoenix:\n(Would it kill you to just state how you really feel with a \"thanks\", Edgeworth?) (Changed from [Yeah, I'm sure she'll be happy to hear you say that, Edgeworth. Jerk!] in the original release)\nPhoenix:\nI requisitioned a transcript of Lotta's entire testimony. I thought it might give me some ammunition for the trial tomorrow. Of course she didn't see the shooter... So the only part of her testimony that stood was the \"bang\" she heard.\nLotta's Deposition added to the Court Record.\nTo be continued.\nPresenting wrong evidence during testimony\nPhoenix:\nPhoenix:\nYour Honor! That statement contradicts this evidence!\nJudge:\n...? It does? I don't see anything contradictory...\nPhoenix:\nHuh? Really?\nJudge:\nObjection overruled. Try to think before you make accusations, Mr. Wright!\nPhoenix:\n(Whoops! That didn't go so well.)\nPresenting wrong evidence during testimony\nPhoenix:\nPhoenix:\nYour Honor! What do you think about the witness's statement?\nJudge:\nUh... I'm not sure I follow?\nPhoenix:\nIt clearly, er, contradicts the... um... I thought...\nJudge:\nYou don't sound very convinced, Mr. Wright. Objection overruled.\nPhoenix:\n(I don't think that won me any points with the judge...)\nPresenting wrong evidence during testimony\nPhoenix:\nPhoenix:\nThis evidence clearly reveals the contradiction in that statement, Your Honor!\nJudge:\nHow exactly are that evidence and the statement just now related...?\nPhoenix:\nThey aren't, are they...\nJudge:\nNot at all. Mr. Wright, please think the facts over before making accusations.\nPhoenix:\n(I don't think that won me any points with the judge...)\nPresenting wrong evidence during testimony\nPhoenix:\nPhoenix:\nThe witness's statement is clearly faulty, Your Honor!\nJudge:\n... I'm sorry, but I can see nothing faulty. Unfortunately, I will have to penalize you, Mr. Wright.\nPhoenix:\n(Ugh. I must be on the wrong track?)\nToo many penalties\nJudge:\nThis court sees no reason to further prolong the trial. Nor is there any need for more time to decide the case against the defendant. This case is extremely clear. I see no room for misinterpretation of the facts. This court find the defendant, Mr. Miles Edgeworth...\nGuilty\nJudge:\nThe accused will surrender to the court immediately, to be held pending trial at a higher court within a month from today's date. That is all. The court is adjourned!\nTurnabout Goodbyes\nTranscript\nPart 1\nPart 2\nPart 3\nPart 4\nPart 5\nPart 6\nDecember 26Detention CenterVisitor's Room\nPhoenix:\nMaya!\nMaya:\nHey! Nick, it's you! I'm glad Mr. Edgeworth made it through the day okay. It's a relief...\nPhoenix:\nHey. Why'd you do that, anyway?\nMaya:\n... I don't know. I... just knew I had to do something. I know I'm not the lawyer my sister was... ... I'm sorry.\nPhoenix:\nWell, you did save the trial... Just, behave from now on, okay?\nMaya:\nO... Okay.\nTalk\nQuestioning\nPhoenix:\nHave you been questioned yet?\nMaya:\nNo... not yet. Detective Gumshoe was here just now. He said \"seeing as this is your first offense, we'll let you go after questioning.\"\nPhoenix:\nWhew...\nMaya:\nOh, and he wanted me to get bail money ready. You can pay for me, okay?\nPhoenix:\nHuh? How much?\nMaya:\nI don't know. I guess they'll send you a bill or something.\nPhoenix:\n(Why do I picture giant bales of money every time I hear the word \"bail\"?)\nMia\nPhoenix:\nAny luck with Mia...?\nMaya:\nNone... I can't get through to her at all. I tried... I really did! I don't know what to do... ... I think I probably shouldn't have stopped my training.\nPhoenix:\n(Hmm... she sounds like she really did do her best. I should check and see if there are any waterfalls in the local area...)\nMaya:\nI wonder if I'll ever see my sister again...\nPresent\nAttorney's Badge\nMaya:\nIt must be nice, Nick. You can just show that to anyone and say \"I'm a lawyer!\" But, spirit mediums, well...\nPhoenix:\nI dunno, with your clothes, I bet at least some people would recognize you...\nMaya:\nBut these are medium-in-training clothes... I wonder if I'll ever be a proper medium...\nLake Photo\nMaya:\nIsn't that the enlarged photo Lotta was talking about?\nPhoenix:\nUh huh.\nMaya:\nHuh... It's nice and big... but you can't really see the faces any clearer, can you?\nMisty Fey's Photo\nMaya:\nMy... mother. ...\nPhoenix:\n(Now that I've shown her the picture, I'm not so sure it was the right thing to do. No... I'm pretty sure it was the wrong thing to do.)\nGourdy Article\nMaya:\nI want to see Gourdy, too!\nPhoenix:\nIf he really exists.\nMaya:\nWell, I'd say a photograph is pretty good proof! Once this trial is over, let's get some fishing poles and go down to the lake!\nPhoenix:\n(Even if there is a monster in that lake, fishing poles sound like a BAD idea...)\nPistol Bullet\nMaya:\nSo the markings on this bullet and the barrel of the pistol matched?\nPhoenix:\nHey, I'm surprised you remembered that!\nMaya:\nHow could I forget after von Karma rubbed it in so much? So, which one of these are the ballistic markings?\nPhoenix:\nI'm... not really sure.\nPistol\nMaya:\nMr. Edgeworth's prints are on this pistol, aren't they?\nPhoenix:\nYes... the prints from his right hand. But they must have gotten on there at some other time other than the shooting.\nMaya:\nWhat? Really!?\nPhoenix:\n(The shooter used his left hand, after all...)\nAnything else\nMaya:\nSorry... I'm fresh out of ideas.\nDecember 26Wright & Co. Law Offices\nPhoenix:\n... Sure is quiet here with nobody around. Right... I have to get Maya out of that detention cell soon!\nDecember 26Police DepartmentCriminal Affairs\nPhoenix:\n(Detective Gumshoe's not here...)\nPolice:\nGumshoe's at the scene again today.\nPhoenix:\nHuh? Oh, really?\nPolice:\nHe's a live wire that one. Got into a fight with the chief for not following protocol...\nPhoenix:\n(Not following protocol...? I bet he wouldn't help them build the case against Edgeworth...)\nExamine\nDetective\nPhoenix:\nThat must be one of the detectives. He's mumbling something to himself.\nPolice:\n\"Don't do anything rash! Why jump...? ...You have every reason to live!\"\nPhoenix:\n... He must be doing image training for talking down a potential suicide.\nChief\nPhoenix:\nThis must be the chief of the detectives here. He's glued to his computer screen.\nChief:\nWha...!? Rook to Bishop 7... Checkmate!? I don't believe it!\nPhoenix:\n(He must be playing chess on the computer...)\nDecember 26Grossberg Law Offices\nPhoenix:\nApparently, Mr. Grossberg is on vacation today. Well, I guess I can come back tomorrow if I need anything.\nExamine\nBookshelf\nPhoenix:\nExpensive-looking mahogany bookshelves, filled with expensive-looking books. Hmm... funny... they don't look like they've ever been read.\nDesk\nPhoenix:\nA solid mahogany desk. The wood's been polished to a deep luster.\nVacant wall\nPhoenix:\nI guess Mr. Grossberg isn't getting that painting back. I feel kind of bad for him...\nPotted plant\nPhoenix:\nAn expensive potted plant. No idea what kind of plant it is, but it's probably the most expensive one available.\nTable\nPhoenix:\nA table for clients. Hmm... an elegant ebony case, and if I'm not mistaken, that lighter's made of solid gold. Even I can tell someone here's got money to burn.\nDecember 26Gourd Lake ParkEntrance\nPhoenix:\nThere are fewer than there were yesterday, but the cops are still around in the park. I wonder if Detective Gumshoe is here today?\nExamine\nTrees\nPhoenix:\nI feel winter's chill from the bare leaf trees today... There's a lot of trees here. I guess that's why they call it a \"nature park.\" It's quite pretty when the cherry trees along the lakeside blossom in spring. Today... it's just cold.\nSign\nPhoenix:\nThe sign says \"Gourd Lake Nature Park.\" This place is full of families picnicking on the weekend. It's a little cold for picnicking these days, though.\nDecember 26Gourd LakePublic Beach\nPhoenix:\nHaven't seen Larry around at all. Probably off paying through the nose on a date with the lovely Kiyance...\nExamine\nLake\nPhoenix:\nThe famous Gourd Lake... Its green waters stretch out on both sides... It's a pretty big lake, really.\nDecember 26Boat Rental Shop\nPhoenix:\n(Looks like the boat rental shop is closed today, too.)\nExamine\nShop\nPhoenix:\nA small boat rental shop. Doesn't look like anyone is around. They're probably closed because of the murder.\nBoats\nPhoenix:\nThere are some boats floating at the dock. The murder took place in a boat from this dock... Apparently, the police took away the actual boat that was used that night. Indeed, there's space for one more boat at the dock.\nDecember 26Gourd Lake Woods\nPhoenix:\nHey, Detective Gumshoe!\nGumshoe:\nHey, pal! The trial today, it, er... ...\nPhoenix:\nYes? What about the trial?\nGumshoe:\nWell, I was going to say \"good show,\" but it wasn't really all that... Though you did save Mr. Edgeworth, I guess... (Changed from [Though you did save Edgeworth, I guess...] in the original release) I just wasn't sure how to thank you... you know?\nPhoenix:\nEr... thanks.\nExamine\nCamera\nPhoenix:\nLotta's camera is staring out at the lake, as usual. Even a novice like me can tell that camera must cost a pretty penny. I hope she doesn't leave it out here to get stolen.\nSign\nPhoenix:\nThe sign says \"No Camping.\" Funny place to pick to pitch your tent.\nCampfire\nPhoenix:\nI wonder why she brought a camping cooker with her? There's a convenience store right up the street... I guess she wanted to get into the outdoor spirit.\nSUV\nPhoenix:\nI don't think Lotta takes very good care of her SUV. It's covered with dents. I can't believe anyone would drive their car down here.\nTalk\nTomorrow's trial\nPhoenix:\nDetective Gumshoe? Any idea what strategy von Karma is planning for tomorrow?\nGumshoe:\nIt sounds like he's bringing in another witness!\nPhoenix:\nAnother witness!? Oh, right, he said something about that in the trial today...\nKarma:\nThere were two witnesses!\nPhoenix:\nI was wondering who that other witness was! Er... who was it?\nGumshoe:\nS... sorry, pal. As much as I'd like to, I'm not at liberty to divulge that information.\nPhoenix:\n(Right...)\nProsecutor Edgeworth\nPhoenix:\nOh, right... I wanted to ask you something about Edgeworth.\nGumshoe:\nWhat's up?\nPhoenix:\nIs he afraid of earthquakes? I never heard anything about that before.\nGumshoe:\n... Mr. Edgeworth doesn't talk about himself too much, see. But there's one thing that's clear as day... Him hating crime the way he does... And him becoming a lawyer... And him being scared of earthquakes... It all started with that incident.\nPhoenix:\nThe DL-6 Incident?\nGumshoe:\nYep, that's the one. Fifteen years ago... when he saw his father shot before his very eyes! He still feels the pain now, you can see it in his eyes.\nMaya Fey\nPhoenix:\nI wanted to talk to you about Maya Fey...\nGumshoe:\nHuh? She's not out on bail yet? That's strange. I told 'em to let her go as soon as they had their report written up. Man... I don't know what would have happened in that courtroom today if it weren't for her. Seeing her getting dragged out by the bailiff... I'll be honest with you, pal. I shed a tear or two. Mr. Edgeworth, he was so moved I saw his lip trembling. (Changed from [Edgeworth, he was so moved I saw his lip trembling.] in the original release)\nPhoenix:\nReally!? (Cold-as-ice Edgeworth!?)\nGumshoe:\nHe was really grateful for what she did, you know.\nPresent\nAttorney's Badge\nGumshoe:\nI think it's a little early for you to be proudly waving that thing around. You can be proud of yourself when you get Mr. Edgeworth declared innocent, pal!\nLotta's Camera\nGumshoe:\nThat woman really took us for a ride, didn't she? Claiming she was a witness to a murder and all...\nPhoenix:\nStill, if it weren't for her photograph, Mr. Edgeworth wouldn't have made it today.\nGumshoe:\nOh, huh, really?\nPhoenix:\n(Umm... you were at the trial, weren't you, Detective?)\nRobert's Autopsy Report\nGumshoe:\nRobert Hammond... He was the defense attorney in the DL-6 Incident trial. He's the one who got the sole suspect off the hook. I wonder what Mr. Edgeworth thinks of him. Not much, I'd wager.\nLake Photo\nGumshoe:\nI don't care who you are, no one can tell me that that's Mr. Edgeworth! I mean, come on, it doesn't look like him at all!\nPhoenix:\nBut Edgeworth has admitted he was on the boat.\nGumshoe:\nThen he's the one being shot, then!\nPhoenix:\nHe seemed fine in court today...\nGumshoe:\n... Details, pal, details! Whose side are you on, anyway?\nPhoenix:\n(All I'm saying is we have to respect the evidence...)\nPistol Bullet\nGumshoe:\nYep, it was fired from the murder weapon, without a doubt.\nPhoenix:\nFrom a meter away... so it would have to have been from someone else on the boat.\nGumshoe:\nHmm...\nPhoenix:\nWhat do you make of this, Detective Gumshoe?\nGumshoe:\nHey, making something of things is your job!\nPhoenix:\nEr... right. (Since when do lawyers have to do detectives' work for them!?)\nPistol\nGumshoe:\nMaybe you should tell me why Mr. Edgeworth's prints were on the weapon, pal.\nPhoenix:\nHuh? How should I know!?\nLotta's Deposition\nGumshoe:\nNow, she heard two gunshots, right?\nPhoenix:\nBut wait... Look at the Court Record! According to this, the murder weapon was fired three times!\nGumshoe:\nWhat!? How's that possible!?\nPhoenix:\nWhere was the third shot fired?\nGumshoe:\nI wonder... Maybe it was a practice shot or something?\nAnything else\nGumshoe:\nSorry to disappoint you, pal. I'm drawing a blank.\nAfter clearing all Talk options:\nGumshoe:\nI'm going to head back to the station. I'll get the report on Maya and get her out of there as soon as I can.\nPhoenix:\nThank you. Oh, wait! Umm... I was wondering, how much is bail going to be?\nGumshoe:\nDon't worry about that. Mr. Edgeworth is posting the whole amount.\nPhoenix:\nWhat? Edgeworth...?\nGumshoe:\nDidn't I tell you? He's grateful to her for what she did. Alright, pal. Well don't forget to go pick her up, okay?\nPhoenix:\n(Hmm... Maybe I can get Edgeworth to pay this month's rent, too...)\nAfter clearing all Talk options in Gourd Lake Woods:\nDecember 26Detention CenterVisitor's Room\nMaya:\nHey, Nick! You finally came! They just finished the paperwork, I'm free to go.\nPhoenix:\nFree at last, eh?\nMaya:\nThose interrogators were really mean! They were like \"okay, what did you do THIS time?\" Like I was some kind of criminal! Can you believe it?\nPhoenix:\nWell, they let you out in the end, didn't they?\nMaya:\nMmm... Oh, that reminds me... Thanks for bail.\nPhoenix:\nThank Edgeworth.\nMaya:\nHuh?\nPhoenix:\nHe posted bail for you. Said he was grateful for what you did.\nMaya:\nMr. Edgeworth did that...? ... I have to make it up to him! We've got to win this case, Nick!\nTalk\nWhat to do\nPhoenix:\nWhat do you think we should do next?\nMaya:\nWe're kind of lacking in the clues department. We could go to the park and look for Gourdy.\nPhoenix:\n...\nMaya:\nI-I was kidding!\nPhoenix:\nStill, if there are any clues out there, the park's as good a bet as any. What do you say? Shall we head down there?\nMaya:\nSure!\nAny ideas\nPhoenix:\nHave you noticed anything lately?\nMaya:\nHmm... You know, I did notice one thing while I was here in detention. It's really pretty comfortable here. It's warm, and they keep it very clean.\nPhoenix:\nI meant have you noticed anything about the case...?\nMaya:\nWell... Not much more than that, no.\nPhoenix:\n(She's probably still upset about Mia. I should leave her alone.)\nWright & Co. Law Offices\nMaya:\nAhh! Fresh air! I gotta say, freedom feels great.\nPhoenix:\nBehave yourself in the courtroom tomorrow, okay?\nMaya:\nHeh heh heh. Misbehaving's much more fun.\nPhoenix:\nIt's not going to be so much fun when Edgeworth refuses to pay your bail again.\nMaya:\n... Right. I'll behave.\nPhoenix:\n(Oh dear...)\nTalk\nWhat to do\nPhoenix:\nWell, what should we do?\nMaya:\nI don't know! I've been in detention this whole time. I think I'll let you decide what we should do. Deal?\nAny ideas\nPhoenix:\nWell? Any thoughts you want to share?\nMaya:\nWell, I was detention all day. I think I'd like more time to think.\nPhoenix:\n(Poor Maya, she probably thought about Mia the whole time she was in there...)\nPresent\nAnything\nMaya:\nDon't waste time showing me things! We have to get cracking on this case! You know the enemy has more tricks up his sleeve! He's bringing in another witness!\nDecember 26Detention CenterVisitor's Room\nPhoenix:\nLooks like Edgeworth is in questioning.\nMaya:\nLet's come back later.\nPhoenix:\nGuess so...\nDecember 26Gourd Lake ParkEntrance\nMaya:\nThere aren't many cops around today, are there?\nPhoenix:\nThey're probably back at the precinct, working up the case against Edgeworth.\nMaya:\nMmm...\nLotta:\nHey y'all!\nMaya:\nHey, it's Lotta!\nLotta:\nY'all really did it today...\nPhoenix:\nWh-what did we do now?\nLotta:\nNaw, I'm not complaining! See, I did a little thinking. A little... self-reflection, you might say. I realized that bein' a witness is a mighty big responsibility. But I just went up there and started blabbing any old thing that came to mind.\nPhoenix:\nLotta...\nLotta:\nSo, you see, I want to make it up to y'all.\nPhoenix:\n\"Make it up\"...?\nTalk\nToday's trial\nPhoenix:\nWhat did you think of the trial?\nLotta:\nTo be honest, I was doin' it half just to say I'd been a witness... Even though I didn't really see anything. I kinda convinced myself I had though... I'm sorry, I know I caused y'all a lot of trouble.\nMaya:\nWell, memory is a tricky, vague little thing.\nLotta:\nYeah, I sure know that now. I'll be fine the next time I witness a murder!\nMaya:\nRight!\nPhoenix:\n(You mean the FIRST time you witness a murder...)\nGourdy\nPhoenix:\nWhat about Gourdy?\nLotta:\nRight! Well, the way I figure, the trial's only stoking the flames of Gourdy fever! I'll get my exclusive photos and rocket to stardom!\nMaya:\nAll right, Lotta! You go, girl! I wish I could be an investigative photographer too!\nPhoenix:\n(Finish your spirit medium training first!)\nMaking it up\nPhoenix:\nLotta, what do you mean by \"making it up to us\"?\nLotta:\nWell, ya see... Actually, I got a bit of information for you.\nMaya:\nWhat!?\nLotta:\nThat von Karma didn't want me to say nothin' about it.\nMaya:\nWh-what information!?\nLotta:\nNow we're getting to the heart of it! See, I reckoned we might be able to do ourselves a little \"exchange.\"\nPhoenix:\nE-\"exchange\"? Umm... I thought this was to \"make it up to us\"...?\nLotta:\nRight! I propose a little exchange, to make it up to you!\nPhoenix:\n...\nLotta:\nWhat!? Information don't come cheap, my friend!\nMaya:\nUh...\nLotta:\nHey! I see you thinking \"my, how unsophisticated these southern folks are\"!!! It's written all over yer face! Let me tell you, most southerners are WAY more sophisticated than you... I'm just the exception, okay? Well, what'll it be? We gonna deal, or not!?\nMaya:\nWh-what should we do, Nick?\nDeal\nPhoenix:\n(We don't have any other leads so I don't think we have a choice here...) Okay. How much?\nLotta:\nHuh? You completely off your rocker? I may not be sophisticated, but I'm not trying to rob the poor!\nLeads to:\n\"Huh?\"\nNo deal\nPhoenix:\nI'm sorry... But I've no intention of dealing with you!\nMaya:\nNor do we have any money, anyway!\nLotta:\nYou guys make a fine team, you know that? And I can tell you don't have any money, just look at those clothes!\nLeads to:\n\"Huh?\"\nPresent\nLotta's Camera\nLotta:\nI'm thinking I should up the sensitivity of my camera mic. Y'all just be sure y'all don't sneeze or nothing when you're in my part of the woods!\nPhoenix:\nRight...\nLake Photo\nLotta:\nI'm glad I did that enlargement.\nPhoenix:\nNo kidding. If we didn't have that, Edgeworth would be in prison now, or worse!\nMaya:\nThere's never a lack of drama when you're on a case, is there, Nick?\nLotta:\nWhat, are you always on the verge of horrible failure like this!?\nPhoenix:\nUmm...\nLotta:\nCareful or the stress'll send you to an early grave.\nPhoenix:\n(Thanks for the cheerful message of support!)\nGourdy Article\nMaya:\nUmm... uh... You know, I was wondering...\nLotta:\nYeah?\nMaya:\nWhat if you get a picture of Gourdy... and it turns out like this enlargement did?\nLotta:\nY'all crazy!? A blurry picture like this doesn't make a hit story! I need a picture that screams \"I am Gourdy! Hear me roar!\" I can't turn something like this into the paper! What kind of fool do y'all think I am?\nPhoenix:\n(The kind of fool that would turn a blurry picture in as evidence in a murder trial? Not to mention claiming she saw something she didn't see!)\nAnything else\nLotta:\nYep, I'd have to say I know exactly squat about that.\nPhoenix:\n(It's painfully easy to know when something doesn't catch Lotta's interest...)\nPhoenix:\nHuh?\nLotta:\nThe only fair exchange for information is... information! Listen good-- What I need from you is information about Gourdy!\nMaya:\nWhoa-whoa-whoa! G-Gourdy!?\nPhoenix:\nB-but Gourdy doesn't... I mean, Gourdy might not exist!\nLotta:\nThen bring me proof that shows he don't!\nPhoenix:\nUh...\nLotta:\nI'll be keepin' watch from the car, okay? You see something, y'all come to me first, got it?\nPhoenix:\nO-okay...\nLotta:\nRight! See y'all later!\nPhoenix:\n...\nMaya:\nOkay, Nick, let's get hunting!\nPhoenix:\nH-hunting...? You don't seriously mean...\nMaya:\nGourdy? I sure do!\nPhoenix:\nWhat about Edgeworth!?\nMaya:\nWe're searching for Gourdy for him, Nick! Don't you get it!?\nPhoenix:\n(Okay... and how exactly do we search for a make-believe monster...? Maybe we can find a monster myth specialist?)\nDecember 26Gourd LakePublic Beach\nPhoenix:\nWh-what's that?\nMaya:\nTh-the Steel Samurai, Nick.\nButz:\nYo! Maya!\nPhoenix:\nLarry! What the heck is that!? (Changed from [Larry! What the heck is this!?] in the original release)\nButz:\nOh, it was my girl Kiyance's idea... She was all \"if you like, put this here, it would be, like, really cool!\" Dude, she gave it to me along with the banner!\nMaya:\nWow! That's really impressive she could find those for you!\nButz:\nWell, she knows a lot of people. And that show's finished now, so she got 'em for free.\nPhoenix:\nRight...\nExamine\nFlags\nPhoenix:\nThose flags look sadly out of place here. Flapping listlessly back and forth in a cold wind under a cold sky...\nMaya:\nI dunno, I think it kind of gives the place a festival atmosphere. It reminds me of the \"War of the Eyeglasses\"!\nPhoenix:\n...? The war of the what!?\nMaya:\nHuh? What? You mean, you don't know the War of the Eyeglasses?\nPhoenix:\nWhat the heck is it?\nMaya:\nOur local fair used to do it ever summer... Huh, I guess we were the only ones.\nPhoenix:\n(I ask again, what the heck is it!?)\nSteel Samurai inflatable\nPhoenix:\nDoesn't that Steel Samurai look a little out of place? I mean, it's so huge... I guess it's good advertising.\nMaya:\n... Something about this Steel Samurai just doesn't work for me.\nPhoenix:\nHuh? Really? It looks pretty well made to me.\nMaya:\nHmph. Still a novice, aren't you, Nick. Really... True connoisseurs like Cody and me don't fall for this kind of stuff.\nPhoenix:\n(These Steel Samurai fans are obviously in a league of their own...)\nCompressor\nMaya:\nWhat's this machine?\nButz:\nThat? That's a compressor. I use it to fill up that balloon there with air.\nMaya:\nHuh, neat.\nButz:\nJust got it repaired yesterday! Man, what a drag that was.\nTalk\nEdgeworth\nButz:\nYo, Nick! What happened with Edgeworth?\nPhoenix:\nWell, we made it through the first day in court all right... I don't know how good our prospects are from here on, though.\nButz:\nHuh.\nMaya:\nHey, Larry, did you know Edgeworth's secret weakness? He's terrified of earthquakes! He acts like a little boy!\nButz:\nHuh? That's weird. I don't think he was ever like that in school.\nMaya:\nNo? Really?\nButz:\nWell, we were only in the same class for a year. He transferred schools pretty quickly...\nMaya:\nTransferred?\nPhoenix:\n(Right... when the DL-6 Incident happened. Doesn't look like Larry knows about it, though.)\nThe big samurai\nPhoenix:\nHey, Larry. What was that big... thing up there before?\nButz:\nHuh? Oh, the big guy? I've had that for about a month, yeah. It's a big hit with the kids!\nPhoenix:\nWhy wasn't it there yesterday?\nButz:\nHuh? Huh!? Oh... right. Th-the compressor was busted.\nMaya:\nCompressor?\nButz:\nYeah--it's that little unit by my hotdog stand. That what I use to put air in the Steel Samurai! It broke a little while ago so I sent it in for repairs.\nMaya:\nOh. And here I thought you'd inflated it by yourself.\nPresent\nGourdy Article\nButz:\nThat's the guy thats selling my dogs faster than I can cook 'em!\nMaya:\nDo you think Gourdy really exists?\nButz:\nNah, I think somebody probably saw something else that they just thought was Gourdy. But I'll keep selling Samurai Dogs until the truth's out!\nAnything else\nButz:\nSorry, Nick. I don't know much about that. I am a mere seller of hotdogs.\nDecember 26Boat Rental Shop\nMaya:\n... Its always so quiet, here. I wonder if the boat shop is closed for good?\nPhoenix:\nWell, with the murder on the lake and all... They're probably just taking a vacation till it blows over.\nMaya:\nI get it.\nAfter clearing \"Making it up\" talk option in Gourd Lake Park - Entrance:\nDecember 26Gourd Lake Woods\nLotta:\nHey y'all! Well? Y'all find anything out about Gourdy?\nMaya:\nUmm... no, nothing.\nLotta:\nWell, keep moving! It gets cold out here at nighttime.\nMaya:\nIt is a little chilly... I... I think I have to sneeze!\nLotta:\nWh-whoa! No you don't! No sneezing!!!\nMaya:\nWhaaa-cho!\nklik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik\nMaya:\n...\nLotta:\nI told y'all NO SNEEZING! See, I set the camera to respond to things a little softer than a \"bang.\" It'd trigger on one of von Karma's finger snaps now!\nMaya:\nOh... I'm sorry.\nLotta:\nYeah, well, sorry's nice but what about my film!?\nMaya:\nNick... pay the lady.\nPhoenix:\n(*sob*)\nTalk\nWhat happened\nLotta:\nI learned something in today's trial, that's for sure. Testifyin' is serious business! That's why I decided not to talk about that case any more.\nMaya:\nHuh?\nPhoenix:\nWhoa--didn't you say you had information about the case!? Tell us that, at least!\nLotta:\nLike I said... I'll trade it for the dirt on Gourdy!\nGourdy\nMaya:\nWhat are you going to do if Gourdy doesn't exist?\nLotta:\nI'll quit being an investigative photographer.\nMaya:\nWhat!?\nLotta:\nAfter all, I only have one photo to my name so far...\nMaya:\nWas it a good one?\nLotta:\nYou bet... a yoofoh!\nMaya:\nA y-yoofoh...?\nLotta:\nAnyway, if I can't get a career-making photo this time around... Then that's it! I'll quit and go back to school.\nMaya:\nHuh? So you really are a university student?\nLotta:\nYeah, well, I'm takin' a break for a bit.\nMaya:\nRight...\nPresent\nLotta's Camera\nLotta:\nI gotta do what I gotta do to get me a picture of Gourdy! That's why I raised the sensitivity of my mic. Just... watch yourself from now on, okay?\nMaya:\nSorry, sorry!\nDecember 26Police DepartmentCriminal Affairs\nGumshoe:\nHey there, pal. What's up? You look out of sorts. Wait... you didn't go and do something that's going to hurt Mr. Edgeworth's case again!\nPhoenix:\nWhat do you mean, \"again\"!?\nGumshoe:\nWhatever, have a seat, pal. I'm here for you if you need anything. Besides money, that is.\nExamine\nDetective\nPhoenix:\nThat must be one of the detectives. He's mumbling something to himself.\nPolice:\n\"You're under arrest! I have a warrant... You have the right to remain silent, you have the right to an attorney...\"\nPhoenix:\n... He must be doing image training for making arrests.\nTalk\nThe investigation\nPhoenix:\nHow is the investigation proceeding?\nGumshoe:\nIt's not, really. We have another meeting coming up... We're supposed to talk about Mr. Edgeworth's motive...\nMaya:\nHis motive?\nGumshoe:\nSee, Mr. Edgeworth's father died in the DL-6 Incident... And the guy who got the lone suspect declared innocent was the victim in this case... Robert Hammond. They're saying that's why Mr. Edgeworth shot him.\nPhoenix:\n(And Edgeworth never talks about his past... I bet they'll drag that out and hit him with it in court tomorrow, too...)\nMaya:\nPoor Edgeworth...\nGumshoe:\nI gotta admit, it doesn't look good, pal.\nGourdy\nMaya:\nSay, Detective Gumshoe. Do you know \"Gourdy\"?\nGumshoe:\nThe monster down in Gourd Lake? Not personally, no.\nMaya:\nWell... we're looking for it. (Changed from [Well... we're looking for him.] in the original release)\nGumshoe:\nHuh!? Are you out of your minds!?\nMaya:\nEeek!\nGumshoe:\nYou got time to go wild monster hunting!? How about doing a little questioning for me then!?\nMaya:\nOh... Detective Gumshoe is scaring me, Nick.\nPhoenix:\nI told Detective Gumshoe about the deal with Lotta.\nMaya:\nNick! Try telling him sooner next time!\nPhoenix:\nEr, sorry.\nGumshoe:\n... I see, pal. Sorry for shoutin' at you. ... Okay! I, Detective Gumshoe, will aid your search for Gourdy!\nMaya:\nH-huh!?\nGumshoe:\nI'll loan you one of our newest secret weapons for finding evidence!\nMaya:\nReally!?\nGumshoe:\nYou can take whichever one you like!\nChanges \"Gourdy\" Talk option to \"Secret weapons\"\nSecret weapons\nMaya:\nOkay, give us the goods!\nGumshoe:\nHold on now, everything in due time. First, let me show 'em to you! These are our best and brightest! Introducing Secret Weapon No. 1: \"Missile\"!\nMaya:\nM-M-Missile?\nGumshoe:\nHe's a K-9 police dog, still in training! Missile! Missile! Here, boy...\nMissile:\nWoof.\nGumshoe:\nHere he is.\nMaya:\nHey, he's cute! Look, Nick! Cute dog!\nPhoenix:\n(A cute dog... And this will help us... how?)\nMissile:\nWoof.\nGumshoe:\nNext, Secret Weapon No. 2... A fishing pole! Here, this is my own personal pole.\nPhoenix:\nDetective Gumshoe... we're looking for a monster...\nGumshoe:\nYeah!\nPhoenix:\nHow are we supposed to catch a whole sea monster with a fishing pole!?\nGumshoe:\nNever know 'til you try, pal!\nPhoenix:\n...!\nGumshoe:\nOkay, this next one is the last one.\nPhoenix:\n(No, please, I'm already overwhelmed by our choices.)\nGumshoe:\nSecret Weapon No. 3! A metal detector! Here.\nPhoenix:\nDetective Gumshoe... we're looking for something alive.\nGumshoe:\nRight!\nPhoenix:\nHow are we supposed to find it with a metal detector!?\nGumshoe:\nHey, you never know! It might have been eating soda cans! Well, which will it be!?\nMaya:\nUmm... I can't make up my mind, Nick. They all seem so perfect!\nPhoenix:\nI can't make up my mind, either... for the totally opposite reason. (Oh well, I suppose it can't hurt to borrow one of them.)\nBorrow Missile\nPhoenix:\nCan we borrow Missile?\nGumshoe:\nSure thing, pal. Be good to 'im!\nMissile:\nWoof.\nMaya:\nHe's sooooo cute!\nPhoenix:\n(Oh boy...)\nBorrowed K-9 unit Missile from Detective Gumshoe.\nLeads back to Talk options\nBorrow the fishing pole\nPhoenix:\nCan we borrow that flimsy-looking fishing pole?\nGumshoe:\nSure thing, pal. Oh, if it breaks, be sure to dispose of it properly, okay?\nPhoenix:\nEr... right.\nBorrowed Fishing Pole from Detective Gumshoe.\nLeads back to Talk options\nBorrow the metal detector\nPhoenix:\nCan we borrow that metal detector?\nGumshoe:\nSure thing, pal.\nPhoenix:\nI'm not sure what we're going to find with this...\nGumshoe:\nRemember: you're hunting for a monster. Anything is possible! Anything!\nBorrowed Metal Detector from Detective Gumshoe.\nLeads back to Talk options\nSecret weapons (subsequent times)\nPhoenix:\nDetective Gumshoe, can we borrow one of the other things?\nGumshoe:\nHmm? Yeah, sure, pal! But I have to take back the last one I lent you, department policy. Well, take your pick. Which will it be?\nBorrow Missile\nPhoenix:\nCan we borrow Missile?\nGumshoe:\nSure thing, pal. Be good to 'im!\nMissile:\nWoof.\nMaya:\nHe's sooooo cute!\nPhoenix:\n(Oh boy...)\nBorrowed K-9 unit Missile from Detective Gumshoe.\nLeads back to Talk options\nBorrow the fishing pole\nPhoenix:\nCan we borrow that flimsy-looking fishing pole?\nGumshoe:\nSure thing, pal. Oh, if it breaks, be sure to dispose of it properly, okay?\nPhoenix:\nEr... right.\nBorrowed Fishing Pole from Detective Gumshoe.\nLeads back to Talk options\nBorrow the metal detector\nPhoenix:\nCan we borrow that metal detector?\nGumshoe:\nSure thing, pal.\nPhoenix:\nI'm not sure what we're going to find with this...\nGumshoe:\nRemember: you're hunting for a monster. Anything is possible! Anything!\nBorrowed Metal Detector from Detective Gumshoe.\nLeads back to Talk options\nPresent\nMissile\nGumshoe:\nMissile is a big star in criminal affairs.\nMaya:\nWhy's he named \"Missile\"?\nGumshoe:\nHuh... now that you mention it, I'm not sure. But I hear he's aptly-named, for what it's worth.\nFishing Pole\nGumshoe:\nIt's funny, one day I woke up and I wanted a fishing pole.\nMaya:\nDo you like fishing?\nGumshoe:\nI've never gone. I just wanted one so bad, I went out and bought it. I've never used it, actually.\nPhoenix:\n(Must have been one of those mid-life crisis things...)\nMetal Detector\nGumshoe:\nAs you can see, it's a metal detector. We use it to look for bullets in the ground. If you can find that monster with it, all the better!\nPhoenix:\n(I'm not so hopeful...)\nGourd Lake Public Beach\nIf Missile is added to the Court Record\nMaya:\nHey, Nick...\nPhoenix:\nHmm?\nMaya:\nMissile's been acting strangely...\nPhoenix:\n\"Missile\"? Oh, oh right. That little... creature of yours.\nButz:\nHey, I love lil' doggies! Good boy, good boy.\nMissile:\nGrrraaaaaaarh!\nMaya:\nWh-what's wrong, Missile?\nMissile:\n... Yip yip yip yip yip yip yip yip yip yip yip yip yip yip!\nMaya:\nEeeeek! Missile! Misssssssssssile!\nMissile:\nMunch munch munch munch munch munch munch munch Munch munch munch munch munch munch munch munch\nButz:\nWh-whoa! Stop that thing! Cannibal! It's eating my Samurai Dogs! ...! ... My Samurai Dogs... *sniff*\nMaya:\nWow. He ate every single one.\nPhoenix:\nI'm sorry, Larry...\nButz:\n\"Sorry\"!? \"Sorry\" don't pay my bills, Nick!\nPhoenix:\nAh hah hah... (It's going to have to this time...)\nPresent\nMissile\nMaya:\nHey Larry! Look, it's Missile! Isn't he cute?\nButz:\nK-keep that mutt away from me! What am I going to tell the big boss?\nMaya:\nThere's a \"big boss\" in charge of your hot dog stand? Nick! Maybe the stand is a front for a mafia money laundering scheme!!!\nPhoenix:\nMaya... I think you should probably try to look a little sorry about what happened.\nMaya:\nOh, right!\nButz:\nHeh... My poor dogs...\nFishing Pole\nButz:\nYou know, you can't catch many fish in this lake.\nMaya:\nI'm not after small fry. I'm after the biggest fry of them all... Gourdy!\nButz:\n... You really going to try to fish out a monster?\nMaya:\nTo save Edgeworth, yes!\nButz:\n... Brings a tear to my eye, in more ways than one.\nGourd Lake Woods\nIf Fishing Pole is added to the Court Record\nMaya:\nMmm. Okay, Nick, this looks like a good spot!\nPhoenix:\nA good spot... for what?\nMaya:\nTime to do some fishing!\nPhoenix:\n(She's serious...) Umm... What are you going to use for bait?\nMaya:\nOh...\nPhoenix:\nYeah. \"Oh.\"\nMaya:\nMmm...\nPhoenix:\nI figured something like this would happen. We should have brought Missile along with us, too. At least then we'd have bait.\nMaya:\n...!!! N-Nick...! How could you!\nPhoenix:\nI'm kidding! I'm kidding!\nMaya:\nHmph! Some jokes are better left untold.\nPhoenix:\n(Oof! She hit me!)\nMaya:\nOkay... Watch this, Nick!\nPhoenix:\nJust try not to reel in any empty cans or boots, okay?\nMaya:\nHere we go! Ack! M-my leg!\n*whump*\nklik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik klik\nLotta:\nHey! Wh-what are you doing!\nMaya:\nSorry, Lotta...\nLotta:\nDon't tell me y'all are on some film company's payroll!\nMaya:\nNick, pay her.\nPhoenix:\n(Dear, dear...)\nPresent\nMissile\nMaya:\nHey, Lotta!\nLotta:\nOh, cute! He yours?\nMaya:\nHe's a K-9 police dog! His name's \"Missile.\"\nLotta:\nHuh. K-9s are the ones they use to sniff for things, right? I wonder what Gourdy smells like...\nMaya:\nHmm... I hadn't thought about that.\nFishing Pole\nMaya:\nLotta, wait... For catching Gourdy...\nLotta:\nA fishing pole!? Are you out of your doggone mind!?\nMaya:\nYes! I mean... yes, it's a fishing pole!\nLotta:\nHuh. I never thought of that! Good luck!\nMaya:\nThanks!\nPhoenix:\n(I don't believe it...)\nMetal Detector\nMaya:\nHey, Lotta, look at this: It's a metal detector!\nLotta:\nI know what it is. Umm... I'm not sure that's going to pick up Gourdy, though. Unless he's been eating people's watches or spare change or something.\nMaya:\nOh... I hadn't thought about that.\nBoat Rental Shop\nIf Metal Detector is added to the Court Record\n*beep* *beep* *beep*\nMaya:\nN-Nick! It's beeping! The metal detector's found something!\nPhoenix:\nSure it loud enough about it. (Whatever it is, it must be in those bushes...) Go check it out, Maya.\nMaya:\nWhy do I have to check it out? ... Nick. Look!\nPhoenix:\nHuh...? An air tank? Huh. The valve looks broken.\nMaya:\nI thought it was Gourdy...\nPhoenix:\nMaya, first of all... Why would Gourdy be in the bushes!? And second of all, why would a metal detector react to a sea monster!?\nMaya:\nOh.\nPhoenix:\nHuh? (There's something wrapped around this air tank... It looks like... a string of flags...?)\nMaya:\nWell, we might as well take it with us now that we've found it.\nPhoenix:\n(It's heavy...)\nAir Tank of dubious value retrieved. (Changed from [Picked up air tank of dubious value.] in the original release)\nAfter Air Tank is added to the Court Record:\nDecember 26Police DepartmentCriminal Affairs\nPhoenix:\nHmm... Detective Gumshoe isn't here...\nMaya:\nNow that you mention it, didn't he say he had a meeting to go to?\nPhoenix:\nAh, that's right... Let's come back later.\nExamine\nDetective\nPhoenix:\nThat must be one of the detectives. He's mumbling something to himself.\nPolice:\n\"Resistance is futile! We have you surrounded! It's not too late... Release the hostages and come out with your hands up.\"\nPhoenix:\n... He must be doing image training for negotiating a hostage situation.\nGourd Lake Public Beach\nTalk\nThe flying air tank (after selecting \"Is it yours?\", then \"To inflate something\", then \"Ask more about the tank\" upon presenting Air Tank)\nMaya:\nUmm... So, the tank and the Steel Samurai you were trying to fill up flew away... What happened next?\nButz:\nWell, all that happened on the 20th or so.\nPhoenix:\n(The 20th... a week ago.)\nButz:\nNow, as far as I could see, the tank went flying out into the lake. So I went out every night in a boat looking for it. I mean, Kiyance gave me that Steel Samurai after all!\nMaya:\nAnd when did you find it?\nButz:\nJust the night before last! It flew way out there! Took me four whole days to find it.\nPhoenix:\n(The night before last... was the night of the murder!)\nButz:\nSorry for not telling you, Nick. Actually, I was here on the night of the murder. But, you see, I went home before midnight.\nMaya:\nSo you didn't know about what happened?\nButz:\nNo...\nMaya:\nThat's too bad...\nPhoenix:\nIt's not all bad. We've solved one mystery at least.\nMaya:\nA mystery...?\nPhoenix:\n(Maybe we should go tell her...)\nPresent\nAir Tank\nButz:\nWhat? An air tank? What about it?\nPhoenix:\nLarry... I wanted to ask you about this tank...\nHave you seen it before?\nPhoenix:\nHave you seen this before?\nButz:\nHuh? Me? N-no. Never. Who the heck would go diving in the middle of the winter!\nPhoenix:\n(There's something about the way his eye twitched when I showed him the tank... I think I'd better pursue this line of questioning a little further...)\nLeads back to Court Record\nIs it yours?\nPhoenix:\nSay... is this air tank yours?\nButz:\nWh-why would I have a thing like that?\nPhoenix:\nLook--see how there's a string of flags around the tank valve? It's just like the string of flags around your Steel Samurai there.\nButz:\n...! M-must be a coincidence! There's strings of flags everywhere these days! L-like elementary schools! A-and used car dealerships! L-look, why would I need a tank anyway!?\nTo inflate something\nPhoenix:\nYou used this to inflate that, didn't you?\nButz:\nI-inflate what!?\nPhoenix:\nWhat else? That big puffy Steel Samurai!\nButz:\n!!! ... N-now why would you go asking me a question like that.\nPhoenix:\n(Looks like I hit the nail on the head.)\nButz:\n... Right... right... Actually, umm... See, the compressor I always use was on the fritz. So I tried using the tank to inflate it, just once. And, er, it didn't go so well.\nPhoenix:\n(As I suspected!)\nPut the tank away\nPhoenix:\n(I guess I've gotten to the bottom of that mystery!)\nButz:\nHeh. Sorry!\nLeads back to Court Record\nAsk more about the tank\nPhoenix:\nIt \"didn't go so well\"?\nButz:\nEr, yeah.\nPhoenix:\nDo you think you could be a little more specific?\nButz:\nC-c'mon...  Look, it's embarrassing so I really don't want to talk about it...\nMaya:\nTell us! Tell us!\nButz:\n... Fine. Whatever. It's like what I said, the compressor was busted. So I took the tank and tried to fill the Samurai up with that. And then...\nBLAAAAM!\nButz:\nThe valve busted open and made this incredible noise! And that tank there took off like a rocket. And it took my poor deflated Steel Samurai with it!\nMaya:\nWhat!? Off into Gourd Lake?\nButz:\nIt sure scared me out of my gourd, that's for sure.\nAdds Talk option \"The flying air tank\"\nTo go diving\nPhoenix:\nYou used this to go diving in the lake, didn't you?\nButz:\nWh-wh-what!? Why the heck would I go diving in the lake!? Wait! You... you're not... You're not saying I had something to do with that murder!?\nPhoenix:\nN-no, not at all, just...\nButz:\nHey, you watch it buddy! I'm not saying anything until my lawyer gets here!\nMaya:\nLarry... Nick is your lawyer.\nPhoenix:\nWell, Larry? She's right.\nButz:\nBah! A-anyway, I never seen that air tank! Okay?\nPhoenix:\n(Yeah, right... Larry is hiding something, I can tell...)\nLeads back to Court Record\nAir Tank (after selecting \"Is it yours?\", then \"To inflate something\", then \"Ask more about the tank\" upon presenting Air Tank)\nButz:\nSee, I tried to use this tank to fill up the Samurai. I was attaching the tank, when it happened!\nBLAAAAM!\nButz:\nThe valve just busted open and the whole thing took off! The tank shot up in the air like a rocket... And it took my poor deflated Steel Samurai with it! Man, what a sight that was.\nMaya:\nI wish I could have seen it!\nPhoenix:\nMe too.\nGourd Lake Woods\nTalk\nGourdy\nLotta:\nWell, Mister Lawyer? I've got the info y'all need! Y'all got the scoop on Gourdy for me yet?\nNothing yet\nPhoenix:\nIt's not going to be that easy to find him, you know.\nLotta:\nYou'd better hurry or you won't have that info in time for the trial tomorrow!\nPhoenix:\n(Uh oh...)\nLeads back to Talk options\nWe found him\nPhoenix:\nHuh? Gourdy? Oh, we found him already.\nMaya:\nWhat!? I haven't seen any monsters yet!\nLotta:\nY-y'all for real!? Gourdy really exists!? Wait! I need proof! You get a photo!?\nI have proof\nPhoenix:\nOf course I have proof.\nMaya:\nNo fair, Nick! It was when I went to the bathroom, wasn't it!? That's when you made contact with Gourdy!\nLotta:\nEnough jabbering already, let's see your proof!\nPresent Air Tank (after clearing \"The flying air tank\" Talk option in Gourd Lake - Public Beach)\nPhoenix:\nMaya:\nLarry's air tank...?\nLotta:\nWhat're y'all doing with an air tank?\nPhoenix:\nThis... is Gourdy.\nLotta:\nUmm... scuze me?\nMaya:\nWh-what exactly are you saying, Nick?\nPhoenix:\nThere's a stand near here... a hotdog stand. There's a giant inflatable samurai doll there. About a week ago, an idiot, who happens to be a friend of mine, tried to fill it. He used this air tank, and when the valve blew, the tank flew into the lake. Apparently, it made a pretty loud \"bang\" when it flew...\nLotta:\nA \"bang\"...?\nPhoenix:\nThe tank, along with the still deflated Samurai fell into the lake. At the same time... A couple was taking a photograph of the lake. This photo!\nMaya:\nWait... So... you're saying that Gourdy... Is really the Steel Samurai!?\nLotta:\n... ... Well, that's a fine way to ruin a gal's dreams.\nPhoenix:\nI'm sorry, Lotta.\nLotta:\nNah, it's okay, you win. I'll give you your info, like I promised.\nMaya:\nPoor Lotta...\nAdds \"Case information\" Talk option\nPresent anything else\nPhoenix:\nLotta:\n... Y'all trying to make a fool out of me? That don't prove diddly-squat!\nMaya:\nHmph. We almost had her duped, too.\nPhoenix:\n(We need to do something soon or I won't get that information off of her!)\nLeads back to Talk options\nI have no proof\nPhoenix:\nI don't have it yet, but my lawyer instincts tell me the proof is out there.\nLotta:\nHah! Nice try, but y'all can't pull the wool over these eyes that easy!\nMaya:\nThat won't work in court either, Nick...\nPhoenix:\n(Great, now they're both mad at me.)\nLeads back to Talk options\nGourdy doesn't exist\nPhoenix:\nLotta... There is no such thing as Gourdy.\nLotta:\nWh-what!? How can y'all be so sure!\nMaya:\nR-really, Nick!?\nLotta:\nY'all got some proof Gourdy don't exist!?\nPhoenix:\nThe proof that Gourdy doesn't exist...\nIs here\nPhoenix:\nOf course I have proof. No lawyer worth his badge would make a claim without proof to back it up. Here's the proof that Gourdy doesn't exist...\nPresent Air Tank (after clearing \"The flying air tank\" Talk option in Gourd Lake - Public Beach)\nPhoenix:\nMaya:\nLarry's air tank...?\nLotta:\nWhat're y'all doing with an air tank?\nPhoenix:\nThis... is Gourdy.\nLotta:\nUmm... scuze me?\nMaya:\nWh-what exactly are you saying, Nick?\nPhoenix:\nThere's a stand near here... a hotdog stand. There's a giant inflatable samurai doll there. About a week ago, an idiot, who happens to be a friend of mine, tried to fill it. He used this air tank, and when the valve blew, the tank flew into the lake. Apparently, it made a pretty loud \"bang\" when it flew...\nLotta:\nA \"bang\"...?\nPhoenix:\nThe tank, along with the still deflated Samurai fell into the lake. At the same time... A couple was taking a photograph of the lake. This photo!\nMaya:\nWait... So... you're saying that Gourdy... Is really the Steel Samurai!?\nLotta:\n... ... Well, that's a fine way to ruin a gal's dreams.\nPhoenix:\nI'm sorry, Lotta.\nLotta:\nNah, it's okay, you win. I'll give you your info, like I promised.\nMaya:\nPoor Lotta...\nAdds \"Case information\" Talk option\nPresent anything else\nPhoenix:\nLotta:\n... Hah! All that fancy talk about lawyers and proof had me going for a second there! Y'all better take a good hard look at that badge of yours and consider a career change!\nPhoenix:\n(Great, the \"investigative photographer\" is giving me career advice...)\nLeads back to Talk options\nIs out there somewhere\nPhoenix:\nI don't have it yet, but my lawyer instincts tell me the proof is out there.\nLotta:\nHah! Nice try, but y'all can't pull the wool over these eyes that easy!\nMaya:\nThat won't work in court either, Nick...\nPhoenix:\n(Great, now they're both mad at me.)\nLeads back to Talk options\nCase information (appears after correctly presenting Air Tank upon selecting \"Gourdy\" Talk option)\nLeads to:\n\"So, tell us this \"information\" you have.\"\nPhoenix:\nSo, tell us this \"information\" you have.\nLotta:\nA promise is a promise, I guess... I overheard the cops around here saying something about the witness tomorrow... They said he's the caretaker of the boat rental place up the path here.\nMaya:\nBoat rental...? There's someone there? I mean, it looks so deserted.\nLotta:\nJust an old guy, living all by himself. Y'all should go check it out.\nMaya:\nThanks, Lotta! We will! Let's get cracking, Nick!\nLotta:\nHold on.\nPhoenix:\nSomething else?\nLotta:\nYeah... the night of the murder. My camera clicked twice, you know.\nMaya:\n...! Wait... so you have another photo?\nLotta:\nWell... Yeah, but there's nothing in it at all. Just the lake. I figured it wouldn't be much use as evidence, so I kept it to myself. Well, it might not be helpful at all, but... Here, take it.\nSecond Lake Photo added to the Court Record.\nLotta:\nBye now. Y'all take care. Time for me to pack up and leave.\nMaya:\n... Poor Lotta...\nPhoenix:\nIt's all Larry's fault. The legend still lives on, I guess.\nMaya:\nThe \"legend\"...?\nPhoenix:\nYeah, the legend of Larry, familiar to all who know him for any length of time... \"When something smells, it's usually the Butz.\"\nMaya:\nHmm. Someone should whip that Butz into shape.\nDecember 26Boat Rental Shop\nMaya:\nHey, Nick! This is the boat shop that Lotta was talking about!\nPhoenix:\nYou're right. Doesn't seem to be anyone around at all.\nMaya:\nWell, let's go check it out anyway!\nDecember 26Caretaker's Shack\nUncle:\nMeg! That you!?\nMaya:\nEeeek!\nUncle:\nHey, is that Keith with you!? Where have you two been! I've been worried sick.\nMaya:\n... N-Nick... you handle this.\nPhoenix:\nUh, I think I'll leave this one up to you, Maya.\nUncle:\nMeg!\nMaya:\nY-yes!?\nUncle:\nFinally made up your mind, have you?\nMeg:\nM-my mind?\nUncle:\nYou'll run the pasta shop when I'm gone?\nMaya:\nP-pasta?\nUncle:\nGlad to hear it, glad to hear it! You make your old man proud. When you kids left the house, I didn't know what to think. How'm I supposed to keep this place running, an old man like me? Polly! The kids are home!\nParrot:\n\"Hello! Hello!\" *squawk*\nMaya:\nN-Nick! What was that!?\nPhoenix:\nA parrot... the one on the perch.\nUncle:\nKeith!\nPhoenix:\nY-yes!?\nUncle:\nI leave the \"Wet Noodle\" in your capable hands, sonny.\nMaya:\nN-Nick? What's the \"Wet Noodle\"?\nPhoenix:\nUm, based on the available evidence, I'd say it's the name of his pasta shop.\nUncle:\nThat's a relief, isn't it, Polly?\nParrot:\n\"Hello! Hello!\" *squawk*\nUncle:\nAyup... ... *Zzzzz*\nMaya:\nHe fell asleep...\nPhoenix:\nI guess he's relieved.\nExamine\nStove\nPhoenix:\nLooks like a kitchen unit. It's pretty clean. Funny, he doesn't look like the type who'd keep things tidy like that.\nMaya:\nYou're forgetting, Nick... He's running a pasta shop, here!\nFish pictures\nPhoenix:\nWow, there's lots of various fish in Gourd Lake, aren't there!\nMaya:\n...? Something's funny, Nick. All these fish are saltwater fish.\nFishing pole\nPhoenix:\nThis fishing pole looks expensive.\nTable\nMaya:\nLook, Nick, he has an electric blanket on his table! Looks warm! That's a great idea, we should do that at the office. We can sit down with our clients, snug and warm, and drink hot cocoa!\nPhoenix:\nAnd what, talk about murders?\nMaya:\nAw, you're a party pooper, Nick!\nTelevision\nMaya:\nWow, he has a television in here, too.\nSafe\nMaya:\nLook, a little safe! Hmm... ... It's locked.\nParrot\nMaya:\nWow... what an amazing parrot that is. Good morning!\nParrot:\n\"...\"\nMaya:\nHello!\nParrot:\n\"...\"\nMaya:\nHe ignored me!\nUncle:\n</nowiki>*</nowiki>Zzzzz* What, you forgot, Meg? You gotta call her name first!\nMaya:\nHer name?\nUncle:\nPolly! How ya been!?\nParrot:\n\"Hello! Hello!\" *squawk*\nUncle:\nSee?\nMaya:\nNeat! So the parrot's name is \"Polly\"!\nParrot added to the Court Record.\nMaya:\nToo bad all she can say is \"hello\"...\nUncle:\nHar har har! Old Polly can say lots of things! You just need to know the secret words!\nMaya:\nThe \"secret words\"...?\nParrot (after presenting Attorney's Badge)\nMaya:\nWow... what an amazing parrot that is. Good morning!\nParrot:\n\"...\"\nMaya:\nHello!\nParrot:\n\"...\"\nMaya:\nHe ignored me!\nUncle:\nWhat, you forgot, Meg? You gotta call her name first!\nMaya:\nHer name?\nUncle:\nPolly! How ya been!?\nParrot:\n\"Hello! Hello!\" *squawk*\nUncle:\nSee?\nMaya:\nNeat! So the parrot's name is \"Polly\"!\nParrot added to the Court Record.\nMaya:\nToo bad all she can say is \"hello\"...\nUncle:\nHar har har! Old Polly can say lots of things! You just need to know the secret words!\nMaya:\nThe \"secret words\"...?\nParrot (subsequent times)\nMaya:\nPolly! Polly! What's your name?\nParrot:\n\"Pol-ly!\" *squawk*\nMaya:\nHee hee! Cute!\nPhoenix:\n(Maya's found a new friend.)\nTalk\nThe pasta restaurant\nUncle:\n*Zzzzz*\nPhoenix:\nUmm... a pasta shop?\nUncle:\nAyup! To think, the \"Wet Noodle,\" will live on when I'm gone! My father started it you know. So that makes you two the third generation! Meg...\nMaya:\nY-yes!\nUncle:\nTomorrow, we'll start with the secrets of dough tossin'!\nMaya:\nD-dough tossing?\nUncle:\nYou, too, Keith.\nPhoenix:\nY-yes?\nUncle:\nYou'll be the best pasta wrangler the west has ever seen!\nMaya:\nP-pasta wrangler? The west? I-isn't pasta from Italy?\nUncle:\nMeg!\nMaya:\nY-yes!\nUncle:\nYou know the best pasta's always been made west of the Rockies, don't you?\nPhoenix:\nR-right, of course. Everybody knows that.\nMaya:\nNick...?\nPhoenix:\nHuh?\nMaya:\nHow long do we have to keep up this all-in-the-family charade?\nPhoenix:\n(This old man must know something about the murder...! We're not leaving until we find out what that is.)\nThe pasta restaurant (after presenting Attorney's Badge)\nPhoenix:\nUmm... a pasta shop?\nUncle:\nAyup! To think, the \"Wet Noodle,\" will live on when I'm gone! My father started it you know. So that makes you two the third generation! Meg...\nMaya:\nY-yes!\nUncle:\nTomorrow, we'll start with the secrets of dough tossin'!\nMaya:\nD-dough tossing?\nUncle:\nYou, too, Keith.\nPhoenix:\nY-yes?\nUncle:\nYou'll be the best pasta wrangler the west has ever seen!\nMaya:\nP-pasta wrangler? The west? I-isn't pasta from Italy?\nUncle:\nMeg!\nMaya:\nY-yes!\nUncle:\nYou know the best pasta's always been made west of the Rockies, don't you?\nPhoenix:\nR-right, of course. Everybody knows that.\nMaya:\nNick...?\nPhoenix:\nHuh?\nMaya:\nHow long do we have to keep up this all-in-the-family charade?\nPhoenix:\n(This old man must know something about the murder...! We're not leaving until we find out what that is.)\nThe boat rental shop\nUncle:\n*Zzzzz*\nPhoenix:\nUmm... this is a boat rental shop, right?\nUncle:\nWhat're you talking about!? This here's the palace of pasta, the \"Wet Noodle\"! Though, now that you mention it, we haven't gotten many orders for spaghetti lately. All the kids come up and say \"Yo dude, we wanna ride in one of your boats!\" That's why I keep them boats out there. Youngsters these days... Darned if I understand 'em!\nPhoenix:\nI'm pretty confused myself.\nMaya:\nNick... This isn't going anywhere.\nPhoenix:\nBut this old man is the witness tomorrow, right? We've got to find some way of getting information out of him!\nThe boat rental shop (after presenting Attorney's Badge)\nPhoenix:\nUmm... this is a boat rental shop, right?\nUncle:\nWhat're you talking about!? This here's the palace of pasta, the \"Wet Noodle\"! Though, now that you mention it, we haven't gotten many orders for spaghetti lately. All the kids come up and say \"Yo dude, we wanna ride in one of your boats!\" That's why I keep them boats out there. Youngsters these days... Darned if I understand 'em!\nPhoenix:\nI'm pretty confused myself.\nMaya:\nNick... This isn't going anywhere.\nPhoenix:\nBut this old man is the witness tomorrow, right? We've got to find some way of getting information out of him!\nPolly (appears after examining parrot)\nUncle:\n*Zzzzz* Ack, my memory's gotten worse of late. That's why I just tell everything important to old Polly here.\nMaya:\nEverything... important? Hmm, I wonder... Polly! What's the number to the safe!?\nParrot:\n\"... 1228!\" *squawk*\nMaya:\nAlright!\nUncle:\nH-hey! Polly! Watch it, will ya!\nMaya:\nHeh heh. See, Nick? All it takes is a little clever thinking!\nPhoenix:\n(And a criminal mind...)\nMaya:\nQuick, Nick! Write that number down!\nPhoenix:\nH-hey! Don't get me involved in your little heist schemes.\nPolly (appears after examining parrot; after presenting Attorney's Badge)\nUncle:\nAck, my memory's gotten worse of late. That's why I just tell everything important to old Polly here.\nMaya:\nEverything... important? Hmm, I wonder... Polly! What's the number to the safe!?\nParrot:\n\"... 1228!\" *squawk*\nMaya:\nAlright!\nUncle:\nH-hey! Polly! Watch it, will ya!\nMaya:\nHeh heh. See, Nick? All it takes is a little clever thinking!\nPhoenix:\n(And a criminal mind...)\nMaya:\nQuick, Nick! Write that number down!\nPhoenix:\nH-hey! Don't get me involved in your little heist schemes.\nWhat you saw (appears after presenting Attorney's Badge, then presenting Lake Photo)\nUncle:\nI forget the time, but it was pretty dark outside... probably night, ayup.\nPhoenix:\n(It was after midnight, but okay...)\nUncle:\nThen I heard this \"bang!\" So I looked outside. Then I heard another one. \"Bang!\" A little while later, this boat comes back. Then a young man walked by my window here. He was mutterin' something to himself, ayup.\nMaya:\nWhat did he say?\nUncle:\n... Ayup... ... I forgot. I'll remember tomorrow by court time, promise.\nMaya:\nWe need to know earlier than that...!\nPresent\nAttorney's Badge\nUncle:\n*Zzzzz* ...! That a lawyer's badge?\nPhoenix:\nY-yes, it is! (I don't believe it! This old guy is the first person to recognize my badge!)\nUncle:\n... I get it.\nPhoenix:\nHuh?\nUncle:\nAyup... I got you figured out now! You're not Keith!\nPhoenix:\n...\nMaya:\nN-Nick!  Now's our chance to clear things up!\nPhoenix:\nUmm... sir. No, I'm not Keith.\nMaya:\nAnd I'm not Meg, either!\nUncle:\n...\nPhoenix:\nWe're here investigating a murder that took place on this lake the other night.\nMaya:\nPlease, help us!\nUncle:\n... Hmm... a lawyer, huh?\nMaya:\nPlease, mister...\nUncle:\nAlright, I'll help. But, on one condition.\nMaya:\nWhat's that?\nUncle:\nWhen this case is over and done... You'll run the \"Wet Noodle\"!\nPromise to run the Noodle\nLeads to:\n\"Okay, we promise.\"\nWe can't promise that\nPhoenix:\nI can't make that promise.\nUncle:\n... I-is that any way to treat your old man!? Bah! You want me help? You've come to the wrong man!\nMaya:\nUh oh... now he's grumpy.\nPhoenix:\nNot to mention he still thinks we're his kids. (Maybe we should just lie and say we'll run his shop?)\nLeads to:\n\"Okay, we promise.\"\nPhoenix:\nOkay, we promise.\nMaya:\nN-Nick! Are you sure about this?\nPhoenix:\nHey, anything to get the case solved. Also... Who wouldn't want to eat \"Phoenix Noodles\"?\nMaya:\nI... guess so.\nUncle:\nThat's my boy! Good for you, Keith.\nPhoenix:\nW-wait, didn't I just say...\nUncle:\nYou, too, Meg!\nMaya:\nY-yes!?\nUncle:\nHeh heh heh... you bring a tear to your old man's eye, you know. Now, what was that you wanted to know? Speak up, Polly!\nParrot:\n\"Hello! Hello!\" *squawk*\nMaya:\nEr...\nPhoenix:\n(Now he's talking to the bird again! How do we get him to talk to us!?)\nAttorney's Badge (subsequent times)\nUncle:\nYou won't be needing that badge to run a pasta shop. Toss it.\nPhoenix:\nUh, um, I think I'll hold on to it if you don't mind.\nAnything (before presenting Attorney's Badge)\nUncle:\n*Zzzzz* Now, listen here, Keith. Remember that tricolor pasta we were talking about? Our \"Rainbolioli\"! I figured out the last color we should use! Indigo Blue!\nMaya:\nIndigo... Blue?\nPhoenix:\n(That didn't seem to work the way I thought it might.)\nGourdy Article (after presenting Attorney's Badge)\nPhoenix:\nYou know about Gourdy?\nUncle:\nNope.\nLake Photo (after presenting Attorney's Badge)\nUncle:\nAyup, I seen this.\nPhoenix:\nY-you know something about this, sir!?\nUncle:\nKeith.\nPhoenix:\nY-yes?\nUncle:\nIt's okay. You can call me Dad.\nPhoenix:\n... D-Dad! You know something about this!?\nUncle:\nAyup. The other night... out on the lake...\nMaya:\nYes? Yes!?\nUncle:\nI know all about that! I seen it.\nMaya:\nWhaaaat!? Tell us! Tell what you saw!\nUncle:\nWell, I suppose. Since you're taking over the shop and all...\nParrot (after presenting Attorney's Badge)\nUncle:\nPolly here's my only friend in the world. Isn't that right, Polly?\nParrot:\n\"Hello! Hello!\" *squawk*\nUncle:\nAyup.\nAnything else (after presenting Attorney's Badge)\nUncle:\n... *Zzzzz*\nPhoenix:\n(He fell asleep...)\nUncle:\n*Zzzzz* *mmph*\nAfter clearing \"Polly\" and \"What you saw\" Talk options:\nUncle:\nYou know what? Eh? Little Terry was just here.\nPhoenix:\n\"Terry\"...?\nUncle:\nAyup, that kid next door. You always used to make him cry, remember? He was wearin' this tattered old coat. Got himself some whiskers growing out of his face.\nPhoenix:\n(He must be talking about Detective Gumshoe...)\nUncle:\nHe comes up and tells me to come down to court tomorrow.\nMaya:\nReally...?\nPhoenix:\n(Somehow I don't think we're going to get much useful information out of this guy.) Maya... maybe we should be leaving.\nMaya:\nI think you're right. Oh, wait--I had one more question.\nPhoenix:\nHuh?\nMaya:\nPolly! Polly! Have we forgotten something?\nParrot:\n*squawk* \"Don't forget DL-6!\" *squawk*\nMaya:\nH-huh!? What did she just say, Nick?\nPhoenix:\nOne more time, Polly!\nParrot:\n\"Don't forget DL-6!\" *squawk*\nPhoenix:\n(What!? The DL-6 Incident?) Hey, mister! I-I mean, Dad!\nUncle:\n*Zzzzz*\nPhoenix:\n(This is getting weird... Who IS this old guy!?)\nBoat Rental Shop\nMaya:\nWhy would that bird Polly know about DL-6...?\nPhoenix:\nWe have to figure out who that old man is.\nMaya:\nOh...\nPhoenix:\nWhat?\nMaya:\nHe locked the door, from the other side.\nPhoenix:\n(... Who could that old man be...? I think I need to do a little more research on this DL-6 Incident... Maybe I should ask Detective Gumshoe.)\nAfter clearing \"Polly\" and \"What you saw\" Talk options in Caretaker's Shack:\nDecember 26Police DepartmentCriminal Affairs\nGumshoe:\nHey, pal! Long time no see! ... You don't look so happy. What's wrong this time?\nPhoenix:\nActually, we wanted to ask you something...\nGumshoe:\nYeah?\nExamine\nDetective\nPhoenix:\nThat must be one of the detectives. He's mumbling something to himself.\nPolice:\n\"I... I'm not gonna make it... Just... just arrest that guy for me... please... uggh!\"\nPhoenix:\n... He must be doing image training for dying in action.\nTalk\nThe boat caretaker\nPhoenix:\nYou know the boat rental shop down at Gourd Lake?\nGumshoe:\nOh, yeah...\nPhoenix:\nThe old man who runs it is appearing as a witness in court tomorrow, right?\nGumshoe:\nHuh...!? How'd you-- Hmm. That was supposed to be top secret.\nMaya:\nDo you know who that old man is, Detective?\nGumshoe:\n... Actually... I don't. He's a bit of an odd bird... I haven't been able to get a straight answer out of him. I decided first that he wasn't persuasive enough to stand and testify as a witness. That's why we called Ms. Lotta Hart yesterday. As for who he is... We have absolutely no idea.\nMaya:\nHmm... sounds suspicious!\nGumshoe:\nHmm...\nThe DL-6 Incident\nPhoenix:\nDetective Gumshoe, please, help us...\nGumshoe:\nH-huh?\nPhoenix:\nWe need to know about the DL-6 Incident!\nGumshoe:\n...!\nPhoenix:\nThat was when Edgeworth's father died. I can't help but think that it has something to do with this current case.\nGumshoe:\n... To tell the truth, I don't know much about DL-6 either. Mr. Edgeworth forbade us from reading the file. So... I'm afraid I can't show them to you, either, pal.\nMaya:\nWhat!?\nGumshoe:\nHowever... If you can convince me somehow that the DL-6 Incident is related to this case... Well, I guess I'd consider opening the file up.\nPresent\nMetal Detector\nPhoenix:\nThanks, Detective Gumshoe. This was really helpful.\nGumshoe:\nR-really?\nMaya:\nYou seem surprised!\nGumshoe:\nHuh? N-no, not at all. Glad it worked out for you.\nParrot\nGumshoe:\nWhat's that? A parrot?\nPhoenix:\nThe old man at the boat rental shop's parrot. The parrot knew about that \"incident\"...\nGumshoe:\nThat incident?\nPhoenix:\nDL-6.\nGumshoe:\nWh-what!?\nMaya:\nPolly! Polly! Have we forgotten something?\nParrot:\n*squawk* \"Don't forget DL-6!\" *squawk*\nMaya:\nH-huh!?\nPhoenix:\nI'm pretty sure that old man must have taught her that word...\nGumshoe:\nYeah, but how would that old man know about the DL-6 Incident?\nPhoenix:\nWait! What if... What if that old man was connected to DL-6?\nMaya:\nN-Nick! You think he might be!?\nGumshoe:\n...\nAfter clearing all Talk options and presenting Parrot:\nGumshoe:\n... I get ya. Sounds like you need information on the DL-6 Incident. Through there is the Station's Records Room. I'll give you special permission to go in and find what you need.\nMaya:\nAll right! Way to go, Detective Gumshoe! Okay, Nick! To the Records Room!\nPhoenix:\n(I guess it's time we faced Edgeworth's past...)\nDecember 26Police DepartmentRecords Room\nMaya:\nWow!!! It's amazing.........ly dusty.\nPhoenix:\nTen years of files and ten years of dust, I guess.\nMaya:\nLet's find that DL-6 stuff quick!\nPhoenix:\n(Fifteen years ago... both me and Edgeworth were nine years old. We were almost through with fourth grade when he suddenly transferred. Because of DL-6...?)\nMaya:\nNick! I found out where the file is!\nPhoenix:\nO-oh, thanks!\nMaya:\nJust let me know what you want to know about the DL-6 Incident! I'll go get the right file!\nExamine\nGlass case\nPhoenix:\nIt looks like there are files inside that glass case. The case is so dusty I can't see what's inside.\nMaya:\nNick... it's locked.\nPhoenix:\nThey must keep important case files in there.\nBack wall\nPhoenix:\nThere are shelves stuffed with case files in the back of the room, too. Forgotten cases, rotting away for eternity...\nMaya:\nNick, let's get what we need and get out of here. All this dust is getting to me!\nCabinet\nPhoenix:\nThis cabinet is where they keep evidence for current cases. Some of the things are obviously murder weapons. Others are... who knows what. Most of it just looks like random junk.\nMaya:\nNick... what do you think this clothespin is for?\nPhoenix:\nDon't touch that! It's evidence...\nShelves\nPhoenix:\nHere are files of collected case reports. There's quite a large volume of reports here.\nMaya:\nWow... these are all case reports!?\nPhoenix:\nYeah. It's like a graveyard of police cases.\nMaya:\nI guess my sister's case report is in here too... quietly gathering dust.\nTalk\nThe case summary\nPhoenix:\nWell, first I have to get a handle on the main facts... like a summary.\nMaya:\nRight. Summary... summary... Found it! Here you go.\nPhoenix:\nDecember 28... 2001.\nMaya:\nThat's exactly 15 years ago from the day after tomorrow!\nPhoenix:\n(So in two days, the case is closed...) The incident took place in the elevator of the district courthouse. (Changed from [The incident took place in the elevator of the district court.] in the original release)\nMaya:\nWhat!? Is this the same district courthouse where we're holding the trial now!? (Changed from [Is this the same district court where we're holding the trial now!?] in the original release)\nPhoenix:\nLooks like it. There was a large earthquake at 2:00 PM on that day. Part of the court building collapsed, and all of the lights went out.\nMaya:\nWow... that was some earthquake!\nPhoenix:\nAt the time, three people were trapped in the elevator. It took five hours for them to be rescued... Five hours!\nMaya:\nThat would be scary like that, in the dark!\nPhoenix:\nThere was a lack of oxygen in the elevator, and the survivors were unconscious.\nMaya:\nThe survivors...?\nPhoenix:\nOne of the three in the elevator had been shot... in the heart.\nMaya:\nThat was Mr. Edgeworth's father... wasn't it.\nPhoenix:\n(He said that his father was shot before his very eyes... So Miles Edgeworth was one of the other passengers in that elevator.)\nVictim data\nPhoenix:\nDo you have data on the victim... Edgeworth's father?\nMaya:\nYeah, hold on... Victim... victim... Here! Found it!\nPhoenix:\nGregory Edgeworth, 35, defense attorney. If he were still alive, he'd be 50. He had lost that day's case in court, and got in the elevator with his son, Miles.\nMaya:\n\"Miles\"...!\nPhoenix:\nMiles Edgeworth, of course.\nMaya:\nSo he was on the elevator with his father!\nPhoenix:\nFrom the angle of the bullet and the other evidence, it could not have been a suicide... The murder weapon, a pistol, was found in the elevator. The pistol had been fired two times. (Where have I heard that before...? Huh...! It sounds just like this current case! What's going on here?)\nSuspect data\nPhoenix:\nGot any data on the suspect in there?\nMaya:\nHmm... that would be the guy that my mom got arrested. Hold on... this is it.\nPhoenix:\nThe man arrested as a suspect in DL-6 was... Yanni Yogi? He was a clerk in the court, apparently.\nMaya:\nSo he must have been the third person in the elevator. Well, then he had to have done it!\nPhoenix:\nBut... he was found innocent. Thanks to his defense lawyer, Robert Hammond.\nMaya:\nHammond... the victim in our case!\nPhoenix:\nRight. The suspect, Mr. Yogi was oxygen deprived... so much so he had brain damage. He lost all memory of being in the elevator. After he was declared innocent, he disappeared.\nMaya:\nHmm... where could Yogi have gone to, I wonder?\nPhoenix:\n(He may be closer than we think...)\nPresent\nAnything\nMaya:\nLet's just hurry up and read these files! This place is so dusty, I want to finish up and get out of here...\nAfter clearing all Talk options:\nPhoenix:\nI guess I know generally what happened in DL-6 now. I still don't know what sort of impact the whole thing had on Edgeworth...\nMaya:\nNick. Are we going to take the whole file? There's too much! We'll never get it out.\nPhoenix:\nY-you're right. How about we just take what we think we'll need...\nDL-6 Case File added to the Court Record.\nPhoenix:\nRight. That's probably all we'll be able to find here. Now, all that's left is the trial tomorrow... I wonder how \"Dad\" will do testifying in court...\nTo be continued.\nNothing to examine during investigation\nPhoenix:\nNo clues here.\nTurnabout Goodbyes\nTranscript\nPart 1\nPart 2\nPart 3\nPart 4\nPart 5\nPart 6\nDecember 27, 10:00 AMDistrict CourtCourtroom No. 3\nJudge:\nCourt is now in session for the trial of Mr. Miles Edgeworth.\nPhoenix:\nThe defense is ready, Your Honor.\nKarma:\n... ...\nJudge:\nVery well, apparently the prosecution is also ready.\nPhoenix:\n(Who is the judge here, anyway!?)\nJudge:\nMr. von Karma, your opening statement.\nKarma:\n... ...\nJudge:\nEr... very well, no opening statement so...\nKarma:\nKarma:\nNot so fast, Judge! I was taking a meaningful pause before speaking!\nJudge:\nR-right, of course.\nKarma:\nA prediction! Today's trial will end three minutes from now!\nJudge:\nOrder... order! Mr. von Karma! What is the meaning of your statement just now!?\nKarma:\nKarma:\nBah! Must you question everything! It will be over in three minutes! We have no time to waste! I'll call my witness now!\nJudge:\nR-right...\nKarma:\nI call my witness... my decisive witness to the stand!\nPhoenix:\n(It's that mysterious boat shop owner.)\nKarma:\nWitness... state your profession.\nUncle:\nMmph... zzzz... ... I, er, am the proprietor of the restaurant the \"Wet Noodle\" at Gourd Lake.\nKarma:\n...\nUncle:\nAnd I, er, also rent boats.\nKarma:\nThe night of the incident, you were in the boat rental shop, correct?\nUncle:\nEr... ayup, yup I was.\nKarma:\nPlease testify.\nPhoenix:\n(Wait a second... We still haven't heard who this old guy is!)\nRaise an objection\nPhoenix:\nLeads to:\n\"Wait a minute!\"\nLet it slide\nPhoenix:\n(On second thought, I guess it doesn't really matter.)\nMaya:\nDoesn't matter!? What are you thinking, Nick!? What if that old man had something to do with the DL-6 Incident? If we don't find out who he is, we won't be able to build a case here!\nPhoenix:\n(Hmm, she has a point.)\nPhoenix:\nLeads to:\n\"Wait a minute!\"\nPhoenix:\nWait a minute! The witness hasn't stated his name yet!\nKarma:\nKarma:\nBecause I did not ask him, Mr. Wright! Bah! I have predicted this trial will end in three minutes! Stop asking trivial questions and cooperate!\nPhoenix:\n(Yeah, right!)\nJudge:\nThe witness will state his name.\nUncle:\nZzzz... ... Mmph! Well, er... I'm not really sure, ayup.\nJudge:\nWhat do you mean?\nUncle:\nMy, er, memory...\nKarma:\nYour Honor... The witness does not remember anything beyond the last several years... Ergo, he cannot recall his own name.\nJudge:\nHmm... he can't recall, you say?\nKarma:\nYes, but the incident in question took place three days ago. He can testify.\nJudge:\nVery well. Let's hear his testimony then, shall we. Witness?\nWitness Testimony\n-- The Night of the Murder --\nUncle:\nIt was the night of the 24th, just after midnight, ayup.\nI was in the restaurant... where I er... rent boats, as usual.\nThen I heard a \"bang!\" Ayup.\nWhen I looked out the window, I saw a boat just a' floating on the lake.\nThen I heard another \"bang.\"\nJust about then the boat comes back to the shore, and a man walks by my window.\nJudge:\nHmm...Very well. I'd like to begin the cross-examination...\nKarma:\nKarma:\nThere is nothing to question in my witness's testimony! Ergo, no need for cross-examination! Besides, there are only 10 seconds left before our three minutes are up! Judge! Your verdict, now!\nJudge:\nEr... yes... M-Mr. Wright...?\nCross-examine\nPhoenix:\nWhat are you saying!? Of course I'll cross-examine the witness!\nJudge:\nHmm... Very well, you may begin.\nLeads to:\n\"Raaaaaaaaaaaaaargh!\"\nDon't cross-examine\nPhoenix:\n(He's right. That testimony sounded pretty solid. Maybe I should hold back.)\nMaya:\nB-but, Nick! You have to cross-examine him! This is your only chance to turn this trial around! Your last chance!\nPhoenix:\n(O-oh... right.)\nLeads to:\n\"Raaaaaaaaaaaaaargh!\"\nKarma:\nRaaaaaaaaaaaaaargh!\nJudge:\nE-excuse me? Mr. von Karma?\nKarma:\nThree minutes just passed.\nJudge:\nI see. Well then, let's just take our time. You may cross-examine the witness.\nCross Examination\n-- The Night of the Murder --\nUncle:\nIt was the night of the 24th, just after midnight, ayup.\nPress\nPhoenix:\nPhoenix:\n\"Just after midnight,\" you say?\nUncle:\nAyup, just around then.\nPhoenix:\nAre you sure?\nUncle:\nPretty sure, ayup.\nPhoenix:\nWhen I talked to you yesterday, you were rather vague about the time... I'm surprised you seem so sure about it today.\nUncle:\n...\nKarma:\nKarma:\nI asked him, and he remembered. Isn't that right!?\nUncle:\nZzzz... D-don't glare at me like that...! I, er... I remembered it clearly, I did. Ayup.\nKarma:\nYou see? Continue!\nUncle:\nI was in the restaurant... where I er... rent boats, as usual.\nPress\nPhoenix:\nPhoenix:\nIs there anyone who can verify that?\nUncle:\n... Well, I guess Polly could.\nPhoenix:\nTh-that's not good enough for a court of law!\nJudge:\nMr. Wright... exactly what's not good enough?\nPhoenix:\nAh, uh, Your Honor, this \"Polly\" is a parrot.\nJudge:\nA... parrot?\nUncle:\nDon't be so hard on the girl, Keithy-boy!\nJudge:\nKeith...?\nKarma:\nKarma:\nThe prosecution concedes that we cannot prove the witness was in the shop. Witness... please continue.\nUncle:\nThen I heard a \"bang!\" Ayup.\nPress\nPhoenix:\nPhoenix:\nAnd where did the \"bang\" seem to come from?\nUncle:\nFrom the lake, I figure.\nKarma:\nAre you certain?\nUncle:\nA-ayup.\nKarma:\nGood. Continue!\nUncle:\nWhen I looked out the window, I saw a boat just a' floating on the lake.\nPress\nPhoenix:\nPhoenix:\nWas there someone in the boat?\nUncle:\nIt was pretty far out there... I couldn't see clearly... But I figure there was two men out there, ayup.\nPhoenix:\nBut you couldn't see them clearly!\nUncle:\nAyup... at the time, that is.\nPhoenix:\n(At the time...?)\nUncle:\nThen I heard another \"bang.\"\nPress\nPhoenix:\nPhoenix:\nSo you heard two gunshots total?\nUncle:\nAyup.\nPhoenix:\n(That's what Lotta said in her testimony yesterday.)\nUncle:\nJust about then the boat comes back to the shore, and a man walks by my window.\nPress\nPhoenix:\nPhoenix:\n\"By your window\"?\nUncle:\nAyup, by my window. Right outside the window of my little shack.\nPhoenix:\nAnd, could you see the man's face?\nUncle:\nWell, the fog was pretty darn thick, but he was right there in front of me. I saw him.\nJudge:\nThis is rather important detail! Please add it to your testimony.\nUncle:\n...\nKarma:\nTsk, tsk, tsk...\nPhoenix:\n(I have a bad feeling about this...)\nAdds statement \"That man was the defendant... he was saying \"I can't believe he's dead.\"\nUncle:\nThat man was the defendant... he was saying \"I can't believe he's dead.\"\nPress\nPhoenix:\nLeads to:\n\"A-are you sure!?\"\nPhoenix:\n(If I know von Karma, he spent time preparing his witness. I'm not going to find contradictions very easily in this testimony. Whew... it's tough being a lawyer.)\nPhoenix:\nA-are you sure!?\nUncle:\n...\nPhoenix:\n(Uh oh!) D-Dad!\nUncle:\nDead certain, Keith! He said \"I can't believe he's dead\" as he was walking by, too.\nKarma:\nWitness! Are you sure that the person you saw was Miles Edgeworth!?\nUncle:\nIt was him! That Edgeworth boy!\nJudge:\n... This... sounds like decisive evidence indeed. I see no room for doubt.\nPhoenix:\n(von Karma... He lured me into cross-examining so he could set me up for a fall!)\nKarma:\nTsk, tsk, tsk...\nMaya:\nN-Nick...! I don't like the way things are going here! Everyone in the courtroom is glaring at us!\nPhoenix:\n(I'd better act quick, or this trial is going to be over!)\nRaise an objection\nPhoenix:\nPhoenix:\nYour Honor! We proved in yesterday's court that it could not have been Edgeworth who fired the gun!\nKarma:\nKarma:\nMr. Wright. Are you referring to the fingerprints from Edgeworth's right hand found on the gun, and the photograph showing a man firing with his left hand...?\nPhoenix:\nExactly!\nKarma:\nThat is easily explainable! He could have wiped his prints after he fired! You are ignoring the truth of the matter here! Everything in this witness's testimony is true!\nLeads to:\n\"Hmm...\"\nWait and see what happens\nPhoenix:\n(But... how can I raise an objection without any proof?)\nKarma:\nJudge! There is no room for doubt in the witness's testimony! I demand that you declare your verdict!\nLeads to:\n\"Hmm...\"\nJudge:\nHmm...\nPhoenix:\n(The judge is lost in thought... what should I do?)\nRaise an objection\nPhoenix:\nPhoenix:\nYour Honor! This witness claims that Edgeworth said \"I can' t believe he's dead\"... But his word is all we have! If he were telling a lie...\nKarma:\nKarma:\nMr. Wright. In a court of law, the evidence tells all. Apparently, you have yet to realize even this basic fact. If you say his testimony is a lie, show us proof!\nPhoenix:\nUrk...\nMaya:\nNick! Do we have evidence...?\nLeads to:\n\"It's no good! There's nothing I can do.\"\nWait and see what happens\nPhoenix:\n(I can't see any room to raise an objection... I'd better hold back and see how things develop.)\nMaya:\nNick! We have to do something! If we stay quiet now, Mr. Edgeworth'll be found guilty for sure!\nLeads to:\n\"It's no good! There's nothing I can do.\"\nPhoenix:\nIt's no good! There's nothing I can do.\nMaya:\nA... are you sure?\nPhoenix:\nTo be honest... I don't know what to do anymore.\nMaya:\nPlease... Can you hear me, Sis? Please... We need your help... Nick needs you...\nKarma:\nTsk tsk tsk... Three minutes was perhaps too high an expectation. However, fifteen minutes isn't bad! This must be a new record.\nJudge:\nEnough! The witness may leave the stand.\nUncle:\nZzzz...\nJudge:\nThis court sees no reason to further prolong the trial. Nor is there any need for more time to decide the case against the defendant. This case is extremely clear. I see no room for misinterpretation of the facts.\nPhoenix:\n(W-what!? No!)\nKarma:\nHmph.\nJudge:\nThis court find the defendant, Mr. Miles Edgeworth...\nGuilty\nJudge:\nThe accused will surrender to the court immediately, to be held pending trial at a higher court within a month from today's date. That is all. The court is adjourned!\nW-w-waaaaaaait!\nJudge:\nWh-who was that just now?\nMe!!!\nPhoenix:\nHuh? Waaaaah! L-Larry!\nJudge:\nWh-what are you doing here!?\nButz:\nListen! Y-you gotta listen to me! I... I was...  I was there, in the park, the night of the murder! I... I wasn't sure about it until just yesterday. B-but today I remembered it!\nJudge:\nRemembered what?\nButz:\nThe gunshot! I heard it too!\nJudge:\nO-order!\nKarma:\nKarma:\nWhat is the meaning of this!? The verdict has been decided! I call for adjournment!\nJudge:\nOne moment, Mr. von Karma. So, you say you heard a gunshot?\nButz:\nYeah, I did! A gunshot! That night! I was sitting here in the audience, listening to the testimony... Then I realized, something he said was different from what I remember! A-anyhow, I can't just sit here and let you call Edgey a murderer! It's... It's just not right! I'll testify! Lemme testify!\nJudge:\nOrder! Order! Well, this is the first time something has happened like this in my court. I'm not quite sure how to proceed...\nKarma:\nJudge! You've already given your decision! The trial is over!\nMaya:\nNick! This is it! Larry's given us one final chance at this!\nPhoenix:\n(She's right! If only it wasn't Larry... He could make things even worse...)\nMaya:\nMr. Edgeworth was just declared guilty, Nick! It doesn't get any worse!\nPhoenix:\nYou're right! Okay! Your Honor! If there is another witness, it is our duty to hear him speak! Right here! Right now!\nKarma:\nA waste of time! The verdict cannot be overturned!\nJudge:\nHmm... ... ... Allow me to speak my opinion. In all court proceedings, it is our duty to prevent an inaccurate verdict. In order to make sure no mistake has been made, every witness should be heard!\nKarma:\nWh-what is this!?\nJudge:\nI withdraw my previous verdict of \"guilty\"! Mr. von Karma! I order you to call this new witness to testify. Now!\nKarma:\nWhaaaat!\nJudge:\nThe court will adjourn for a five minute recess. After that, we will hear this new witness. Court is adjourned!\nDecember 27, 10:28 AMDistrict CourtDefendant Lobby No. 2\nPhoenix:\nWhew... That was too close. Sorry to keep you on the edge of your seat like that, Edgeworth.\nEdgeworth:\nHmph. I've seen worse.\nPhoenix:\n(Yeah right, Edgeworth. You're sweating bullets!) I just wonder what Larry plans to say in there.\nMaya:\nLarry was at the lake that night?\nPhoenix:\nYes... He said he went looking for the Steel Samurai balloon that flew into the lake.\nMaya:\nOh right. And he found the balloon and the air tank that night?\nPhoenix:\nYeah.\nEdgeworth:\n...\nPhoenix:\nHey, Edgeworth.\nEdgeworth:\n... Huh? You say something, Wright?\nPhoenix:\nYeah, a lot of things. You seem out of it. What's wrong?\nEdgeworth:\nIt... it's nothing.\nPhoenix:\nHmm?\nMaya:\nUmm... Mr. Edgeworth? There's something I've been meaning to ask you.\nEdgeworth:\nWhat's that?\nMaya:\nWhy are your fingerprints on the murder weapon?\nEdgeworth:\nOh. When he fell into the lake, I went into a daze. I couldn't understand what had happened. I couldn't think straight. Then I saw the pistol lying on the floor of the boat in front of me. I picked it up without thinking. I didn't have a reason, really.\nMaya:\nI see...\nEdgeworth:\nWright...\nPhoenix:\nYeah?\nEdgeworth:\nThis might be our chance.\nPhoenix:\nOur chance?\nEdgeworth:\nvon Karma has only ever run perfect trials.\nPhoenix:\nPerfect trials...?\nEdgeworth:\nPerfectly prepared witnesses, perfectly complete evidence. That's the secret to his success. This is the first time he's ever had to deal with something unexpected! He has to let someone he hasn't even talked to testify before the court! (Changed from [He has let someone he hasn't even talked to testify before the court!] in the original release) And that someone... is Larry!\nPhoenix:\nWhat are you getting at?\nEdgeworth:\nIt's likely his testimony will be full of holes, Wright.\nMaya:\nThat's right, Nick! No ten minute trial this time! We'll milk this one for all it's worth!\nPhoenix:\nHey, it was fifteen minutes! Fifteen! (Everything's on Larry now...) (Changed from [Hey, it was fifteen minutes! Fifteen! (Everything depends on Larry now...)] in the original release)\nDecember 27, 10:35 AMDistrict CourtCourtroom No. 3\nJudge:\nCourt is now back in session. Witness... Please testify to the court about everything that you saw... on the night of December 24th.\nButz:\nRight... leave it to me!\nPhoenix:\n(Please, Larry, don't mess this one up!!! I hate to admit it, but you're our last chance!)\nKarma:\n...\nPhoenix:\n(von Karma didn't even have time to prep his witness. I just hope Edgeworth is right about this being our big break...)\nWitness Testimony\n-- The Night of the Murder --\nButz:\nThat night, I was out in a boat on the lake.\nI was looking for something and I, er, found it.\nSo I quietly slipped the boat back in at the rental shop dock.\nThen, just as I was thinking about going home, I heard this \"bang\"!\nI looked out over the lake, but I didn't notice the boat.\nSo after I heard that single gunshot I went home.\nJudge:\nHmm... That was an unusually vague testimony, even for this court. In any matter, Mr. Wright, you may begin your cross-examination.\nPhoenix:\nYes, Your Honor...\nMaya:\nWhat's wrong, Nick?\nPhoenix:\nIt's Larry! I have no idea what he's going to say if I press him. I'm a little scared.\nMaya:\nHmm... Well, we've come this far. There's no way to go but forward, Nick!\nCross Examination\n-- The Night of the Murder --\nButz:\nThat night, I was out in a boat on the lake.\nPress\nPhoenix:\nPhoenix:\n...\nJudge:\nSomething wrong, Mr. Wright?\nPhoenix:\nThere were so many things wrong I don't know where to begin...\nJudge:\nAh...\nPhoenix:\nUm, well, okay. First of all, what time was it?\nButz:\nOh, it was after 11:00 when I went out in the boat. By that time everyone had gone home for the night. So I waited until the coast was clear, so to speak.\nPhoenix:\nAnd why were you out on a boat at such a late hour...?\nButz:\nI was looking for something and I, er, found it.\nPress\nPhoenix:\nPhoenix:\n\"Looking for something\"...?\nButz:\nEr, yeah.\nJudge:\nMr. Butz, what was it you were looking for?\nKarma:\nKarma:\nWhat the witness was searching for is irrelevant! Most likely he was hunting for this \"Gourdy\"!\nPhoenix:\n(You know, it wouldn't surprise me one bit if that was the truth.)\nKarma:\nThis is all irrelevant! Let's get it over with.\nButz:\nSo I quietly slipped the boat back in at the rental shop dock.\nPress\nPhoenix:\nPhoenix:\nAround what time was that?\nButz:\nUh... Well, let's see... I figured I was out searching for about an hour... I guess it was around 12:00. Yeah.\nJudge:\nYou're not sure?\nButz:\nHey! Don't give me that face! I'm not some sort of human sundial, okay!?\nPhoenix:\n(People use watches these days, Larry...)\nButz:\nThen, just as I was thinking about going home, I heard this \"bang\"!\nPress\nPhoenix:\nPhoenix:\nWhere did the sound come from?\nButz:\nYeah, well, I wasn't too sure about that. I looked around, y'know.\nJudge:\nDid you look at the lake?\nButz:\nYeah, I looked.\nButz:\nI looked out over the lake, but I didn't notice the boat.\nPress\nPhoenix:\nPhoenix:\nWasn't there a boat on the lake!?\nJudge:\nOrder! Order! Well? Mr. Butz!\nButz:\nWhoa, whoa. Everybody just calm down, okay? I mean, it was real foggy that night. I'm not sure whether there was a boat out there or not.\nPhoenix:\n(Oh, okay, no problem. That's just the MOST IMPORTANT PART of the case!!!)\nKarma:\nHmph!\nButz:\nSo after I heard that single gunshot I went home.\nPress\nPhoenix:\nPhoenix:\nSo, you only heard one \"bang\" correct?\nButz:\nYeah.\nPhoenix:\n(Huh.)\nPresent Lotta's Deposition\nPhoenix:\nLeads to:\n\"W-wait a sec, Larry!\"\nMaya:\nWell, Nick?\nPhoenix:\nHmm... It was a pretty wishy-washy testimony, wasn't it? I guess I should just start working on the contradictions.\nMaya:\nSorry...\nI wish I could be more helpful. I wish I could call my sister...\nPhoenix:\nW-wait a sec, Larry!\nButz:\nWh-what!?\nPhoenix:\nYou only heard one \"bang\"!? You're sure!?\nButz:\nThat's what I said!\nPhoenix:\nBut Mr. Lotta Hart testified yesterday that she heard two \"bang\"s! And the old man just now said the same thing! They both heard two gunshots that night!\nButz:\nHuh?\nPhoenix:\nWere you even listening!? Were you paying attention at all to what they said?\nButz:\nYo, Nick, please!\nPhoenix:\nHuh?\nButz:\nYou know, something's been bothering me. I'm a witness, see? I'm like a customer here! So you got to treat me nice and stuff, okay!?\nPhoenix:\n...\nJudge:\nMr. Butz.\nButz:\nWhat!?\nJudge:\nYou only heard one gunshot? Are you sure?\nButz:\n... Umm... Well, to tell ya the truth... I'm not sure.\nJudge:\nEh...?\nPhoenix:\nNot sure!? H-how could you not be sure?\nButz:\nYeah, well... I, uh, I might have missed the other gunshot. I was, uh, listening to something else...\nPhoenix:\nSomething... else?\nButz:\nMy radio, dude! With my headphones. (Changed from [My radio, dude! On my headphones.] in the original release)\nPhoenix:\nWhaaaaaaat!?\nJudge:\nOrder! Order! And stop that booing! M-Mr. Butz! You were listening to the radio with your headphones? (Changed from [You were listening to a radio on earphones?] in the original release)\nButz:\nY-yeah! So what! That a crime!? I listen to my radio! Everybody listens to the radio! What's the big deal!?\nJudge:\nHmm... Mr. von Karma... your opinion?\nKarma:\nWaste of time. I do not accept this witness, nor his shoddy testimony.\nJudge:\nHmm... Well, Mr. Wright? Should he continue the testimony?\nThat's enough\nPhoenix:\n(No, I think I've heard enough. This is all too embarrassing... In fact, I think we've all heard enough.)\nMaya:\nWhat are you saying, Nick!? If you stop now, Mr. Edgeworth will be found guilty! We have to turn this trial around now!\nPhoenix:\nUh...\nLeads to:\n\"Your Honor.\"\nContinue\nLeads to:\n\"Your Honor.\"\nPhoenix:\nYour Honor. Please... please allow the witness to continue his testimony.\nKarma:\nBah! Nothing is more pitiful than a lawyer who doesn't know when he's lost!\nJudge:\nVery well, Mr. Butz. Please give your testimony, and be sure to include details like your RADIO.\nButz:\nRight! Leave it to me!\nPhoenix:\n(I wouldn't if there were any other way out of this, believe me.)\nWitness Testimony\n-- What Larry Heard --\nButz:\nIt's lonely, being alone on Christmas Eve!\nThat's why I was listening to an all-requests show on the radio, see?\nI was listening to it real booming loud, like.\nBut I'm sure I heard that gunshot!\nI remember exactly what the DJ was saying when I heard it, too.\nJudge:\nYou were listening to your radio... at a high volume!?\nButz:\nYeah, what's the big problem? Can't a man listen to his radio in peace? Isn't this a free country!?\nPhoenix:\n(I truly believe Larry has no idea what the problem here is.)\nKarma:\nJudge. Can you believe a word this witness says? What he heard was probably nothing more than a drum beat from the radio!\nJudge:\nTrue enough, it is difficult to believe this testimony.\nPhoenix:\nPhoenix:\nWait, Your Honor! The witness said he remembers exactly what the DJ said when he heard the gunshot!\nJudge:\nExcuse me? \"Dee-jay\"...?\nPhoenix:\nAn announcer... the guy who says things on the radio. Anyway! What this means is, when he heard the sound, no music was playing! The DJ only talks between songs! So he could have heard the gunshot from the lake! I'd like to cross-examine the witness, Your Honor!\nJudge:\nV-very well, Mr. Wright.\nPhoenix:\n(I can't believe I'm continuing this charade...)\nCross Examination\n-- What Larry Heard --\nButz:\nIt's lonely, being alone on Christmas Eve!\nPress\nPhoenix:\nPhoenix:\nSo, you turned on the radio?\nButz:\nRight! I just wanted to hear someone's voice, y'know? You don't know what it's like out there, alone, on Christmas Eve! Alone!\nPhoenix:\n(I shouldn't have said anything...)\nButz:\nThat's why I was listening to an all-requests show on the radio, see?\nPress\nPhoenix:\nPhoenix:\nDo you by any chance remember the name of the program you were listening to?\nKarma:\nKarma:\nThis has nothing to do with the case, Your Honor!\nJudge:\nObjection sustained. The witness was listening to the radio. That is all we need to know. Tell us, Mr. Butz, how loud was your radio set to that night?\nButz:\nI was listening to it real booming loud, like.\nPress\nPhoenix:\nPhoenix:\nReal \"booming\" loud?\nButz:\nYeah, y'know.\nJudge:\nAnd you had headphones on?\nButz:\nYup.\nJudge:\nI wouldn't think you could hear anything going on outside at all...\nButz:\nBut I'm sure I heard that gunshot!\nPress\nPhoenix:\nPhoenix:\nCan you prove that...? No... no, of course you can't.\nButz:\nNah, I can't prove it. But I remember that moment real clear. I mean, while I was talking about it, it came back real clear to me, y'know?\nButz:\nI remember exactly what the DJ was saying when I heard it, too.\nPress\nPhoenix:\nPhoenix:\nWhat did she say? (Changed from [What did he say?] in the original release)\nKarma:\nKarma:\nMr. Wright! Please cease these pointless questions! What possible good could knowing what a radio DJ said do us!?\nJudge:\nIndeed, Mr. von Karma has a point. I'll allow the question only if you see some reason why we should care...?\nWe don't care\nPhoenix:\n(Hmm... right. I didn't really have a deep reason for asking that question, now that I think about it.) Understood, Your Honor. I withdraw my question.\nJudge:\nContinue your examination of the witness, then.\nPhoenix:\n(This is getting nowhere...)\nLeads back to cross-examination\nWe should care\nPhoenix:\nWe should care, Your Honor! Of course we should!\nKarma:\nWhy?\nPhoenix:\nUh. W-well, how do you know if we don't ask, hmm?\nJudge:\nFine, very well. Mr. Butz, please testify to the court. What was the radio announcer saying when you heard the gunshot?\nAdds statement \"Just when she said \"Hey! It's almost Christmas!\" I heard the gunshot!\"\nButz:\nJust when she said \"Hey! It's almost Christmas!\" I heard the gunshot!\nPress\nPhoenix:\nPhoenix:\nAre you sure?\nButz:\nCourse I am! She had this real sexy voice...\nPhoenix:\n(Hmm... maybe von Karma was right. I'm not sure how that helped us at all.)\nPresent Lake Photo\nPhoenix:\nPhoenix:\nLarry! Are you absolutely sure what you're saying is correct!?\nButz:\nHuh? What's with the face? You look scary, dude. Hey, if you're trying to scare me, you better know I don't scare that easy!\nJudge:\nIs something the matter, Mr. Wright?\nPhoenix:\nYour Honor! Did you hear what the witness just said? The DJ said \"Hey! It's almost Christmas!\" when he heard the gunshot!\nJudge:\nIndeed... And...?\nPhoenix:\n\"Almost Christmas\" means it wasn't Christmas! Do you realize what this means? When he heard the gunshot, it was still Christmas Eve!!!\nJudge:\nThat would seem to be the case, yes...\nPhoenix:\nBut he should have heard that gunshot after midnight! This photograph is irrefutable proof of this fact!\nJudge:\nLet's see what the time was on the photo taken when the gun triggered Ms. Hart's camera. < 12/25 00:15 >...! Fifteen minutes after midnight, on Christmas Day!\nLeads to:\n\"This is a clear contradiction, Your Honor!\"\nPresent Lotta's Deposition\nPhoenix:\nPhoenix:\nLarry! Are you absolutely sure what you're saying is correct!?\nButz:\nHuh? What's with the face? You look scary, dude. Hey, if you're trying to scare me, you better know I don't scare that easy!\nJudge:\nIs something the matter, Mr. Wright?\nPhoenix:\nYour Honor! Did you hear what the witness just said? The DJ said \"Hey! It's almost Christmas!\" when he heard the gunshot!\nJudge:\nIndeed... And...?\nPhoenix:\n\"Almost Christmas\" means it wasn't Christmas! Do you realize what this means? When he heard the gunshot, it was still Christmas Eve!!!\nJudge:\nThat would seem to be the case, yes...\nPhoenix:\nBut that contradicts the two testimonies we have heard, Your Honor! Both Ms. Hart and the old man said it was after midnight when they heard the shots! In other words... When they heard the gunshots, it was already Christmas!!!\nLeads to:\n\"This is a clear contradiction, Your Honor!\"\nPhoenix:\n(This is the most ludicrous testimony I've ever heard. But there is one gleaming ray of hope in there! I've got to press it until we get to the bottom of what happened!)\nPhoenix:\nThis is a clear contradiction, Your Honor!\nJudge:\nOrder! Order! What does this mean? The two prior witnesses heard gunshots after midnight. However, this witness says he heard a gunshot before midnight...\nKarma:\nJudge. The answer is simple. The current witness is plainly mistaken. Just look at him! Suspicious!\nButz:\nWh-whaaat!?\nJudge:\nHmm... Well, Mr. Wright? What do you think about Mr. Butz's claim that he heard the gunshot before midnight?\nLarry's wrong\nPhoenix:\nWell... I guess, it had to have been Larry's mistake.\nKarma:\nHah!\nJudge:\nVery well.\nButz:\nW-w-waaaaait! I come up here, I give you a riveting testimony... And you laugh it off as some kinda mistake!? What about me!? How can you call yourself a friend, Nick? How!? Get used to disappointment!!!\nPhoenix:\n...\nLeads back to:\n\"Well, Mr. Wright?\"\nLarry's right\nLeads to:\n\"Larry's not mistaken, Your Honor!\"\nPhoenix:\nLarry's not mistaken, Your Honor! He heard that gunshot before midnight!\nKarma:\n... Intriguing. I'm assuming you have evidence for this wild claim? Show me evidence there was a gunshot before midnight!\nPresent Second Lake Photo\nPhoenix:\nPhoenix:\nLook at this photograph! This was taken by our witness yesterday, Ms. Lotta Hart, with her automatic camera. The timestamp on the photo reads \"December 24, 11:50 PM.\"\nJudge:\nOh yeah? Hmm? But, there's nothing on the lake in this picture.\nPhoenix:\nYour Honor. The real issue here is not why nothing is shown in the photograph. It is why this photograph exists at all!\nJudge:\nWhat do you mean?\nPhoenix:\nYour Honor... This photograph was taken by an automatic camera. That camera was set to go off in response to loud noises!\nJudge:\nAhah!\nPhoenix:\nCorrect! There was a loud noise on the lake at 11:50 PM. That is why this photograph was taken! In other words... When Larry heard that gunshot, it was most definitely Christmas Eve!\nJudge:\nIndeed, it would seem that is the case! Then... where does that leave us? Ms. Hart testified that she heard the gunshots after midnight. Are you claiming she was mistaken?\nPhoenix:\nNot at all, Your Honor. It is a fact that the camera also triggered at 15 minutes after midnight! Your Honor! That night, there were two sets of gunshots, with a 25 minute pause between them!\nJudge:\nWhy would this be...?\nKarma:\nKarma:\nDon't be fooled, Judge! That camera was set to respond to \"loud noises\"!\nJudge:\nYes?\nKarma:\nThere is no proof that the \"loud noise\" at 11:50 was a gunshot! Why, the witness could have sneezed, triggering the camera!\nButz:\nH-hey, my noise was clear that night, man! Clear!\nJudge:\nHmm... Well, Mr. Wright? There's no turning back now. Can you prove that the \"loud noise\" at 11:50 PM was indeed a gunshot? Please show the court evidence if you have any.\nPresent Pistol\nPhoenix:\nLeads to:\n\"This is my evidence.\"\nPresent anything else\nPhoenix:\nJudge:\nMr. Wright... Is that a smirk I see?\nPhoenix:\nEr, Your Honor... sorry, I wasn't really sure about the evidence.\nJudge:\nDon't show us evidence you aren't confident in Mr. Wright! I'll ask you again.\nLeads back to:\n\"Can you prove that the \"loud noise\" at 11:50 PM was indeed a gunshot?\"\nPhoenix:\nThis is my evidence.\nJudge:\nThe... murder weapon?\nPhoenix:\nSomething about this pistol was bothering me, Your Honor. Both of the witnesses who testified yesterday heard two gunshots. However, the murder weapon was fired three times. When, then, was the last shot fired? Only now have I realized the truth. That third shot was the shot Larry heard just before midnight!\nLeads to:\n\"Order! Order!\"\nPresent Pistol\nPhoenix:\nPhoenix:\nThis is my evidence.\nJudge:\nThe... murder weapon?\nPhoenix:\nSomething about this pistol was bothering me, Your Honor. Both of the witnesses who testified yesterday heard two gunshots. However, the murder weapon was fired three times. When, then, was the last shot fired? Only now have I realized the truth. That third shot was the shot Larry heard just before midnight!\nJudge:\nOrder! Order! Hmm... I guess that would make sense out of yesterday's testimonies.\nKarma:\nKarma:\nBah! You waste our time again with your empty statements! Yes, the pistol was fired three times. But do you have any proof that it was fired before midnight!? Do you have proof that the witness didn't just \"think\" he heard something?\nJudge:\nIndeed... Well, Mr. Wright? There's no turning back now. Do you have evidence that proves there was a gunshot before midnight? Do you have evidence that proves Mr. Butz wasn't just hearing things?\nPresent Second Lake Photo\nPhoenix:\nLeads to:\n\"Look at this photograph!\"\nPresent anything else\nPhoenix:\nJudge:\nMr. Wright... Is that a smirk I see?\nPhoenix:\nEr, Your Honor... sorry, I wasn't really sure about the evidence.\nJudge:\nDon't show us evidence you aren't confident in Mr. Wright! I'll ask you again.\nLeads back to:\n\"Do you have evidence that proves there was a gunshot before midnight?\"\nPhoenix:\nLook at this photograph! This was taken by our witness yesterday, Ms. Lotta Hart, with her automatic camera. The timestamp on the photo reads \"December 24, 11:50 PM.\"\nJudge:\nOh yeah? Hmm? But, there's nothing on the lake in this picture.\nPhoenix:\nYour Honor. The real issue here is not why nothing is shown in the photograph. It is why this photograph exists at all!\nJudge:\nWhat do you mean?\nPhoenix:\nYour Honor... This photograph was taken by an automatic camera. That camera was set to go off in response to loud noises!\nJudge:\nAhah!\nPhoenix:\nCorrect! There was a loud noise on the lake at 11:50 PM. That is why this photograph was taken! In other words... There was a gunshot at the time that Larry claims!\nLeads to:\n\"Order! Order!\"\nPresent anything else\nPhoenix:\nKarma:\nI have a favorite saying. I'd like to share it with the court. \"Youth and stupidity go hand in hand.\" Get rid of both, and I'll allow you show me this rubbish you call \"evidence\"!!!\nPhoenix:\n(In other words, I picked the wrong evidence to show him...)\nKarma:\n... I can tell from your face you haven't learned your lesson. Very well, try again. Show us your evidence!\nLeads back to:\n\"Show me evidence there was a gunshot before midnight!\"\nJudge:\nOrder! Order! Hmm... That would make sense of the evidence we've seen so far. ... However... This leaves me wondering exactly what did happen that night on the lake.\nKarma:\nExactly! If this is true, there were two sets of gunshots, separated by 25 minutes! One at 11:50, another at 15 minutes after midnight! Why, I ask you! Why!?\nPhoenix:\n(Uh oh, I'd better think of something quick! ... Wait a second...! Gunshots separated by 25 minutes...?) Aaaaaaaaaaah!\nMaya:\nWh-what's wrong, Nick?\nPhoenix:\nI have it! I have it!\nMaya:\nHuh?\nPhoenix:\nRemember the case with the Steel Samurai!?\nMaya:\nHuh? Yeah, of course I remember...\nPhoenix:\nThe murderer in this case had the same idea as the murderer in that case!\nMaya:\nWhat do you mean?\nPhoenix:\nMaya!\nMaya:\nYes!?\nPhoenix:\nIf we don't figure this out now, we'll never overturn Edgeworth's guilty verdict! I've got a hunch, and I'm going to run with it...\nMaya:\nRight! I mean... is this safe?\nPhoenix:\nSafe? We've already gotten a guilty verdict! We have nothing to lose!\nMaya:\n...\nPhoenix:\nYou just watch and let me know if I say anything that sounds fishy, okay?\nMaya:\nRight, Nick!\nPhoenix:\nYour Honor!\nJudge:\nY-yes, Mr. Wright?\nPhoenix:\nThe testimony just now has cleared up this entire case!\nJudge:\nWhat do you mean, Mr. Wright!?\nKarma:\nTsk tsk tsk... So, you've finally realized the truth? There can be no other murderer here than Miles Edgeworth himself.\nPhoenix:\nWrong, von Karma! A man was shot that night, but it wasn't Edgeworth who did the shooting!\nKarma:\nListen, rookie. Take a deep breath, and consider the facts. At the time of the murder, one boat was on the lake. This was shown by the witness's photograph. The defendant, Edgeworth, and victim, Robert Hammond, were on that boat. There was a gunshot fired on that boat, and Robert Hammond fell into the lake. The distance of the shooting was one meter. It couldn't have been suicide! Well? The guilty party has to be the other man on that boat!\nJudge:\nI admit, it is hard to imagine any other possibility.\nPhoenix:\nYes... But this assumes that the victim was shot at 15 minutes after midnight.\nJudge:\n... What do you mean by that, Mr. Wright? We have photographic evidence of the time of the shooting. The timestamp on the photo says 00:15.\nPhoenix:\nBut Larry heard a gunshot 25 minutes before that! Robert Hammond was killed then! 25 minutes before the shot on the lake! (That's the only way that Edgeworth could be innocent!)\nJudge:\n...\nKarma:\n... Mr. Wright. Are you quite mad? Explain who the two men on the boat are! (Changed from [Explain who this is sitting on the boat!] in the original release)\nThe murderer and Hammond\nPhoenix:\nIt was the murderer and Robert Hammond!\nKarma:\nKarma:\nWhat are you saying!? That contradicts what you just told the court. You said that Robert Hammond had been killed 25 minutes before this gunshot!\nPhoenix:\nY-yes, that's right.\nJudge:\nAlso, might I mention... The defendant, Mr. Edgeworth, has admitted to being on that boat.\nPhoenix:\nEr, right, Your Honor. (Crash and burn...)\nJudge:\nMr. Wright! Your client has already been declared guilty once! I'm going to have to penalize you for this foolishness.\nPhoenix:\n(*sigh*)\nKarma:\nBah! I'll ask you again!\nLeads back to:\n\"Explain who the two men on the boat are!\"\nEdgeworth and the murderer\nLeads to:\n\"Of course, it was Edgeworth and the murderer!\"\nEdgeworth and Hammond\nPhoenix:\nMiles Edgeworth and Robert Hammond!\nKarma:\nKarma:\nYes, I believe you are mad! That is exactly what I've been telling the court this whole time! You're agreeing with me! And yet, what did you just say? That Robert Hammond had been killed 25 minutes before the shot on the boat!?\nPhoenix:\nY-yes, that's what I said! I was just testing you, von Karma!\nJudge:\nMr. Wright! Your client has already been declared guilty once! I'm going to have to penalize you for this foolishness.\nPhoenix:\n(*sigh*)\nKarma:\nBah! I'll ask you again!\nLeads back to:\n\"Explain who the two men on the boat are!\"\nPhoenix:\nOf course, it was Edgeworth and the murderer! After the murderer killed Robert Hammond at 11:50... He assumed the guise of Mr. Hammond and met Edgeworth!\nJudge:\nWh... What!? Are you serious?\nPhoenix:\nYes. Edgeworth won't tell us why he went to the lake that night. However, I have a hunch. That night, Robert Hammond called Edgeworth to the lake. Now, Edgeworth didn't know Robert Hammond's face that well. That's why he didn't suspect anything when the murderer took Robert Hammond's place!\nJudge:\n... I'm not sure what to make of all this.\nKarma:\nL-Ludicrous!\nJudge:\nMr. Wright. Tell us the name of the murderer then!\nPhoenix:\nThe murderer's name...? Right! It's...\nMiles Edgeworth\nPhoenix:\n(On second thought, that's a really dumb answer... I might get a laugh or two out of the crowd, but that's about it.)\nMaya:\nUh, Nick? Something on your mind?\nPhoenix:\nHuh? Oh, uh, nothing. Hah hah. *groan*\nJudge:\nMr. Wright! Stop laughing and tell us who the murderer is!\nPhoenix:\nY-yes, Your Honor!\nLeads back to:\n\"The murderer's name...? Right! It's...\"\nLotta Hart\nPhoenix:\nThe murderer is none other than Ms. Lotta Hart!\nJudge:\n... The investigative photographer...?\nPhoenix:\nUm, yes.\nJudge:\nYou're saying that young lady dressed up like Robert Hammond and fooled Mr. Edgeworth?\nPhoenix:\nY-yes, well, she did look sort of manly.\nKarma:\nKarma:\nI am ashamed I actually listened to this utter nonsense. Listen! You came to this conclusion based on a piece of evidence. That is, this photograph taken at 11:50. If you didn't have this photograph, you never would have made this claim! Correct? And just who was it who went out of her way to give you that piece of evidence?\nPhoenix:\n...! It was... Lotta Hart.\nKarma:\nWhy would the murderer go to all that trouble just to deliver you decisive evidence!\nPhoenix:\n... I guess... they wouldn't.\nJudge:\nMr. Wright. I'm going to penalize you for this.\nPhoenix:\n(Whoops.)\nJudge:\nMr. Wright! Can you really tell us the name of the murderer!?\nPhoenix:\n(Uh oh, he looks suspicious! I'd better bluff and bluff good!)\nLeads back to:\n\"The murderer's name...? Right! It's...\"\nI don't know\nLeads to:\n\"Actually, I don't know the murderer's name.\"\nPhoenix:\nActually, I don't know the murderer's name.\nJudge:\nY-you don't know!?\nKarma:\nBah! Again, you waste my time!\nPhoenix:\nI don't know because he never told us!\nKarma:\n...!\nPhoenix:\nThe murderer is the caretaker of the boat shop, that old man! At 11:50, he was the one who killed Robert Hammond.\nJudge:\nThe caretaker of the boat shop!? Wh-where did he do this!? There weren't any boats on the lake then!\nPhoenix:\nWhy would he have to go all the way out on the lake just to shoot someone? May I suggest... That the real scene of the crime was not in a boat!\nJudge:\nWhat!? W-well then, where did the murder take place!?\nPhoenix:\n(Show the judge where the murder really took place!)\nPresent Boat Rental Shop\nPhoenix:\nLeads to:\n\"Here, of course! The boat shop, where he lives.\"\nPresent Gourd Lake Woods\nPhoenix:\nPhoenix:\nIt was here!\nJudge:\n... Where Ms. Hart, the photographer was camping?\nPhoenix:\nYes.\nJudge:\nWhy would the caretaker of the boat shop go there to kill someone?\nPhoenix:\nIt was probably an honest mistake.\nJudge:\nThe caretaker made a mistake?\nPhoenix:\nNo, I did.\nJudge:\n... Maybe you'd like to show us again?\nLeads back to:\n\"Show the judge where the murder really took place!\"\nPresent anywhere else\nPhoenix:\nPhoenix:\nAround here, maybe?\nJudge:\n\"Maybe\", Mr. Wright...? (Changed from [Around... where?] in the original release) And does this \"maybe\" include the reason why the killer would choose that spot? (Changed from [You have some reason for thinking this?] in the original release)\nPhoenix:\nYes, well... Maybe because there IS no good reason, the murderer thought we'd never expect it! (Changed from [Maybe because there's no good reason, the murderer knew we'd never expect it!] in the original release)\nJudge:\n... Maybe you should try again. (Changed from [Try again.] in the original release)\nPhoenix:\n(He wasn't even surprised I goofed up.)\nLeads back to:\n\"Show the judge where the murder really took place!\"\nPhoenix:\nHere, of course! The boat shop, where he lives. That way he could meet with the victim without anyone seeing!\nKarma:\nKarma:\nDo you have proof that the boat shop was the scene of the crime!?\nPhoenix:\nRecall Larry's testimony if you will. That night he was out on the lake in a boat, searching for something. He finds it, and returns the boat. Then, just as he's starting to head for home, he hears a gunshot! He heard a gunshot, Your Honor! Even though he was wearing headphones at the time! In other words, the gunshot was very, very close by! And where would that be if he had just returned a boat?\nJudge:\nThe boat shop...! Mr. Wright! What happened that night on Gourd Lake!? Please tell the court, from the beginning!\nPhoenix:\nY-yes, Your Honor.\nMaya:\nNick, are you sure about this...?\nPhoenix:\nUm, not really. But, I think if I start at the very beginning... And I take it slow, I must just be able to figure this out...\nPhoenix:\nThat night... The caretaker of the boat shop called Robert Hammond to his shop. This was around 11:50. That was when the gunshot that Larry heard was fired. After that, the caretaker put on Robert Hammond's coat... He became Robert Hammond! Then he got in the boat with Edgeworth, and went out into the middle of the lake.\nJudge:\nThen... who fired the pistol on the boat, Mr. Wright?\nMiles Edgeworth\nPhoenix:\nIt was Miles Edgeworth...\nMaya:\nN-Nick! How could that be!? Wasn't the old man holding the pistol!?\nPhoenix:\nUh, yeah. Good thinking!\nMaya:\nThat was easy, Nick! What I'm worried about is what you're thinking!\nLeads to:\n\"Of course, it was the murderer who shot the pistol.\"\nThe boat shop caretaker\nLeads to:\n\"Of course, it was the murderer who shot the pistol.\"\nPhoenix:\nOf course, it was the murderer who shot the pistol. He shot twice. Both missed Edgeworth, on purpose.\nJudge:\nWait a minute...\nPhoenix:\nY-yes?\nJudge:\nWhy would he shoot twice if he didn't mean to hit anyone?\nPhoenix:\nUh... (Details! Details!)\nKarma:\nKnow this, Mr. Wright. The moment you run out of explanations is the moment you lose. Tell us why the murderer had to fire twice!\nBecause the first shot missed\nPhoenix:\nB-because the first shot missed?\nJudge:\nMissed?\nPhoenix:\nYeah, he was aiming for Edgeworth, and he missed...\nKarma:\nKarma:\nWhat are you saying!? Did you not just tell us that he missed Edgeworth on purpose!?\nPhoenix:\nHuh? Oh, uh, right. (Uh oh... I'd better figure out just what it is I'm trying to prove here.)\nLeads to:\n\"I believe he shot twice to create a witness, Your Honor.\"\nTo create a witness\nLeads to:\n\"I believe he shot twice to create a witness, Your Honor.\"\nPhoenix:\nI believe he shot twice to create a witness, Your Honor.\nJudge:\nCreate a witness...?\nPhoenix:\nThe murderer lifts his pistol and fires one shot. That ensures that anyone who heard the shot would look at the lake. Indeed, Ms. Hart did exactly that after hearing the first gunshot. Next! The murderer waits a bit and he fires again. Then... The murderer jumps from the boat himself! Leaving the pistol in the boat behind him.\nJudge:\n... I see! To someone looking from the edge of the lake... It would appear that one of the men on the boat had shot the other!\nPhoenix:\nThe murderer didn't know about the automatic camera, of course. That's why he shot twice to draw attention to the boat!\nJudge:\nHmm...\nPhoenix:\nOnce you realize that, everything else falls into place! The boat shop caretaker swam back to his shop. Then he put Mr. Hammond's coat back on the body. And threw the body into the lake! This is what happened, Your Honor. These are the events that transpired that night on Gourd Lake.\nJudge:\n...\nKarma:\n...\n...\nJudge:\n... Bailiff! Bring out the witness from before! The boat shop caretaker! Quickly!\nJudge:\nVery well. While we are waiting for the caretaker... I would like to ask the defendant, Miles Edgeworth, a few questions. Mr. Edgeworth. Please take the stand.\nJudge:\nMr. Edgeworth... You heard what the defense has said?\nEdgeworth:\nYes.\nJudge:\nWell? Why did you go to the lake that night?\nEdgeworth:\n... What Wright has said was mostly correct. Astonishingly so, actually. Yes... Several days ago, I received a letter. The letter was signed, \"Robert Hammond.\" He asked me to come to the boat shop by the lake at midnight on Christmas Eve. He said he had something very important to discuss with me.\nJudge:\nSomething important?\nEdgeworth:\n... I'm sorry. I can't say what it was.\nJudge:\nHmm...\nGuard:\nYour Honor, sir!\nJudge:\nBailiff! We are conducting a trial here, I ask that you remain quiet...\nGuard:\nThe witness has disappeared! He isn't at the boat shop, either!\nJudge:\nWhat!?\nGuard:\nWhat should I do?\nJudge:\nF-find him, quickly! We cannot allow him to get away!\nJudge:\nMr. von Karma! Your witness has disappeared!\nKarma:\n... A search warrant has already been issued.\nJudge:\nHmm... It goes without saying that I cannot declare a verdict under these circumstances. I will extend the trial until tomorrow, the final day allowed. I request that the police department utilize all its forces to find that witness! Am I understood?\nKarma:\n...\nJudge:\nOne more thing. Just who is that boat shop caretaker? I think his identity has become very important to this trial. I want him, and I want to know who he is.\nKarma:\n...\nJudge:\nVery well. Court is adjourned!\nDecember 27, 1:22 PMDistrict CourtDefendant Lobby No. 2\nMaya:\nYay, Nick! You did it!\nPhoenix:\nYeah... Well, at least we got out from under that guilty verdict...\nMaya:\nAnd what about Larry! That was something else! Even von Karma didn't know what to do with his testimony! Larry really helped us out!\nPhoenix:\nSure, once I sifted through his \"unique\" testimony. Still... he did save us. I just wish our cases weren't so down to the wire all the time.\nMaya:\nI know what you mean. Sometimes I feel like it's us on trial instead of our clients!\nPhoenix:\nHey, Edgeworth...\nEdgeworth:\n...\nMaya:\nUmm... Mr. Edgeworth?\nEdgeworth:\n! D-did you say something?\nMaya:\nDon't look so pained! I mean, it looks like you're probably going to get off the hook! You could try to smile just a little...? Relax!\nEdgeworth:\n... I'm sorry... But... I fear it's not over for me yet.\nPhoenix:\nWh-what do you mean?\nEdgeworth:\nWright... There's something that's been troubling me for a long time now. And I don't know whether or not to tell you...\nPhoenix:\nEdgeworth?\nEdgeworth:\nNo... there's so little time left. I want to tell you, to get it off my chest, but... ... Hmm. I can't make up my mind. ...\nPhoenix:\nWhat is this about, Edgeworth?\nEdgeworth:\n... It's... a nightmare I've had. A memory of a crime... that I committed.\nPhoenix:\nA crime you committed?\nEdgeworth:\nA memory... of a murder.\nTo be continued.\nPresenting wrong evidence during testimony\nPhoenix:\nPhoenix:\nYour Honor! That statement contradicts this evidence!\nJudge:\n...? It does? I don't see anything contradictory...\nPhoenix:\nHuh? Really?\nJudge:\nObjection overruled. Try to think before you make accusations, Mr. Wright!\nPhoenix:\n(Whoops! That didn't go so well.)\nPresenting wrong evidence during testimony\nPhoenix:\nPhoenix:\nYour Honor! What do you think about the witness's statement?\nJudge:\nUh... I'm not sure I follow?\nPhoenix:\nIt clearly, er, contradicts the... um... I thought...\nJudge:\nYou don't sound very convinced, Mr. Wright. Objection overruled.\nPhoenix:\n(I don't think that won me any points with the judge...)\nPresenting wrong evidence during testimony\nPhoenix:\nPhoenix:\nThis evidence clearly reveals the contradiction in that statement, Your Honor!\nJudge:\nHow exactly are that evidence and the statement just now related...?\nPhoenix:\nThey aren't, are they...\nJudge:\nNot at all. Mr. Wright, please think the facts over before making accusations.\nPhoenix:\n(I don't think that won me any points with the judge...)\nPresenting wrong evidence during testimony\nPhoenix:\nPhoenix:\nThe witness's statement is clearly faulty, Your Honor!\nJudge:\n... I'm sorry, but I can see nothing faulty. Unfortunately, I will have to penalize you, Mr. Wright.\nPhoenix:\n(Ugh. I must be on the wrong track?)\nToo many penalties\nJudge:\nThis court sees no reason to further prolong the trial. Nor is there any need for more time to decide the case against the defendant. This case is extremely clear. I see no room for misinterpretation of the facts. This court find the defendant, Mr. Miles Edgeworth...\nGuilty\nJudge:\nThe accused will surrender to the court immediately, to be held pending trial at a higher court within a month from today's date. That is all. The court is adjourned!",
  "turns": []
}