{
  "previousContext": "",
  "characters": [
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Kay Faraday",
      "age": "17",
      "gender": "Female",
      "description1": "A self-styled Great Thief and so-called \"second Yatagarasu\" who's always looking to bag the greatest treasure of all -- the truth."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Dick Gumshoe",
      "age": "32",
      "gender": "Male",
      "description1": "Homicide detective from the local precinct who's always first on the scene at any murder investigation."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Bronco Knight",
      "age": "24",
      "gender": "Male",
      "description1": "A former bodyguard who killed his team leader. He is set to stand trial soon.",
      "description2": "The victim. He was killed while being detained in the detention center's holding cells. His body was discovered in the prison proper."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Eddie Fender",
      "age": "36",
      "gender": "Male",
      "description1": "A defense attorney I have known for a long time, but haven't seen in years. Apparently, he lived abroad for a while.",
      "description2": "Senior partner at Edgeworth and Co., and former assistant to my father. Also Simeon Saint's attorney."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Rocco Carcerato",
      "age": "31",
      "gender": "Male",
      "description1": "An inmate and former boxer who is obsessed with training. Has a pet polar bear named Teddy.",
      "description2": "An inmate and former boxer who has dug a tunnel to the detention center from his cell and made his escape. Has a pet polar bear.",
      "description3": "An inmate obsessed with escaping. A tunnel links his cell to Knight's holding cell."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Verity Gavèlle",
      "age": "26",
      "gender": "Female",
      "description1": "A district court judge and member of the Committee for Prosecutorial Excellence, who also acts as its mouthpiece."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Eustace Winner",
      "age": "17",
      "gender": "Male",
      "description1": "A rookie prosecutor who's taken over my cases on the Committee's orders."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Simeon Saint",
      "age": "24",
      "gender": "Male",
      "description1": "The suspect in this case. A timid young man who seems an unlikely murderer.",
      "description2": "The suspect in this case. A trainee animal tamer at the Berry Big Circus."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Fifi Laguarde",
      "age": "37",
      "gender": "Female",
      "description1": "Warden of the prison. An animal lover who considers physical contact to be very important."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Frank Sahwit",
      "age": "47",
      "gender": "Male",
      "description1": "The prison inmate who first discovered the body. Currently training to be a pet stylist.",
      "description2": "Prisoner and trainee pet stylist who first discovered the body. His security bracelet is broken."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Bodhidharma Kanis",
      "age": "??",
      "gender": "Male",
      "description1": "A blind ex-assassin whose favored tools were a black dog and a knife. The tinkling of small bells used to accompany his appearance."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Shi-Long Lang",
      "age": "27",
      "gender": "Male",
      "description1": "An Interpol agent with an unrivaled arrest rate. Originally from Zheng Fa."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Regina Berry",
      "age": "17",
      "gender": "Female",
      "description1": "Head animal trainer at the Berry Big Circus, and Saint's boss."
    }
  ],
  "evidences": [
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Prosecutor's Badge",
      "description1": "Proof of my profession. However, I prefer to keep it in my pocket."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Building Layout",
      "description1": "A map of the facility, including the detention center and the prison proper."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Mr. Knight's Body",
      "description1": "Cause of death: Stab wound to the throat. Death would have been instant. There is also a small cut on his scalp from when he suffered a blow to the head. [info] The victim had a ring on his right hand, which was covered by a sheet when the body was discovered. ",
      "description2": "Killed instantly by a stab wound to the throat. The body is covered in dirt. There is also a small cut on his scalp from when he suffered a blow to the head.",
      "description3": "Killed instantly by a stab wound to the throat. There is also a small cut on his scalp from when he suffered a blow to the head. A sweet scent can be detected."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Pocket Chess Set",
      "description1": "A folding chessboard with the pieces stored inside. It appears to have belonged to the victim.",
      "description2": "A folding chessboard with the pieces stored inside. It belonged to Knight, and was brought to him at his request by Saint.",
      "description3": "Portable folding chessboard. Belonged to Knight. There is a hidden space inside the chessboard.",
      "description4": "Knight hid a chisel in here to prevent it from being found by the prison staff."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Rubber Glove",
      "description1": "Only one glove was found at the crime scene. Prison-issued equipment for working inmates. Stained with blood and mud.",
      "description2": "Found in Workshop A. Used by Sahwit when he was doing his animal styling training. Stained with blood and mud.",
      "description3": "Found in Workshop A. Sullied after being worn by Sahwit when administering a dark mudpack treatment. Also bloodstained."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Rope",
      "description1": "Discovered on top of Knight's body. Does this mean the victim was tied up?"
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Bloodstained Sheet",
      "description1": "Colorful tarp found by the victim's body. Some of these were being stored in Workshop A."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Door Sensor",
      "description1": "Fitted to each workshop's door, they detect and react to the prisoners' bracelets when they are near by raising the alarm.",
      "description2": "They open the doors if an animal is detected, but raise the alarm if an inmate's bracelet is detected. Prisoners are not allowed to move about freely."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Prison Roll Call",
      "description1": "Held three times a day: 7 AM, noon, and 9 PM. The victim's body had not been found at the time of the 7 AM roll call."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Black Dog",
      "description1": "Sahwit claims to have seen this dog biting the victim's throat. He doesn't seem to like me very much."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Sahwit's Bracelet",
      "description1": "Sahwit's bracelet is broken, and can no longer be detected by the prison's sensors.",
      "description2": "Sahwit's bracelet wasn't working at the time of the incident, and could not be detected by the sensors."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Dog Chess Piece",
      "description1": "Carved for fun by Kanis. He also seems to be engaged in correspondence chess via postal mail."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Prison Search",
      "description1": "Winner, Gavèlle and the warden searched the prison for the murder weapon, but couldn't find anything."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Wiped Floor",
      "description1": "There are signs that the floor in the victim's detention center cell was wiped clean.",
      "description2": "There are signs that the floor in the victim's cell was wiped clean. I've ordered a test to see if it was blood.",
      "description3": "There are signs that blood was wiped from the floor of the victim's cell. We're currently checking whose blood it is.",
      "description4": "There are signs that blood was wiped from the floor of the victim's cell. The blood has been confirmed as Knight's."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Chess Diagram",
      "description1": "The positions of the pieces match those on the board in Kanis's cell.",
      "description2": "Knight was playing correspondence chess against Kanis. Did the two have some sort of connection?"
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Security Camera Footage",
      "description1": "Footage of a detention center holding cell showing the victim being attacked by a dark form.",
      "description2": "The time stamp is off due to a three-hour gap in the footage. This was actually recorded around 9 AM."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Missing Guard Uniform",
      "description1": "Stolen from a guard's locker in the detention center corridor on March 26th."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Mr. Knight's Cell Key",
      "description1": "A guard was attacked and his keys, including the one to Knight's cell, were stolen. They have yet to be recovered.",
      "description2": "A guard was attacked the day before the murder, and his keys were stolen. They were found in Carcerato's possession."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Security Gates",
      "description1": "Deployed at the entrances to both the detention center and the prison proper. Capable of detecting items made of metal."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Tunnel Prints",
      "description1": "A photo of the tunnel between the prison and the detention center. It seems to depict the paw prints of a dog.",
      "description2": "A photo of the tunnel between the prison and the detention center. Shows paw prints made by a bear."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Autopsy Report",
      "description1": "The interim report suggests that the cause of death was a stab wound to the neck, inflicted by a sharp blade. Death was instantaneous.",
      "description2": "Estimated time of death is between 3 AM and 6 AM on the 27th. Instant death from a stab wound to the neck."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Chisel",
      "description1": "Contains traces of blood. Hidden by Kanis inside his dog's mouth. Has a small bell attached to it.",
      "description2": "Belonged to Knight. Hidden by Kanis in Helmut's mouth in order to avoid suspicion."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Mr. Kanis's Bells",
      "description1": "Only two such bells exist. One is attached to Helmut the dog, the other to Kanis's knife, which was seized by the police during his arrest."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Mr. Saint's Trick",
      "description1": "A contraption that used the well, a very heavy weight, three pulleys, and two lengths of rope to send Saint flying during the show.",
      "description2": "Used during the show to send Saint flying. The weights were replaced with the victim's body by someone."
    },
    {
      "currentChapter": "The Captive Turnabout",
      "name": "Breakers",
      "description1": "Located in the power room, just off the prison yard. Were they tampered with the night before the body was found?"
    }
  ],
  "turns": [
    {
      "category": "rebuttal",
      "newContext": "The Captive Turnabout\n\n\n\n\n\n\n\n\n\nImage Gallery\n\nTranscript\nThis article contains information about Ace Attorney media that has been recently released and thus likely contains spoilers!\n\n\n\nThe information in this article comes from a game, demo, or other media that has been recently released worldwide. This article may need input from an editor who has personal experience with the media in question. If you have, you can help the Ace Attorney Wiki by expanding this article. Please heed the manual of style when adding information.\nReaders of this page should be aware that this article likely contains MAJOR SPOILERS concerning the media in question.\nYou have been warned!\nWe need more pieces to finish this puzzle.\n\n\n\n\nThis article is under construction. While it is not short, it still needs expansion as outlined in the manual of style. The article most likely needs expansion near the end of the tagged section or sections.\nThis article or section needs attention for quality control purposes.\n\n\n\n\nThe content marked by this message box has been identified as requiring improvements to a reasonable standard of quality. Content may be marked for a variety of reasons, including known false information or excessive typos. Fact-checking for false/missing information can be a time-consuming task, but the wiki has been working on transcripts that may help speed up the process. Please also consult the manual of style. You are welcome to discuss this issue in the talk page of the article. Note: The editor who added this tag believes this article or section should be cleaned up for the following reason: re-formatting, quality control, changing everything to official 2024 release\nPart 1\n\nPart 2\nEpisode 2The Imprisoned Turnabout\nMarch 27, 10:16 AMDetention CenterVisitor's Room\nExamine evidence\n\n\n\n\n\n\n\n\n\nFront side of Prosecutor's Badge\n\n\n\n\n\n\n\nEdgeworth:\nThis badge's design is said to reflect the relentlessness and discipline of law enforcement. It comes from the authority vested in us as strict protectors of the law... ...and executors of sentences, much like harsh winter frosts and blazing summer days. To wear it is to identify oneself as a prosecutor, but I have no interest in doing so.\n\n\n\n\nBack side of Prosecutor's Badge\n\n\n\n\n\n\n\nEdgeworth:\nEach Prosecutor's Badge is engraved with the number of its owner on the back. Hmph. Numbers. As if we're not human on the inside like everyone else!\nEdgeworth:\n..........\nGumshoe:\n..........\nKay:\n...He's not coming.\nGumshoe:\nHe's not coming, sir.\nEdgeworth:\nHow long does he intend to keep us waiting...!?\nKay:\nNow, now, Mr. Edgeworth. There's no need to get your cravat in a twist.\nEdgeworth:\nEthan Rooke's murder... Two days after the incident, we visited the detention center. Naturally, we were hoping to meet with the defendant, Horace Knightley. His trial was set to begin the next day, with me serving as the prosecutor.\nEdgeworth:\nStill, he is rather late... You there! Do you know what's going on?\nGuard:\nI-It is certainly strange... I'll try calling him one more time...\nGuard:\nI-It's terrible! I-It's... Knightley! H-He's been murdered!\nGumshoe:\nWhaaaaaaat!? What did you say!?\nEdgeworth:\nMurdered? (Inside the detention center?)\nKay:\nMr. Edgeworth! Let's go check it out!\nEdgeworth:\nYou there! Take us to the crime scene, posthaste.\nGuard:\nYes, sir!\nEdgeworth:\n(Knightley's not in his cell? I thought he was being held there.)\nGuard:\nWhat are you doing, sir!? This way!\nGumshoe:\nWh-Where are you taking us, pal? Through this door is the...\nEdgeworth:\nAh... It's the prison.\nKay:\nPrison? Then what were the small rooms back there?\nEdgeworth:\nThose cells we just passed are part of the detention center. They're used for holding suspects temporarily, while they await for their trial. What lies ahead... is a facility that serves a completely different purpose.\nGumshoe:\nThis is where criminals who have been declared guilty serve out their sentence, pal.\nEdgeworth:\nIt's the one place a Great Thief does not want to end up, Kay.\nGuard:\nI'm opening the door now! Please, follow me!\nEdgeworth:\n(Th-There's no mistaking it... Knightley's... dead! Moreover, he was murdered inside the prison walls... How exactly did this happen!?)\nMarch 27, 10:32 AMPrisonWorkroom A\nKay:\nI-I can't believe something like this would happen to Mr. Knightley!\nEdgeworth:\nYes. I can't believe it either... But the scene you see before you is the unmistakable reality.\nKay:\nBesides... Wasn't Mr. Knightley supposed to be in the detention center?\nEdgeworth:\nIndeed. He was. Knightley hadn't had his trial yet. Before a suspect is found guilty, they're detained in the detention center's holding cells. (They only enter the prison after they have received a guilty verdict. Knightley should not have been moved in here...)\nGumshoe:\nDo you think he passed through those giant doors that we went through earlier, sir?\nEdgeworth:\nHuge metal doors and a long passageway separate the prison and the detention center. As a suspect, Knightley wouldn't have been able to pass through.\nFloor Plans jotted down in my Organizer.\nEdgeworth:\nWhat happened to Knightley... In order to solve this mystery, we must first investigate the crime scene.\nBegin Investigation\nPrisonWorkroom A\nLogic\n\n\n\n\n\n\n\n\n\n\"Bloodstained Sheet\" and \"Stacked sheets\"\n\n\n\n\n\n\n\nEdgeworth:\nThe sheets stacked here have a very distinctive pattern...\nKay:\nIt's the same as the bloodstained sheet!\nEdgeworth:\nTh-That's right... Kay. Don't steal my lines like that.\nKay:\nHee hee hee. Mr. Edgeworth, you shouldn't get caught off guard like that. I'll never lose my edge as the Great Thief!\nEdgeworth:\n(I thought she was on hiatus?)\nBloodstained Sheet data jotted down in my Organizer.\nPartner\n\n\n\n\n\n\n\nKay:\nYeah, what's up?\n\n\n\nThe prison\n\n\n\n\n\n\n\nKay:\nSo this is what a prison is like! It's been very educational!\nEdgeworth:\nYou're more enthusiastic than I am at gathering information.\nKay:\nMr. Edgeworth, you need to work harder at gathering information! Otherwise... you'll be in trouble when the \"time\" comes!\nEdgeworth:\nI don't think the \"time\" you're talking about will ever come... ...but I do need to gather more information. (In order to complete my logic and catch the killer!)\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nProsecutor's Badge\n\n\n\n\n\n\n\nKay:\nThat's a really cool badge. It depicts a blazing sun on top of winter frost, right?\nEdgeworth:\nYes. It symbolizes the severity of the criminal justice system.\nKay:\nMy badge has symbols too! U-Uh Umm... It symbolizes Love and Justice and Peace and Courage and Honor and Kindness!\nEdgeworth:\n(What happened to \"Truth\"?)\n\n\n\n\nRope\n\n\n\n\n\n\n\nKay:\nSo, you want to see my amazing rope escape after all?\nEdgeworth:\n...Isn't there anything else you can do with a rope besides rope escapes?\nKay:\nI can also... make rope ladders and tie up bad guys! There are many things you can do with just a piece of rope.\nEdgeworth:\n(All of those things are only useful to a Great Thief.)\n\n\n\n\nAnything else\n\n\n\n\n\n\n\nKay:\nI believe that even a Great Thief has rights. For example, we have the right to choose what we want to steal.\nEdgeworth:\n(I guess she doesn't consider this valuable.)\nBoard near guard\n\n\n\n\n\n\n\nEdgeworth:\nIt's a reservation form that lists the inmates who are scheduled to use this room.\nKay:\nThere are numbers written here.\nEdgeworth:\nProbably their prison numbers.\nKay:\nI'd hate to be called a number, like T-4137...\nEdgeworth:\nYes. That is why we are born with a name.\nKay:\nI'd rather be called \"Great Thief\" or \"The Terminator!\"\nEdgeworth:\nWhat about your name...?\nGuard\n\n\n\n\n\n\n\nEdgeworth:\nIs there anything out of place?\nGuard:\nYes, sir! If I had to say...\nEdgeworth:\nWhat is it?\nGuard:\nThere's a dead body over there.\nKay:\nYup! That's definitely out of place!\nEdgeworth:\n...If you notice anything else out of place, please be sure to tell me.\nDirt area\n\n\n\n\n\n\n\nEdgeworth:\nThis section of the room is covered in dirt.\nGumshoe:\nThe dirt is soft and has footprints on it, sir!\nEdgeworth:\nThere are too many footprints... It won't be easy to identify them all.\nGumshoe:\nUntil the forensics arrive, we probably shouldn't tamper with this area.\nEdgeworth:\nDetective, please don't trip and fall in the dirt.\nGumshoe:\nI'll be careful, sir! I don't want to get my favorite coat dirty.\nEdgeworth:\n(I'm more worried that you'll mess up the footprints...)\nDick Gumshoe\n\n\n\n\n\n\n\nGumshoe:\nYes, sir!\n\n\n\nThe victim\n\n\n\n\n\n\n\nGumshoe:\nHe was arrested on the afternoon of the 25th, and was killed on the morning of the 27th... I never expected the criminal to become the victim, sir.\nEdgeworth:\nYes... It doesn't leave a good taste in your mouth.\nGumshoe:\nMaybe De Killer killed Knightley? He couldn't let anyone who had seen his true identity live! ...Or something like that.\nEdgeworth:\n...Are you talking about Shelly de Killer? If he was the killer, then he would have left his calling card behind. Besides, didn't we also see his true identity as well?\nGumshoe:\nThat's right... And we're still alive, sir.\nEdgeworth:\n(Still, to commit murder in such a place is not an easy task... How did the criminal murder Knightley?)\n\n\n\n\nThe prison\n\n\n\n\n\n\n\nGumshoe:\nIt's nice that the prison and the detention center are connected, sir. As they both get to share the visitor's room, it's actually quite convenient.\nEdgeworth:\nWell... It is an unusual design, but it is convenient for the visitors.\nGumshoe:\nWhy do the detention center and the prison need to be separated in the first place, sir?\nEdgeworth:\nThe suspects go in the detention center, while the convicts go in the prison. They might seem similar, but they are actually two completely different facilities.\nGumshoe:\nThose cramped, dark, and uncomfortable cells all seem the same to me, sir.\nEdgeworth:\n...If you're still having trouble understanding the differences, why don't you step inside one?\nGumshoe:\nUhh... I-I think I'll pass, sir!\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nProsecutor's Badge\n\n\n\n\n\n\n\nGumshoe:\nSuch a tiny object. I'm surprised you don't lose it.\nEdgeworth:\nIt is an identification badge for us prosecutors after all.\nGumshoe:\nI see... It must be tough. If it were me, I'd definitely lose it, sir! I'm always losing my police badge.\nEdgeworth:\n...Having such a talent for losing things must be tough.\n\n\n\n\nCrime Scene Notes\n\n\n\n\n\n\n\nGumshoe:\nIt's a terrible way to go, sir. Being stabbed in the throat... He won't be able to eat instant noodles anymore!\nEdgeworth:\nThat's true. Detective, you should also be more careful. At this rate, you won't be eating anymore instant noodles either.\nGumshoe:\nWh-What do you mean, sir?\nEdgeworth:\nI mean you better start pulling your weight around here with the investigation.\nGumshoe:\nUghh... I'm dreading this month's salary assessment.\n\n\n\n\nChessboard\n\n\n\n\n\n\n\nGumshoe:\nAAAAHH! EUREKA, SIR! I figure out why they say \"Checkmate\"!\nEdgeworth:\n...Alright. let's hear it.\nGumshoe:\nThe patterns on a chessboard look like check marks, sir!\nEdgeworth:\n(...I thought he would say something like that...) Detective. Checkmate is derived from the phrase, \"The king has been cornered\". It has nothing to do with the patterns on a chessboard.\nGumshoe:\nI-Is that right, sir...? And I just thought I had made the discovery of the century...\nEdgeworth:\nMaybe it's about time that you discovered you're the one who has been cornered. Know when to give up, Detective Gumshoe.\nGumshoe:\n*gulp* U-Understood, sir...\n\n\n\n\nAnything else\n\n\n\n\n\n\n\nGumshoe:\nHa ha ha! Mr. Edgeworth, you're such a joker! Even if you show that to me, I still have no idea what it is, sir!\nEdgeworth:\n(He proclaimed that quite proudly...)\nPulley (top side)\n\n\n\n\n\n\n\nKay:\nWe won't rest until we've stolen every suspicious-looking nook and cranny!\nEdgeworth:\nIndeed... (This is quite a large area to investigate... Press the Y Button to switch screens.)\n\n\n\nBefore examining sheets\n\n\n\n\n\n\n\nEdgeworth:\n(I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\n\nAfter examining sheets\n\n\n\n\n\n\n\nEdgeworth:\n(I already checked this area earlier, but it never hurts to take another look.)\n\n\n\n\nPulley\n\n\n\n\n\n\n\nEdgeworth:\nHm... It's a pulley.\nKay:\nIs that used for prison labor too?\nEdgeworth:\nIt looks like it.\nKay:\nThere's something I want to ask you...\nEdgeworth:\nDon't even think about dangling on the hook.\nKay:\nEh? How did you know that's what I wanted to do?\nEdgeworth:\n...Somehow, I had a feeling.\n\n\n\n\nCage\n\n\n\n\n\n\n\nKay:\nIt's a cage inside the cage that is the prison. It's like cage-ception!\nEdgeworth:\nI believe the correct term is \"prison cell\".\nKay:\nThey're the same thing! You need to look more at the essence of things.\nEdgeworth:\n...Actually, it's more important to get the correct information.\nPulley (bottom side)\n\n\n\n\n\n\n\n\n\nRope\n\n\n\n\n\n\n\nEdgeworth:\nThere was a rope near the body as well.\nKay:\nBy the way, my special talent...\nEdgeworth:\nIf it's about rope escapes, there's no need for that now.\nKay:\nAwww.\nEdgeworth:\n(Does she want to show it off that badly?)\n\n\n\n\nSheets\n\n\n\n\n\n\n\nEdgeworth:\nThose are some colorful sheets (Stacked sheets - Very colorful and stands out in the room. What are they used for?).\nKay:\nThey're the most eye-catching thing in this room.\nEdgeworth:\n(They don't fit in with the prison...)\nKay:\nThere's a whip placed on top of the sheets! It reminds me of the Whip Lady! Maybe she left her whip here?\nEdgeworth:\nHmph. I doubt she'd ever leave her whipe behind...\nBody\n\n\n\n\n\n\n\nEdgeworth:\n(Horace Knightley... Murdered right before his trial. Let me take a closer look.)\n\n\n\nBefore examining rubber glove, body, chessboard, and hand\n\n\n\n\n\n\n\nEdgeworth:\n(I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\n\nAfter examining rubber glove, body, chessboard, and hand\n\n\n\n\n\n\n\nEdgeworth:\n(I already checked this area earlier, but it never hurts to take another look.)\n\n\n\n\nRubber glove\n\n\n\n\n\n\n\nEdgeworth:\nThis is... a rubber glove.\nKay:\nYes. There's no mistake, it's a rubber glove. How come there's only one?\nEdgeworth:\n(Let me take a closer look...)\n\n\n\nExamine mud\n\n\n\n\n\n\n\nEdgeworth:\nIt's covered in mud, up to the wrist.\nKay:\nMaybe someone was playing with mud in the prison...? I want to get in on the action too!\nEdgeworth:\nDo it on your own time, when we're not investigating a case!\n\n\n\n\nExamine text on the wrist\n\n\n\n\n\n\n\nEdgeworth:\nIt says \"FOR INMATE USE\". That must mean...\nKay:\nA prisoner used this glove?\nEdgeworth:\nYes. That's what I was thinking.\n\n\n\n\nExamine bloodstain on the behind\n\n\n\n\n\n\n\nLeads to:\n\"(The fingers of the glove are covered in blood...)\"\n\n\nEdgeworth:\n(The fingers of the glove are covered in blood...) This glove was dropped after the pool of blood formed.\nKay:\nEh! Why is that?\nEdgeworth:\nIf it was on the floor before the pool of blood had formed... ...the blood would have formed an outside around the glove.\nKay:\nAh! I see. The blood would have only gotten on the edges of the glove!\nEdgeworth:\nThis glove was discarded after it was covered in blood...\nKay:\nThat must mean the killer left it behind!\nEdgeworth:\nIndeed. It's highly probable. At the very least, the person who dropped this saw the body. You there!\nGuard:\nWh-What is it, sir?\nEdgeworth:\nDo you recognize this glove?\nGuard:\nYes, sir! The inmates use these for prison labor. That's odd... Rubber gloves are usually kept in the inmate's rooms... They are strictly regulated, so you can't just take them out!\nEdgeworth:\n(Indeed, there are no signs of any other rubber gloves in the room.)\nRubber Glove data jotted down in my Organizer.\n\n\n\n\nRubber glove (subsequent times)\n\n\n\n\n\n\n\nEdgeworth:\nThis is... a rubber glove.\nKay:\nYes. There's no mistake, it's a rubber glove. How come there's only one? There are some mud stains on it. And bloodstains too!\nEdgeworth:\n(There's a possibility that the killer left this behind...) You there!\nGuard:\nWh-What is it, sir?\nEdgeworth:\nDo you recognize this glove?\nGuard:\nYes, sir! The inmates use these for prison labor. That's odd... Rubber gloves are usually kept in the inmate's rooms... They are strictly regulated, so you can't just take them out!\nEdgeworth:\n(Indeed, there are no signs of any other rubber gloves in the room.)\n\n\n\n\nBody\n\n\n\n\n\n\n\nKay:\nUgh... The blood from his neck has stained his brace bright red.\nEdgeworth:\nThe cause of death was most likely from his neck wound. He probably died instantly. He couldn't even cry out in pain. ...Hm? There are small bumps on his head. Are these bruises?\nGumshoe:\nMaybe after he was stabbed in the neck, he fell back and hit his head?\nEdgeworth:\nI wonder... At this point in time, there are too many unknowns. Kay. Do you have your digital camera with you? I'd like the detective to take a photo of the body. Would you let him borrow it?\nKay:\nSure thing! Here, Gummy!\nGumshoe:\nThanks, pal! Alright, I'm taking the picture, sir! Still... He's wearing some awfully dirty clothes.\nEdgeworth:\nHmm... There appears to be dirt stains in several places.\nCrime Scene Notes jotted down in my Organizer.\nGumshoe:\nHe's wearing those clothes even though they're dirty... He's just like me, sir!\nEdgeworth:\nDetective... I hope you realize that not everyone shares your lack of hygiene.\n\n\n\n\nBody (subsequent times)\n\n\n\n\n\n\n\nKay:\nUgh... The blood from his neck has stained his brace bright red.\nEdgeworth:\nThe cause of death was most likely from his neck wound. He probably died instantly. He couldn't even cry out in pain. ...Hm? There are small bumps on his head. Are these bruises?\nGumshoe:\nMaybe after he was stabbed in the neck, he fell back and hit his head?\nEdgeworth:\nI wonder... At this point in time, there are too many unknowns.\nGumshoe:\nStill... He's wearing some awfully dirty clothes.\nEdgeworth:\nHmm... There appears to be dirt stains in several places.\nGumshoe:\nHe's wearing those clothes even though they're dirty... He's just like me, sir!\nEdgeworth:\nDetective... I hope you realize that not everyone shares your lack of hygiene.\n\n\n\n\nChessboard\n\n\n\n\n\n\n\nKay:\nHuh? What's this?\nGumshoe:\nMr. Edgeworth has something similar in his office.\nEdgeworth:\nIt's a portable chessboard. It was probably the victim's.\nKay:\nAh! Mr. Knightley enjoyed chess, right?\nGumshoe:\nHe was probably using it to pass time in the detention center...\nChessboard data jotted down in my Organizer.\n\n\n\n\nSheet\n\n\n\n\n\n\n\nLeads to:\n\"He's covered with a dirty sheet.\"\n\n\nEdgeworth:\nHe's covered with a dirty sheet.\nKay:\nThere's a rope on top of the sheet.\nEdgeworth:\n(Was Knightley tied up with this rope?)\nRope data jotted down in my Organizer.\nEdgeworth:\nLet's take a look under the sheet. We might be able to find something.\n\n\nKay:\nYikes! This sheet is bright red!\nEdgeworth:\n...These appear to be bloodstains (Bloody sheet - The bloodstains appear to belong to the victim. It has a colorful pattern.).\nKay:\nWe still might be able to find something. Let's search this area a little more closely!\n\n\n\nHand\n\n\n\n\n\n\n\nEdgeworth:\nHm? There's something on his finger.\nKay:\nLet's have a closer look! Oh! It looks like an expensive ring!\nEdgeworth:\nDon't steal it.\nKay:\nWha...! I didn't do anything yet!\n\n\n\n\nSheet (subsequent times)\n\n\n\n\n\n\n\nKay:\nYikes! This sheet is bright red!\nGumshoe:\nIt really is bright red, sir!\nEdgeworth:\n...These appear to be bloodstains.\nKay:\nA rope and a bloody sheet... There might be something else!\nEdgeworth:\nYes. Let me check this area again in case I overlooked something.\nWash basin\n\n\n\n\n\n\n\nKay:\nThere's a wash basin over here.\nEdgeworth:\nAre there any clues that could be useful to this case?\nKay:\nI don't smell any signs of treasure!\nEdgeworth:\nI'm searching for clues here, not treasure!\nStands\n\n\n\n\n\n\n\nKay:\nThere are a bunch of strange tools here.\nEdgeworth:\nI don't see anything out of place.\nKay:\nI'm kind of picking up the scent of animals.\nEdgeworth:\nDo you have special smelling abilities or something?\nKay:\nNo, it's just a feeling. But I can smell the scent of treasure!\nEdgeworth:\nRemind me to lock up all of my valuables in a safe.\nKay:\nCome on, Mr. Edgeworth. I wouldn't steal your valuables!\nEdgeworth:\n(...So you would steal someone else's valuables?)\nExamine evidence\n\n\n\n\n\n\n\n\n\nBloodstain on the behind of Rubber Glove\n\n\n\n\n\n\n\nEdgeworth:\nThis glove must've been dropped after the pool of blood formed. Otherwise, the blood would have only stained the edges of the glove.\n\n\n\n\nLock on Chessboard\n\n\n\n\n\n\n\nKay:\nYou can open it from there! Hurry up and open it!\nEdgeworth:\nWhy are you getting so excited?\nKay:\nWhat are you saying! Doesn't everyone get excited when they're opening a box?\nEdgeworth:\nI think that probably applies to you only...\n\n\n\n\nChess pieces on Chessboard\n\n\n\n\n\n\n\nKay:\nThese are chess pieces, right? I saw something similar in your office, Mr. Edgeworth. Huh? But the pieces here are black and white?\nEdgeworth:\nThose are the correct colors. My pieces were custom made.\nKay:\n\"Custom made\"... That sounds like treasure to me!\nEdgeworth:\n(Her eyes are sparkling... Does she intend to steal it?)\n(Connecting all possible Logic and examining body, rubber glove, chessboard, and hand leads to:)\nEdgeworth:\nWell. We've collected quite a bit of evidence.\nKay:\nHe he! With the three of us here, it's a piece of cake! Right, Gummy?\nGumshoe:\nThat's right, pal! We're the Invincible Trio!\nEdgeworth:\nIt's too early to start celebrating. There is still something we haven't found yet.\nGumshoe:\nEh? What haven't we found yet, sir?\nEdgeworth:\n(What is missing from this crime scene?)\nBloodstains\n\n\n\n\n\n\n\nEdgeworth:\nThis crime scene is missing bloodstains.\nGumshoe:\nHave you been overworking yourself lately, sir...? I can clearly see bloodstains over there!\nEdgeworth:\nHmm... I can see them as well. (I was too careless...)\nGumshoe:\nMr. Edgeworth! What's missing from the crime scene, sir?\nLeads back to:\n\"(What is missing from this crime scene?)\"\nFootprints\n\n\n\n\n\n\n\nEdgeworth:\nThis crime scene is missing footprints.\nKay:\nFootprints? It's true, I don't see any. But are footprints really that important to this case?\nEdgeworth:\n...Hmm. (They're not particularly important...) Kay, this crime scene is missing one more thing.\nKay:\nEh! What is it?\nLeads back to:\n\"(What is missing from this crime scene?)\"\nThe murder weapon\n\n\n\n\n\n\n\nLeads to:\n\"The murder weapon that took the victim's life has not been found yet.\"\nEdgeworth:\nThe murder weapon that took the victim's life has not been found yet.\nGumshoe:\nAh! Now that you mention it, you're absolutely right, sir!\nEdgeworth:\nDetective. Get your act together. Isn't that the most basic of the basics?\nGumshoe:\nUgh. I'm sorry, sir.\nKay:\nDon't worry about it, Gummy! I didn't notice it either!\nEdgeworth:\n(That's not much of a consolation.) In this prison, dangerous objects that could be used as weapons are strictly regulated. It'd be quite dangerous if the inmates got their hands on them... Obtaining a murder weapon and carrying it around is not an easy task.\nKay:\nI see! You have a point!\nEdgeworth:\n(What was the murder weapon? And where did it go? That could be the key to solving this case.)\n???:\nHuh? There are visitors here already? Sorry to barge in like this. Is this the crime scene?\nEdgeworth:\nYou're...!\n???:\nHuh? You... Aren't you... That piercing gaze... That furrowed brow...\nEdgeworth:\n...It has been a long time. Mr. Shields.\nRay:\nYes, yes. That frilly thing around your neck and that stiff greeting. There's no doubt about it! Prosecutor Manfred von Karma. Fancy meeting you here.\nEdgeworth:\n!\nGumshoe:\nWhat are you saying, pal! Mr. Edgeworth's not that old man!\nEdgeworth:\nDetective... It's fine.\nRay:\nOh it's you, Prosecutor Edgeworth. I thought you looked a bit young. He he he. You two are so similar. Looks like your Uncle Ray got you two mixed up again.\nEdgeworth:\n...You never change. How many years has it been since we last saw each other...\nRay:\nHmm. I've already forgotten. Your Uncle Ray has been overseas these past few years. But you know... There's something I still haven't forgotten. About you... and your betrayal.\nEdgeworth:\n......\nKay:\nI-I'm getting some bad vibes over here. Do you know this guy, Mr. Edgeworth?\nEdgeworth:\nAllow me to introduce him to you. Raymond Shields, attorney at law.\nRay:\nAce Attorney Ray Shields at your service. I'm pleased to make your acquaintance.\nGumshoe:\nI'm Detective Dick Gumshoe, sir.\nKay:\nKay Faraday. Nice to meet ya! I'm a Great Thief! Ah, but I'm currently on hiatus.\nRay:\nGreat Thief? Well, well. That sounds romantic, how wonderful!\nKay:\nOh! Mr. Shields, you get it, right? I'm currently recruiting new members! The registration forms are easy to fill out!\nRay:\nThat's splendid. Uncle Ray would love to join your little gang!\nKay:\nI'm sorry, but we're only accepting bright, cheerful, and energetic girls.\nRay:\nI see. That's too bad. Well, how about a hug then? As a sign of affection.\nKay:\n...No.\nRay:\nI guess not. He he he. This isn't Europe after all.\nEdgeworth:\nMr. Shields. What are you doing here?\nRay:\nOops. That's right! Sorry, sorry. Preventing the attorney from investigating the crime scene is the Von Karma way, isn't it?\nEdgeworth:\n........\nGumshoe:\nHey! You've been going on about Von Karma this and Von Karma that. What's your problem, pal!?\nEdgeworth:\nEdgeworth:\nDetective! Restrain yourself. This... can't be helped.\nGumshoe:\nEh...?\nEdgeworth:\nMr. Shields. Are you the defense attorney for Horace Knightley?\nRay:\nThat's right. Or should I say... I was his defense attorney.\nEdgeworth:\n(Mr. Shields is the defense attorney. If Knightley had not been murdered... ...I would have been going up against him in court... I should listen to what he has to say.)\nPartner\n\n\n\n\n\n\n\nKay:\nYeah, what's up?\n\n\n\nThe prison security (after talking about About this room)\n\n\n\n\n\n\n\nKay:\nJust as I thought, the security in the prison is very tight. Looks like... It won't be easy to break out of here.\nEdgeworth:\nInstead of breaking out of here, perhaps you should consider not entering in the first place.\nKay:\nIt's all because those sensors that detect the bracelets... Hmmm.\nEdgeworth:\n(She seems to be agonizing over it.)\nKay:\nHey, Mr. Edgeworth! Don't just space out like that! Help me think of a way out, Mr. Edgeworth!\nEdgeworth:\nWh-What. (Why must I do such a thing...!)\nBody\n\n\n\n\n\n\n\nEdgeworth:\n(I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\nRubber gloves (after clearing \"About this room\")\n\n\n\n\n\n\n\n\nEdgeworth:\nThe rubber gloves used by the inmates... It's unnatural for one to the end up in this place. This is in direct contradiction with the evidence.\nKay:\nEh? Why is that?\nEdgeworth:\nFrom what we just heard about the inner workings of the prison... The rubber gloves used by the inmates should not be present in this room. (Let me present some evidence to support my reasonings...)\n\n\n\n\nDeduce\n\n\n\n\n\n\n\nEdgeworth:\n(Is this spot somehow connected to any of the evidence I hold...?)\n\n\n\nDeduce rubber glove and present Door Sensor\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"The inmates cannot freely enter this room.\"\n\n\n\n\nOtherwise\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThis piece of evidence shows the contradiction with the crime scene!\nKay:\nCould you be more precise about where the contradiction is?\nEdgeworth:\nUmm... Around here somewhere...\nGumshoe:\nPlease be more specific, sir!\nEdgeworth:\nMm... Mmph! (There is something in this room that should not exist. Do I have the evidence to support this claim?)\nRaymond Shields\n\n\n\n\n\n\n\n\n\nDefense attorney\n\n\n\n\n\n\n\nEdgeworth:\nSince you received the request to represent the victim, that must mean...\nRay:\nYes. Your Uncle Ray was supposed to meet with Knightley-boy.\nEdgeworth:\nAs was I. I had planned to meet with him, but then we heard the report of the dead body...\nRay:\nI even brought him a California roll.\nEdgeworth:\nMr. Shields... You can't bring food into the detention center.\nRay:\nAh. Is that right? Well then, would you like it?\nEdgeworth:\nNo thanks.\nRay:\nHmm... Still, to think that Prosecutor Edgeworth actually meets with the defendants. All defendants are guilty, wasn't that the Von Karma way?\nEdgeworth:\n...That is a thing of the past.\nRay:\nHeh. Is that right? So... You sure you don't want it?\nEdgeworth:\nI-I told you, I don't want it.\n\n\n\n\nThe victim (appears after Defense attorney)\n\n\n\n\n\n\n\nEdgeworth:\nDid you meet with Knightley?\nRay:\nHe he. We met yesterday. They called me over as soon as Knightley-boy was arrested. He was being quite hostile. Oh yeah... He mentioned you. He talked about how you interfered with his plans.\nEdgeworth:\n(He probably said some nasty things about me. Even if he hates me, I'm fine with it...)\nRay:\nMan, the two of us had a great time talking about you!\nEdgeworth:\nM-Mr. Shields, you also talked about me...?\nRay:\nI frequent the visitor's room here quite often... It's been a while since I had such a good time!\nKay:\nHeh, so you're a regular at this prison!\nRay:\nHey, now. Don't get the wrong idea. I'm not here as an inmate. I'm here to visit an old acquaintance of mine. We usually meet in the visitor's room, but I've also been in here before.\nEdgeworth:\n(Then... I should ask him about this room.)\n\n\n\n\nAbout this room (appears after The victim)\n\n\n\n\n\n\n\nEdgeworth:\nThis room... was where the body was found. Do you know anything about it?\nRay:\nAh, this room, eh? Here's a pop quiz for our prodigy prosecutor. Which one of these three is the name of this room?\n\n\n\nThe Lecture Room\n\n\n\n\n\n\n\nEdgeworth:\n...The Lecture Room?\nRay:\nSo they tied up Knightley-boy and lectured him to death? As expected of Prosecutor Edgeworth! You sure have an eye for the details!\nLeads to:\n\"Well, let's reveal the correct answer! Prosecutor Edgeworth's answer is...\"\n\n\n\n\nThe Morgue\n\n\n\n\n\n\n\nEdgeworth:\n...The Morgue?\nRay:\nHmmm... Well, there is a dead body in here! Anyone who saw the dead body would naturally think of the same thing!\nLeads to:\n\"Well, let's reveal the correct answer! Prosecutor Edgeworth's answer is...\"\n\n\n\n\nThe Entertainment Room\n\n\n\n\n\n\n\nEdgeworth:\n...The Entertainment Room?\nRay:\nWow! Prosecutor Edgeworth sees this place as an Entertainment Room! And why not! There are plenty of toys here!\nLeads to:\n\"Well, let's reveal the correct answer! Prosecutor Edgeworth's answer is...\"\n\n\nRay:\nWell, let's reveal the correct answer! Prosecutor Edgeworth's answer is... Wrong! The correct answer is the Workroom.\nEdgeworth:\n... (All three choices were wrong. I hate it when he does that.)\nRay:\nThe inmates carry out various kinds of prison labor in here. It also serves as a rehab program, allowing them to receive job training in prison.\nEdgeworth:\nSo... How do they monitor this room? Who is in charge of the keys to the entrance?\nRay:\nProsecutor Edgeworth. Even your Uncle Ray doesn't have all the answers. Hey. You there, could you tell us?\nGuard:\nYes, sir! This room doesn't use any locks and keys! Instead of locks, the doors are equipped with sensors.\nEdgeworth:\nWhat do you mean by that?\nGuard:\nAll of the prison inmates are wearing electronic bracelets! When a bracelet passes through the door, it activates the sensor and... *wiii-uuu, wiii-uu, wiii-uu* ...An alarm will sound. After a certain amount of time has passed, the bracelet will emit a painful shock! If the bracelets are tampered with... it will emit an electric shock three times more powerful.\nKay:\nEeehh! Th-That's terrifying!\nEdgeworth:\n(It's to ensure that the inmates follow the rules. Although it seems a bit harsh.)\nGuard:\nThat's why whenever an inmate goes through a door, a guard has to accompany them... ...to deactivate the sensor first.\nRay:\n...And that's that.\nEdgeworth:\nDid any of the inmates use this workroom today?\nGuard:\nIn the past few days no one has used this room. I'm sure of it.\nEdgeworth:\n(So not one inmate has entered this room today...)\nDoor Sensor data jotted down in my Organizer.\nEdgeworth:\n(If that's the case... ...it raises a contradiction with the crime scene. There is something in this crime scene that should not exist... I will use my powers of deduction and inspect the crime scene again...)\n\n\n\n\nAbout this room (subsequent times)\n\n\n\n\n\n\n\nRay:\nThis room is the inmate's workroom.\nEdgeworth:\nThe doors are equipped with sensors, in order to prevent the inmates from escaping.\nRay:\nIf they try to escape from the room, an alarm will sound. \"wiii-uu, wiii-uu, wiii-uu, wiii-uu* The alarm has not gone off once today...\nEdgeworth:\n(So, not one inmate has entered this room today... This raises a contradiction with the crime scene. There is something in this crime scene that should not exist... I will use my powers of deduction and inspect the crime scene again...)\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nProsecutor's Badge\n\n\n\n\n\n\n\nRay:\nHuh, are you giving this to me? I'm thrilled! A prosecutor's badge might make me more popular than my attorney's badge. Thanks for the present!\nEdgeworth:\nNo, I never said a word about giving it to you.\nRay:\nHe he he. That was just a joke. Uncle Ray has his own badge.\nEdgeworth:\nYour attorney's badge... You don't wear it on your clothes?\nRay:\nHmm... In the winter, I wear it on my favorite coat. Your Uncle Ray only wears it on his \"Victory clothes\".\nEdgeworth:\n(What kind of \"Victory\" is he talking about...)\n\n\n\n\nCrime Scene Notes or Chessboard\n\n\n\n\n\n\n\nRay:\nKnightley-boy seemed to enjoy playing chess.\nEdgeworth:\nYes. Had we met under different circumstances, I would've liked a chance to play against him...\nRay:\nI see. Your Uncle Ray's not so great with these mental games.\nEdgeworth:\nHmph, you must be joking. I've never been able to beat you once in a chess game.\nRay:\nWell, that... was in the past. Against the famous prodigy Prosecutor that you are now, I wouldn't stand a chance.\nEdgeworth:\n...Let's just leave it at that. (He's never been one to easily show his hand...)\n\n\n\n\nAnything else\n\n\n\n\n\n\n\nRay:\nAh, Ah-hah, this, eh. This evidence holds the so-called key to the case, right?\nEdgeworth:\nErr... It's possible.\nRay:\nYup. Then, hold on to it closely. Hurry, hurry, put it away!\nEdgeworth:\n(...He doesn't think much about this.)\nEdgeworth:\nThe inmates cannot freely enter this room. As they're wearing bracelets that set off the sensors. According to the guard, it seems that no inmates were scheduled to enter this room today. However, a rubber glove used by the inmates was left in here. That is a direct contradiction!\nGumshoe:\nThen, who left this rubber glove in here, sir?\nEdgeworth:\nI don't know... yet. However, it seems that this rubber glove is connected to our case.\nInvestigation Complete\nEdgeworth:\nGuard! Aside from the inmates and prison guards, does anyone else have access to the room?\nGuard:\nUmm. Well, this is a prison facility after all. Only inmates and prison guards come here...\nEdgeworth:\nMr. Shields...?\nRay:\nHe he he. What are you saying? There are others that come in here. Aside from inmates and prison guards, there are certain things that can enter this room.\nGuard:\n! Are you talking about them? But. They're...\nEdgeworth:\nMr. Shields! What are these \"things\" that you speak of?\nRay:\nIt should be obvious. You came all the way here without seeing one, Prosecutor Edgeworth? Usually you can find them walking around the prison facility... Well, you'll see once you leave this room, Prosecutor Edgeworth.\nGumshoe:\nHey! You're just saying that to get Mr. Edgeworth to leave, pal!\nRay:\nWhat now? Don't you trust me? Mr. Detective. You have a big body, but a small mind.\nGumshoe:\nWhat did you say, pal!\nEdgeworth:\nEdgeworth:\nDetective Gumshoe!\nGumshoe:\nUgh... S-Sorry, sir.\nRay:\nCome on. Follow me. I'll show you what Uncle Ray has been talking about.\nMarch 27, 11:06 AMPrisonHallway\nRay:\nThis place is a little different from your normal prison. There are more than just the prisoners and guards living here.\nEdgeworth:\nAnimals...!\nRay:\nYep, animals. According to the guard... ...they introduced animal therapy here several years ago. Each prisoner is assigned one animal. In other words, they receive a pet partner.\nKay:\nHuh! That... seems kinda fun!\nRay:\nPlus, learning to take care of their pet is a great qualification to have.\nKay:\nAh! So you mean that workroom!\nRay:\nYep. That's where the prisoners practice taking care of their pets.\nGumshoe:\nS-So then, the \"thing\" you mentioned, that could enter the crime scene is...\nRay:\nRight. These animals.\nGumshoe:\nBut that doesn't make any sense, pal! Why would an animal leave behind a rubber glove!?\nRay:\nHe he he. Quite right. But the fact remains that they could have entered the crime scene.\nGumshoe:\nMr. Edgeworth! Can you please talk some sense into this man!\nEdgeworth:\nMr. Shields, are the animals allowed to go wherever they please?\nRay:\nMost of the doors in this prison are fitted with sensors. The sensors not only sound an alarm in response to the prisoners' bracelets. They also respond to the animal's \"microchip\" and open the doors for them.\nKay:\nMicrochip?\nRay:\nIt's like a tiny machine embedded under the animal's skin. All it takes is a simple injection, \"psh!\", and the microchip is inserted.\nKay:\nWhaaaa! Th-That sounds painful...\nRay:\nI've heard it's not that painful... But, anyway. Since the animals aren't criminals, they are allowed to move around freely.\nEdgeworth:\n(How ironic... The ones with the most freedom in this prison are the animals...)\nDoor Sensor data updated in my Organizer.\nRay:\nBut still, they can't go out of the prison. The prison's entrance does not have a sensor. .....Oh?\nEdgeworth:\nHm? (What's that? Is that a bell...?)\nGumshoe:\nWh-What's that?\n........\nEdgeworth:\n(Wh-What's this... This dog? It has a bell on its collar... Was this the sound that we heard earlier?) ........\n........ Ruff! Ruff! Ruff! Ruff! Ruff! Ruff! Ruff! Ruff! Ruff! Ruff! Ruff! Ruff! Ruff! Ruff!\nKay:\nMr. Edgeworth! Why are you glaring at each other?\nEdgeworth:\n(...I mustn't lose!)\nGumshoe:\nMr. Edgeworth, you're not good with dogs, are you, sir? I'll tame that dog myself! Here boy, here boy! It completely ignored me, sir...\nEdgeworth:\n(Compared to the other animals, there's something different about this one. I'm sensing a great hostility towards me only...)\nRay:\nWell, now that I've introduced you to the animals... What's next on the agenda?\nGumshoe:\nOf course, we question those related to the case, pal!\nEdgeworth:\nYes. We should gather information about the state of things when the body was discovered.\nGumshoe:\nWe'll start with... you in that cell! Tell us what you know!\nPrisoner:\n........\nGumshoe:\nH-He's completely ignoring me, sir...\nEdgeworth:\nY-You there. Do you know anything about the incident?\nPrisoner:\n........\nKay:\nUuugh... H-He's scary!\nRay:\nHe he he. Don't be so cold. Come on, you can talk to us. Or, how about an introductory hug?\nPrisoner:\n.....It's... time.\nEdgeworth:\n! (Wh-What was that?)\nRay:\nS-Sorry. Was Uncle Ray's joke a little too much?\nPrisoner:\n........ ......Exercise time.\nEdgeworth:\n(This man... is clearly odd! I need to get some answers from him.) Your... name is?\nElbird:\nMe... I'm prisoner number D-259. Jay Elbird. ...Gotta raise my metabolism. I can't let my muscles rest.\nEdgeworth:\nMuscles aside, it looks like you've lost a lot of weight.\nElbird:\nHalf of the match is won even before it has begun. Yeah... Gotta make the weight limit.\nGumshoe:\nErr... Are you entering some kind of tournament? Ah! Perhaps as a boxer!\nElbird:\nYeah, I'm a former boxer, but exercise is just... a hobby of mine.\nKay:\nWell then, it sure looks like it's the bear's hobby too! Hee hee... He's hanging on like an apron. So cute!\nElbird:\nThis is Rocky the polar bear. He's my partner.\nEdgeworth:\n(He's loosened his tongue. Maybe we can try asking him now...) Where were you and Rocky at the time of the incident.\nElbird:\n......I don't know anything. I got nothing to say to you.\nEdgeworth:\nThat's for me to decide. Now, answer the question.\nElbird:\nD-Didn't I just tell you? I know nothing!\nEdgeworth:\n(Nngh... He has no intention of talking.)\nKay:\nIn that case, you've got no choice but to use \"that\"!\nEdgeworth:\nYes. If he insists he has nothing to do with this, we'll just have to prove there's a connection. Mr. Elbird, by all means, you WILL tell us what you know.\nElbird:\n...........\nEdgeworth:\nNow... Let's analyze the situation.\n2 CHESS PIECES\nEdgeworth:\n(A fighting stance... It seems that he has become agitated. In these circumstances, a direct confrontation would be pointless.) When my opponent becomes agitated, I should calmly wait and see... When I see an opening, I will not hold back! Now, let's question him about his knowledge of the incident. To start with, I'll ask about his movements today. I'll have to tire him out before the sound of the bell!\nBegin Logic Chess\nWhat did you do today?\n\n\n\n\n\n\n\nLeads to:\n\"Can you tell me what you have done today?\"\nEdgeworth:\nCan you tell me what you have done today?\nElbird:\n......\nEdgeworth:\nA-Answer me!\nElbird:\nHuh? If you wanna fight with me... Get into your fighting stance!\nI'll show you my straight right!\n\n\n\n\n\n\n\nEdgeworth:\nHaven't you realized it yet? I have you cornered!\nElbird:\nRocky, you hearing this? I got no time for jibber-jabber. Wanna eat a knuckle sandwich?\nEdgeworth:\n(Argh... That was a wasted remark.) When he gets worked up, he enters his fighting stance. During those times, I should calmly \"wait and see\"... And strike when he drops his guard.\nLeads back to first\nWait and see.\n\n\n\n\n\n\n\nLeads to:\n\".........\"\nEdgeworth:\n.........\nElbird:\nWhat, are you throwing in the towel already?\nEdgeworth:\nThis is not a fist fight. Welcome to the war that is chess. By the way... Hasn't all that moving around tired you out?\nElbird:\nDon't underestimate my stamina! You wanna test me? With that body of yours!\nFine, I'll be your opponent!\n\n\n\n\n\n\n\nEdgeworth:\nHaven't you realized it yet? I have you cornered!\nElbird:\nRocky, you hearing this? I got no time for jibber-jabber. Wanna eat a knuckle sandwich?\nEdgeworth:\n(Argh... That was a wasted remark.) When he gets worked up, he enters his fighting stance. During those times, I should calmly \"wait and see\"... And strike when he drops his guard.\nLeads back to first\nWait and see.\n\n\n\n\n\n\n\nLeads to:\n\".....\"\nEdgeworth:\n.....\nElbird:\nI ain't tired at all. Well, first off... I held back in my training today. I just stayed quietly in my cell.\nEdgeworth:\nQuietly? Then what's with all that sweat?\nElbird:\n...B-Buzz off! That's all I've got to say. I'm getting a little tired...\nDidn't you stay quietly in your cell?\n\n\n\n\n\n\n\nLeads to:\n\"You're a well-trained boxer...\"\nWait and see.\n\n\n\n\n\n\n\nEdgeworth:\n...........\nElbird:\nIf you don't wanna fight, get outta the ring!\nEdgeworth:\nMmph... I was too passive... When he gets worked up, he enters his fighting stance. During those times, I should calmly \"wait and see\"... And strike when he drops his guard.\nLeads back to first\nEdgeworth:\nYou're a well-trained boxer... However, you need more practice in the art of lying. Getting a little tired? That's not possible! You said that you stayed quietly in your cell just a moment ago!\n1 PIECE BROKEN\nElbird:\n...! Rocky. It looks like this is gonna be a tough opponent.\nEdgeworth:\nThis man... It looks like he's still hiding something. Next, I'll ask him about the time of the incident. I do not need to use fists. My words alone are enough for a K.O.!\nWhat were you doing at the time of the incident?\n\n\n\n\n\n\n\nEdgeworth:\nDo you recall what you were doing at the time of the incident?\nElbird:\n...Sleeping. Rocky was too.\nEdgeworth:\nThe incident happened just a few moments ago. You look wide awake to me.\nElbird:\n......\n\n\n\nAnswer me!\n\n\n\n\n\n\n\nEdgeworth:\nHaven't you realized it yet? I have you cornered!\nElbird:\nRocky, you hearing this? I got no time for jibber-jabber. Wanna eat a knuckle sandwich?\nEdgeworth:\n(Argh... That was a wasted remark.) When he gets worked up, he enters his fighting stance. During those times, I should calmly \"wait and see\"... And strike when he drops his guard.\nLeads back to first\n\n\n\n\nWait and see.\n\n\n\n\n\n\n\nLeads to:\n\"........\"\n\n\nEdgeworth:\n........\nElbird:\nMuscles strengthen while they're resting. Sleep is important.\nEdgeworth:\nWell then, I'm sorry to have woken you. Rest is a part of training... Right?\nElbird:\n...O-Oh? ...S-So you get it after all. Not bad, Mr. Prosecutor.\n\n\n\nHow did you know I'm a prosecutor?\n\n\n\n\n\n\n\nLeads to:\n\"...Oh?\"\n\n\n\n\nWait and see.\n\n\n\n\n\n\n\nEdgeworth:\n...........\nElbird:\nIf you don't wanna fight, get outta the ring!\nEdgeworth:\nMmph... I was too passive... When he gets worked up, he enters his fighting stance. During those times, I should calmly \"wait and see\"... And strike when he drops his guard.\nLeads back to first\n\n\nEdgeworth:\n...Oh? I don't recall ever introducing myself as a prosecutor. How did you know?\nElbird:\nTh-That's...!\nEdgeworth:\nThe conversation we had when we first entered this room... Were you, by any chance, eavesdropping on us? In that case, there's no way you could have been asleep! You lied to us!\nElbird:\n...! You got me there. You pack a nice punch. Yeah, I lied about sleeping. So what? I was just exercising in this room. You got a problem with that?\nEdgeworth:\n(Well, I now know he was awake. I should remember this clue.)\nLeads back to first\nWhat were you doing at the time of the incident? (after clearing this option)\n\n\n\n\n\n\n\nEdgeworth:\nI've run this line of questioning to its conclusion... Let's try another line of attack.\nLeads back to first\nDid you notice anything during the incident?\n\n\n\n\n\n\n\nEdgeworth:\nWhen the incident occurred, did you notice anything unusual about the prison?\nElbird:\n.....Huh?\n\n\n\nAre you tired already?\n\n\n\n\n\n\n\nEdgeworth:\nHaven't you realized it yet? I have you cornered!\nElbird:\nRocky, you hearing this? I got no time for jibber-jabber. Wanna eat a knuckle sandwich?\nEdgeworth:\n(Argh... That was a wasted remark.) When he gets worked up, he enters his fighting stance. During those times, I should calmly \"wait and see\"... And strike when he drops his guard.\nLeads back to first\n\n\n\n\nAnswer the question!\n\n\n\n\n\n\n\nLeads to:\n\"Answer the question! What was the situation like at the time of the incident!\"\n\n\n\n\nWait and see.\n\n\n\n\n\n\n\nEdgeworth:\n...........\nElbird:\nIf you don't wanna fight, get outta the ring!\nEdgeworth:\nMmph... I was too passive... When he gets worked up, he enters his fighting stance. During those times, I should calmly \"wait and see\"... And strike when he drops his guard.\nLeads back to first\n\n\nEdgeworth:\nAnswer the question! What was the situation like at the time of the incident!\nElbird:\nSorry, but I got no answers for you. I was asleep then. Rocky was too.\n\n\n\nBefore obtaining clue\n\n\n\n\n\n\n\nEdgeworth:\nI don't have enough clues to proceed with this line of questioning. Maybe I should try another line of attack...\nLeads back to first\n\n\n\n\nAfter obtaining clue\n\n\n\n\n\n\n\nLeads to:\n\"Let's try using that clue...\"\nEdgeworth:\nLet's try using that clue...\nWeren't you exercising?\n\n\n\n\n\n\n\nLeads to:\n\"Stop telling such an obvious lie!\"\nWait and see.\n\n\n\n\n\n\n\nEdgeworth:\n...........\nElbird:\nIf you don't wanna fight, get outta the ring!\nEdgeworth:\nMmph... I was too passive... When he gets worked up, he enters his fighting stance. During those times, I should calmly \"wait and see\"... And strike when he drops his guard.\nLeads back to first\nEdgeworth:\nStop telling such an obvious lie! Didn't you admit it earlier? You were exercising...!\nElbird:\nTsk... Looks like I just ate a counter.\nEdgeworth:\nYour back's against the ropes and there's no way out. Just confess already!\nElbird:\n...! H-Hey, quiet down a bit. If outsiders like you make a racket, you'll frighten the animals again.\nWhat do you mean by \"outsiders\"?\n\n\n\n\n\n\n\nEdgeworth:\nHaven't you realized it yet? I have you cornered!\nElbird:\nRocky, you hearing this? I got no time for jibber-jabber. Wanna eat a knuckle sandwich?\nEdgeworth:\n(Argh... That was a wasted remark.) When he gets worked up, he enters his fighting stance. During those times, I should calmly \"wait and see\"... And strike when he drops his guard.\nLeads back to first\nWhat do you mean by \"again\"?\n\n\n\n\n\n\n\nLeads to:\n\"You've been persistent. However, I'm afraid you're about to hit the mat.\"\nWait and see.\n\n\n\n\n\n\n\nEdgeworth:\n...........\nElbird:\nIf you don't wanna fight, get outta the ring!\nEdgeworth:\nMmph... I was too passive... When he gets worked up, he enters his fighting stance. During those times, I should calmly \"wait and see\"... And strike when he drops his guard.\nLeads back to first\nEdgeworth:\nYou've been persistent. However, I'm afraid you're about to hit the mat. You said \"again\" just now. Did something happen earlier? To frighten the animals!?\n1 PIECE BROKEN\nElbird:\nGyaaaaaaaaaaaah! D-Dammit...! How could I have gotten sucker punched like that! Y-Yeah... There was this great scream back then. It startled the animals. Dang! I would never have lost in a real ring!\nEdgeworth:\nHmph... Checkmate.\nLogic Chess Complete\nEdgeworth:\nI believe this proves that you do know something about the case.\nElbird:\n.......Damn. OK, I'll talk, I'll talk!\nKay:\nYou did it, Mr. Edgeworth!\nEdgeworth:\nDon't lose focus, Kay. The real game has just begun.\nRay:\nLet's just stop for a moment. Uncle Ray's got one important thing to say. It must be fate that has brought us together after all these years. I have received the opportunity to observe your skills carefully. And... ...I'll be giving a detailed report to \"that person\" about how much you've grown.\nEdgeworth:\n........\nKay:\nErr... Who is \"that person\"?\nRay:\nYou didn't know? The truth is...\nEdgeworth:\nEdgeworth:\nThis doesn't concern Kay. She doesn't need to know!\nRay:\nWhoa there. You scared me. Don't get so worked up.\nEdgeworth:\nYou can do what you like. It doesn't matter to me.\nRay:\n...How you have been leading your life ever since you were tainted by the Von Karma way... I'm sure \"that person\" would be interested. I feel that it's my duty to report it to him. I'll expose your mistakes here, I won't let you disappoint him any further.\nKay:\nM-Mr. Edgeworth... Just what are you guys talking about?\nEdgeworth:\nDon't concern yourself with it. Our only opponent now is Elbird. Well then, let's hear it. What do you know about the case?\nElbird:\n...You're gonna be sorry.\n-- About the Incident --\nElbird:\nRecreation time ended around 10 AM.\nI returned to this room and went straight to my training.\nJust as I'd counted to two, I heard a voice shout out, \"AAARGH! I've been stabbed!\"\nIt sounded like someone in pain, calling out for help. But...\nI couldn't do anything since I was locked up in my cell. So, I went back to my training.\nEdgeworth:\n...That's odd. You really weren't bothered by that shout?\nElbird:\nEven if I was, there was nothing I could do. Look out for number one before you look out for others. That's the basic rule in prison.\nRay:\nIndeed. Even if he wanted to take a look he'd still be locked in his cell.\nEdgeworth:\nIs all that training equipment yours? You seem to have quite a collection.\nElbird:\nI get them from the Supplier.\nKay:\nSupplier...?\nElbird:\nYou can get just about anything if you put in an order. It's our secret shop.\nRay:\nThat's quite convenient. So, if Uncle Ray wanted a cute girl...\nEdgeworth:\nIn that case, you should order a book on how to give testimony. Hmph... Because I'm going to knock you down for the count in one hit.\nElbird:\nYou're gonna K.O. me? Stop kidding around...!\nRay:\nHeeey... Don't ignore your Uncle Ray!\n\nEdgeworth: Edgeworth: Recreation time? Elbird: There are \"people from the outside\" who come here... And sing and dance, to entertain the \"people on the inside\". Kay: That's great! That does sound like fun! Edgeworth: And you participated in this event? Elbird: There are few opportunities to mingle with the outsiders. After recreation time ended, I...\nEdgeworth: Edgeworth: So, what exactly does your training entail? Elbird: To build up stamina and rhythm... I jump rope. Kay: Whaaaaa! In such a small room!? Isn't that dangerous for Mr. Bear... I mean, Rocky? Elbird: Rocky's a smart one. When he sees me grab my rope, he clings to my chest. Edgeworth: You're able to jump rope, while holding a bear...? Elbird: He's a weight I'll gladly bear. Rocky's... my best partner. So, today I started my jump rope routine as usual. However...\nEdgeworth: Edgeworth: Could you describe that voice for me? Elbird: It was the voice of someone whose life was in peril. ...I could tell. Ray: R-Really. That's no laughing matter. Edgeworth: And this voice, you heard it quite clearly? Elbird: ...You've never heard the scream of a cornered man before? I told you. The man was screaming for his life. Of course I heard it clearly.\nEdgeworth: Edgeworth: Was that all? Did he say anything else? Elbird: ...That was all. He didn't say anything important after that. Edgeworth: That's for me to decide. I'd like to hear it, if you please. Elbird: ...If you really want to know that badly, how about I recreate the scene for you right now? Ray: Nonononono! Sorry, that was a stupid thing to ask. Miles, you should apologize too! Edgeworth: (This point is vital... I'd like to clarify it if possible.) Ray: Come on! Please bear with us, for Uncle Ray's sake! OK! Elbird: ...Hmph. Anyhow, I heard the voice, but...\nEdgeworth: Edgeworth: You were able to concentrate on your training after that scream? Elbird: If I were on the \"outside\", I'd probably go over and take a look out of curiosity... However, inside this stupid cell, I'd have to get permission to go anywhere. Kay: Have you considered breaking out of prison? Edgeworth: That sounds more like something you'd try to do.\nKay: If this place wasn't a prison, Mr. Knightley might have been able to get help.\nEdgeworth: I don't believe he could have been saved.\nKay: Eh! But, what if someone had come running to his aid...!\nEdgeworth: (Elbird is clearly lying. But... what possible reason would he have to do this? To find out, I'll have to point out the contradiction.)",
      "testimonies": [
        {
          "testimony": "Recreation time ended around 10 AM.",
          "person": "Elbird",
          "present": []
        },
        {
          "testimony": "I returned to this room and went straight to my training.",
          "person": "Elbird",
          "present": []
        },
        {
          "testimony": "Just as I'd counted to two, I heard a voice shout out, \"AAARGH! I've been stabbed!\"",
          "person": "Elbird",
          "present": [
            "Autopsy Report"
          ],
          "source": {
            "evidence_span": "the cause of death was a stab wound to the neck, inflicted by a sharp blade. Death was instantaneous",
            "testimony_span": "I heard a voice shout out, \"AAARGH! I've been stabbed!\"",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "It sounded like someone in pain, calling out for help. But...",
          "person": "Elbird",
          "present": [
            "Autopsy Report",
            "Mr. Knight's Body"
          ],
          "source": {
            "evidence_span": [
              "the cause of death was a stab wound to the neck, inflicted by a sharp blade. Death was instantaneous",
              "Stab wound to the throat. Death would have been instant."
            ],
            "testimony_span": "It sounded like someone in pain, calling out for help.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "I couldn't do anything since I was locked up in my cell. So, I went back to my training.",
          "person": "Elbird",
          "present": []
        }
      ],
      "summarizedContext": "The witness Elbird describes when he heard the crime.",
      "noPresent": false,
      "labels": [
        "behavioral"
      ],
      "reasoning": [
        "Fact 1: The witness claims he heard the victim scream when stabbed.",
        "Fact 2: The evidence suggests the victim was stabbed in the neck and died instantly.",
        "Prop 1: If a person is stabbed in the neck and dies instantly, they cannot scream."
      ]

    },
    {
      "category": "rebuttal",
      "newContext": "-- About the Incident --\nElbird:\nRecreation time ended around 10 AM.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nRecreation time?\nElbird:\nThere are \"people from the outside\" who come here... And sing and dance, to entertain the \"people on the inside\".\nKay:\nThat's great! That does sound like fun!\nEdgeworth:\nAnd you participated in this event?\nElbird:\nThere are few opportunities to mingle with the outsiders. After recreation time ended, I...\nElbird:\nI returned to this room and went straight to my training.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nSo, what exactly does your training entail?\nElbird:\nTo build up stamina and rhythm... I jump rope.\nKay:\nWhaaaaa! In such a small room!? Isn't that dangerous for Mr. Bear... I mean, Rocky?\nElbird:\nRocky's a smart one. When he sees me grab my rope, he clings to my chest.\nEdgeworth:\nYou're able to jump rope, while holding a bear...?\nElbird:\nHe's a weight I'll gladly bear. Rocky's... my best partner. So, today I started my jump rope routine as usual. However...\nElbird:\nJust as I'd counted to two, I heard a voice shout out, \"AAARGH! I've been stabbed!\"\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nCould you describe that voice for me?\nElbird:\nIt was the voice of someone whose life was in peril. ...I could tell.\nRay:\nR-Really. That's no laughing matter.\nEdgeworth:\nAnd this voice, you heard it quite clearly?\nElbird:\n...You've never heard the scream of a cornered man before? I told you. The man was screaming for his life. Of course I heard it clearly.\nPresent Crime Scene Notes\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Mr. Elbird. Can you hear my voice clearly?\"\nElbird:\nIt sounded like someone in pain, calling out for help. But...\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nWas that all? Did he say anything else?\nElbird:\n...That was all. He didn't say anything important after that.\nEdgeworth:\nThat's for me to decide. I'd like to hear it, if you please.\nElbird:\n...If you really want to know that badly, how about I recreate the scene for you right now?\nRay:\nNonononono! Sorry, that was a stupid thing to ask. Miles, you should apologize too!\nEdgeworth:\n(This point is vital... I'd like to clarify it if possible.)\nRay:\nCome on! Please bear with us, for Uncle Ray's sake! OK!\nElbird:\n...Hmph. Anyhow, I heard the voice, but...\nPresent Crime Scene Notes\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Mr. Elbird. Can you hear my voice clearly?\"\nElbird:\nI couldn't do anything since I was locked up in my cell. So, I went back to my training.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou were able to concentrate on your training after that scream?\nElbird:\nIf I were on the \"outside\", I'd probably go over and take a look out of curiosity... However, inside this stupid cell, I'd have to get permission to go anywhere.\nKay:\nHave you considered breaking out of prison?\nEdgeworth:\nThat sounds more like something you'd try to do.\nKay:\nIf this place wasn't a prison, Mr. Knightley might have been able to get help.\nEdgeworth:\nI don't believe he could have been saved.\nKay:\nEh! But, what if someone had come running to his aid...!\nEdgeworth:\n(Elbird is clearly lying. But... what possible reason would he have to do this? To find out, I'll have to point out the contradiction.)\nEdgeworth:\nMr. Elbird. Can you hear my voice clearly?\nElbird:\nWhy you... You mocking me?\nEdgeworth:\nThe victim received a fatal blow to the throat. Which means... he couldn't possibly have screamed.\nElbird:\n!\nEdgeworth:\nSo, why did you hear a nonexistent scream?\nElbird:\nTh-That's...! There should have been a scream...\nEdgeworth:\nThere should have been one?\nElbird:\nDang it! I oughta rip that smug look off your face! Yeah. You're right! I never heard a scream! The one who heard it was the guy in the next cell!\nEdgeworth:\n(The next cell...?)\nKay:\nUhh, the next cell...\nPrisoner:\nAh? What's up? Yeah, I heard the scream. Recreation time had just ended. It happened after we returned to our cells. So then, I tell that guy, \"I heard a great scream.\"\nEdgeworth:\nCan you describe that scream for me?\nPrisoner:\nSure, I never told that guy about the contents of the scream though... \"AIEEEEEEEEEE! Someone! Come quickly! A man's been...!\" Something like that.\nRay:\nHmm. So, it wasn't the victim...\nEdgeworth:\n...but rather, it was the first person to discover the body who screamed.\nKay:\nI see! That solves that mystery! So, there was nothing wrong with Mr. Elbird's testimony!\nEdgeworth:\n(Is that really true? Or is there still a problem with Elbird's testimony...)\nThere is a problem\n\n\n\n\n\n\n\nLeads to:\n\"No... In this case, a new problem has presented itself.\"\nThere is no problem\n\n\n\n\n\n\n\nEdgeworth:\nIndeed. There is no problem with Mr. Elbird's testimony.\nRay:\nAre you sure?\nEdgeworth:\nHmm.\nRay:\nJay Elbird's neighbor heard the scream, right? So then, why didn't Elbird hear it himself?\nEdgeworth:\nNgh! (Looks like I need to think this over again.)\nKay:\nWhat's the matter, Mr. Edgeworth? Is there really a problem with Mr. Elbird's testimony?\nLeads back to:\n\"(Is that really true? Or is there still a problem with Elbird's testimony...)\"\nEdgeworth:\nNo... In this case, a new problem has presented itself. Mr. Elbird, why did you not hear the scream?\nGumshoe:\nIt's odd that he didn't hear the scream, sir! Hey you! Why didn't you hear the scream, pal!\nElbird:\n.......... Guaaaaaaaaah!\nGumshoe:\nAieeeeeeeee!\nElbird:\n...... ...You guys, do you suspect me? I was shut up in this stupid cell the whole time... How could I have killed someone in the workroom?\nGumshoe:\n! Th-That... would be impossible, wouldn't it?\nPrisoner:\nYeah! None of us could've killed him! If we could've killed him, we would've already killed you guys by now!\nGumshoe:\nAieeeeee!\nElbird:\nYou guys, don't think you're going to get out of this prison alive...!\nEdgeworth:\n(I nearly forgot... Despite being locked inside cages, these guys are still dangerous criminals!)\nRay:\nHe he... Looks like we got ourselves in a pretty bad situation here.\nEdgeworth:\n(What can I do? I can't talk to them in these circumstances!)\n???:\nGumshoe:\nWh-Who was that?\n???:\n...Please be silent.\nElbird:\nWhat? Who're you? Can't you see we're busy here!\n???:\nSilence is golden.\nElbird:\nWh-What the...\n???:\nNow, your hands. You shall remain silent while under the judgment of the law. You should be thankful. You get to live your life without the need of money. You are to receive the blessings of the Goddess of Law. Guard. ...If you would please.\nGuard:\nCongratulations. You get to spend the night in the disciplinary room.\nElbird:\nEh...! Th-That's! N-No! Not there! Anywhere but there!\n???:\nAccept this wonderful blessing! Let your heart be reborn! Cast away your sins!\nElbird:\nStop it! Noooooooooo!\n???:\nOh, Goddess of Law. Give this man your blessings. ...I thank thee.\nEdgeworth:\nYou are...?\nGravelle:\nMy name is Verity Gravelle. I am privileged to be a Judge... An emissary of the strength of the law.\nEdgeworth:\nA judge, you say? Why are you here?\nGravelle:\nProsecutor Edgeworth... I came to meet with you personally. I convey the will of the Prosecutorial Investigation Committee. That is my appointed task.\nKay:\nProsecutorial Investigation Committee? What's that?\nGravelle:\nDo not use that name so lightly. Those are the sacred words of the Goddess of Law.\nRay:\nSince little Kay doesn't know, Uncle Ray will explain it for her! The P.I.C. is an assembly comprised of 11 members. Their job is to check if prosecutors are doing their jobs properly.\nEdgeworth:\nIf I'm not mistaken, its members are elected from politicians and those of the legal profession. ...So, I take it you are one of those members?\nGravelle:\n...Indeed. I am thankful they judged me worthy of such a task.\nRay:\nI, too, am thankful that I was able to meet you here. Ahem. How about a hug of thankfulness?\nGravelle:\nGravelle:\nThe Prosecutorial Investigation Committee also shares deep ties with the Bar Association.\nRay:\nHey, I was just kidding. No need to make such a scary face.\nKay:\nErrr. So your job is to find bad prosecutors and punish them?\nGravelle:\nWell said! May you be blessed by the Goddess of Law. Our job is to remove problematic prosecutors from their cases. And so, those people not fit to be prosecutors... ...will be stripped of their Prosecutor's Badge.\nGumshoe:\nWh-What business does this Whatchamacallit Committee have with Mr. Edgeworth, pal! We're in the middle of an investigation here...\n???:\n???:\nWow, you're thick. Seriously, how thickheaded can you be?\nGumshoe:\nAnd just who do you think you are, pal!\nDebeste:\nMe? I'm a prosecutor. Sebastian Debeste is my name. Haven't you heard of me? At the Prosecutor's Office, everyone calls me \"The Best\". Ah, I'm so beloved there...\nEdgeworth:\n...........I've never heard of you.\nDebeste:\nHey you, Mr. Flatfoot. You've heard of me, right?\nGumshoe:\nThis is the first time, pal.\nDebeste:\n...Oh well, It can't be helped. There's no way someone who's so thick on the intake could have good ears.\nEdgeworth:\n(Don't you mean \"slow on the uptake\"...?)\nGravelle:\nI suppose it's only natural as Sebastian only became a prosecutor last month.\nEdgeworth:\n(He's just a rookie prosecutor!?)\nDebeste:\nRight. The Best rookie prosecutor in the office...\nGravelle:\n...Or so he plans to be.\nDebeste:\nMr. Edgeworth. I'm here to clean up the mess you made.\nKay:\nWhat do you mean!?\nEdgeworth:\n(The P.I.C. intends to have me replaced... That much is clear.) ...Mr. Debeste. I know what you're trying to say. However, I have not been informed of this. Your Honor. I would like an explanation.\nGravelle:\nVery well. This judgment has been passed under the name of the Goddess of Law. The incident at the president's welcoming event, and the murder of Horace Knightley... The Prosecutorial Investigation Committee has decreed that you will be taken off this case... ...and Sebastian has been appointed to take over the case. ...That's all.\nGumshoe:\nWh-Whaaaaaaat! You can't just take him off the case like that, pal!\nEdgeworth:\nYour Honor... I thought I asked for an explanation?\nGravelle:\nThe judgement is guilty. The Goddess of Law's verdict is absolute.\nEdgeworth:\nEdgeworth:\nI have done nothing to warrant being taken off this case!\nGravelle:\nYou don't remember? Very well, in that case I shall remind you of your past crimes. You boarded the president's plane, which was protected by extraterritorial rights... ...and then, of all things, you ordered a search of the president's personnel.\nEdgeworth:\n......\nGravelle:\nA single mistake could have sparked an international incident. You crossed the line as a prosecutor... You've gravely overstepped your authority.\nEdgeworth:\nEdgeworth:\nI'll admit, my actions may have gone against the rules. However, if I had not taken that risk, I'm certain that the truth would never have been found. I have never considered my actions as a mistake!\nGravelle:\nGravelle:\nSo, you're saying that as long as the ends justify the means... ...it's alright to ignore the rules. That is an extremely dangerous way of thinking. No one is above the rules. That is the spirit of the law.\nEdgeworth:\nI'm sorry, but... I cannot accept your way of thinking.\nGravelle:\nI see. That's a shame. Even so... ...the gavel must slam down at the conclusion of a trial. Even if you, or the defense attorney, or the suspect, do not consent to the verdict. All you can do is accept the blessings of the Goddess of Law. Or... will you fight it? And risk losing your badge?\nEdgeworth:\n(She means to take my badge if I don't obey.)\nRay:\nAwwwww. That's too bad.\nGravelle:\nIt seems you understand. Now then, guards. Please proceed.\nGumshoe:\nHold it right theeeere!\nDebeste:\nHey, what are you doing! Aren't you supposed to be on our side? You should listen to the new prosecutor in charge.\nGumshoe:\nEhh! I don't wanna work for you, pal!\nDebeste:\nBut, isn't that the job of a flatfoot?\nEdgeworth:\n(We're at an overwhelming disadvantage here... It's useless to resist any longer.) Detective Gumshoe! You are now under Mr. Debeste's authority.\nGumshoe:\nB-But that's...!\nEdgeworth:\nYour Honor.\nGravelle:\nYes? What is it?\nEdgeworth:\nThis does not mean I have accepted your decision. We will meet again.\nGravelle:\nCertainly... I look forward to that day.\nEdgeworth:\nLet's go, Kay!\nKay:\nYeah...!\nRay:\nWait. Don't forget. I'll be reporting today's events to \"that person.\"\nEdgeworth:\n......\nTo be continued.\nMarch 28, 9:45 AMHigh Prosecutors' OfficesRoom 1202\nKay:\nMr. Edgeworth! Just what happened yesterday!? Those two people! Their attitude was just unforgivable!\nDebeste:\nMr. Edgeworth. I'm here to clean up the mess you made.\nGravelle:\nThe Prosecutorial Investigation Committee has decreed that you will be taken off this case... ...and Sebastian has been appointed to take over the case. ...That's all.\nEdgeworth:\n(Judge Gravelle and Mr. Debeste... They were certainly ruthless. But what I'm more concerned about is... ...just what is the P.I.C. thinking? ...I'm worried about what they will do from here on. I have a bad feeling about this...)\nKay:\nHey, Mr. Edgeworth! Are you listening to me?\nEdgeworth:\nYes, I'm listening.\nKay:\nYou're not going to give up on this case, are you?\nEdgeworth:\nNo. I don't plan on backing down, not with the current situation as it is. If I were to silently stand by, that would only validate their claims. (But I no longer have investigation rights. What should I do now?) What is it, Detective Gumshoe?\nGumshoe:\nB-Bad news, sir! I heard something down at the precinct... It sounds like they've already arrested a suspect in yesterday's case!\nEdgeworth:\nWhat! Who is it?\nGumshoe:\nI don't know yet, sir... But if we go down to the detention center, we can talk!\nKay:\nLet's get going! Mr. Edgeworth!\nEdgeworth:\n(Even if I can't investigate, meeting with the suspect should not be an issue.) Alright, we're heading over to the detention center now.\nGumshoe:\nI'll also head over on the double, sir!\nEdgeworth:\nDetective. Won't that interfere with your job?\nGumshoe:\nI gotta investigate the scene of the crime anyway, so it should be OK, sir!\nEdgeworth:\nAlright. We'll meet up with you there.\nGumshoe:\nRoger, sir!\nEdgeworth:\nLet's go, Kay!\nKay:\nOK!\nMarch 28, 10:23 AMDetention CenterVisitor's Room\nEdgeworth:\n..........\nKay:\n.......... ...He's not coming, is he?\nEdgeworth:\nHe's not.\nKay:\nIt's happening all over again!\nEdgeworth:\n...Don't joke about that.\n???:\nNo way! I mean it! It's not happening!\nGuard:\nYes. It's happening alright! There's just someone here to talk to you!\nEdgeworth:\n(Hm...?)\nKay:\nThat sounds like a pretty screechy voice, huh?\n???:\nNowaynowaynoway...!\nGuard:\nDon't be so stubborn!\n???:\nBut aren't prosecutors crazy scary or something? Always giving you a death glare!\nEdgeworth:\nUm, pardon me, but would you happen to be the suspect...?\n???:\nAaaaahhh! I knew ittt!\nEdgeworth:\nKay, why does this man seem so distraught?\nKay:\nWell, because you're, uh, you!\nEdgeworth:\n(That doesn't help me at all...)\nKay:\nHello, Mr. Suspect!\n???:\n!\nKay:\nWould you mind talking to us for a little bit?\n???:\nWh-Who are you?\nKay:\nI'm Mr. Edgeworth's assistant, Kay Faraday! Well, it's just a part-time job. I'm just taking a vacation from my real job!\nEdgeworth:\n...I don't remember hiring you.\nKay:\nThis is Mr. Edgeworth. He's a prosecutor, but he's not as scary as he looks, so it's OK.\nEdgeworth:\n(Hmph. How rude...!)\n???:\nR-Really?\nKay:\nReally! Really!\nEdgeworth:\nReally.\n???:\nEek!\nEdgeworth:\n......\nKay:\nAnyway, can you tell us your name, Mr. Suspect?\nSimeon:\n...Yeah. Uh... I-I'm Simeon Saint...\nKay:\nNice to meet you, Simeon! You can just call me \"Kay\", 'kay?\nEdgeworth:\nI am Miles Edgeworth, a prosecutor. I would appreciate a word with you.\nSimeon:\n...!\nKay:\nPlease! It's for your own good, Simeon!\nSimeon:\n...Really?\nEdgeworth:\n(Finally. It looks like we'll be able to get something out of him, thanks to Kay.)\nSimeon Saint\n\n\n\n\n\n\n\nEdgeworth:\nFirst, I'd like you to tell me a little about yourself...\nSimeon:\nNo way! Not that! I couldn't do that. Impossible! I'm not worthy! There's nothing interesting about me.\nEdgeworth:\nYour occupation?\nSimeon:\nNo way! Not that? It's no big deal, honest! Yeah! I'm just a regular employee.\nEdgeworth:\n(Good grief...)\nHorace Knightley (appears after Simeon Saint)\n\n\n\n\n\n\n\nEdgeworth:\nAbout the victim, Knightley... (I don't think he's going to talk to me about this.) ......Kay.\nKay:\nSimeon, did you know Mr. Knightley from some where?\nSimeon:\n...Knightley? Y-Yeah, I did. He was... a friend...\nEdgeworth:\n(A friend? So, did he know that Knightley was arrested?)\nKay:\nDid you know that... Mr. Knightley was arrested?\nSimeon:\nYeah. ...I came here to meet him.\nEdgeworth:\n(So he visited the detention center too. When was that?)\nKay:\nWhen did you visit him here?\nSimeon:\nIt was two days ago, in the afternoon... I received a call from the police, so I came over right away...\nEdgeworth:\n(From the police?)\nKay:\nWhy did you get a call from the police?\nSimeon:\nIt was a request from Knightley. He had a message for me.\nKay:\nA message?\nSimeon:\nYeah. He wanted me to bring him his pocket-sized chessboard. So, I retrieved it from his house and came here to give it to him.\nEdgeworth:\n(Did he say... chessboard?)\nKay:\nDid you say... chessboard?\nEdgeworth:\n(Is Kay...stealing my thoughts?)\nKay:\nNo, Mr. Edgeworth. It's just written on your face!\nEdgeworth:\n!\nKay:\nHe he he... I was just guessing from your facial expressions. See! I can be a useful assistant, right?\nEdgeworth:\nHmph... So, do you know what we need to do next?\nKay:\nYou bet! We gotta show \"that\" to Simeon, right?\nEdgeworth:\nCorrect. Let's present it and see how he reacts.\nReasons for arrest (appears after presenting Chessboard after talking about Horace Knightley)\n\n\n\n\n\n\n\nLeads to:\n\"So, why were you arrested?\"\nPresent\n\n\n\n\n\n\n\n\n\nProsecutor's Badge\n\n\n\n\n\n\n\nSimeon:\nNo way! It's really impossible! There's no way I could be a prosecutor! Even if you give that to me!\nEdgeworth:\nThat was never my intention.\nSimeon:\nSo, are you going to arrest me? Am I going to trial? No objections, your Honor?\nEdgeworth:\nThere is an objection. Please calm down.\n\n\n\n\nChessboard or Crime Scene Notes\n\n\n\n\n\n\n\nEdgeworth:\nMr. Saint, I would like you to take a look at this.\nSimeon:\nAaaaahhhh! I see nothing, I hear nothing!\nEdgeworth:\n(...Once he calms down, I'll try showing it to him again.)\n\n\n\n\nChessboard (after talking about Horace Knightley)\n\n\n\n\n\n\n\nKay:\nDo you recognize this chessboard?\nSimeon:\nAh! That's Knightley's!\nEdgeworth:\n(Just as I thought...)\nChessboard data updated in my Organizer.\nKay:\nThis was found near Mr. Knightley's corpse.\nSimeon:\n...He always carried a chessboard with him. It's just like him to have one until his last breath...\nKay:\nIt sounds like you two were really close, Simeon.\nSimeon:\nYeah, we were best friends... At least, I thought we were... But, maybe I was wrong.\nKay:\nHuh?\nSimeon:\nBecause I never imagined he would murder someone.\nEdgeworth:\n(Having someone close to you turn out to be a murderer... Reality can be so cruel. It's not something most people can easily accept...)\nSimeon:\nAnd I never imagined we would part ways like this. *sob*...\nKay:\nMr. Edgeworth. Something's definitely strange here! There's no way Simeon could have killed Mr. Knightley!\nEdgeworth:\nIndeed... I certainly can't see a motive at all. (However... The fact remains that he was the one who was arrested on that charge. Just what was the justification for doing so?)\n\n\n\n\nCrime Scene Notes (after presenting Chessboard)\n\n\n\n\n\n\n\nSimeon:\nKnightley loved chess... We would always play against each other. I-If only I hadn't brought that to him... ...it probably wouldn't have turned out like this.\nEdgeworth:\nI'm not so sure. To me, it's the proof of the friendship between you and the victim. I doubt it had anything to do with the murder.\nSimeon:\nR-Really... *sob*... Aahh! I can't take it anymore! Just arrest me already!\nEdgeworth:\n...Haven't they already done that?\n\n\n\n\nAnything else\n\n\n\n\n\n\n\nSimeon:\nEven if you show me stuff like that, it's too technical for me. ...I-I don't get it at all.\nEdgeworth:\nHmph... I guess you don't have any new information about it?\nSimeon:\nS-S-S-S-Sorry! Am I going to be arrested? If I start spouting some random nonsense now, will I be able to plead insanity later?\nEdgeworth:\n...If you want to be guilty of perjury, go right ahead.\nSimeon:\nTh-That was a leading question! I knew it! I'm going to be arrested!\nEdgeworth:\n(Good grief. He's not listening to me at all.)\nEdgeworth:\nSo, why were you arrested? (Hm, I guess he still won't respond to me...)\nSimeon:\n........W-Well, I don't know.\nKay:\nLooks like he's finally warming up to you.\nEdgeworth:\n(Whew, that's a great help.)\nSimeon:\nThis morning, a police officer barged into my house... And before I knew it, he had brought me here...\nEdgeworth:\nWas there a prosecutor accompanying him at that time?\nSimeon:\nAhh. I remember a prosecutor called Du-um... Best or something was there too.\nEdgeworth:\n(So, it was that rookie prosecutor...)\nKay:\nThen, I guess the police haven't dragged you into questioning yet, huh?\nSimeon:\nA-Are the p-police going to interrogate me?\nKay:\nYup. That's right. Because you're the suspect.\nSimeon:\nNowaynowaynowaynoway...! Aren't detectives like crazy abusive or something? Always bossing you around with their big bodies!\nGumshoe:\nDetective Gumshoe is on the scene!\nSimeon:\nAaaaaaaaahhhhh! I knew ittttt! Please don't beat me with your thick arms! I can't take it anymore! Someone call the police!\nGumshoe:\n....... What's gotten into him, sir?\nEdgeworth:\nWell... It's because you're you, Detective.\nGumshoe:\nHuh? I don't get it, sir...\nKay:\nI know Simeon has to be innocent, Mr. Edgeworth! Can't we do something...?\nEdgeworth:\n...Simeon Saint.\nSimeon:\nY-Y-Y-Yes!?\nEdgeworth:\nYou were Mr. Knightley's best friend. You only just met with him two days ago... You say you didn't kill him. Are you certain about this?\nSimeon:\n......Y-Yes, I am. I-I wouldn't harm a fly!\nEdgeworth:\nI see. That's enough for me. I shall offer my assistance in proving your innocence.\nSimeon:\nEh! Wh-What's the point in helping little ol' me?\nEdgeworth:\nIt's not just for you. This case, I have a personal stake in it as well.\nKay:\nThat's right! We gotta get back at those two from yesterday!\nGumshoe:\nYeah! I'm fired up, sir!\nEdgeworth:\nBut, I don't have any investigation rights at the moment. Since I won't be able to obtain information myself, your role is most vital. I'm sure we can rely on you to fill in any holes in the information we have. Help us help you... That's all I ask.\nGumshoe:\nAh! I just had an idea! Why don't you just borrow a defense attorney's badge, sir!\nKay:\nCome on! There's no way Mr. Edgeworth could do that. This isn't the time to be joking around!\nGumshoe:\nB-But I wasn't joking... Helping the suspect is a defense attorney's job, pal...\nKay:\nJeez. Don't worry about that! It doesn't matter what Mr. Edgeworth's job is. All we gotta do is find the real murderer! So, let's get movin'!\nGumshoe:\nOK, pal!\nEdgeworth:\nI'm sure you understand, but if the investigation results prove that you are the murderer... No hard feelings, but I will show no mercy...\nSimeon:\nEeeeeee...!\nEdgeworth:\nBut, you don't need to be scared. I believe in your story... At least for now.\nSimeon:\n........\nEdgeworth:\nAll you need to do is believe in us and wait patiently... There's nothing to fear. Now, if you'll excuse me, I must be off.\nMarch 28, 11:22 AMDetention CenterHallway\nKay:\n...So, we're all fired up and ready to go. But we still can't enter the part of the prison where the murder occurred...\nGumshoe:\nIf you can't investigate, the only thing you can do now is defend him in court, sir.\nKay:\nBut how are we supposed to do that? We can't!\nRay:\nHuh? If it isn't Prosecutor Edgeworth and his merry gang. What are you guys doing here?\nGumshoe:\nDid you come here to harass Mr. Edgeworth again, pal?\nRay:\nHe he he. What're you talking about, big guy? Uncle Ray's just here to do his job.\nKay:\nYour job? Oh yeah, you're a defense attorney, right?\nRay:\nOh, Kay! You're as cute-iful as ever!\nEdgeworth:\n(Cute-iful...?)\nRay:\nI might not look like it, but your Uncle Ray's a hotshot defense attorney. I'm here to meet with a new client today. What was his name again? Shy Monkees or something...\nKay:\nWhat? You mean Simeon Saint?\nRay:\nThat's it! Kay! Looks like you know the deal.\nKay:\nMr. Edgeworth! He's the defense attorney!\nEdgeworth:\n(I thought as much. Guess we have no choice but to resort to that method. In the past, whenever I had to investigate cases I was not placed in charge of... ...I was able to gain access by becoming a subordinate to whomever was in charge. Not my preferred opinion, but it's the only one I have now...) Mr. Shields. If I may ask...\nRay:\nBy the way... I don't take on sidekicks.\nEdgeworth:\n!\nRay:\nI refuse to take on male assistants who lack charm. Especially... Someone who was like a son to Von Karma.\nEdgeworth:\n(Mr. Shields... As I thought, he won't forgive me so easily.) Mr. Shields. I understand that you cannot forgive me for what I've done. I am also fully aware of your hatred towards those involved with Von Karma. I don't know if you'll believe me, but... ...I am no longer the same as I was back then... Back when I idolized Von Karma.\nGumshoe:\nYeah, pal! Mr. Edgeworth is a changed man! Sure, he may have been a cruel, inhuman prosecutor in the past... ...but now, he's completely different, pal!\nEdgeworth:\n(When you put it that bluntly, it kind of hurts...)\nKay:\nThat's right! Mr. Edgeworth's not a bad guy anymore! I wouldn't even call him a prosecutor! He's more like... Uh... Umm... A hero! Yeah! He even helped me out in that big case last month!\nRay:\nA hero... That's some pretty big talk there, missy.\nKay:\nHe's a magnificent hero! Although he'd be no match for a Great Thief like me!\nRay:\n......\nEdgeworth:\nMr. Shields, don't the actions of the P.I.C. appear... strange to you? I believe there may be something else hidden behind this case. I can't afford to... quit at this juncture! Please let me help you with the investigation. I am begging you.\nRay:\n...... ...Heh. I never expected you to grovel like this. It sure looks like you've changed, alright. And I'm kinda interested... in the cause of all this.\nEdgeworth:\nYou're interested... in what changed me? If I had to say, it would probably be... the courtroom itself. All the experiences I've had and all the people I've met inside the courtroom. And perhaps... Reuniting with my old friends.\nRay:\n...... He he he... I never expected you of all people to change. Who would've thought that you'd lay open your heart like that. I'm sure that man would be surprised as well. Guess I can't turn you away. It may be long overdue... But allow me to properly reintroduce myself. If you would be so kind as to read this...\nGumshoe:\nEdgeworth Law Offices Raymond Shields, Head Attorney...?\nKay:\nE-Edgeworth...?\nEdgeworth:\nMr. Shields was an assistant to my deceased father... Gregory Edgeworth.\nKay:\nReally? Your father was a defense attorney? S-So that means that man Mr. Shields talked about is...\nRay:\nCorrect, my cute little Kay. Prosecutor Edgeworth's old man. I never changed the name of the firm. It's my way of showing my appreciation for his help. Prosecutor Edgeworth. No, wait... Miles. Uncle Ray doesn't fully trust you just yet. It may have been temporary, but the fact remains: you were once a disciple of Von Karma. You say that you've changed, but you'll need to prove it to me with your actions. Even your old man... Would've wanted it this way.\nEdgeworth:\n...Yes, I understand.\nRay:\nAlright. I'm getting tired of all this stuffy talk, so let's give it a rest and move on... For now, I'll make you my temporary assistant. How does that sound?\nEdgeworth:\nI'm sorry to trouble you...\nRay:\nBut... this outcome is kinda moving, yeah? The prodigal son returning to work in his late father's law firm.\nKay:\nWhat about me! What about me!\nRay:\nOf course, you can help too, Kay.\nKay:\nAlright! Thanks a lot, Mr. Shields! I mean, Boss!\nRay:\nNow then, let's get right to work. Let's see.. First off... What do you think we should do, Miles?\nEdgeworth:\n(That's right... I had some unfinished business yesterday.)\nRay:\nHmm. So, it wasn't the victim...\nEdgeworth:\n...but rather, it was the first person to discover the body who screamed.\nEdgeworth:\nWhy don't we find them and listen to what they have to say?\nRay:\nYeah, that's it! Uncle Ray thinks so, too.\nEdgeworth:\n(Hmph. Upbeat as always.)\nKay:\nOK! With that decided, let's hurry up and grill him!\nGumshoe:\nUm... Sir, what am I supposed to do? Detectives can't help defense attorneys!\nEdgeworth:\n(Hmm... I can't just leave him be...) Detective, I will give you a special assignment. I want you to assist Mr. Debeste in his investigation and follow his orders. And then, if you discover anything useful, I want you to share it with us. Detective. This is a job that only you can do. Can we count on you?\nGumshoe:\nY-Yes, sir! Leave it to me! I'm really good at leaking investigation reports to defense attorneys!\nEdgeworth:\n(Normally, that would be a problem for me, but it may come in handy this time.)\nRay:\nAlright, let's get moving, shall we? Time to go to jail!\nMarch 28, 11:50 AMPrisonHallway\nRay:\nNow then, where's the person who first discovered the body?\nEdgeworth:\nFor now, all we can do is ask around.\n???:\nHold it right there!\nEdgeworth:\n(Who is this woman?) Umm... Excuse me, but...\n???:\nOh, you are simply irresistible!\nRay:\nHuh? Do you mean... me?\n???:\nVery nice, very nice, indeed! What an elegant mustache.\nRay:\nIt's a pleasure to meet you, mademoiselle. Defense attorney Ray Shields, at your service. How about we exchange greetings with a hug?\n???:\nOh ho ho ho. But of course.\nRay:\nMmf! Mmmmmmmf! Uncle Ray's... l-lips...\n???:\nA proper greeting should begin with a hug AND a kiss!\nKay:\nIt's almost like... it was stolen from him!\nEdgeworth:\nYes, a remarkable feat of quickness that would put a Great Thief to shame.\n???:\nI feel that close contact is very important. This goes for my family here in my home as well.\nRay:\nQ-Quite a splendid way of thinking there. He he he.\nLaguarde:\nI am the warden, Fifi Laguarde. But please, just call me Patty.\nEdgeworth:\n(The warden...? So she's in charge of the prison and detention center?) Nice to meet you. I am Miles Edgeworth. I'm a prosec... I mean, I'm Mr. Shield's assistant. Pardon me for asking, but were you here in the prison yesterday?\nLaguarde:\nBut of course! Yesterday was a day that I wouldn't have missed for the world!\nEdgeworth:\n\"Wouldn't have missed for the world\"? Did you have some kind of important meeting...?\nLaguarde:\nOh heavens, no! I despise meetings! It was the Animal Show, of course! A wonderful spectacle, featuring animals dancing and flying through the air! I always see it along with everyone else in our home! We're one big, happy family! We built a special stage in the courtyard just for this performance.\nEdgeworth:\n(A performance for the prisoners' enjoyment... Yesterday, Elbird mentioned some kind of \"recreation\"... I suppose the Animal Show was what he was referring to.) When did this show take place?\nLaguarde:\nIt started at 8 AM and ended around 10 AM.\nEdgeworth:\n(That's exactly when the body was discovered... So whoever saw the show would probably have an alibi.)\nLaguarde:\nNow, if you'll excuse me, I must be going. I have business to attend to. Please take your time and have a look around our home!\nKay:\nSo, where should we start, Mr. Edgeworth?\nEdgeworth:\nThere was a prisoner who heard the scream from the person who first discovered the body. Let's start by talking with him.\nPartner\n\n\n\n\n\n\n\nKay:\nYeah, what's up?\n\n\n\nNotice anything?\n\n\n\n\n\n\n\nKay:\nHere's our chance, Mr. Edgeworth! While that demon lady is gone, we can snoop around!\nEdgeworth:\n(Demon... Is she referring to Judge Gravelle?) I don't approve of your words... But let us carry on with the investigation.\nKay:\nAlright! Let's do it!\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nDoor Sensor\n\n\n\n\n\n\n\nKay:\nThese doors open whenever they detect an animal... If I brought an animal with me, breaking in here would be easy.\nEdgeworth:\nBefore that... Sneaking into the facility won't be a simple task.\nKay:\nWhat you'd need is some special technique that lets you open any door you come across...!\nEdgeworth:\n...Do you possess such a special technique?\nKay:\nUmm... That's a trade secret!\nEdgeworth:\n(...I guess not.)\nPony\n\n\n\n\n\n\n\nEdgeworth:\nHm.. They even have a pony. Little kids could ride it.\nKay:\nHow nice. It's like a zoo!\nEdgeworth:\nAlthough, it's the humans who are treated like animals in here.\nKay:\nDo you think they'd find out if I took one home with me?\nEdgeworth:\nI think that if you did that, you'd be the one behind bars.\nSign in front of left cell\n\n\n\n\n\n\n\nKay:\nThere's some information here about the prisoner of this cell! Let's see... Inmate number: D-259 Species: See cell on right.\nEdgeworth:\n...That's a shoddy explanation.\nKay:\nHis partner is Rocky the polar bear. He is a former boxer who enjoys training to lose weight. His muscles are tough, but he's a big softie. He's an omnivore. ...So it says.\nEdgeworth:\nWho is this information for...\nLeft cell\n\n\n\n\n\n\n\nEdgeworth:\nNo one's here.\nKay:\nThis person was taken to the disciplinary room. I wonder when he'll be back?\nEdgeworth:\nWho knows...? I'm sure he won't be allowed to return so easily.\nKay:\nHe was on the verge of tears, he really didn't want to go...\nEdgeworth:\nIndeed. His reaction was quite extreme. (I wonder... What sort of punishment awaits him?)\nRaymond Shields\n\n\n\n\n\n\n\nRay:\nU-Uncle Ray's lips...!\nEdgeworth:\n...You seem to be in quite a shock.\nKay:\nIsn't Warden Laguarde the type of beauty Mr. Shields likes?\nRay:\n...A hug is a greeting, but a kiss is on a whole different level. Your Uncle Ray needs time to mentally prepare himself.\nKay:\nI didn't think you would be such a shy guy, Mr. Shields.\nEdgeworth:\n(...Somehow, I don't think that's the problem here.)\n\n\n\nAssistant's job\n\n\n\n\n\n\n\nRay:\nHey, Miles... About your face, could you loosen it up a bit? Since you're going to be Uncle Ray's assistant, you'll need to smile more!\nEdgeworth:\nBeing an assistant and smiling more have nothing to do with one another.\nRay:\nThat's not true. A smile is the first step to building trust with a client. First, show a refreshing smile to put them at ease, then give a wink to capture their heart. End with a hug, and exchange business cards! That's how you open up a client's heart.\nEdgeworth:\n...Let's just keep that to ourselves, please.\n\n\n\n\nEdgeworth Law Offices\n\n\n\n\n\n\n\nRay:\nWell, managing the law firm was quite tough at first. It was difficult inheriting the business from Gregory...\nEdgeworth:\nIs that so... What kind of requests do you usually receive at the office?\nRay:\nUmm. Usually requests to defend suspects in murder cases and various sorts of legal counsel. Well, our basic policy was \"We Welcome Everyone\".\nKay:\nDid you ever have to turn down any requests?\nRay:\nWell, if the client wasn't cute enough.\nKay:\nI thought everyone was welcome!\nRay:\nI'm kidding. That was a joke. We accept clients of all sorts. ...With Greg's name on the line. I couldn't do a half-hearted job.\nEdgeworth:\n(...The Edgeworth Law Offices, the law firm that my father built...)\nSign in front of right cell\n\n\n\n\n\n\n\nKay:\nHey, something's written here.\nEdgeworth:\nYes, it's some information about this inmate.\nKay:\n\"Inmate number: D-258 Species: Convictus Brutus\" \"Despite his ferocious appearance, he is a herbivore. His partner is Gwen the penguin. He has good acting skills and a great stage presence. Delivers powerful testimonies.\" ...So it says.\nEdgeworth:\nIt's just like one of those information signs at the zoo...\nPrisoner\n\n\n\n\n\n\n\nEdgeworth:\nWhere is the person who first discovered the body, right now?\nPrisoner:\nAround this time, I think he should be in the workroom in the back?\nEdgeworth:\n(The workroom... I should go take a look.)\nPig\n\n\n\n\n\n\n\nEdgeworth:\n...It's a pot-bellied pig. (Let's hope it doesn't become dinner.)\nKay:\nHow nice. It's like a zoo!\nEdgeworth:\nAlthough, it's the humans who are treated like animals in here.\nKay:\nDo you think they'd find out if I took one home with me?\nEdgeworth:\nI think that if you did that, you'd be the one behind bars.\nBench\n\n\n\n\n\n\n\nEdgeworth:\nThis bench is quite rusty.\nKay:\nOnly cats and Gummy would sleep on this bench.\nEdgeworth:\nIndeed... No argument here.\nDoor to Workroom A\n\n\n\n\n\n\n\nEdgeworth:\nYou can see the crime scene from these small windows.\nKay:\nMr. Edgeworth! You can't just go peeping in like that! You need to be more... sneaky, and check your surroundings!\nEdgeworth:\nWh-Why... must I behave like a common criminal!\nKay:\nEh? I thought you wanted me to teach you my special \"steal a glance\" technique!\nEdgeworth:\nI don't need your techniques!\nRocky hills\n\n\n\n\n\n\n\nKay:\nThere's a monkey on that hill, Mr. Edgeworth!\nEdgeworth:\nHardly an appropriate spectacle for a prison...\nKay:\nWhen you see stuff like this, you can really feel the tension rise!\nEdgeworth:\nI hope you're not expecting me to agree with you. Also, Kay... Just so we're clear, I don't want to see you climbing that hill.\nKay:\nBut, someone's gotta show that monkey who's boss.\nEdgeworth:\n...Don't provoke the monkey.\nDoor to Workroom B\n\n\n\n\n\n\n\nEdgeworth:\nThis door leads to the inmate's workroom.\nKay:\nWhat are these workrooms for?\nEdgeworth:\nBasically, they provide job training towards the inmate's rehabilitation.\nKay:\nBut we found a dead body in the other workroom, right? Are you sure they really help in the rehabilitation process?\nEdgeworth:\nHm... In order to answer that question, we must uncover the truth as quickly as possible.\nDoor to Workroom B (after talking to prisoner)\n\n\n\n\n\n\n\nLeads to:\n\"Hellooooo! Is this occupied?\"\nGuard with a kitten\n\n\n\n\n\n\n\nEdgeworth:\nHey, you there. I'd like to ask you some questions.\nGuard:\nSo cute, meow~!\nKay:\nIt really is, meow~!\nEdgeworth:\nHey, you!\nGuard:\nMeow~!\nEdgeworth:\n(He finally noticed me.) By the way...\nKay:\nWhat's this cat's name, meow~?\nGuard:\nHis name is \"Nermal\", meow~!\nEdgeworth:\nThat's enough. Carry on with your duties. (What we have here is a failure to communicate...)\nWatering hole\n\n\n\n\n\n\n\nEdgeworth:\nThere's a watering hole here.\nKay:\nUmm. This is hard to drink out of. They should have thought more about the end user when they designed this!\nEdgeworth:\nKay... Can't you see that this is for the animals?\nDoor on up\n\n\n\n\n\n\n\nEdgeworth:\nThe courtyard lies beyond these shutters, but they are locked.\nKay:\nFreedom is right in front of them, but the shutters are locked up... Life is so cruel. I really feel sorry for them!\nEdgeworth:\n..Who are you feeling sorry for?\nRabbit\n\n\n\n\n\n\n\nEdgeworth:\n! What's a rabbit doing here... (I almost stepped on it.)\nKay:\nHow nice. It's like a zoo!\nEdgeworth:\nAlthough, it's the humans who are treated like animals in here.\nKay:\nDo you think they'd find out if I took one home with me?\nEdgeworth:\nI think that if you did that, you'd be the one behind bars.\nDoor on down\n\n\n\n\n\n\n\nEdgeworth:\n...Where does this door lead to?\nKay:\nDon't you feel some strange vibes coming from that door? Maybe... They've got a deadly criminal locked up inside!\nEdgeworth:\n...That certainly is possible. It would be best not to get too close.\nKay:\nEhhh! I-I was just kidding...!\nKay:\nHellooooo! Is this occupied?\nRay:\nKay, that's not a restroom. Hey, guard. Do you have a minute?\nGuard:\nSir! What is it?\nRay:\nIs anyone using that workroom right now?\nGuard:\nPresently, there is one prisoner working inside! I'm positive he's been there since the noon roll call!\nEdgeworth:\nWe would like to ask the prisoner a few questions, if that is acceptable...\nGuard:\nYes, sir! I will bring him out, so please wait a moment!\nRay:\nI'll leave this to you, Miles.\nEdgeworth:\nWh-What do you mean?\nRay:\n'Cause I don't know what kind of scary guy will come out of that room.\nKay:\nMr. Shields. You're a scaredy-cat? Even though you're an adult?\nRay:\nHe he he. Same to you, Kay.\nEdgeworth:\n(Here he comes...)\n???:\nOh, good day to you, sirs. Are you the ones who requested my presence?\nEdgeworth:\n(He doesn't seem like a dangerous criminal...) My name is Miles Edgeworth. I'm a prosecutor.\n???:\nA prosecutor... Is that right?\nRay:\nI'm Ray Shields, a defense attorney.\nEdgeworth:\n(Mr. Shields... His demeanor completely changed once he saw who we were dealing with...)\nRay:\nSorry about that. He he. My assistant says strange things sometimes. He's not a prosecutor, just my assistant. Hey! Get your act together, Miles.\nEdgeworth:\n(Hmm, I guess I messed up... I forgot about my \"new job\".)\n???:\nNo wonder I thought you were different from the prosecutor who visited me yesterday.\nEdgeworth:\n(It looks like he's already spoken to Debeste.) May we ask you a few questions?\nSahwit:\n...Oh, yes. Of course you may. My name is Frank Sahwit.\nRay:\nOK. Go for it, Miles.\nEdgeworth:\n(I guess I'll be asking the questions after all... *sigh*...) Mr. Sahwit, you are aware of the murder that occurred here yesterday, correct? Where were you when the body was discovered?\nSahwit:\nI was... in this room, where I had been working.\nEdgeworth:\nWhat kind of work?\nSahwit:\nWell, my goal is to become a pet groomer. An animal beautician, so to speak. Oh yes. I was inside cultivating my skills.\nEdgeworth:\n(In any other prison, such training would be unheard of...)\nSahwit:\nThat was all. Honestly. I-I did not see a thing.\nEdgeworth:\n(Hm? Why did he say that? I haven't even asked him anything yet.)\nSahwit:\nWhich is why, sad to say, I won't be any help to you.\nEdgeworth:\nEdgeworth:\nMr. Sahwit... I haven't asked you anything yet.\nSahwit:\n! No... Wait. That's... Even if you were to ask, I would not...\nEdgeworth:\nYou... know something, doesn't you?\nSahwit:\n...! Oh, oh... That's... ........\nEdgeworth:\n(It seems he is indeed hiding something. Let's try to press it out of him...)\nEdgeworth:\nFirst let us assess the layout of the board. My opponent's condition is...\n3 CHESS PIECES\nSahwit:\nI'm afraid I didn't see a thing. So, I won't be any help to you.\nEdgeworth:\n(This man's expressions do not change much. It's a true poker face. It may be difficult to read his emotions from his body language.) Perhaps I should focus on how he phrases his words. It may reveal what's on his mind. Now, for the opening move... I'll start by asking about who this man is. Even if he hides his emotions, if I push the right buttons I'm sure I'll cause a change!\nBegin Logic Chess\nAre you involved with this case?\n\n\n\n\n\n\n\nLeads to:\n\"Are you... involved with this case?\"\nEdgeworth:\nAre you... involved with this case?\nSahwit:\nAre you referring to the murder that occurred inside this prison? I had nothing to do with it at all.\nEdgeworth:\n...Is that true?\nSahwit:\nI-I would never dream of being involved in a murder plot. Hm... How should I put it... I'm... an upright, model citizen after all...\nYou're an upright, model citizen?\n\n\n\n\n\n\n\nLeads to:\n\"Common sense tells me...\"\nWait and see.\n\n\n\n\n\n\n\nEdgeworth:\n......\nSahwit:\nIf you have no more use for me... May I leave now?\nEdgeworth:\nMmph... I was too passive... Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\nEdgeworth:\nCommon sense tells me... ...an upright, model citizen would have never ended up behind bars.\nSahwit:\nW-Well, that is...\nEdgeworth:\nTell me what you know about the incident!\nSahwit:\nI already told you, I don't know a damn thing! Oh, er... I really don't know anything.\nAre you angry?\n\n\n\n\n\n\n\nEdgeworth:\nHaven't you realized it yet? I have you cornered!\nSahwit:\nWhatever are you talking about? I really have no time to waste...\nEdgeworth:\n(Argh... That was a wasted remark.) Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\nWait and see.\n\n\n\n\n\n\n\nLeads to:\n\"........\"\nEdgeworth:\n........\nSahwit:\nI apologize from the bottom of my heart for that outburst... But I will be of no assistance.\nEdgeworth:\nPardon my rudeness. It's just that the murder occurred in this rather confined prison. It seems unnatural that you do not know anything about it.\nSahwit:\n...Oh? Er... U-Unnatural... Is that so? I-If you're looking for the person who discovered the body... You should try someone else...\nDid I say who we were looking for?\n\n\n\n\n\n\n\nLeads to:\n\"How did you know we were looking for the person who discovered the body?\"\nWait and see.\n\n\n\n\n\n\n\nEdgeworth:\n......\nSahwit:\nIf you have no more use for me... May I leave now?\nEdgeworth:\nMmph... I was too passive... Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\nEdgeworth:\nHow did you know we were looking for the person who discovered the body? I don't recall saying a word about that. Are you sure you don't know anything?\n1 PIECE BROKEN\nSahwit:\n...! N-No... It was merely a hunch I had. I am but a humble pet groomer in training. I honestly have no recollection of the murder.\nEdgeworth:\nI am positive that this man is hiding something. For my next move... I'll ask him about his movements on the day of the murder. This man has suppressed his emotions. I will expose his true nature hidden beneath that suspicious smile!\nWhat happened on the day of the murder?\n\n\n\n\n\n\n\nLeads to:\n\"Are you... involved with this case?\"\nEdgeworth:\nLet's talk about what happened on the day of the murder. If you truly had nothing to do with it, there shouldn't be a problem, correct?\nSahwit:\nOh... Well... O-On the day of the murder... There was a lot going on...\nTell me about your movements.\n\n\n\n\n\n\n\nEdgeworth:\nTell me what you were doing on that day.\nSahwit:\nA-As I mentioned earlier, I was cultivating my skills as a groomer in training... I was trimming the coats of the animals at the time...\nEdgeworth:\nDidn't the murder cause a panic? I imagine the entire prison must have been in an uproar...\nSahwit:\nWell... But... Th-There was no panic... I could even hear someone's voice...\n\n\n\nWas it a scream that you heard?\n\n\n\n\n\n\n\nLeads to:\n\"Someone's voice? Judging from the circumstances, I suppose it was a scream that you heard?\"\n\n\n\n\nWas it laughter that you heard?\n\n\n\n\n\n\n\nEdgeworth:\nHaven't you realized it yet? I have you cornered!\nSahwit:\nWhatever are you talking about? I really have no time to waste...\nEdgeworth:\n(Argh... That was a wasted remark.) Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\n\n\n\n\nWait and see.\n\n\n\n\n\n\n\nEdgeworth:\n......\nSahwit:\nIf you have no more use for me... May I leave now?\nEdgeworth:\nMmph... I was too passive... Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\n\n\nEdgeworth:\nSomeone's voice? Judging from the circumstances, I suppose it was a scream that you heard? So you do have a recollection of the murder! You kept insisting that you knew absolutely nothing about the murder... But you do not give credence to your claims!\nSahwit:\nUrgh! W-Well, I thought I heard someone's voice but... I-In any case, I don't remember it very well.\nEdgeworth:\nThe scream at the time of the murder... It might be a clue. I better keep that in mind...\nLeads back to first\nTell me about your movements. (after clearing this option)\n\n\n\n\n\n\n\nEdgeworth:\nI've run this line of questioning to its conclusion... Let's try another line of attack.\nLeads back to first\nTell me about the state of the prison.\n\n\n\n\n\n\n\nEdgeworth:\nWhat was the state of the prison at the time?\nSahwit:\nI don't remember it too well... My memory is rather poor.\n\n\n\nBefore obtaining clue\n\n\n\n\n\n\n\nEdgeworth:\nI don't have enough clues to proceed with this line of questioning. Maybe I should try another line of attack...\nLeads back to first\n\n\n\n\nAfter obtaining clue\n\n\n\n\n\n\n\nLeads to:\n\"Let's try using that clue...\"\nWait and see.\n\n\n\n\n\n\n\nEdgeworth:\n......\nSahwit:\nIf you have no more use for me... May I leave now?\nEdgeworth:\nMmph... I was too passive... Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\nEdgeworth:\nLet's try using that clue...\nI thought you said you heard a scream!\n\n\n\n\n\n\n\nLeads to:\n\"You don't remember? Ridiculous.\"\nWait and see.\n\n\n\n\n\n\n\nEdgeworth:\n......\nSahwit:\nIf you have no more use for me... May I leave now?\nEdgeworth:\nMmph... I was too passive... Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\nEdgeworth:\nYou don't remember? Ridiculous. Didn't you say earlier that you heard a scream?\nSahwit:\nThat wasn't... I could very well be mistaken... At any rate, I honestly do not remember.\nEdgeworth:\nYou still do not remember? Enough with your lies!\nSahwit:\nI ain't lyin', you...! ...I mean, I'm telling the truth.\nYou're angry, aren't you?\n\n\n\n\n\n\n\nEdgeworth:\nHaven't you realized it yet? I have you cornered!\nSahwit:\nWhatever are you talking about? I really have no time to waste...\nEdgeworth:\n(Argh... That was a wasted remark.) Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\nWait and see.\n\n\n\n\n\n\n\nLeads to:\n\"........\"\nEdgeworth:\n........\nSahwit:\nIn any case... I was absorbed in grooming the animals.\nEdgeworth:\nBy the way... How skilled would you say you are in animal grooming?\nSahwit:\nMy techinique with the scissors still needs some work... But I am very confident in my handling of the animals. When the animals became frightened, I calmed them with my gentle hands...\nEdgeworth:\n...Frightened? Why would the animals have become frightened? I don't think that's a common occurrence...\nSahwit:\nW-Well... That's a good thing... Isn't it?\nDid you threaten the animals?\n\n\n\n\n\n\n\nEdgeworth:\nHaven't you realized it yet? I have you cornered!\nSahwit:\nWhatever are you talking about? I really have no time to waste...\nEdgeworth:\n(Argh... That was a wasted remark.) Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\nDid the scream frighten the animals?\n\n\n\n\n\n\n\nLeads to:\n\"Perhaps the reason they were frightened was because of someone's scream?\"\nWait and see.\n\n\n\n\n\n\n\nEdgeworth:\n......\nSahwit:\nIf you have no more use for me... May I leave now?\nEdgeworth:\nMmph... I was too passive... Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\nEdgeworth:\nPerhaps the reason they were frightened was because of someone's scream? Why are you trying so hard to hide the fact that there was a scream! Are you concealing some vital information from me?\n1 PIECE BROKEN\nSahwit:\nArgh! I-I am doing nothing of the sort! I-It's true that I heard some sort of scream... But I'm not trying to hide it!\nEdgeworth:\nHe's starting to show his true colors. I should be more aggressive with my next move. I'll ask him about the scream. It's time to give him a taste... ...of the futility of keeping a secret from me!\nWhen did you hear it?\n\n\n\n\n\n\n\nEdgeworth:\nWhen did you hear the scream?\nSahwit:\nTh-That's it! I just remembered! At the time of the murder, there was an event going on. It was the Animal Show. I had gone there to see it...\nEdgeworth:\nSo you're saying that since you were watching the show, you did not hear the scream? That's... completely different from everything you've said up until now!\nSahwit:\nShut up! So what if it is! I mean... My memory is just so hazy...\n\n\n\nStop making that poker face!\n\n\n\n\n\n\n\nEdgeworth:\nHaven't you realized it yet? I have you cornered!\nSahwit:\nWhatever are you talking about? I really have no time to waste...\nEdgeworth:\n(Argh... That was a wasted remark.) Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\n\n\n\n\nYou get mad easily, don't you?\n\n\n\n\n\n\n\nEdgeworth:\nHaven't you realized it yet? I have you cornered!\nSahwit:\nWhatever are you talking about? I really have no time to waste...\nEdgeworth:\n(Argh... That was a wasted remark.) Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\n\n\n\n\nWait and see.\n\n\n\n\n\n\n\nLeads to:\n\"........\"\n\n\nEdgeworth:\n........\nSahwit:\nThe Animal Show was very enjoyable.\nEdgeworth:\nWhat kind of animals performed in the show?\nSahwit:\nWell... Umm... I believe I saw a whale?\n\n\n\nDid you ride the whale?\n\n\n\n\n\n\n\nEdgeworth:\nHaven't you realized it yet? I have you cornered!\nSahwit:\nWhatever are you talking about? I really have no time to waste...\nEdgeworth:\n(Argh... That was a wasted remark.) Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\n\n\n\n\nYou didn't see the show, did you?\n\n\n\n\n\n\n\nLeads to:\n\"You liar! You didn't see the Animal Show at all!\"\n\n\n\n\nWait and see.\n\n\n\n\n\n\n\nEdgeworth:\n......\nSahwit:\nIf you have no more use for me... May I leave now?\nEdgeworth:\nMmph... I was too passive... Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\n\n\nEdgeworth:\nYou liar! You didn't see the Animal Show at all!\nSahwit:\nUrgh! W-Well, that is... I sort of saw it, and I sort of didn't...\nEdgeworth:\nHe didn't see the show. This could be a clue.\nLeads back to first\nWhen did you hear it? (after clearing this option)\n\n\n\n\n\n\n\nEdgeworth:\nI've run this line of questioning to its conclusion... Let's try another line of attack.\nLeads back to first\nWho did the scream belong to?\n\n\n\n\n\n\n\nEdgeworth:\nDo you know who the scream belonged to?\nSahwit:\nW-Well, I was mistaken. When the incident occurred, I just happened to be in the courtyard. That's why... I did not hear the scream.\n\n\n\nBefore obtaining clue\n\n\n\n\n\n\n\nEdgeworth:\nI don't have enough clues to proceed with this line of questioning. Maybe I should try another line of attack...\nLeads back to first\n\n\n\n\nAfter obtaining clue\n\n\n\n\n\n\n\nLeads to:\n\"Let's try using that clue...\"\nEdgeworth:\nLet's try using that clue...\nYou didn't see the Animal Show!\n\n\n\n\n\n\n\nLeads to:\n\"Just how deep are you going to dig your pit of lies?\"\nWait and see.\n\n\n\n\n\n\n\nEdgeworth:\n......\nSahwit:\nIf you have no more use for me... May I leave now?\nEdgeworth:\nMmph... I was too passive... Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\nEdgeworth:\nJust how deep are you going to dig your pit of lies? It's obvious that you did not see the Animal Show!\nSahwit:\nUrgh!\nEdgeworth:\nThere's no way out of this! Tell me what really happened! Confess everything you know about the scream!\nSahwit:\nI cannot answer... What I cannot answer... I-I didn't hear the scream... from the person who discovered the body...\nI'll make you hear a scream!\n\n\n\n\n\n\n\nEdgeworth:\nHaven't you realized it yet? I have you cornered!\nSahwit:\nWhatever are you talking about? I really have no time to waste...\nEdgeworth:\n(Argh... That was a wasted remark.) Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\nDon't you mean the victim's scream?\n\n\n\n\n\n\n\nLeads to:\n\"That's strange.\"\nWait and see.\n\n\n\n\n\n\n\nEdgeworth:\n......\nSahwit:\nIf you have no more use for me... May I leave now?\nEdgeworth:\nMmph... I was too passive... Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\nEdgeworth:\nThat's strange. Normally, if you hear a scream during a murder, it's usually from the victim. Why would you think the scream was from the person who discovered the body?\nSahwit:\nOh! M-My mistake!\nEdgeworth:\nHow? How did you know the scream was from the person who discovered the body?\nSahwit:\nW-Well... That's because...\nYou're the one who found the body!\n\n\n\n\n\n\n\nLeads to:\n\"Allow me to answer for you.\"\nYou're the one who got murdered!\n\n\n\n\n\n\n\nEdgeworth:\nHaven't you realized it yet? I have you cornered!\nSahwit:\nWhatever are you talking about? I really have no time to waste...\nEdgeworth:\n(Argh... That was a wasted remark.) Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\nWait and see.\n\n\n\n\n\n\n\nEdgeworth:\n......\nSahwit:\nIf you have no more use for me... May I leave now?\nEdgeworth:\nMmph... I was too passive... Even if he hides his emotions, if I push the right buttons I'm sure to cause a change!\nLeads back to first\nEdgeworth:\nAllow me to answer for you. That's because you're the one who discovered the body. And... ...the scream that was heard when the murder occurred didn't come from the victim... It came from you when you discovered the body!\n1 PIECE BROKEN\nSahwit:\nUrrrrrrrraaaagh! J-Just who do you think you are!? I-It is just as you say, but... What gives you the right to do this?\nEdgeworth:\nHmph... Checkmate.\nLogic Chess Complete\nEdgeworth:\nIt's now clear who discovered the body. You have no more reason to withhold your testimony... Correct?\nSahwit:\nV-Very well, I'll tell you... B-But I doubt my testimony is worth hearing...\nEdgeworth:\nWhether or not it is worth hearing is for me to decide. I will expose the truth with my own hands. That is my sole duty.\nKay:\nUmm. I think you're a little off there, Mr. Edgeworth.\nEdgeworth:\nWhat do you mean?\nKay:\nWe're not trying to expose the truth, we're trying to save Simeon! Isn't our goal to help out our clients? I mean, you're not a prosecutor right now, you're a defense attorney's assistant!\nEdgeworth:\n...Hmm.\nRay:\nWell said there, Kay! She's right on the money, Miles. The official task of the Edgeworth Law Offices is to defend our clients. Your old man, who founded the firm, truly valued the bonds he had with his clients. So, if you're not willing to do the same, maybe you aren't cut out for this job. I don't wanna fire you on the spot either. So have a heart, OK?\nEdgeworth:\n...... (The heart of a defense attorney, huh...) In any case, it's important that we hear the testimony of the person who discovered the body. Start talking, Mr. Sahwit. Tell me what happened when you found the body!\n-- When I Found the Body --\nSahwit:\nI was in the workroom over there practicing my skills.\nBy some chance, I got curious about the adjacent workroom, and went up to the door.\nI peeked in through the small window on the door.\nThen I saw him lying there... A man... not moving... dead!\nI quailed in fright and found myself letting out a scream.\nEdgeworth:\nIf I may confirm one thing... You were in the room... Right next to the one where the dead body was found?\nSahwit:\nWithin the prison, we call it Workroom B.\nEdgeworth:\nAnd were you in there the whole time on the day of the murder?\nSahwit:\nYes. After the 7 AM roll call, I remained inside the whole time. In this prison, we have roll call 3 times a day. At 7 AM, noon, and 9 PM.\nEdgeworth:\nAnd they check the workrooms during those times, too?\nSahwit:\nExactly.\nEdgeworth:\n(I see... So during the 7 AM roll call, there was nothing amiss. And Knightley's body was not in the workroom yet...)\nPrison Roll Call notes jotted down in my Organizer.\nRay:\nSo it sounds like the murder occurred after 7 AM, huh?\nKay:\nAnd that's right when the Animal Show started!\nSahwit:\nCorrect. The other prisoners went to see the Animal Show.\nEdgeworth:\nMeaning anyone who did not see the show does not have an alibi... Do you understand what I'm saying, Mr. Sahwit?\nSahwit:\nY-Yes, that is certainly true... H-However, I merely discovered the body...\nEdgeworth:\n(His testimony has a clear contradiction. I should press him about that first.)\n\nEdgeworth: Edgeworth: By practicing, you mean, of course... Sahwit: Yes. My grooming training. For I am a model prisoner. Edgeworth: (I somehow doubt that.)\nEdgeworth: Edgeworth: You were curious about the adjacent room? Sahwit: Precisely. I felt a need to look inside. Edgeworth: Why did you feel that way? Sahwit: Even if you ask me why... I just did it on a whim. Edgeworth: So you weren't concentrating on your training? Sahwit: N-No! Nothing of the sort! For I am a model prisoner. It's just that... The other prisoners had left to see the Animal Show. Which is why... I was... feeling somewhat lonely. Kay: Yeah. That's like being stuck in a classroom after school's let out. Sahwit: Y-Yes! That's right! And since I couldn't enter the other workroom...\nEdgeworth: Edgeworth: The small window? So you couldn't get a clear look? Sahwit: Indeed... As you can see, there is a grille covering the window. It does not offer a wide view at all. Kay: Normally, the guards use it to check inside the rooms, right? Sahwit: Precisely. You seem to be well-versed on this matter. Kay: He he he! Well, I happen to know a thing or two about prisons, y'know! Edgeworth: (What does she mean by that? I'll have to find out the details later.) Sahwit: In any case, I peeked into the room from the window.\nEdgeworth: Edgeworth: You knew it was a man right away? Sahwit: It was clear judging from his physique and clothing. Even the fact that he was dead was as plain as day. Edgeworth: You could tell he was dead through that tiny window? Sahwit: Well... It's not the first time I've seen a dead body. Kay: Wha... WHAAAAAAT? S-So, you mean...! The reason you're in here is because... Sahwit: I'm ashamed to admit it, but it is as you say. However, this was my first time seeing a body that someone else had killed...\nEdgeworth: Edgeworth: Do you remember what the scream sounded like? Sahwit: ......Well. All I can say is that I shrieked at the top of my lungs. Ray: Well, I guess that's what happens when you get scared. Sahwit: Yes, it is just as you say. In any case, I let out a scream.\nEdgeworth: (He's pretending to be an innocent bystander, but parts of his testimony are odd. Considering his situation, and the place he's in... The contradiction should be quite obvious. I'll show him the evidence that proves it!)",
      "testimonies": [
        {
          "testimony": "I was in the workroom over there practicing my skills.",
          "person": "Sahwit",
          "present": []
        },
        {
          "testimony": "By some chance, I got curious about the adjacent workroom, and went up to the door.",
          "person": "Sahwit",
          "present": [
            "Door Sensor"
          ],
            "source": {
              "evidence_span": "Fitted to each workshop's door, they detect and react to the prisoners' bracelets when they are near by raising the alarm.",
              "testimony_span": "went up to the door",
              "is_self_contained": "yes",
              "context_span": ""
            }
        },
        {
          "testimony": "I peeked in through the small window on the door.",
          "person": "Sahwit",
          "present": [
            "Door Sensor"
          ],
          "source": {
            "evidence_span": "Fitted to each workshop's door, they detect and react to the prisoners' bracelets when they are near by raising the alarm.",
            "testimony_span": "went up to the door",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "Then I saw him lying there... A man... not moving... dead!",
          "person": "Sahwit",
          "present": []
        },
        {
          "testimony": "I quailed in fright and found myself letting out a scream.",
          "person": "Sahwit",
          "present": []
        }
      ],
      "summarizedContext": "The inmate Sahwit describes his whereabouts when the crime happened.",
      "noPresent": false,
      "labels": [
        "physical"
      ],
      "reasoning": [
        "Fact 1: The witness claims he, an inmate, went up to the workroom door.",
        "Fact 2: The evidence suggests the workroom door has a sensor fitted to it that raises an alarm when an inmate gets close.",
        "Prop 1: If someone was an inmate, he would not be able to go up to the door without raising the alarm."
      ]

    },
    {
      "category": "rebuttal",
      "newContext": "-- When I Found the Body --\nSahwit:\nI was in the workroom over there practicing my skills.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nBy practicing, you mean, of course...\nSahwit:\nYes. My grooming training. For I am a model prisoner.\nEdgeworth:\n(I somehow doubt that.)\nSahwit:\nBy some chance, I got curious about the adjacent workroom, and went up to the door.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou were curious about the adjacent room?\nSahwit:\nPrecisely. I felt a need to look inside.\nEdgeworth:\nWhy did you feel that way?\nSahwit:\nEven if you ask me why... I just did it on a whim.\nEdgeworth:\nSo you weren't concentrating on your training?\nSahwit:\nN-No! Nothing of the sort! For I am a model prisoner. It's just that... The other prisoners had left to see the Animal Show. Which is why... I was... feeling somewhat lonely.\nKay:\nYeah. That's like being stuck in a classroom after school's let out.\nSahwit:\nY-Yes! That's right! And since I couldn't enter the other workroom...\nPresent Door Sensor\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"...Mr. Sahwit. Please stop telling such feeble lies.\"\nSahwit:\nI peeked in through the small window on the door.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThe small window? So you couldn't get a clear look?\nSahwit:\nIndeed... As you can see, there is a grille covering the window. It does not offer a wide view at all.\nKay:\nNormally, the guards use it to check inside the rooms, right?\nSahwit:\nPrecisely. You seem to be well-versed on this matter.\nKay:\nHe he he! Well, I happen to know a thing or two about prisons, y'know!\nEdgeworth:\n(What does she mean by that? I'll have to find out the details later.)\nSahwit:\nIn any case, I peeked into the room from the window.\nPresent Door Sensor\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"...Mr. Sahwit. Please stop telling such feeble lies.\"\nSahwit:\nThen I saw him lying there... A man... not moving... dead!\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou knew it was a man right away?\nSahwit:\nIt was clear judging from his physique and clothing. Even the fact that he was dead was as plain as day.\nEdgeworth:\nYou could tell he was dead through that tiny window?\nSahwit:\nWell... It's not the first time I've seen a dead body.\nKay:\nWha... WHAAAAAAT? S-So, you mean...! The reason you're in here is because...\nSahwit:\nI'm ashamed to admit it, but it is as you say. However, this was my first time seeing a body that someone else had killed...\nSahwit:\nI quailed in fright and found myself letting out a scream.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nDo you remember what the scream sounded like?\nSahwit:\n......Well. All I can say is that I shrieked at the top of my lungs.\nRay:\nWell, I guess that's what happens when you get scared.\nSahwit:\nYes, it is just as you say. In any case, I let out a scream.\nEdgeworth:\n(He's pretending to be an innocent bystander, but parts of his testimony are odd. Considering his situation, and the place he's in... The contradiction should be quite obvious. I'll show him the evidence that proves it!)\nEdgeworth:\n...Mr. Sahwit. Please stop telling such feeble lies. You don't seem to understand your position.\nSahwit:\nMy position? I-I used to be a newspaper salesman, but then I took up the pet groomer training...\nEdgeworth:\nEdgeworth:\nWhat about that bracelet on your wrist? It proves that you are... unmistakably a prisoner. And as long as you wear that bracelet, you should not be able to move around as you please! As soon as you went through the door, the sensor would have sounded the alarm.\nSahwit:\nOh, er... That is...\nEdgeworth:\nPeeking into the adjacent room is impossible... When you couldn't even leave the one you were in!\nSahwit:\nArgh!\nRay:\nWhoo-wee! Nice one, Miles! That was a real humdinger!\nKay:\nBut does that mean Mr. Sahwit didn't see the body?\nEdgeworth:\nI'm not sure. Perhaps... We should let the man himself explain it to us.\nSahwit:\nHuh? Umm... You see... That is... Well... Forgive me. It appears my previous explanation was lacking... I shall clearly explain how I was able to see the body.\nEdgeworth:\nHmph. Very well, let us hear your revised testimony.\n-- When I Found It, Pt. 2 --\nSahwit:\nThere is a rather well-known technique among the prisoners here...\nIf the hand with the bracelet stays in the room, you can step out without sounding the alarm.\nThat's how I was able to peek into the adjacent room.\nThe moment I realized that the man inside was dead, I let out a scream.\nEdgeworth:\n(Hmm, so that means... He kept his arm inside workroom B, while he peeked into the adjacent room.)\nSahwit:\nI'd appreciate it if you didn't mention this to everyone. Especially the guards... OK?\nEdgeworth:\n(Was that what he was trying to hide earlier...? I should try asking him for more details about a few other things as well.)\n\nEdgeworth: Edgeworth: Tell me more about this technique. Sahwit: Certainly. Here's how it works...\nEdgeworth: Edgeworth: All you gain by doing that is a small degree of freedom. Sahwit: Naturally. But it is all that we have left to enjoy. Edgeworth: ...I'm shocked that you enjoy such a thing. Have you truly reflected on what you've done? Sahwit: But of course! For I am a model prisoner! Edgeworth: (Your definition of \"model\" is highly suspicious...) Regardless, was that the one technique you used? Sahwit: Yes. That is correct. I made sure no guards were around when I did it.\nEdgeworth: Edgeworth: Why would you do something so troublesome and potentially dangerous? Sahwit: I heard a noise coming from the adjacent room... It seemed odd to me, as there should not have been anyone inside... Edgeworth: So you peeked into the adjacent workroom as soon as you heard the noise? Sahwit: Yes. Yes. Of course. I peeked in as soon as I could. Edgeworth: I see... (Is there a problem with that statement?) There is a problem Leads to: \"So you looked into the adjacent room immediately after you heard the noise.\" There is no problem Edgeworth: (No... There doesn't seem to be a problem with that statement.) Please continue with your testimony, Mr. Sahwit. Sahwit: Certainly. I peeked inside the workroom... Edgeworth: So you looked into the adjacent room immediately after you heard the noise. If that was true, then you should have seen more than just a dead body. You should have seen the person who had made the noise. Sahwit: Th-That is... Um... Well... Kay: He looks really shaken! Edgeworth: Mr. Sahwit! Answer me! What did you really see? Sahwit: ............ Edgeworth: If you intend to remain silent... ...I will have no choice but to assume that you are complicit to the murder. Sahwit: ! Oh... Umm... Please forgive me. It's just that I couldn't even believe what I saw myself... It may have been just a dream. I hesitate to even recall it. Edgeworth: Tell me what happened! Sahwit: Very well... I will be frank with you. I saw a dog. ...It was a nightmarish scene. A large black dog... ...was biting into the neck of the victim! Edgeworth: Wha-! What did you say! Sahwit: It was a truly hellish scene... That dog! That dog killed him! Kay: Ooooooh... I think I'm going to be sick... Ray: That's some Grade A trauma right there... Sahwit: I was chilled to my very core, and let out a shriek. Edgeworth: (A man-eating dog inside this zoo of a prison...?) Black Dog data jotted down in my Organizer. Sahwit: That was everything I saw. Do you believe me now? Edgeworth: ...Yes, I do. I doubt one would be able to lie about something like that. Would you add that to your testimony? Sahwit: Certainly... Add statement: \"And to my horror, there was a black dog biting his neck!\" Leads to: \"So you looked into the adjacent room immediately after you heard the noise.\" Edgeworth: (No... There doesn't seem to be a problem with that statement.) Please continue with your testimony, Mr. Sahwit. Sahwit: Certainly. I peeked inside the workroom...\nEdgeworth: Edgeworth: Just to be certain, allow me to reconfirm. Why did you look into the room next door? Sahwit: Yes, I will repeat it as many times as you would like, yes. I heard what sounded like faint footsteps coming from the adjacent room... In a flash, I was peeking in through the window on the door. I believe that is what being a model prisoner is all about. When you're a model prisoner, you must set an example for everyone to follow. Edgeworth: (I'm not sure I agree with his mindset, but...) Very well. Then please tell me exactly what you saw in the room.\nEdgeworth: Edgeworth: Do you remember what this man looked like in a detail? Sahwit: But of course. I am certain... He had blond hair... And his throat was covered in blood. Edgeworth: Do you take me for a fool? That should be obvious! Sahwit: I am merely telling you everything as I saw it, just to be clear. ...Don't defense attorneys love nitpicking over every little detail? Edgeworth: (I detect a tinge of spite here. Perhaps he had an unpleasant experience with a defense attorney in the past...)\nEdgeworth: Edgeworth: A black dog was biting the victim's neck... Sahwit: Yes. Blood came pouring out, and as a result, the dog's mouth became stained with it... Ray: Ahhhhh! Stop! Stop! You don't need to get THAT detailed! Edgeworth: At that time, was the victim...!? Kay: Eeeeeeeeek! Mr. Edgeworth! Why'd you ask him that? Ray: Kay... Why'd you hit Uncle Ray? Sahwit: The man did not even flinch... Edgeworth: (He must have been dead already...) Sahwit: But the blood continued to gush from his neck. He most likely had passed away already. His hands moved nary an inch... Ray: Eeee! Way too much detail! Are you doing this on purpose? Sahwit: Certainly not. I am just trying to give an accurate testimony... Mr. Edgeworth. Shall I add that statement to my testimony? Edgeworth: If you would. Sahwit: It was terrifying... A truly terrifying sight. Add statements: \"He most likely had passed away already. His hands moved nary an inch...\" and \"The ring with the snowflake insignia glimmered, with no purpose but to catch my eye.\"\nEdgeworth: Edgeworth: I would like to hear the details about that again. Sahwit: Very well. That fearsome beast was gnawing away at the... Kay: Aaah! Enough already! I don't want to hear anymore! Sahwit: ...And then the blood, gushing out of the... Ray: Eeee! Didn't you hear the lady? Uncle Ray's got goosebumps too! Sahwit: ...And that was the state of the body. Do you understand the situation now? Edgeworth: (Those two were so noisy, I couldn't hear him very well...) Mr. Sahwit. Please speak a little more about the state of the victim.\nEdgeworth: Edgeworth: That was a very vivid testimony... Sahwit: That is because I witnessed it up close, relatively speaking. I could feel the anguish he suffered in his death. Kay: M-Mr. Edgeworth... I won't be able to sleep tonight. Edgeworth: Really? How terrible. Kay: Oh, come on! It's all because of you that my mind is filled with scary thoughts. Sahwit: I may even have nightmares myself. Even now, I can still remember everything clearly.\nEdgeworth: Edgeworth: A ring with a snowflake insignia... Impressive memory. Sahwit: I was formerly a newspaper salesman. I had to quickly identify what a customer wanted based on his appearance and attitude... ...in order to form a successful sales strategy. It's the most basic of the basics. Edgeworth: But you are dealing with a corpse, not a customer. Are you like that with everyone? Sahwit: Yes, it has already become an ingrained habit of mine. It was an important point that could determine the success or failure of a sale. Edgeworth: That's how you were able to easily recall such a minor detail. Sahwit: Precisely. Even the engraved insignia is crystal clear. Edgeworth: (Is that really possible...? What was the state of the body when we found it? I should review my evidence.) Sahwit: I have an unerring eye. That much I can declare.\nEdgeworth: (So he was able to peek into the adjacent room by keeping one arm inside the workroom. But was that really what he was trying to hide? I should ask him for a further explanation.)\nEdgeworth: So, Knightley was killed by a dog that was being kept here in the prison? I find that hard to believe... Ray: They say that pets take after their owners, yeah? Kay: It doesn't have to take after them THAT much! This completely defeats the purpose of the animal therapy! Edgeworth: (Perhaps I should ask about the dog a little more.)",
      "testimonies": [
        {
          "testimony": "There is a rather well-known technique among the prisoners here...",
          "person": "Sahwit",
          "present": []
        },
        {
          "testimony": "If the hand with the bracelet stays in the room, you can step out without sounding the alarm.",
          "person": "Sahwit",
          "present": []
        },
        {
          "testimony": "That's how I was able to peek into the adjacent room.",
          "person": "Sahwit",
          "present": []
        },
        {
          "testimony": "The moment I realized that the man inside was dead, I let out a scream.",
          "person": "Sahwit",
          "present": []
        },
        {
          "testimony": "And to my horror, there was a black dog biting his neck!",
          "person": "Sahwit",
          "present": []
        },
        {
          "testimony": "He most likely had passed away already. His hands moved nary an inch...",
          "person": "Sahwit",
          "present": []
        },
        {
          "testimony": "The ring with the snowflake insignia glimmered, with no purpose but to catch my eye.",
          "person": "Sahwit",
          "present": [
            "Mr. Knight's Body"
          ],
          "source": {
            "evidence_span": "The victim had a ring on his right hand, which was covered by a sheet when the body was discovered.",
            "testimony_span": "The ring with the snowflake insignia glimmered, with no purpose but to catch my eye.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        }
      ],
      "summarizedContext": "The witness Sahwit describes the state of the body when he saw it.",
      "noPresent": false,
      "labels": [
        "physical"
      ],
      "reasoning": [
        "Fact 1: The witness claims he saw the victim's ring.",
        "Fact 2: The evidence suggests the victim's ring was covered by sheet.",
        "Prop 1: If something is covered by a sheet, it cannot be seen from afar."
      ]
    },
    {
      "category": "rebuttal",
      "newContext": "-- When I Found It, Pt. 2 --\nSahwit:\nThere is a rather well-known technique among the prisoners here...\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nTell me more about this technique.\nSahwit:\nCertainly. Here's how it works...\nSahwit:\nIf the hand with the bracelet stays in the room, you can step out without sounding the alarm.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nAll you gain by doing that is a small degree of freedom.\nSahwit:\nNaturally. But it is all that we have left to enjoy.\nEdgeworth:\n...I'm shocked that you enjoy such a thing. Have you truly reflected on what you've done?\nSahwit:\nBut of course! For I am a model prisoner!\nEdgeworth:\n(Your definition of \"model\" is highly suspicious...) Regardless, was that the one technique you used?\nSahwit:\nYes. That is correct. I made sure no guards were around when I did it.\nSahwit:\nThat's how I was able to peek into the adjacent room.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nWhy would you do something so troublesome and potentially dangerous?\nSahwit:\nI heard a noise coming from the adjacent room... It seemed odd to me, as there should not have been anyone inside...\nEdgeworth:\nSo you peeked into the adjacent workroom as soon as you heard the noise?\nSahwit:\nYes. Yes. Of course. I peeked in as soon as I could.\nEdgeworth:\nI see... (Is there a problem with that statement?)\n\n\n\nThere is a problem\n\n\n\n\n\n\n\nLeads to:\n\"So you looked into the adjacent room immediately after you heard the noise.\"\n\n\n\n\nThere is no problem\n\n\n\n\n\n\n\nEdgeworth:\n(No... There doesn't seem to be a problem with that statement.) Please continue with your testimony, Mr. Sahwit.\nSahwit:\nCertainly. I peeked inside the workroom...\n\n\nEdgeworth:\nSo you looked into the adjacent room immediately after you heard the noise. If that was true, then you should have seen more than just a dead body. You should have seen the person who had made the noise.\nSahwit:\nTh-That is... Um... Well...\nKay:\nHe looks really shaken!\nEdgeworth:\nMr. Sahwit! Answer me! What did you really see?\nSahwit:\n............\nEdgeworth:\nIf you intend to remain silent... ...I will have no choice but to assume that you are complicit to the murder.\nSahwit:\n! Oh... Umm... Please forgive me. It's just that I couldn't even believe what I saw myself... It may have been just a dream. I hesitate to even recall it.\nEdgeworth:\nTell me what happened!\nSahwit:\nVery well... I will be frank with you. I saw a dog. ...It was a nightmarish scene. A large black dog... ...was biting into the neck of the victim!\nEdgeworth:\nWha-! What did you say!\nSahwit:\nIt was a truly hellish scene... That dog! That dog killed him!\nKay:\nOoooooh... I think I'm going to be sick...\nRay:\nThat's some Grade A trauma right there...\nSahwit:\nI was chilled to my very core, and let out a shriek.\nEdgeworth:\n(A man-eating dog inside this zoo of a prison...?)\nBlack Dog data jotted down in my Organizer.\nSahwit:\nThat was everything I saw. Do you believe me now?\nEdgeworth:\n...Yes, I do. I doubt one would be able to lie about something like that. Would you add that to your testimony?\nSahwit:\nCertainly...\nAdd statement:\n\"And to my horror, there was a black dog biting his neck!\"\nPress (after adding statement)\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nJust to be certain, allow me to reconfirm. Why did you look into the room next door?\nSahwit:\nYes, I will repeat it as many times as you would like, yes. I heard what sounded like faint footsteps coming from the adjacent room... In a flash, I was peeking in through the window on the door. I believe that is what being a model prisoner is all about. When you're a model prisoner, you must set an example for everyone to follow.\nEdgeworth:\n(I'm not sure I agree with his mindset, but...) Very well. Then please tell me exactly what you saw in the room.\nSahwit:\nThe moment I realized that the man inside was dead, I let out a scream.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nDo you remember what this man looked like in a detail?\nSahwit:\nBut of course. I am certain... He had blond hair... And his throat was covered in blood.\nEdgeworth:\nDo you take me for a fool? That should be obvious!\nSahwit:\nI am merely telling you everything as I saw it, just to be clear. ...Don't defense attorneys love nitpicking over every little detail?\nEdgeworth:\n(I detect a tinge of spite here. Perhaps he had an unpleasant experience with a defense attorney in the past...)\nSahwit:\nAnd to my horror, there was a black dog biting his neck!\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nA black dog was biting the victim's neck...\nSahwit:\nYes. Blood came pouring out, and as a result, the dog's mouth became stained with it...\nRay:\nAhhhhh! Stop! Stop! You don't need to get THAT detailed!\nEdgeworth:\nAt that time, was the victim...!?\nKay:\nEeeeeeeeek! Mr. Edgeworth! Why'd you ask him that?\nRay:\nKay... Why'd you hit Uncle Ray?\nSahwit:\nThe man did not even flinch...\nEdgeworth:\n(He must have been dead already...)\nSahwit:\nBut the blood continued to gush from his neck. He most likely had passed away already. His hands moved nary an inch...\nRay:\nEeee! Way too much detail! Are you doing this on purpose?\nSahwit:\nCertainly not. I am just trying to give an accurate testimony... Mr. Edgeworth. Shall I add that statement to my testimony?\nEdgeworth:\nIf you would.\nSahwit:\nIt was terrifying... A truly terrifying sight.\nAdd statements:\n\"He most likely had passed away already. His hands moved nary an inch...\" and \"The ring with the snowflake insignia glimmered, with no purpose but to catch my eye.\"\nPress (after adding statement)\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nI would like to hear the details about that again.\nSahwit:\nVery well. That fearsome beast was gnawing away at the...\nKay:\nAaah! Enough already! I don't want to hear anymore!\nSahwit:\n...And then the blood, gushing out of the...\nRay:\nEeee! Didn't you hear the lady? Uncle Ray's got goosebumps too!\nSahwit:\n...And that was the state of the body. Do you understand the situation now?\nEdgeworth:\n(Those two were so noisy, I couldn't hear him very well...) Mr. Sahwit. Please speak a little more about the state of the victim.\nSahwit:\nHe most likely had passed away already. His hands moved nary an inch...\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThat was a very vivid testimony...\nSahwit:\nThat is because I witnessed it up close, relatively speaking. I could feel the anguish he suffered in his death.\nKay:\nM-Mr. Edgeworth... I won't be able to sleep tonight.\nEdgeworth:\nReally? How terrible.\nKay:\nOh, come on! It's all because of you that my mind is filled with scary thoughts.\nSahwit:\nI may even have nightmares myself. Even now, I can still remember everything clearly.\nSahwit:\nThe ring with the snowflake insignia glimmered, with no purpose but to catch my eye.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nA ring with a snowflake insignia... Impressive memory.\nSahwit:\nI was formerly a newspaper salesman. I had to quickly identify what a customer wanted based on his appearance and attitude... ...in order to form a successful sales strategy. It's the most basic of the basics.\nEdgeworth:\nBut you are dealing with a corpse, not a customer. Are you like that with everyone?\nSahwit:\nYes, it has already become an ingrained habit of mine. It was an important point that could determine the success or failure of a sale.\nEdgeworth:\nThat's how you were able to easily recall such a minor detail.\nSahwit:\nPrecisely. Even the engraved insignia is crystal clear.\nEdgeworth:\n(Is that really possible...? What was the state of the body when we found it? I should review my evidence.)\nSahwit:\nI have an unerring eye. That much I can declare.\nPresent Crime Scene Notes\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"A ring with a snowflake insignia...?\"\nBefore adding 5th statement\n\n\n\n\n\n\n\nEdgeworth:\n(So he was able to peek into the adjacent room by keeping one arm inside the workroom. But was that really what he was trying to hide? I should ask him for a further explanation.)\nAfter adding 5th statement\n\n\n\n\n\n\n\nEdgeworth:\nSo, Knightley was killed by a dog that was being kept here in the prison? I find that hard to believe...\nRay:\nThey say that pets take after their owners, yeah?\nKay:\nIt doesn't have to take after them THAT much! This completely defeats the purpose of the animal therapy!\nEdgeworth:\n(Perhaps I should ask about the dog a little more.)\nEdgeworth:\nA ring with a snowflake insignia...?\nSahwit:\nYes, that is correct. It was clearly engraved on the surface.\nEdgeworth:\nI see. Your testimony is very accurate, But it's a little TOO accurate, if you ask me.\nSahwit:\nAnd what's wrong with being accurate?\nEdgeworth:\nYou state that you saw a ring with a snowflake insignia engraved into it. And it is true that the victim was wearing such a ring.\nSahwit:\nSee? Was I not correct?\nEdgeworth:\nThat is not the issue I have with your testimony. Take a look at this picture! As you can see, the right hand is covered by a sheet. It should not have been possible for you to see the engraving on the ring. Unless you had approached the body and lifted up the sheet for yourself! You said you only looked into the workroom through the door. And yet, you gave such a detailed account of what you saw.\nSahwit:\nWho do you think you are...? Acting all high and mighty. I-I'm telling you, I saw what I saw! Oh! The victim must have moved his arm after I saw it...\nEdgeworth:\nEdgeworth:\nI don't think so. You said as much earlier.\nSahwit:\nThe man did not even flinch...\nEdgeworth:\n(He must have been dead already...)\nEdgeworth:\nThe victim was already dead. How would he have been able to move his arm?\nSahwit:\n......!\nRay:\nThis guy's lookin' pretty suspicious now, yeah?\nEdgeworth:\nFrank Sahwit! What are you hiding, you scoundrel!\nSahwit:\n......Ooh. No, I ain't... I am not... That is... You're wrong. I know what I saw... ...Urrrrrgh... Gwaaaaaaaaaaaah! Shut up already! Stop making a fuss about every little thing I say! You're just a defense attorney's assistaaaant!!\nEdgeworth:\n(...He has finally shown his true self...)\nRay:\nWhoa. I guess the cat's out of the bag. A black, hairy one at that. ...Just went flyin'.\nSahwit:\nI'm just your friendly neighborhood witness!\nEdgeworth:\nAre you really just a witness? I would you say that you are rather suspicious.\nSahwit:\nWhat was that?\nEdgeworth:\nYou saw something that could not have been seen from the outside of the room. How is that possible? ...The logic behind it is simple. Mr. Sahwit. This is where you saw the body from!\nPresent Workroom A\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"When you discovered the body, you went inside the room where it laid!\"\nPresent anywhere else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThis is where you saw the body from.\nKay:\nHe was able to see the body from a place like that? I get it! So you're saying Mr. Sahwit is psychic, right?\nEdgeworth:\nNo... Nothing of the sort. (Let me think it over once again. If he saw something that he could not have seen from the outside of the room... ...he could only have seen the body from that spot!)\nLeads back to:\n\"Mr. Sahwit. This is where you saw the body from!\"\nEdgeworth:\nWhen you discovered the body, you went inside the room where it laid! Since you saw the engraving on the ring, that is the only possibility!\nSahwit:\n.......... Heh... He he! Even if you say that, you ain't got no evidence, do ya? Where's the evidence that shows that I was in that room? I was grooming pets at that time. In the room adjacent to where the body was found! I even went so far as to borrow some rubber gloves! Show me the evidence that proves I was in the room where the body was found!\nPresent Rubber Glove\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Mr. Sahwit, what were you doing when the body was discovered?\"\nPresent anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nSahwit:\nAnd what does that that prove?\nEdgeworth:\nHmph... I guess you won't understand unless I explain it.\nSahwit:\nYeah, I don't get it at all! That evidence doesn't mean squat!\nEdgeworth:\nUrgh! (I should be careful when I bluff...)\nLeads back to:\n\"Show me the evidence that proves I was in the room where the body was found!\"\nEdgeworth:\nMr. Sahwit, what were you doing when the body was discovered?\nSahwit:\nDidn't I tell you already? I was practicing being a pet groomer!\nEdgeworth:\nI see. In that case... Do you happen to recognize this glove?\nSahwit:\nOh! Th-That's...!\nEdgeworth:\nThis was found near the body. It is believed to have been dropped by the culprit. By the way... I noticed that you also have a rubber glove hanging out of your apron pocket...\nSahwit:\nN-No, this is... something else!\nEdgeworth:\nEdgeworth:\nLooks like you're missing one of your gloves.\nSahwit:\nY-You can find gloves like these anywhere in the prison! Your evidence proves nothing!\nEdgeworth:\nEdgeworth:\nHmph. Perhaps we should hand this glove over to the police for fingerprinting. I'm certain they will find some interesting results.\nSahwit:\nGrr... Grr... Grrrrrrrrrrrrrrrrraaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaahhh!!!\nEdgeworth:\n(It's over...)\nRay:\nEdgeworth:\n(Wh-What the...?)\nRay:\nHe he he. Pretty cool, right? My \"Objection!\" voice.\nEdgeworth:\nMr. Shields. Could you save the jokes for later...\nRay:\nI'm not joking. Because it's not over yet. There's still something else. Something that's clearly odd. That guy's a prisoner, y'know. He's got the bracelet and all.\nSahwit:\n..........\nKay:\nThat's right! How did he get into the other workroom? The sensor would have set off the alarm, right?\nEdgeworth:\n(...He's right. That's the only thing we don't know yet.)\nRay:\nNot so fast, Mr. Prisoner. Could you fill us in?\nSahwit:\n..........\nRay:\nThat's pretty weird. The bracelet should have been his last line of defense.\nKay:\nDefense?\nRay:\nThat's right, Kay. It was useful evidence for Mr. Prisoner here. He could have claimed that due to the bracelet, he wasn't able to enter the room... But, he didn't say a word about it. Is there any reason why you didn't?\nSahwit:\n..........\nRay:\nThe silent treatment, eh? Well, the Judge yesterday did say that silence is golden.\nKay:\nW-Wow... You really are a hotshot defense attorney, Mr. Shields!\nRay:\nDefense attorneys always remain calm in a pinch, and smile in the face of danger. That's what your old man taught me. The Defense Attorney's Creed, yeah? ...So, what's the deal? Why didn't you mention anything about the bracelet?\nSahwit:\n.......... ...The truth is... It's broken.\nEdgeworth:\n(Broken?)\nSahwit:\nSome time ago, I took a spill and the bracelet hit the floor with a loud bang. Ever since then, it was not been able to activate the sensor. Forgive me. It was so convenient, I didn't want to report it...\nEdgeworth:\nI see... So the bracelet was broken. (But did it really break so easily? If that is true, then there is a problem with the prison's security.)\nEdgeworth:\nYou, over there. May I have a moment?\nGuard:\nHere, kitty kitty. You're such a cute little guy! Yes, you are! Meow~!\nEdgeworth:\nExcuse me!\nGuard:\nY-Yes! What can I do for meow?\nEdgeworth:\nThis prisoner's bracelet appears to be broken.\nGuard:\nWhat! Really!? That's not good at all. I'll contact the person in charge and have it replaced immediately!\nEdgeworth:\nThank you. I'll be holding onto the broken bracelet for the time being.\nSahwit's Bracelet data jotted down in my Organizer.\nGuard:\nYes, sir! Please take care of it.\nRay:\nNow that the bracelet's been taken care of, shall we move on to arresting you for murder?\nSahwit:\nWhat? Perish the thought! I didn't kill anyone!\nRay:\nBut your bracelet was broken, right? Doesn't that mean you could have gone anywhere you wanted during the Animal Show?\nSahwit:\nBut all I did was find the body! Honest! And it is true that I saw the dog biting his neck! However, I entered the workroom after the dog had left...\nEdgeworth:\nWhy did you do that?\nSahwit:\nWell, it was just... I was curious if he had anything of value on him...\nEdgeworth:\n(So he was planning to loot the corpse. That's why he remembers Knightley's ring so well.)\nKay:\nWhy are you looking at me, Mr. Edgeworth!? I am a GREAT Thief! Please don't put me on the same level as him!\nSahwit:\nBut! I didn't take a thing! The Animal Show had ended and the other prisoners were making their way back down here. I hurried back to my workroom, and let out a scream to deceive the others.\nRay:\nAnd that's when you dropped your rubber glove.\nRubber Glove data updated in my Organizer.\nExamine evidence\n\n\n\n\n\n\n\n\n\nMud on Rubber Glove\n\n\n\n\n\n\n\nEdgeworth:\nIt's covered in mud, up to the wrist. What did Frank Sahwit use this for?\n\n\n\n\nText on the wrist of Rubber Glove\n\n\n\n\n\n\n\nEdgeworth:\nIt says \"FOR INMATE USE\". That must mean...\nKay:\nA prisoner used this glove?\nEdgeworth:\nYes. Frank Sahwit was the one who used this glove.\nRay:\nI guess his story holds up. What do you think, Miles?\nEdgeworth:\nWhether he is the murderer or not, one big question remains. How did Knightley get all the way from his holding cell to the prison?\nRay:\nYou're right about that. It's a real stumper.\nEdgeworth:\nAnd there's something Mr. Sahwit said in his testimony that I'm very concerned about. (If that dog had any part in the murder...) Mr. Sahwit.\nSahwit:\nY-Y-Yes! What is it?\nEdgeworth:\nWere there any other prisoners who didn't see the Animal Show?\nSahwit:\n...Yes. There is only one other that I know of.\nEdgeworth:\nAnd this prisoner wouldn't have been able to see the show even if he wanted to. Correct?\nSahwit:\nY-Yes, that's correct. Why do you ask?\nEdgeworth:\n(Just as I thought... I had my suspicions as soon as I saw that black dog. That fiendish criminal... I never expected him to be held here in this prison.) Where is his cell...?\nSahwit:\nErr... Do you intend to meet him?\nKay:\nHim...? Who's him?\nSahwit:\nHe's a very special man. He receives very special treatment, and... ...Oh, forgive me. I need to watch what I say about him. However... If you value your lives, I would advise you to stay away from him.\nKay:\nHey! C-Cut it out already! You're giving me the creeps!\nRay:\nHm, a puppet master in the shadows, huh? Yeah... I still value my life...\nSahwit:\nHe is being held in the special cell. Over there... In that direction...\nEdgeworth:\n(The special cell...? It certainly seems like he receives special treatment.)\nFloor Plans updated in my Organizer.\nKay:\nWell, so just who is this \"him\" anyway?\nSahwit:\n...To protect my own life, all I can tell you is that he is the oldest prisoner here. My deepest apologies... But I can't say anymore... He is truly terrifying!\nEdgeworth:\n......\nRay:\nCare to fill me in? It feels like you're leaving Uncle Ray behind here.\nEdgeworth:\nHe is someone I knew in the past... Let's head for the special cell. I believe that black dog should be there as well.\nPartner\n\n\n\n\n\n\n\nKay:\nYeah, what's up?\n\n\n\nThe special cell\n\n\n\n\n\n\n\nKay:\nWhat's so special about the special cell? Is it the super tight security that makes it inescapeable? Or is there a red carpet and a sofa and a bed... And you get the VIP treatment?\nEdgeworth:\nCalm down. We'll know when we see it. (If I am not mistaken, \"that man\" should be in there.)\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nBlack Dog\n\n\n\n\n\n\n\nKay:\nUuugh... Just looking at him gives me the creeps.\nEdgeworth:\nSo there are things that you're scared of, Kay.\nKay:\nWell, of course! The police, security guards, sirens, there's lots of things!\nEdgeworth:\nNormally, those things give you a sense of security.\nKay:\nEheheh... Well, I'm not a normal girl. That's because...\nEdgeworth:\n\"I'm the Great Thief.\" ...right?\nKay:\nMr. Edgeworth! Please don't steal my lines!\nEdgeworth:\nHm... That felt kind of nice.\nPrisoner in a cell\n\n\n\n\n\n\n\nPrisoner:\nHey, hey, you guys! The stuff he said, is it true?\nEdgeworth:\nHm? What are you talking about?\nPrisoner:\nAll that talk about his bracelet being broken! Man, I'd kill for a chance like that!\nEdgeworth:\nEven in prison, this man has not reformed in the slightest.\nPrisoner:\nDang it...! I just want to go around and pet all the animals in this prison.\nKay:\n...Maybe he just loves animals?\nFrank Sahwit\n\n\n\n\n\n\n\nSahwit:\nDamn! I can't believe the truth about the bracelet is out of the bag...!\nEdgeworth:\nSeems like, you still haven't realized the error of your ways?\nSahwit:\nN... No, sir! I-It's nothing at all. Wh-Why don't you hurry towards the special cell?\nEdgeworth:\nLet me give you some advice... It would be wise not to take any more unnecessary actions.\nSahwit:\nY-Yes, sir. I'll take it to heart. Tsk... As if I need to hear that from you...!\nEdgeworth:\nIt would also be wise not to say any more unnecessary words.\nRaymond Shields\n\n\n\n\n\n\n\nRay:\nWho would have guessed that the bracelet was broken. I thought the security here was supposed to be tight.\nEdgeworth:\nWhen I saw all those animals roaming around freely, I knew that something was amiss. At the very least, as long as that person is here...!\nRay:\nThe person that the inmate mentioned... Well, let's hurry up and head to the special cell. That black dog might be there... We should proceed with caution.\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nBlack Dog\n\n\n\n\n\n\n\nRay:\nHow scary. A man-eating dog.\nEdgeworth:\nIf that is indeed the truth.\nRay:\nEh? Do you think the dog is innocent, Miles?\nEdgeworth:\nI still... do not know yet. However, in order to arrive at the truth... ...I won't avert my eyes from any questions that arise, no matter how small they are. The smallest oversight could shut the door to the truth forever.\nRay:\nHmm... You really have changed, Miles.\nEdgeworth:\n(It might be more accurate to say that I have been changed. ...By that attorney.)\nCat\n\n\n\n\n\n\n\nEdgeworth:\nHm... A cat.\nKay:\nAww! It's so cute, meow~!\nEdgeworth:\n...Kay. Could you please talk like a normal person?\nKay:\nIf I had this little guy with me, prison life wouldn't be so bad... No, no! I mustn't think like that, meow~.\nEdgeworth:\n(Right now, all she can understand is cat speak...)\nMarch 28, 12:41 PMPrisonSpecial Cell\nKay:\nHey, it's pitch black in here... I can't see a thing at all!\nEdgeworth:\nAren't you always talking about how the Yatagarasu is able to flap even in the darkest night?\nKay:\nEven in the depths of night, when no other bird dares to take flight... ...one alone soars to shine the light of righteousness on the world's blight! And that one is me! For I am the Great Thief, Yatagarasu!\nRay:\nOh-ho! That was pretty cool!\nKay:\nBut still, I can't see what I can't see! I'm still just a human! Eek!\nRay:\nAahhh!\n???:\n.....Mr. Edgeworth, I presume?\nEdgeworth:\n(That voice... It can only be...)\n???:\nIt has been far too long.\nEdgeworth:\nSo you still remember me?\n???:\nKeh heh, it would be impossible to forget. Because it was you who did what none could do... ...and place me here in this cell.\nKay:\nUm... Don't tell me that the dog is talking to you, Mr. Edgeworth.\nRay:\nIs there someone else there? I can't see anything though...\nKanis:\nDown boy. It is rude to frighten the visitors. Here. Allow me to illuminate this dark room. Keh heh heh... Such noisy visitors. From the voices and footsteps... Two more in the back. But it would be rude not to introduce myself. I am called Bodhidharma Kanis. Mr. Edgeworth and I... We are old acquaintances. Keh heh heh...\nEdgeworth:\n(This man is a former assassin.) The blind assassin... Bodhidharma Kanis. His weapons are sharp knives and a ferocious dog. His appearance is always accompanied by the sound of a bell. It is said that the ringing of this bell in the darkness is the last sound his victims hear.\nKanis:\nWould you be so kind as to share the reason why you have come, Mr. Edgeworth?\nEdgeworth:\nThat will not be necessary. You are already well aware of why we're here.\nKanis:\nKeh heh heh. It seems we know each other quite well.\nMurder suspect\n\n\n\n\n\n\n\nEdgeworth:\nWe suspect your dog of committing the murder. The witness who discovered the body saw him biting it.\nKanis:\nThere must be some mistake. My boy is obedient. He would never do such a thing. Right... Anubis? Good boy, good boy, good boy.\nEdgeworth:\n(Anubis may be your guide dog, but you raised him to be a vicious killer. He was one of the weapons you used as an assassin...)\nKanis:\nTo begin with, is the witness of a reliable sort?\nEdgeworth:\n(Ugh. It's true that Sahwit is also one of the suspects. And it's difficult to say if we can trust his testimony...)\nKanis:\nIn any case, I think you have the wrong dog. Right, Anubis? Right, boy?\nEdgeworth:\n(I wonder... If he knows who the witness is.)\nThe alibi (appears after Murder suspect)\n\n\n\n\n\n\n\nEdgeworth:\nI would like to hear your alibi from 8 AM to 10 AM yesterday morning.\nKanis:\nDuring the Animal Show? Keh heh heh... I was in my humble cell the entire time. I took up whittling recently. My focus was solely on the wood and chisel in my hands.\nEdgeworth:\nThe prisoners have free access to chisels here? Normally, that's not allowed.\nKanis:\nThe warden is a kind soul. She has given me special permission.\nEdgeworth:\n(Kind...? Ridiculous! Even five metal chisels... ...would become deadly weapons in his hands!)\nKanis:\nI started out by carving these Buddha statues. But I moved on to other shapes after the 674th.\nKay:\nReally? That many?\nKanis:\nAll it takes is time, which I have plenty of. Here is what I am working on now.\nEdgeworth:\nI did not know that you played chess...\nKanis:\nDo you play as well, Mr. Edgeworth? I would like to test your wits in a game sometime. I only started playing since my arrival here, so I am still inexperienced.\nEdgeworth:\n(Hm? What is this piece? It's a three-headed... dog?)\nKanis:\nJust for the fun of it, I carved this hound piece. Chess is a game of war. Pawns, knights and castles... Each side pushing their forces to the limits to take the life of enemy's king. However, I found the absence of dogs to be strange. Hounds are an indispensable part of warfare. But... It is nothing more than folly. I still play by all the normal rules of chess.\nEdgeworth:\nIsn't it difficult for you to find opponents here in prison?\nKanis:\nI always play correspondence chess.\nEdgeworth:\nCorrespondence chess... So you play chess through the mail.\nKanis:\nPrisoners are allowed to send and receive letters, although they are subject to inspection. At the moment, I am waiting for my opponent's next move.\nHound Piece data jotted down in my Organizer.\nEdgeworth:\n(So he plays chess with people outside of this prison...)\nThe victim (appears after The alibi)\n\n\n\n\n\n\n\nLeads to:\n\"Do you know who was murdered?\"\nPresent\n\n\n\n\n\n\n\n\n\nProsecutor's Badge\n\n\n\n\n\n\n\nKanis:\n...Very well.\nEdgeworth:\nHm?\nKanis:\nAs the flower of death blooms, your request... ...has been accepted.\nEdgeworth:\nWha-? This doesn't have such a sinister meaning behind it!\n\n\n\n\nChessboard or Hound Piece\n\n\n\n\n\n\n\nKanis:\nSince we have a board and all the pieces here, why not indulge me in a game? It is exceedingly difficult to find opponents in this prison.\nEdgeworth:\nA very interesting proposition, but I must decline. I don't have the time for that right now. And I doubt you will play by the rules anyway.\nKanis:\nKeh heh heh... You value the rules too much... Perhaps it is an occupational disease. How dreadful. Right, Anubis?\n*whine*\nEdgeworth:\n(Even his dog feels sorry for me!)\n\n\n\n\nBlack Dog\n\n\n\n\n\n\n\nEdgeworth:\nI have quite a few questions to ask you about your dog.\nKanis:\nIn that case, why don't you ask him directly?\nEdgeworth:\nVery well. .........\n.........\nEdgeworth:\n(Wait! There's no way I'll be able to interrogate a dog!)\nKanis:\nKeh heh heh. That's what I thought. He won't be able to understand you. Right, Anubis?\nWoof!\nEdgeworth:\n(...If he truly were unable to communicate with others... ...that would be a pity.)\n\n\n\n\nAnything else\n\n\n\n\n\n\n\nEdgeworth:\nI want you to tell me what you know about this.\nKanis:\nKeh heh heh. The only requests I accept are for assassinations. Do you want me to kill the person associated with that?\nEdgeworth:\nNo. I am not making such a dangerous request!\nEdgeworth:\nDo you know who was murdered?\nKanis:\nIt was Horace Knightley. A most unfortunate lad.\nEdgeworth:\nYour ears are as sharp as ever.\nKanis:\nThey are all I can rely on.\nEdgeworth:\n(As I thought, he has full knowledge of everything that goes on in this prison.)\nKanis:\nOn second thought, he might be fortunate after all.\nEdgeworth:\nFortunate? How so?\nKanis:\nHe committed a grave crime, but he was able to avoid punishment for it. An assassination attempt on the president... What a bold man.\nEdgeworth:\n(Assassination attempt?)\nKay:\nHey! Mr. Edgeworth! Didn't Mr. Knightley just...\nEdgeworth:\nHe may have killed his own superior, but he never attempted to take the president's life. (Are they trying to conceal the fact the assassination was staged by the president?)\nRay:\nWhoa, whoa, whoa! Hold your horses. Knightley didn't attack the president? But Uncle Ray was requested to defend him in court on charges of attempted assassination.\nKay:\nYou didn't know either, Uncle Ray? So, they're trying to pin the whole thing on Mr. Knightley...?\nEdgeworth:\nNow I see why the P.I.C. is taking action.\nKay:\nAh! So that's why they removed you from the case...\nRay:\nThat DaPest guy was going to indict him on charges of attempted assassination.\nKay:\nAnd in doing so, they would have twisted the truth!\nKanis:\nKeh heh heh. I suspected it was a false charge.\nEdgeworth:\n?\nKanis:\nI heard about it from one of the guards. About Knightley... He kept desperately insisting, \"I didn't assassinate anyone!\"\nEdgeworth:\n...But the courts are supposed to bring the truth to light.\nKanis:\nI may not be well-versed in law, but I can say one thing for certain. Some of the prisoners here were convicted on false charges.\nEdgeworth:\nUgh...!\nKanis:\n...That's the reality of it. Right, Anubis? Right, boy? Leaving the truth in the care of the court can be dangerous.\nEdgeworth:\n(Leaving the truth in the care of the court is dangerous... Huh. There was someone who said the exact same thing before... That investigator from Interpol who doesn't trust prosecutors.)\nLang:\nYou're not twisting the truth behind those closed courtroom doors, too, are you? Fueled by those ideas, is it any wonder that courts produce nothing but falsities and lies!? Rest assured, the next time we meet, I won't be so forgiving.\nEdgeworth:\n(I doubt his distrust has cleared up completely...)\nKanis:\nKeh heh heh... You feel the same way, don't you, Anubis? The truth of the courts and Mr. Edgeworth's reasoning both can't be trusted. Right?\nEdgeworth:\nUgh...!\nKanis:\nIt is nothing to be upset about. You're not the only one who suspects me. Yesterday, the other prosecutor and that judge came here too. They brought the warden along. How they despise me.\nKay:\nOh! It must have been those two rude people from before!\nEdgeworth:\n(Prosecutor Debeste and Judge Gravelle...)\nKanis:\nThey thoroughly inspected my room, but left without finding a thing. Keh heh heh. It seems they were searching for the murder weapon. 'Tis a shame. They searched the other prisoners' cells too. Not just mine. Yet they were still unable to find anything. All that hard work was for naught. Keh heh heh.\nPrison Investigation note jotted down in my Organizer.\nRay:\nHe he he. This is quite a problem. What should we do?\nEdgeworth:\n(Sahwit's testimony alone won't hold up. In order to confront him, we'll need evidence...)\nKanis:\nNow, if my guests would be so kind as to leave... Right, Anubis? Show them the way out.\nRay:\nAh, does this mean... What I think it means?\nKay:\nL-L-L-Let's get going, Mr. Edgeworth!\nEdgeworth:\n......We shall meet again, Kanis.\nKanis:\nIt would be a shame for our long-awaited reunion to end so soon. I'll be waiting. Keh heh heh.\nMarch 28, 1:12 PMPrisonHallway\nEdgeworth:\n(Now then, we still need to find that murder weapon.)\nKay:\nMr. Edgewooorth!\nEdgeworth:\n(She went all the way up there?) It's fine now, Kay. Come down from there. Where is Mr. Shields?\nKay:\nBeats me... He just took off running like death was after him.\nEdgeworth:\n(Good grief. That man...)\nKay:\nWhat should we do now, Mr. Edgeworth?\nEdgeworth:\nWe'll continue investigating. (First, we should... ...start by solving that one mystery. Knightley's body was found in a workroom inside the prison. However... ...he was supposed to be in the detention center's holding cell... How did he get to the prison under such tight security?) Let's go investigate the holding cell at the detention center.\nKay:\nThat was where Mr. Knightley was held, right!? But what about Uncle Ray?\nEdgeworth:\n...Let's just leave him be for now.\nKay:\nI thought we were supposed to be his assistants though...\nMarch 28, 1:34 PMDetention CenterHallway\nEdgeworth:\nThe victim's cell in the detention center was this way.\nKay:\nLet's check it out! Mr. Edgeworth!\n???:\nOh, this is truly just dreadful!\nEdgeworth:\n(Hm? What happened? That's the warden, Ms. Laguarde. She must have come from behind that \"No entry\" sign.)\nGuard:\nSo, he still won't talk? Even after all the trouble you went through to get the evidence transferred from the precinct...\nLaguarde:\nThat's right. I don't know how many times I've tried. I can't report back empty handed...\nGuard:\nThat assassin sure is one tough cookie, huh?\nEdgeworth:\n(Did he just say \"assassin\"...!?)\nLaguarde:\nOh my.\nEdgeworth:\nPardon me, but... Were you talking about Bodhidharma Kanis just now?\nLaguarde:\nOh, eavesdropping, were you? You naughty boy!\nEdgeworth:\n...Did you question him personally, Warden Laguarde?\nLaguarde:\nNot just him. I try to have a heart-to-heart with all the prisoners and suspects. In my home, we're all family here! It's only fair I invite them to my Warden's Office!\nEdgeworth:\nThe Warden's Office?\nLaguarde:\nOh, have you taken an interest in my room as well? It's just down this hallway. But outsiders are not allowed past this point.\nEdgeworth:\n(Down the hallway... So around there...)\nLaguarde:\nHu hu hu. It's such a lovely room. People do enjoy being invited back here. I always show them the splendid view of my precious courtyard!\nKay:\nThe courtyard of this animal-filled prison! I'd sure love to see it!\nFloor Plans updated in my Organizer.\nLaguarde:\nI'm delighted that you want to see it... However, I cannot invite you.\nKay:\nWhat?\nLaguarde:\nYou're not a child of our home. If you want to come to my room, you'll have to be convicted first.\nEdgeworth:\n(That's a rather high hurdle to clear...)\nLaguarde:\nGoodness me! Look at how long we've been talking! I was just about to feed Ally her lunch!\nEdgeworth:\nAlly...?\nLaguarde:\nShe is my favorite little angel! Now, if you'll excuse me, I must be off to the courtyard! Toodle-loo!\nEdgeworth:\n(I never got a chance to ask her about Kanis...) ...Well, let's head over to Knightley's cell.\nMarch 28, 1:43 PMDetention CenterHolding Cell\nEdgeworth:\n(This is the victim's cell...)\nKay:\nWhen did Mr. Knightley arrive in here again?\nEdgeworth:\nIt was after the president's welcoming ceremony, on the night of March 25th. (So, when and how did he move over to the prison? There might be some evidence left that can answer that.)\nKay:\nAlright! Let's get cracking, Mr. Edgeworth!\nBegin Investigation\nDetention CenterHolding Cell\nLogic\n\n\n\n\n\n\n\n\n\n\"Torn up newspaper\" and \"Floor wiped clean\"\n\n\n\n\n\n\n\nEdgeworth:\nThe floor here is clean. It was probably wiped down with something.\nKay:\nDid someone spill grape juice here?\nEdgeworth:\nI don't know exactly what was wiped away, but I can imagine what was used to wipe it... It's very likely it was this torn up newspaper.\nKay:\nCouldn't he have asked one of the guards if he could borrow a cleaning rag?\nEdgeworth:\nPerhaps it was something he didn't want the guards to see.\nWiped Floor data jotted down in my Organizer.\nPartner\n\n\n\n\n\n\n\nKay:\nYeah, what's up?\n\n\n\nNotice anything?\n\n\n\n\n\n\n\nKay:\nThere are so many things in this cell.\nEdgeworth:\nYes. Although they don't all appear to be Knightley's personal belongings. There's also a collection of books that belong to this cell.\nKay:\nWow! This might not be such a bad place to live in after all.\nEdgeworth:\n...If you want to spend the night here, I won't stop you.\nKay:\nThanks, but no thanks! But... Since we're here, we might as well learn everything we can. Alright! Let's begin our investigation of the holding cell!\n\n\n\n\nChess\n\n\n\n\n\n\n\nKay:\nChess seems to be popular here. Knightley even brought in a chess set.\nEdgeworth:\nNo. From what I've seen, the only people who have an interest in chess... ...are Knightley and that man.\nKay:\nThat man? Ah! You mean that scary guy!\nEdgeworth:\nIndeed. (Those two had a shared interest in chess... Is that... just a coincidence?)\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nPrison Investigation\n\n\n\n\n\n\n\nKay:\nI've been thinking about it. Since we still haven't found the murder weapon... ...maybe, there wasn't one to begin with!\nEdgeworth:\nOh. That's an interesting way of thinking. Then, how was the victim murdered?\nKay:\nWhat are you talking about, Mr. Edgeworth! If there is no murder weapon, then no one actually died.\nEdgeworth:\n...Kay. I understand how you're feeling, but we must not avert our eyes from the reality before us.\nKay:\nYou're right... Mr. Knightley, he really is... Mr. Edgeworth! We've gonna catch the guy who did this!\nGuard\n\n\n\n\n\n\n\nEdgeworth:\nGood work.\nGuard:\nYes, sir!\nKay:\nIt's fine, you don't have to keep an eye on us, 'kay? As you can see, we are the Great Thieves of Justice!\nGuard:\nHuh?\nEdgeworth:\nThere is no \"we\" here.\nSink\n\n\n\n\n\n\n\nEdgeworth:\n(Hm! The reflection in the mirror...)\nKay:\nAh! It's a security camera! A Great Thief's archenemy! I guess they don't take too kindly to thieves here...\nEdgeworth:\nThere's no reason for a detention center to be kind to thieves. Guard! I would like you to check the footage of this security camera. If you find any problems, report to me at once.\nGuard:\nUnderstood, sir!\nSink (subsequent times)\n\n\n\n\n\n\n\nEdgeworth:\nThe security camera is clearly visible in the mirror's reflection.\nKay:\nHmm... I don't like it. It's like a constant reminder, \"You're being watched!\"\nEdgeworth:\nI understand your feelings. However...\nKay:\nI definitely don't want to live in a place like this. Every morning, I'd reminded again while I'm at the sink... ...that I need to look good for the camera...!\nEdgeworth:\n...Don't get too worked up about it.\nDesk\n\n\n\n\n\n\n\n\n\nBefore deducing\n\n\n\n\n\n\n\nEdgeworth:\n(I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\n\nAfter deducing\n\n\n\n\n\n\n\nEdgeworth:\n(I already checked this area earlier, but it never hurts to take another look.)\n\n\n\n\nDining menu\n\n\n\n\n\n\n\nKay:\nMr. Edgeworth! Is this a dining menu?\nEdgeworth:\nYou can choose your daily meals in this detention center. However, unless you have the money, you won't be able to choose what you want to eat.\nKay:\nIn the end, the world revolves around money...! Doesn't this mean that the rich won't have to reflect on their crimes?\nEdgeworth:\nYes... Well, those who come here haven't been declared guilty yet. There are a few good people who don't need to reflect... Probably.\nKay:\nIt sounds like you're just making excuses for them, Mr. Edgeworth!\nEdgeworth:\nUrk...! (Why should I have to come up with excuses for the detention center!?)\n\n\n\n\nBooks\n\n\n\n\n\n\n\nKay:\nThere are a lot of books here. What's this? \"The Wonderful Warden of Ours\". \"The Hound Whistler\", \"The Animalshack Redemption\". ...Mr. Knightley, he was surprisingly good person...\nEdgeworth:\n...No. The detention center provides these books for the visitor's own edification. These books are supposed to help you grow as a human being... Hmm. \"Prison Life for Dummies\". These books were written by model prisoners and former inmates.\nKay:\nAh! Here's a helpful book! \"The Great Escape in 80 Days: Based on a True Story\"! Oh! Check this one out! \"Crime and Establishment: How to Make Money in Prison\"!\nEdgeworth:\n(...The problems with this detention center may run deeper than I thought.)\n\n\n\n\nPaper\n\n\n\n\n\n\n\nKay:\nAh! There's something on the desk!\nEdgeworth:\nIt seems to be some kind of memo... Let me take a closer look.\n\n\n\nChess notation\n\n\n\n\n\n\n\nEdgeworth:\nThis is... chess notation. It was probably the victim's.\nKay:\nWhat's chess notation?\nEdgeworth:\nIt's a memo that records the positions of the pieces on a chessboard. This is a good match. My next move would be pawn to... No... Actually, before that...\nKay:\nMr. Edgeworth! This is no time to be playing chess!\nEdgeworth:\nAhh. You're right. (...Hm? The positions of the chess pieces recorded in this memo... I feel like I've seen something similar somewhere else. I should take a closer look at the evidence I've collected.)\n\n\n\n\nDeduce\n\n\n\n\n\n\n\nEdgeworth:\n(Is this spot somehow connected to any of the evidence I hold...?)\n\n\n\nDeduce chess notation and present Hound Piece\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"This chess notation... I've seen it before.\"\n\n\n\n\nOtherwise\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThis piece of evidence contradicts the crime scene.\nKay:\nReally? I don't see any contradictions.\nEdgeworth:\nKay. As my assistant, you still lack training.\nKay:\nSame to you, Mr. Edgeworth!\nEdgeworth:\nUrk! (She called my bluff!)\n\n\n\nEdgeworth:\nThis chess notation... I've seen it before.\nKay:\nYou're still thinking about chess! Focus on the investigation! Focus!\nEdgeworth:\nChess is quite important to this investigation... Kay. Have a look at this.\nKay:\nAre these the chess pieces from Kanis's cell? I don't know much about the rules of chess...\nEdgeworth:\nThe rules of chess are not important here. Look at the positions of the chess pieces in this memo and the pieces in Kanis's cell... Do you notice anything?\nKay:\n...AH! I don't know anything about the different chess pieces... ...but if you flip the board around, the positions of the chess pieces are completely the same!\nEdgeworth:\nYes... Although the memo doesn't include the Cerberus chess piece... ...the positions of the other chess pieces are identical.\nKay:\nWh-What's going on here?\n\n\nKanis:\nI always play correspondence chess.\n\n\nEdgeworth:\nThis might be hard to believe... but Kanis's chess opponent was...\nKay:\nAh! Are you saying he was playing against Mr. Knightley?\nEdgeworth:\nWith this, we now have the evidence to link Kanis with the victim.\nKnightley's Memo jotted down in my Organizer.\nToilet\n\n\n\n\n\n\n\nEdgeworth:\nIt's not as dirty as I thought it would be. And the toilet paper shows no signs of use. Looks like there are no problems with the toilet.\nKay:\nEhh! There's a huge problem!\nEdgeworth:\nWhat's the problem?\nKay:\nIt's totally awkward having the toilet out in the open like that. They need to think more about the end user!\nEdgeworth:\n(This facility wasn't designed with the spirit of service in mind.)\nBed\n\n\n\n\n\n\n\n\n\nBefore examining wiped floor and newspaper\n\n\n\n\n\n\n\nEdgeworth:\n(I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\n\nAfter examining wiped floor and newspaper\n\n\n\n\n\n\n\nEdgeworth:\n(I already checked this area earlier, but it never hurts to take another look.)\n\n\n\n\nWiped floor\n\n\n\n\n\n\n\nEdgeworth:\n? (...Something seems off?)\nKay:\nThe floor here is clean. (Floor wiped clean - There doesn't seem to be anything in this cell to wipe the floor with?) Was it mopped recently?\nEdgeworth:\nIt seems strange that only the area in front of the bed has been wiped clean...\n\n\n\n\nBed\n\n\n\n\n\n\n\nEdgeworth:\nThis looks like an uncomfortable bed to sleep in. But the pillow covers are clean. Not a speck of dust on them.\nKay:\nIs this what the bed at Gummy's place looks like as well?\nEdgeworth:\nNo... If my hunch is correct, he has an old, beat-up mattress lying around in his room.\n\n\n\n\nSuit\n\n\n\n\n\n\n\nEdgeworth:\nIt's Horace Knightley's suit.\nKay:\nAccording to the results of my investigation...\nEdgeworth:\nHm? What did you find out?\nKay:\nA man who looks good in a suit leaves a more favorable impression with the ladies!\nEdgeworth:\n......\nKay:\nAh! Next time, I'll investigate men who look good in frills!\nEdgeworth:\nPlease don't bother...\n\n\n\n\nNewspaper\n\n\n\n\n\n\n\nKay:\nHm? This newspaper. It's missing a few pages.\nEdgeworth:\nThey appear to be torn out (Torn up newspaper - Dated the day before the murder. Several pages have been torn out.). Why would someone tear out the pages from a newspaper?\nKay:\nMaybe they used it to clean the cell instead of a rag?\nEdgeworth:\n(Clean the cell...? It's quite possible...)\nWindow\n\n\n\n\n\n\n\nEdgeworth:\nWindows with iron bars. There are no signs of tampering. It doesn't look like the criminal could have escaped through here.\nKay:\nHm hm. What if these iron bars are removable! Let me inspect them, for future reference.\nEdgeworth:\nKay... Now's not the time for that, we're in the middle of an investigation!\n(Connecting all possible Logic, examining sink, and deducing paper leads to:)\nInvestigation Complete\nEdgeworth:\nSo, this is what our investigation turned up. It seems we've found a major connection between the victim and Kanis.\n???:\nTh-This is terrible!\nEdgeworth:\n(Hm? What happened?)\nGuard:\nTh-The security camera recorded something terrible!\nEdgeworth:\nWhat!? Can you let me see it?\nGuard:\nOf course, sir! I have a portable playback device right here!\nEdgeworth:\nThen let me see it right away! (This is...!)\nKay:\nTh-This black thing has got to be that doggy, right!?\nEdgeworth:\nUp until this point, I thought the murder took place inside the prison. But it appears I was mistaken. The place where Knightley was attacked was...\nPresent holding cell\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"It was the detention center.\"\nPresent anywhere else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYes! Knightley was attacked here!\nKay:\nReally? He was attacked there? But the video showed that...\nEdgeworth:\nYes. I suppose it wasn't there...\nLeads back to:\n\"The place where Knightley was attacked was...\"\nEdgeworth:\nIt was the detention center. And furthermore, he was attacked by Kanis's dog. (This is the decisive evidence!)\nSecurity Footage data jotted down in my Organizer.\nEdgeworth:\n(If Knightley was killed in this room... ...then this piece of evidence we found in the cell takes on a new meaning! Which piece of evidence takes on a new meaning if the murder occurred in the holding cell?)\nPresent Wiped Floor\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"(For some reason, someone wiped the floor clean.)\"\nPresent anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\n(Yes, the meaning of this evidence...)\nKay:\nMr. Edgeworth? Why have you gone quiet all of a sudden?\nEdgeworth:\nUmm... It's nothing. (I'm overthinking this.)\nLeads back to:\n\"(If Knightley was killed in this room...)\"\nEdgeworth:\n(For some reason, someone wiped the floor clean. It's possible they were wiping away bloodstains.) Thank you for your hard work. While I have your attention, may I ask for one more favor?\nGuard:\nWhat would that be?\nEdgeworth:\nThere should be a detective by the name of Dick Gumshoe in the detention center or the prison. I would like you to give him a message. Tell him to check this room for traces of blood and give the results to me.\nGuard:\nY-Yes, sir.\nWiped Floor data updated in my Organizer.\nKay:\nThis should corner that old coot!\nEdgeworth:\nNo... Not yet. We still don't know how Knightley and the dog moved from here to the prison.\nKay:\nThat's true. But once we figure that out...! Where should we check out next, Mr. Edgeworth?\nEdgeworth:\nThe guards here might know something about the murder... Let's see if we can learn any new details from them.\nMarch 28, 2:15 PMDetention CenterHallway\nKay:\nAlright! Let's continue our... Aah!\n???:\nOh. Sorry to intrude... ...Well, if isn't Mr. Prosecutor and the little lady. Fancy meeting you here...\nEdgeworth:\n(This man is Shi-Long Lang, an Interpol Agent. About two weeks ago, he was in charge of investigating one of my cases. I would have thought he'd returned to his native country of Zheng Fa by now.) Agent Lang. What brings you here?\nLang:\nJust some boring work. Nothing you need to know about.\nKay:\nHa ha! On top of a black dog, we meet a black wolf! Huh? You came alone today, Agent Lang?\nLang:\n........\nEdgeworth:\n(Usually, he'd have a huge police force with him.)\nLang:\nMr. Prosecutor, seems you've been busy these past few days.\nEdgeworth:\n(These past few days... Is he referring to the incident with the Zheng Fa president?) I would have thought you'd be involved in his security too.\nLang:\nHah. Our president doesn't even trust his own country's police force. Look at the results of hiring a private security company. It's laughable.\nEdgeworth:\n(Agent Lang doesn't trust prosecutors or the courts. That's why... ...he brings along a large force of capable policemen to thoroughly investigate the crime scene.) Yes. If you and your subordinates had been there, the results might have been different.\nLang:\n...My subordinates, huh... They're... no longer with me.\nEdgeworth:\nThey're not with you?\nLang:\nFunny, looks like I'm a real lone wolf now. Hahahaha!\nEdgeworth:\nAgent Lang. Just what happened exactly?\nLang:\nDidn't I tell you? It's nothing you need to know about. Well, be seeing ya, Mr. Prosecutor.\nKay:\nMr. Lang... I wonder what happened...?\nEdgeworth:\n(Yes, it troubles me too, but there's nothing we can do about it for now...) Kay, let us continue with our own investigation.\nKay:\n...Got it. First, let's ask those guards a few questions!\nPartner\n\n\n\n\n\n\n\nKay:\nYeah, what's up?\n\n\n\nNotice anything?\n\n\n\n\n\n\n\nKay:\nI've found it! The \"weak point\" of this facility!\nEdgeworth:\nOh...? Please, enlighten me.\nKay:\nThere are lots of people here, so it feels like you're constantly being watched. However, there are still many blind spots we can use to hide and avoid detection. All we have to do is aim for these blind spots... We can do it!\nEdgeworth:\nI won't even ask what it is exactly that you plan to do. (More importantly, I feel like there are still a few blind spots to this case. I'll need to gather more information.)\n\n\n\n\nAgent Lang\n\n\n\n\n\n\n\nKay:\nMr. Lang looked kind of lonely, without all of his subordinates.\nEdgeworth:\nIndeed... It appears that the Republic of Zheng Fa has its own issues to deal with. But, he has decided to follow the path that he has chosen. And... the same goes for us.\nKay:\nYou're right... First, we must solve this case! After it's all over, we can go cheer Wolfy up!\nEdgeworth:\nHmm... Well, I'll think about it. (...I don't even know where he's staying at.)\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nSecurity Footage\n\n\n\n\n\n\n\nKay:\nThat was some amazing footage.\nEdgeworth:\nThe instant of the murder... This could be a powerful clue.\nKay:\nBut, we can't see the victim's face.\nEdgeworth:\n...Indeed. (Yes... That is a problem. At this rate, we can't call this a decisive piece of evidence...)\nKay:\nAh! I see! If you cover your face, The security cameras can't catch you! If I covered my face, I could sneak into any place I wanted!\nEdgeworth:\nBesides your face, shouldn't you also do something about your attire?\nKay:\nNo can do. After all, wearing this outfit is the policy of the Yatagarasu!\nEdgeworth:\n(Then, what is the point of covering your face?)\nSecurity gate\n\n\n\n\n\n\n\nEdgeworth:\n(It's a security gate with a metal detector...)\nKay:\nDon't you feel nervous whenever you pass through one of these? It's like how you get nervous when you see a policeman, but you've done nothing wrong.\nEdgeworth:\nPerhaps you get nervous around the police because you're the self-proclaimed \"Great Thief\"...?\nGreen door\n\n\n\n\n\n\n\nEdgeworth:\nThis door leads to the surveillance room.\nKay:\nSurveillance... Does this mean... we're being watched? You'll have to tone down your shenanigans, Mr. Edgeworth...\nEdgeworth:\nWh-What... are you trying to accuse me of!\nGuard on left\n\n\n\n\n\n\n\nGuard:\nHmm, this is a difficult case...\nEdgeworth:\nWhat's wrong? Is something troubling you?\nGuard:\nS-Sir...! One of my uniforms has gone missing! But I'm certain that I placed it in this locker.\nKay:\nMaybe the uniform grew legs and walked off somewhere...?\nEdgeworth:\n...What kind of logic is that?\nKay:\nIn any case, I wish you the best in your search. I'll be rooting for you!\nGuard:\nYes! Thank you for your support!\nStolen Uniform data jotted down in my Organizer.\nLockers\n\n\n\n\n\n\n\nEdgeworth:\nThese are the guards' lockers.\nKay:\nI bet they keep their uniforms and snacks inside.\nEdgeworth:\nWhy snacks?\nKay:\nIf it were me, I'd definitely put snacks in there!\nEdgeworth:\nI don't know where you get that air of confidence...\nGuard on right\n\n\n\n\n\n\n\nEdgeworth:\nYou there, have you seen a black dog around here?\nGuard:\nO-Of course not. If I had actually seen it... I wouldn't be standing around here so carefree!\nKay:\nUmm, did something happen with that doggy?\nEdgeworth:\nKay, let's not press this matter any further. (Hm... So Kanis's dog didn't come by the detention center.)\nTrophies\n\n\n\n\n\n\n\nEdgeworth:\nA bunch of trophies are lined up here.\nKay:\nI'd like to hand out one of these trophies sometime!\nEdgeworth:\nWhat kind of person would receive a trophy from a Great Thief...\nKay:\nObviously the Rope Escape Champion! Ah! But if they actually held a contest, I'd be the champion.\nEdgeworth:\n(Where would you hold such a contest...?)\nBlock sign\n\n\n\n\n\n\n\nEdgeworth:\nThis leads to the office.\nKay:\nThere's a sing that says \"No entry\". It's human nature to want to sneak in whenever you see a no entry sign!\nEdgeworth:\nAnd it is human reason that suppresses those urges.\n(Talking with two guards leads to:)\n???:\nOoh! There you are!\nEdgeworth:\nMr. Shields. Where did you go?\nRay:\nWhere indeed! I've been searching for you guys this whole time! Walking all around the prison is hard work, you know!\nKay:\n...That's strange, seeing as you came from the opposite direction.\nRay:\n.......... I've got some new information. You wanna hear it? Do you!?\nEdgeworth:\n(He sure changed the subject quickly.)\nRay:\nI heard a little something from the guards. It seems Knightley caused a bit of an incident two days ago.\nEdgeworth:\nAn incident?\nRay:\nYou know how Simeon said he came to visit Knightley, right? After the visit, when Knightley returned to his cell... Naturally, a guard escorted Knightley back to his cell. While the guard was unlocking his handcuffs... All of a sudden, Knightley struck the guard and knocked him out. It seems he was going to attempt a jailbreak. By the time the other guards arrived, the key to his cell had disappeared.\nEdgeworth:\nBut, there's been no reports of Knightley's jailbreak attempt two days ago...\nRay:\nExactly. It's strange, isn't it. Right up until his death, he was still in his cell. What's more, Knightley claimed he never stole the key in the first place. In fact, they searched his cell, and the key was nowhere to be found...\nEdgeworth:\nDid the guard who was struck have anything to say?\nRay:\nNo one knows. He was taken to the hospital while he was still unconscious. He's still there now, it seems.\nEdgeworth:\n(So, in the end, we still don't know what happened...)\nKnightley's Cell Key data jotted down in my Organizer.\n???:\nIt's youuuuu!\nEdgeworth:\n(Hm. That voice...)\nDebeste:\nWhat are you still doing hanging around here!?\nRay:\nErr, well, you see. This is my assistant...\nDebeste:\nAre you here to object our investigation and make me into a laughing stock!?\nGravelle:\nSebastian. I believe \"obstruct\" is the word you're looking for.\nEdgeworth:\n(In a way, I think his expression was apt.)\nRay:\nA pleasure meeting you again, Judge Gravelle. I am...\nGravelle:\nI know. You are Simeon Saint' defense attorney, are you not?\nRay:\nWell then, let's skip the formalities, and celebrate our happy reunion with a hug... O-Or maybe not!\nGravelle:\nIncidentally... I heard you mention an assistant a moment ago.\nKay:\nYeah! We're assistants at the Edgeworth Law Offices!\nGravelle:\nProsecutors are civil servants, to open a side business is to betray the Goddess of Law.\nEdgeworth:\nAs long as profit is not our objective, there shouldn't be a problem, right?\nRay:\nY-Yeah, that's it! Miles here is a volunteer worker! The purpose of my office isn't to make money... We're pro bono.\nGravelle:\nWhat a wonderful heart you have. Defending others without demanding payment.\nRay:\nAh... Aha ha ha... I-I do have an amazing charitable heart.\nEdgeworth:\nMore importantly, I'd like you to explain your reasons for arresting Simeon Saint.\nGravelle:\nThere's no need to...\nDebeste:\nIs that a challenge against me!?\nEdgeworth:\nNo, I was speaking with Judge Gravelle...\nDebeste:\nI guess it can't be helped. If you want to take on The Best, you will fall like the rest!\nEdgeworth:\n(I haven't said anything yet. ...But this is convenient.) Then I will hear you out. What were your reasons for arresting Mr. Saint?\nGravelle:\nI see no need to inform you. Sebastian, let us...\nDebeste:\nHeh heh heh... Just watch, Verity. Watch as I run around in circles against this useless prosecutor!\nEdgeworth:\nI think you mean, \"run circles around me\"...\nDebeste:\nYeah! That's what I meant! Prepare yourself, Mr. Edgeworth!\n-- Reasons for Arrest --\nDebeste:\nSo, you want to know my reasons for arresting that man?\nThe answer is simple. Yes. We found \"traces\" of that guy over there.\nHow's that? Perfectly simple, perfectly decisive... Right?\nOf course, I was the first to notice it because I'm the Best.\nEdgeworth:\n...... (How am I supposed to go about pressing that...)\nDebeste:\nHow's that? Got nothing to say! Speechless in my presence?\nEdgeworth:\n(*sigh*... This guy sure talks a lot.) ...So, you're the one who arrested Mr. Saint, I take it... Mr. Debeste. Do you have the right to do such a thing?\nDebeste:\nWell, obviously it was the police who carried out the arrest. But, since it was under my direction, shouldn't it also count as my arrest?\nEdgeworth:\n(As I expected... It'd be difficult to deal with both of them at the same time. However... Her silence is troubling me. Just what is she thinking?)\n\nEdgeworth: Edgeworth: Let's get one thing clear... You do know who you arrested, right? Debeste: What? Do you take me for a fool? The one I arrested was... Simeon Saint! No doubt about it! Edgeworth: (I expected he'd at least understand that much...) Change statement: \"So, you want to know my reasons for arresting that man?\" to \"Obviously, we had a fatal reason for arresting Simeon!\"\nEdgeworth: Edgeworth: Really, that's quite a surprise. ...So, what is this fatal reason for the arrest? Debeste: Are you attempting to lure information out of me through flattery? ...A good strategy, but I'm afraid... it won't work on me! Gravelle: We have found vital evidence implicating Simeon Saint. That's what Sebastian was trying to say. Debeste: Yes! So because of this fatal vital evidence, I had Simeon arrested!\nEdgeworth: Edgeworth: That guy... over there...? That's certainly vague... Debeste: Well, don't they say... The Best hears one thing and understands ten? Edgeworth: You're just being lazy... Explain it more clearly! Gravelle: ...Sebastian. If it's alright with you, would you please explain it to them in more detail? I'm sure that everyone wants to hear what you have to say. Debeste: ...Hm. Alright. If you insist, Verity. We discovered \"that\"... Perhaps you didn't know, but the victim carried a chessboard with him. From it, we found that suspect guy's... I mean, Simeon Keye's fingerprints. Gravelle: Well done, Sebastian! I bless you on behalf of the Goddess of Law. Please amend your testimony. Are you alright with that, Prosecutor Edgeworth? Edgeworth: ...Y-Yes. Change statement: \"The answer is simple. Yes. We found \"traces\" of that guy over there.\" to \"The victim carried a chessboard. From it, we found Simeon Saint' fingerprints.\"\nEdgeworth: Edgeworth: Surely, it wasn't you who discovered the fingerprints. Debeste: Hey, I'm just a prosecutor, aren't I? I leave that stuff to the forensics team. Edgeworth: (These fingerprints could be a problem, but wasn't the chessboard originally... Maybe I should take another look at the evidence.) Debeste: Precisely. You seem to be well-versed on this matter. Kay: He he he! Well, I happen to know a thing or two about prisons, y'know! Edgeworth: (What does she mean by that? I'll have to find out the details later.) Debeste: In any case, I peeked into the room from the window.\nEdgeworth: Edgeworth: What's perfectly simple and decisive is how flimsy your testimony is. Debeste: What are you saying? You just can't keep up with my train of thought! Gravelle: It may be presumptuous of me, but allow me to explain. The fingerprints found at the scene belonged to the guards and the prisoners. And the only ones that \"should not have existed\" belonged to Simeon Saint. Debeste: Yes! Exaaaaactly! Do you get it now, Mr. Edgeworth? Edgeworth: (The real question is, do YOU get it...!?) Change statement: \"How's that? Perfectly simple, perfectly decisive... Right?\" to \"The other prints belonged to the victim and the guards. Yes, only Simeon's prints are unnatural!\"\nEdgeworth: Edgeworth: If there are other people's fingerprints then there should be more suspects! Debeste: Wah hah hah... I'm afraid that's not possible. Edgeworth: ...And why is that? Gravelle: Certainly, if not for Simeon Saint' prints, there would have been more suspects. However, his fingerprints \"should not have existed\". Debeste: Th-That's right! After all, Simeon... is... Gravelle: Is neither a prisoner nor a guard. So naturally, he wouldn't have been allowed into the prison. And yet he left his fingerprints. I think that's enough reason for an arrest... Wouldn't you say? Debeste: Yes! Well done, Verity! Gravelle: You're welcome.\nEdgeworth: Edgeworth: First one to notice? Do you have any proof? Debeste: I noticed it the very instant I saw the crime scene! Faster than the speed of light! That's the best kind of proof! Edgeworth: Hmph... And what does that prove? Debeste: Wah hah hah! You still don't understand. But, don't feel too bad. You're simply not \"The Best\", unlike me! Edgeworth: (I don't think I want to understand...) Change statement: \"Of course, I was the first to notice it because I'm the Best.\" to \"My reasoning is faster than light. It'd take you a light year to get it. In short, I am the Best!\"\nEdgeworth: Edgeworth: You do realize that a light year is not a measure of time? Debeste: Oh...? ......Uhh...? Gravelle: Sebastian, a light year is a unit of distance. Debeste: ......Oh, right. Edgeworth: (What! This isn't the time for this...!)\nEdgeworth: ........ (What is he saying...)\nKay: It's really vague and hard to understand...\nEdgeworth: First, I'll have to teach him how to speak a language people can understand.\nKay: Teach it to him, Professor Edgeworth!",
      "testimonies": [
        {
          "testimony": "So, you want to know my reasons for arresting that man?",
          "person": "Debeste",
          "present": []
        },
        {
          "testimony": "Obviously, we had a fatal reason for arresting Simeon!",
          "person": "Debeste",
          "present": []
        },
        {
          "testimony": "The answer is simple. Yes. We found \"traces\" of that guy over there.",
          "person": "Debeste",
          "present": []
        },
        {
          "testimony": "The victim carried a chessboard. From it, we found Simeon Saint' fingerprints.",
          "person": "Debeste",
          "present": [
            "Pocket Chess Set"
          ],
          "source": {
            "evidence_span": "It belonged to Knight, and was brought to him at his request by Saint.",
            "testimony_span": "From it, we found Simeon Saint' fingerprints.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "How's that? Perfectly simple, perfectly decisive... Right?",
          "person": "Debeste",
          "present": []
        },
        {
          "testimony": "The other prints belonged to the victim and the guards. Yes, only Simeon's prints are unnatural!",
          "person": "Debeste",
          "present": []
        },
        {
          "testimony": "Of course, I was the first to notice it because I'm the Best.",
          "person": "Debeste",
          "present": []
        },
        {
          "testimony": "My reasoning is faster than light. It'd take you a light year to get it. In short, I am the Best!",
          "person": "Debeste",
          "present": []
        }
      ],
      "summarizedContext": "Prosecutor Debeste is explaining the reasons for arresting Simeon Saint.",
      "noPresent": false,
      "labels": [
        "behavioral"
      ],
      "reasoning": [
        "Fact 1: The witness claims Saint's fingerprints on the chessboard was incriminating evidence.",
        "Fact 2: The evidence suggests Saint sent the chessboard to the victim by his request.",
        "Prop 1: If a person has sent an item to a victim by the victim's request, his fingerprints on the item are not incriminating."
      ]
    },
    {
      "category": "rebuttal",
      "newContext": "-- Reasons for Arrest --\nDebeste:\nSo, you want to know my reasons for arresting that man?\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nLet's get one thing clear... You do know who you arrested, right?\nDebeste:\nWhat? Do you take me for a fool? The one I arrested was... Simeon Saint! No doubt about it!\nEdgeworth:\n(I expected he'd at least understand that much...)\nChange statement:\n\"So, you want to know my reasons for arresting that man?\" to \"Obviously, we had a fatal reason for arresting Simeon!\"\nDebeste:\nObviously, we had a fatal reason for arresting Simeon!\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nReally, that's quite a surprise. ...So, what is this fatal reason for the arrest?\nDebeste:\nAre you attempting to lure information out of me through flattery? ...A good strategy, but I'm afraid... it won't work on me!\nGravelle:\nWe have found vital evidence implicating Simeon Saint. That's what Sebastian was trying to say.\nDebeste:\nYes! So because of this fatal vital evidence, I had Simeon arrested!\nDebeste:\nThe answer is simple. Yes. We found \"traces\" of that guy over there.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThat guy... over there...? That's certainly vague...\nDebeste:\nWell, don't they say... The Best hears one thing and understands ten?\nEdgeworth:\nYou're just being lazy... Explain it more clearly!\nGravelle:\n...Sebastian. If it's alright with you, would you please explain it to them in more detail? I'm sure that everyone wants to hear what you have to say.\nDebeste:\n...Hm. Alright. If you insist, Verity. We discovered \"that\"... Perhaps you didn't know, but the victim carried a chessboard with him. From it, we found that suspect guy's... I mean, Simeon Keye's fingerprints.\nGravelle:\nWell done, Sebastian! I bless you on behalf of the Goddess of Law. Please amend your testimony. Are you alright with that, Prosecutor Edgeworth?\nEdgeworth:\n...Y-Yes.\nChange statement:\n\"The answer is simple. Yes. We found \"traces\" of that guy over there.\" to \"The victim carried a chessboard. From it, we found Simeon Saint' fingerprints.\"\nDebeste:\nThe victim carried a chessboard. From it, we found Simeon Saint' fingerprints.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nSurely, it wasn't you who discovered the fingerprints.\nDebeste:\nHey, I'm just a prosecutor, aren't I? I leave that stuff to the forensics team.\nEdgeworth:\n(These fingerprints could be a problem, but wasn't the chessboard originally... Maybe I should take another look at the evidence.)\nDebeste:\nPrecisely. You seem to be well-versed on this matter.\nKay:\nHe he he! Well, I happen to know a thing or two about prisons, y'know!\nEdgeworth:\n(What does she mean by that? I'll have to find out the details later.)\nDebeste:\nIn any case, I peeked into the room from the window.\nPresent Chessboard\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Fingerprints found on the chessboard... Is that the ace up your sleeve?\"\nDebeste:\nHow's that? Perfectly simple, perfectly decisive... Right?\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nWhat's perfectly simple and decisive is how flimsy your testimony is.\nDebeste:\nWhat are you saying? You just can't keep up with my train of thought!\nGravelle:\nIt may be presumptuous of me, but allow me to explain. The fingerprints found at the scene belonged to the guards and the prisoners. And the only ones that \"should not have existed\" belonged to Simeon Saint.\nDebeste:\nYes! Exaaaaactly! Do you get it now, Mr. Edgeworth?\nEdgeworth:\n(The real question is, do YOU get it...!?)\nChange statement:\n\"How's that? Perfectly simple, perfectly decisive... Right?\" to \"The other prints belonged to the victim and the guards. Yes, only Simeon's prints are unnatural!\"\nDebeste:\nThe other prints belonged to the victim and the guards. Yes, only Simeon's prints are unnatural!\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nIf there are other people's fingerprints then there should be more suspects!\nDebeste:\nWah hah hah... I'm afraid that's not possible.\nEdgeworth:\n...And why is that?\nGravelle:\nCertainly, if not for Simeon Saint' prints, there would have been more suspects. However, his fingerprints \"should not have existed\".\nDebeste:\nTh-That's right! After all, Simeon... is...\nGravelle:\nIs neither a prisoner nor a guard. So naturally, he wouldn't have been allowed into the prison. And yet he left his fingerprints. I think that's enough reason for an arrest... Wouldn't you say?\nDebeste:\nYes! Well done, Verity!\nGravelle:\nYou're welcome.\nDebeste:\nOf course, I was the first to notice it because I'm the Best.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nFirst one to notice? Do you have any proof?\nDebeste:\nI noticed it the very instant I saw the crime scene! Faster than the speed of light! That's the best kind of proof!\nEdgeworth:\nHmph... And what does that prove?\nDebeste:\nWah hah hah! You still don't understand. But, don't feel too bad. You're simply not \"The Best\", unlike me!\nEdgeworth:\n(I don't think I want to understand...)\nChange statement:\n\"Of course, I was the first to notice it because I'm the Best.\" to \"My reasoning is faster than light. It'd take you a light year to get it. In short, I am the Best!\"\nDebeste:\nMy reasoning is faster than light. It'd take you a light year to get it. In short, I am the Best!\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou do realize that a light year is not a measure of time?\nDebeste:\nOh...? ......Uhh...?\nGravelle:\nSebastian, a light year is a unit of distance.\nDebeste:\n......Oh, right.\nEdgeworth:\n(What! This isn't the time for this...!)\nEdgeworth:\n........ (What is he saying...)\nKay:\nIt's really vague and hard to understand...\nEdgeworth:\nFirst, I'll have to teach him how to speak a language people can understand.\nKay:\nTeach it to him, Professor Edgeworth!\nEdgeworth:\nFingerprints found on the chessboard... Is that the ace up your sleeve?\nDebeste:\nAce in my sleeve? ...Oh! Ace up my sleeve...!? Yes! The methods I use are always \"The Best\". This ace is my trump card!\nEdgeworth:\nWell then, allow me to show you that it is not, in fact, a trump card at all. Simeon Saint was the one who sent this chessboard to the victim in the first place... So, it's only natural some of his prints would be left on it.\nDebeste:\n.......... Aaaaagh!\nEdgeworth:\n(...That took way too long.) These fingerprints are hardly decisive evidence. Perhaps your arrest was a little too rash?\nDebeste:\nRash......\nEdgeworth:\nTo begin with, this incident occurred in the detention center and the prison. To suspect Simeon just because he isn't a prisoner or a guard is a little unreasonable...\nDebeste:\nAaaaaah!\nEdgeworth:\nWh-What? (What's with him all of a sudden...)\nDebeste:\nWah hah hah hah. I finally get what you're trying to say. Rash... You mean we were too quick to arrest the guy, right?\nEdgeworth:\n(He was stuck on that!?)\nDebeste:\nSure, I was the first to lay eyes on him. And I was the first to notice the evidence. That was even faster. But, I am not rash! Sure, Simeon Saint isn't a guard or a prisoner. But...\nGravelle:\nGravelle:\n...Sebastian.\nEdgeworth:\n(Judge Gravelle...!)\nDebeste:\nWh-What are you doing Verity! Don't butt in like that.\nGravelle:\nPardon me, Sebastian. Yes, your words on the suspect are very interesting. However... Shouldn't you get to the \"Best\" part first?\nDebeste:\nThe \"Best\" part...!\nGravelle:\nWhy don't you tell them? About your wonderful reasoning regarding the murder weapon.\nDebeste:\n.....Good one, Verity. Nice suggestion. Mr. Edgeworth, listen to my first-rate reasoning!\nEdgeworth:\nEdgeworth:\nWill this reasoning explain why you arrested Mr. Saint?\nDebeste:\nI'm sure it will meet your expectations.\nEdgeworth:\n(Judge Gravelle just changed the flow of the conversation... Just what is she planning?)\n-- Murder Weapon's Location --\nDebeste:\nIt's obvious the murder weapon was a sharp metal object!\nHowever, the prison maintains strict control over potentially lethal items.\nSo... That's why I've reasoned that the murder weapon was brought in from the outside.\nYes. It was hidden inside that chess board.\nAnd since only the victim and the suspect's fingerprints were found on the chessboard...\nIsn't it obvious who brought and used the murder weapon?\nEdgeworth:\n(At least it's clearer than his last testimony...)\nDebeste:\nIt's Debeste reasoning you can get from Prosecutor The Best. How do you like that?\nEdgeworth:\n(Now he's mixing up \"the best\" with his own name...)\nKay:\nBut, could someone really hide a weapon inside a gift sent to a prisoner?\nDebeste:\nHe he. You'll find a good place if you examine the inside of the chessboard.\nEdgeworth:\n(Inside the chessboard? Is there some place to hide a weapon...)\nExamine lock\n\n\n\n\n\n\n\nLeads to:\n\"As I thought, there are only chess pieces inside.\"\nEdgeworth:\nAs I thought, there are only chess pieces inside.\nDebeste:\nHe he he...\nKay:\nWow. What an annoying laugh...\nEdgeworth:\n(Inside the chessboard, huh. Perhaps I should examine it a bit further.)\nExamine top panel\n\n\n\n\n\n\n\nLeads to:\n\"This is...! (The top panel is removable.)\"\nEdgeworth:\nThis is...! (The top panel is removable.)\nKay:\nIt's quite deep.\nEdgeworth:\nYes. There's more than enough room to hide a small knife.\nDebeste:\nUnderstand now? This is how the culprit smuggled in the...\nExamine evidence\n\n\n\n\n\n\n\n\n\nTop panel on inside of Chessboard\n\n\n\n\n\n\n\nEdgeworth:\nLet's see, the top panel can be removed, like so...\n\n\n\n\nEmpty space on inside of Chessboard\n\n\n\n\n\n\n\nKay:\nThis hidden compartment is quite deep! I could hide my secret savings in there!\nEdgeworth:\nDo you even have any savings to hide?\nKay:\nLet's not talk about that...\nEdgeworth:\nEdgeworth:\nHmph......\nDebeste:\nHmph! What's with the \"hmph\"! I wasn't even finished!\nEdgeworth:\n...Mr. Debeste, there is something you have forgotten. There's a gate at the entrance of the detention center!\nDebeste:\n...Eh? Well, there is, but...\nGravelle:\nHe means the security gates with the metal detectors, Sebastian. We had to pass through the same check when we entered the prison, remember?\nDebeste:\nAh... Aaaah! Yeah! That's it! I remember now!\nEdgeworth:\n(It looks like he completely forgot.) It would be impossible to smuggle a sharp metal object into the detention center. Therefore, your reasoning never held, even from the very beginning!\nGravelle:\nGravelle:\nThat gate is only used on people. In other words, packages sent to the detention center undergo a simpler check.\nEdgeworth:\n...So they don't use a metal detector for that?\nGravelle:\nThis never should have happened... It seems the guards were too careless.\nChessboard data updated in my Organizer.\nSecurity Gate data jotted down in my Organizer.\nDebeste:\nRight, Verity. Thanks for the assist.\nGravelle:\nYou're welcome. Now then, Prosecutor Edgeworth, your cross-examination, if you please.\nEdgeworth:\n(Cross-examination. It's as if we were in the courtroom. ...Very well, his reasoning... Let's see how long it will hold up under pressure!)\n\nEdgeworth: Edgeworth: A sharp metal object... Do you have proof of that? Debeste: Didn't you see the victim's wound, worthless prosecutor? The fatal blow was a stab to the throat! And a knife perfectly matches up with that! There can be no other explanation! Edgeworth: (Hm... It seems they don't know about that piece of \"information\" yet.) Debeste: Wah hah hah... Nothing to say? Speechless, aren't you, Mr. Edgeworth! Right, next! There is plenty more to my reasoning!\nEdgeworth: Edgeworth: Even with the strict control, there were still some items that could be used, right? Debeste: W-Well, yeah... Things like grooming scissors... Gravelle: Of course, there's more to this. Right, Sebastian? Debeste: E-Exactly! At the time of the incident, only one was being borrowed! However, there was no reaction when we tested it for blood! Edgeworth: (Those would be the scissors Mr. Sahwit was practicing with.) Debeste: So, the inside of the prison was completely clear of sharp implements!\nEdgeworth: Edgeworth: Can you be more specific about where it came from? Debeste: Of course I can! It didn't come from inside the prison! Edgeworth: (Is he trying to sound smart?) Gravelle: Simeon Saint brought it in. That's what we mean. Debeste: Mr. Edgeworth... Can't you even figure that much out? I'm disappointed in you! Edgeworth: (And you've disappointed me from the start.) Debeste: So Simeon brought the murder weapon. But how, you ask?\nEdgeworth: Edgeworth: No weapon was found at the crime scene. Not even inside the chessboard. So where did the murder weapon disappear to... I'd like to hear your answer to that. Debeste: Th-That's... Well, after the crime, the culprit must have hidden it somewhere in the prison. Edgeworth: (Is there a problem with the statement Debeste just made?) There is a problem Leads to: \"The murder weapon is hidden inside the prison? ...I don't think so.\" There is no problem Edgeworth: (No... There doesn't appear to be a problem.) Mr. Debeste. Could you continue your testimony? Debeste: Oh! Err... What was I saying again? Oh, yeah. The murder weapon was hidden inside the chessboard. Leads to: \"The murder weapon is hidden inside the prison? ...I don't think so.\" Edgeworth: (No... There doesn't appear to be a problem.) Mr. Debeste. Could you continue your testimony? Debeste: Oh! Err... What was I saying again? Oh, yeah. The murder weapon was hidden inside the chessboard.\nEdgeworth: Edgeworth: Was it really just their fingerprints you found? Debeste: Hmph. My pops always says... \"You may be foolish in youth, but you must not be stupid.\" Edgeworth: ...? Debeste: I'm not stupid! Edgeworth: (Wh-What... Was that... uh...?) Gravelle: He means he's not stupid enough to tell a lie. Debeste: ......Oh? I-I-I, I knew that! I'm not stupid enough to lie! So the fingerprints are the honest truth!\nEdgeworth: Edgeworth: So, can you tell us exactly \"who\" this person was? Debeste: Wah hah hah... The culprit..... is YOU! Kay: Err, Simeon isn't here... Debeste: ......... Edgeworth: Such a pitiful man. We'd best go gently on him. Kay: I see. I just wanted to tease him! Debeste: ......... D-Don't make fun of meeeeeee!\nKay: That last testimony sure seemed like faulty reasoning.\nEdgeworth: Judge Gravelle helped him out... No, the argument was entirely her own reasoning.\nRay: In that case, this'll be tough. Got anything up your sleeve, Miles?\nEdgeworth: Of course. They don't know all the facts. This reasoning doesn't appear to have any weak points at first glance, but...\nRay: But on closer inspection, there is a hole, right?\nEdgeworth: (I should press them to draw out more information, then find the hole in their logic. I'll strike first and take hold of any clues I find...!)",
      "testimonies": [
        {
          "testimony": "It's obvious the murder weapon was a sharp metal object!",
          "person": "Debeste",
          "present": []
        },
        {
          "testimony": "However, the prison maintains strict control over potentially lethal items.",
          "person": "Debeste",
          "present": []
        },
        {
          "testimony": "So... That's why I've reasoned that the murder weapon was brought in from the outside.",
          "person": "Debeste",
          "present": []
        },
        {
          "testimony": "Yes. It was hidden inside that chess board.",
          "person": "Debeste",
          "present": []
        },
        {
          "testimony": "And since only the victim and the suspect's fingerprints were found on the chessboard...",
          "person": "Debeste",
          "present": []
        },
        {
          "testimony": "Isn't it obvious who brought and used the murder weapon?",
          "person": "Debeste",
          "present": []
        }
      ],
      "noPresent": true
    }
  ]
}