{
  "previousContext": "",
  "characters": [
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Dick Gumshoe",
      "age": "32",
      "gender": "Male",
      "description1": "Homicide detective from the local precinct who's always first on the scene at any murder investigation."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Florence Niedler",
      "age": "22",
      "gender": "Female",
      "description1": "A nurse who works at Hertz Hospital. Has a worrying tendency to offer unnecessary treatments to everyone she meets."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Kay Faraday",
      "age": "17",
      "gender": "Female",
      "description1": "A mysterious young woman brought to the High Prosecutors' Offices by Florence Niedler. She appears to have lost her memory, but...",
      "description2": "A self-styled Great Thief and so-called \"second Yatagarasu\". She's currently suffering from memory loss."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Hilda Hertz",
      "age": "60",
      "gender": "Female",
      "description1": "The head of Hertz Hospital. Carried out the preliminary inspection of the victim in this case."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Franziska von Karma",
      "age": "19",
      "gender": "Female",
      "description1": "Daughter of my mentor, Manfred von Karma. She is a highly talented prosecutor, and is currently working with Interpol."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Eustace Winner",
      "age": "17",
      "gender": "Male",
      "description1": "The greatest prosecutor ever to prosecute... according to himself, anyway. In actual fact, his relationship with logic is tenuous at best."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Verity Gavèlle",
      "age": "26",
      "gender": "Female",
      "description1": "A district court judge and member of the Committee for Prosecutorial Excellence, who also acts as its mouthpiece."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Rosie Ringer",
      "age": "33",
      "gender": "Female",
      "description1": "The victim in this case. She was a defense attorney, and served on the Committee alongside Judge Gavèlle."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Excelsius Winner",
      "age": "68",
      "gender": "Male",
      "description1": "Former chief prosecutor, current Chairman of the Committee, and Eustace Winner's father. Has a tendency to burst into tears over nothing."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Eddie Fender",
      "age": "36",
      "gender": "Male",
      "description1": "Senior partner at Edgeworth and Co. He's trying to get me to become a defense attorney."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Ema Skye",
      "age": "18",
      "gender": "Female",
      "description1": "A high school student looking to become a forensic investigator, and the younger sister of my former boss."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Lotta Hart",
      "age": "25",
      "gender": "Female",
      "description1": "A freelance photojournalist who I've met in the past. Known for her ability to sniff out scoops and snap them with her trusty camera."
    }
  ],
  "evidences": [
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Prosecutor's Badge",
      "description1": "Proof of my profession. However, I prefer to keep it in my pocket."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Yatagarasu Pin",
      "description1": "The Yatagarasu pin that Kay always wears."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Jammin' Ninja Mask",
      "description1": "A mask modeled on the Jammin' Ninja's face. Made of cheap plastic."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Letter",
      "description1": "A letter Kay was carrying. It is addressed to her."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Promise Notebook",
      "description1": "A book of promises Kay made to her father when she was a little girl. What was it doing in the Committee chamber?"
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Ticket Stub",
      "description1": "Stub from a ticket granting entry to the viewing platform on top of the Bigg Building."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Magenta Flower",
      "description1": "A magenta flower made of fabric that is usually worn on the chest as a decoration. Also known as a corsage.",
      "description2": "A magenta flower made of fabric that is usually worn on the chest as a decoration. Torn from the victim's clothes."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Bigg Building Pamphlet",
      "description1": "Contains a cross-section of the building and a plan of the viewing platform. [caption] On the roof is the viewing platform. Beneath is a storeroom on the 51th floor, and the P.I.C meeting room on the 50th floor. On a top-down view of the viewing platform on the roof, to the left-most edge is a cherry tree. To the right-most edge is a candy stand."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Kay's Recollections",
      "description1": "Kay remembers a person coming from beyond the concession stand and pushing her off of the building."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Candelabrum",
      "description1": "A three-armed candle holder that may have been the murder weapon, judging by the wounds to the the victim's chest.",
      "description2": "A three-armed candle holder found by the victim's body. Made to look like the murder weapon."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Keycard",
      "description1": "A keycard that grants entry to the Committee chamber. Found in the victim's hand."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Autopsy Report",
      "description1": "Initial findings of Dr. Hilda Hertz. Cause of death: Stab wounds to left chest. Head injury sustained post mortem.",
      "description2": "Death occurred as a result of a heavy blow to the head with a circular object. Chest wounds inflicted post-mortem."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Keycard Record",
      "description1": "Record of keycards used to enter the Committee chamber."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Victim's Letter",
      "description1": "A letter that appears to have been written to the victim by Kay."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Broken Plushie",
      "description1": "The stuffed animal we originally found in the Zheng Fa presidential plane. Missing its left horn.",
      "description2": "Fitted with a recording device that captured part of a conversation. One of the people recorded had a prominent burn."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Masks",
      "description1": "A selection of various masks was kept on a rack. Each participant in the auction wore one."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Ringleader's Appearance",
      "description1": "Ringleader wore a white jacket, white gloves, a magenta flower, and a mask. Age and gender could not be discerned.",
      "description2": "Ringleader wore a white jacket, white gloves, a magenta flower, and a mask. Also had a tattoo on the part of their face the mask didn't cover."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Ms. Hart's Picture",
      "description1": "A photograph of the mysterious figure in the red raincoat. Click here for details."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Ms. Hart's Statement",
      "description1": "Ms. Hart's observations about what happened during the mysterious auction."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Elevator Blood",
      "description1": "Blood was detected on the secret elevator. It looks like it dripped through to the floor below."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Clothes Box",
      "description1": "Box in which the killer hid the body. Traces of blood were detected inside."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Committee Chamber Blood",
      "description1": "Blood found in the Committee chamber. Was it placed there to hide the existence of the storeroom?"
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Red Raincoat",
      "description1": "Worn by the victim, whose fingerprints and blood were found on the hood."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "Nurse Niedler's Statement",
      "description1": "Niedler's description of how she swapped places with Rosie Ringer."
    },
    {
      "currentChapter": "A Turnabout Forsaken",
      "name": "IS-7 Incident Case File",
      "description1": "Details of a murder case from eighteen years ago."
    }
  ],
  "turns": [
    {
      "category": "rebuttal",
      "newContext": "A Turnabout Forsaken\n\n\n\n\n\n\n\n\n\nTranscript\nThis article contains information about Ace Attorney media that has been recently released and thus likely contains spoilers!\n\n\n\nThe information in this article comes from a game, demo, or other media that has been recently released worldwide. This article may need input from an editor who has personal experience with the media in question. If you have, you can help the Ace Attorney Wiki by expanding this article. Please heed the manual of style when adding information.\nReaders of this page should be aware that this article likely contains MAJOR SPOILERS concerning the media in question.\nYou have been warned!\nWe need more pieces to finish this puzzle.\n\n\n\n\nThis article is under construction. While it is not short, it still needs expansion as outlined in the manual of style. The article most likely needs expansion near the end of the tagged section or sections.\nThis article or section needs attention for quality control purposes.\n\n\n\n\nThe content marked by this message box has been identified as requiring improvements to a reasonable standard of quality. Content may be marked for a variety of reasons, including known false information or excessive typos. Fact-checking for false/missing information can be a time-consuming task, but the wiki has been working on transcripts that may help speed up the process. Please also consult the manual of style. You are welcome to discuss this issue in the talk page of the article. Note: The editor who added this tag believes this article or section should be cleaned up for the following reason: re-formatting, quality control, changing everything to official 2024 release\nPart 1\n\nPart 2\nEpisode 4A Turnabout Forsaken\nFrom here on cut, let the council begin! Let our members discuss this matter with a clear conscience of the Goddess of Law! Today's deliberation shall be about... Miles Edgeworth's aptitude and ability as a prosecutor!\nKay:\nWh-Who are you...? Why are you wearing that raincoat...? Ah! AAAAAAAAAAAAAAAAAAAAAAAAAAAHHHHHHHHHHHHhhhh!\nApril 5, 1:23 PMHigh Prosecutors' OfficesRoom 1202\nExamine evidence\n\n\n\n\n\n\n\n\n\nFront side of Prosecutor's Badge\n\n\n\n\n\n\n\nEdgeworth:\nThis badge's design is said to reflect the relentlessness and discipline of law enforcement. It comes from the authority vested in us as strict protectors of the law... ...and executors of sentences, much like harsh winter frosts and blazing summer days. To wear it is to identify oneself as a prosecutor, but I have no interest in doing so.\n\n\n\n\nBack side of Prosecutor's Badge\n\n\n\n\n\n\n\nEdgeworth:\nEach Prosecutor's Badge is engraved with the number of its owner on the back. Hmph. Numbers. As if we're not human on the inside like everyone else!\nEdgeworth:\nCalm down. You're getting dust everywhere.\nGumshoe:\nI've already cleaned this room three times since this morning!\nEdgeworth:\nWell, now you'll need to do it a fourth time.\nGumshoe:\nYou're way too calm, sir! What if they actually take your badge!?\nEdgeworth:\nA decision has not yet been made.\nGumshoe:\nBut it looks like it's pretty much decided! Don't you remember what Judge Courtney said!?\nCourtney:\nProsecutor Edgeworth, the P.I.C. has you in its sights. They will receive a report on everything you did here today... ...and you will most likely be required to appear before them.\nEdgeworth:\nI have been ordered to attend the meeting. ...That's all.\nGumshoe:\nI hate this, sir! I won't be able to work with you anymore!\nEdgeworth:\nAs a detective, perhaps you should welcome this turn of events. You would no longer have to work with such a troublesome prosecutor as myself.\nGumshoe:\nWh-Why would you say something like that, sir...? The problem is with the P.I.C. and their false accusations... Mr. Edgeworth... Don't tell me... you actually want to become a defense attorney?\nEdgeworth:\n......\nGumshoe:\nB-Because you can't do that! Being a prosecutor is exactly what makes you Prosecutor Edgeworth, sir!\nEdgeworth:\n(...A defense attorney, huh? I became a prosecutor because of the incident where I lost my father... However, the reason I became interested in the legal world... ...was because my father who passed away... had been a defense attorney.)\nRay:\nTo fight crime as a prosecutor, or to save people as a defense attorney. I want you to think carefully, about how you want to live your life from now on.\nGumshoe:\nAre you listening, sir!? I don't like this one bit!\nEdgeworth:\nThere is no need for you to be so pessimistic. Maybe my replacement will be more lenient during your salary assessments.\nGumshoe:\nA-Ah, I see... That way, I can eat more than just instant noodles every day...! Wait, what am I saying!? That's not the point here!\nEdgeworth:\n(He was... actually imagining it.)\nGumshoe:\nWe're busy right now! Come back later, pal!\n???:\nPaging Mr. Edgeworth. Is there a Mr. Miles Edgeworth here?\nGumshoe:\nMr. Edgeworth is busy now! I'll listen to whatever you have to say later, pal!\n???:\nHrmm... This isn't good! Your face has become all red. Errrm... A red face, a red face...\nGumshoe:\nUmm, like I said, we're kind of busy right now, so...\n???:\nI've got it! You have a tummy ache, right!? This calls for an injection, stat! Please roll up your sleeves!\nGumshoe:\nAiiieeeee! Nonono, I'm perfectly healthy!\nEdgeworth:\n...Who might you be?\nKarin:\nAaaah, I'm so sorry! I forgot to introduce myself! My name is Karin Jenson. I am a registered nurse at the Dye-Young Hospital.\nEdgeworth:\nI'm sorry, but nobody here is sick. You must have the wrong room.\nKarin:\nAre you Mr. Miles Edgeworth? You have such great wrinkles between your brow... Could it be lupus? This calls for an injection...\nEdgeworth:\nI-It's not lupus! Just tell me what business you have with me!\nKarin:\nAhh. Yes, yes. Actually, there's someone who would like to see you. Please wait a moment. I'll call them here right now!\nEdgeworth:\nWait!\nGumshoe:\nShe left, sir. I wonder who she's going to bring. Hmm, if she's bringing someone from the hospital... Could it be a patient, sir? Maybe it's someone who was traumatized by your harsh words...\nEdgeworth:\nWhat is that supposed to mean?\nGumshoe:\nS-See? When you glare at me like that, it feels like I'm going to have a heart attack. You could send someone to the hospital with that...\nEdgeworth:\n(I-Is it really that bad...? I'm just being my normal self, though.)\nKarin:\nSorry for the wait! Well, what do you think?\n???:\n........\nEdgeworth:\nWhat do I think...?\n???:\nUmm... Do you not recognize me?\nEdgeworth:\n(Now that she mentions it, I feel like I've met her before...)\n???:\nUmm... this card... Your name was written on it... Do you know who I am?\nGumshoe:\nM-Mr. Edgeworth... Maybe you really did send her to the hospital...\nEdgeworth:\nOf course not!\nGumshoe:\nBut this is your business card, sir. It clearly says... \"Prosecutor Miles Edgeworth\".\nEdgeworth:\nUmm. Th-That's true...\n???:\nI-I am terribly sorry... I'm, umm, well...\nKarin:\nThe truth is, this girl... suffers from memory loss.\nGumshoe:\nM... Memory loooosss?\n???:\nYes... That seems to be the case.\nKarin:\nAhh... Her parents should be worried sick right now... They probably haven't been able to sleep. I doubt they've gotten more than 8 hours...\nEdgeworth:\n(Isn't that plenty of sleep?)\nGumshoe:\nI see. It sure sounds horrible... but it's alright now! Since she has that business card, she must be an acquaintance of Mr. Edgeworth's. Just leave her to us, pal! Right, Mr. Edgeworth?\nEdgeworth:\nIndeed... We might be able to verify her identity, at least.\n???:\nWould you... really do that for me?\nEdgeworth:\nFirst, I'd like you to tell us everything that you know.\nGumshoe:\nThat's our Mr. Edgeworth! You have nothing to worry about now, Miss!\nEdgeworth:\n(Good grief...)\nMysterious girl\n\n\n\n\n\n\n\nLeads to:\n\"(But still, where to begin? What should I ask her first...?)\"\nPresent\n\n\n\n\n\n\n\n\n\nAnything\n\n\n\n\n\n\n\n???:\n...I am terribly sorry. Even if you give me that, I still don't remember anything about you.\nEdgeworth:\nN-No... I wasn't planning on giving it to you...\nEdgeworth:\n(But still, where to begin? What should I ask her first...?)\nGumshoe:\nMiss. Do you remember your name?\n???:\nMy name...... I am terribly sorry.\nKarin:\nShe's been like this ever since yesterday, y'know?\nEdgeworth:\n...Hmm. So you found her yesterday.\nKarin:\nWooow! That's amazing! How'd you know!?\nEdgeworth:\n(Wh... What a tiresome woman...)\nKarin:\nI found her stumbling around late last night, so I took her in. I wanted to help her out, so I looked through her things.\nEdgeworth:\nSo, that's how you found my business card. Did she have anything else with her?\nKarin:\nNothing to reveal her name or address... Ah! But! She was wearing this when I found her. It's an unusual design, don't you think?\nEdgeworth:\nWha... Th-This badge is...\nGumshoe:\nWhaaaaaaat! Th-The Yatagarasu's...! That means... I-I-It couldn't be!\nEdgeworth:\nAre you Kay!?\n???:\nKay......?\nYatagarasu's Badge data jotted down in my Organizer.\nYour name\n\n\n\n\n\n\n\nEdgeworth:\nYou are... Kay, right?\nKay:\nI am... Kay......\nGumshoe:\nKay! Don't you remember me!? I mean, you'd always call me \"Gummy\", pal!\nKay:\nG-Gummy... I would call one of my elders something so rude...? Aaah... I'm so sorry! What a horrible thing I did...! I feel like my heart is going to burst from guilt!\nGumshoe:\nJust...... Just what happened to you, pal! You've become so sensitive! If you're this sensitive, and delicate, and frail... ...then you're not even Kay anymore! You're someone else, pal!\nEdgeworth:\nWatch your words, Detective. If you say that... ...it almost sounds like Kay isn't sensitive or delicate at all. (Though I can't deny there is some truth to what he says.)\nKay:\nUmm... What sort of person was I... before I lost my memory?\nGumshoe:\nWell, for starters, your name was Kay Faraday. A cheerful girl full of spirit and vigor, and a Great Thief.\nKay:\nGreat Thief...?\nEdgeworth:\nYes. To put it frankly... ...a Great Thief steals valuables from people's drawers and safes...\nKay:\nSt........Steal!! I caused so much trouble for others? Ahh... I'm so sorry! I never imagined I would be a criminal...! Maybe losing my memory was retribution for my crimes...\nEdgeworth:\nNo, you didn't actually...\nGumshoe:\nUuugghh... This is so messed up, sir...\nKarin:\nBut it does sort of make sense, y'know. These gloves and stuff, they look just like what a thief might wear.\nGumshoe:\nAh! Those clothes!\nKarin:\nYes. She was wearing them when I found her. I had her change her clothes, so I'm holding onto them for now...\nEdgeworth:\nHmm...? Something appears to be stuck on her clothes. Perhaps it has something to do with Kay's memory loss?\nGumshoe:\nI'll send it down to the lab later and have them check it out, sir!\nEdgeworth:\nGood. I will be counting on you, Detective Gumshoe.\nKarin:\nAt any rate... these really look like a thief's clothes, don't they!\nKay:\nI-I am... a criminal...\nEdgeworth:\nIt's true you were a Great Thief, but never once did you commit a crime. That alone I can assure you.\nKay:\n...Is that... so...?\nEdgeworth:\n(It's probably better if I don't press this issue any further.)\nMemory loss\n\n\n\n\n\n\n\nLeads to:\n\"...I'm really sorry. For not remembering you.\"\nPresent\n\n\n\n\n\n\n\n\n\nProsecutor's Badge\n\n\n\n\n\n\n\nKay:\nIs that a badge... for protecting someone? Like a badge worn by a hero of justice... right?\nEdgeworth:\nNo... This is called a Prosecutor's Badge. I think what you're referred to would be a defense attorney's badge, right?\nKay:\nI wonder...? This badge... makes me feel really nostalgic. As if someone really dear to me showed it to me a lot...\nEdgeworth:\n(Kay's father was a prosecutor. Perhaps little bits of her childhood memories still remain.)\n\n\n\n\nYatagarasu's Badge\n\n\n\n\n\n\n\nKay:\nDo you like badges, Mr. Edgeworth?\nEdgeworth:\nHmm. Not particularly.\nKay:\nBut you are always carrying around badges.\nEdgeworth:\nIt is just a part of my job. And this badge is also a piece of evidence...\nKay:\nI see. So you carry around things that you don't like in order to train and strengthen your spirit!\nEdgeworth:\n...That is just clearly wrong.\nExamine evidence\n\n\n\n\n\n\n\n\n\nFront side of Yatagarasu's Badge\n\n\n\n\n\n\n\nEdgeworth:\nThis is the badge that Kay is always wearing. It's emblazoned with the mark of the Yatagarasu and it really stands out. I doubt there are any thieves who would actually wear it.\nKay:\n...I'm really sorry. For not remembering you. Umm... What kind of relationship did we have?\nEdgeworth:\nHmm. Well, that's... (Rather difficult to explain.)\nGumshoe:\nKay, you were... Mr. Edgeworth's assistant!\nKay:\nOh my! So then, a prosecutor is the kingpin of a Great Thief?\nGumshoe:\nUh, no... That's not what I meant, pal...\nEdgeworth:\n(The last time I met \"Kay\" was the day before yesterday... Just what did she do from then up until now...?) Ms. Jenson, was the badge the only thing this girl had on her?\nKarin:\nShe did have some other things, but I don't think they will be very helpful at all.\nEdgeworth:\nI don't mind. Please show them to me.\nKarin:\nWell then, I'll give them to you one by one, OK!\nGumshoe:\nThis is a Jammin' Ninja mask. Maybe she went to a superhero show or something?\nEdgeworth:\nHmm. This seems to be a letter addressed to Kay. This is a ticket stub. And this is...\nGumshoe:\n...a flower made of cloth! Like the ones you usually see in restrooms, sir!\nEdgeworth:\n...A corsage. It is used primarily as an accessory for women.\nKarin:\nWell, that's everything. Did you find anything out?\nGumshoe:\nUmm, not really. They were just a bunch of random things.\nEdgeworth:\n(I'll have to look them over in more detail later.)\nJammin' Ninja Mask data jotted down in my Organizer.\nLetter jotted down in my Organizer.\nTicket Stub data jotted down in my Organizer.\nPurple Flower data jotted down in my Organizer.\nGumshoe:\nOoh.... This is horrible! Kay's lost her memory! How do we get her back to normal!?\nEdgeworth:\nCalm down, Detective. I have already thought of something.\nGumshoe:\nOh! As I would expect of Mr. Edgeworth! So, what did you find out, sir?\nEdgeworth:\nLook at this ticket stub.\nKarin:\nOh, it's a ticket for the viewing platform of the Bigg Building!\nGumshoe:\nUmm, Ms. Nurse? Do you know something about the Bigg Building?\nKarin:\nOf course I do! It's a super famous dating spot, after all! They say that if a couple holds hands up there, they will be together forever... Tee hee.\nEdgeworth:\nThe time stamp on the ticket is from yesterday. Moreover, it is only valid on the day of issue.\nGumshoe:\nSince she only has the stub... she must have used it, right?\nEdgeworth:\nIt is very likely. ...Well then, let's go.\nGumshoe:\nEhh! Right now, sir?\nEdgeworth:\nThe cause of Kay's memory loss is hidden in her actions.\nGumshoe:\nB-But... What about the P.I.C.!?\nEdgeworth:\nIt's still too early for me to be summoned there.\nKarin:\nErrrm... So, should I leave Kay with you, then?\nEdgeworth:\nThat is what I would prefer. Kay, you're fine with that, right?\nKay:\nAh... Yes, please! Thank you very much!\nKarin:\nWell, I have to get back to work, so if anything happens, please contact the Dye-Young Hospital. If you guys need an injection, I'll be there anytime, please!\nEdgeworth:\nYes. I understand. (I don't think I will call her for an injection, though.) Well then. Let's go, Detective. ...And you too, Kay.\nGumshoe:\nYessir!\nKay:\nThank you... for helping me.\nApril 5, 2:07 PMOutside Bigg BuildingTower Plaza\nGumshoe:\nUmm. According to the pamphlet... ...this building is 50 stories tall. It's mostly filled with offices though... Only the viewing platform is open to the public. Here you go, sir. I just got this at the reception desk.\nEdgeworth:\nGood. Thank you.\nBigg Building Pamphlet data jotted down in my Organizer.\nEdgeworth:\nWell then, let us head inside immediately...\nEeeek! The Bigg Building... The Bigg Building is collapsing!\nEdgeworth:\nHm!\nGumshoe:\nWh-What!?\n???:\nNo, you can't! Please stop! Please... I beg of you! Ugh, it's no good. Unless I drink fresh milk, my thoughts just won't reach...!\nGumshoe:\nWhat's wrong, pal!? Did something happen at the Bigg Building!?\nCuuuuuut! Cut, cut, cut, cuuuut!\n???:\nE-Excuse me! We're sort of in the middle of shooting a movie, and umm...\nEdgeworth:\n(...Hmph. I suspected as much.) We are sorry for any trouble we've caused you. ...Detective Gumshoe?\nGumshoe:\nI-I'm so sorry, pal! I really thought the tower was gonna collapse or something...\n???:\nWhatever... Hey, director! I'm taking a break.\n???:\nI'm sorry... I'm really, really sorry!\nKay:\nWhat a relief... It looks like the tower's collapse was prevented somehow.\nEdgeworth:\n(Explaining all this to Kay as she is now would take more time than it's worth...) Well then. We should get going.\nApril 5, 2:18 PMBigg BuildingViewing Platform\nGumshoe:\nWow, what a view! I bet I can see my house from here!\nKay:\nEek...! Th-The wind... is really strong up here.\nGumshoe:\nEverything should be fine as long as you stay close to me and Mr. Edgeworth, pal. If you start to blow away, one of us will be sure to catch you!\nEdgeworth:\n(It's not as if she's a kite!) Kay, do you recognize this place?\nKay:\n...I-I don't know. Was I... really here?\nEdgeworth:\n(Maybe if I get her to talk a bit, it will help jog her memory...) Kay. Just tell me whatever you remember. Anything will do.\nKay:\nO-OK. But I don't know how much help I'll be...\n-- Memories of the Tower --\nKay:\nDid I... really come to a place like this?\nIt's so high up, and the wind is so strong... It's frightening.\n...I just can't remember. I can't remember anything at all...\n.....I'm sorry. Just as I thought, it's impossible.\nGumshoe:\nHmm. Her memory isn't clearing up at all, huh?\nKay:\n...I'm so sorry. It's a bit pathetic, isn't it? You are both going out of your way for me, but I'm not helping at all.\nEdgeworth:\nYou're doing just fine. You have memory loss, after all.\nGumshoe:\nAlright, Mr. Edgeworth! Remember to go easy on her, sir. Normally, you have this really intense and kind of scary look on your face.\nEdgeworth:\n(...You're not helping, Detective.)\n\nEdgeworth: Edgeworth: This ticket stub proves that you were indeed here. Kay: But I really don't remember coming here at all. I don't think I would want to come to a place like this.\nEdgeworth: Edgeworth: You used to love places like these, though. Kay: Was that... really me? We're so high up... Just looking down makes me dizzy. I think these kinds of places should be shut down. What if an elderly person or a small child were to fall off...! Edgeworth: The railing here is quite high. I think your worries are unfounded. Kay: ...Is that so...?\nEdgeworth: Edgeworth: You say you don't remember anything... In that case, is there anything that looks familiar? Kay: Looks familiar? Umm....... Ah! The cherry tree! Edgeworth: What about the cherry tree? Kay: I was standing under that cherry tree... That's right, I was taking shelter from the rain because it was raining then... And there... A red... I saw... something red... Edgeworth: (Hmm. She was under the cherry tree while it rained... And... from there she saw something red...) Kay: Umm, is something wrong...? Edgeworth: It's nothing. Could you add that last part to your story? Change this statement to: \"But... from under the cherry tree... I feel like... I saw something red.\"\nEdgeworth: Edgeworth: A red... what exactly? Kay: A red... something or other. It was something red. That's... all I can remember about it. Edgeworth: (Speaking of things that are red here...) Could it be that stand over there? Kay: Stand... A red... stand... ...Ahh, that's right! I saw someone walking towards me from the other side of that stand. Edgeworth: And then what happened? Kay: And then... Umm... .....I'm sorry. Edgeworth: It's alright. Simply add everything you just said to your story. Change this statement to: \"Umm... That's right, someone was walking towards me from the other side of that stand.\"\nEdgeworth: Edgeworth: By that stand, do you mean the stand directly behind you? Kay: Yes. From behind that red stand, someone came walking towards me... I saw it from under the cherry tree. Edgeworth: You've been saying that you saw \"someone\"... Does that mean you didn't see their face? Or was it a person you didn't know? Kay: .....I'm sorry. That much, I don't know. Edgeworth: (So \"someone\" came walking towards her from behind the red stand... ...and she saw that from beneath the cherry tree.)\nEdgeworth: Edgeworth: Is there nothing else that comes to mind? It doesn't have to be related to the case. Kay: Even if it's not related.....? Umm... Well... Ah... I remember that the stand there was selling cotton candy. Edgeworth: ...If you're hungry, you should just say so. Gumshoe: I'll make sure to buy one for you later, pal! Kay: ...Thank you very much. I look forward to it.\nEdgeworth: (There's not much I can do unless I can draw out more information from her... For now, I'll press her for more details and see what I can find out.)",
      "testimonies": [
        {
          "testimony": "Did I... really come to a place like this?",
          "person": "Kay",
          "present": []
        },
        {
          "testimony": "It's so high up, and the wind is so strong... It's frightening.",
          "person": "Kay",
          "present": []
        },
        {
          "testimony": "...I just can't remember. I can't remember anything at all...",
          "person": "Kay",
          "present": []
        },
        {
          "testimony": "But... from under the cherry tree... I feel like... I saw something red.",
          "person": "Kay",
          "present": []
        },
        {
          "testimony": "Umm... That's right, someone was walking towards me from the other side of that stand.",
          "person": "Kay",
          "present": [
            "Bigg Building Pamphlet"
          ],
          "source": {
            "evidence_span": "On a top-down view of the viewing platform on the roof, to the left-most edge is a cherry tree. To the right-most edge is a candy stand.",
            "testimony_span": " someone was walking towards me from the other side of that stand",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": ".....I'm sorry. Just as I thought, it's impossible.",
          "person": "Kay",
          "present": []
        }
      ],
      "summarizedContext": "Kay, who was the victim of a fall from the Bigg Building, has lost her memory. She is trying to remember what happened before she fell.",
      "noPresent": false,
      "labels": [
        "spatial"
      ],
      "reasoning": [
        "Fact 1: The witness claims a person was behind the stand.",
        "Fact 2: The witness also claims she was under the cherry tree.",
        "Fact 3: The evidence suggests the cherry tree was on the left-most edge of the room.",
        "Fact 4: The evidence also suggests the stand was on the right-most edge of the room.",
        "Prop 1: If a person is viewing a location on the right from the leftt edge, a person behind that location would be to the right of the location.",
        "Prop 2: If a location is on the right-most edge of a room, there cannot be a person to the right of that location."
      ]
    },
    {
      "category": "rebuttal",
      "newContext": "-- Memories of the Tower --\nKay:\nDid I... really come to a place like this?\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThis ticket stub proves that you were indeed here.\nKay:\nBut I really don't remember coming here at all. I don't think I would want to come to a place like this.\nKay:\nIt's so high up, and the wind is so strong... It's frightening.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou used to love places like these, though.\nKay:\nWas that... really me? We're so high up... Just looking down makes me dizzy. I think these kinds of places should be shut down. What if an elderly person or a small child were to fall off...!\nEdgeworth:\nThe railing here is quite high. I think your worries are unfounded.\nKay:\n...Is that so...?\nKay:\n...I just can't remember. I can't remember anything at all...\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou say you don't remember anything... In that case, is there anything that looks familiar?\nKay:\nLooks familiar? Umm....... Ah! The cherry tree!\nEdgeworth:\nWhat about the cherry tree?\nKay:\nI was standing under that cherry tree... That's right, I was taking shelter from the rain because it was raining then... And there... A red... I saw... something red...\nEdgeworth:\n(Hmm. She was under the cherry tree while it rained... And... from there she saw something red...)\nKay:\nUmm, is something wrong...?\nEdgeworth:\nIt's nothing. Could you add that last part to your story?\nChange this statement to:\n\"But... from under the cherry tree... I feel like... I saw something red.\"\nKay:\nBut... from under the cherry tree... I feel like... I saw something red.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nA red... what exactly?\nKay:\nA red... something or other. It was something red. That's... all I can remember about it.\nEdgeworth:\n(Speaking of things that are red here...) Could it be that stand over there?\nKay:\nStand... A red... stand... ...Ahh, that's right! I saw someone walking towards me from the other side of that stand.\nEdgeworth:\nAnd then what happened?\nKay:\nAnd then... Umm... .....I'm sorry.\nEdgeworth:\nIt's alright. Simply add everything you just said to your story.\nChange this statement to:\n\"Umm... That's right, someone was walking towards me from the other side of that stand.\"\nKay:\nUmm... That's right, someone was walking towards me from the other side of that stand.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nBy that stand, do you mean the stand directly behind you?\nKay:\nYes. From behind that red stand, someone came walking towards me... I saw it from under the cherry tree.\nEdgeworth:\nYou've been saying that you saw \"someone\"... Does that mean you didn't see their face? Or was it a person you didn't know?\nKay:\n.....I'm sorry. That much, I don't know.\nEdgeworth:\n(So \"someone\" came walking towards her from behind the red stand... ...and she saw that from beneath the cherry tree.)\nPresent Bigg Building Pamphlet\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"So, you're saying that someone came from behind the stand...\"\nKay:\n.....I'm sorry. Just as I thought, it's impossible.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nIs there nothing else that comes to mind? It doesn't have to be related to the case.\nKay:\nEven if it's not related.....? Umm... Well... Ah... I remember that the stand there was selling cotton candy.\nEdgeworth:\n...If you're hungry, you should just say so.\nGumshoe:\nI'll make sure to buy one for you later, pal!\nKay:\n...Thank you very much. I look forward to it.\nEdgeworth:\n(There's not much I can do unless I can draw out more information from her... For now, I'll press her for more details and see what I can find out.)\nEdgeworth:\nSo, you're saying that someone came from behind the stand... ...and walked directly towards you.\nKay:\nYes. Someone came right up to me.\nEdgeworth:\nThen that \"someone\" must have been a ghost.\nKay:\nNo, it was a person! I'm sure of it!\nEdgeworth:\nIf this is where you were under the cherry tree, then someone behind the stand... ...wouldn't have any ground to stand on. They'd be floating in midair! No person should be able to stand there!\nKay:\nEeeeek!\nKay:\nBut... I... I'm not lying! Someone... red... Someone in red... was on the other side of the stand... They were walking towards me... Ahh... Getting closer and closer, and then... ...that person... that person... AAAAAAAAAHHHH!\nGumshoe:\nWh-What's wrong!? Calm down! It's alright! Me and Mr. Edgeworth are both here for you, pal!\nKay:\nI-I... I was... pushed off. That person... in red... Yes, they were wearing a red raincoat...\nEdgeworth:\n(Someone in a red raincoat was walking in midair? And furthermore, they pushed her off this building? Nonsense. There is no way she could be alright after falling from a building this high!)\nKay's memories jotted down in my Organizer.\nOfficer:\nAttention, everyone! Please remain where you are!\nGumshoe:\nWhat's wrong, pal? I'm a detective! Tell me what's going on!\nOfficer:\nSir! A body was just discovered in this building!\nGumshoe:\nA-A body!?\nEdgeworth:\nWho is the victim!?\nOfficer:\nWe're currently investigating the details, but the victim is a woman! We have verified that her name is \"Kay\"!\nEdgeworth:\nWhat...\nGumshoe:\nWHAAAAAAAAT!?\nTo be continued.\nApril 5, 2:36 PMBigg BuildingP.I.C. Meeting Room\nEdgeworth:\n(Th-This room is...!) Would this room happen to be...\nOfficer:\nYes, sir! It's the Prosecutorial Investigation Committee's meeting room!\nGumshoe:\nWhaat! It's here!?\nEdgeworth:\nI had heard they recently moved out of the Prosecutor's Building. (But to think that they moved here of all places...)\nBigg Building Pamphlet data updated in my Organizer.\nKarin:\nMr. Edgeworth! Kay! What brings you here? How are you holding up?\nEdgeworth:\nWe're in the middle of an investigation right now. Sorry, but who might this be?\nKarin:\nAh! This is my Granny! Errm, let me just... \"Hi there sonny, the name's Bonnie Young. Who the heck are you?\" ...she says.\nEdgeworth:\nIt is a pleasure to meet you. My name is Miles Edgeworth. I am a prosecutor. Ms. Jenson, isn't Young the name of...\nKarin:\n*ahem!* Granny is the director of the Dye-Young Hospital!\nEdgeworth:\n(This old lady... is the director?)\nKarin:\n\"Who're you callin' old!\" ...she says.\nEdgeworth:\n(...Sh-She can read my thoughts?)\nGumshoe:\nOh! So that Granny is pretty important, huh?\nKarin:\nAh ha ha! I wouldn't go that far... I mean, yes, she is. Aah, these people are... the patient's guardians. Y'know, the one with amnesia...\nEdgeworth:\n(Hmm. It seems she is a bit of an introvert.)\nKarin:\n\"Hey sonny, want me to cure that bad case of the frownies for you?\" ...she says.\nEdgeworth:\n...!\nGumshoe:\nHa ha ha! I'm afraid that's an incurable disease for Mr. Edgeworth, pal!\nKarin:\nEh? Really, Granny? You want me to say that... \"I ain't got nothin' to say to you whippersnappers! You're free to do whatever you want. But you better not get in the way of my autopsy.\"\nEdgeworth:\nPlease wait. We're...\nKarin:\n\"No means no!\"\nGumshoe:\nHey, you don't have the right to decide that, pal!\nKarin:\nS-Sorry! Granny is the coroner, you see. And she's in charge of this case, so... Ouch! So, I'm very sorry, but that's the way it is.\nGumshoe:\nWhaddaya mean, \"that's the way it is,\" pal!?\nKarin:\nWell... Even if you ask me, I'm not the one who said it.\nGumshoe:\nI kinda feel like..... I'm watching a comedy act, sir.\nKarin:\nWell, we need to get back to the autopsy, so please excuse us! And take care!\nGumshoe:\nWhat was with her attitude!?\nEdgeworth:\nWe received permission to investigate. There shouldn't be any problems.\nGumshoe:\nThat atittude of hers is a huge problem, sir!\nKay:\nMr. Edgeworth...? What do we do now?\nEdgeworth:\nWe'll investigate the scene, of course. As a prosecutor, I cannot stand by and do nothing.\nKay:\n.........\nEdgeworth:\nWell then, let's begin.\nKay:\nBut, the policeman said the dead person is also named \"Kay\"... Then, I'm pretty sure I'm not the Kay that you know, Mr. Edgeworth.\nEdgeworth:\nWe shall investigate that now. But... don't worry. There's no question that you are the Kay I know.\nKay:\n.....OK!\nEdgeworth:\n(An amnesiac Kay, and a corpse Kay... Both are connected to the Bigg Building. I'm certain that this case will lead me to Kay's lost memories!)\nBegin Investigation\nBigg BuildingP.I.C. Meeting Room\nPartner\n\n\n\n\n\n\n\nGumshoe:\nYes, sir!\n\n\n\nNotice anything?\n\n\n\n\n\n\n\nGumshoe:\nFor a homicide to occur out of the blue like that, it sure is surprising, sir! I may be a detective, but when things happen so suddenly, my mind goes completely blank! And that's why I haven't noticed anything at all, sir!\nEdgeworth:\nHmm... It takes a certain kind of talent to be able to declare that so cheerfully.\nGumshoe:\nO... Oh...! Are you saying I'm talented!? I-I'm honored, sir! Being praised by Mr. Edgeworth! Those kind words... I'll never forget this moment!\nEdgeworth:\n(...He looks so happy, I can't bring myself to tell him that it's all a misunderstanding!)\n\n\n\n\nBigg Building\n\n\n\n\n\n\n\nEdgeworth:\nI never thought the P.I.C.'s meeting room would be right under the viewing platform.\nGumshoe:\nIt sure saved us the trouble of getting here! In fact, the P.I.C. is actually mentioned in this pamphlet, sir. It's in the Bigg Building's Little Gossip Column. ...I'll read it for you! \"The Prosecutorial Investigation Committee is located on the 50th floor of the Bigg Building! It's a place where Prosecutors turn into Ex-Prosecutors.\"\nEdgeworth:\nHm...!\nGumshoe:\n\"So come visit the 50th floor, and see the dejected looks on the Prosecutors' faces!\"\nEdgeworth:\nI-I am not making a dejected face!\nGumshoe:\nHey! I'm just reading what's in the pamphlet, sir!\n\n\n\n\nKay Faraday\n\n\n\n\n\n\n\nGumshoe:\nThe living Kay we have here, and the dead \"Kay\" over there... Why do they have the same name? It can't just be a coincidence, sir!\nEdgeworth:\nIndeed. However, we won't be able to answer that question until we examine the body...\nGumshoe:\nIt's all because of that crabby coroner!\nEdgeworth:\nShe is only doing her job. For now, all we can do is wait.\nGumshoe:\nUmm... Th-Then right now, since we have some time... ...allow me to present one of my theories to you, sir! The answer is simple! With all the advancements in scientific technology... ...what if the two Kays are clones!? That's the only way any of this makes sense!\nEdgeworth:\n............ Let's investigate the other parts of the room, until the autopsy is finished.\nGumshoe:\nAww, please don't ignore me like that, sir...\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nProsecutor's Badge\n\n\n\n\n\n\n\nGumshoe:\nIf you're not going to be a prosecutor anymore, then what am I supposed to do...?\nEdgeworth:\nNow isn't the time to be thinking of such things, Detective.\nGumshoe:\nBut! It's not fair that the P.I.C. keeps on hounding you like this, Mr. Edgeworth! You haven't even done anything wrong! If anything, you just... rub people the wrong way.\nEdgeworth:\n...You should watch what you say as well, so you don't rub people the wrong way.\n\n\n\n\nYatagarasu's Badge\n\n\n\n\n\n\n\nGumshoe:\nIt's Kay's treasure. She always wears it on her clothes.\nEdgeworth:\nEven after seeing her own badge, she still didn't remember anything...\nGumshoe:\nIt's just strange, seeing Kay acting so unlike herself. I'm not even sure how I should act towards her anymore.\nEdgeworth:\nYou should just be yourself, Detective. For her sake.\nGumshoe:\n! You're right, sir! Alright! Well then, time to start making some careless mistakes!\nEdgeworth:\n(He's actually aware that he makes careless mistakes...!)\n\n\n\n\nLetter\n\n\n\n\n\n\n\nGumshoe:\nA letter has a stamp... right? And stamps... go right into my collection.\nEdgeworth:\nI never pictured you as a stamp enthusiast, Detective.\nGumshoe:\nWhenever I get a letter, I make sure to check the stamps very carefully. And, if I find one that doesn't have a postmark on it...!\nEdgeworth:\n...Are you saying that you reuse old stamps?\nGumshoe:\nO-Of course not, sir. I'm a law-abiding Detective, after all. Ha ha ha.\nEdgeworth:\n...Something tells me that isn't completely true.\n\n\n\n\nKay's Memories\n\n\n\n\n\n\n\nGumshoe:\nI wonder where Kay lost her memories. *sigh*... Maybe one of the security guards found it, and it's sitting in the Lost & Found...\nEdgeworth:\nDetective Gumshoe... Are you joking around?\nGumshoe:\nNot at all, sir! I just want to do something for Kay! Anything! Because... I just feel so bad for her.\nEdgeworth:\nIf that's how you feel, then devote yourself completely to the investigation... ...because right now, that's the only thing we can do.\nGumshoe:\nYes... Yes, sir! Just tell me whatever you want me to do!\n\n\n\n\nAnything else\n\n\n\n\n\n\n\nGumshoe:\nHa ha ha! Mr. Edgeworth, you're such a joker! Even if you show that to me, I still have no idea what it is, sir!\nEdgeworth:\n(He proclaimed that quite proudly...)\nBookshelf on left\n\n\n\n\n\n\n\nGumshoe:\nThese books all seem really think and heavy, sir...\nEdgeworth:\nThe P.I.C. did just move in here. Moving all these books must have been a lot of work.\nGumshoe:\nMoving heavy objects is my specialty, sir! If they had just called me, I would've helped!\nEdgeworth:\nHeh. Then perhaps I should ask the chairman if there's anything else left for you to move.\nGumshoe:\n...Whooooah! Th-That was just a joke, sir! If I had to carry something up 50 stories, I wouldn't be able to do any more work today!\nEdgeworth:\n(Of course, I was joking too... But were you really going to carry things up the stairs?)\nHalf round table\n\n\n\n\n\n\n\nEdgeworth:\nIt's half of a large round table with 11 chairs. It seems to be based off a certain legend.\nGumshoe:\nI know that one, sir! It's the famous Knights of the Brown Table!\nEdgeworth:\n......\nGumshoe:\nH-Huh!? Was I wrong? Knights of the Clown Table? Knights who say Ni!?\nEdgeworth:\n(He's getting colder... But I won't say anything.)\nKay Faraday\n\n\n\n\n\n\n\nKay:\nYes? Can I help with something?\n\n\n\nNotice anything?\n\n\n\n\n\n\n\nKay:\nUmm... This is an amazing room. There are large boxes filled with books, a stone sculpture, and sparkly windows.\nEdgeworth:\nHmm... It seems you have also forgotten the names of objects. This might be helpful for recovering your memories. Just repeat after me. Bookcase.\nKay:\n...Broken safe.\nEdgeworth:\nStained glass.\nKay:\n...Stolen goods.\nEdgeworth:\nBooks on the law.\nKay:\n...Crooks on the lam.\nEdgeworth:\nStatue of the goddess.\nKay:\n...Snatched loot of the Great Thief.\nEdgeworth:\n(Are all her mistakes biased towards a certain way...?)\n\n\n\n\nMiles Edgeworth\n\n\n\n\n\n\n\nEdgeworth:\nKay. Until just a few days ago, you were calling yourself my assistant. Looking at me, is there anything you remember?\nKay:\nThings I remember, huh? Well, yes, just one thing... Mr. Edgeworth, on the viewing platform above us...\nEdgeworth:\nOh?\nKay:\nYou pointed at me, and...\nEdgeworth:\nYes?\nKay:\nWith a really scary face, you interrogated me!\nEdgeworth:\n(...That happened just a few minutes ago!)\nGumshoe:\nOh, poor Kay! The terror of Mr. Edgeworth badgering you for contradictions is your only memory... It must be scary, pal! Hopeless! The end of the world, pal!\nEdgeworth:\n(I should show this detective what true terror really is!)\n\n\n\n\nDetective Gumshoe\n\n\n\n\n\n\n\nEdgeworth:\nKay. Before you lost your memories, you got along well with Detective Gumshoe.\nGumshoe:\nDoes looking at me help you remember anything, pal?\nKay:\nDo I remember anything? Ummm... Hmmmm...... Ah! I know! For a while now, Mr. Edgeworth has been getting on your case!\nGumshoe:\n...Th-That's not a memory. It's just a pleasant part of my daily life. Isn't that right, Mr. Edgeworth?\nEdgeworth:\n(Oh? So Detective Gumshoe thinks it's pleasant... It seems I'll have to get on his case even more from now on!)\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nJammin' Ninja Mask, Letter, Ticket Stub, or Purple Flower\n\n\n\n\n\n\n\nKay:\nI was carrying this, right? ...I don't remember anything about it though.\nEdgeworth:\nSo you really don't remember? Not even a little bit?\nKay:\nWell..... Ah! Maybe I just grabbed it without thinking, due to the shock of losing my memories! You know, like they say, \"grasping at straws.\"\nEdgeworth:\n.....\nKay:\nWhat's wrong? You have an awfully serious look on your face.\nEdgeworth:\n...I won't tell you to be silent. But you should think before talking.\nKay:\nI-I see... I will keep that in mind.\n\n\n\n\nKay's Memories\n\n\n\n\n\n\n\nKay:\nThe person in the red raincoat really was there.\nEdgeworth:\nAre you sure that they were walking towards you from behind the stand?\nKay:\nThat's right... They walked straight up to me. There must be some evidence. Maybe that person... left footprints behind!\nEdgeworth:\nThere is no ground behind the stand. No one could have walked there...\nKay:\nThen, was that person... a ghost?\nEdgeworth:\n...There are no such things as ghosts!\nKay:\nO-Oh... Is this one of those so-called \"contradictions\"...?\nBookshelves on middle\n\n\n\n\n\n\n\nEdgeworth:\nThese bookshelves are very well organized. Looking at them feels good.\nGumshoe:\nThat's true! ...There's not even a speck of dust on them. But I'm also extremely dedicated to cleaning your office, sir! First I sweep, then I vacuum, next I wipe everything clean, twice, and then I was the...\nEdgeworth:\n(It'd be nice if you were this dedicated to your job...)\nKarin Jenson and Bonnie Young\n\n\n\n\n\n\n\nKarin:\nUm, I'm sorry. Right now Granny is in the middle of the autopsy, so... \"Are you sonnies tryin' to get in the way of my autopsy!?\" ...Is what she says. Could you please wait just a little bit longer?\nEdgeworth:\nYes, I suppose we have no choice. We'll come back to investigate the body later.\nLady Justice statue\n\n\n\n\n\n\n\nEdgeworth:\nThis is... Lady Justice.\nGumshoe:\nYou sure do know a lot, sir. ...So, what kind of powers does she have?\nEdgeworth:\nShe is a symbol of justice, not a superhero. (It's said the scales represent Justice; the sword, Power; and the blindfold, Equality.)\n\n\n\nBefore examining bloodstain\n\n\n\n\n\n\n\nEdgeworth:\n(I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\n\nAfter examining bloodstain\n\n\n\n\n\n\n\nEdgeworth:\n(I already checked this area earlier, but it never hurts to take another look.)\n\n\n\n\nLady Justice statue\n\n\n\n\n\n\n\nGumshoe:\nThis is a really huge statue! Why's it in a place like this?\nEdgeworth:\n...She is known as the Goddess of Justice. You might call it a statue for judging prosecutors. It seems this statue was also made by Pierre Hoquet.\nGumshoe:\nOh! You mean the victim of the IS-7 Incident, Isaac Dover!?\nEdgeworth:\nSetting aside his background and personality... he really was a brilliant sculptor.\nGumshoe:\nWell, they do say that artists are either geniuses or weirdos.\nEdgeworth:\n(I suppose... Larry would fall into the latter category.)\n\n\n\n\nBloodstain\n\n\n\n\n\n\n\nEdgeworth:\nA pool of blood lies at the feet of the goddess statue. Hmm. Judging from the pool of blood, it seems that this was where the victim was killed.\nGumshoe:\nBut, sir... the body is over there.\nEdgeworth:\nAfter murdering the victim, did the killer move the body...?\nStand\n\n\n\n\n\n\n\nEdgeworth:\nIf things had gone as planned, I would have been standing here right about now.\nGumshoe:\nYeah, sir... I'm glad that the P.I.C. meeting was delayed, but the cause of the delay was due to a murder...\nEdgeworth:\n(It's troubling to think that the P.I.C. meeting could condemn my career as a prosecutor. In any case, my top priority right now is to find the truth behind this case.)\nOfficer\n\n\n\n\n\n\n\nEdgeworth:\nYou there. Tell me the situation about the security of this room.\nOfficer:\nYes, sir! To enter this room, a special keycard is required!\nEdgeworth:\nI see. In other words, not just anyone can enter this room (Security - To enter the meeting room, a special keycard is needed.). So... the person who found the body was also...?\nOfficer:\nYes! It was a member of the P.I.C., who had come here for today's hearing.\nEdgeworth:\n(A member of the P.I.C... If not for this case, right now I would be...)\nBookshelf on right\n\n\n\n\n\n\n\nGumshoe:\nThere's rows and rows of books. This solemn atmosphere's kinda scary, sir.\nEdgeworth:\nScary? I would think that books foster a feeling of familiarity.\nGumshoe:\nActually, I once got in a lot of trouble for running through the library at full-speed, sir. But this isn't a library, so a light jog should be fine, right?\nEdgeworth:\n...... (If I don't make sure to stop him, he might actually do it...)\n(Examining bloodstain and talking to the officer leads to:)\n???:\nExcuse me.\nKarin:\nYou are...? Oh, yes, what is it? \"That voice... It's Von Karma, right?\" Umm... Do you know her, Granny?\n???:\nGood to see you again, Doctor. And you as well, Miles Edgeworth.\nEdgeworth:\nWh... (What is she doing here!? Franziska von Karma... She is a prosecutor working with Interpol, and the daughter of Manfred von Karma. She should be jetting around the world right now...)\nFranziska:\nWherever there is a case, I will follow. National borders mean nothing before me!\nEdgeworth:\nYour presence here must mean that this case has international significance...\nFranziska:\nYou know well enough that I'm chasing a smuggling ring. I shall recover all the stolen goods and crush that organization!\nEdgeworth:\nThen... does that mean the smuggling ring is also involved in this particular case?\nFranziska:\n...Any further information is confidential. I am not obligated to speak of it with you.\nEdgeworth:\n...! (So, it won't be that easy...)\nKarin:\nUmm, Ms. Franziska... von Karma? Granny says... \"The autopsy is complete. You're free to do what you want.\"\nEdgeworth:\nIn that case, we would like to investigate as well.\nKarin:\n\"I've heard rumors about you! No way am I letting you near the body! You're the prosecutor who's about to get the boot. You best run on home now, sonny!\" Er, umm, just so you know, I wasn't the one who said that, OK?\nKay:\nP-Please, Granny. We need to investigate... No matter what.\nKarin:\n\"Hey, lassie! Who you callin' Granny!?\"\nKay:\nEeek...! I-I'm sorry!\nEdgeworth:\n(We're not getting anywhere... I guess I have no other choice.) Franziska, please allow us to aid you in your investigation. We must examine that body in order to find out what happened to Kay!\nFranziska:\nTo Kay Faraday...?\nGumshoe:\nI'm asking you too, sir! Kay's in really bad shape!\nFranziska:\n......... I don't know what's going on... ...but fine, I'll grant you permission.\nEdgeworth:\n...! You have my thanks.\nFranziska:\nOf course, I didn't say it would come without a price. You will explain everything to me later.\nGumshoe:\nWe really owe you one, sir!\nFranziska:\nI wasn't talking to you, Scruffy!\nGumshoe:\nYEEEEOOWCH!\nFranziska:\nSo that's how it is. If you would be so kind as to authorize them too, Doctor?\nKarin:\n\"I suppose it's fine if he's with a prosecutor from Interpol.\" ...Is what she says. And I fully agree with Granny.\nFranziska:\nBy the Von Karma name, the entire world will be judged... That's just common knowledge.\nEdgeworth:\n(That's rather conceited for common knowledge...)\nKarin:\n\"Well, it's none of my beeswax anymore.\" ...Is what she says. Um, I hope you don't get in trouble for this.\nFranziska:\nYou needn't worry. My reputation will not be shaken by something so petty.\nEdgeworth:\n(Unlike me, who is on the verge of losing his badge.)\nBegin Investigation\nBigg BuildingP.I.C. Meeting Room\nLogic\n\n\n\n\n\n\n\n\n\n\"Security\" and \"Keycard\"\n\n\n\n\n\n\n\nEdgeworth:\nPerhaps the keycard the victim was holding is for this room.\nGumshoe:\nI'll go find out, sir!\n\n\nGumshoe:\nMr. Edgeworth! From this room's security system... ...we were able to retrieve the data of the victim's card!\nEdgeworth:\nSo that means, the victim was able to freely enter this room...\nFranziska:\nIf the card actually belonged to the victim, of course.\nEdgeworth:\nYes, of course.\nKeycard data jotted down in my Organizer.\nPartner\n\n\n\n\n\n\n\nGumshoe:\nYes, sir!\n\n\n\nNotice anything?\n\n\n\n\n\n\n\nGumshoe:\nProsecutor von Karma just got here, and she's already hit me with her whip. Even if I stand further back, she always seems to hit me before I can get out of the way.\nEdgeworth:\nNo, it's worse than that. At times it feels like she'll even chase you down, if you manage to avoid her attacks.\nGumshoe:\nAh! Yeah... That feeling of despair, I know it all too well, sir! I won't lose to you in terms of how any times she's hit me with her whip, Mr. Edgeworth!\nEdgeworth:\n(...That's not something to boast about.)\n\n\n\n\nKay Faraday\n\n\n\n\n\n\n\nGumshoe:\nAnother Kay? I bet they look identical, sir! Like two peas in a pod.\nEdgeworth:\nThey only share the same name. Please try not to jump the gun.\nGumshoe:\nJump the gun? ...Ahh! Is that like when you jump while you're holding a gun? The last time I did that, I accidentally discharged my gun and shot a hole in the ceiling!\nEdgeworth:\nThat's not what it means at all! It means to not be so hasty.\nGumshoe:\nUnderstood, sir! Well then, Mr. Edgeworth! We have permission to examine the body now, so let's see what secrets Kay's pea-in-a-pod holds!\nEdgeworth:\n(Someone's pod is missing a few peas...!) Please Detective... There's no need to jump the gun...\n\n\n\n\nThe victim (after examining notebook)\n\n\n\n\n\n\n\nGumshoe:\nThe victim had Kay's notebook on her.\nEdgeworth:\nYes. And because of that, she was mistakenly identified as \"Kay\".\nGumshoe:\nThey shouldn't have botched it up so badly! It's unforgivable! I'll arrest them all!\nEdgeworth:\n...Before you arrest anyone for faulty logic, perhaps we should focus on finding the murderer?\nGumshoe:\nUmm, yeah. I'll be helping with that too, sir!\nEdgeworth:\n(If botching things up were a crime, he'd be serving a life sentence...) ...In any case, there may still be something we have overlooked. Let's carefully examine the body one more time.\n\n\n\n\nKay and the case (after examining notebook)\n\n\n\n\n\n\n\nGumshoe:\nHow do you think Kay ended up losing her memories?\nEdgeworth:\nGood question. Unfortunately, it will be difficult to answer at this point in time. However, the victim was in possession of the \"Promise Notebook\"... ...so it's possible that Kay is connected to this case in some form or other.\nGumshoe:\nIf her memory returned, there could be a huge breakthrough in the investigation!\nEdgeworth:\n(I don't imagine it will be quite that easy, though...)\nGumshoe:\nMr. Edgeworth! I've got a plan to get Kay's memory back!\nEdgeworth:\nI'd leave that kind of thinking to the hospital staff.\nGumshoe:\nPlease sir... Just hear me out! First, we need to get a really big hammer...\nEdgeworth:\nForget it, Detective.\nKarin Jenson and Bonnie Young\n\n\n\n\n\n\n\nKarin:\n\"You sonnies want something?\" ...Is what she says.\n\n\n\nDr. Young\n\n\n\n\n\n\n\nEdgeworth:\nMs. Jenson. Could you tell me about your relationship with Dr. Young?\nKarin:\nYes... Ever since I was little, I've always been together with Granny. Whenever I got lost, she would search for me until it got dark. And whenever I fell down, she would watch over me until I could get up on my own.\nEdgeworth:\n(What a charming story. She sounds like quite the grandmother's child.)\nKarin:\nAnd after I became a nurse, whenever I'm about to make a mistake with my injections... \"Not there, THERE!\" she'd say, as she'd grab the needle and... Ouch!\nGumshoe:\nOuch! Just hearing it hurts, pal! Please keep those stories to yourself!\nKarin:\nAnyways, as long as I have Granny by my side, there's no nursing I can't do.\nEdgeworth:\nI... I see. I fully understand. Thank you for your cooperation. (Regardless of her charming story, they do seem to share a very close-knit bond.)\n\n\n\n\nThe autopsy\n\n\n\n\n\n\n\nGumshoe:\nDr. Young, you sure are a masterful coroner, pal! You work with such blinding speed and you make no wasted movements!\nKarin:\n\"Whaddaya sonnies know about autopsies!? You don't know the first thing about my work!\"\nGumshoe:\nU-Ughhhhh...\nEdgeworth:\nAllow me to apologize for his rudeness. I'll be sure to reprimand him later.\nKarin:\n\"Hmph. Listen up, young'un. It is my duty to perform the autopsy quickly and accurately. That's why I have no patience with those who get in the way of my work.\" ...Is what she says. Are you satisfied?\nEdgeworth:\nYes, very much so. We only wish to investigate. We have no desire to get in your way. (It looks like Dr. Young's stubbornness comes from her devotion to her work.)\n\n\n\n\nDye-Young Hospital\n\n\n\n\n\n\n\nKarin:\nThe Dye-Young Hospital is a splendid hospital, and Granny is in charge of it. Well? How about it? Would you like to be admitted and experience it for yourself? \"That's right. Right now, there's an opening in our hospital suite with the outdoor spa.\"\nEdgeworth:\nWe are in good health. There is obviously no need for us to be hospitalized.\nGumshoe:\nThat's right! We're perfectly healthy, pal! That's our sole redeeming feature!\nEdgeworth:\n(Just what does he mean by that?)\nKarin:\nWell, you see, the Dye-Young Hospital also accepts healthy patients! We're currently in the middle of our \"Full of Life! Healthy Hospital Stays\" campaign. Those without injury or illness can stay at our hospital for half the price!\nEdgeworth:\n(Why would you need to stay at a hospital if you're healthy?)\nKarin:\nThis is the chance of a lifetime, so what do you say? Hospital stay! Hospital say!\nGumshoe:\nHmm. You know, an outdoor spa at half-price does sound like a good deal...\nEdgeworth:\n(Don't fall for it!)\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nProsecutor's Badge\n\n\n\n\n\n\n\nKarin:\nA Prosecutor's Badge? I've seen lots of those... Ouch! \"A prosecutor who's about to get canned shouldn't be showing off his lingering attachments. If that badge means so much to you, maybe you should've lived a better life.\"\nEdgeworth:\n...What is truly important to me is not the badge itself.\nKarin:\nErm, I'm sure what my Granny meant to say was... There are times when you have to obey those above you... Or something like that.\nEdgeworth:\n...Thanks for the advice.\n\n\n\n\nYatagarasu's Badge or Kay's Memories\n\n\n\n\n\n\n\nKarin:\nI'm really glad we found Kay's father.\nEdgeworth:\nUm, I am an acquaintance of hers. ...I'm not her father!\nKarin:\nWhaaat!? Then, what about that business card?\nEdgeworth:\n...I doubt there are many children who carry around their parents' business cards.\nKarin:\nBut, I carry one around. Granny's, I mean. So, surely... Ouch! \"I don't give a hoot how you're related! You took her in, so you'd better take good care of her!\"\nEdgeworth:\nOf course, that was my intention. Kay is in good hands.\n\n\n\n\nCandelabra\n\n\n\n\n\n\n\nKarin:\nThe victim was stabbed in the chest with that. See, there are three stab wounds in her chest, right?\nEdgeworth:\nCould you tell me the cause of the wound on her head?\nKarin:\nSorry. We don't really know that. Although we are certain that it happened post-mortem.\nEdgeworth:\n(Which means it may have occurred when the culprit moved the body? It would be nice if some evidence were to turn up...)\n\n\n\n\nAnything else\n\n\n\n\n\n\n\nKarin:\n\"That's tied up pretty well, that frilly thing of yours...\"\nEdgeworth:\nI would like you to look at this piece of evidence, rather than my clothes.\nKarin:\n\"Not interested!\" ...she says. I can't say I'm very interested either.\nEdgeworth:\n(Hmm. Perhaps I should try presenting a different piece of evidence?)\nBody\n\n\n\n\n\n\n\nGumshoe:\nThis body...! It's not Kay, sir! It doesn't look like her at all!\nEdgeworth:\n(...Of course it isn't. Kay is alive, after all.) Her age is... I'd guess around 30. And she's wearing a pantsuit.\nGumshoe:\nMaybe she worked in one of the offices in this building.\nEdgeworth:\nSo, her identity is still unknown. The question now becomes: why did the police believe her name was \"Kay\"...?\n\n\n\nBefore examining head, jacket, wounds, right hand, notebook, and candelabraand deducing purple flower\n\n\n\n\n\n\n\nEdgeworth:\n(I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\n\nAfter examining head, jacket, wounds, right hand, notebook, and candelabraand deducing purple flower\n\n\n\n\n\n\n\nEdgeworth:\n(I already checked this area earlier, but it never hurts to take another look.)\n\n\n\n\nHead\n\n\n\n\n\n\n\nEdgeworth:\nThere is some blood on her head.\nGumshoe:\nMaybe she was hit with something.\nEdgeworth:\nWe don't know that for sure. Our investigation will ultimately clear that up.\n\n\n\n\nJacket\n\n\n\n\n\n\n\nEdgeworth:\nThe left side of her white jacker has been stained a deep red. This jacket... The buttons are on the right side.\nGumshoe:\nIsn't that normal, sir? All of my cloths have the buttons on the right side.\nEdgeworth:\nFor women, it is normal to have them on the left side.\nGumshoe:\nMr. Edgeworth, you really do know everything.\nEdgeworth:\nThat's just common knowledge. Hmm... There doesn't seem to be anything out of place... Hm? There's something white in her pocket...\nGumshoe:\nThey're gloves. Pure white ones. One for each hand, sir.\nEdgeworth:\n...They don't seem to be dirty. Could they be the victim's?\n\n\n\n\nPurple flower\n\n\n\n\n\n\n\nEdgeworth:\nSomething seems to be pinned to her pocket. ...Hm. It's made out of purple cloth.\nGumshoe:\nIt looks like it's been forcibly torn off, doesn't it?\n\n\n\n\nStab wound\n\n\n\n\n\n\n\nEdgeworth:\nThere doesn't seem to be... anything in this pocket.\nGumshoe:\nThis pocket has holes in it, sir!\nEdgeworth:\nJudging by how the cloth was pierced... ...she must have been stabbed by some sharp object.\nGumshoe:\nAll your coins would fall out of those holes, sir...\nEdgeworth:\n...Detective. Haven't you ever heard of a wallet?\nGumshoe:\nOf course I have, sir! I just use my pockets though. Most people do, right?\nEdgeworth:\n.....Never mind.\n\n\n\n\nRight hand\n\n\n\n\n\n\n\nEdgeworth:\nThere is a burn mark on her hand...\nGumshoe:\nIs it conntected to the cause of death?\nEdgeworth:\nNo, it appears to be an old scar. She probably got it a long time ago. Hm. It seems there is something in her hand. Detective, could you open her hand for me?\nGumshoe:\nYessir! Understood! This is... Oh, I know! This must be a gift card from a department sto- ...Yeeaaargh!\nFranziska:\nIt seems to be a keycard.\nGumshoe:\nUuugh... Wh-Why...\nEdgeworth:\nThe question is, what was this keycard (Keycard - The victim was carrying a keycard. What could it have been used for?) for?\n\n\n\n\nNotebook\n\n\n\n\n\n\n\nEdgeworth:\n! This notebook...!\nGumshoe:\nHuh!? Isn't that Kay's Promise Notebook!? This is the notebook she wrote all her promises to her father in! It really takes me back, sir.\nEdgeworth:\nYes... (When Kay was young, she and her father wrote the promises they made in this notebook...) However... Why is it in a place like this...?\nGumshoe:\nAh! Now that you mention it... I once heard something from Detective Badd a long time ago. It seems that before anyone had noticed, Kay's \"memento\" had gone missing!\nEdgeworth:\nWhat...!? So a piece of evidence that was in police custody went missing?\nGumshoe:\nDetective Badd frantically searched all over for it, but it seems he never found it...\nEdgeworth:\n(What could this mean...? Why was the missing notebook found here?) You there, do you happen to know anything about this notebook?\nOfficer:\nThe victim was carrying this notebook when we found her. That was the only evidence we had to identify the body.\nEdgeworth:\nSo that's why you called her \"Kay\"...\nGumshoe:\nWhat a misleading victim, huh. Why did she have Kay's notebook...?\nEdgeworth:\n(I sure would like to have some information on the victim's identity, though...)\n\n\n\n\nCandelabra\n\n\n\n\n\n\n\nGumshoe:\n...Could this be the murder weapon, sir?\nEdgeworth:\nA three-pronged candelabra. It's consistent with the number of stab wounds. She was probably stabbed by the prongs of the candelabra.\nGumshoe:\n.....A candy zebra?\nEdgeworth:\n...I'm afraid it's not quite what you're imagining, Detective. A candelabra... is a candlestick holder with multiple arms.\nGumshoe:\nAhh, so it's a candle holder. You know, one time I forgot to pay my electric bill, and I had to get by only with candles.\nEdgeworth:\nWh-What time period are you from...?\nCandelabra data jotted down in my Organizer.\n\n\n\n\nDeduce (after examining purple flower)\n\n\n\n\n\n\n\nEdgeworth:\n(Is this spot somehow connected to any of the evidence I hold...?)\n\n\n\nDeduce purple flower and present Purple Flower\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"The purple flower Kay had with her...\"\n\n\n\n\nOtherwise\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nDetective Gumshoe. Look at this piece of evidence.\nGumshoe:\nIs there something wrong with that piece of evidence, sir?\nEdgeworth:\nDoesn't this piece of evidence have a connection with the situation of the crime scene?\nGumshoe:\nI don't think it's connected at all, sir...\nEdgeworth:\nArgh! (So I was wrong...)\nGumshoe:\nYou should look at the evidence you have on hand again, sir!\nEdgeworth:\nIndeed. There might be something that is connected to the crime scene.\n\n\nEdgeworth:\nThe purple flower Kay had with her... I wonder if that originally belonged to the victim.\nGumshoe:\nNow that you mention it... The cloth does look the same as the one on the pin!\nEdgeworth:\nYes. Let's compare them without delay.\nGumshoe:\nIt's a perfect match, sir! Way to go, Mr. Edgeworth!\nPurple Flower data updated in my Organizer.\nEdgeworth:\n(The fact that this flower belongs to the victim means...)\nFranziska:\nThat can only mean that Kay Faraday came in contact with the victim. And about that corsage, it looks like it was forcibly ripped off. There is a possibility that Kay Faraday is connected to this case. And depending on the situation... ...we may have to consider her as a suspect.\nGumshoe:\nWhat did you saaaaaaaay!? There's no way she did it! It's unthinkable! Kay could never do that, sir!\nEdgeworth:\n(However, it's true we have no evidence to deny that claim.)\nKay:\n.........\nFranziska:\nIt's nothing more than a possibility at the moment. Isn't that right, Miles Edgeworth?\nEdgeworth:\n...Indeed. For better or for worse.\nOfficer\n\n\n\n\n\n\n\nEdgeworth:\nIs the investigation going well?\nOfficer:\nSir! I am actually putting my job aside to do some brain training! By focusing on images instead of words, you can stimulate your right brain!\nEdgeworth:\n...Please stop talking.\nFranziska von Karma\n\n\n\n\n\n\n\nFranziska:\nYes, what is it?\n\n\n\nNotice anything?\n\n\n\n\n\n\n\nFranziska:\nA murder case at the P.I.C. meeting room... Since you asked to cooperate in the investigation, I do hope you will be able to produce results.\nEdgeworth:\nNaturally. Why do you think I am here?\nFranziska:\nWell... Now that you mention it... Why are you here, exactly?\nEdgeworth:\n(! ...That's right. She still doesn't know about my P.I.C. hearing today.)\nGumshoe:\nThe circumstances behind it are deeper than the sea, sir! Allow me to explain it on Mr. Edgeworth's behalf... YEOWCH!\nFranziska:\nMiles Edgeworth! I do not care about your \"circumstances\". All that matters now is reaching the truth of this case. Am I wrong?\nEdgeworth:\nIndeed. There is some truth in what you say.\nGumshoe:\nIf you ask me, I don't think that is totally righ- YEOWCH!\nFranziska:\nI'll say this. ...Whipping someone is easier than being worried!\nGumshoe:\nBut being on the receiving end of the whip isn't easy at al- YEOWCH!\n\n\n\n\nFranziska von Karma\n\n\n\n\n\n\n\nEdgeworth:\nFranziska. Why are you here when you are supposed to be working with Interpol?\nFranziska:\nCurious, are you? But, it's confidential. I have no obligation to tell you.\nEdgeworth:\n(Hmm. Her response was as I expected.)\nFranziska:\nMore importantly, shouldn't there be a prosecutor in charge of this murder case? I don't know who it is, but I was hoping it wouldn't be someone completely useless. They're not even here yet... They're late! Just what is that fool doing!?\nGumshoe:\nYEAARGH! I have nothing to do with it, sir!\nEdgeworth:\nI wouldn't think it's very commendable to just whip people at random...\nFranziska:\nI swing, therefore I whip! That is my philosophy. I will whip anyone who slacks off in their work!\nEdgeworth:\n(To the yet unseen prosecutor in charge, I hereby offer you my sympathies in advance...)\n\n\n\n\nRelation to Dr. Young\n\n\n\n\n\n\n\nEdgeworth:\nJudging from your exchange just now, I take it you've met Dr. Young before?\nFranziska:\nHow astute, Miles Edgeworth. That's right. She is an acquaintance of mine. Back then... it's a long story.\nEdgeworth:\n(It seems she doesn't intend to tell me any more. Shall I leave it at that, then?)\nGumshoe:\nSo, what happened back then!? Please tell me all about it, sir! YEOOOWW!\nFranziska:\nA foolish fool, shamelessly prying into other people's business. Watch what you say, Scruffy!\nGumshoe:\nHow cruel! Whipping me out of the blue! With great whip comes great responsibility, sir!\nFranziska:\nOne good whip deserves another! The scruffy fool gets the whip! Try harder, worthless whipbait!\nGumshoe:\nYEAAAAAARRGHH!\nEdgeworth:\n(...Hmm. It appears I was right to leave it at that.)\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nProsecutor's Badge\n\n\n\n\n\n\n\nEdgeworth:\nFranziska, I would like you to take a look at this.\nFranziska:\n...I'll ask, just in case. What is that?\nEdgeworth:\nIt's my Prosecutor's Badge.\nFranziska:\n...And?\nEdgeworth:\nHmph. That is all. Nnghoooh!\nFranziska:\nYou should be relieved. You felt pain, right?\nEdgeworth:\nHm...? What do you mean by that?\nFranziska:\nFools can't catch colds. So, I thought they wouldn't be able to feel pain either.\n\n\n\n\nKay's Memories\n\n\n\n\n\n\n\nFranziska:\nKay Faraday lost her memories? How dare you let that happen to her on your watch!?\nEdgeworth:\n...Hrm. (I have no defense...)\nKay:\nE-Erm...! It's not Mr. Edgeworth's fault...!\nFranziska:\n! You, are you alright? Being bandaged up like that...!\nKay:\nAh... Yes. Thank you for worrying about me.\nFranziska:\n......H-Her behavior is certainly strange. It's unusual to hear her give thanks like that. Miles Edgeworth! Hurry up and get her memories back!\nEdgeworth:\n(Why don't you just admit that you're worried about her?)\n\n\n\n\nCandelabra\n\n\n\n\n\n\n\nFranziska:\nThere's no doubt, this candelabra was the murder weapon. ...It pains me to see a woman end up like this!\nEdgeworth:\nLet us find the true culprit, so that she may rest in peace.\nFranziska:\nThe true culprit... I hope the truth doesn't turn out to be a cruel one.\n\n\n\n\nAnything else\n\n\n\n\n\n\n\nFranziska:\nMiles Edgeworth! Unlike you, I am actually busy. I don't have the time to look at something like that. Why don't you just look at that evidence again by yourself?\nEdgeworth:\n(She is certainly... as harsh as ever.)\nExamine evidence\n\n\n\n\n\n\n\n\n\nProngs on Candelabra\n\n\n\n\n\n\n\nEdgeworth:\nThe prongs of the candelabra are covered in blood. And the shape even matches up with the victim's wounds... Is this the murder weapon of this case?\n\n\n\n\nBottom side of Candelabra\n\n\n\n\n\n\n\nEdgeworth:\nThis is a rare shape for a pedestal. If the spot where it was put on still has this mark... ...then it will become apparent whether or not it had been placed there.\n(Connecting all possible Logic, examining head, jacket, wounds, notebook, and candelabra, and deducing purple flower leads to:)\nInvestigation Complete\nEdgeworth:\nSo, the victim's identity remains unknown...\nKay:\nUmm... Should you really still be calling \"Kay\"?\nGumshoe:\nOf course! What are you saying, pal!?\nKay:\nTh-Thank you. But then, what about that woman...?\nFranziska:\nShe is someone who you may have killed. That's all we know.\nGumshoe:\nThere's no way that's true! Right, Mr. Edgeworth!?\nEdgeworth:\nI... also do not believe you killed her.\nFranziska:\nYou are such a naïve man, Miles Edgeworth.\n???:\n♬ Here I come to save the dayyy!\nEdgeworth:\n(Hmm, that voice...)\nDebeste:\n♬ So don't be afraid anymooore! For The Best Prosecutor is here todayyy! ♪\nCourtney:\nPardon the interruption.\nDebeste:\nMr. Edgeworth! Get away from the victim! I have inherited her dying wish! No one asked for YOU!\nEdgeworth:\nHmm. Did you know the victim?\nCourtney:\nJust as I thought... The Goddess of Law will surely reveal the truth to us. So please, rest in peace.\nDebeste:\nThat's right, Justine! Now that I'm here, everything will be A-OK. The culprit will rue the day he crossed paths with MYARGH!\nFranziska:\nMiles Edgeworth! Who is this fool of a man!?\nEdgeworth:\n(Wh-Why is she glaring at me!?)\nCourtney:\nYou are Franziska von Karma, am I correct? I apologize for my late introduction. I am Justine Courtney. And the deceased individual is...\nDebeste:\n...Attorney Jill Crane, one of the members of the Prosecutorial Investigation Committee!\nEdgeworth:\n(I see. So that's why she had the keycard...) I take it you're in charge of this case?\nDebeste:\nThat's right! And with me in charge, this case is as good as solv- YEOOOWW!\nFranziska:\nThat reminds me... I haven't caught your name yet.\nDebeste:\nIf you just wanted to know my name, you didn't have to whi- YEAAAARGH!\nFranziska:\nJust state your name. I will not tolerate any unnecessary remarks.\nDebeste:\nUuugh... Sebastian Debeste.\nEdgeworth:\n(It seems the pecking order has been decided.)\nKarin:\nMr. Sebastian Debeste? Here, this is from Granny.\nDebeste:\nThis is... the autopsy report! Wah hah hah... It seems you've been bested, Mr. Edgeworth!\nEdgeworth:\n(This wasn't a competition to begin with...)\nKarin:\n\"My job is done. May we meet again in front of another corpse.\" OK, let's go home quickly, and eat some noodles! I'll be leaving too! Take care everyone!\nDebeste:\n...The victim's head wound was postmortem.\nCourtney:\nSebastian.\nDebeste:\nAnd the candelabra dealt the fatal blow. Estimated time of death is late last night... Wh-What is it, Justine?\nCourtney:\nWhile I do appreciate your enthusiasm, perhaps you should give your tongue a rest. You might pull a muscle.\nEdgeworth:\n(That would be painful indeed...)\nAutopsy Report jotted down in my Organizer.\nDebeste:\nAnyways, it's quite clear now! Kay Faraday must be arrested!\nGumshoe:\nWhaaaaaaat! What's the big idea, pal!?\nCourtney:\nIt's just as he says, Detective. The culprit is Ms. Kay Faraday. The young lady in bandages over there... Although she's not wearing her usual attire... Are you not Ms. Kay Faraday?\nEdgeworth:\n..... And what would you do if she is Kay? If you're going to arrest her... ...then I will resist by any means necessary. ...That, I guarantee you.\nCourtney:\nI am now convinced. The doubts surrounding your suitability as a prosecutor were indeed warranted.\nKay:\nIt's fine, Mr. Edgeworth. You can go. Don't worry about me... I'll be fine.\nGumshoe:\nWhat are you saying, Kay!? You can't just go along with them, pal!\nKay:\nBut, I... I don't remember anything. What if I really did kill that woman and then forgot about it? If that's true...\nCourtney:\nAcknowledgement is the Goddess' mercy. Atonement is her will. The Goddess of Law will surely praise you for your prudence!\nEdgeworth:\nSebastian. And Judge Courtney... If you believe she is the culprit, on what basis do you make your accusations? Unless I'm completely convinced by your explanation... I will not obey your orders!\nDebeste:\nFine, have it your way! Now, sit tight and listen to the perfect reasoning of Debeste!\n-- Why We Suspect Kay? --\nDebeste:\nI am the best in the world. No one else can do what I do.\nYes! That's why I was the first to realize that Kay Faraday is the culprit!\nShe broke into the meeting room in order to steal something.\nIn other words, she's the only one who could have killed Ms. Crane!\nGumshoe:\nHis logic's as awful as ever, sir.\nEdgeworth:\n(Harsh words... coming from you, Detective.) I asked for some basis to your claims, yet your reasoning has told me absolutely nothing...\nFranziska:\n...However, we have no evidence to prove she didn't do it either.\nKay:\n........\nGumshoe:\nDon't worry, Kay. I'm sure Mr. Edgeworth will pull off a miracle.\nEdgeworth:\n(Y-You think my deductions are some kind of miracle work...!?)\nFranziska:\nYou'd better not disappoint me. Understand, Miles Edgeworth? Because if you do... this whip of mine won't stay silent.\n\nEdgeworth: Edgeworth: Already... I've noticed two contradictions in your testimony. Debeste: My reasoning is flawless. It doesn't contain even a single contradiction. Edgeworth: Hm. The number of contradictions has just increased to three. Debeste: Oh, I get it! This is all a part of your plan to mislead me, isn't it? Well, too bad! Because \"The Best\" will not be lead astray!\nEdgeworth: Edgeworth: If you believe Kay is the culprit, then I would like to hear the basis for your reasoning. Debeste: Wah hah hah... Just sit back and be in awe of my brilliant deductions! Nothing escapes the watchful eye of \"The Best\"! Before I had even laid eyes on the crime scene... No, before I was even aware of this case... Yes! I knew that she was the culprit! YEEOOOOOWW! Franziska: ...Basis of your reasoning. Debeste: Yeeees, ma'am! E-Ermm, well...\nEdgeworth: Edgeworth: To steal something...? Steal what, exactly? Debeste: That's... Umm... Courtney: What Kay Faraday tried to steal... was a file. Its contents, to be exact... An investigation report regarding Prosecutor Edgeworth. Franziska: Do you have any evidence to prove she needed something like that? Courtney: Courtney: I am not the one who needs to present evidence. Isn't that right, Prosecutor Edgeworth? Edgeworth: Um... Yes... I... suppose that may be true. Franziska: Wha...! Edgeworth: At any rate, Sebastian, please continue your reasoning.\nEdgeworth: Edgeworth: Do you have any evidence to prove that no one else but Kay could have committed the crime? Debeste: Nope! Edgeworth: .....Sebastian. Let me tell you what would be the best thing for you to do. Look into any other possible suspects besides Kay. Right now. Posthaste. Debeste: \"The Best\" thing for me to do... Look into any other possible suspects...! Courtney: Courtney: According to the preliminary reports... there were no traces of anyone else besides her. Edgeworth: Even so, isn't it too premature to declare that she is the culprit? Courtney: Declaring that she isn't so early into the investigation is a little premature as well, is it not? Edgeworth: (...! If only I had evidence that could prove Kay's innocence...!)\nEdgeworth: Good grief... There is a limit to how much you can falsely accuse someone.\nKay: It's fine, Mr. Edgeworth... You don't have to...\nEdgeworth: Fear not, Kay. The truth will be revealted soon enough.\nKay: Mr. Edgeworth...\nEdgeworth: (Kay couldn't have murdered Ms. Crane... If I can just prove that, she will be cleared of suspicion.)",
      "testimonies": [
        {
          "testimony": "I am the best in the world. No one else can do what I do.",
          "person": "Debeste",
          "present": []
        },
        {
          "testimony": "Yes! That's why I was the first to realize that Kay Faraday is the culprit!",
          "person": "Debeste",
          "present": []
        },
        {
          "testimony": "She broke into the meeting room in order to steal something.",
          "person": "Debeste",
          "present": [
            "Keycard"
          ],
          "source": {
            "evidence_span": "A keycard that grants entry to the Committee chamber.",
            "testimony_span": "She broke into the meeting room",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "In other words, she's the only one who could have killed Ms. Crane!",
          "person": "Debeste",
          "present": []
        }
      ],
      "summarizedContext": "Prosecutor Debeste is accusing Kay Faraday of killing the victim Ms. Crane.",
      "noPresent": false,
      "labels": [
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims Kay broke into the meeting room.",
        "Fact 2: The evidence suggests only one with a keycard can enter the meeting room.",
        "Prop 1: If a room requires a keycard for entry, it cannot be broken into."
      ]
    },
    {
      "category": "rebuttal",
      "newContext": "-- Why We Suspect Kay? --\nDebeste:\nI am the best in the world. No one else can do what I do.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nAlready... I've noticed two contradictions in your testimony.\nDebeste:\nMy reasoning is flawless. It doesn't contain even a single contradiction.\nEdgeworth:\nHm. The number of contradictions has just increased to three.\nDebeste:\nOh, I get it! This is all a part of your plan to mislead me, isn't it? Well, too bad! Because \"The Best\" will not be lead astray!\nDebeste:\nYes! That's why I was the first to realize that Kay Faraday is the culprit!\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nIf you believe Kay is the culprit, then I would like to hear the basis for your reasoning.\nDebeste:\nWah hah hah... Just sit back and be in awe of my brilliant deductions! Nothing escapes the watchful eye of \"The Best\"! Before I had even laid eyes on the crime scene... No, before I was even aware of this case... Yes! I knew that she was the culprit! YEEOOOOOWW!\nFranziska:\n...Basis of your reasoning.\nDebeste:\nYeeees, ma'am! E-Ermm, well...\nDebeste:\nShe broke into the meeting room in order to steal something.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nTo steal something...? Steal what, exactly?\nDebeste:\nThat's... Umm...\nCourtney:\nWhat Kay Faraday tried to steal... was a file. Its contents, to be exact... An investigation report regarding Prosecutor Edgeworth.\nFranziska:\nDo you have any evidence to prove she needed something like that?\nCourtney:\n\nCourtney:\nI am not the one who needs to present evidence. Isn't that right, Prosecutor Edgeworth?\nEdgeworth:\nUm... Yes... I... suppose that may be true.\nFranziska:\nWha...!\nEdgeworth:\nAt any rate, Sebastian, please continue your reasoning.\nPresent Keycard\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"It certainly sounds like... you are quite familiar with this room.\"\nDebeste:\nIn other words, she's the only one who could have killed Ms. Crane!\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nDo you have any evidence to prove that no one else but Kay could have committed the crime?\nDebeste:\nNope!\nEdgeworth:\n.....Sebastian. Let me tell you what would be the best thing for you to do. Look into any other possible suspects besides Kay. Right now. Posthaste.\nDebeste:\n\"The Best\" thing for me to do... Look into any other possible suspects...!\nCourtney:\n\nCourtney:\nAccording to the preliminary reports... there were no traces of anyone else besides her.\nEdgeworth:\nEven so, isn't it too premature to declare that she is the culprit?\nCourtney:\nDeclaring that she isn't so early into the investigation is a little premature as well, is it not?\nEdgeworth:\n(...! If only I had evidence that could prove Kay's innocence...!)\nEdgeworth:\nGood grief... There is a limit to how much you can falsely accuse someone.\nKay:\nIt's fine, Mr. Edgeworth... You don't have to...\nEdgeworth:\nFear not, Kay. The truth will be revealted soon enough.\nKay:\nMr. Edgeworth...\nEdgeworth:\n(Kay couldn't have murdered Ms. Crane... If I can just prove that, she will be cleared of suspicion.)\nEdgeworth:\nIt certainly sounds like... you are quite familiar with this room.\nDebeste:\nThe Best man for the job should know all about The Best places.\nEdgeworth:\nUnfortunately, it seems that you are not The Best man for the job.\nDebeste:\nAre you mocking me!?\nEdgeworth:\nThat's for you to decide. You didn't even know about this keycard, did you?\nDebeste:\nOf course I know about that! You need it to enter this room... ......... Huh? Was it really needed?\nFranziska:\nThis foolish fool simply doesn't know when to give up!\nDebeste:\nYEEEOOOOOOWCH!\nEdgeworth:\nSebastian, do you really suspect Kay?\nDebeste:\nTh-That's right! She's the only one who could have done it!\nEdgeworth:\nWell then, allow me to ask you... Since this room can only be entered by using a keycard... ...hoe did she enter the room without one!?\nDebeste:\nGah...! W-Well, she probably used this and that, and... Nngh!\nEdgeworth:\nOh? Did you pull a muscle? Allow me to explain then. The door could only be opened by members of the P.I.C. Which means...\nCourtney:\nYes. That's correct.\nEdgeworth:\nHm? (She... conceded so easily...?)\nCourtney:\nTake a look at this. It's a record of this room that I investigated just a while ago. At 12:52 AM, the door was opened using Ms. Crane's keycard.\nKeycard Record jotted down in my Organizer.\nCourtney:\nIt's probable... ...that the killer entered the room together with the victim, Ms. Crane. After entering, the situation must have sourced, leading to the murder.\nEdgeworth:\nYour logic holds... but it is still merely conjecture. And it would imply that the killer and the victim were acquainted.\nGumshoe:\nNo way, pal! Kay doesn't even know the victim!\nCourtney:\nCourtney:\nThat is merely an assumption on your part... Unless you have any evidence to prove your claim? Evidence is everything, in court and at the crime scene. Without it, your argument is invalid.\nFranziska:\nIn that case... I trust that you have evidence... ...to prove that Kay Faraday and the victim were connected.\nCourtney:\n...Of course.\nEdgeworth:\nWh... What!?\nCourtney:\nThis letter... ...was discovered by Dr. Young in Ms. Crane's breast pocket.\nEdgeworth:\n(...The victim's belongings? Why did she withhold such vital evidence until now? Could it be... she was waiting for the perfect time to reveal it? Come to think of it...!)\nDebeste:\nAnd the candelabra dealt the fatal blow. Estimated time of death is late last night... Wh-What is it, Justine?\nCourtney:\nWhile I do appreciate your enthusiasm, perhaps you should give your tongue a rest. You might pull a muscle.\nCourtney:\nHmhm... I'll read it for you. \"To Ms. Crane, Thank you so much for helping with my plan! I'm glad that we can help each other get what we want. It's like killing two birds with one stone! Please get revenge for 12 years ago!\" - Kay\" In other words, Kay Faraday and Ms. Crane were accomplices. They probably planned to steal something from this room.\nEdgeworth:\nP-Preposterous!\nFranziska:\nW-Wait! That means, the main culprit is...\nCourtney:\nIt's still Kay Faraday, of course. It just means her crimes have increased by yet one more.\nVictim's Letter jotted down in my Organizer.\nKay:\nI'm... the main culprit...?\nGumshoe:\nDon't believe her, Kay! It's all a bunch of nonsense! There's no way Kay would do something like that!\nCourtney:\nNonsense? Not at all. The evidence speaks for itself, wouldn't you agree?\nEdgeworth:\nNgh...! (I knew that they wouldn't suspect Kay unless they had some sort of proof, but... ...to think they would actually have such decisive evidence!)\nDebeste:\nNicely done, Justine!\nCourtney:\nThank you very much.\nEdgeworth:\nEdgeworth:\nYour explanation is still insufficient! I cannot accept such an argument!\nCourtney:\nSebastian. Would you please leave this to me?\nDebeste:\nAlright, make sure you shut Mr. Edgeworth up once and for all!\nEdgeworth:\n(I can't allow their allegations to gain any more momentum. I must turn it around here!)\n-- The Letter from Kay --\nCourtney:\nThe relationship between Kay Faraday and Ms. Crane is as documented in the letter.\nShe roped Ms. Crane into assisting her with her plan.\nHowever, for some reason, their partnership broke down.\nMs. Crane was murdered... But with her dying breath, she managed to retaliate.\nHer parting gift is this letter, which she tucked safely away in her left breast pocket.\nGumshoe:\nH-Her testimony's even better than ever. Maybe the most perfect it's ever been, sir...! Are you gonna be alright, Mr. Edgeworth?\nEdgeworth:\nUm, yes... Of course.\nFranziska:\nHow unsightly, Miles Edgeworth. Save your stoic act for some other time.\nGumshoe:\nMs. von Karma! Just whose side are you on!?\nFranziska:\nI'm on nobody's side, Scruffy. When searching for the truth, it's best not to take sides.\nGumshoe:\nW-Watch what you say, Ms. von Karma, or else Mr. Debeste is gonna...\nDebeste:\n\"Best\" you say? Well, I can tell you that the side I'm on is always the BYAAARGH!\nFranziska:\n...How irritating.\nEdgeworth:\nWell, I suppose that's one thing we can agree on.\n\nEdgeworth: Edgeworth: And just what kind of relationship did Kay have with the victim? Courtney: In the letter, she wrote, \"Thank you so much for helping with my plan!\" Their relationship should be quite obvious. That's right...\nEdgeworth: Edgeworth: I would like to hear about Kay's alleged plan in more detail. Courtney: Just as she wrote in the letter, she wanted to steal something. Debeste: What's more, the sender of the letter is Kay Faraday. So it's obvious who the main culprit is! Edgeworth: Edgeworth: That letter could've easily been forged. It doesn't prove that she planned to steal anything. Courtney: Courtney: If memory serves me right... wasn't she a Great Thief? Edgeworth: Th-That's... She's... um, taking a break at the moment. Courtney: I doubt there is any thief who would inform a prosecutor about their upcoming crimes. Perhaps she simply returned to her trade without you knowing? Edgeworth: (I suppose I have no means of denying that possibility...) Courtney: Kay Faraday planned the theft and Ms. Crane got caught up in it.\nEdgeworth: Edgeworth: \"For some reason\" you say...? It seems your explanation isn't very clear. Courtney: I'm sure the reason will become clear upon further investigation. But more importantly... ...there is no evidence to prove that Kay Faraday did not commit this crime. Edgeworth: Edgeworth: While there is some evidence to suggest that she committed a crime... ...none of it can truly be called decisive evidence! Courtney: Courtney: What about the letter that shows their complicity, and the scene of the crime... I think it's fair to say we cannot decisively rule out the possibility that she committed the crime.\nEdgeworth: Edgeworth: Do you have any evidence to prove that Kay was the murderer? Debeste: Haven't you been listening! We've been saying that this letter is the evidence! Edgeworth: Oh? And where in the letter does it say that she planned to murder the victim? Debeste: ...Huh? E-Erm, well, that's... I've got it! It's a hidden message written in invisible ink that can only be read by heating it up! Courtney: Sebastian. I wouldn't get your hopes up for something like that. There is, of course, evidence that points to her as the criminal.\nEdgeworth: Edgeworth: We searched the victim's left breast pocket as well, but... Courtney: You found nothing, I presume? Debeste: Naturally, the officer who found the letter immediately brought it to the Best man on the scene. Courtney: The letter was safely tucked away in her left breast pocket, right above her heart... I believe this letter carries Ms. Crane's will for the criminal to be arrested. Edgeworth: I have no interest in your beliefs. What I'm interested in is the truth. You said that the letter was in the left breast pocket of the victim, correct? Courtney: I swear by the Goddess of Law, there are no lies or mistakes in my statement. The letter was indeed discovered inside the victim's left breast pocket. Edgeworth: (The victim had been stabbed in the left chest area where the letter was hidden... This may very well be an important clue.)\nEdgeworth: (I don't think that Kay wrote the letter... ...but unless I can draw out more information here, that thought means nothing. I should start by pressing her for more details.)",
      "testimonies": [
        {
          "testimony": "The relationship between Kay Faraday and Ms. Crane is as documented in the letter.",
          "person": "Courtney",
          "present": []
        },
        {
          "testimony": "She roped Ms. Crane into assisting her with her plan.",
          "person": "Courtney",
          "present": []
        },
        {
          "testimony": "However, for some reason, their partnership broke down.",
          "person": "Courtney",
          "present": []
        },
        {
          "testimony": "Ms. Crane was murdered... But with her dying breath, she managed to retaliate.",
          "person": "Courtney",
          "present": []
        },
        {
          "testimony": "Her parting gift is this letter, which she tucked safely away in her left breast pocket.",
          "person": "Courtney",
          "present": [
            "Autopsy Report"
          ],
          "source": {
            "evidence_span": "Cause of death: Stab wounds to left chest.",
            "testimony_span": "which she tucked safely away in her left breast pocket",
            "is_self_contained": "yes",
            "context_span": ""
          }
        }
      ],
      "summarizedContext": "Prosecutor Courtney is describing the letter from Kay that explains her relationship with the victim Ms. Crane.",
      "noPresent": false,
      "labels": [
        "spatial",
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims the victim had a letter safely tucked away in her left breast pocket.",
        "Fact 2: The evidence suggests the victim died from stabs to the left chest.",
        "Prop 1: If someone is stabbed to the left chest, her left pocket would be stabbed too.",
        "Prop 2: If a pocket is stabbed, a letter inside cannot be safely tucked away in it."
      ]
    }
  ]
}