{
  "previousContext": "Reunion, and Turnabout\nTranscript\nPart 1\nPart 2\nPart 3\nPart 4\nThat was... no accident... I was drugged... with sleeping pills... I was murdered... by that person... That's why... I took... my revenge... It's only fair... Isn't it... ...Ini?\nMaya:\nI finally get to see you again, and...\nPhoenix:\nIt's not your fault. You didn't do it.\nMaya:\nNo, I... I did it... I killed that person.\nPhoenix:\nBut that wasn't you.\nMaya:\nIt doesn't matter. It might as well have been me.\nPhoenix:\n(I can't believe something like this happened...The events of that gloomy, rainy afternoon that started this whole mess...keep playing through my mind...)\nEpisode 2Reunion, and Turnabout\nJune 16, 3:34 PMWright & Co. Law Offices\n???:\nWhat depressing rain... Do you understand how depressed that makes me!? Do you!?\nPhoenix:\nUh, I guess...\n???:\nBut actually, more than being depressed, I'm angry. Angry at that weather girl on TV. \"I think our little rainy spell will take a break with a day of sun!\"...is what that girl said! I'd stake my life on it!\nPhoenix:\nWell, it's the weather...\n???:\nBut that's why I didn't bother to bring an umbrella today. What nerve, calling herself a weather girl! She's going to hear about my $1500 suit!\nPhoenix:\nUm... About your case... Unless you're planning on suing the weather girl...?\n???:\n... I'm sorry. I thought that before we got down to business, we could have some friendly chatter. My name is Dr. Turner Grey. I'm a surgeon.\nPhoenix:\n(Remind me never to end up under his knife...)\nGrey:\nI'm here today because of this incident.\nPhoenix:\n\"Malpractice at Grey Surgical Clinic. Fourteen In-Patients Lose Their Lives!\" ...Oh. You're... the doctor at...?\nGrey:\nIt's really quite upsetting. Did you hear me!? UPSETTING!\nPhoenix:\nYes, yes, I heard you. I agree, it's quite upsetting, Dr. Grey.\nGrey:\nThe one that screwed up was that nurse! It was her that got the medications mixed up and killed those 14 patients! And yet! Now listen good! And yet! That nurse had the nerve to go and die before admitting to her wrongdoing! She didn't even offer any sort of explanation to me! And this is the kicker! She up and has herself a grand ol' accident and crashed her car! Smash! Crunch! Instantly transforming her car into the accordion model!\nPhoenix:\n(That's right... About a year ago, all the tabloid shows were talking about it. Fourteen victims of medical malpractice and the nurse's mysterious fatal accident. There were rumors that Dr. Grey had actually caused that crash. People said it was to forever hide the person responsible for the malpractice incident.)\nGrey:\nWhy would I...? Now, I'm just going to say this once -- Why on Earth would I want to kill that nurse? She's the one who killed those 14 patients! Not me!\nPhoenix:\nI think you need to take a deep breath, doctor, and focus... More to the point, this case is over a year old. Why bring it up now...?\nGrey:\nThat's simple! Because the situation is slipping out of my grasp. This just won't do. My clinic isn't seeing nearly as many patients nowadays. Do you understand what that means!? It means they're not coming to my clinic!\nPhoenix:\n(You don't say...? If it were me, I don't think I'd want to go either.) So... what would you like me to do about it...?\nGrey:\nI want you to help me prove I'm innocent.\nPhoenix:\nUm, you do realize I'm a lawyer, not a private investigator, right?\nGrey:\nNo, this is something only you can do.\nPhoenix:\n...?\nGrey:\nMaya Fey. You know this girl, correct?\nPhoenix:\n...! (Maya! Why would he know her name...!?)\nGrey:\nI heard you were working under her for a little while.\nPhoenix:\nWell, yes... I mean... Hey, wait a second here! I worked UNDER her!?\nGrey:\nYes. Am I wrong? She told me, so I'm not quite sure if...\nPhoenix:\nWell, we worked a few trials together. But she went back to her hometown to undergo more training.\nGrey:\nAh, yes, I heard. It must be lonely for you.\nPhoenix:\nWh-What!? Wait... I'm not...!\nGrey:\nShe must be an extraordinary girl to handle such rigid training.\nPhoenix:\nHuh?\nGrey:\nI have an acquaintance who knows a lot about these mystical sorts of things. She's the one who introduced me to Ms. Fey.\nPhoenix:\n(Is Maya... really that famous...?)\nGrey:\nAnd I've already set up an appointment.\nPhoenix:\nFor what?\nGrey:\nWhat else!? A channeling! I'm going to have her call the spirit of that nurse that went and got herself killed!\nPhoenix:\nO-Oh. (Maya... I wonder what she's up to right now...)\nMaya:\nWe, the women of the Fey clan have always been spirit mediums. (Changed from [We, the women of the Fey family, have always been spirit mediums.] in the original release) It's because the power to communicate with spirits flows strongly through us.\nPhoenix:\n(That's what she told me... I guess she's learned to accept her responsibilities and become an adult...)\nGrey:\nNot counting training, this will be her first time channeling a spirit, so she gave me one condition before accepting my request.\nPhoenix:\nA condition...?\nGrey:\nThe condition is you, Mr. Wright. She said that she wouldn't do the channeling without first seeing you again.\nPhoenix:\nMe...?\nGrey:\nAnd that is why I've searched you out! You want to see her too, don't you!?\nPhoenix:\n(And so... that is how I ended up visiting Maya's hometown with the doctor...)\nJune 19, 1:25 PMKurain Village\nPhoenix:\n(So this is Kurain Village; Maya's hometown.)\n???:\n...\nPhoenix:\nW-Why, hello there.\n???:\n...\nPhoenix:\nHmm... What an odd little girl.\n???:\nHey! Wait up, Pearly!!\nPhoenix:\n(Hm? Someone else is coming this way...)\n???:\nNiiiiiiiick!\nPhoenix:\nM-Maya. How are you...? It's good to see you again.\nMaya:\nWow, I didn't think you'd really show up!\nPhoenix:\nIt's not that big a deal. You made it sound like you were soooo far away.\nMaya:\nWell, maybe I exaggerated... just a little.\nPhoenix:\nIt was only 2 hours by train. If I had known you were this close, I'd have visited more.\nMaya:\nNo! You're not allowed. I already decided, you know. Until I become an adult, I have to work hard and be strong by myself...\nPhoenix:\nOh... well... Anyway, congratulations. I'm glad to hear training is going well for you.\nMaya:\nHeh, heh...\nExamine\nPhone booth\nPhoenix:\nIt's an old-style phone booth. I can't say it fits in with this area too well. My cell phone doesn't get reception up here, so who knows. I may need it later.\nBus shelter\nPhoenix:\nAn old bus stop. It says \"Kurain Village\" on the sign post. The buses seem incredibly inconvenient since they only come 3 times a day.\nGiant rock\nPhoenix:\nA giant rock that seems to be reaching for the sky. Its origins are written on a beat-up, old sign. It looks like this giant rock is called the \"Kurain Boulder\". There's a really complex explanation written here, but long story short, it's a big stone for spirits to live in... Or something like that...\nRoad and houses further\nPhoenix:\nRustic, thatch-roofed houses where the other villagers live line the street. They're nowhere near as large or as nice as the manor in front of me. It's kind of odd that I don't see any of the other villagers walking around, though...\nFey Manor\nPhoenix:\nThe biggest, most elegant of the buildings I can see from here. This is Fey Manor; the place Maya calls home. It's easy to be overwhelmed by its presence...\nTalk\nToday's channeling\nPhoenix:\nLooks like you've finally become a full-fledged medium, taking on your first job.\nMaya:\nYeah. I didn't think it would be this soon.\nPhoenix:\nBut this case... Do you know the messy story behind it...?\nMaya:\nHa ha ha, behold the power of the Maya Intelligence Network! Let's see. Fourteen people died because of malpractice on Dr. Grey's part, right? And to pin the blame on the nurse, he killed her in what appeared to be a car accident!\nPhoenix:\nHuh? Um, so what is this \"Maya Intelligence Network\" anyway...?\nMaya:\nThe tabloids.\nPhoenix:\nThat's what I thought.\nMaya:\n... Ha ha ha. I'm just pulling your leg, Nick! What really happened is the exact opposite. I heard all about it from Dr. Grey.\nPhoenix:\n...\nMaya:\nOh, come on, Nick! I wouldn't take a crazed killer as a client! That's too scary, even for me.\nPhoenix:\n(Y-Yeah, I guess so.)\nKurain Village\nPhoenix:\nSo this is your hometown, huh, Maya?\nMaya:\nYup! Kurain Village... But I've heard people call this place \"Medium Valley\", too.\nPhoenix:\nInteresting... So everyone that lives here is a spirit medium?\nMaya:\nPretty much. Most of my ancestors were too, I think...\nPhoenix:\n(That's probably true since the Fey ability to communicate with the dead is so strong...)\nMaya:\nActually, only the women of this village are mediums.\nPhoenix:\nSo what do the men do?\nMaya:\nThey usually work someplace outside the village.\nThe girl earlier\nPhoenix:\nOh yeah, I wanted to ask you about that girl I saw earlier. Do you know her?\nMaya:\nOh, you mean Pearly?\nPhoenix:\nPearly?\nMaya:\nPearl Fey. She's my cousin. Isn't she adorable? Just like yours truly!\nPhoenix:\nCousin... Wait, then that means... Is she also a...?\nMaya:\nYup. She's a medium, too. Pearly's a real genius when it comes to channeling!\nPhoenix:\nHmm, I see. I hope I didn't scare her when I tried to talk to her earlier.\nMaya:\nNah, it's not you. My aunt drilled it into her head that \"if a suspicious-looking person tries to talk to you, run away\".\nPhoenix:\nS-Suspicious-looking...!?\nMaya:\nWell, you're not wearing training clothes, for starters...\nPhoenix:\nOf course not.\nMaya:\nPearly is my aunt's most valued treasure, so she's not allowed to go outside of town. She doesn't know much about the world outside of Kurain Village.\nPhoenix:\nAunt?\nMaya:\nPearly's mother is my aunt, duh. Come on, Nick.\nPresent\nAttorney's Badge\nMaya:\nAh, it's good to see this tarnished badge again.\nPhoenix:\nWhat do you mean by \"tarnished\"...?\nMaya:\nWell, look. This badge is like every other. It's bound to lose its color and shine after years and years. But you know, polishing it up once in a while wouldn't be a bad idea.\nMaya Fey profile\nMaya:\nHa ha ha. I'm warning you! I'm not the same weak Maya you knew a year ago, Nick!\nPhoenix:\nYou seem to have a lot of faith in yourself.\nMaya:\nYou'll see soon enough. I think you'll be totally shocked by how good my hamburgers are now!\nPhoenix:\n(Were you training to be a medium or a cook?)\nTurner Grey profile\nMaya:\nHey, it's my client!\nPhoenix:\n\"Client,\" huh? You're really serious about your work, aren't you?\nMaya:\nI thought I'd say it once, just to try it out, like how you always say, \"My client.\"\nAny other evidence\nMaya:\nHmm, nothing really comes to mind, Nick.\nPhoenix:\nDon't say that with such a big smile on your face.\nMaya:\nHa ha. What can I say? I'm in a good mood today.\nAny other profile\nPhoenix:\nWhat do you think about this person?\nMaya:\nHey, have I told you this one yet, Nick? We have a legend in this village. It goes like this. \"All the woman of the Fey clan are beauties.\" Well?\nPhoenix:\n...And that's a legend now?\nAfter clearing all Talk options:\nMaya:\nWell, Nick, I've got to get going. It's about time for the channeling to start.\nPhoenix:\nHuh? Oh, yeah...\nMaya:\nI'm doing the channeling in my house, so come on in, OK? After I'm done, we can grill up some juicy burgers!\nPhoenix:\nAlright. Good luck, Maya.\nMaya:\nThanks!\nPhoenix:\n(Well... At least she's still the same perky Maya.)\nJune 19Fey ManorMeditation Room\nGrey:\nAh, Mr. Wright. I'm so glad you showed.\nPhoenix:\nSome nice weather we're having today. Aren't you happy?\nGrey:\nNo, not at all. That stupid weather girl made the wrong call again. \"It will rain cats and dogs today!\" she said with a straight face. I can't believe they allow such misguided reports on the public airwaves!\nPhoenix:\n(Looks like talking about the weather with this guy is just asking for punishment...)\nGrey:\n...But anyway, this is a splendid manor.\nPhoenix:\n(No argument there... It's hard to believe that this is Maya's house, though...)\nGrey:\nI was given a guidemap to this building. Here, Mr. Wright. I have a copy for you too.\nGuidemap added to the Court Record.\nExamine\nDoor\nPhoenix:\nA door that leads to the Channeling Chamber, the place where spirits and people meet. The iron in this door was tempered, making it very solid. It looks like there is a strong lock on this door to top it off.\nWriting on top of the door\nPhoenix:\nSomeone with a lot of skill wrote these four Chinese characters with a brush. Oh look, here's a translation: \"Once in a Lifetime.\" Its message is people should value their ghostly meetings as once in a lifetime chances.\nBlue board\nPhoenix:\nA piece of cloth with a ton of finely-written characters jammed onto it. Probably esoteric knowledge only mediums should know. ...Hmm, let's see... Here's one in English... It says... \"100 Ways to Save Money\". ... Being a medium sounds like a rough way of life...\nDoor to the Winding Way\nPhoenix:\nThis door leads out to the Winding Way. The weather outside looks really nice.\nTalk\nToday's channeling\nPhoenix:\nWhat are you going to do once the nurse's spirit has been called?\nGrey:\nIsn't it obvious? I'm going to have her write a signed confession.\nPhoenix:\nA signed confession?\nGrey:\nYes, a confession. Pay attention! I'll have her write this: \"One year ago, on May 2nd, 14 patients died due to my negligence. And then, on May 24th, I fell asleep at the wheel and died in a car accident due to my further negligence. I'm sorry and I apologize for being negligent.\" That's what I'll have her write! With a confession, the rain falling on my soul can finally stop.\nPhoenix:\nO-Oh, I see...\nMaya\nPhoenix:\nSo, how did you hear about Maya Fey...?\nGrey:\nI heard about her from an acquaintance; a girl studying the occult at the college. That girl introduced me to this village. This is the home of the Kurain School of Channeling.\nPhoenix:\nThe home, huh...?\nGrey:\nAnd Ms. Maya is a daughter of the \"Master\", I hear.\nPhoenix:\nMaster...?\nGrey:\nAnyway, do you see that door? That's the room where people and spirits meet. Ms. Maya's aunt is in there right now. Would you care to meet her...?\nPresent\nAttorney's Badge\nPhoenix:\nLook, here's my attorney's badge.\nGrey:\nAre you trying to compete with me and my profession with that piece of scrap?\nPhoenix:\n...Uh...\nGrey:\nI am a surgeon. Compared to you lawyers, I'm practically a saint! Yes, well, I don't exactly have any patients right now, but, and listen good! I'm not the one that made the mistake!\nPhoenix:\n(This doctor needs his head examined...)\nGuidemap (Fey Manor)\nPhoenix:\nWow, this manor is really nice, don't you think?\nGrey:\nDo you honestly think this place is all that impressive? Don't make me laugh.\nPhoenix:\nHuh?\nGrey:\nThis is the countryside. Land here is dirt cheap. I will have something much greater one day! I will build my own grand mansion! Did you hear me!? A grand MANSION! This manor will seem like nothing!\nPhoenix:\n(Uh, could you keep that shaking fist away from my face? Thanks...)\nMaya Fey profile\nGrey:\nShe's still young, but one day, she'll bear a big responsibility. She'll be the Master, you know. The MASTER!\nPhoenix:\n(I guess there are \"Master\" mediums, too...)\nMorgan Fey profile\nGrey:\nThat's Ms. Maya's aunt. Earlier, she made me eat some sort of traditional dessert the size of a tea saucer! Hmm, I wonder if Ms. Morgan ever performs channelings herself...?\nAny other profile\nPhoenix:\nWhat do you have to say about this person, Dr. Grey?\nGrey:\n...This person... Hmm... Judging by their face...\nPhoenix:\nW-What is it?\nGrey:\nThey have a weak stomach.\nPhoenix:\nR-Really...\nJune 19Fey ManorChanneling Chamber\nPhoenix:\n(Wow... It's such a strange atmosphere in here... These flickering lights... I guess they're candles...)\n???:\nGood sir! Who might you be...?\nPhoenix:\nAaah! I-I'm, uh, my name is Phoenix Wright...\n???:\nOh... You must be that good sir...\nPhoenix:\n(\"Good sir\"...? Is she talking about me?)\n???:\nYou are a lawyer, are you not, good sir? I have heard much about you from Mystic Maya.\nPhoenix:\nIs that so? (\"Mystic\" Maya...?)\n???:\nI am Mystic Maya's aunt, Morgan Fey.\nPhoenix:\nN-Nice to meet you.\nMorgan:\nAh, I had wanted to speak with you about a certain incident, good sir. It would seem that perhaps you ask too much of Mystic Maya in performing your duties. Most unbecoming, I'm afraid.\nPhoenix:\nHuh?\nMorgan:\nDon't tell me you have already forgotten? That was it not for Mystic Maya and her assistance, you would surely not have won...\nPhoenix:\n(First a girl that runs away, and now an old lady who says I stink at doing my job... When did I become the poster boy for \"How Not to Make a First Impression\"...?)\nMorgan:\nThe past is the past though. Let us speak of the present now.\nPhoenix:\n...Ah, thank you...\nExamine\nDoor\nPhoenix:\nThe Meditation Room is on the other side of this very heavy-looking door. There is a giant iron lock where the handle is. It feels like a curtain that separates the normal world from the spirit one.\nFloor panels on left\nPhoenix:\nThis is where the medium sits, I assume. There are 4 panels of this flooring. The straw in the flooring feels a little damp, probably from the humidity in the air.\nAltar\nPhoenix:\nI guess this is an altar. Whatever it is, it feels very important. (Changed from [I guess this is an alter [sic]. Whatever it is, it feels very important.] in the original release) A mirror-like object with a cloudy reflective surface, and some branches of a sacred tree have been set in a pre-determined arrangement.\nMorgan:\nGood sir! I wonder if you would please not touch the sacred objects. Those objects are being offered to the spirits. If you were to touch them, good sir, they would become cursed. Yes, cursed.\nPhoenix:\n(She really didn't have to talk down to me. I'm not that much of an idiot...)\nFolding screen\nPhoenix:\nThis folding screen is really showing its age. All of its edges are a bit tattered. The lettering is fading too. I think I recognize a few of the characters on here... ...Ku ...ra ...in... I'm pretty sure that's what it says... Maybe I'll ask Maya about it later...\nSpace behind folding screen\nPhoenix:\nThere is some empty space behind the folding screen. The light of the candles can't reach back there, so it's completely dark.\nTalk\nMaya\nPhoenix:\nSo why do you add \"Mystic\" to Maya's name. Isn't that a little... strange?\nMorgan:\nGood sir!\nPhoenix:\nYes!\nMorgan:\nHow dare you be so rude and disrespectful towards Mystic Maya!\nPhoenix:\nI-I'm sorry.\nMorgan:\nShe must be addressed by her proper title, good sir. You must call her \"Mystic Maya\"!\nPhoenix:\nUm, uh... So, about Mystic Maya... Uh...\nMorgan:\nIt is the blood.\nPhoenix:\nExcuse me? \"Blood\"?\nMorgan:\nMystic Maya carries the blood of the Master. In actuality, she is the only one remaining.\nPhoenix:\n(Only one remaining...? What's that supposed to mean?)\nMorgan:\nMystic Maya is the last of the rightful heirs of the Kurain Channeling Technique.\nPhoenix:\nOK... Then... where do you stand...?\nMorgan:\nThat is a little more complicated... Although a woman of the Fey family, I am merely a member of the branch family.\nPhoenix:\n...Branch family? What's that?\nMorgan:\nIt is as it sounds. For a member of the branch family, no matter her spiritual power, she can never become the Master of the Kurain School.\nPhoenix:\nSo... how strong are you...?\nMorgan:\n... It is a shame, however I will admit. I can not even begin to compare the lowliness of my power to the Master's.\nPhoenix:\n(So that's how it is...)\nToday's channeling\nPhoenix:\nSo today's channeling will be her first?\nMorgan:\nYes, good sir. Because the spirit of a person who dies in a traffic accident is usually very strong, it is usually easier to call that person to our world.\nPhoenix:\n(\"Traffic accident\" indeed.)\nMorgan:\nThe channeling will take place here, in this Channeling Chamber, good sir. As you can see, I am in the process of preparing.\nChanneling Chamber\nPhoenix:\nSo... this room is the... Channeling Chamber...?\nMorgan:\nThe place where a spirit medium speaks with those who have departed.\nPhoenix:\nI don't suppose you'd mind if we observed the session...\nMorgan:\nDo not even think of such nonsense! Only the medium and the client may enter here.\nPhoenix:\nO-Oh.\nMorgan:\nThe secrets of the Kurain Techniques can not be seen by just anybody.\nPhoenix:\n(That never stopped Maya from doing it in front of me before...)\nMorgan:\nIt is also for your safety, good sir, if something were to go wrong. That is why, while channeling is being performed, that heavy door is securely locked...\nPhoenix:\nOh, that's what the lock is for...\nPresent\nMaya Fey profile\nMorgan:\nGood sir!\nPhoenix:\nY-Yes!\nMorgan:\nWhen did you... take a hidden picture of Mystic Maya!?\nPhoenix:\nWh-Wh-What!? Wait... It's not like that at all!\nMorgan:\nIt is unforgivable!\nPhoenix:\nOw-ow-ow! (Why did she slap me?)\nTurner Grey profile\nPhoenix:\nAbout this person...\nMorgan:\nOh! It is that man, is it not? A man who wishes to borrow a departed spirit's power to hide the lack of his own. What an insignificant man.\nPhoenix:\nInsignificant...?\nMorgan:\nThat would mean you are that man's insignificant little friend, dear sir.\nPhoenix:\n(Then I guess that makes Maya my insignificant little assistant, huh?)\nAnything else\nMorgan:\nGood sir!\nPhoenix:\nAck!\nMorgan:\nWe would like to begin the channeling at 3 o'clock. If you don't mind, good sir, would you mind allowing me to make preparations?\nPhoenix:\nUh, um, sure... go ahead... (She's a Fey alright! Just as odd as the rest.)\nAfter clearing all Talk options:\nMorgan:\n... Oh, yes. I wonder if you have yet to meet Pearl, good sir.\nPhoenix:\nPearl?\nMorgan:\nShe is an adorable, angelic young girl.\nPhoenix:\nOh, that odd...\nMorgan:\nShe is my daughter. Now then, what was it you were about to say...?\nPhoenix:\nWh-What a cute daughter you have... Ahaha...\nMorgan:\nA pure heart that knows not of the evils in this world is a powerful thing, good sir. Please refrain from affiliating with her, I request.\nPhoenix:\n(Well, it's not like I had the chance to anyway...)\nMorgan:\nI must insist and stress that you not let it occur.\nPhoenix:\nOkay, okay, I get it!\nJune 19Fey ManorWinding Way\nPhoenix:\n(Wow. This garden is really breath-taking. Someone put a lot of love into it. What is that over there...? ...Is that an incinerator? It looks a little out of place in a garden like this...)\nExamine\nGarden\nPhoenix:\nA splendid garden with a small lamp and traditional decorations. It's a bit small to walk around in... Although, that incinerator piques my curiosity...\nIncinerator\nPhoenix:\nIt's a small incinerator. I don't think garbage trucks come all the way out here to a little village like this. So every family has to burn their own trash.\nSide room\nPhoenix:\nIt looks like there's a room over there, too. A peaceful feeling is emanating from it.\nUrn\nPhoenix:\nIt's a really old urn. The ashes of a person long dead are inside. It looks like something with a long history... Other than that, it's not very interesting, so time to move on.\nJune 19Fey ManorSide Room\nPhoenix:\n(So this is... the Side Room. Looks like it's more of a break room. There is bedding spread out on the floor. It looks like someone's sleeping in one. I shouldn't disturb them...)\nExamine\nWooden bear sculpture\nPhoenix:\nIt's a decorative wooden bear sculpture. There's a plate attached to the base. \"Kurain Village - The Heart of Channeling\" What the!? It's a souvenir. So does this mean it's easy to spot bears here... And for them to spot you...? *gulp*\nAlcove\nPhoenix:\nIt's a small alcove. I have no idea what it's supposed to mean or symbolize. If I had one of these in the office, it would end up as storage space. But here, it's decorated with some pretty flowers and a beautiful hanging scroll.\nSliding door\nPhoenix:\nThis is the first time I've seen a sliding door like this in person. From here, I can see the Winding Way and the little garden in the courtyard.\nBed on right\nPhoenix:\nThere's bedding spread out on the floor. Is that someone sleeping in one over there? She's probably an exhausted medium taking a break and catching some z's. If I wake her up, she might be grumpy and throw a spell on me. It's probably a good idea to not disturb her sleep...\nWinding Way (after visiting Side Room and clearing all Talk options in Fey Manor - Channeling Chamber)\n???:\nHey! You! Hold on, now! This gal's got a few questions to ask!\nPhoenix:\n(Hmm... I'm sure I've heard that southern accent somewhere before...)\n???:\nOh, well I'll be! It's Mr. Phoenix Wright! How ya been!? Haven't seen you in, what, a year!?\nPhoenix:\nUm... You... are... uh...\nLotta Hair\nPhoenix:\nUm, Lotta Hair, was it?\n???:\nL-L-Lotta Who!? Wait, you best not be making fun of my hair, now!\nPhoenix:\nAh, no, um, I wasn't \"making fun\"... I was \"complimenting\" you on your fine hair...\n???:\nHmph, I dare say yer one heartless man, Mr. Wright. It was cause of my testimony that yer friend got outta being guilty. But looks like you already forgot that.\nPhoenix:\nHold up... you were working with the prosecution at first as one of their witnesses, and came after us as if we were a piece of sirloin steak...\n???:\nMinor detail. Stop being so uptight; lettin' little things get in the way. The name's Hart. Lotta Hart. Don't you go forgetting it!\nPhoenix:\nOh yeah! That's it!\nLotta:\nNow listen here. I'm here to take some pictures today. Gonna get myself a real scoop.\nPhoenix:\nAh, so I guess you're still at it? Being a photographer, I mean.\nLotta:\nYou betcha! The hardest working one out there, I reckon! Didn't I say I was gonna make a name for myself as a famous \"paranormal photographer\"!?\nLeads to:\n\"Oh, that's right!\"\nLotta Hart\nPhoenix:\nYou're Lotta Hart, right...?\nLotta:\nBingo! I'm the one and only \"paranormal photographer\", Lotta Hart!\nPhoenix:\nAh, so I guess you're still at it? Being a photographer, I mean.\nLotta:\nOf course! And today, I'm gonna get myself a real scoop! You wait and see!\nLeads to:\n\"Oh, that's right!\"\nWho are you again?\nPhoenix:\nSorry, but who are you again?\n???:\nOh Lawdy! I've met some cold men in my days, but you... You're in an icebox of yer own!\nPhoenix:\nCome on, am I really that bad...?\n???:\nPut yer noggin to some use! You've gotta remember who I am! It was cause of my testimony that yer friend got outta being guilty.\nPhoenix:\nAh! You're the one from that trial!\n???:\nSee, I knew you could remember if you tried!\nPhoenix:\nYou were working with the prosecution at first as one of their witnesses, and came after us as if we were a piece of sirloin steak...\n???:\nWhy don't we let bygones be bygones, now. It's yesterday's news, right? Name's Lotta Hart. Don't you go forgetting it, ya hear!?\nPhoenix:\nUm... So what brings you here today?\nLotta:\nHah! You should already know! I'm here for the big scoop! I can feel it!\nPhoenix:\nAh, so I guess you're still at it? Being a photographer, I mean.\nLotta:\nYou betcha! The hardest working one out there, I reckon! Didn't I say I was gonna make a name for myself as a famous \"paranormal photographer\"!?\nLeads to:\n\"Oh, that's right!\"\nLotta:\nOh, that's right! This ain't no time to be wastin' time! The channeling's about to get started!\nPhoenix:\nIs it that time already!?\nLotta:\nWe all should hurry up and get to the Meditation Room. ...What are you waiting around for!? Come on!\nPhoenix:\n(Lotta Hart, huh? I've been judging her harshly because of that case, but, I guess looking back, we had some good times, too...)\nJune 19Fey ManorMeditation Room\nMorgan:\nWe will now begin the channeling. Mystic Maya and honored guest, please proceed into the Channeling Chamber.\nGrey:\nWith this, I can finally swat all those pesky flies, once and for all! You hear me!? They won't be able to say a single bad thing about me after this! You would love to hear them apologize, wouldn't you? Wouldn't you, Mr. Wright!?\nPhoenix:\nMe!? Oh, uh, yeah, I sure would.\nMorgan:\nMystic Maya, do you have the Channeling Chamber key?\nMaya:\nYup, right here.\nMorgan:\nThat is most satisfactory. That key is one-of-a-kind, so please take care of it well.\nMaya:\nIt'll be fine, Aunt Morgan. I won't lose it, trust me! OK, Dr. Grey. Let's get started.\nGrey:\nFinally! Let's go!\n*click*\nMorgan:\nNow let us wait patiently out here for them. Please have some lovely bitter green tea and jaw-droppingly large strawberry desserts...\nLotta:\nHold on, now, granny!\nMorgan:\n...Granny?\nLotta:\nHow come we ain't allowed in that room!?\nMorgan:\nDear madam, you have an \"impressive\" grasp of English. From where did you learn it?\nLotta:\nWhat!? I'm from the heart of the heartland!\nMorgan:\nIs that so? Then I humbly request that you return to this \"Heart of the Heartland\".\nLotta:\nWh-What are ya...?\nMorgan:\nThis is Kurain Village. If you can not follow our traditions and rules, we request that you leave!\nLotta:\n...! ... Sorry.\nPhoenix:\n(Wow. She shut Lotta up! Now THAT's impressive!)\nMorgan:\nNow then, let us wait.\n*BANG*\nLotta:\nHey now! Wh-What was that just now!?\nPhoenix:\n(It came from inside the Channeling Chamber...)\n*BANG*\nLotta:\nHey! Th-That's a gunshot!\nMorgan:\nE-Excuse me!?\nLotta:\nI've heard that sound before. It's a gunshot! I'd bet my afro on it!\nPhoenix:\n(M-Maya! Maya's in there!)\nBreak into the Chamber\nLotta:\nWell, Mister Lawyer! What's the plan!?\nPhoenix:\nWhat else!? We're going to break in!\nLotta:\nWhat!? But... But there's only one key and that kid's got it.\nPhoenix:\nWe're going to have to break the door. Is that alright, Ms. Fey?\nMorgan:\nWell, yes... But there is one matter... That is...\nPhoenix:\nDon't try to stop me! You can send the repair bill to the Wright & Co. Law Offices later!\nLeads to:\n\"Yeah! Now that's what I call being a man!\"\nAsk Morgan what to do\nPhoenix:\nMs. Fey! What should we do!?\nLotta:\nYellow-bellied chicken liver! What are ya waiting for!? Kick it down already!\nPhoenix:\nBut... The key...\nMorgan:\nThat key is one-of-a-kind. In this world, there is only that one. Even I am powerless to open that door.\nPhoenix:\n(Hmm, there is really no other way...) Alright. Stand aside! I'm going to break the door down!\nMorgan:\nW-Wait! Please! That sort of recklessness...\nLeads to:\n\"Yeah! Now that's what I call being a man!\"\nLotta:\nYeah! Now that's what I call being a man!\n*SLAM* *SLAM* *CRASH!*\nPhoenix:\nD-Dr. Grey!!\n*klik*\n???:\n...I... ...I was... murdered...\nPhoenix:\nM-Maya?\n???:\nThat man... ...murdered me... ...so I killed... him...\nPhoenix:\nWh-What!?\n*klik*\nPhoenix:\nLotta! At a time like this!?\nLotta:\nTimes like this are perfect for snapping up shots! But anyway... what's going on here!? This gal... Is she... ...Maya!?\nStep away from there!\nMorgan:\nPlease leave this area to me. Go quickly and inform the police!\nPhoenix:\nBut, but...\nMorgan:\nHurry! Before there are more victims here!\nLotta:\nHey, let's go, City Boy! Leave this to the granny!\nJune 19Kurain Village\nPhoenix:\n(My cell phone doesn't get reception way out here... So I ended up using the phone booth to call the police...)\nLotta:\nAnd...?\nPhoenix:\nThey're on their way.\nLotta:\nThat's good. Lawdy, I saw a genuine \"mysterious phenomenon\"...\nPhoenix:\n(She seems really on edge because of all this... Not that I blame her... I'm scared to death by what's going on...)\nTalk\nWhat you witnessed\nLotta:\nHey, Mister. That gal... Maya. She wasn't the one that pulled the trigger, was she...?\nPhoenix:\n(Oh, yeah... Lotta doesn't know that when Maya is channeling, her whole physical appearance changes.)\nLotta:\nThen again... Weren't there only the two of 'em in there? I reckon she musta done it then...\nDr. Grey\nPhoenix:\nLotta, what do you know about Dr. Grey?\nLotta:\nNot much, but I did some digging... That's one gent with a bad reputation.\nPhoenix:\nReally?\nLotta:\nI hear he's good at surgery and stuff, but his personality stinks like wet sheep.\nPhoenix:\n(I sort of got the same impression myself...)\nLotta:\nHe's real controllin'. Soon as his nurse or patients don't do what he says, he starts a-hollerin'. Musta been real rough to work for him.\nPresent\nAnything\nLotta:\nHey, they'll be here soon, right? The police, I mean. I reckon you should be gettin' back to the crime scene, now.\nPhoenix:\n(Yeah, I guess so...)\nJune 19Fey ManorMeditation Room\nMorgan:\nAh, Mr. Wright.\nPhoenix:\nMs. Fey! How's, um... Mystic... Maya?\nMorgan:\nShe has returned to \"this world\". The Spirit Severing Technique was successful.\nPhoenix:\nLet me see her, please!\nMorgan:\nShe is still unconscious. I humbly request that you wait outside for her recovery.\nPhoenix:\n(Guess I just have to wait... *sigh*)\nGumshoe:\nThe police are here! Sorry to keep you waiting! Huh? ...You again!?\nPhoenix:\nWhat are you doing all the way out here, Detective Gumshoe?\nGumshoe:\nIt's actually kinda funny. I was in the area for a business trip, pal. Well, time to check out the crime scene. I'll have to question everyone here later on, so just sit tight, alright?\nPhoenix:\n(Why is he grinning at me...?)\nMorgan:\nShall I show you to the scene of the crime, Detective Gymshoe?\nGumshoe:\nUm... My name isn't Gymshoe...\nPhoenix:\n(The two of them went into the Channeling Chamber... I guess all I can do for now is see what everyone else has to say...)\nJune 19Kurain Village\nLotta:\n...\nPhoenix:\n(She's probably scared out of her wits after having a murder take place right near her.) Lotta?\nLotta:\nGAWDDON'TLETITBEMENEXT!\nPhoenix:\nEek! Don't scare me like that!\nLotta:\nWhat do you mean!? Yer the one scaring me! If I weren't so tough, you'd have another dead body on yer hands -- mine!\nTalk\nAny ideas\nLeads to:\n\"Did you see or notice anything that stuck out at you?\"\nPresent\nMaya Fey profile\nLotta:\nMust be an awful thing to see each other again and have this happen. Never woulda guessed that gal would end up being a murderer.\nPhoenix:\nThat wasn't Maya! She was being controlled by a spirit...\nLotta:\nCome on, now, City Boy. Ya really think the cops'll believe that?\nTurner Grey profile\nLotta:\nHey, it's that Dr. Grey guy. Pity what happened to him. Pretty scary what ghouls and ghosts can do to a man, huh? Gawd rest his poor soul.\nPhoenix:\n(Hmm... Since when was Lotta so religious...?)\nMorgan Fey profile\nLotta:\nThat old lady sure can be forceful. She scared me back there. ...Well, only a little, now, ya hear?\nDick Gumshoe profile\nLotta:\nI swear I've seen his face before. Maybe during that last case... Whenever something happens, this detective guy is always there. I wonder if he's the real baddie behind everything?\nPhoenix:\n(Somehow, I highly doubt it...)\nAnything else\nLotta:\nNope. Don't know nothin' about that. Things that don't catch my eye, don't catch my interest.\nPhoenix:\n(And she calls herself a journalist??)\nPhoenix:\nDid you see or notice anything that stuck out at you?\nLotta:\nNah... Well, maybe one thing...\nPhoenix:\nWhat is it!?\nLotta:\nTurns out my poor stomach's not good at handlin' this kind of thing.\nPhoenix:\nHuh-what?\nLotta:\nCurses and ghosts and stuff comin' back to get ya... This is just too much, I say.\nPhoenix:\nWhat is too much?\nLotta:\nBeing an occult photographer. That's some scary stuff, so I think I'm gonna try being a celebrity photographer, now.\nPhoenix:\nGoing after photos more within your reach from now on? More glamour, less gore?\nLotta:\n...\nPhoenix:\nWhat's up?\nLotta:\nOh, yeah!\nPhoenix:\nWh-What is it?\nLotta:\nI took some hot pictures earlier!\nPhoenix:\nHuh?\nLotta:\nRemember!? I took some pictures at the murder scene inside!\nPhoenix:\n(Ack! She did! Two even!)\nLotta:\n\"The Séance Murder\"... I sure like the ring of that. It'll be a sensational story!\nPhoenix:\nL-Lotta!\nLotta:\nSorry, but my journalistic sense is burnin' inside me! Hate to cut and run, but I'm headin' back in! Gotta beat those cops to the scoop of the century! UWAAAAAAAAAAAAAAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHAhahahahahahahahahahaha... ...\nPhoenix:\n(I don't know who's scarier... Lotta or the spirits... And why does it feel like we've been through this before...?)\nJune 19Fey ManorChanneling Chamber\nPhoenix:\n(The police are busily running here and there, and I don't see Maya anywhere...)\nGumshoe:\nH-Hey, you! Don't touch anything!\nPhoenix:\nLook, I really need to ask you some questions!\nGumshoe:\nUmm... Don't look at me like I'm some sort of uncaring jerk... Tell you what, pal. I'll let you ask me a few questions, alright?\nExamine\nAnywhere\nGumshoe:\nHey, pal! No touching without my permission!\nPhoenix:\nI'm just looking at it.\nGumshoe:\nHey, I can't be too careful if a kid like her can be a murder suspect, now can I?\nPhoenix:\n(I guess if I want to search this room, I'm going to have to come back later...)\nTalk\nMaya\nPhoenix:\nUm, about Maya...\nGumshoe:\nI hate to break this to you, pal, but... with the way things look now, that girl's the only one who could've done it.\nPhoenix:\n(Yeah. Only Maya and the victim were inside this room, after all...) But Maya is...\nGumshoe:\nYou can ask more about her later, pal. Right now, I've got a job to do and that's collecting evidence.\nPhoenix:\n(Detective Gumshoe looks like a real professional. And yet, something about his expression still looks the same...)\nCause of death\nPhoenix:\nSo... Dr. Grey was shot with a gun, huh?\nGumshoe:\nHe was shot in the forehead. But...\nPhoenix:\nBut...?\nGumshoe:\nBut he was also stabbed in the chest with a knife.\nPhoenix:\n(...A knife?)\nGumshoe:\nBasically, the vic was first stabbed, then he was shot. (Changed from [After being stabbed, the final blow was a shot from a gun.] in the original release)\nPresent\nAnything\nGumshoe:\nAh, I'm really busy right now. I can take a look at it later, alright, pal?\nPhoenix:\n(He didn't even take a glance at it...)\nJune 19Fey ManorSide Room\nPhoenix:\n(Hmm, I'm pretty sure there was someone sleeping here earlier...)\n???:\nLike, how can I help you?\nPhoenix:\nAck! Ah, I'm, uh... That is... I...\n???:\nUm, like, so isn't it about time to start?\nPhoenix:\nHuh? Time to start what?\n???:\nYou know, like, the channeling!\nPhoenix:\nChanneling...? Oh, oh, oh, oh!! No, actually, the situation has kind of changed...\n???:\nHuh? Like, what do you mean?\nPhoenix:\nPlease stay calm, but... there has been a murder! (Changed from [Please stay calm, but... a murder has taken place!] in the original release)\n???:\n... Um, so, like... A murder is that thing where, like, one person kills another, right?\nPhoenix:\nYes! A person has killed another person!\n???:\nOh, that's... Uh... What are the words I'm looking for...? It's like... ...like totally a bummer.\nPhoenix:\n...Yeah... (After all that effort, that's all she had to say?)\n???:\nOh, I'm sorry. I forgot to, like, introduce myself.\nIni:\nMy name is Ini Miney. Um... At the college, I'm researching and studying \"parapsychology\".\nPhoenix:\n\"Parapsychology\"?\nIni:\nThat's right. Um... I think people, like, usually call it, \"occult studies\" or something. Like supernatural phenomenon, ESP and psychic powers. That sort of stuff.\nPhoenix:\n(That's pretty out there...) I'm Phoenix Wright, attorney at law.\nExamine\nBed on right\nPhoenix:\nYou left the blanket a mess. Are you going to fold it?\nIni:\nLike I had a really good nap, and, like... I was thinking of leaving it like this, so, like, it's all set for tonight.\nTalk\nIni Miney\nPhoenix:\nSo what brings you here today?\nIni:\nUm, like, so... I was the one who told Dr. Grey about this place. He asked me, like, \"Do you know of a good spirit medium?\"\nPhoenix:\n(Hmm, Dr. Grey did say something about being introduced to this place.)\nIni:\nCause, like, talking to dead people and, like, multiple personalities are my thing...\nPhoenix:\nI see... Then why were you taking a nap here?\nIni:\nLike... I wasn't feeling good.\nPhoenix:\nHuh?\nIni:\nI'm, like, allergic to sesame seeds. They, like, must've put some in the food they served for lunch.\nPhoenix:\nOh, that doesn't sound fun.\nIni:\nSo I, like, felt sick, and came in here to, like, sleep. I totally feel, like, I've wasted my time 'cause I, like, slept a long time.\nWhat happened\nPhoenix:\nSo you were sleeping here the entire time?\nIni:\nYeah. Ever since lunch...\nPhoenix:\nSo you don't know anything about the murder that took place?\nIni:\nLike, what? Oh, that! I, like, totally know nothing. So who was, like, you know, killed...?\nPhoenix:\nThe surgeon that requested the channeling, Dr. Grey.\nIni:\n...\nThe victim (appears after \"Ini Miney\" and \"What happened\")\nPhoenix:\nYou and Dr. Grey knew each other, right?\nIni:\n...! I don't know any Dr. Grey!\nPhoenix:\nOh really...? Then what was all that talk about him earlier? (Changed from [That's not exactly what Dr. Grey said...] in the original release)\nIni:\nHuh!? ...Well, uh... Like, a long, long time ago... I was, like, a patient, yeah.\nPhoenix:\n(She sounds like she's trying to hide something...)\nPresent\nMaya Fey profile\nIni:\nOh, hey! That's, like, Maya Fey, right? She's, like, totally waaaay famous! Like, well, for people like us, like, you know?\nPhoenix:\n(\"Waaaay famous\"? Maya?)\nIni:\nI mean, like, she's, like, the daughter of the Master, right?\nPhoenix:\n(Hmm... Well, at least she remembers some things.)\nIni Miney profile\nIni:\nUm... This face... Like, I think I've seen it somewhere before...\nPhoenix:\nWhat!? ...Y-You're joking, right?\nIni:\nHa ha, like, of course I am, silly!\nPhoenix:\n(Oh, thank goodness...)\nAny other evidence\nIni:\nLike, I'm really sorry, but I'm not all that smart... so I don't, like, get it.\nPhoenix:\n(Hmm. Why does it feel like she's just putting on an act?)\nAny other profile\nIni:\nI'm, like, totally bad at remembering people's names.\nPhoenix:\nOh?\nIni:\nBut I, like, remember seeing that face somewhere before, like, I think...\nPhoenix:\nWell, thanks for trying. (I didn't think it was possible for someone to be this much of an airhead...)\nJune 19Fey ManorWinding Way\nPhoenix:\n(There's no one here... as usual.) Ack! ...H-Hey... How are you?\nPearl:\n...\nPhoenix:\nYou're Pearl, right?\nPearl:\n...\nPhoenix:\n(Hmm. Silent as ever... ...? What's that she's got in her hand? I've seen it somewhere before...)\nTalk\nAny option\nPhoenix:\nUm...\nPearl:\n...!\nPhoenix:\n(...What is it!? Is it my hair? Is it too spiky? Not spiky enough!?)\nPresent\nAnything\nPhoenix:\nUm...\nPearl:\n...!\nPhoenix:\n(...What is it!? Is it my hair? Is it too spiky? Not spiky enough!?)\nAfter clearing \"Any ideas\" Talk option in Kurain Village and clearing all Talk options in Fey Manor - Channeling Chamber and Fey Manor - Side Room:\nJune 19Fey ManorMeditation Room\nMorgan:\nOh, dear madam... You have such impeccable timing.\nIni:\nLike, what's all the buzz?\nGumshoe:\nAhem. Alright everyone, listen up! You too, pal! I'm going to give you all a brief update! Right now, it looks like the investigation's not going to be done until real late...\nMorgan:\nThat is a terrible shame. I propose that everyone sleep here under the roof of the Fey Manor tonight.\nPhoenix:\n(What a mess. I can't believe how crazy this day turned out... Maya was arrested and taken away by the police. And I don't see myself getting any sleep tonight...)\nJune 20, 8:02 AMFey ManorMeditation Room\nPhoenix:\n(*yawn* Uuugh... Morning... I guess I must have nodded off at some point... I hope Maya's OK. I should hurry and get to the Detention Center, ASAP!)\nJune 20, 10:34 AMDetention CenterVisitor's Room\nMaya:\nN... Nick! Nick! I...!\nPhoenix:\nMaya!\nMaya:\nWhat am I going to do!? I never imagined it would turn out like this!\nPhoenix:\nCalm down, Maya! Take deep breaths. (Come to think of it, the first time I met her... It all started right here, in this detention center...)\nMaya:\nI finally... I finally get to see you again, and...\nPhoenix:\nIt's not your fault. You didn't do it.\nMaya:\nNo, I... I did it... I killed that person.\nPhoenix:\nBut that wasn't you.\nMaya:\nIt doesn't matter. It might as well have been me. I was too weak... and I... I couldn't control the spirit's power, so...\nPhoenix:\n(I don't want to bring up the case quite yet, but...)\nMaya:\n...You don't have to be nice to me. I understand.\nExamine\nSurveillance camera\nPhoenix:\nSmile, you're on candid camera.\nGuard\nPhoenix:\nThis guard monitors the visitor's room. I wonder if he's bored. Not that I can tell since he never looks over this way.\nTalk\nChanneling\nPhoenix:\nSo you're the Master or something of the Kurain School of Channeling...?\nMaya:\nActually, my mother is for now. But since that title is passed from mother to daughter, I guess I will be someday...\nPhoenix:\nBut many people think that channeling isn't real, that it's all just an act.\nMaya:\nYou believe in us, don't you?\nPhoenix:\nYeah... because I've seen it with my own eyes. (When Maya's channeling a spirit... not only her voice, but her whole physical appearance changes. It's a supernatural phenomenon that occurs every time. It happened this time, too... Dr. Grey said that he wanted to call the nurse, so... Maya's body must have taken on that nurse's appearance...)\nWhat happened\nPhoenix:\nWhat exactly happened in the Channeling Chamber?\nMaya:\n... I went into that room with Dr. Grey, locked the door... and sat down across from him.\nPhoenix:\nOK...\nMaya:\nWe closed our eyes...and I began the channeling.\nPhoenix:\n(This is sounding kind of creepy... like the beginning of a scary story...)\nMaya:\nAnd that's the last thing I remember...\nPhoenix:\nWhat?\nMaya:\nAfter a spirit comes into my body, I lose my self, my consciousness.\nPhoenix:\nThen, you don't remember a single thing?\nMaya:\nWhen I came to, I was being held in my aunt's arms. And there was blood... all over my clothes.\nPhoenix:\n(Hmm...)\nMaya:\nOh! But... I do remember having a dream.\nPhoenix:\nA dream...?\n\"Dream\" (appears after \"What happened\")\nPhoenix:\nWhat kind of dream did you have while you were channeling...?\nMaya:\nUm... I can't remember it all that well, but... I was dead and buried in the ground. I couldn't move... and it was unbearable... Really suffocating... ...It went something like that.\nPhoenix:\nI... I see... (I have no idea what to say to that...)\nMaya:\nThere was a really familiar smell too...\nPhoenix:\nUnder the ground?\nMaya:\nYeah, I can't quite place it, but I know I've smelled that same scent before...\nPresent\nMaya Fey profile\nMaya:\nI... I can't face myself...\nPhoenix:\n(I should've known better...)\nTurner Grey profile\nMaya:\n!! T-The... That's the guy I k-killed...\nPhoenix:\nAck! I'm sorry! (Why did I pull this picture out!?)\nPearl Fey profile\nMaya:\nPearly... She definitely has more than me...\nPhoenix:\nHuh? What are you talking about?\nMaya:\nWho I think the next Master should be... I mean, she's got more spiritual power than me, and she really works hard at her training...\nPhoenix:\n(Talk about bringing the mood down even further... *sigh*)\nMorgan Fey profile\nMaya:\nI... I can't face my aunt right now... Not now... that this has happened...\nPhoenix:\nIt's alright, Maya. I'm sure she understands. She's on our side, after all.\nMaya:\nYeah, I know... But still...\nLotta Hart profile\nMaya:\nThat's Lotta Hart... right?\nPhoenix:\nThat girl is still after the next sensational photo.\nMaya:\nHa ha. I guess some things never change.\nDick Gumshoe profile\nMaya:\nI felt terrible during the questioning session... I mean, Gumshoe kept looking at me... with these really sad eyes... ...\nAny other evidence\nMaya:\nSorry, Nick, but there's nothing really special about it.\nAny other profile\nPhoenix:\nSo... what do you think about this person...?\nMaya:\n...?\nPhoenix:\n(I guess I can't expect her to know anything about this person.)\nAfter clearing all Talk options:\nPhoenix:\n... (...I guess this is about all the information I'm going to gather for today...) I'll be back later, Maya. In the meantime, please make sure you prepare it, OK?\nMaya:\nHuh? \"It\"? What is \"it\"?\nPhoenix:\nThe document requesting me to be your attorney, of course.\nMaya:\n...! But...\nPhoenix:\nWhat's wrong?\nMaya:\nAre you sure? I mean, I'm guilty! I'm a murderer!\nPhoenix:\nNo one's decided that yet.\nMaya:\nBut I did! I killed that person... with these... two hands...!\nPhoenix:\nThat's enough, Maya.\nMaya:\nIt's hopeless! If you defend me, you'll lose, I'm sure...\nPhoenix:\nStop it!\nMaya:\n... ...Help me... Nick, help me... I'm scared...\nPhoenix:\nDon't worry, I will. When is the trial?\nMaya:\nIt sounds like tomorrow.\nPhoenix:\n(As usual, zero prep time...) Alright. I'm going now.\nMaya:\nWait.\nPhoenix:\n...?\nMaya:\nThis jewel... This is called a Magatama. It's a magical charm and it's always protected me. Give this to Pearly... And I'm sure she'll lend you her spiritual powers.\nMagatama received from Maya.\nPresent\nMaya's Magatama\nMaya:\nMake sure you show that to Pearly, OK, Nick? I'm sure she'll be a big help to you.\nJune 20Wright & Co. Law Offices\nPhoenix:\nPhew. It feels like I've been gone forever. But it's only been one day... (Oh, that's right!) Where's that newspaper Dr. Grey brought the other day...? ...Ah, here it is. Right on top of my desk. (This is the only thing he left behind that's going to be of any help...)\nNewspaper Clipping 1 added to the Court Record.\nExamine\nWindow\nPhoenix:\nThere is a giant building just outside the window. It's the Gatewater Hotel, a high-class, luxury hotel. Until recently, it had been a normal, business-class hotel.\nHouseplant\nPhoenix:\nCharley. A quite decorative plant. It's a memento of my boss, Mia... who passed away. The rest of the room may be in shambles, but I always manage to care for this little fella.\nPoster\nPhoenix:\nA poster of the TV action hero, the Steel Samurai. Maya stuck it up here right before she left. I wouldn't say that the Steel Samurai and an attorney's office are a good match, but Maya threatened to curse me with some magic spell... so I guess it can stay.\nBookshelf\nPhoenix:\nDifficult-looking legal books stand in a formidable row. They mock me. ...Actually, I've neglected them for so long, a layer of dust has started to form. One of these days, I should try to build up the courage to read one... Maybe.\nDesk\nPhoenix:\nIt's my desk. I keep it neat for those rare occasions when I actually have a client in the office.\nAfter visiting Wright & Co. Law Offices or Kurain Village:\nJune 20Detention CenterVisitor's Room\nPhoenix:\n(Maya must still be in questioning... I hope the detectives are taking it easy on her, but... these kinds of cases aren't taken lightly. I guess I'll come back later.)\nJune 20Kurain Village\nPhoenix:\n(I have to save Maya, no matter what! It's her life on the line! What in the world happened in that room yesterday?)\nJune 20Fey ManorMeditation Room\nPhoenix:\n(The Meditation Room nurtures all mediums young and old. Even mediums in training, I'd wager. But it's pretty deserted today... ...probably because of the murder yesterday...)\nJune 20Fey ManorChanneling Chamber\nPhoenix:\nIt looks like Detective Gumshoe isn't here today... I should take this chance and thoroughly check this room. If I'm lucky, I might uncover a clue or two...\nMorgan:\nOh, Mr. Wright.\nPhoenix:\nGood morning.\nMorgan:\nI am on my way to go meet Mystic Maya, and I thought to bring her some items to make her feel more at home. Namely, tea so bitter you lose your tongue and jaw-droppingly large strawberry desserts.\nPhoenix:\nI'm sure Maya will be very grateful...\nMorgan:\nThat's \"Mystic Maya\", good sir!\nPhoenix:\n(Urk. She is one scary lady.)\nMorgan:\nOh, dear, sweet Mystic Maya... Pearl wept constantly for you last night, as did I.\nPhoenix:\n(I know it's important for me to search the site, but I should ask her some questions too, while I have the chance...)\nExamine (left side)\nDoor\nPhoenix:\nThe Meditation Room is on the other side of this very heavy-looking door. The lock on it is broken, because, well... I broke it. It doesn't seem possible, but I managed to break it pretty badly. When we want to do something bad enough, people can do the most amazing things.\nFloor panels on left\nPhoenix:\nThis is where the medium sits, I assume. There are 4 panels of this flooring. The straw in the flooring feels a little damp, probably from the humidity in the air. No matter what I do, my eyes keep getting drawn to the pool of blood in the center here.\nAltar\nPhoenix:\nI guess this is an altar. Whatever it is, it feels very important. (Changed from [I guess this is an alter [sic]. Whatever it is, it feels very important.] in the original release) A mirror-like object with a cloudy reflective surface, and some branches of a sacred tree have been set in a pre-determined arrangement. I'd guess they're used during the channeling...\nFolding screen\nPhoenix:\nIt's a beautiful and expensive folding screen. It also looks quite old. There seems to be some sort of sacred text written on it, but I can't read it. ... ! Th-This is... It's a hole! Could this have been made by a bullet?\nFolding Screen added to the Court Record.\nSpace behind folding screen\nPhoenix:\nThere is some empty space behind the folding screen. The light of the candles can't reach back there, so it's completely dark. I hope no one is hiding back there.\nTalk\nWhat happened\nPhoenix:\nI would like to ask you a few questions about what happened yesterday.\nMorgan:\nDo you mean that awful tragedy?\n???:\nThat man... ...murdered me... ...so I killed... him...\nPhoenix:\nM-Maya?\nStep away from there!\nMorgan:\nPlease leave this area to me. Go quickly and inform the police!\nPhoenix:\nWhat happened here in this room after I left?\nMorgan:\nWell... First, I struck Mystic Maya on the head.\nPhoenix:\nTo make her go unconscious, correct?\nMorgan:\nThat is correct. Next, I performed the Spirit Severing Technique.\nPhoenix:\n\"Spirit Severing Technique\"?\nMorgan:\nThe spirit of that nurse was inside of Mystic Maya's body. I used the technique to send the nurse's spirit back to the other world.\nPhoenix:\n(I wonder if this kind of testimony is even admissible in a court of law...)\nChanneling Chamber\nPhoenix:\nBy the way, what is this room exactly...?\nMorgan:\nThe Channeling Chamber? This room was created for the sole purpose of preventing such a tragedy as yesterday.\nPhoenix:\nWhat do you mean?\nMorgan:\nSometimes, when an inexperienced medium calls an especially strong spirit, that spirit may become violent and revolt, as you witnessed yesterday.\nPhoenix:\nRevolt? But how?\nMorgan:\nWhen a spirit enters a medium's body, she loses her will and her self steps aside. To put it another way, the spirit is borrowing the medium's body, good sir.\nPhoenix:\nBut isn't that extremely dangerous?\nMorgan:\nAn experienced medium has little problem controlling a spirit.\nPhoenix:\nBut Maya... I mean, Mystic Maya... That was her first channeling...\nMorgan:\nAnd that was why I insisted on locking the door. However, I never thought that would be calling danger upon the client himself... I am grateful that one of our heirlooms was not damaged in this horrible incident.\nPhoenix:\nAnd that would be...? (Changed from [And that is...?] in the original release)\nMorgan:\nThat folding screen there. It is the Kurain Sacred Writings. (Changed from [It is that folding screen there. It is the Kurain Sacred Writings.] in the original release) Along with the Kurain Sacred Urn, they are this village's most treasured possessions. If I ever found out that something had happened to either one... Oh, the inhumanity...\nPhoenix:\n(Odd for her to be worrying about the folding screen at a time like this... I guess this isn't just some dilapidated old screen after all...)\nPearl\nPhoenix:\nSo... How is Pearl today...?\nMorgan:\nMr. Wright.\nPhoenix:\nY-Yes?\nMorgan:\nIn this world, Pearl is my most treasured possession. When compared to even Mystic Maya, Pearl has the spiritual power to become a Master.\nPhoenix:\nTh-That's very impressive.\nMorgan:\nUntil now, the women of the branch family have thought themselves to be inferior. .. But. Pearl is different! Her spiritual strength is so great; even greater than some of the main family! Yes, Pearl is a channeling prodigy and is the pride of the branch family!\nPhoenix:\n(Wow... She's really fired up now...)\nMorgan:\nIn any case... Our world is so different from yours, perhaps it is best for you to quit, good sir.\nPhoenix:\n\"Quit\"? Quit what?\nPresent\nMaya's Magatama\nMorgan:\n...Oh my!\nPhoenix:\nWh-What is it?\nMorgan:\nThat... That is Mystic Maya's Magatama. Why would you have this in your possession!?\nPhoenix:\nI-I'm sorry!\nMorgan:\nReturn it to Mystic Maya at once!\nPhoenix:\nY-Yes, madam! (Why did I feel like I was being scolded by my own mother just now...?)\nFolding Screen\nMorgan:\nAh, so even someone such as yourself can take interest in something like this. This is the Kurain Channeling Technique Sacred Writings. There are 6 panels in all.\nPhoenix:\nI see... But that's not what caught my eye. You see this hole here...?\nMorgan:\nIt is an old screen, you see. It is only logical that perhaps a bug or worm of some sort is the culprit.\nPhoenix:\n(Even though this looks nothing like the eating patterns of any bug I know...)\nMaya Fey profile\nMorgan:\nI can hardly believe Mystic Maya has become like this. Directly influenced by the likes of you, and becoming caught up in a situation such as this...\nPhoenix:\nI'm sorry... (...Hey, hold on! How is all this MY fault!?)\nMorgan:\nI told her so many times, as I have also told Pearl, \"Do not associate with strange old men you don't know\".\nPhoenix:\n(Well, that shouldn't apply to me then, especially since I'm hardly an \"old man\" yet!!)\nTurner Grey profile\nMorgan:\nThat doctor was one of those people. Those who intend harm upon the spirits receive harm in return; it's karma at work. It seems that he was the one to take the nurse's life, wouldn't you agree?\nPhoenix:\n(I guess that's possible...)\nPearl Fey profile\nMorgan:\nGood sir!\nPhoenix:\nY...Yes?\nMorgan:\nWhen did you take this picture!? This is one of those... what are they called...? Those... \"hidden camera\" pictures!\nPhoenix:\nN-No!! It's not one of those at all!!\nMorgan:\nSuch an unforgivable offense! You will hand it over to me!\nPhoenix:\nN-No! I won't! (If I ever want to talk about Pearl again, I should be much more careful...)\nMorgan Fey profile\nMorgan:\nIt shows the same face as the one I see in the mirror every day.\nPhoenix:\nAnd? Anything else?\nMorgan:\nNo. That is all.\nPhoenix:\n(Why in the world did I bother to show this to her!?)\nAny other evidence\nMorgan:\nI will be leaving shortly to meet with Mystic Maya. I simply do not have the time to look at such trivial matters.\nAny other profile\nMorgan:\nWe usually do not welcome strangers into our village as they disturb the aura here. Especially people like you, good sir.\nPhoenix:\nH-Hey, what do you mean, \"especially people like me?\"\nMorgan:\nYou selfishly make Mystic Maya help you with your work... You should be thankful I have not taken your life for such a disrespectful act.\nPhoenix:\nY-Yes, madam...\nMorgan:\nAnd even more importantly, remember that if anything were to happen to Pearl...\nPhoenix:\n(What is that supposed to mean!?)\nAfter clearing all Talk options and examining folding screen:\nMorgan:\nWell, then, I do believe it is time for me to take my leave.\nPhoenix:\nAlright. Please tell Maya I said hi.\nMorgan:\nWhat was that!?\nPhoenix:\nUh, I mean, Mystic Maya.\nMorgan:\nI will tell her.\nPhoenix:\n(...*sigh*)\nJune 20Fey ManorWinding Way\nPhoenix:\n(Little Pearl isn't here today... Maybe she's at school?)\nJune 20Fey ManorSide Room\nIni:\nOh, hey! Like, you're that guy from yesterday... The, uh, dentist guy...\nPhoenix:\nNo, no, I'm a lawyer.\nIni:\nThat's right! Um... Mr. Smith, Esquire.\nPhoenix:\n...That's \"Wright\". Wait, I mean, you're wrong. My name is \"Wright\".\nIni:\n\"Smith\", \"Wright\"... Well, I got, like, three letters, at least.\nPhoenix:\n(I don't think she gets the point...) Anyway, why are you here?\nIni:\nSo, like, I study this thing called \"parapsychology\" at this college and...\nPhoenix:\nUm, you told me about that yesterday. The sesame allergy, too. What I'd really like to know is why you're still here today?\nIni:\nOh! So, like, that's what you meant! Like, you shoulda been more, like, clear about it!\nPhoenix:\nS-Sorry. My bad.\nIni:\nNo, it's OK. Like, it's really...\nPhoenix:\n...\nIni:\n...?\nPhoenix:\n...That's it? Why'd you stop mid-sentence!?\nIni:\nDid I? ...So, like... what was I talking about again...?\nPhoenix:\n... (If Lotta ever wanted another \"genuine mysterious phenomenon\", it's right here.)\nExamine\nWooden bear sculpture\nPhoenix:\nIt's a decorative wooden bear sculpture. There's a plate attached to the base. \"Kurain Village - The Heart of Channeling\" What the!? It's a souvenir.\nIni:\nIsn't it cuuuuute? I, like, totally bought that!\nPhoenix:\nAh... so it's yours, huh?\nIni:\nYeah. So, like, this village is really famous for, like, channeling and bears.\nPhoenix:\nHeh. (...Wait. Famous for bears!?)\nIni:\nBut it's, like, OK. If you ever, like, see a bear, you just play dead, and they, like, leave you alone.\nPhoenix:\nI-Is that right?\nIni:\nYeah. Cause, like, fighting back is totally of no use.\nPhoenix:\n(Has she actually tried to fight one!?)\nYellow box\nPhoenix:\nHmm, now where did this box come from? I'm sure this wasn't here last night. It looks like a box for storing clothes... But it's pretty big for just clothes... It's mostly empty, but a few folded pieces of channeling costumes sit at the bottom.\nTalk\nIni Miney\nPhoenix:\nSo? Why are you still here today?\nIni:\nLike, there's so much for me to, like, study here!\nPhoenix:\nLike what?\nIni:\nLike, the medium's training, or like, how they inherit their spiritual power.\nPhoenix:\n(I suppose... This village is the real thing, after all.)\nIni:\nSo, like, I asked if I could stay here for, like, a little longer.\nPhoenix:\n(She sure seems like the care-free type, at least, on the surface...)\nWhat happened\nPhoenix:\nHave you heard about the murder?\nIni:\nIt's, like, totally scary.\nPhoenix:\n(...she says, with a silly smile plastered on her face...) ...So do you know anything about it that might help?\nIni:\n...\nPhoenix:\n(Somehow, I don't think she has a grip on reality, let alone what's going on here.)\nThe victim\nPhoenix:\nAbout the victim, Dr. Grey...\nIni:\nI don't know who you're talking about. ...Like... Wait, I think you asked about him, like, yesterday, too...\nPhoenix:\n(That's right... Her reaction yesterday when I asked was...)\nPhoenix:\nYou and Dr. Grey knew each other, right?\nIni:\n...! I don't know any Dr. Grey!\nPhoenix:\nOh really...? Then what was all that talk about him earlier? (Changed from [That's not exactly what Dr. Grey said...] in the original release)\nIni:\nHuh!? ...Well, uh... Like, a long, long time ago... I was, like, a patient, yeah.\nPhoenix:\n(OK, she is definitely hiding something from me...)\nIni:\n...Like, is something wrong?\nPresent\nAttorney's Badge\nPhoenix:\nWould you take a look at this?\nIni:\nHey! It's, like, one of those little badges people in Congress all wear...\nPhoenix:\nNo, no, no. I'm a lawyer. L-A-W-Y-E-R!!\nIni:\n...? Like, so is that what you are?\nMaya's Magatama\nIni:\nWow! It's a Magatama! Aww, you shouldn't have!\nPhoenix:\nIt's so totally not for you!\nIni:\nHey! Like, it's not nice to freak me out like that!\nPhoenix:\n(That should be my line...)\nMaya Fey profile\nPhoenix:\nI wanted to ask you about this girl...\nIni:\nOh, that's, like, Maya Fey. She's, like, the Master's daughter.\nPhoenix:\nYou surprise me. You knew that?\nIni:\nWell, like, I totally know everyone related to the occult. Maya is, like, an idol among spirit mediums.\nPhoenix:\n(Maya an idol? I guess stranger things have happened.)\nMorgan Fey profile\nIni:\nThat's Morgan Fey. Like, she's been totally helpful.\nPhoenix:\n(Did she just bow to the picture...?)\nIni:\nSo what about her?\nPhoenix:\nOh, nothing in particular. I just wanted to know what you knew about her.\nIni:\nUm... Well, she's, like, a really good person.\nPhoenix:\nI see.\nIni:\nLike totally.\nPhoenix:\nOK. (This is going nowhere...)\nIni Miney profile\nIni:\nUm... This face... Like, I think I've seen it somewhere before...\nPhoenix:\nWhat!? ...Y-You're joking, right?\nIni:\nHa ha, like, of course I am, silly!\nPhoenix:\n(Oh, thank goodness...)\nAny other evidence\nIni:\nLike, I'm really sorry, but... And I know, like, you totally had your heart set on it, but I can't, like, take it.\nPhoenix:\n(Who said anything about giving this to you!?)\nAny other profile\nPhoenix:\nWhat do you know about this person...?\nIni:\nI'm, like, sorry, but it's totally, like, time for my nap...\nPhoenix:\n*yawn* (Ack! She's even got ME yawning!)\nIni:\nAnd I, like, totally don't care about that person anyway...\nAfter clearing all Talk options and examining folding screen in Fey Manor - Channeling Chamber, and clearing \"The victim\" Talk option in Fey Manor - Side Room:\nJune 20Fey ManorWinding Way\nPearl:\n...\nPhoenix:\nAck! Y-You surprised me!\nPearl:\n...\nPhoenix:\nAnd how are you today?\nPearl:\n...\nPhoenix:\n(Hmm... I guess she isn't open to friendly chatting... Huh? She's still holding something in her hand... ...It looks like the same thing she had yesterday...)\nTalk\nAny option\nPhoenix:\nUm...\nPearl:\nAaaah!\nPhoenix:\nH-Huh?? (If only I had something that would catch her interest. Maybe then she'd talk to me.)\nPresent\nMaya's Magatama\nLeads to:\n\"Oh yeah. Maya said to give this to you...\"\nAnything else\nPhoenix:\nCan you take a look at this? Please?\nPearl:\n...\nPhoenix:\n(Urk... She's really scrutinizing my face...)\nPearl:\n...\nPhoenix:\n(Th-That's enough already! I'm not that shifty-looking, am I!?)\nPhoenix:\nOh yeah. Maya said to give this to you...\nPearl:\n...\nPhoenix:\n(Ack! I'm in trouble now!! If Morgan sees us like this, I'll be the next one they're channeling...)\nPearl:\nTh-That's... That's Mystic Maya's...\nPhoenix:\n...Huh!? (Sh-She actually spoke!)\nPearl:\nWho are you...?\nPhoenix:\nI-I'm Phoenix Wright. I, uh, worked with Maya...\nPearl:\n...Y-You worked with Mystic Maya...? You... You're Mr. Nick, right?\nPhoenix:\n...Uh, excuse me? (I bet I know who she picked \"Nick\" up from...)\nPearl:\nI know who you are. You're... You're Mystic Maya's... \"special someone\"...\nPhoenix:\nWH-WH-WH-WHAT!?\nPearl:\nSo then... Of course! You're going to help Mystic Maya, aren't you? That's what you're going to do, right?\nPhoenix:\nW-Well, yeah... I will...\nPearl:\nOh wow... It's like a beautiful fairy tale! That earnest look shining brightly in your eyes... It must be true love...\nPhoenix:\n...Wh-What!? (Why am I being boiled into a bright red lobster by this little kid!?)\nPearl:\nI'm so jealous of Mystic Maya! Ah, what a wonderful relationship...\nPhoenix:\nW-Wait... I... uhh... I mean... We aren't... Things aren't like...\nPearl:\nHee hee, I can tell you're a good person. Alright, Mr. Nick! I may be small, but I'm going to help you in any way I can!\nTalk\nPearl\nPhoenix:\nPearl, are you friends with Maya?\nPearl:\nI feel very grateful to be friends with her... She's so great. I want to be like Mystic Maya when I grow up. I really look up to her.\nPhoenix:\nWow, I had no idea Maya was so... revered.\nPearl:\nUsually when people don't use Mystic Maya's title, I get mad.\nPhoenix:\nO-Oh, sorry.\nPearl:\nBut if it's you, Mr. Nick, then it's OK. Because... Because... you're \"special\" to her.\nPhoenix:\n(Where in the world did she get an idea like that??)\nPearl:\nBy the way... this may be rude, but which channeling school are you from?\nPhoenix:\nWhich channeling school?\nPearl:\nYes. For example, I study the Kurain technique.\nPhoenix:\n... Ah, I get it! No, no, no. I'm a lawyer. A lawyer.\nPearl:\n...Law...yer?\nPhoenix:\nYup.\nPearl:\n...Is that related to spirit mediums in any way...?\nPhoenix:\n(Um... None that I know of...) Wait, are you telling me you don't know what a lawyer is?\nPearl:\nI'm sorry, but I have no idea.\nPhoenix:\n(Maya did say Pearl doesn't know much about the outside world...)\nThe item in your hand\nPhoenix:\nSo what's that you've got there, Pearl?\nPearl:\nOh, this? I found it yesterday.\nPhoenix:\nHmm...\nPearl:\nIf you want it, I can give it to you.\nAccept it\nLeads to:\n\"Alright, well, if you really want to give it to me...\"\nDon't accept it\nPhoenix:\nI can't take something this important from you, Pearl.\nPearl:\nOh...\nPhoenix:\n(But I'm sure I've seen that key somewhere before... ...and it might be an important clue later on...)\nLeads to:\n\"Alright, well, if you really want to give it to me...\"\nPhoenix:\nAlright, well, if you really want to give it to me...\nPearl:\nHee hee. You look like a child at a toy store, Mr. Nick!\nPhoenix:\n(...She not only speaks in a refined manner, but laughs in one, too!)\nBlack Key added to the Court Record.\nPresent\nMaya's Magatama\nPhoenix:\nSo this is...\nPearl:\nThat is Mystic Maya's Magatama. It's one of the most important heirlooms of Kurain Village. Please make sure to take good care of it.\nPhoenix:\nY-Yeah, I will. (Is it really OK for me to have such a priceless object?)\nFolding Screen\nPearl:\nAre you interested in Kurain's traditional things too, Mr. Nick? The Kurain Sacred Writings are on this folding screen.\nPhoenix:\nOh? Is that what's written on it? Actually, what caught my eye was this \"hole\" in it...\nPearl:\nIt's a very old screen, so I think that maybe bugs made it by eating through it.\nPhoenix:\n(...It sure doesn't look like something bugs can make...)\nBlack Key\nPhoenix:\nAbout this key...\nPearl:\nI found it while I was playing in the garden yesterday.\nPhoenix:\nI've seen it before too, you know?\nPearl:\n...? Really?\nMaya Fey profile\nPearl:\nI look up to Mystic Maya a lot. She's my role model. She's so smart, and pretty, and kind, and loving. She's always cheerful, never gets sick, isn't picky, and has good sleeping habits. She always wakes up before me, and always eats breakfast before me too. And she has you; such a wonderful person with whom she can share a lo-\nPhoenix:\nAck! OK, OK! I get the idea! (She really thinks the world of Maya, doesn't she?)\nPearl Fey profile\nPearl:\nTo tell you the truth, I really want to grow my hair out, just like Mystic Maya. But my mother won't let me.\nPhoenix:\nYour hair now suits you quite well, though, I think.\nPearl:\nR-Really? Th-Thank you! *fidget, fidget*\nPhoenix:\n*fidget, fidget*\nMorgan Fey profile\nPearl:\nOh, it's my mother! She takes really good care of me and loves me very much. She says I'm the \"pride of the branch family\"... But I don't know what that means.\nPhoenix:\n(\"Branch family\"... That concept is probably still too hard for little Pearl...)\nAny other evidence\nPearl:\nI'm sure it is helpful to you in some way, but I'm still in training, so I don't know anything about it. I'm really, deeply sorry.\nPhoenix:\nNo, no, no, it's OK. I shouldn't have shown you something so trivial anyway. I'm very sorry. (This feels so weird, talking to a kid like this...)\nAny other profile\nPearl:\nHmm, I'm sorry I don't know who this person is.\nPhoenix:\nI guess that makes sense... You've never left Kurain village, after all.\nPearl:\nI'm really sorry, Mr. Nick. I just don't really know anyone outside the village.\nAfter clearing all Talk options:\nPearl:\nUm, Mr. Nick...?\nPhoenix:\nYes, Pearls? I can call you that, right? You're too cute to just call you Pearl.\nPearl:\nSure, Mr. Nick... Umm... Are you sure it's OK for me to have this Magatama?\nPhoenix:\nYeah, it's OK. I was told to give it to you.\nPearl:\nBut, I can't accept something like this! ...All I really should do is charge this Magatama with spiritual energy...\nPhoenix:\nSpiritual energy?\nPearl:\nPlease take this. I'm sure it will be helpful.\nPhoenix:\n...What do you mean?\nPearl:\nIt will let you see people's secrets.\nPhoenix:\nSee people's... secrets...?\nPearl:\nYes. ...If it's alright with you, I would like to accompany you for a little while. I can explain the Magatama's power to you when we meet someone hiding a secret.\nJune 20Fey ManorMeditation Room\nGumshoe:\nHey, it's you, pal! So you're going to be her lawyer, I bet.\nPhoenix:\nYes.\nGumshoe:\nOh... I really feel bad for you, pal. Just this once, I wish I could be on your side.\nPhoenix:\nDetective Gumshoe...\nGumshoe:\nYeah, but I shouldn't be saying that kind of stuff to you. Hey! You're a cute kid.\nPearl:\n...\nGumshoe:\nHa ha ha. I'm not scary. Honest!\nPhoenix:\n(Wow, I never knew Gumshoe liked kids...)\nGumshoe:\nH-Hey! I know! I'll show you something cool! How's this? It's a real, genuine pistol...\nPhoenix:\nD-Detective Gumshoe!! What are you doing showing her something that dangerous!\nGumshoe:\nOh, sorry...\nTalk\nMaya's guilt\nPhoenix:\nWhat about Maya and the charges against her?\nGumshoe:\nI don't think you can win, pal. If you're talking about proof, we've got a few pieces.\nPhoenix:\nYou've got proof...?\nGumshoe:\nYeah, pal. That puffy-haired photographer's going to testify tomorrow.\nPhoenix:\n(He must be talking about Lotta. Actually... speaking of Lotta...)\nLotta:\nI took some hot pictures earlier!\nPhoenix:\nHuh?\nLotta:\nRemember!? I took some pictures at the murder scene inside!\nPhoenix:\n(Lotta's \"hot pictures\"... I wonder what her camera captured...?)\nGumshoe:\n...Besides, you must've realized by now, pal. There's no way anyone other than Maya Fey could've done it.\nPhoenix:\n(...!)\nPearl:\n...\nPhoenix:\n(What am I supposed to say to Pearls now...?)\nThe victim\nPhoenix:\nAbout Dr. Grey...\nGumshoe:\nThe victim wasn't super famous, but people still knew who he was. His face was all over those tabloid shows last year.\nPhoenix:\nYeah, I know.\nGumshoe:\nI was looking through some newspapers from last year, and... ... Huh? I could've sworn I had... I cut an article out, but I guess I must've lost it...\nPhoenix:\n(He's searching through his pockets... And boy, are those big...)\nGumshoe:\nHmm... It looked really interesting, too. Hey, do you have a copy, pal?\nPhoenix:\n(A copy of that article...? I think Dr. Grey might have brought a copy to the office when he came by...)\nTomorrow's trial\nPhoenix:\nAbout Maya's trial tomorrow...\nGumshoe:\nI've got two pieces of news for you, pal.\nPhoenix:\nTwo?\nGumshoe:\nYeah. \"Bad news\" and \"even worse news.\" So which do you want to hear first?\nPhoenix:\n...I don't really care... It doesn't change the fact that I'm not going to like it.\nGumshoe:\nAlright, pal. Well, the prosecutor for the trial is Prosecutor von Karma.\nPhoenix:\nWHAT!? Von Karma!?\nPhoenix:\n(Manfred von Karma... He was an awe-inspiring veteran prosecutor. He never lost a case in the 40 years of his career, and he raised a fearsome disciple. The horrible aftertaste of the evil he force-fed me is something I'll never forget.)\nPhoenix:\n... Wait a sec. But didn't Von Karma stand trial and...\nGumshoe:\nThat's where the other piece of bad news comes in... The Von Karma you're facing tomorrow is actually his successor...\nPhoenix:\nSuccessor...?\nSuccessor (appears after \"Tomorrow's trial\")\nPhoenix:\nSo, um... Who is this \"successor\" to Von Karma?\nGumshoe:\nLiterally, pal, it's Prosecutor von Karma's kid. His kid became a prosecutor real young... like 13, and hasn't lost a trial since. That's what they call a \"prodigy,\" pal.\nPhoenix:\nHmm... Kid, huh... ... W-W-Wait a sec! Th-Th-Thirteen!? The kid became a prosecutor at the age of THIRTEEN!? I mean, a prodigy like that... I would have heard something about...\nGumshoe:\nOh, no, no. The kid was born and raised in Germany, pal. That country's got a lot of stuff and is a great place to develop a person's talents.\nPhoenix:\n(Germany, huh? That's probably why I've never heard of this person. Ugh... Still, all it takes is someone mentioning the name \"Von Karma\", and I get terrible flashbacks to that case. Stop it! Get a grip on yourself, Phoenix! (Changed from [Stop it! Get over it, Phoenix!] in the original release) None of that matters anymore... now that he's gone... (Changed from [That person is already gone...] in the original release))\nPresent\nAttorney's Badge\nPhoenix:\nHey, look. It's my attorney's badge.\nGumshoe:\nHa ha. Good one, pal. You're always good for a laugh with your little badge. But a real man... A real man has a police badge.\nPearl:\nUh, um... Mr. Nick?\nPhoenix:\nWhat is it, Pearls?\nPearl:\nI was wondering if I could see it, too?\nPhoenix:\nAh, no, it's OK. It's not that important anyway.\nMaya's Magatama\nPhoenix:\nWhat do you think about this...?\nGumshoe:\nHey, that's a pretty nice-looking brooch! You should stop wearing that ugly old attorney's badge, and start wearing that, pal.\nPearl:\nHee, hee. That detective is so nice! Aren't you happy, Mr. Nick?\nPhoenix:\n(Happy?... About what?)\nNewspaper Clipping 1\nPhoenix:\nUm, Dr. Grey brought this over to my office the other day, and...\nGumshoe:\nHey! It's that news story! The one about the malpractice suit!\nPhoenix:\nFourteen patients died and it caused a huge stink.\nGumshoe:\nYeah, but that's not all, pal. Things only got worse after that.\nPhoenix:\nYou mean the car accident the nurse died in?\nGumshoe:\n...Hmm... Oh, here we go. I brought my own clipping with me today. Here, pal, this is for you.\nPhoenix:\nAlright. Thanks.\nNewspaper Clipping 2 added to the Court Record.\nNewspaper Clipping 1 (subsequent times)\nGumshoe:\nThe nurse that killed the patients ended up getting killed in an accident. Dr. Grey wound up on a lot of tabloid shows because of that. Now, there was a smart man. I'm sure that was a great way to advertise for his clinic.\nPhoenix:\n(Uh, huh. Scaring people off is always the best way to get more patients.)\nBlack Key\nPhoenix:\nSo about this key...\nGumshoe:\nHey, is that your house key or something, pal?\nPhoenix:\nCome on, does this look like a house key to you?\nGumshoe:\nThen what's it for?\nPhoenix:\nIt's... ... (Hmm, actually, I should probably keep that a secret...) It's my bicycle key.\nGumshoe:\nOh. Nothing special, huh?\nMaya Fey profile\nGumshoe:\nI'm sorry things had to turn out this way, pal.\nPhoenix:\nIt's too early to give up! No one's proven her guilty of anything, yet!\nGumshoe:\nLook, even if there were a zillion of you, pal, this is a case you... *sigh*\nPhoenix:\n(Now why is he sighing?)\nPearl Fey profile\nGumshoe:\nOh, so that's little Pearl.\nPhoenix:\nDo you know her?\nGumshoe:\nOnly that Ms. Fey was looking for her earlier. Something about being worried that she'll end up talking to the weird guy. So, you have any idea who this \"weird guy\" is, pal?\nPhoenix:\n...Nope. Not a clue.\nMorgan Fey profile\nGumshoe:\nThat's Maya's aunt, right? I got to eat one of her giant strawberry desserts earlier. It was really good!\nPhoenix:\n(Aw, I didn't get to eat one yet...)\nDick Gumshoe profile\nGumshoe:\nBoy do I look scary in this picture. I guess if I want people to stop thinking cops are scary, I have to change myself. Gotta smile, gotta smile!\nPhoenix:\n(There's that classic Gumshoe goofy smile again...)\nAny other evidence\nGumshoe:\nOoh, I'd better shut my mouth.\nPhoenix:\nUh, what?\nGumshoe:\nI'm not gonna give you any information about evidence, pal.\nPhoenix:\nOh.\nAny other profile\nGumshoe:\nI don't have anything to tell you about this one, pal.\nPhoenix:\nYou don't have to be so mean about it.\nGumshoe:\nNot. A. Word.\nPearl:\n...\nGumshoe:\nH-H-Hey! Don't look at me like that!\nPhoenix:\n(That girl has one intense stare... *gulp*)\nJune 20Fey ManorSide Room\nPhoenix:\nHello again. We seem to be seeing a lot of each other today.\nIni:\nAww, she's, like, tooootally cute! Is she, like, your daughter?\nPhoenix:\nW-What!? NO! (How old do you think I am!?)\nTalk\nThe victim\nPhoenix:\nI want to ask you about the victim, Dr. Grey.\nIni:\nI, like, totally don't know him.\n1 PSYCHE-LOCK\nPhoenix:\nAaack! What is that!?\nIni:\n...?\nPearl:\nYou can see it, can't you, Mr. Nick? You can see the \"lock\" on that person's heart.\nPhoenix:\nHuh, what...?\nPearl:\nThis is the power of the Magatama. Only you can see these \"Psyche-Locks\", Mr. Nick.\nPhoenix:\n(Psyche-Locks, huh...)\nPearl:\nThe more someone wants to hide their secret, the more locks you will see. If it's only one, I think you can easily unlock it.\nPhoenix:\n\"Unlock\"...? But how?\nPearl:\nPlease use Mystic Maya's Magatama on this person, and let's remove the lock.\nPhoenix:\n(I have no idea what she's talking about, but... Guess I'll give it a try.)\nPearl:\nYou must be careful, though, Mr. Nick. If you make a mistake, it will hurt you. If you don't think you have the proof you need, you must have the courage to stop.\nPhoenix:\n(Well, I've got to start somewhere. Let's give this Psyche-Lock thing a try.)\nThe victim (subsequent times)\nPhoenix:\nIim going to ask you again. Did you know Dr. Grey?\nIni:\nI totally don't know that guy. Like, you're totally more presistent than a roach!\n1 PSYCHE-LOCK\nPhoenix:\n(This girl is hiding something! I'm sure of it! I guess I have no choice but to remove this lock. Alright, so first, I have to use Maya's Magatama...)\nThe victim (after breaking Psyche-Lock)\nLeads to:\n\"Please, tell me all you know about Dr. Grey.\"\nPresent\nMaya's Magatama\nPhoenix:\n1 PSYCHE-LOCK\n-- The Victim --\nPhoenix:\nIni Miney. I believe you do know who Dr. Grey is!\nIni:\nI told you! Like, how many times do I, like, have to repeat myself? If you're, like, so totally sure, then where's, like, your proof?\nPhoenix:\nWhile it may be possible that you never actually met Dr. Grey in person, I do believe you might have at least, indirectly known of him.\nIni:\nLike, what do you mean, like, \"indirectly\"...?\nPhoenix:\n(I should try to show that the possibility existed for now...) (Hmm, so, something that shows a possible connection between Ini and Dr. Grey...)\nPresent Newspaper Clipping 2\nPhoenix:\nLeads to:\n\"Take a look at this newspaper clipping.\"\nPresent anything else\nPhoenix:\nPhoenix:\nHere is your proof!\nIni:\nLike, what is that...?\nPhoenix:\nOuch... I guess it doesn't have anything to do with it, huh? (Pearls did warn me... \"If you make a mistake, it will hurt you,\" she said. If I don't have enough evidence, I should probably \"stop\". I should take another look at the Court Record and think it through one more time.)\nLeads back to:\n\"While it may be possible that you never actually met Dr. Grey in person,\"\nPhoenix:\nTake a look at this newspaper clipping.\nIni:\nLike, what is it? ... A story about an accident?\nPhoenix:\nPlease read the victim's name.\nIni:\nUm...\"Mimi Miney\"...\nPhoenix:\n\"Miney\" is a pretty rare last name, wouldn't you say? Ms. Mimi Miney wouldn't happen to be a relative of yours, would she?\nIni:\n...! So you noticed. Sh-She was my older sister.\nPhoenix:\nI'm sorry about your loss... Your sister... Was she a nurse... Perhaps at Dr. Grey's surgical clinic?\nIni:\n...!\nPhoenix:\nGrey Surgical Clinic... I don't think I need to tell you that the clinic was run by the victim, Dr. Turner Grey. Which is how you knew of Dr. Grey; you knew him through your sister!\n1 LOCK BROKEN\nUnlock Successful\nPhoenix:\nPlease, tell me all you know about Dr. Grey.\nIni:\nMy... My sister's name was Mimi Miney. She was, like, a nurse at Dr. Grey's clinic.\nPhoenix:\n(That's what I thought...)\nIni:\nI heard that, like, Dr. Grey was really tough on people. Like, a total slave driver. My sis was, like, always coming home totally wiped out 'cause she was overworked.\nPhoenix:\nWiped out? So is that why she fell asleep at the wheel?\nIni:\nThat guy, like, drove my sis so hard, so, like, that's why the accident happened.\nPhoenix:\nThe one where 14 patients died from malpractice?\nIni:\nYeah, like, I think that was the doctor's fault, too. My sis was pushed by, like, everyone's expectations and, like, her duties and stuff. And that pushed her to her death.\nPhoenix:\nOh... I'm sorry...\nIni:\nSo, like, are we done? I've, like, already told my story to, like, everyone...\nPearl:\nDo you understand now, Mr. Nick? This is how a Psyche-Lock works.\nPhoenix:\n...Well, I don't plan to pry into people's hearts unless I absolutely need to...\nPearl:\nThe lock this time was pretty easy, but... you might meet people who aren't as willing to give in later on. If you don't have enough proof, be careful and know when to stop trying.\nAfter clearing \"Successor\" Talk option in Fey Manor - Meditation Room and clearing \"The victim\" Talk option upon breaking Psyche-Lock in Fey Manor - Side Room:\nJune 20Kurain Village\nPearl:\nMr. Nick.\nPhoenix:\nHmm? What's wrong?\nPearl:\nI have never left Kurain Village.\nPhoenix:\nR-Really? Wow, that's, um, pretty amazing...\nPearl:\nYou are going to meet with Mystic Maya... aren't you? Please tell her I said hi.\nPhoenix:\nHey, wait! (She ran off... Again. Well, I know Ini's secret now, but... I still don't have any idea how I'm going to save Maya. I don't even know if I should go in there with a smile or a straight face... *sigh*)\nJune 20Detention CenterVisitor's Room\nPhoenix:\n(What am I supposed to do!? I'm almost out of time! Can I really do anything? Can I really save her...?)\n???:\nSorry to keep you waiting.\nPhoenix:\n(Huh? Must be Maya...)\n???:\nIt's been a long time, hasn't it, Phoenix?\nPhoenix:\n...! (That voice...) M-Mia!\nMia:\nEven without me being here, it looks like you've learned to stand on your own.\nPhoenix:\n(Mia... She's Maya's older sister, and my mentor. She was a top-notch defense lawyer, but a certain case forced her into \"retirement\". But... whenever I'm in trouble, she comes to help, just like this. Her spirit comes back from the other world and borrows Maya's body for a bit...)\nMia:\nPhoenix, you can't make that kind of face in front of your client.\nPhoenix:\n...!\nMia:\nA lawyer is someone who smiles no matter how bad it gets, and especially when it's bad.\nPhoenix:\nMia...\nMia:\nYou can't smile at the end if you haven't been smiling the whole way there. In any case, the face you're making now is no face to show a client, Phoenix.\nPhoenix:\nB-But!\nMia:\nSo, tell me all about it. I'm going to guess that my sister is in a lot of trouble again...\nPhoenix:\n(I told her everything about what had happened in the last two days. Mia closed her eyes, deep in thought, while she listened...)\nMia:\n...I see...\nPhoenix:\nMia... What am I supposed to do?\nMia:\n... It's pretty clear what a good lawyer does in this situation.\nPhoenix:\nA-And that is!? Tell me, please!\nMia:\nBelieve in your convictions. And fight for the complete acquittal of your client.\nTalk\nNot guilty\nPhoenix:\nYou think Maya's not guilty!? How can you be so sure!?\nMia:\nI know she is. And I'll give you a hint as to why.\nPhoenix:\nY-Yes?\nMia:\nMediums can't have dreams.\nPhoenix:\nCan't have \"dreams\"...?\nMia:\nFrom what you told me, it sounds like Maya was having a dream while channeling.\nPhoenix:\nYeah... She said she dream that she had died and had been buried in the ground.\nMia:\nBut that is impossible. You've heard it from her, I'm sure. When a medium channels, her own spirit disappears. Which means that it's impossible for her to dream during that time.\nPhoenix:\n...! Then... What does this mean!?\nMia:\nI think it's safe to bet that Maya was set-up.\nPhoenix:\nA set-up!?\nMia:\nIt's up to you to blow the lid on this case tomorrow and show how she was set-up.\nEvidence?\nPhoenix:\nHow am I supposed to prove her innocence when I have nothing to go on!?\nMia:\nIf you're looking for a clue, it's already in your hands.\nPhoenix:\nI-It is!?\nMia:\nJust as it sounds, Phoenix, you already hold the \"key\".\nPhoenix:\n(R-Really...?)\nMia:\nCome on, show me the \"key\" to this case.\nPhoenix:\n(The \"key\", huh? Alright, I'll show it to her; the \"key\" I hold.)\nPresent\nAttorney's Badge\nPhoenix:\nMia...\nMia:\n*chuckle* Wow, this badge brings back a lot of memories, doesn't it...? I would love to stand with you at the defense table one more time.\nPhoenix:\n(Mia...)\nMaya's Magatama\nMia:\nThis is... Maya's Magatama, isn't it? Why do you have it...?\nPhoenix:\nMaya gave it to me, but...\nMia:\nI see... ... This is something very important to me. Take good care of it, OK?\nPhoenix:\n(She looks at it with such a soft look in her eyes...)\nBlack Key\nPhoenix:\nMia, have you seen this key before?\nMia:\nAhh, the key... It's literally, the key to understanding everything that's happened in this case.\nPhoenix:\nThis key?\nMia:\nPhoenix, listen. Right now, that key is sitting in your hand. However, it shouldn't be. ... It contradicts the \"facts\".\nPhoenix:\n(What does she mean...?)\nMia:\nI'm certain this key will be the piece of evidence that makes your case tomorrow.\nMaya Fey profile\nMia:\nI can't see Maya... when I'm in her body like this... But I can tell. She's very lonely and sad. Take good care of her, will you, Phoenix?\nPhoenix:\nI-I will...\nPearl Fey profile\nMia:\nPearly! She's really grown up... I left Kurain Village a long time ago. She probably doesn't remember a thing about me by now...\nMorgan Fey profile\nMia:\nI'm afraid I might have caused Aunt Morgan a lot of stress. When I left Kurain, I left Maya in my aunt's care. And now something like this happens...\nDick Gumshoe profile\nMia:\nI've seen this man somewhere before... He had a strange name... and I'm almost sure I've questioned him before. I remember him making a show of confidence at first, but after five minutes, he breaks down and... ...you end up feeling bad for the poor guy...\nMia Fey profile\nMia:\nThat's right. I'm already dead. But I feel very grateful to have been born a Fey... so I can talk with you like this...\nAny other evidence\nPhoenix:\nCould you take a look at this?\nMia:\n...Do you have anything more useful? There's no time left. Try to show me something that will help you in tomorrow's trial.\nAny other profile\nMia:\nI'm sorry, but I don't remember who that is...\nAfter clearing all Talk options and presenting Black Key:\nMia:\n... ... You already know everything you need to know. You know what the \"key\" to this case is... That is enough...\nPhoenix:\nBut... But! How can I win tomorrow without knowing who the real murderer is!? Who... Who could have...?\nMia:\n...\nPhoenix:\n(I didn't know it at the time, (Changed from [At the time, I didn't know,] in the original release) but this day was going to end with a turn for the surprising...)\n3 PSYCHE-LOCKS\nPhoenix:\nM-Mia!? Wh-What...!?\nMia:\nWhat's wrong?\nPhoenix:\n(That's right. Only I can see the Psyche-Locks... Which means... Mia must know something about the real murderer! But for this to be something that she would hide under lock and key from even me... What in the world is going on!?)\nTo be continued.\nNothing to examine during investigation\nPhoenix:\nNo clues here.\nExit Magatama session\nPhoenix:\n(I don't think I have enough evidence yet... I should investigate and gather some more clues before I try again...)\nToo many errors during Magatama session\n...Mr. Nick... ...If you push yourself any more, your soul will shatter... ...Please calm down, collect your thoughts, and try again...\nPhoenix:\n(Nnrgh! I've made too many mistakes!)",
  "characters": [
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Maya Fey",
      "age": "18",
      "gender": "Female",
      "description1": "My assistant until a year ago. Now she's training to be a spirit medium.",
      "description2": "The defendant, and my client. Was arrested on suspicion of murder while channeling."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Dr. Turner Grey",
      "age": "35",
      "gender": "Male",
      "description1": "The director of the Grey Surgical Clinic where the malpractice incident occurred.",
      "description2": "Grey Surgical Clinic Director. Had a malpractice incident. Murdered during a channeling."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Pearl Fey",
      "age": "8",
      "gender": "Female",
      "description1": "Ran away as soon as she saw me. A girl who is Maya's little cousin.",
      "description2": "Maya's cousin. A channeling prodigy with intense spiritual power. Also the youngest."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Morgan Fey",
      "age": "??",
      "gender": "Female",
      "description1": "Maya's aunt. She has a strange, powerful aura about her.",
      "description2": "Maya's aunt. A member of the Fey clan branch family. She is the mother of Pearl."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Lotta Hart",
      "age": "23",
      "gender": "Female",
      "description1": "Claims to be an investigative photographer. She lives for the next big scoop."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Dick Gumshoe",
      "age": "31",
      "gender": "Male",
      "description1": "Detective at the local precinct. In charge of the initial investigation."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Ini Miney",
      "age": "21",
      "gender": "Female",
      "description1": "College student. A huge fan of the occult and is doing research in parapsychology.",
      "description2": "College student. Researching parapsychology. Older sister, Mimi, died in a car accident."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Mimi Miney",
      "age": "deceased",
      "gender": "Female",
      "description1": "Died in a car accident 1 year ago. Was Ini's older sister, nurse at Dr. Grey's clinic."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Mia Fey",
      "age": "deceased",
      "gender": "Female",
      "description1": "Maya's older sister. She was a top notch lawyer and my mentor and friend forever."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Franziska von Karma",
      "age": "18",
      "gender": "Female",
      "description1": "Became a prosecutor in Germany at age 13. A prodigy who has never known defeat."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Ami Fey",
      "age": "deceased",
      "gender": "Female",
      "description1": "Kurain Channeling Technique founder. Legend says her soul is sealed in the Sacred Urn."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Director Hotti (purported)",
      "age": "??",
      "gender": "Male",
      "description1": "A peculiar patient who claims to be Director Hotti. Seems to be extremely \"healthy\"."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "It's my all-important badge. It shows that I am a defense attorney."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Guidemap (Fey Manor)",
      "type": "Maps",
      "obtained": "Received from Dr. Grey.",
      "description1": "A diagram of Fey Manor. Meditation room to the south. Channeling chamber north of meditation room. Side room to the east, have to go through winding path from meditation room to get to side room."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Maya's Magatama",
      "type": "Other",
      "obtained": "Received from Maya Fey.",
      "description1": "Slightly translucent. It's small, but it has a deep, profound aura about it.",
      "description2": "Slightly translucent. It radiates softly with a mysterious light."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Newspaper Clipping 1",
      "type": "Evidence",
      "obtained": "Retrieved at the Wright & Co. Law Offices.",
      "description1": "One year ago on May 2nd, 14 patients died from malpractice at Grey Surgical Clinic."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Folding Screen",
      "type": "Evidence",
      "obtained": "Retrieved from the channeling chamber.",
      "description1": "About 8 inches off the ground is a small hole that looks like a bullet hole."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Black Key",
      "type": "Evidence",
      "obtained": "Received from Pearl Fey.",
      "description1": "An old steel key. A green jewel is set in the center of the key's grip."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Newspaper Clipping 2",
      "type": "Evidence",
      "obtained": "Received from Detective Gumshoe.  → Received from Director Hotti.",
      "description1": "Mimi Miney, nurse at Grey Surgical Clinic, died after falling asleep at the wheel.",
      "description2": "Articles about the car accident. This is a newspaper clipping about the death of Mimi Miney, the nurse who worked at Turner Grey's clinic. It reads how Mimi died as a result of her car crashing when she fell asleep at the wheel and Director Hotti fills in some further parts of the article later on. The content is as follows-Highway of Nightmares-May 24 - Late last night, two women's car crashed into a highway center divide. One of the women was not able to escape the flaming wreckage and died at the site. Ongoing investigation has revealed that the driver had fallen asleep at the wheel. -Ms. Ini Miney Holds Interview About Crash- I was like, really tired and I dropped off to sleep. Then there was this crash, and like, I woke up in a huge sea of flames. I was like, still half-asleep, but I opened the right door and like, got out. I don't, like, remember anything else. -Doctor Lurking in the Shadows? If Ms. Ini Miney is to be believed, the one driving the car was her sister, Mimi Miney. Mimi Miney was the nurse at Grey Surgical Clinic where 14 patients were accidentally overdosed to their death. Is this then, just a mere coincidence...? "
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Floor Plans (Crime Scene)",
      "type": "Maps",
      "obtained": "Submitted as evidence during the trial.",
      "description1": "A diagram of the Channeling Chamber. A four sectioned mat in front of a platform at the head."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Dr. Grey's Autopsy Report",
      "type": "Reports",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "After being stabbed in the chest, he was shot in the forehead at point-blank.",
      "description2": "Stabbed in chest then shot at point-blank. Gunpowder residue around bullet hole."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Pistol",
      "type": "Weapons",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Murder weapon. Was Grey's. Two shots fired. Bears Maya's and Grey's fingerprints."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Knife",
      "type": "Weapons",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Murder weapon. A small fruit knife. Belongs to the Fey's. Bears Maya's fingerprints."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Maya's Costume",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Clothes Maya was wearing at the time of the murder. There are blood splatters on it.",
      "description2": "Clothes Maya was wearing at the time of the murder. [caption] It is stained with blood splatter and a bullet hole is present in the sleeve. The robe is otherwise clean. It is purple in color."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Lotta's Photo 1",
      "type": "Photographs",
      "obtained": "Received from Lotta Hart.",
      "description1": "A picture taken at the murder scene. This is a photo taken by Lotta Hart of Maya Fey after they break into the Channeling Chamber when they hear a gunshot. Turner Grey is lying dead on the floor after being shot."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Lotta's Photo 2",
      "type": "Photographs",
      "obtained": "Submitted as evidence by Franziska von Karma.",
      "description1": "A picture taken at the murder scene. This is the second photo taken by Lotta Hart of Maya Fey after they break into the Channeling Chamber when they hear a gunshot. Turner Grey is lying dead on the floor after being shot behind her."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Sacred Urn",
      "type": "Other",
      "obtained": "Retrieved from the Winding Way.",
      "description1": "Ami Fey's spirit is sealed within. It's chipped and cracked all over.",
      "description2": "Broken by Pearl right before the murder. Under repair in the hallway until police came."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Cloth Scrap",
      "type": "Evidence",
      "obtained": "Retrieved from the Winding Way.",
      "description1": "Unburned remains found inside the garden incinerator. Small amount of blood is on it."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Pearl's Ball",
      "type": "Other",
      "obtained": "Retrieved from the Side Room.",
      "description1": "Pearl's favorite toy. She was playing with this at the time of the murder, it seems."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Clothing Box",
      "type": "Evidence",
      "obtained": "Retrieved from the Side Room.",
      "description1": "There is a hole that looks like a bullet hole about 8 inches off the ground."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "License Photo",
      "type": "Photographs",
      "obtained": "Received from Director Hotti.",
      "description1": "Ini's photo for her driver's license. Director Hotti's treasured possession."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "Reunion, and Turnabout\n\n\n\n\n\n\n\n\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 4June 21, 9:48 AMDistrict CourtDefendant Lobby No. 3Maya:\nWhaaaaaaaat!? Prosecutor von Karma!? You mean...?Phoenix:\nNo, I heard it's his successor this time...Maya:\nSuccessor...? ... Manfred von Karma... was a really sinister man. (Changed from [Manfred von Karma. He was a really sinister man.] in the original release) He pulled all sorts of nasty tricks; all so he could win.Phoenix:\n(He was a man obsessed with the word \"perfection\"... He had a perfect record... for forty long years. Who knows what sorts of dirty tricks he used to get each of those guilty verdicts? And now, his successor... I wonder what kind of person they will turn out to be...)Maya:\nIt's no good...Mystic Maya!!Maya:\nPearly! You showed up! Thanks for coming all this way!Pearl:\nI was really worried about you...Maya:\nHey, where's your mother? Didn't you two come together?Pearl:\nMother is watching over the trainees. She said they have training for two days straight with no breaks.Maya:\nHuh!? Then... Then... You came all by yourself?Pearl:\nYup! I snuck out of the manor and followed a map.Phoenix:\nDon't tell me you walked all the way here...Pearl:\nOf course not! ...I ran!Phoenix:\nThat's... I can't... Oh my... (If it takes two hours by train... Oh man...)Maya:\nPearly... What about the train?Pearl:\nHuh? What's a... \"tray-in\"?Phoenix:\n(I give up...)Pearl:\n...It's time, isn't it?Maya:\nUm... I'm really scared... What if Von Karma tries to do something to me? At least I know Mr. Edgeworth would be nicer to me than Von Karma!Pearl:\nMr. Eh-ji-werth? Who is that?Maya:\nUm, he's Nick's rival... Well, he's also a friend. I still remember him as though I'd seen him only yesterday. (Changed from [I still remember him as if I had just seen him only yesterday.] in the original release) Every trial was a scorchingly fierce battle until the very end. (Changed from [Every trial was a scorching fierce battle until the very end.] in the original release) It was always back and forth with them. But when you're rivals for life...Phoenix:\nMaya! Please don't mention that name ever again...Maya:\nHuh...? But why, Nick?Phoenix:\nI'm... I'm sorry, Maya. I forgot you don't know... He... He's... He's gone... And he's not coming back...Maya:\nWhaaaat!? W-W-Wait... Wait a second!! What's that supposed to mean!?Bailiff:\nCourt will commence shortly. Please proceed into the courtroom.Phoenix:\n... Let's go. Now's not the time to talk about that anyway.Maya:\nN...Nick...?June 21, 10:00 AMDistrict CourtCourtroom No. 2Judge:\nCourt is now in session for the trial of Maya Fey. Are the prosecution and the defense prepared????:\n...Phoenix:\n... (What is with this kid...?) (Changed from [... (What is with this girl...?)] in the original release)Judge:\n... *Ahem!* Mr. Wright!! Are you prepared!? (Changed from [*Ahem!* Mr. Wright!! Are you finally prepared!?] in the original release)Phoenix:\nHuh? A-Ah, yes, Your Honor. (Why does he always seem mad at me!?)???:\nMr. Phoenix Wright.Phoenix:\n...!???:\nYou must be a little shocked because I am a woman, correct?Phoenix:\n(...Hold on. So SHE'S the famed \"successor\" to Prosecutor von Karma...?) (Changed from [...Hold on. So this kid is the 'famed' Prosecutor von Karma...?] in the original release)von Karma:\nI am Franziska von Karma, the Prodigy.Phoenix:\nI... see...von Karma:\nI gave up a promising career in Germany and came to this country for one sole reason. Revenge.Phoenix:\nRevenge...? (Is this about her father, Manfred von Karma...?)Judge:\nUm... If it's something of a personal nature, I'm sure you can... Oww!von Karma:\nI'm talking. If you interrupt again, my whip will do the speaking for me.Phoenix:\n(Please speak with your mouth like a normal person... I beg of you...) Yeow!!von Karma:\nMake no mistake; I will defeat you! Prepare to go down, Mr. Phoenix Wright!Judge:\nProsecutor von Karma, your opening statement, please...von Karma:\nThose of Von Karma blood have only one fate. And that is \"perfection\". The defendant, Maya Fey, will find no escape from her guilt on my watch.Judge:\nV-Very well... What is the defense's position?Phoenix:\nYour Honor.Judge:\nDoes the defense wish to enter a plea of \"not guilty\"?Phoenix:\n...Yes.von Karma:\nFoolish fool who foolishly dreams of foolish dreams... Ten minutes. I give the defense ten minutes before it changes its plea. That's right. I'll have you running for the \"justified self-defense\" plea in no time.Phoenix:\n(\"Justified self-defense\"... A plea usually reserved for when a person unintentionally kills in defense of themself. (Changed from [A plea usually reserved for when a person unintentionally kills in defense of himself.] in the original release) We could very easily make a solid case that it was self-defense, but...) The defense stands by the plea of \"not guilty\", Your Honor! (Because to plead \"justified self-defense\" is to say you did kill someone.)von Karma:\nHow foolish. If that's how you want to play it, Mr. Phoenix Wright, then I shall now call the first witness.Phoenix:\n(She's just as scary as her father. Like father, like daughter I suppose.)von Karma:\nWitness, your name and occupation?Gumshoe:\nYes, sir! My name is Dick Gumshoe. I'm a detective at the local precinct. Aah!!von Karma:\nGet to the point already. Explain to the court the details of this murder.Gumshoe:\nY-Yes, sir! Um, if everyone would please look at this map. The Channeling Chamber has no windows and the door was locked shut. At the time of the murder, only the victim and the defendant were in the room.Judge:\nWhat were they doing in there?Gumshoe:\nUm... They... Well, they were channeling... a spirit... Sir.Judge:\nCh-Channeling a spirit??Phoenix:\n(That's quite the look of disbelief there, Your Honor...) (Changed from [The look of disbelief on the judge's face is...] in the original release)Gumshoe:\n*ahem* Anyway, a few minutes after the channeling started, gunshots were heard coming from inside the room, sir. A few of the witnesses broke the door down, and rushed into the room.Judge:\nAh, and that's when they found that the victim was already dead, correct? Hmm, I believe this is one of the most open and shut cases I have ever presided over.Floor Plans added to the Court Record.Judge:\nSo, how was the victim killed?Gumshoe:\nI was about to get to that...von Karma:\nStop wasting my time, then.Witness Testimony-- Cause of Death --Gumshoe:\nThe direct cause of death was a pistol shot to the forehead, sir.\nThe shot was fired from point-blank range.\nBut before the victim was shot, sir, he was stabbed in the chest.\nThe wound was very severe, but not enough to cause instantaneous death.\nThe murderer used the pistol to finish the victim off after the stabbing.Judge:\nHmm... So the victim was stabbed before being shot...Gumshoe:\nThis is the victim's autopsy report, sir.Autopsy Report added to the Court Record.Judge:\nThe court accepts it into evidence. Mr. Wright, you may question the witness.Cross ExaminationCross Examination-- Cause of Death --Gumshoe:\nThe direct cause of death was a pistol shot to the forehead, sir.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe murder weapon, Detective Gumshoe. Whose pistol was it?\nGumshoe:\nIt was the victim's.\nPhoenix:\nThe victim? Now, why would he have...\nvon Karma:\n\nvon Karma:\n\"Why would he have a pistol?\" Who cares? The point that you are missing is whose fingerprints are on that pistol. If you're not already paying attention to that, then I suggest you start.\nJudge:\nFingerprints? There were fingerprints?\nGumshoe:\nAlong with the victim's, the defendant, Maya Fey's were also on the grip, sir.\nJudge:\nHmm. So the defendant's fingerprints were left on the murder weapon...\nPhoenix:\n(Argh...! I walked right into her hands there.) (Changed from [Hmm... I walked right into her hands there.] in the original release)Gumshoe:\nThe shot was fired from point-blank range.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nPoint blank, huh? So about how far away was it?\nGumshoe:\nIt was anywhere between 12 to 20 inches away.\nPhoenix:\nAnd how do you know he was shot at point blank?\nvon Karma:\nTsk, tsk, tsk. Mr. Phoenix Wright. I grow tired of the foolish foolery of the foolish fools of this foolish country...\nPhoenix:\nE-Excuse me!?\nvon Karma:\nGunpowder burn.\nPhoenix:\n...Gunpowder burn?\nvon Karma:\nWhen something is shot from point blank, a burn area is left around the bullet hole.\nGumshoe:\nGunpowder exploding is what makes a bullet fire, and that gets real hot, pal. And there were definitely some gunpowder burns left on the victim's forehead!\nPhoenix:\n(Wow... Never knew that... Live and learn, I guess...)Gumshoe:\nBut before the victim was shot, sir, he was stabbed in the chest.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nStabbed... And what was he stabbed with?\nGumshoe:\nA fruit knife.\nJudge:\nI see. And whose knife was it?\nGumshoe:\nIt looks like it belongs to the Feys, sir. And of course, Maya Fey's fingerprints are all over it.\nJudge:\nHmm... All over it, huh?\nPhoenix:\n(Urk. This does not look good...)\nvon Karma:\nHa ha ha. What will you do now, Mr. Phoenix Wright?Gumshoe:\nThe wound was very severe, but not enough to cause instantaneous death.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHow severe was the wound?\nGumshoe:\nIf it had been half an inch more to the right, it would've hit the victim's heart. After a stab like that, it's impossible to fight back, let alone stand.\nPhoenix:\n(This testimony makes Maya look like she had stabbed him with the intent to kill...)Gumshoe:\nThe murderer used the pistol to finish the victim off after the stabbing.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAre you sure he was stabbed first, then shot?\nGumshoe:\nYup. Sure as sure can be. One look at the wounds and you'd come to the same conclusion too, pal.\nvon Karma:\nA fool is a fool who will only listen to the foolish opinions of other foolish fools... A pistol shot to the forehead at point blank is certainly enough to kill instantly. Does it matter, then, which was first? Think a little more before you open that big mouth of yours, Mr. Phoenix Wright!\nPhoenix:\n(Grr... What a pain...)Phoenix:\n(Nothing sounds out of place so far... I should try to learn more about the murder weapons, for now...)",
      "testimonies": [
        {
          "testimony": "The direct cause of death was a pistol shot to the forehead, sir.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "The shot was fired from point-blank range.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "But before the victim was shot, sir, he was stabbed in the chest.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "The wound was very severe, but not enough to cause instantaneous death.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "The murderer used the pistol to finish the victim off after the stabbing.",
          "person": "Gumshoe",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- Cause of Death --Gumshoe:\nThe direct cause of death was a pistol shot to the forehead, sir.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe murder weapon, Detective Gumshoe. Whose pistol was it?\nGumshoe:\nIt was the victim's.\nPhoenix:\nThe victim? Now, why would he have...\nvon Karma:\n\nvon Karma:\n\"Why would he have a pistol?\" Who cares? The point that you are missing is whose fingerprints are on that pistol. If you're not already paying attention to that, then I suggest you start.\nJudge:\nFingerprints? There were fingerprints?\nGumshoe:\nAlong with the victim's, the defendant, Maya Fey's were also on the grip, sir.\nJudge:\nHmm. So the defendant's fingerprints were left on the murder weapon...\nPhoenix:\n(Argh...! I walked right into her hands there.) (Changed from [Hmm... I walked right into her hands there.] in the original release)Gumshoe:\nThe shot was fired from point-blank range.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nPoint blank, huh? So about how far away was it?\nGumshoe:\nIt was anywhere between 12 to 20 inches away.\nPhoenix:\nAnd how do you know he was shot at point blank?\nvon Karma:\nTsk, tsk, tsk. Mr. Phoenix Wright. I grow tired of the foolish foolery of the foolish fools of this foolish country...\nPhoenix:\nE-Excuse me!?\nvon Karma:\nGunpowder burn.\nPhoenix:\n...Gunpowder burn?\nvon Karma:\nWhen something is shot from point blank, a burn area is left around the bullet hole.\nGumshoe:\nGunpowder exploding is what makes a bullet fire, and that gets real hot, pal. And there were definitely some gunpowder burns left on the victim's forehead!\nPhoenix:\n(Wow... Never knew that... Live and learn, I guess...)Gumshoe:\nBut before the victim was shot, sir, he was stabbed in the chest.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nStabbed... And what was he stabbed with?\nGumshoe:\nA fruit knife.\nJudge:\nI see. And whose knife was it?\nGumshoe:\nIt looks like it belongs to the Feys, sir. And of course, Maya Fey's fingerprints are all over it.\nJudge:\nHmm... All over it, huh?\nPhoenix:\n(Urk. This does not look good...)\nvon Karma:\nHa ha ha. What will you do now, Mr. Phoenix Wright?Gumshoe:\nThe wound was very severe, but not enough to cause instantaneous death.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHow severe was the wound?\nGumshoe:\nIf it had been half an inch more to the right, it would've hit the victim's heart. After a stab like that, it's impossible to fight back, let alone stand.\nPhoenix:\n(This testimony makes Maya look like she had stabbed him with the intent to kill...)Gumshoe:\nThe murderer used the pistol to finish the victim off after the stabbing.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAre you sure he was stabbed first, then shot?\nGumshoe:\nYup. Sure as sure can be. One look at the wounds and you'd come to the same conclusion too, pal.\nvon Karma:\nA fool is a fool who will only listen to the foolish opinions of other foolish fools... A pistol shot to the forehead at point blank is certainly enough to kill instantly. Does it matter, then, which was first? Think a little more before you open that big mouth of yours, Mr. Phoenix Wright!\nPhoenix:\n(Grr... What a pain...)Phoenix:\n(Nothing sounds out of place so far... I should try to learn more about the murder weapons, for now...)After pressing first, second, third, and fifth statements:Judge:\nThat's enough! We have clearly established how the victim was murdered.Gumshoe:\nI brought the two murder weapons with me today.Judge:\nVery well. The court accepts them into evidence.Pistol added to the Court Record.Knife added to the Court Record.von Karma:\nThe date and time of death was June 19th at 3:15 PM. Eyewitnesses claim to have heard two gunshots at this time.Judge:\nAnd two murder weapons, both with the defendant's fingerprints on them, huh... (Changed from [And the two murder weapons, both with the defendant's fingerprints on them...?] in the original release) Hmm... This does seem like an open and shut case.von Karma:\nNaturally!Phoenix:\n(This is going from bad to worse... As if the summary just now wasn't oversimplifying things to the extreme...)von Karma:\nYour Honor. Feel free to slam that little gavel of yours. After all, there is no room left for doubt, is there?Judge:\nThat is quite true... Mr. Wright.Phoenix:\nY-Yes?Judge:\nEven in the face of all this, do you still wish to plead \"not guilty\"? It's the opinion of this court that if you do not adjust your plea, you stand to lose.von Karma:\nSee, just as I promised, Mr. Phoenix Wright. You would change your plea in less than ten minutes...Judge:\nWhat will you do, Mr. Wright? Will you change to \"justified self-defense\"? Because now would be the time to do so. This is your final chance.Phoenix:\n(This is a huge decision! I'd better think this through all the way!)Plead justified self-defense\n\n\n\n\n\n\n\nPhoenix:\n(If Maya is convicted, then it's all over. I really should play it safe, and try to soften the blow...) Your Honor. The defense would like to change its plea to \"justified self-defense\"...\nvon Karma:\nHah.\nJudge:\nUnderstood. Let the record show that the defense has entered a new plea.\nPhoenix:\n(...There's nothing else I could do... Mia...?)\nMia:\n...You already hold the key... ...If you don't believe, you cannot win...\nPhoenix:\n(...! If we plead \"justified self-defense\", we would basically be confessing to murder! After the trial, Maya's life would be destroyed, and she'll be labeled a murderer... Can I really... Can I really let that happen!?) Your Honor!\nJudge:\nY-Yes?\nPhoenix:\nThe defense... The defense retracts its previous statement. And instead, will prove beyond the shadow of a doubt that the defendant is not guilty!\nLeads to:\n\"...You.\"Plead not guilty\n\n\n\n\n\n\n\nPhoenix:\n(If we plead \"justified self-defense\"... we would basically be confessing to a murder! After the trial, Maya's life would be destroyed, and she'd be labeled a murderer... I can't let that happen!) Your Honor!\nJudge:\nHave you reached a conclusion, Mr. Wright?\nPhoenix:\nThe defense will not change its plea. We will accept nothing short of complete acquittal!\nLeads to:\n\"...You.\"von Karma:\n...You. You have sealed your fate, Mr. Phoenix Wright. Detective!Gumshoe:\nY-Yes, sir!von Karma:\nPresent the final portion of your testimony -- the final strike.Gumshoe:\nUm... Y-Yes... sir...Judge:\nN-Now, see here! Proceedings are run by... Eek!von Karma:\n...Judge:\nOh, yes, of course. Go ahead Detective and give your testimony...von Karma:\nI think the court would like to hear about the other piece of incriminating evidence!Witness Testimony-- Incriminating Evidence --Gumshoe:\nSorry, pal, but there's an even more incriminating piece of evidence.\nThis is the costume the defendant was wearing at the time of the crime.\nAs you can see, it's covered in blood.\nThe defendant attacked and killed a person who, without a doubt, was not fighting back.Judge:\nSo this is the costume... There certainly is evidence of a back spray of blood on this.Gumshoe:\nThis piece directly links Maya Fey to the crime, sir.Judge:\nI see... The court accepts this into evidence.Maya's Costume added to the Court Record.Judge:\nAlright, Mr. Wright.Phoenix:\n(Maya's fingerprints on both murder weapons and blood splatters on her clothes... Could this situation get any worse??)von Karma:\nHah. What's wrong? You seem to be at a loss. I think this is the last piece of testimony the prosecution should have to offer. Feel free to sulk off with your tail between your legs, Mr. Phoenix Wright!Phoenix:\n(Please stop calling me by my full name. It's disturbing.)Cross ExaminationCross Examination-- Incriminating Evidence --Gumshoe:\nSorry, pal, but there's an even more incriminating piece of evidence.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhy didn't you say so in your testimony earlier!?\nGumshoe:\nUh... You're kinda scary today, you know, pal?\nJudge:\nCome now, Mr. Wright... There is no need for that kind of attitude in my court...\nPhoenix:\n...\nJudge:\nA-Alright. Just, please stop glaring at me like that...Gumshoe:\nThis is the costume the defendant was wearing at the time of the crime.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nMaya's... costume?\nGumshoe:\nYeah. She was wearing this when we arrested her.\nPhoenix:\n(Maya... She's wearing her channeling costume today too... Is she not allowed to wear anything else...?)Gumshoe:\nAs you can see, it's covered in blood.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThis blood on the costume...\nGumshoe:\nLab results show that it is the victim's blood.\nJudge:\nHmm... So there is blood from the victim on the defendant's clothes.\nPhoenix:\n(Definitely not good...) (Changed from [Definitely not good... Urk.] in the original release) So, where there any other clues you could gleam [sic] from this piece of evidence? (Changed from [Hmm, where there any other clues you could gleam [sic] from this piece of evidence?] in the original release)\nGumshoe:\nUm, well...\nvon Karma:\n\nvon Karma:\nIf you must change the topic, then the good detective here must testify again. But too bad. Not enough time. Let's move on. (Changed from [But too bad. Not enough time. Time to move on.] in the original release)\nJudge:\nAh, yes, Ms. von Karma is perfectly correct...\nPhoenix:\n(Grr... Now even the Judge is on her side! But if I bite off more than I can chew here... What should I do!?)\n\n\n\nPress further\n\n\n\n\n\n\n\nPhoenix:\n(Why is Ms. von Karma suddenly putting up resistance? There must be a reason as to why she suddenly threw out an objection like that... There must be something about this costume...! (Changed from [There must be a clue somewhere on this costume!] in the original release) I just have to look harder!)\nJudge:\nMr. Wright. Ms. von Karma's logic is perfect. There is no way for you to poke a hole in it.\nPhoenix:\n(Argh! Looks like my time is up. So, about the costume...)\n\n\n\nThere is nothing wrong.\n\n\n\n\n\n\n\nPhoenix:\n(If I pursue this and I turn up nothing, it could be disastrous...) You're right, Your Honor. There is absolutely nothing more to this.\nJudge:\nGood. Well, Detective, please continue with your testimony.\nLeads back to cross-examination\n\n\n\n\nThere is one little thing...\n\n\n\n\n\n\n\nPhoenix:\nYour Honor. Actually, there is something very wrong with this piece of evidence.\nJudge:\nWh-What!?\nGumshoe:\nWhat are you talking about, pal!?\nvon Karma:\n...\nJudge:\nWh-Where is this problem you are talking about!?\nPhoenix:\n(I've come this far... There's no turning back now!) The problem I have with this piece of evidence is here!\n\n\n\nPresent bullet hole on left sleeve\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"I ask the court to please take a look at the sleeve of this costume.\"\n\n\n\n\nPresent blood splatter\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe problem is obviously the blood splatter here!\nJudge:\nB-But... We've determined that the blood splatter is from the victim. Where is the problem in that?\nGumshoe:\nYeah, where, pal?\nPhoenix:\nYeah... I wonder about that too...\nJudge:\nThat last antic of yours just pushed me over the top, Mr. Wright. I hereby declare this cross-examination over... (Changed from [I am declaring that this cross-examination period is over...] in the original release)\nPhoenix:\nP-Please wait, Your Honor! (Ack! I'd better not mess up again...)\nLeads back to:\n\"The problem I have with this piece of evidence is here!\"\n\n\n\n\nPresent anywhere else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThere is a problem... somewhere around... here!\nJudge:\nWh-What does he mean, Ms. von Karma?\nvon Karma:\nThere's nothing wrong with it. The only thing wrong here is the defense's head.\nJudge:\nWell said. You certainly do take after your father!\nPhoenix:\n(I've just been made to look like a fool again... Alright... Focus, Phoenix!)\nLeads back to:\n\"The problem I have with this piece of evidence is here!\"\n\n\nPhoenix:\nI ask the court to please take a look at the sleeve of this costume.\nJudge:\nThe sleeve? ...! There is a tiny hole here...\nGumshoe:\n..A... A hole...? But that wasn't in the report.\nJudge:\nHold on! What's this around the hole? I-It smells faintly of gunpowder!\nGumshoe:\nG-Gunpowder!? No one ever told me!\nJudge:\nA hole that smells of gunpowder...\nPhoenix:\n(It looks like I've found the \"hole\" I was looking for!) Your Honor, the only logical conclusion you can make is that it must be a bullet hole!\nJudge:\nOrder! Order! Order!! This is a very grave matter. It's best we correct the Court Record first before anything else.\nMaya's Costume updated in the Court Record.\nGumshoe:\nSorry about that. I guess we messed up, sir.\nvon Karma:\n...\nPhoenix:\n...! (I-Is she actually... smiling!? What else is she hiding!?)\nvon Karma:\nPull yourself together, Detective. That tiny \"hole\" doesn't change a thing. The strength of the evidence still holds. Continue with your testimony. That, just now, was a fluke. Nothing more.\nPhoenix:\n\nPhoenix:\nH-How can you say something like that!? This is a huge oversight!\nJudge:\nWhile I agree it is a mistake on the part of the police, what Prosecutor von Karma has said is true. The evidence still stands. If you do not find a more definitive problem with the evidence, then...\nPhoenix:\nNo way!!\nJudge:\nDetective Gumshoe, please continue with your testimony.\nGumshoe:\nY-Yes, sir.\nLeads back to cross-examination\n\n\n\n\n\nLet it go\n\n\n\n\n\n\n\nPhoenix:\n(If I pursue this and I turn up nothing, it could be disastrous...) You're right, Your Honor. There is absolutely nothing more to this.\nJudge:\nGood. Well, Detective, please continue with your testimony.\nLeads back to cross-examinationPress (after Maya's Costume is updated in the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAlright. I'll give you that the blood spatter is from the victim, but... what is this hole in the sleeve?\nGumshoe:\nUm... Sorry, pal. We must've thought it was just a tear in the seam...\nPhoenix:\nMissing the hole is not what I'm asking you about. I'm talking about the hole itself! The smell of gunpowder  clearly gives away that... it is a bullet hole!\nvon Karma:\n\nvon Karma:\nAs if little things like that matter.\nPhoenix:\nBut they do.\nvon Karma:\nA \"bullet hole\" in the sleeve, blood splatter all over the costume... Neither of these things can change the fact the defendant killed the victim.\nPhoenix:\n(...Grr... I know there's something more to that costume.)\nvon Karma:\nCome now Detective. You're wasting precious time.\nGumshoe:\n... Yes, sir.Gumshoe:\nThe defendant attacked and killed a person who, without a doubt, was not fighting back.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHe wasn't \"fighting back\"? How do you know if he was or wasn't!?\nGumshoe:\nWe could find no evidence that the victim put up any sort of struggle, pal.\nJudge:\nHmm... So did the murderer have a fight with the victim, or not? Depending on this, the circumstances around this murder change drastically.\nPhoenix:\n(Ugh... We're in real trouble now... If only I had something to prove that the victim did fight back...)Present Maya's Costume (after Maya's Costume is updated in the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Detective Dick Gumshoe!\"Phoenix:\n(That Von Karma! She thinks she can decide the verdict with this testimony alone! I have to somehow find a critical contradiction and then I'll have her!)",
      "testimonies": [
        {
          "testimony": "Sorry, pal, but there's an even more incriminating piece of evidence.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "This is the costume the defendant was wearing at the time of the crime.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "As you can see, it's covered in blood.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "The defendant attacked and killed a person who, without a doubt, was not fighting back.",
          "person": "Gumshoe",
          "present": [
            "Maya's Costume"
          ],
          "source": {
            "evidence_span": "It is stained with blood splatter and a bullet hole is present in the sleeve.",
            "testimony_span": "a person who, without a doubt, was not fighting back",
            "explanation": "The blood and bullet hole on Maya's costume indicae that the victim did in fact fight back by firing a shot.",
            "is_self_contained": "yes",
            "context_span": "",
            "difficulty": "medium",
            "isMultimodal": true
          }
        }
      ],
      "noPresent": false,
      "summarizedContext": "Detective Gumshoe is testifying about the incriminating evidence against Maya Fey, which is her costume she was wearing.",
      "difficulty": "medium",
      "labels": [
        "object property",
        "behavioral"
      ],
      "reasoning": [
        "Fact 1: The witness claims the victim was not fighting back.",
        "Fact 2: The evidence suggests the defendant's clothes had a bullet hole.",
        "Prop 1: If there is a bullet hole in one person's clothes, it means the other person fired a gunshot",
        "Prop 2: If a victim fired a gunshot, it means they were fighting back."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- Incriminating Evidence --Gumshoe:\nSorry, pal, but there's an even more incriminating piece of evidence.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhy didn't you say so in your testimony earlier!?\nGumshoe:\nUh... You're kinda scary today, you know, pal?\nJudge:\nCome now, Mr. Wright... There is no need for that kind of attitude in my court...\nPhoenix:\n...\nJudge:\nA-Alright. Just, please stop glaring at me like that...Gumshoe:\nThis is the costume the defendant was wearing at the time of the crime.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nMaya's... costume?\nGumshoe:\nYeah. She was wearing this when we arrested her.\nPhoenix:\n(Maya... She's wearing her channeling costume today too... Is she not allowed to wear anything else...?)Gumshoe:\nAs you can see, it's covered in blood.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThis blood on the costume...\nGumshoe:\nLab results show that it is the victim's blood.\nJudge:\nHmm... So there is blood from the victim on the defendant's clothes.\nPhoenix:\n(Definitely not good...) (Changed from [Definitely not good... Urk.] in the original release) So, where there any other clues you could gleam [sic] from this piece of evidence? (Changed from [Hmm, where there any other clues you could gleam [sic] from this piece of evidence?] in the original release)\nGumshoe:\nUm, well...\nvon Karma:\n\nvon Karma:\nIf you must change the topic, then the good detective here must testify again. But too bad. Not enough time. Let's move on. (Changed from [But too bad. Not enough time. Time to move on.] in the original release)\nJudge:\nAh, yes, Ms. von Karma is perfectly correct...\nPhoenix:\n(Grr... Now even the Judge is on her side! But if I bite off more than I can chew here... What should I do!?)\n\n\n\nPress further\n\n\n\n\n\n\n\nPhoenix:\n(Why is Ms. von Karma suddenly putting up resistance? There must be a reason as to why she suddenly threw out an objection like that... There must be something about this costume...! (Changed from [There must be a clue somewhere on this costume!] in the original release) I just have to look harder!)\nJudge:\nMr. Wright. Ms. von Karma's logic is perfect. There is no way for you to poke a hole in it.\nPhoenix:\n(Argh! Looks like my time is up. So, about the costume...)\n\n\n\nThere is nothing wrong.\n\n\n\n\n\n\n\nPhoenix:\n(If I pursue this and I turn up nothing, it could be disastrous...) You're right, Your Honor. There is absolutely nothing more to this.\nJudge:\nGood. Well, Detective, please continue with your testimony.\nLeads back to cross-examination\n\n\n\n\nThere is one little thing...\n\n\n\n\n\n\n\nPhoenix:\nYour Honor. Actually, there is something very wrong with this piece of evidence.\nJudge:\nWh-What!?\nGumshoe:\nWhat are you talking about, pal!?\nvon Karma:\n...\nJudge:\nWh-Where is this problem you are talking about!?\nPhoenix:\n(I've come this far... There's no turning back now!) The problem I have with this piece of evidence is here!\n\n\n\nPresent bullet hole on left sleeve\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"I ask the court to please take a look at the sleeve of this costume.\"\n\n\n\n\nPresent blood splatter\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe problem is obviously the blood splatter here!\nJudge:\nB-But... We've determined that the blood splatter is from the victim. Where is the problem in that?\nGumshoe:\nYeah, where, pal?\nPhoenix:\nYeah... I wonder about that too...\nJudge:\nThat last antic of yours just pushed me over the top, Mr. Wright. I hereby declare this cross-examination over... (Changed from [I am declaring that this cross-examination period is over...] in the original release)\nPhoenix:\nP-Please wait, Your Honor! (Ack! I'd better not mess up again...)\nLeads back to:\n\"The problem I have with this piece of evidence is here!\"\n\n\n\n\nPresent anywhere else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThere is a problem... somewhere around... here!\nJudge:\nWh-What does he mean, Ms. von Karma?\nvon Karma:\nThere's nothing wrong with it. The only thing wrong here is the defense's head.\nJudge:\nWell said. You certainly do take after your father!\nPhoenix:\n(I've just been made to look like a fool again... Alright... Focus, Phoenix!)\nLeads back to:\n\"The problem I have with this piece of evidence is here!\"\n\n\nPhoenix:\nI ask the court to please take a look at the sleeve of this costume.\nJudge:\nThe sleeve? ...! There is a tiny hole here...\nGumshoe:\n..A... A hole...? But that wasn't in the report.\nJudge:\nHold on! What's this around the hole? I-It smells faintly of gunpowder!\nGumshoe:\nG-Gunpowder!? No one ever told me!\nJudge:\nA hole that smells of gunpowder...\nPhoenix:\n(It looks like I've found the \"hole\" I was looking for!) Your Honor, the only logical conclusion you can make is that it must be a bullet hole!\nJudge:\nOrder! Order! Order!! This is a very grave matter. It's best we correct the Court Record first before anything else.\nMaya's Costume updated in the Court Record.\nGumshoe:\nSorry about that. I guess we messed up, sir.\nvon Karma:\n...\nPhoenix:\n...! (I-Is she actually... smiling!? What else is she hiding!?)\nvon Karma:\nPull yourself together, Detective. That tiny \"hole\" doesn't change a thing. The strength of the evidence still holds. Continue with your testimony. That, just now, was a fluke. Nothing more.\nPhoenix:\n\nPhoenix:\nH-How can you say something like that!? This is a huge oversight!\nJudge:\nWhile I agree it is a mistake on the part of the police, what Prosecutor von Karma has said is true. The evidence still stands. If you do not find a more definitive problem with the evidence, then...\nPhoenix:\nNo way!!\nJudge:\nDetective Gumshoe, please continue with your testimony.\nGumshoe:\nY-Yes, sir.\nLeads back to cross-examination\n\n\n\n\n\nLet it go\n\n\n\n\n\n\n\nPhoenix:\n(If I pursue this and I turn up nothing, it could be disastrous...) You're right, Your Honor. There is absolutely nothing more to this.\nJudge:\nGood. Well, Detective, please continue with your testimony.\nLeads back to cross-examinationPress (after Maya's Costume is updated in the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAlright. I'll give you that the blood spatter is from the victim, but... what is this hole in the sleeve?\nGumshoe:\nUm... Sorry, pal. We must've thought it was just a tear in the seam...\nPhoenix:\nMissing the hole is not what I'm asking you about. I'm talking about the hole itself! The smell of gunpowder  clearly gives away that... it is a bullet hole!\nvon Karma:\n\nvon Karma:\nAs if little things like that matter.\nPhoenix:\nBut they do.\nvon Karma:\nA \"bullet hole\" in the sleeve, blood splatter all over the costume... Neither of these things can change the fact the defendant killed the victim.\nPhoenix:\n(...Grr... I know there's something more to that costume.)\nvon Karma:\nCome now Detective. You're wasting precious time.\nGumshoe:\n... Yes, sir.Gumshoe:\nThe defendant attacked and killed a person who, without a doubt, was not fighting back.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHe wasn't \"fighting back\"? How do you know if he was or wasn't!?\nGumshoe:\nWe could find no evidence that the victim put up any sort of struggle, pal.\nJudge:\nHmm... So did the murderer have a fight with the victim, or not? Depending on this, the circumstances around this murder change drastically.\nPhoenix:\n(Ugh... We're in real trouble now... If only I had something to prove that the victim did fight back...)Present Maya's Costume (after Maya's Costume is updated in the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Detective Dick Gumshoe!\"Phoenix:\n(That Von Karma! She thinks she can decide the verdict with this testimony alone! I have to somehow find a critical contradiction and then I'll have her!)Phoenix:\nDetective Dick Gumshoe!Gumshoe:\nY-Yes? Heh, having you call me by my full name is kind of a weird feeling...Phoenix:\nYou said that my client killed \"a person who, without a doubt, was not fighting back.\"Gumshoe:\nYeah, I did.Phoenix:\nThen what, may I ask, is the bullet hole you police overlooked supposed to mean!?Gumshoe:\nEh, um... What does it mean?Phoenix:\nI'll tell you what it means. It means that the victim had fired off a shot. Is this what it means to \"not fight back\"?Gumshoe:\nA-Ah! You're right!Judge:\nIt seems you are correct! (Changed from [It would seem that way!] in the original release) If the victim had tried to shoot the defendant, then... it would change everything... (Changed from [If the victim tried to shoot the defendant, then... It would change everything...] in the original release)Phoenix:\n(Alright! The wind seems to be shifting...)von Karma:\nHah.Phoenix:\n(What is with that \"are you finished yet\" laugh?)von Karma:\nAre you finished yet, Mr. Phoenix Wright?Judge:\nMs. von Karma?von Karma:\nIt seems... that Maya Fey was shot at by the victim. However, that is only grounds enough to support a \"justified self-defense\" plea.Judge:\nThat is correct.von Karma:\nBut I'm sure you remember, Your Honor, what the defense clearly said. They rejected \"justified self-defense\" and pleaded \"not guilty.\"Phoenix:\nAck!Gumshoe:\nNow that you...Judge:\nWhy, that's right!von Karma:\nWhich means! The defense has yet to prove anything at all!Phoenix:\nNooooo!!Judge:\nW-Well... Yes, that's true...von Karma:\nFurthermore... just the fact that there is a bullet hole in the costume... is not enough to substantiate even a plea of \"justified self-defense\".Judge:\nHuh? How so?Gumshoe:\nAaah!von Karma:\nDon't just stand there. Hurry up and tell the court what transpired that day. ...With the new information we acquired added in, of course.Gumshoe:\nHuh? You mean... By myself...? You want me to put together the scenario all by myself? Aah!von Karma:\n...Gumshoe:\nY-Yes, sir! Right away, sir!Witness Testimony-- What Transpired --Gumshoe:\nDuring the channeling, the defendant saw her chance to stab the victim in the chest.\nOf course, the victim used the last of his strength to fight back, sir.\nWhile the two were fighting, the victim took out his gun.\nThe victim took a shot, but because they were too close, he missed.\nThe defendant then picked up on the opening, took the victim's gun, and ended it...Judge:\nHmm... This scenario you have put together does make sense...Gumshoe:\nYes, sir.Judge:\nWell, Mr. Wright?Phoenix:\n(On the surface, it does seem to make sense... (Changed from [Just by listening, it does make sense...] in the original release) However, I won't give up that easily!)Judge:\nP-Please refrain from glaring at me like that... Now then, your cross-examination, please.Cross ExaminationCross Examination-- What Transpired --Gumshoe:\nDuring the channeling, the defendant saw her chance to stab the victim in the chest.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThere is quite a difference in height between Dr. Grey and the defendant. Add in body strength, and it seems unlikely the defendant could have stabbed the victim!\nGumshoe:\nNow that you mention it... Yeah, I guess...\nvon Karma:\n\nvon Karma:\nYou think you can get away with such flimsy reasoning? Mr. Phoenix Wright! Maya Fey was in the middle of channeling, was she not?\nPhoenix:\n...?\nvon Karma:\nWhen channeling with the Kurain Channeling Technique, the medium physically changes. With the nurse's build, the defendant could have easily been a match for the doctor.\nPhoenix:\n(I don't believe it... She even studied up on the Kurain Channeling Technique!)\nvon Karma:\nLike I said before... I am perfect.\nJudge:\nUm... Uh... About what you were talking about... I didn't quite get it...\nPhoenix:\n...\nvon Karma:\n...\nJudge:\nUm, n-never mind. Let's continue with the testimony...Gumshoe:\nOf course, the victim used the last of his strength to fight back, sir.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo he was stabbed, but the stab wound didn't kill him.\nGumshoe:\nBut if you think about the blood loss, it was pretty bad.\nPhoenix:\nHow bad would you say it was?\nGumshoe:\nActually, I went to give blood the other day. And afterward, I felt a little lightheaded and dizzy. ...I guess the damage was maybe... about 10 times the dizziness...? Ack!\nvon Karma:\n...\nGumshoe:\nS-Sorry!Gumshoe:\nWhile the two were fighting, the victim took out his gun.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhere in the world did that pistol come from?\nGumshoe:\nIt looks like the victim, Dr. Grey had specifically bought it for that day.\nPhoenix:\nBut a handgun...?\nGumshoe:\nHe got it off the black market about 2 days before the murder.\nPhoenix:\n(Why did Dr. Grey bring a gun...? Was he taking precautions against something...?)Gumshoe:\nThe victim took a shot, but because they were too close, he missed.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo, you're saying that the bullet hole in this costume was made then?\nGumshoe:\nSorry, pal, but that's what I'd think. The two of them were already fighting when a shot was fired.\nPhoenix:\n(Maya... I'm really glad you weren't hurt...)\nvon Karma:\n...Present Maya's Costume\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Missing the tiny hole on this costume...\"Gumshoe:\nThe defendant then picked up on the opening and took the victim's gun, and ended it...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nMaya has never fired a gun before in her life!\nGumshoe:\nThe victim had already taken off the safety. With the safety off, even an amateur like you can fire it by pulling the trigger.\nPhoenix:\n(Even me...? I wonder...?)\nvon Karma:\nNow do you understand? A Von Karma's logic is perfect.Phoenix:\n(His testimony certainly makes us look very bad, but there's gotta be a contradiction in there somewhere... And uncovering it is going to uncover the truth! I can feel it!)",
      "testimonies": [
        {
          "testimony": "During the channeling, the defendant saw her chance to stab the victim in the chest.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "Of course, the victim used the last of his strength to fight back, sir.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "While the two were fighting, the victim took out his gun.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "The victim took a shot, but because they were too close, he missed.",
          "person": "Gumshoe",
          "present": [
            "Maya's Costume"
          ],
          "source": {
            "evidence_span": "The robe is otherwise clean.",
            "testimony_span": "because they were too close",
            "explanation": "There is no gunpowder burn on the costume, so the shot must not have been fired in a close range.",
            "is_self_contained": "no",
            "context_span": "When something is shot from point blank, a burn area is left around the bullet hole.",
            "difficulty": "medium",
            "isMultimodal": true
          }
        },
        {
          "testimony": "The defendant then picked up on the opening and took the victim's gun, and ended it...",
          "person": "Gumshoe",
          "present": []
        }
      ],
      "noPresent": false,
      "summarizedContext": "Detective Gumshoe is describing the hypothetical situation where the defendant and the victim were fighting.",
      "difficulty": "medium",
      "labels": [
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims the gunshot happened in close range.",
        "Fact 2: The evidence suggests the robe is clean.",
        "Prop 1: The context suggests that a gunshot happens in close range will leave gunpowder burn.",
        "Prop 2: If something is clean, it does not have gunpowder burn."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- What Transpired --Gumshoe:\nDuring the channeling, the defendant saw her chance to stab the victim in the chest.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThere is quite a difference in height between Dr. Grey and the defendant. Add in body strength, and it seems unlikely the defendant could have stabbed the victim!\nGumshoe:\nNow that you mention it... Yeah, I guess...\nvon Karma:\n\nvon Karma:\nYou think you can get away with such flimsy reasoning? Mr. Phoenix Wright! Maya Fey was in the middle of channeling, was she not?\nPhoenix:\n...?\nvon Karma:\nWhen channeling with the Kurain Channeling Technique, the medium physically changes. With the nurse's build, the defendant could have easily been a match for the doctor.\nPhoenix:\n(I don't believe it... She even studied up on the Kurain Channeling Technique!)\nvon Karma:\nLike I said before... I am perfect.\nJudge:\nUm... Uh... About what you were talking about... I didn't quite get it...\nPhoenix:\n...\nvon Karma:\n...\nJudge:\nUm, n-never mind. Let's continue with the testimony...Gumshoe:\nOf course, the victim used the last of his strength to fight back, sir.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo he was stabbed, but the stab wound didn't kill him.\nGumshoe:\nBut if you think about the blood loss, it was pretty bad.\nPhoenix:\nHow bad would you say it was?\nGumshoe:\nActually, I went to give blood the other day. And afterward, I felt a little lightheaded and dizzy. ...I guess the damage was maybe... about 10 times the dizziness...? Ack!\nvon Karma:\n...\nGumshoe:\nS-Sorry!Gumshoe:\nWhile the two were fighting, the victim took out his gun.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhere in the world did that pistol come from?\nGumshoe:\nIt looks like the victim, Dr. Grey had specifically bought it for that day.\nPhoenix:\nBut a handgun...?\nGumshoe:\nHe got it off the black market about 2 days before the murder.\nPhoenix:\n(Why did Dr. Grey bring a gun...? Was he taking precautions against something...?)Gumshoe:\nThe victim took a shot, but because they were too close, he missed.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo, you're saying that the bullet hole in this costume was made then?\nGumshoe:\nSorry, pal, but that's what I'd think. The two of them were already fighting when a shot was fired.\nPhoenix:\n(Maya... I'm really glad you weren't hurt...)\nvon Karma:\n...Present Maya's Costume\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Missing the tiny hole on this costume...\"Gumshoe:\nThe defendant then picked up on the opening and took the victim's gun, and ended it...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nMaya has never fired a gun before in her life!\nGumshoe:\nThe victim had already taken off the safety. With the safety off, even an amateur like you can fire it by pulling the trigger.\nPhoenix:\n(Even me...? I wonder...?)\nvon Karma:\nNow do you understand? A Von Karma's logic is perfect.Phoenix:\n(His testimony certainly makes us look very bad, but there's gotta be a contradiction in there somewhere... And uncovering it is going to uncover the truth! I can feel it!)Phoenix:\nMissing the tiny hole on this costume... will be the prosecution's undoing.Gumshoe:\nEh? What do you mean?Phoenix:\nThis little hole has actually created a huge hole in your testimony!Judge:\nE-Explain yourself, Mr. Wright!Phoenix:\nYou said the two of them were fighting when the victim fired his gun at point blank. If that were true, then where is the gunpowder burn on this costume!?Gumshoe:\nG-Gunpowder... burn?Phoenix:\nThis is what you testified earlier: \"When something is shot from point blank, a burn area is left around the bullet hole.\"Gumshoe:\nOH!Phoenix:\nBut there is not a single trace of gunpowder burn on this costume!!Judge:\nThat is a very good point. And... what exactly does this mean?Phoenix:\nIt means that when the shot was fired, they were standing apart from each other.Judge:\nHmm...von Karma:von Karma:\nI'm disappointed, Mr. Phoenix Wright. You think you can punch a hole in my logic with that? With wishy-washy thinking like that, anyone can explain anything away!Phoenix:\nThen I implore you to disprove my line of thinking.von Karma:\nLet's see... In the middle of their fight, the victim pushed the defendant away. And it was then, when they were separated, that he fired! How was that?Phoenix:Phoenix:\nAs if that was even possible. According to testimony, the wound from the stabbing was very severe. The victim would not have had the strength to push the defendant very far after that!von Karma:\n...! W-Well... Then... That's right! The defendant must have pushed the victim away! After stabbing him, she must have put some space between the doctor and herself. And then while she was preparing to strike again, the doctor took his shot. There. That sound satisfy even you.Judge:\nHmm... That does make an awful lot of sense. What do you think, Mr. Wright?Phoenix:\n(I must be careful. I can't afford to make a mistake here! Concentrate and think!)It makes sense.\n\n\n\n\n\n\n\nPhoenix:\n(Ack, it's no good. I can't find a \"hole\" in her logic at all this time...) I admit it. Somehow, your reasoning makes logical sense.\nvon Karma:\nThat's it. That's exactly what I wanted to hear from you, Mr. Phoenix Wright! Drat. It's 11:00 AM. I've already missed my morning tea. ...However. At least we were able to arrive at a conclusion.\nJudge:\nHmm... It does look that way.\nPhoenix:\n(...Oh boy... If I don't do something soon, it'll be curtains for Maya...)\nJudge:\nWell then, I think we can...\nPhoenix:\n\nPhoenix:\nYour Honor! Please... Wait!\nJudge:\nWho was that? Mr. Wright? Please refrain from making unnecessary outbursts!\nPhoenix:\n(I don't care how, but I must find something to go on in Von Karma's explanation!)\nLeads to:\n\"There is a fatal flaw in her argument, Your Honor!\"Something doesn't make sense.\n\n\n\n\n\n\n\nLeads to:\n\"There is a fatal flaw in her argument, Your Honor!\"Phoenix:\nThere is a fatal flaw in her argument, Your Honor!Gumshoe:\nFatal...?Judge:\nFlaw...!? Yeow!von Karma:\nVery interesting. I would love to see where this \"flaw\" is! Show me something that contradicts my explanation!Phoenix:\n(There has to be a snag in her explanation somewhere! \"She put some distance between them before rushing to make the final blow. And when she was about to strike, the doctor took his shot.\" There must be a piece of evidence that contradicts this line of thinking!)Present Folding Screen\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"This is the piece of evidence that destroys your logic.\"Present anything else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nTake a look at this!\nGumshoe:\nWhy are you showing this to me, pal?\nPhoenix:\nProsecutor von Karma's explanation and this piece of evidence...\nGumshoe:\n...Do not contradict!\nPhoenix:\n...Huh?\nGumshoe:\nHaha, looks like you need to use your brain a little more, pal.\nPhoenix:\n(Ugh... Being lectured by Gumshoe, of all people, is so embarrassing...)\nGumshoe:\nCome on! Hurry up and get that thinking cap on!\nLeads back to:\n\"There has to be a snag in her explanation somewhere!\"Phoenix:\nThis is the piece of evidence that destroys your logic.Judge:\nWhat is that? A folding screen?Phoenix:\nI would like to point the court's attention to the \"hole\" in this folding screen.von Karma:\nAaah!Phoenix:\nIt looks like you already know what I'm talking about.Gumshoe:\nWho? Where? What?Judge:\nMr. Wright! Your explanation, please!Phoenix:\n(Are these two really that clueless...?) The bullet went through the defendant's sleeve first, then the folding screen. It passed through at a height of approximately 8 inches off the ground... Which means! When the shot was fired, Maya... I mean, the defendant, was not getting ready to strike, but was actually squatting low to the ground!Judge:\nOrder! Order! Th-This changes everything!Phoenix:\nPlease look at this diagram of the crime scene. The victim, Dr. Grey was here when he fired the shot. And the bullet hit this folding screen. It hit at this location, about 8 inches off the ground. At this time, the defendant was in this area.Present area directly in front of bullet hole\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"She was standing here, near the folding screen!\"Present area behind folding screen\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHere!\nJudge:\nBehind the folding screen...?\nPhoenix:\nAck!\nvon Karma:\nThe victim and his attacker were fighting, were they not? Then what would the attacker be doing all the way back there!?\nPhoenix:\nUm...\nvon Karma:\nBesides which, if the attacker was behind the folding screen, then how could the victim even know where to shoot? It's obviously impossible!\nPhoenix:\n... Yeah, I guess so...\nJudge:\nMr. Wright!\nPhoenix:\n(Boy, did I just screw up royally... What's done is done. For now, I should focus on where Maya was at the time of the crime.)\nLeads back to:\n\"At this time, the defendant was in this area.\"Present anywhere else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSomewhere around here!\nJudge:\n...?\nPhoenix:\n(Uh oh. The judge's face is scrunched like he just smelled some serious bad breath...) Uhh... Um... That is, I mean...\nJudge:\nWait! I just realized I forgot to brush this morning... Excuse me while I freshen up.\nPhoenix:\nUh, sure...\nJudge:\nIn the meantime, I want you to think things through again, Mr. Wright!\nPhoenix:\n(Ah, of course... Whoops... What's done is done. For now, I should focus on where Maya was at the time of the crime.)\nLeads back to:\n\"At this time, the defendant was in this area.\"Phoenix:\nShe was standing here, near the folding screen!von Karma:\nW-Wait a second! We know the defendant was close to the ground based on the height of the bullet hole. But... How can you gauge the distance from that!? Isn't it possible that the defendant was standing much closer to the victim?Phoenix:\nThat's impossible.von Karma:\nB-But why!?Phoenix:\nYou, of all people, should know the answer to that question, Ms. von Karma. If she were shot from somewhere closer, there would be gunpowder burns present. However! There is nothing of the sort around the bullet hole of this costume!von Karma:\nAaaaaah! C-Curse you, Mr. Phoenix Wright! You...!Judge:\nHmm... I believe it has now been proven that the defendant was standing a ways from the victim when she was shot at. But do you think this has changed the defendant's situation...?It doesn't change anything.\n\n\n\n\n\n\n\nPhoenix:\n(Hmm, even with that explanation, it feels like nothing has changed... But I can't give up just yet!)\nLeads to:\n\"Honestly, Your Honor! This changes everything!\"It changes everything.\n\n\n\n\n\n\n\nLeads to:\n\"Honestly, Your Honor! This changes everything!\"Phoenix:\nHonestly, Your Honor! This changes everything! The prosecution has claimed that the defendant was aiming to kill by stabbing. If that were true, delivering the final strike with the knife would be ideal. However! Where and what was the defendant doing at the time...?Gumshoe:\n...Squatting all the way by the folding screen...?Phoenix:\nExactly. If Maya Fey was the real murderer, why would she be by the folding screen instead of preparing to strike?von Karma:\nNnngh...Judge:\nUpon further consideration, it does make very little sense.Gumshoe:\nYeah, I figured there had to be a reason.Phoenix:\nFiguring things out and proving the logic behind everything is YOUR job!Gumshoe:\nOof...Phoenix:\n(Alright! With this, the rest of the trial should be in the b--)von Karma:\n...Phoenix:\n(...blast radius of disaster.)von Karma:\nYou are such a smart man, Mr. Phoenix Wright. To think that you've been able to take a completely hopeless case to this point... Now I know why Papa had a tough time with you. Mmm, you amuse me...Phoenix:\n(Uuugh. Of all the things to inherit, why did it have to be that smarmy smile!?)von Karma:\nDetective. How dare you damage my perfect logic!?Gumshoe:\nH-Huh!?... How is it all my fault??von Karma:\nYou can start repairing your standing by first removing that three-strand \"goatee\". Oh, and rest assured your punishment will come later.Gumshoe:\n...P-Punishment...von Karma:\nWell then, Your Honor, I think I've had all I can take of this detective's face. I think it's time to call in the next witness.Phoenix:\n(Next witness...? That's gotta be Lotta!)Judge:\nVery well. The court will take a 5 minute recess. After we reconvene, we will hear from the next witness.To be continued.June 21, 11:37 AMDistrict CourtDefendant Lobby No. 3Phoenix:\nPhew, that was a close one.Maya:\nI know you were giving it your all to defend me. But I could feel the death penalty hanging in the air...Phoenix:\nI felt like I was pretty close to dying myself...Pearl:\nBut you were wonderful out there. You listened carefully, made theories, and tricked everyone into believing you.Phoenix:\nTh-Thanks. Wait... Tricked??Pearl:\nThat must be the \"lawyer's\" secret technique, right?Maya:\nBy the way... Is the next witness who I think it is...?Phoenix:\nYeah, I'm pretty sure it's Lotta Hart.Maya:\nOh... Guess there's no escaping her, huh? (Changed from [Oh... Another jam, like always...] in the original release) Remember, Nick! You promised you'd save me! If you lose, me and my sis's ghosts will come after you and haunt you! (Changed from [If you lose, my ghost will come after you with my sis', and we'll haunt you!] in the original release)Pearl:\nYour sister...? Um, are you talking about Mystic Mia?Maya:\nYeah. Do you remember her, Pearly? My sister was a super good lawyer! She was also Nick's teacher.Pearl:\n...Oh, I didn't know that...June 21, 11:43 AMDistrict CourtCourtroom No. 2Judge:\nCourt will now reconvene. Now, the first order of... Oww!von Karma:\nI don't want to hear it, old man. After I call my witness, sit there quietly and watch like a good little boy.Judge:\nY-Yes, sir.von Karma:\nBring in the photographer who witnessed the channeling!von Karma:\nWitness. Your name and occupation, if you please.Lotta:\nHey, Phoenix! How ya doin'?Phoenix:\nJust fine...Lotta:\nSorry 'bout this. Didn't exactly have a choice, ya know...? Yeowza!von Karma:\nName and occupation.Lotta:\nI-I declare! What in tarnation!? Hey, Judge! This here is violence against my fair self!Judge:\nThat's fine.Lotta:\n\"That's fine!?\" That ain't fine!! That's a whip! Eaaah!von Karma:\nThere's no need for foolish outcries from foolishly foolish fools. Just hurry up and testify about what happened on the day of the murder.Lotta:\nI haven't even gotten to say my name and job yet...von Karma:\n...Lotta:\nThe name's Lotta Hart, paranormal photographer, and I'm here to testify!Judge:\nNow, now, let's all be one big happy family... OK...?Witness Testimony-- Witness's Account --Lotta:\nOnly the Doc and the defendant went into the Channelin' Chamber.\nWe were waitin' outside the door and then, \"bang!\" we hear this gunshot!\nMr. Lawyer there broke the door down, and we rushed into the room.\nInside was the dead victim, and the defendant, wavin' a pistol around.\nI swear, other than those two, there was no one else in the room.Judge:\nAnd did you take a picture of the scene right after the murder took place?Lotta:\nReckon course!Phoenix:\nEh? ...Excuse me?Lotta:\nReckon course! It's short for \"Ya reckon!? Of course I did!\" Aah!von Karma:\nDoes it look like I care? Just hurry up and show your picture to the court.Phoenix:\n(The moment of truth. What will be in that picture?)Lotta:\nUmm, let's see here... This here's the picture!Judge:\nHmm... It would certainly seem that only the defendant and the victim were in that room.Lotta's Photo added to the Court Record.von Karma:\nAre you ready, Mr. Phoenix Wright?Phoenix:\n(I will clear all doubt about Maya through this cross-examination... Just watch me!)Cross ExaminationCross Examination-- Witness's Account --Lotta:\nOnly the Doc and the defendant went into the Channelin' Chamber.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas it really only those two that went in!?\nvon Karma:\n\nvon Karma:\nWhat are you blabbering about!? You were there too, were you not!?\nPhoenix:\nUrk.\nvon Karma:\nWhy don't you answer that yourself? Was it really just the two of them?\nPhoenix:\n...Yes. Dr. Grey and Maya were the only two who went into the room...\nJudge:\nH-Hold on! We can't have the defense testifying against its own client!\nLotta:\nAnyway, folks, only the two of 'em went into the Channelin' Chamber, ya hear?\nvon Karma:\nBut you knew that from the very beginning, didn't you? ...Witness, continue.Lotta:\nWe were waitin' outside the door and then, \"bang!\" we hear this gunshot!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas it really a gunshot!?\nvon Karma:\n\nvon Karma:\nAre you insane!? You must have heard it as well!\nPhoenix:\nUrk.\nvon Karma:\nWhy don't you testify for the court, Mr. Phoenix Wright? Was it really a gunshot?\nPhoenix:\n...Yes. I think it was something that sounded like a gunshot...\nJudge:\nAnd why are we here listening to the defense testify!?\nPhoenix:\n(...And the world becomes just a little crueler...)\nLotta:\nI heard a gunshot a long time ago, so I know. And I tell ya that was a gunshot I heard. Now, this -- this is where the story heats up!Lotta:\nMr. Lawyer there broke the door down, and we rushed into the room.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo, let me get this straight! This \"Mr. Lawyer there\" broke the door down!?\nvon Karma:\nHonestly, Mr. Phoenix Wright. Why don't you tell us what happened, then?\nPhoenix:\nUm... Yes, Ms. von Karma... I broke the door down. Sorry. (Why does this feel like an inquisition?)\nLotta:\nNo need for apologizin'! That was great! You're a real man!\nJudge:\nOh, really? That's something I would've liked to see.\nPhoenix:\n(The judge is smiling rather openly. I'll take that as a good sign...)\nvon Karma:\nAnd? What did you see once you broke in?Lotta:\nInside was the dead victim, and the defendant, wavin' a pistol around.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAre you sure it was the defendant, Maya Fey!?\nLotta:\nSure, I'm sure!\nPhoenix:\n(Lotta seems awful confident in her testimony...)\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nLotta! Please, think back to that day one more time.\nLotta:\nWh-Whatcha getting' at?\nPhoenix:\nRemember what you said when we broke into the room...?\n\n\n???:\n...I was... murdered...\n\n*klik*\n\nPhoenix:\nLotta! At a time like this!?\nLotta:\nTimes like this are perfect for snapping up shots! But anyway... what's going on here!? This gal... Is she... ...Maya!?\n\n\nPhoenix:\nWhen you saw the murderer at that time, you couldn't even tell if it was Maya Fey or not! Am I correct!?\nLotta:\nAh, um, well, ya see...\nJudge:\nOrder! Ms. Hart! You are here to present accurate testimony!\nLotta:\nYeah, ah, s-sorry.\nPhoenix:\n(Good. This shifts things back to my side...)\nvon Karma:\nFor a defense lawyer, your defense is terribly lacking, Mr. Phoenix Wright.\nPhoenix:\n!\nvon Karma:\nWitness. Think back to when those two entered the Channeling Chamber.\nLotta:\nWhen they entered...?\nvon Karma:\nOne of those people that entered the chamber was Maya Fey, correct?\nLotta:\nYeah, that's right!\nPhoenix:\n(Yeah... It was Maya that went in.)\nJudge:\nHmm... It looks like we've come to a collective conclusion. The person in this picture is most certainly Maya Fey.\nvon Karma:\nExactly.\nPhoenix:\n(Rats! And I'm trapped like one... Again!)\nLeads back to cross-examination\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(Even I can see that any normal person would know who that was. It's no good. I shouldn't push my luck on this...)\nLeads back to cross-examinationLotta:\nI swear, other than those two, there was no one else in the room.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAre you absolutely certain of that!?\nLotta:\nSure am! But that old witch chased us out of the room, so...\nPhoenix:\n(\"Old witch\"? Does she mean Morgan Fey?)\nLotta:\nBut there was no one else in there, and you know it!\nPhoenix:\n(The Channeling Chamber was very dark, almost pitch black... Was there really no one else in there? What about...?)\n\n\n\nbehind the folding screen?\n\n\n\n\n\n\n\nPhoenix:\nWhat about... behind the folding screen? Did you check back there?\nLotta:\nReckgiven!\nPhoenix:\nHuh? What in the...?\nLotta:\nReckgiven! Ya know! \"Ya reckon!? That's a given!\" I took me a good look around the room once! There ain't no way anyone was hangin' out behind that foldin' screen!\nJudge:\nHmm... If I may have a word with you, Ms. Hart...\nLotta:\nWh-What? Ya got a problem!?\nJudge:\nReckgiven!... I mean, I am having a little difficulty in understanding you. If you would stop saying such things as \"Reckongiven\" and so forth... Aah!\nvon Karma:\nNow then, Mr. Phoenix Wright, do you see a problem with the testimony or don't you?\nLeads back to cross-examination\n\n\n\n\nbehind the door?\n\n\n\n\n\n\n\nPhoenix:\nWhat about... behind the door? Did you check there?\nLotta:\nWhat do I look like to you? I wasn't born yesterday, ya know! First off, the one that bust that door open was you! With the way ya slammed that door, anyone standin' behind it woulda had more face and less nose, free of charge!\nvon Karma:\nIn any case, there was no one standing behind the door.\nPhoenix:\n(She actually had the police investigate that too!?)\nLeads back to cross-examination\n\n\n\n\nunder the flooring?\n\n\n\n\n\n\n\nPhoenix:\nWhat about... under the flooring? Did you check there?\nLotta:\nI ain't no ignoramus to make it out here!\nPhoenix:\nHuh?... Wh-What are you talking about?\nLotta:\nDon't \"what are ya talkin' about\" me! Under the floorin'? C'mon!, even a bug wouldn't crawl under that!\nvon Karma:\nSorry to disappoint, but there was no secret passageway under the flooring.\nPhoenix:\n(Oh... Yeah, that was a bit far-fetched, huh...?)\nLeads back to cross-examinationPhoenix:\n(Argh! Her story adds up... What's worse, I was there at the scene of the crime with her... (Changed from [What's worse is that I was there at the scene of the crime at that time too,] in the original release) and her story is exactly how I would have told it, too... (Changed from [and her story is exactly how I would have told it...] in the original release))",
      "testimonies": [
        {
          "testimony": "Only the Doc and the defendant went into the Channelin' Chamber.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "We were waitin' outside the door and then, \"bang!\" we hear this gunshot!",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "Mr. Lawyer there broke the door down, and we rushed into the room.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "Inside was the dead victim, and the defendant, wavin' a pistol around.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "I swear, other than those two, there was no one else in the room.",
          "person": "Lotta",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- Witness's Account --Lotta:\nOnly the Doc and the defendant went into the Channelin' Chamber.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas it really only those two that went in!?\nvon Karma:\n\nvon Karma:\nWhat are you blabbering about!? You were there too, were you not!?\nPhoenix:\nUrk.\nvon Karma:\nWhy don't you answer that yourself? Was it really just the two of them?\nPhoenix:\n...Yes. Dr. Grey and Maya were the only two who went into the room...\nJudge:\nH-Hold on! We can't have the defense testifying against its own client!\nLotta:\nAnyway, folks, only the two of 'em went into the Channelin' Chamber, ya hear?\nvon Karma:\nBut you knew that from the very beginning, didn't you? ...Witness, continue.Lotta:\nWe were waitin' outside the door and then, \"bang!\" we hear this gunshot!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas it really a gunshot!?\nvon Karma:\n\nvon Karma:\nAre you insane!? You must have heard it as well!\nPhoenix:\nUrk.\nvon Karma:\nWhy don't you testify for the court, Mr. Phoenix Wright? Was it really a gunshot?\nPhoenix:\n...Yes. I think it was something that sounded like a gunshot...\nJudge:\nAnd why are we here listening to the defense testify!?\nPhoenix:\n(...And the world becomes just a little crueler...)\nLotta:\nI heard a gunshot a long time ago, so I know. And I tell ya that was a gunshot I heard. Now, this -- this is where the story heats up!Lotta:\nMr. Lawyer there broke the door down, and we rushed into the room.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo, let me get this straight! This \"Mr. Lawyer there\" broke the door down!?\nvon Karma:\nHonestly, Mr. Phoenix Wright. Why don't you tell us what happened, then?\nPhoenix:\nUm... Yes, Ms. von Karma... I broke the door down. Sorry. (Why does this feel like an inquisition?)\nLotta:\nNo need for apologizin'! That was great! You're a real man!\nJudge:\nOh, really? That's something I would've liked to see.\nPhoenix:\n(The judge is smiling rather openly. I'll take that as a good sign...)\nvon Karma:\nAnd? What did you see once you broke in?Lotta:\nInside was the dead victim, and the defendant, wavin' a pistol around.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAre you sure it was the defendant, Maya Fey!?\nLotta:\nSure, I'm sure!\nPhoenix:\n(Lotta seems awful confident in her testimony...)\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nLotta! Please, think back to that day one more time.\nLotta:\nWh-Whatcha getting' at?\nPhoenix:\nRemember what you said when we broke into the room...?\n\n\n???:\n...I was... murdered...\n\n*klik*\n\nPhoenix:\nLotta! At a time like this!?\nLotta:\nTimes like this are perfect for snapping up shots! But anyway... what's going on here!? This gal... Is she... ...Maya!?\n\n\nPhoenix:\nWhen you saw the murderer at that time, you couldn't even tell if it was Maya Fey or not! Am I correct!?\nLotta:\nAh, um, well, ya see...\nJudge:\nOrder! Ms. Hart! You are here to present accurate testimony!\nLotta:\nYeah, ah, s-sorry.\nPhoenix:\n(Good. This shifts things back to my side...)\nvon Karma:\nFor a defense lawyer, your defense is terribly lacking, Mr. Phoenix Wright.\nPhoenix:\n!\nvon Karma:\nWitness. Think back to when those two entered the Channeling Chamber.\nLotta:\nWhen they entered...?\nvon Karma:\nOne of those people that entered the chamber was Maya Fey, correct?\nLotta:\nYeah, that's right!\nPhoenix:\n(Yeah... It was Maya that went in.)\nJudge:\nHmm... It looks like we've come to a collective conclusion. The person in this picture is most certainly Maya Fey.\nvon Karma:\nExactly.\nPhoenix:\n(Rats! And I'm trapped like one... Again!)\nLeads back to cross-examination\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(Even I can see that any normal person would know who that was. It's no good. I shouldn't push my luck on this...)\nLeads back to cross-examinationLotta:\nI swear, other than those two, there was no one else in the room.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAre you absolutely certain of that!?\nLotta:\nSure am! But that old witch chased us out of the room, so...\nPhoenix:\n(\"Old witch\"? Does she mean Morgan Fey?)\nLotta:\nBut there was no one else in there, and you know it!\nPhoenix:\n(The Channeling Chamber was very dark, almost pitch black... Was there really no one else in there? What about...?)\n\n\n\nbehind the folding screen?\n\n\n\n\n\n\n\nPhoenix:\nWhat about... behind the folding screen? Did you check back there?\nLotta:\nReckgiven!\nPhoenix:\nHuh? What in the...?\nLotta:\nReckgiven! Ya know! \"Ya reckon!? That's a given!\" I took me a good look around the room once! There ain't no way anyone was hangin' out behind that foldin' screen!\nJudge:\nHmm... If I may have a word with you, Ms. Hart...\nLotta:\nWh-What? Ya got a problem!?\nJudge:\nReckgiven!... I mean, I am having a little difficulty in understanding you. If you would stop saying such things as \"Reckongiven\" and so forth... Aah!\nvon Karma:\nNow then, Mr. Phoenix Wright, do you see a problem with the testimony or don't you?\nLeads back to cross-examination\n\n\n\n\nbehind the door?\n\n\n\n\n\n\n\nPhoenix:\nWhat about... behind the door? Did you check there?\nLotta:\nWhat do I look like to you? I wasn't born yesterday, ya know! First off, the one that bust that door open was you! With the way ya slammed that door, anyone standin' behind it woulda had more face and less nose, free of charge!\nvon Karma:\nIn any case, there was no one standing behind the door.\nPhoenix:\n(She actually had the police investigate that too!?)\nLeads back to cross-examination\n\n\n\n\nunder the flooring?\n\n\n\n\n\n\n\nPhoenix:\nWhat about... under the flooring? Did you check there?\nLotta:\nI ain't no ignoramus to make it out here!\nPhoenix:\nHuh?... Wh-What are you talking about?\nLotta:\nDon't \"what are ya talkin' about\" me! Under the floorin'? C'mon!, even a bug wouldn't crawl under that!\nvon Karma:\nSorry to disappoint, but there was no secret passageway under the flooring.\nPhoenix:\n(Oh... Yeah, that was a bit far-fetched, huh...?)\nLeads back to cross-examinationPhoenix:\n(Argh! Her story adds up... What's worse, I was there at the scene of the crime with her... (Changed from [What's worse is that I was there at the scene of the crime at that time too,] in the original release) and her story is exactly how I would have told it, too... (Changed from [and her story is exactly how I would have told it...] in the original release))After pressing all statements:Phoenix:\n(Argh! Just as I thought, there is nothing wrong with her testimony! I was with her, so I know she's telling the truth...)Judge:\nEnough. It seems that there are no issues with Ms. Hart's testimony.von Karma:\nAt the time of the crime, only two people were in the Channeling Chamber: the victim, Dr. Turner Grey, and the defendant, Maya Fey.Judge:\nHmm... The face of the defendant can not be verified in this picture. However, if we think about the circumstances, it would have to be the defendant.Phoenix:\n(What am I going to do!? If I just let this go...)Judge:\nWhat is it, Mr. Wright? You look as if you have something to say...Phoenix:\n(If I make one wrong move, I'm going to have the judge against me... Is there anything I can present that would prove it's not Maya in that photo?)Present evidence\n\n\n\n\n\n\n\nPhoenix:\nYour Honor!\nJudge:\nMr. Wright!\nPhoenix:\nIt is possible that the person in this photo is not the defendant!\nJudge:\nWh-Wh-What!? Do you know what you are proposing!?\nLotta:\nY-Y-Yeah! That's just plain fool's talk!\nPhoenix:\n(Thanks guys. Your show of support was just great...)\nvon Karma:\n...\nJudge:\n...Now, then, Mr. Wright. Please show the court some proof. Prove to this court that the person in this photo is not Maya Fey!\n\n\n\nPresent anything\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHere is your proof!\nvon Karma:\n\nvon Karma:\n...\nPhoenix:\nIs there a problem?\nvon Karma:\nOh, no. I thought I would work on my inflections. Just wondering what an \"Objection!\" with a twist of \"You're wrong!\" sounds like.\nJudge:\nMr. Wright. I'm sorry, but I don't follow your logic.\nPhoenix:\n(Shoot. I guess I wasn't showing enough confidence...)\n\n\n\nPresent another piece\n\n\n\n\n\n\n\nLeads back to:\n\"...Now, then, Mr. Wright. Please show the court some proof.\"\n\n\n\n\nGive up\n\n\n\n\n\n\n\nLeads to:\n\"Well, Mr. Wright?\"Can't present anything yet\n\n\n\n\n\n\n\nLeads to:\n\"Well, Mr. Wright?\"Judge:\nWell, Mr. Wright?Phoenix:\nNothing, Your Honor...von Karma:\nThat's very smart of you, Mr. Phoenix Wright. You really should give up trying to prove this is not Maya Fey.Phoenix:\n(I didn't say anything about giving up! I just don't have the right piece of evidence to prove my argument...)Judge:\nThat's enough!Phoenix:\n(I-Is this it...? Is this all I could do...?)Judge:\nI think it is quite obvious to this court that a verdict of not guilty is not possible.von Karma:\nI told you. Totally, 100% impossible.Judge:\nMs. von Karma, do you have any further questions for this witness?von Karma:\nHaving established the defendant's guilt, further questioning won't be needed.Judge:\nWhat about the defense? No further questions, I presume?Phoenix:\n(I... I couldn't protect Maya...) The defense... The defense......Phoenix... ...Phoenix, you can't make that kind of face... ...A lawyer is someone who smiles... no matter how bad it gets!...Phoenix:\nM-Mia!Mia:\nI guess I made it just in time, wouldn't you say?Phoenix:\nY-You... But... P-Pearls!Mia:\nHer clothes ARE a bit small... Anyway, what are you waiting for, Phoenix!? Let's go!Phoenix:\nB-But how!? She's already taken away every advantage!Mia:\nThe advantage is still in your hand! Think carefully, one more time, about what you saw in the Channeling Chamber. Do you remember what you told me yesterday?Phoenix:\nD-Dr. Grey!!*klik*???:\n...I was... murdered...Phoenix:\nW-What!?*klik*Phoenix:\nLotta! At a time like this!?Lotta:\nTimes like this are perfect for snapping up shots!Mia:\nYou see... There is one final piece to this puzzle. (Changed from [You see... There is one final piece of the puzzle.] in the original release)Phoenix:\nMia...?Mia:\nQuestion Lotta one more time, Phoenix. I don't know if she's doing it unconsciously or on purpose, but... (Changed from [I don't know if she's doing it subconsciously or on purpose, but...] in the original release) she's not testifying truthfully.Judge:\nNow then, this court would like to end the cross-examination period.Phoenix:Phoenix:\nPlease wait, Your Honor! The defense would like to request that the witness testify one more time.Judge:\nOverruled. I'm afraid you're too late, Mr. Wright. The cross-examination has already ended. Furthermore, any unrelated ques- Aah!von Karma:\nIt's fine. I'll allow another testimony. A Von Karma's case is perfect. Absolutely flawless. And what better time than this for you to see that.Judge:\nB-But... I mean... I have some place I must go after this... Mmph! A-Al-Alright! I'll allow it! Ms. Hart! Hurry and give us another testimony!Lotta:\nWell... heck... What am I supposed to talk about?Phoenix:\nPlease tell us once more, what happened when you burst into the Channeling Chamber.Lotta:\nOK! You got it!Mia:\nSee, you got through to the judge somehow, right?Phoenix:\n(Well, actually it was Von Karma's whip that got through to him...)Witness Testimony-- Witness's Account, Pt. 2 --Lotta:\nWhen we broke into that room, all I could focus on was Maya.\nI was... uh, kinda scared of the dead body, so I didn't take a good look at it.\nI'm really bad when it comes to blood and ghosts and stuff.\nBut I still managed to point my camera at Maya and take a shot!Judge:\nNothing sounds different from before...Phoenix:\n(Some parts of her testimony were very vague. I should press her on those sections!)von Karma:\nStruggle all you like as you taste the bitterness of your defeat. Well, amuse me with your useless questions, Mr. Phoenix Wright. I'm waiting...Cross ExaminationCross Examination-- Witness' Account, Pt.2 --Lotta:\nWhen we broke into that room, all I could focus on was Maya.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo, what did she look like?\nLotta:\nYa know, she looked almost like a different person.\nJudge:\nA... A different person?\nvon Karma:\nShe may have seemed like a different person, however, she was still Maya Fey. We have already made that point abundantly clear!\nJudge:\nYes, that is true... Well, then, Ms. Hart. Did you happen to see anything else?Lotta:\nI was... uh, kinda scared of the dead body, so I didn't take a good look at it.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThen perhaps that body was not Dr. Grey's at all!\nLotta:\nEh!? W-Well... I reckon that's possible...\nvon Karma:\n\nvon Karma:\nIf the body inside that room was not that of Dr. Grey, then whose body was it, Mr. Phoenix Wright!?\nPhoenix:\nWell, what if it was that of Maya Fey after the channeling? Or maybe -- Oww!\nvon Karma:\nFoolish fool spouting foolish foolishness, just as I expect of a foolish fool such as you. If that were the case, then that would mean that Maya Fey is, in fact, dead. And that would make the defendant's chair quite a lonely place, wouldn't it!?\nPhoenix:\n(Urk... Sorry, Maya...)\nLotta:\nAre y'all done here? Can I continue?Lotta:\nI'm really bad when it comes to blood and ghosts and stuff.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAnd even knowing that, you still persist in being a paranormal photographer?\nLotta:\nThat's why I'm getting out of this here business. This gal's gonna get the dirt on the stars and be a tabloid photographer from now on!\nPhoenix:\n(She goes through jobs faster than a baby through diapers.) Wah!\nvon Karma:\nMr. Phoenix Wright. Would it kill you to stay on topic for a change?\nJudge:\nWell? Would it, Mr. Wright?\nPhoenix:\n(Nice, tag-teamed in stereo. Guess I should be grateful it's not in 5.1...)Lotta:\nBut I still managed to point my camera at Maya and take a shot!Press\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Two, right?\"Mia:\nThere must be something we can use in her testimony just now. We must find it! At all costs...",
      "testimonies": [
        {
          "testimony": "When we broke into that room, all I could focus on was Maya.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "I was... uh, kinda scared of the dead body, so I didn't take a good look at it.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "I'm really bad when it comes to blood and ghosts and stuff.",
          "person": "Lotta",
          "present": []
        },
        {
          "testimony": "But I still managed to point my camera at Maya and take a shot!",
          "person": "Lotta",
          "present": []
        }
      ],
      "noPresent": true
    }
  ]
}