{
  "previousContext": "That was... no accident... I was drugged... with sleeping pills... I was murdered... by that person... That's why... I took... my revenge... It's only fair... Isn't it... ...Ini?\nMaya:\nI finally get to see you again, and...\nPhoenix:\nIt's not your fault. You didn't do it.\nMaya:\nNo, I... I did it... I killed that person.\nPhoenix:\nBut that wasn't you.\nMaya:\nIt doesn't matter. It might as well have been me.\nPhoenix:\n(I can't believe something like this happened...The events of that gloomy, rainy afternoon that started this whole mess...keep playing through my mind...)\nEpisode 2Reunion, and Turnabout\nJune 16, 3:34 PMWright & Co. Law Offices\n???:\nWhat depressing rain... Do you understand how depressed that makes me!? Do you!?\nPhoenix:\nUh, I guess...\n???:\nBut actually, more than being depressed, I'm angry. Angry at that weather girl on TV. \"I think our little rainy spell will take a break with a day of sun!\"...is what that girl said! I'd stake my life on it!\nPhoenix:\nWell, it's the weather...\n???:\nBut that's why I didn't bother to bring an umbrella today. What nerve, calling herself a weather girl! She's going to hear about my $1500 suit!\nPhoenix:\nUm... About your case... Unless you're planning on suing the weather girl...?\n???:\n... I'm sorry. I thought that before we got down to business, we could have some friendly chatter. My name is Dr. Turner Grey. I'm a surgeon.\nPhoenix:\n(Remind me never to end up under his knife...)\nGrey:\nI'm here today because of this incident.\nPhoenix:\n\"Malpractice at Grey Surgical Clinic. Fourteen In-Patients Lose Their Lives!\" ...Oh. You're... the doctor at...?\nGrey:\nIt's really quite upsetting. Did you hear me!? UPSETTING!\nPhoenix:\nYes, yes, I heard you. I agree, it's quite upsetting, Dr. Grey.\nGrey:\nThe one that screwed up was that nurse! It was her that got the medications mixed up and killed those 14 patients! And yet! Now listen good! And yet! That nurse had the nerve to go and die before admitting to her wrongdoing! She didn't even offer any sort of explanation to me! And this is the kicker! She up and has herself a grand ol' accident and crashed her car! Smash! Crunch! Instantly transforming her car into the accordion model!\nPhoenix:\n(That's right... About a year ago, all the tabloid shows were talking about it. Fourteen victims of medical malpractice and the nurse's mysterious fatal accident. There were rumors that Dr. Grey had actually caused that crash. People said it was to forever hide the person responsible for the malpractice incident.)\nGrey:\nWhy would I...? Now, I'm just going to say this once -- Why on Earth would I want to kill that nurse? She's the one who killed those 14 patients! Not me!\nPhoenix:\nI think you need to take a deep breath, doctor, and focus... More to the point, this case is over a year old. Why bring it up now...?\nGrey:\nThat's simple! Because the situation is slipping out of my grasp. This just won't do. My clinic isn't seeing nearly as many patients nowadays. Do you understand what that means!? It means they're not coming to my clinic!\nPhoenix:\n(You don't say...? If it were me, I don't think I'd want to go either.) So... what would you like me to do about it...?\nGrey:\nI want you to help me prove I'm innocent.\nPhoenix:\nUm, you do realize I'm a lawyer, not a private investigator, right?\nGrey:\nNo, this is something only you can do.\nPhoenix:\n...?\nGrey:\nMaya Fey. You know this girl, correct?\nPhoenix:\n...! (Maya! Why would he know her name...!?)\nGrey:\nI heard you were working under her for a little while.\nPhoenix:\nWell, yes... I mean... Hey, wait a second here! I worked UNDER her!?\nGrey:\nYes. Am I wrong? She told me, so I'm not quite sure if...\nPhoenix:\nWell, we worked a few trials together. But she went back to her hometown to undergo more training.\nGrey:\nAh, yes, I heard. It must be lonely for you.\nPhoenix:\nWh-What!? Wait... I'm not...!\nGrey:\nShe must be an extraordinary girl to handle such rigid training.\nPhoenix:\nHuh?\nGrey:\nI have an acquaintance who knows a lot about these mystical sorts of things. She's the one who introduced me to Ms. Fey.\nPhoenix:\n(Is Maya... really that famous...?)\nGrey:\nAnd I've already set up an appointment.\nPhoenix:\nFor what?\nGrey:\nWhat else!? A channeling! I'm going to have her call the spirit of that nurse that went and got herself killed!\nPhoenix:\nO-Oh. (Maya... I wonder what she's up to right now...)\nMaya:\nWe, the women of the Fey clan have always been spirit mediums. (Changed from [We, the women of the Fey family, have always been spirit mediums.] in the original release) It's because the power to communicate with spirits flows strongly through us.\nPhoenix:\n(That's what she told me... I guess she's learned to accept her responsibilities and become an adult...)\nGrey:\nNot counting training, this will be her first time channeling a spirit, so she gave me one condition before accepting my request.\nPhoenix:\nA condition...?\nGrey:\nThe condition is you, Mr. Wright. She said that she wouldn't do the channeling without first seeing you again.\nPhoenix:\nMe...?\nGrey:\nAnd that is why I've searched you out! You want to see her too, don't you!?\nPhoenix:\n(And so... that is how I ended up visiting Maya's hometown with the doctor...)\nJune 19, 1:25 PMKurain Village\nPhoenix:\n(So this is Kurain Village; Maya's hometown.)\n???:\n...\nPhoenix:\nW-Why, hello there.\n???:\n...\nPhoenix:\nHmm... What an odd little girl.\n???:\nHey! Wait up, Pearly!!\nPhoenix:\n(Hm? Someone else is coming this way...)\n???:\nNiiiiiiiick!\nPhoenix:\nM-Maya. How are you...? It's good to see you again.\nMaya:\nWow, I didn't think you'd really show up!\nPhoenix:\nIt's not that big a deal. You made it sound like you were soooo far away.\nMaya:\nWell, maybe I exaggerated... just a little.\nPhoenix:\nIt was only 2 hours by train. If I had known you were this close, I'd have visited more.\nMaya:\nNo! You're not allowed. I already decided, you know. Until I become an adult, I have to work hard and be strong by myself...\nPhoenix:\nOh... well... Anyway, congratulations. I'm glad to hear training is going well for you.\nMaya:\nHeh, heh...\nAfter clearing all Talk options:\nMaya:\nWell, Nick, I've got to get going. It's about time for the channeling to start.\nPhoenix:\nHuh? Oh, yeah...\nMaya:\nI'm doing the channeling in my house, so come on in, OK? After I'm done, we can grill up some juicy burgers!\nPhoenix:\nAlright. Good luck, Maya.\nMaya:\nThanks!\nPhoenix:\n(Well... At least she's still the same perky Maya.)\nJune 19Fey ManorMeditation Room\nGrey:\nAh, Mr. Wright. I'm so glad you showed.\nPhoenix:\nSome nice weather we're having today. Aren't you happy?\nGrey:\nNo, not at all. That stupid weather girl made the wrong call again. \"It will rain cats and dogs today!\" she said with a straight face. I can't believe they allow such misguided reports on the public airwaves!\nPhoenix:\n(Looks like talking about the weather with this guy is just asking for punishment...)\nGrey:\n...But anyway, this is a splendid manor.\nPhoenix:\n(No argument there... It's hard to believe that this is Maya's house, though...)\nGrey:\nI was given a guidemap to this building. Here, Mr. Wright. I have a copy for you too.\nGuidemap added to the Court Record.\nJune 19Fey ManorChanneling Chamber\nPhoenix:\n(Wow... It's such a strange atmosphere in here... These flickering lights... I guess they're candles...)\n???:\nGood sir! Who might you be...?\nPhoenix:\nAaah! I-I'm, uh, my name is Phoenix Wright...\n???:\nOh... You must be that good sir...\nPhoenix:\n(\"Good sir\"...? Is she talking about me?)\n???:\nYou are a lawyer, are you not, good sir? I have heard much about you from Mystic Maya.\nPhoenix:\nIs that so? (\"Mystic\" Maya...?)\n???:\nI am Mystic Maya's aunt, Morgan Fey.\nPhoenix:\nN-Nice to meet you.\nMorgan:\nAh, I had wanted to speak with you about a certain incident, good sir. It would seem that perhaps you ask too much of Mystic Maya in performing your duties. Most unbecoming, I'm afraid.\nPhoenix:\nHuh?\nMorgan:\nDon't tell me you have already forgotten? That was it not for Mystic Maya and her assistance, you would surely not have won...\nPhoenix:\n(First a girl that runs away, and now an old lady who says I stink at doing my job... When did I become the poster boy for \"How Not to Make a First Impression\"...?)\nMorgan:\nThe past is the past though. Let us speak of the present now.\nPhoenix:\n...Ah, thank you...\nAfter clearing all Talk options:\nMorgan:\n... Oh, yes. I wonder if you have yet to meet Pearl, good sir.\nPhoenix:\nPearl?\nMorgan:\nShe is an adorable, angelic young girl.\nPhoenix:\nOh, that odd...\nMorgan:\nShe is my daughter. Now then, what was it you were about to say...?\nPhoenix:\nWh-What a cute daughter you have... Ahaha...\nMorgan:\nA pure heart that knows not of the evils in this world is a powerful thing, good sir. Please refrain from affiliating with her, I request.\nPhoenix:\n(Well, it's not like I had the chance to anyway...)\nMorgan:\nI must insist and stress that you not let it occur.\nPhoenix:\nOkay, okay, I get it!\nJune 19Fey ManorWinding Way\nPhoenix:\n(Wow. This garden is really breath-taking. Someone put a lot of love into it. What is that over there...? ...Is that an incinerator? It looks a little out of place in a garden like this...)\nJune 19Fey ManorSide Room\nPhoenix:\n(So this is... the Side Room. Looks like it's more of a break room. There is bedding spread out on the floor. It looks like someone's sleeping in one. I shouldn't disturb them...)\nWinding Way (after visiting Side Room and clearing all Talk options in Fey Manor - Channeling Chamber)\n???:\nHey! You! Hold on, now! This gal's got a few questions to ask!\nPhoenix:\n(Hmm... I'm sure I've heard that southern accent somewhere before...)\n???:\nOh, well I'll be! It's Mr. Phoenix Wright! How ya been!? Haven't seen you in, what, a year!?\nPhoenix:\nUm... You... are... uh...\nLotta:\nOh, that's right! This ain't no time to be wastin' time! The channeling's about to get started!\nPhoenix:\nIs it that time already!?\nLotta:\nWe all should hurry up and get to the Meditation Room. ...What are you waiting around for!? Come on!\nPhoenix:\n(Lotta Hart, huh? I've been judging her harshly because of that case, but, I guess looking back, we had some good times, too...)\nJune 19Fey ManorMeditation Room\nMorgan:\nWe will now begin the channeling. Mystic Maya and honored guest, please proceed into the Channeling Chamber.\nGrey:\nWith this, I can finally swat all those pesky flies, once and for all! You hear me!? They won't be able to say a single bad thing about me after this! You would love to hear them apologize, wouldn't you? Wouldn't you, Mr. Wright!?\nPhoenix:\nMe!? Oh, uh, yeah, I sure would.\nMorgan:\nMystic Maya, do you have the Channeling Chamber key?\nMaya:\nYup, right here.\nMorgan:\nThat is most satisfactory. That key is one-of-a-kind, so please take care of it well.\nMaya:\nIt'll be fine, Aunt Morgan. I won't lose it, trust me! OK, Dr. Grey. Let's get started.\nGrey:\nFinally! Let's go!\n*click*\nMorgan:\nNow let us wait patiently out here for them. Please have some lovely bitter green tea and jaw-droppingly large strawberry desserts...\nLotta:\nHold on, now, granny!\nMorgan:\n...Granny?\nLotta:\nHow come we ain't allowed in that room!?\nMorgan:\nDear madam, you have an \"impressive\" grasp of English. From where did you learn it?\nLotta:\nWhat!? I'm from the heart of the heartland!\nMorgan:\nIs that so? Then I humbly request that you return to this \"Heart of the Heartland\".\nLotta:\nWh-What are ya...?\nMorgan:\nThis is Kurain Village. If you can not follow our traditions and rules, we request that you leave!\nLotta:\n...! ... Sorry.\nPhoenix:\n(Wow. She shut Lotta up! Now THAT's impressive!)\nMorgan:\nNow then, let us wait.\n*BANG*\nLotta:\nHey now! Wh-What was that just now!?\nPhoenix:\n(It came from inside the Channeling Chamber...)\n*BANG*\nLotta:\nHey! Th-That's a gunshot!\nMorgan:\nE-Excuse me!?\nLotta:\nI've heard that sound before. It's a gunshot! I'd bet my afro on it!\nPhoenix:\n(M-Maya! Maya's in there!)\nLotta:\nYeah! Now that's what I call being a man!\n*SLAM* *SLAM* *CRASH!*\nPhoenix:\nD-Dr. Grey!!\n*klik*\n???:\n...I... ...I was... murdered...\nPhoenix:\nM-Maya?\n???:\nThat man... ...murdered me... ...so I killed... him...\nPhoenix:\nWh-What!?\n*klik*\nPhoenix:\nLotta! At a time like this!?\nLotta:\nTimes like this are perfect for snapping up shots! But anyway... what's going on here!? This gal... Is she... ...Maya!?\nStep away from there!\nMorgan:\nPlease leave this area to me. Go quickly and inform the police!\nPhoenix:\nBut, but...\nMorgan:\nHurry! Before there are more victims here!\nLotta:\nHey, let's go, City Boy! Leave this to the granny!\nJune 19Kurain Village\nPhoenix:\n(My cell phone doesn't get reception way out here... So I ended up using the phone booth to call the police...)\nLotta:\nAnd...?\nPhoenix:\nThey're on their way.\nLotta:\nThat's good. Lawdy, I saw a genuine \"mysterious phenomenon\"...\nPhoenix:\n(She seems really on edge because of all this... Not that I blame her... I'm scared to death by what's going on...)\nJune 19Fey ManorMeditation Room\nMorgan:\nAh, Mr. Wright.\nPhoenix:\nMs. Fey! How's, um... Mystic... Maya?\nMorgan:\nShe has returned to \"this world\". The Spirit Severing Technique was successful.\nPhoenix:\nLet me see her, please!\nMorgan:\nShe is still unconscious. I humbly request that you wait outside for her recovery.\nPhoenix:\n(Guess I just have to wait... *sigh*)\nGumshoe:\nThe police are here! Sorry to keep you waiting! Huh? ...You again!?\nPhoenix:\nWhat are you doing all the way out here, Detective Gumshoe?\nGumshoe:\nIt's actually kinda funny. I was in the area for a business trip, pal. Well, time to check out the crime scene. I'll have to question everyone here later on, so just sit tight, alright?\nPhoenix:\n(Why is he grinning at me...?)\nMorgan:\nShall I show you to the scene of the crime, Detective Gymshoe?\nGumshoe:\nUm... My name isn't Gymshoe...\nPhoenix:\n(The two of them went into the Channeling Chamber... I guess all I can do for now is see what everyone else has to say...)\nJune 19Kurain Village\nLotta:\n...\nPhoenix:\n(She's probably scared out of her wits after having a murder take place right near her.) Lotta?\nLotta:\nGAWDDON'TLETITBEMENEXT!\nPhoenix:\nEek! Don't scare me like that!\nLotta:\nWhat do you mean!? Yer the one scaring me! If I weren't so tough, you'd have another dead body on yer hands -- mine!\nPhoenix:\nDid you see or notice anything that stuck out at you?\nLotta:\nNah... Well, maybe one thing...\nPhoenix:\nWhat is it!?\nLotta:\nTurns out my poor stomach's not good at handlin' this kind of thing.\nPhoenix:\nHuh-what?\nLotta:\nCurses and ghosts and stuff comin' back to get ya... This is just too much, I say.\nPhoenix:\nWhat is too much?\nLotta:\nBeing an occult photographer. That's some scary stuff, so I think I'm gonna try being a celebrity photographer, now.\nPhoenix:\nGoing after photos more within your reach from now on? More glamour, less gore?\nLotta:\n...\nPhoenix:\nWhat's up?\nLotta:\nOh, yeah!\nPhoenix:\nWh-What is it?\nLotta:\nI took some hot pictures earlier!\nPhoenix:\nHuh?\nLotta:\nRemember!? I took some pictures at the murder scene inside!\nPhoenix:\n(Ack! She did! Two even!)\nLotta:\n\"The Séance Murder\"... I sure like the ring of that. It'll be a sensational story!\nPhoenix:\nL-Lotta!\nLotta:\nSorry, but my journalistic sense is burnin' inside me! Hate to cut and run, but I'm headin' back in! Gotta beat those cops to the scoop of the century! UWAAAAAAAAAAAAAAAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHAHAHAHAhahahahahahahahahahaha... ...\nPhoenix:\n(I don't know who's scarier... Lotta or the spirits... And why does it feel like we've been through this before...?)\nJune 19Fey ManorChanneling Chamber\nPhoenix:\n(The police are busily running here and there, and I don't see Maya anywhere...)\nGumshoe:\nH-Hey, you! Don't touch anything!\nPhoenix:\nLook, I really need to ask you some questions!\nGumshoe:\nUmm... Don't look at me like I'm some sort of uncaring jerk... Tell you what, pal. I'll let you ask me a few questions, alright?\nJune 19Fey ManorSide Room\nPhoenix:\n(Hmm, I'm pretty sure there was someone sleeping here earlier...)\n???:\nLike, how can I help you?\nPhoenix:\nAck! Ah, I'm, uh... That is... I...\n???:\nUm, like, so isn't it about time to start?\nPhoenix:\nHuh? Time to start what?\n???:\nYou know, like, the channeling!\nPhoenix:\nChanneling...? Oh, oh, oh, oh!! No, actually, the situation has kind of changed...\n???:\nHuh? Like, what do you mean?\nPhoenix:\nPlease stay calm, but... there has been a murder! (Changed from [Please stay calm, but... a murder has taken place!] in the original release)\n???:\n... Um, so, like... A murder is that thing where, like, one person kills another, right?\nPhoenix:\nYes! A person has killed another person!\n???:\nOh, that's... Uh... What are the words I'm looking for...? It's like... ...like totally a bummer.\nPhoenix:\n...Yeah... (After all that effort, that's all she had to say?)\n???:\nOh, I'm sorry. I forgot to, like, introduce myself.\nIni:\nMy name is Ini Miney. Um... At the college, I'm researching and studying \"parapsychology\".\nPhoenix:\n\"Parapsychology\"?\nIni:\nThat's right. Um... I think people, like, usually call it, \"occult studies\" or something. Like supernatural phenomenon, ESP and psychic powers. That sort of stuff.\nPhoenix:\n(That's pretty out there...) I'm Phoenix Wright, attorney at law.\nJune 19Fey ManorWinding Way\nPhoenix:\n(There's no one here... as usual.) Ack! ...H-Hey... How are you?\nPearl:\n...\nPhoenix:\nYou're Pearl, right?\nPearl:\n...\nPhoenix:\n(Hmm. Silent as ever... ...? What's that she's got in her hand? I've seen it somewhere before...)\nAfter clearing \"Any ideas\" Talk option in Kurain Village and clearing all Talk options in Fey Manor - Channeling Chamber and Fey Manor - Side Room:\nJune 19Fey ManorMeditation Room\nMorgan:\nOh, dear madam... You have such impeccable timing.\nIni:\nLike, what's all the buzz?\nGumshoe:\nAhem. Alright everyone, listen up! You too, pal! I'm going to give you all a brief update! Right now, it looks like the investigation's not going to be done until real late...\nMorgan:\nThat is a terrible shame. I propose that everyone sleep here under the roof of the Fey Manor tonight.\nPhoenix:\n(What a mess. I can't believe how crazy this day turned out... Maya was arrested and taken away by the police. And I don't see myself getting any sleep tonight...)\nJune 20, 8:02 AMFey ManorMeditation Room\nPhoenix:\n(*yawn* Uuugh... Morning... I guess I must have nodded off at some point... I hope Maya's OK. I should hurry and get to the Detention Center, ASAP!)\nJune 20, 10:34 AMDetention CenterVisitor's Room\nMaya:\nN... Nick! Nick! I...!\nPhoenix:\nMaya!\nMaya:\nWhat am I going to do!? I never imagined it would turn out like this!\nPhoenix:\nCalm down, Maya! Take deep breaths. (Come to think of it, the first time I met her... It all started right here, in this detention center...)\nMaya:\nI finally... I finally get to see you again, and...\nPhoenix:\nIt's not your fault. You didn't do it.\nMaya:\nNo, I... I did it... I killed that person.\nPhoenix:\nBut that wasn't you.\nMaya:\nIt doesn't matter. It might as well have been me. I was too weak... and I... I couldn't control the spirit's power, so...\nPhoenix:\n(I don't want to bring up the case quite yet, but...)\nMaya:\n...You don't have to be nice to me. I understand.\nAfter clearing all Talk options:\nPhoenix:\n... (...I guess this is about all the information I'm going to gather for today...) I'll be back later, Maya. In the meantime, please make sure you prepare it, OK?\nMaya:\nHuh? \"It\"? What is \"it\"?\nPhoenix:\nThe document requesting me to be your attorney, of course.\nMaya:\n...! But...\nPhoenix:\nWhat's wrong?\nMaya:\nAre you sure? I mean, I'm guilty! I'm a murderer!\nPhoenix:\nNo one's decided that yet.\nMaya:\nBut I did! I killed that person... with these... two hands...!\nPhoenix:\nThat's enough, Maya.\nMaya:\nIt's hopeless! If you defend me, you'll lose, I'm sure...\nPhoenix:\nStop it!\nMaya:\n... ...Help me... Nick, help me... I'm scared...\nPhoenix:\nDon't worry, I will. When is the trial?\nMaya:\nIt sounds like tomorrow.\nPhoenix:\n(As usual, zero prep time...) Alright. I'm going now.\nMaya:\nWait.\nPhoenix:\n...?\nMaya:\nThis jewel... This is called a Magatama. It's a magical charm and it's always protected me. Give this to Pearly... And I'm sure she'll lend you her spiritual powers.\nMagatama received from Maya.\nJune 20Wright & Co. Law Offices\nPhoenix:\nPhew. It feels like I've been gone forever. But it's only been one day... (Oh, that's right!) Where's that newspaper Dr. Grey brought the other day...? ...Ah, here it is. Right on top of my desk. (This is the only thing he left behind that's going to be of any help...)\nNewspaper Clipping 1 added to the Court Record.\nAfter visiting Wright & Co. Law Offices or Kurain Village:\nJune 20Detention CenterVisitor's Room\nPhoenix:\n(Maya must still be in questioning... I hope the detectives are taking it easy on her, but... these kinds of cases aren't taken lightly. I guess I'll come back later.)\nJune 20Kurain Village\nPhoenix:\n(I have to save Maya, no matter what! It's her life on the line! What in the world happened in that room yesterday?)\nJune 20Fey ManorMeditation Room\nPhoenix:\n(The Meditation Room nurtures all mediums young and old. Even mediums in training, I'd wager. But it's pretty deserted today... ...probably because of the murder yesterday...)\nJune 20Fey ManorChanneling Chamber\nPhoenix:\nIt looks like Detective Gumshoe isn't here today... I should take this chance and thoroughly check this room. If I'm lucky, I might uncover a clue or two...\nMorgan:\nOh, Mr. Wright.\nPhoenix:\nGood morning.\nMorgan:\nI am on my way to go meet Mystic Maya, and I thought to bring her some items to make her feel more at home. Namely, tea so bitter you lose your tongue and jaw-droppingly large strawberry desserts.\nPhoenix:\nI'm sure Maya will be very grateful...\nMorgan:\nThat's \"Mystic Maya\", good sir!\nPhoenix:\n(Urk. She is one scary lady.)\nMorgan:\nOh, dear, sweet Mystic Maya... Pearl wept constantly for you last night, as did I.\nPhoenix:\n(I know it's important for me to search the site, but I should ask her some questions too, while I have the chance...)\nAfter clearing all Talk options and examining folding screen:\nMorgan:\nWell, then, I do believe it is time for me to take my leave.\nPhoenix:\nAlright. Please tell Maya I said hi.\nMorgan:\nWhat was that!?\nPhoenix:\nUh, I mean, Mystic Maya.\nMorgan:\nI will tell her.\nPhoenix:\n(...*sigh*)\nJune 20Fey ManorWinding Way\nPhoenix:\n(Little Pearl isn't here today... Maybe she's at school?)\nJune 20Fey ManorSide Room\nIni:\nOh, hey! Like, you're that guy from yesterday... The, uh, dentist guy...\nPhoenix:\nNo, no, I'm a lawyer.\nIni:\nThat's right! Um... Mr. Smith, Esquire.\nPhoenix:\n...That's \"Wright\". Wait, I mean, you're wrong. My name is \"Wright\".\nIni:\n\"Smith\", \"Wright\"... Well, I got, like, three letters, at least.\nPhoenix:\n(I don't think she gets the point...) Anyway, why are you here?\nIni:\nSo, like, I study this thing called \"parapsychology\" at this college and...\nPhoenix:\nUm, you told me about that yesterday. The sesame allergy, too. What I'd really like to know is why you're still here today?\nIni:\nOh! So, like, that's what you meant! Like, you shoulda been more, like, clear about it!\nPhoenix:\nS-Sorry. My bad.\nIni:\nNo, it's OK. Like, it's really...\nPhoenix:\n...\nIni:\n...?\nPhoenix:\n...That's it? Why'd you stop mid-sentence!?\nIni:\nDid I? ...So, like... what was I talking about again...?\nPhoenix:\n... (If Lotta ever wanted another \"genuine mysterious phenomenon\", it's right here.)\nAfter clearing all Talk options and examining folding screen in Fey Manor - Channeling Chamber, and clearing \"The victim\" Talk option in Fey Manor - Side Room:\nJune 20Fey ManorWinding Way\nPearl:\n...\nPhoenix:\nAck! Y-You surprised me!\nPearl:\n...\nPhoenix:\nAnd how are you today?\nPearl:\n...\nPhoenix:\n(Hmm... I guess she isn't open to friendly chatting... Huh? She's still holding something in her hand... ...It looks like the same thing she had yesterday...)\nPhoenix:\nOh yeah. Maya said to give this to you...\nPearl:\n...\nPhoenix:\n(Ack! I'm in trouble now!! If Morgan sees us like this, I'll be the next one they're channeling...)\nPearl:\nTh-That's... That's Mystic Maya's...\nPhoenix:\n...Huh!? (Sh-She actually spoke!)\nPearl:\nWho are you...?\nPhoenix:\nI-I'm Phoenix Wright. I, uh, worked with Maya...\nPearl:\n...Y-You worked with Mystic Maya...? You... You're Mr. Nick, right?\nPhoenix:\n...Uh, excuse me? (I bet I know who she picked \"Nick\" up from...)\nPearl:\nI know who you are. You're... You're Mystic Maya's... \"special someone\"...\nPhoenix:\nWH-WH-WH-WHAT!?\nPearl:\nSo then... Of course! You're going to help Mystic Maya, aren't you? That's what you're going to do, right?\nPhoenix:\nW-Well, yeah... I will...\nPearl:\nOh wow... It's like a beautiful fairy tale! That earnest look shining brightly in your eyes... It must be true love...\nPhoenix:\n...Wh-What!? (Why am I being boiled into a bright red lobster by this little kid!?)\nPearl:\nI'm so jealous of Mystic Maya! Ah, what a wonderful relationship...\nPhoenix:\nW-Wait... I... uhh... I mean... We aren't... Things aren't like...\nPearl:\nHee hee, I can tell you're a good person. Alright, Mr. Nick! I may be small, but I'm going to help you in any way I can!\nAfter clearing all Talk options:\nPearl:\nUm, Mr. Nick...?\nPhoenix:\nYes, Pearls? I can call you that, right? You're too cute to just call you Pearl.\nPearl:\nSure, Mr. Nick... Umm... Are you sure it's OK for me to have this Magatama?\nPhoenix:\nYeah, it's OK. I was told to give it to you.\nPearl:\nBut, I can't accept something like this! ...All I really should do is charge this Magatama with spiritual energy...\nPhoenix:\nSpiritual energy?\nPearl:\nPlease take this. I'm sure it will be helpful.\nPhoenix:\n...What do you mean?\nPearl:\nIt will let you see people's secrets.\nPhoenix:\nSee people's... secrets...?\nPearl:\nYes. ...If it's alright with you, I would like to accompany you for a little while. I can explain the Magatama's power to you when we meet someone hiding a secret.\nJune 20Fey ManorMeditation Room\nGumshoe:\nHey, it's you, pal! So you're going to be her lawyer, I bet.\nPhoenix:\nYes.\nGumshoe:\nOh... I really feel bad for you, pal. Just this once, I wish I could be on your side.\nPhoenix:\nDetective Gumshoe...\nGumshoe:\nYeah, but I shouldn't be saying that kind of stuff to you. Hey! You're a cute kid.\nPearl:\n...\nGumshoe:\nHa ha ha. I'm not scary. Honest!\nPhoenix:\n(Wow, I never knew Gumshoe liked kids...)\nGumshoe:\nH-Hey! I know! I'll show you something cool! How's this? It's a real, genuine pistol...\nPhoenix:\nD-Detective Gumshoe!! What are you doing showing her something that dangerous!\nGumshoe:\nOh, sorry...\nJune 20Fey ManorSide Room\nPhoenix:\nHello again. We seem to be seeing a lot of each other today.\nIni:\nAww, she's, like, tooootally cute! Is she, like, your daughter?\nPhoenix:\nW-What!? NO! (How old do you think I am!?)\nPhoenix:\nPlease, tell me all you know about Dr. Grey.\nIni:\nMy... My sister's name was Mimi Miney. She was, like, a nurse at Dr. Grey's clinic.\nPhoenix:\n(That's what I thought...)\nIni:\nI heard that, like, Dr. Grey was really tough on people. Like, a total slave driver. My sis was, like, always coming home totally wiped out 'cause she was overworked.\nPhoenix:\nWiped out? So is that why she fell asleep at the wheel?\nIni:\nThat guy, like, drove my sis so hard, so, like, that's why the accident happened.\nPhoenix:\nThe one where 14 patients died from malpractice?\nIni:\nYeah, like, I think that was the doctor's fault, too. My sis was pushed by, like, everyone's expectations and, like, her duties and stuff. And that pushed her to her death.\nPhoenix:\nOh... I'm sorry...\nIni:\nSo, like, are we done? I've, like, already told my story to, like, everyone...\nPearl:\nDo you understand now, Mr. Nick? This is how a Psyche-Lock works.\nPhoenix:\n...Well, I don't plan to pry into people's hearts unless I absolutely need to...\nPearl:\nThe lock this time was pretty easy, but... you might meet people who aren't as willing to give in later on. If you don't have enough proof, be careful and know when to stop trying.\nAfter clearing \"Successor\" Talk option in Fey Manor - Meditation Room and clearing \"The victim\" Talk option upon breaking Psyche-Lock in Fey Manor - Side Room:\nJune 20Kurain Village\nPearl:\nMr. Nick.\nPhoenix:\nHmm? What's wrong?\nPearl:\nI have never left Kurain Village.\nPhoenix:\nR-Really? Wow, that's, um, pretty amazing...\nPearl:\nYou are going to meet with Mystic Maya... aren't you? Please tell her I said hi.\nPhoenix:\nHey, wait! (She ran off... Again. Well, I know Ini's secret now, but... I still don't have any idea how I'm going to save Maya. I don't even know if I should go in there with a smile or a straight face... *sigh*)\nJune 20Detention CenterVisitor's Room\nPhoenix:\n(What am I supposed to do!? I'm almost out of time! Can I really do anything? Can I really save her...?)\n???:\nSorry to keep you waiting.\nPhoenix:\n(Huh? Must be Maya...)\n???:\nIt's been a long time, hasn't it, Phoenix?\nPhoenix:\n...! (That voice...) M-Mia!\nMia:\nEven without me being here, it looks like you've learned to stand on your own.\nPhoenix:\n(Mia... She's Maya's older sister, and my mentor. She was a top-notch defense lawyer, but a certain case forced her into \"retirement\". But... whenever I'm in trouble, she comes to help, just like this. Her spirit comes back from the other world and borrows Maya's body for a bit...)\nMia:\nPhoenix, you can't make that kind of face in front of your client.\nPhoenix:\n...!\nMia:\nA lawyer is someone who smiles no matter how bad it gets, and especially when it's bad.\nPhoenix:\nMia...\nMia:\nYou can't smile at the end if you haven't been smiling the whole way there. In any case, the face you're making now is no face to show a client, Phoenix.\nPhoenix:\nB-But!\nMia:\nSo, tell me all about it. I'm going to guess that my sister is in a lot of trouble again...\nPhoenix:\n(I told her everything about what had happened in the last two days. Mia closed her eyes, deep in thought, while she listened...)\nMia:\n...I see...\nPhoenix:\nMia... What am I supposed to do?\nMia:\n... It's pretty clear what a good lawyer does in this situation.\nPhoenix:\nA-And that is!? Tell me, please!\nMia:\nBelieve in your convictions. And fight for the complete acquittal of your client.\nAfter clearing all Talk options and presenting Black Key:\nMia:\n... ... You already know everything you need to know. You know what the \"key\" to this case is... That is enough...\nPhoenix:\nBut... But! How can I win tomorrow without knowing who the real murderer is!? Who... Who could have...?\nMia:\n...\nPhoenix:\n(I didn't know it at the time, (Changed from [At the time, I didn't know,] in the original release) but this day was going to end with a turn for the surprising...)\n3 PSYCHE-LOCKS\nPhoenix:\nM-Mia!? Wh-What...!?\nMia:\nWhat's wrong?\nPhoenix:\n(That's right. Only I can see the Psyche-Locks... Which means... Mia must know something about the real murderer! But for this to be something that she would hide under lock and key from even me... What in the world is going on!?)\nTo be continued.\n\nJune 21, 9:48 AMDistrict CourtDefendant Lobby No. 3\nMaya:\nWhaaaaaaaat!? Prosecutor von Karma!? You mean...?\nPhoenix:\nNo, I heard it's his successor this time...\nMaya:\nSuccessor...? ... Manfred von Karma... was a really sinister man. (Changed from [Manfred von Karma. He was a really sinister man.] in the original release) He pulled all sorts of nasty tricks; all so he could win.\nPhoenix:\n(He was a man obsessed with the word \"perfection\"... He had a perfect record... for forty long years. Who knows what sorts of dirty tricks he used to get each of those guilty verdicts? And now, his successor... I wonder what kind of person they will turn out to be...)\nMaya:\nIt's no good...\nMystic Maya!!\nMaya:\nPearly! You showed up! Thanks for coming all this way!\nPearl:\nI was really worried about you...\nMaya:\nHey, where's your mother? Didn't you two come together?\nPearl:\nMother is watching over the trainees. She said they have training for two days straight with no breaks.\nMaya:\nHuh!? Then... Then... You came all by yourself?\nPearl:\nYup! I snuck out of the manor and followed a map.\nPhoenix:\nDon't tell me you walked all the way here...\nPearl:\nOf course not! ...I ran!\nPhoenix:\nThat's... I can't... Oh my... (If it takes two hours by train... Oh man...)\nMaya:\nPearly... What about the train?\nPearl:\nHuh? What's a... \"tray-in\"?\nPhoenix:\n(I give up...)\nPearl:\n...It's time, isn't it?\nMaya:\nUm... I'm really scared... What if Von Karma tries to do something to me? At least I know Mr. Edgeworth would be nicer to me than Von Karma!\nPearl:\nMr. Eh-ji-werth? Who is that?\nMaya:\nUm, he's Nick's rival... Well, he's also a friend.\nEdgeworth:\nMaya:\nI still remember him as though I'd seen him only yesterday. (Changed from [I still remember him as if I had just seen him only yesterday.] in the original release)\nPhoenix:\nMaya:\nEvery trial was a scorchingly fierce battle until the very end. (Changed from [Every trial was a scorching fierce battle until the very end.] in the original release)\nEdgeworth:\nPhoenix:\nMaya:\nIt was always back and forth with them. But when you're rivals for life...\nPhoenix:\nMaya! Please don't mention that name ever again...\nMaya:\nHuh...? But why, Nick?\nPhoenix:\nI'm... I'm sorry, Maya. I forgot you don't know... He... He's... He's gone... And he's not coming back...\nMaya:\nWhaaaat!? W-W-Wait... Wait a second!! What's that supposed to mean!?\nBailiff:\nCourt will commence shortly. Please proceed into the courtroom.\nPhoenix:\n... Let's go. Now's not the time to talk about that anyway.\nMaya:\nN...Nick...?\nJune 21, 10:00 AMDistrict CourtCourtroom No. 2\nJudge:\nCourt is now in session for the trial of Maya Fey. Are the prosecution and the defense prepared?\n???:\n...\nPhoenix:\n... (What is with this kid...?) (Changed from [... (What is with this girl...?)] in the original release)\nJudge:\n... *Ahem!* Mr. Wright!! Are you prepared!? (Changed from [*Ahem!* Mr. Wright!! Are you finally prepared!?] in the original release)\nPhoenix:\nHuh? A-Ah, yes, Your Honor. (Why does he always seem mad at me!?)\n???:\nMr. Phoenix Wright.\nPhoenix:\n...!\n???:\nYou must be a little shocked because I am a woman, correct?\nPhoenix:\n(...Hold on. So SHE'S the famed \"successor\" to Prosecutor von Karma...?) (Changed from [...Hold on. So this kid is the \"famed\" Prosecutor von Karma...?] in the original release)\nvon Karma:\nI am Franziska von Karma, the Prodigy.\nPhoenix:\nI... see...\nvon Karma:\nI gave up a promising career in Germany and came to this country for one sole reason. Revenge.\nPhoenix:\nRevenge...? (Is this about her father, Manfred von Karma...?)\nJudge:\nUm... If it's something of a personal nature, I'm sure you can... Oww!\nvon Karma:\nI'm talking. If you interrupt again, my whip will do the speaking for me.\nPhoenix:\n(Please speak with your mouth like a normal person... I beg of you...) Yeow!!\nvon Karma:\nMake no mistake; I will defeat you! Prepare to go down, Mr. Phoenix Wright!\nJudge:\nProsecutor von Karma, your opening statement, please...\nvon Karma:\nThose of Von Karma blood have only one fate. And that is \"perfection\". The defendant, Maya Fey, will find no escape from her guilt on my watch.\nJudge:\nV-Very well... What is the defense's position?\nPhoenix:\nYour Honor.\nJudge:\nDoes the defense wish to enter a plea of \"not guilty\"?\nPhoenix:\n...Yes.\nvon Karma:\nFoolish fool who foolishly dreams of foolish dreams... Ten minutes. I give the defense ten minutes before it changes its plea. That's right. I'll have you running for the \"justified self-defense\" plea in no time.\nPhoenix:\n(\"Justified self-defense\"... A plea usually reserved for when a person unintentionally kills in defense of themself. (Changed from [A plea usually reserved for when a person unintentionally kills in defense of himself.] in the original release) We could very easily make a solid case that it was self-defense, but...) The defense stands by the plea of \"not guilty\", Your Honor! (Because to plead \"justified self-defense\" is to say you did kill someone.)\nvon Karma:\nHow foolish. If that's how you want to play it, Mr. Phoenix Wright, then I shall now call the first witness.\nPhoenix:\n(She's just as scary as her father. Like father, like daughter I suppose.)\nvon Karma:\nWitness, your name and occupation?\nGumshoe:\nYes, sir! My name is Dick Gumshoe. I'm a detective at the local precinct. Aah!!\nvon Karma:\nGet to the point already. Explain to the court the details of this murder.\nGumshoe:\nY-Yes, sir! Um, if everyone would please look at this map. The Channeling Chamber has no windows and the door was locked shut. At the time of the murder, only the victim and the defendant were in the room.\nJudge:\nWhat were they doing in there?\nGumshoe:\nUm... They... Well, they were channeling... a spirit... Sir.\nJudge:\nCh-Channeling a spirit??\nPhoenix:\n(That's quite the look of disbelief there, Your Honor...) (Changed from [The look of disbelief on the judge's face is...] in the original release)\nGumshoe:\n*ahem* Anyway, a few minutes after the channeling started, gunshots were heard coming from inside the room, sir. A few of the witnesses broke the door down, and rushed into the room.\nJudge:\nAh, and that's when they found that the victim was already dead, correct? Hmm, I believe this is one of the most open and shut cases I have ever presided over.\nFloor Plans added to the Court Record.\nJudge:\nSo, how was the victim killed?\nGumshoe:\nI was about to get to that...\nvon Karma:\nStop wasting my time, then.\nWitness Testimony\n-- Cause of Death --\nGumshoe:\nThe direct cause of death was a pistol shot to the forehead, sir.\nThe shot was fired from point-blank range.\nBut before the victim was shot, sir, he was stabbed in the chest.\nThe wound was very severe, but not enough to cause instantaneous death.\nThe murderer used the pistol to finish the victim off after the stabbing.\nJudge:\nHmm... So the victim was stabbed before being shot...\nGumshoe:\nThis is the victim's autopsy report, sir.\nAutopsy Report added to the Court Record.\nJudge:\nThe court accepts it into evidence. Mr. Wright, you may question the witness.\nCross Examination\n-- Cause of Death --\nGumshoe:\nThe direct cause of death was a pistol shot to the forehead, sir.\nGumshoe:\nThe shot was fired from point-blank range.\nGumshoe:\nBut before the victim was shot, sir, he was stabbed in the chest.\nGumshoe:\nThe wound was very severe, but not enough to cause instantaneous death.\nGumshoe:\nThe murderer used the pistol to finish the victim off after the stabbing.\nPhoenix:\n(Nothing sounds out of place so far... I should try to learn more about the murder weapons, for now...)\nAfter pressing first, second, third and fifth statements:\nJudge:\nThat's enough! We have clearly established how the victim was murdered.\nGumshoe:\nI brought the two murder weapons with me today.\nJudge:\nVery well. The court accepts them into evidence.\nPistol added to the Court Record.\nKnife added to the Court Record.\nvon Karma:\nThe date and time of death was June 19th at 3:15 PM. Eyewitnesses claim to have heard two gunshots at this time.\nJudge:\nAnd two murder weapons, both with the defendant's fingerprints on them, huh... (Changed from [And the two murder weapons, both with the defendant's fingerprints on them...?] in the original release) Hmm... This does seem like an open and shut case.\nvon Karma:\nNaturally!\nPhoenix:\n(This is going from bad to worse... As if the summary just now wasn't oversimplifying things to the extreme...)\nvon Karma:\nYour Honor. Feel free to slam that little gavel of yours. After all, there is no room left for doubt, is there?\nJudge:\nThat is quite true... Mr. Wright.\nPhoenix:\nY-Yes?\nJudge:\nEven in the face of all this, do you still wish to plead \"not guilty\"? It's the opinion of this court that if you do not adjust your plea, you stand to lose.\nvon Karma:\nSee, just as I promised, Mr. Phoenix Wright. You would change your plea in less than ten minutes...\nJudge:\nWhat will you do, Mr. Wright? Will you change to \"justified self-defense\"? Because now would be the time to do so. This is your final chance.\nPhoenix:\n(This is a huge decision! I'd better think this through all the way!)\nvon Karma:\n...You. You have sealed your fate, Mr. Phoenix Wright. Detective!\nGumshoe:\nY-Yes, sir!\nvon Karma:\nPresent the final portion of your testimony -- the final strike.\nGumshoe:\nUm... Y-Yes... sir...\nJudge:\nN-Now, see here! Proceedings are run by... Eek!\nvon Karma:\n...\nJudge:\nOh, yes, of course. Go ahead Detective and give your testimony...\nvon Karma:\nI think the court would like to hear about the other piece of incriminating evidence!\nWitness Testimony\n-- Incriminating Evidence --\nGumshoe:\nSorry, pal, but there's an even more incriminating piece of evidence.\nThis is the costume the defendant was wearing at the time of the crime.\nAs you can see, it's covered in blood.\nThe defendant attacked and killed a person who, without a doubt, was not fighting back.\nJudge:\nSo this is the costume... There certainly is evidence of a back spray of blood on this.\nGumshoe:\nThis piece directly links Maya Fey to the crime, sir.\nJudge:\nI see... The court accepts this into evidence.\nMaya's Costume added to the Court Record.\nJudge:\nAlright, Mr. Wright.\nPhoenix:\n(Maya's fingerprints on both murder weapons and blood splatters on her clothes... Could this situation get any worse??)\nvon Karma:\nHah. What's wrong? You seem to be at a loss. I think this is the last piece of testimony the prosecution should have to offer. Feel free to sulk off with your tail between your legs, Mr. Phoenix Wright!\nPhoenix:\n(Please stop calling me by my full name. It's disturbing.)\nCross Examination\n-- Incriminating Evidence --\nGumshoe:\nSorry, pal, but there's an even more incriminating piece of evidence.\nGumshoe:\nThis is the costume the defendant was wearing at the time of the crime.\nGumshoe:\nAs you can see, it's covered in blood.\nGumshoe:\nThe defendant attacked and killed a person who, without a doubt, was not fighting back.\nPhoenix:\n(That Von Karma! She thinks she can decide the verdict with this testimony alone! I have to somehow find a critical contradiction and then I'll have her!)\nPhoenix:\nDetective Dick Gumshoe!\nGumshoe:\nY-Yes? Heh, having you call me by my full name is kind of a weird feeling...\nPhoenix:\nYou said that my client killed \"a person who, without a doubt, was not fighting back.\"\nGumshoe:\nYeah, I did.\nPhoenix:\nThen what, may I ask, is the bullet hole you police overlooked supposed to mean!?\nGumshoe:\nEh, um... What does it mean?\nPhoenix:\nI'll tell you what it means. It means that the victim had fired off a shot. Is this what it means to \"not fight back\"?\nGumshoe:\nA-Ah! You're right!\nJudge:\nIt seems you are correct! (Changed from [It would seem that way!] in the original release) If the victim had tried to shoot the defendant, then... it would change everything... (Changed from [If the victim tried to shoot the defendant, then... It would change everything...] in the original release)\nPhoenix:\n(Alright! The wind seems to be shifting...)\nvon Karma:\nHah.\nPhoenix:\n(What is with that \"are you finished yet\" laugh?)\nvon Karma:\nAre you finished yet, Mr. Phoenix Wright?\nJudge:\nMs. von Karma?\nvon Karma:\nIt seems... that Maya Fey was shot at by the victim. However, that is only grounds enough to support a \"justified self-defense\" plea.\nJudge:\nThat is correct.\nvon Karma:\nBut I'm sure you remember, Your Honor, what the defense clearly said. They rejected \"justified self-defense\" and pleaded \"not guilty.\"\nPhoenix:\nAck!\nGumshoe:\nNow that you...\nJudge:\nWhy, that's right!\nvon Karma:\nWhich means! The defense has yet to prove anything at all!\nPhoenix:\nNooooo!!\nJudge:\nW-Well... Yes, that's true...\nvon Karma:\nFurthermore... just the fact that there is a bullet hole in the costume... is not enough to substantiate even a plea of \"justified self-defense\".\nJudge:\nHuh? How so?\nGumshoe:\nAaah!\nvon Karma:\nDon't just stand there. Hurry up and tell the court what transpired that day. ...With the new information we acquired added in, of course.\nGumshoe:\nHuh? You mean... By myself...? You want me to put together the scenario all by myself? Aah!\nvon Karma:\n...\nGumshoe:\nY-Yes, sir! Right away, sir!\nWitness Testimony\n-- What Transpired --\nGumshoe:\nDuring the channeling, the defendant saw her chance to stab the victim in the chest.\nOf course, the victim used the last of his strength to fight back, sir.\nWhile the two were fighting, the victim took out his gun.\nThe victim took a shot, but because they were too close, he missed.\nThe defendant then picked up on the opening, took the victim's gun, and ended it...\nJudge:\nHmm... This scenario you have put together does make sense...\nGumshoe:\nYes, sir.\nJudge:\nWell, Mr. Wright?\nPhoenix:\n(On the surface, it does seem to make sense... (Changed from [Just by listening, it does make sense...] in the original release) However, I won't give up that easily!)\nJudge:\nP-Please refrain from glaring at me like that... Now then, your cross-examination, please.\nCross Examination\n-- What Transpired --\nGumshoe:\nDuring the channeling, the defendant saw her chance to stab the victim in the chest.\nGumshoe:\nOf course, the victim used the last of his strength to fight back, sir.\nGumshoe:\nWhile the two were fighting, the victim took out his gun.\nGumshoe:\nThe victim took a shot, but because they were too close, he missed.\nGumshoe:\nThe defendant then picked up on the opening and took the victim's gun, and ended it...\nPhoenix:\n(His testimony certainly makes us look very bad, but there's gotta be a contradiction in there somewhere... And uncovering it is going to uncover the truth! I can feel it!)\nPhoenix:\nMissing the tiny hole on this costume... will be the prosecution's undoing.\nGumshoe:\nEh? What do you mean?\nPhoenix:\nThis little hole has actually created a huge hole in your testimony!\nJudge:\nE-Explain yourself, Mr. Wright!\nPhoenix:\nYou said the two of them were fighting when the victim fired his gun at point blank. If that were true, then where is the gunpowder burn on this costume!?\nGumshoe:\nG-Gunpowder... burn?\nPhoenix:\nThis is what you testified earlier: \"When something is shot from point blank, a burn area is left around the bullet hole.\"\nGumshoe:\nOH!\nPhoenix:\nBut there is not a single trace of gunpowder burn on this costume!!\nJudge:\nThat is a very good point. And... what exactly does this mean?\nPhoenix:\nIt means that when the shot was fired, they were standing apart from each other.\nJudge:\nHmm...\nvon Karma:\nvon Karma:\nI'm disappointed, Mr. Phoenix Wright. You think you can punch a hole in my logic with that? With wishy-washy thinking like that, anyone can explain anything away!\nPhoenix:\nThen I implore you to disprove my line of thinking.\nvon Karma:\nLet's see... In the middle of their fight, the victim pushed the defendant away. And it was then, when they were separated, that he fired! How was that?\nPhoenix:\nPhoenix:\nAs if that was even possible. According to testimony, the wound from the stabbing was very severe. The victim would not have had the strength to push the defendant very far after that!\nvon Karma:\n...! W-Well... Then... That's right! The defendant must have pushed the victim away! After stabbing him, she must have put some space between the doctor and herself. And then while she was preparing to strike again, the doctor took his shot. There. That sound satisfy even you.\nJudge:\nHmm... That does make an awful lot of sense. What do you think, Mr. Wright?\nPhoenix:\n(I must be careful. I can't afford to make a mistake here! Concentrate and think!)\nPhoenix:\nThere is a fatal flaw in her argument, Your Honor!\nGumshoe:\nFatal...?\nJudge:\nFlaw...!? Yeow!\nvon Karma:\nVery interesting. I would love to see where this \"flaw\" is! Show me something that contradicts my explanation!\nPhoenix:\n(There has to be a snag in her explanation somewhere! \"She put some distance between them before rushing to make the final blow. And when she was about to strike, the doctor took his shot.\" There must be a piece of evidence that contradicts this line of thinking!)\nPhoenix:\nThis is the piece of evidence that destroys your logic.\nJudge:\nWhat is that? A folding screen?\nPhoenix:\nI would like to point the court's attention to the \"hole\" in this folding screen.\nvon Karma:\nAaah!\nPhoenix:\nIt looks like you already know what I'm talking about.\nGumshoe:\nWho? Where? What?\nJudge:\nMr. Wright! Your explanation, please!\nPhoenix:\n(Are these two really that clueless...?) The bullet went through the defendant's sleeve first, then the folding screen. It passed through at a height of approximately 8 inches off the ground... Which means! When the shot was fired, Maya... I mean, the defendant, was not getting ready to strike, but was actually squatting low to the ground!\nJudge:\nOrder! Order! Th-This changes everything!\nPhoenix:\nPlease look at this diagram of the crime scene. The victim, Dr. Grey was here when he fired the shot. And the bullet hit this folding screen. It hit at this location, about 8 inches off the ground. At this time, the defendant was in this area.\nPhoenix:\nShe was standing here, near the folding screen!\nvon Karma:\nW-Wait a second! We know the defendant was close to the ground based on the height of the bullet hole. But... How can you gauge the distance from that!? Isn't it possible that the defendant was standing much closer to the victim?\nPhoenix:\nThat's impossible.\nvon Karma:\nB-But why!?\nPhoenix:\nYou, of all people, should know the answer to that question, Ms. von Karma. If she were shot from somewhere closer, there would be gunpowder burns present. However! There is nothing of the sort around the bullet hole of this costume!\nvon Karma:\nAaaaaah! C-Curse you, Mr. Phoenix Wright! You...!\nJudge:\nHmm... I believe it has now been proven that the defendant was standing a ways from the victim when she was shot at. But do you think this has changed the defendant's situation...?\nPhoenix:\nHonestly, Your Honor! This changes everything! The prosecution has claimed that the defendant was aiming to kill by stabbing. If that were true, delivering the final strike with the knife would be ideal. However! Where and what was the defendant doing at the time...?\nGumshoe:\n...Squatting all the way by the folding screen...?\nPhoenix:\nExactly. If Maya Fey was the real murderer, why would she be by the folding screen instead of preparing to strike?\nvon Karma:\nNnngh...\nJudge:\nUpon further consideration, it does make very little sense.\nGumshoe:\nYeah, I figured there had to be a reason.\nPhoenix:\nFiguring things out and proving the logic behind everything is YOUR job!\nGumshoe:\nOof...\nPhoenix:\n(Alright! With this, the rest of the trial should be in the b--)\nvon Karma:\n...\nPhoenix:\n(...blast radius of disaster.)\nvon Karma:\nYou are such a smart man, Mr. Phoenix Wright. To think that you've been able to take a completely hopeless case to this point... Now I know why Papa had a tough time with you. Mmm, you amuse me...\nPhoenix:\n(Uuugh. Of all the things to inherit, why did it have to be that smarmy smile!?)\nvon Karma:\nDetective. How dare you damage my perfect logic!?\nGumshoe:\nH-Huh!?... How is it all my fault??\nvon Karma:\nYou can start repairing your standing by first removing that three-strand \"goatee\". Oh, and rest assured your punishment will come later.\nGumshoe:\n...P-Punishment...\nvon Karma:\nWell then, Your Honor, I think I've had all I can take of this detective's face. I think it's time to call in the next witness.\nPhoenix:\n(Next witness...? That's gotta be Lotta!)\nJudge:\nVery well. The court will take a 5 minute recess. After we reconvene, we will hear from the next witness.\nTo be continued.\nJune 21, 11:37 AMDistrict CourtDefendant Lobby No. 3\nPhoenix:\nPhew, that was a close one.\nMaya:\nI know you were giving it your all to defend me. But I could feel the death penalty hanging in the air...\nPhoenix:\nI felt like I was pretty close to dying myself...\nPearl:\nBut you were wonderful out there. You listened carefully, made theories, and tricked everyone into believing you.\nPhoenix:\nTh-Thanks. Wait... Tricked??\nPearl:\nThat must be the \"lawyer's\" secret technique, right?\nMaya:\nBy the way... Is the next witness who I think it is...?\nPhoenix:\nYeah, I'm pretty sure it's Lotta Hart.\nMaya:\nOh... Guess there's no escaping her, huh? (Changed from [Oh... Another jam, like always...] in the original release) Remember, Nick! You promised you'd save me! If you lose, me and my sis's ghosts will come after you and haunt you! (Changed from [If you lose, my ghost will come after you with my sis', and we'll haunt you!] in the original release)\nPearl:\nYour sister...? Um, are you talking about Mystic Mia?\nMaya:\nYeah. Do you remember her, Pearly? My sister was a super good lawyer! She was also Nick's teacher.\nPearl:\n...Oh, I didn't know that...\nJune 21, 11:43 AMDistrict CourtCourtroom No. 2\nJudge:\nCourt will now reconvene. Now, the first order of... Oww!\nvon Karma:\nI don't want to hear it, old man. After I call my witness, sit there quietly and watch like a good little boy.\nJudge:\nY-Yes, sir.\nvon Karma:\nBring in the photographer who witnessed the channeling!\nvon Karma:\nWitness. Your name and occupation, if you please.\nLotta:\nHey, Phoenix! How ya doin'?\nPhoenix:\nJust fine...\nLotta:\nSorry 'bout this. Didn't exactly have a choice, ya know...? Yeowza!\nvon Karma:\nName and occupation.\nLotta:\nI-I declare! What in tarnation!? Hey, Judge! This here is violence against my fair self!\nJudge:\nThat's fine.\nLotta:\n\"That's fine!?\" That ain't fine!! That's a whip! Eaaah!\nvon Karma:\nThere's no need for foolish outcries from foolishly foolish fools. Just hurry up and testify about what happened on the day of the murder.\nLotta:\nI haven't even gotten to say my name and job yet...\nvon Karma:\n...\nLotta:\nThe name's Lotta Hart, paranormal photographer, and I'm here to testify!\nJudge:\nNow, now, let's all be one big happy family... OK...?\nWitness Testimony\n-- Witness's Account --\nLotta:\nOnly the Doc and the defendant went into the Channelin' Chamber.\nWe were waitin' outside the door and then, \"bang!\" we hear this gunshot!\nMr. Lawyer there broke the door down, and we rushed into the room.\nInside was the dead victim, and the defendant, wavin' a pistol around.\nI swear, other than those two, there was no one else in the room.\nJudge:\nAnd did you take a picture of the scene right after the murder took place?\nLotta:\nReckon course!\nPhoenix:\nEh? ...Excuse me?\nLotta:\nReckon course! It's short for \"Ya reckon!? Of course I did!\" Aah!\nvon Karma:\nDoes it look like I care? Just hurry up and show your picture to the court.\nPhoenix:\n(The moment of truth. What will be in that picture?)\nLotta:\nUmm, let's see here... This here's the picture!\nJudge:\nHmm... It would certainly seem that only the defendant and the victim were in that room.\nLotta's Photo added to the Court Record.\nvon Karma:\nAre you ready, Mr. Phoenix Wright?\nPhoenix:\n(I will clear all doubt about Maya through this cross-examination... Just watch me!)\nCross Examination\n-- Witness's Account --\nLotta:\nOnly the Doc and the defendant went into the Channelin' Chamber.\nLotta:\nWe were waitin' outside the door and then, \"bang!\" we hear this gunshot!\nLotta:\nMr. Lawyer there broke the door down, and we rushed into the room.\nLotta:\nInside was the dead victim, and the defendant, wavin' a pistol around.\nLotta:\nI swear, other than those two, there was no one else in the room.\nPhoenix:\n(Argh! Her story adds up... What's worse, I was there at the scene of the crime with her... (Changed from [What's worse is that I was there at the scene of the crime at that time too,] in the original release) and her story is exactly how I would have told it, too... (Changed from [and her story is exactly how I would have told it...] in the original release))\nAfter pressing all statements:\nPhoenix:\n(Argh! Just as I thought, there is nothing wrong with her testimony! I was with her, so I know she's telling the truth...)\nJudge:\nEnough. It seems that there are no issues with Ms. Hart's testimony.\nvon Karma:\nAt the time of the crime, only two people were in the Channeling Chamber: the victim, Dr. Turner Grey, and the defendant, Maya Fey.\nJudge:\nHmm... The face of the defendant can not be verified in this picture. However, if we think about the circumstances, it would have to be the defendant.\nPhoenix:\n(What am I going to do!? If I just let this go...)\nJudge:\nWhat is it, Mr. Wright? You look as if you have something to say...\nPhoenix:\n(If I make one wrong move, I'm going to have the judge against me... Is there anything I can present that would prove it's not Maya in that photo?)\nJudge:\nWell, Mr. Wright?\nPhoenix:\nNothing, Your Honor...\nvon Karma:\nThat's very smart of you, Mr. Phoenix Wright. You really should give up trying to prove this is not Maya Fey.\nPhoenix:\n(I didn't say anything about giving up! I just don't have the right piece of evidence to prove my argument...)\nJudge:\nThat's enough!\nPhoenix:\n(I-Is this it...? Is this all I could do...?)\nJudge:\nI think it is quite obvious to this court that a verdict of not guilty is not possible.\nvon Karma:\nI told you. Totally, 100% impossible.\nJudge:\nMs. von Karma, do you have any further questions for this witness?\nvon Karma:\nHaving established the defendant's guilt, further questioning won't be needed.\nJudge:\nWhat about the defense? No further questions, I presume?\nPhoenix:\n(I... I couldn't protect Maya...) The defense... The defense...\n...Phoenix... ...Phoenix, you can't make that kind of face... ...A lawyer is someone who smiles... no matter how bad it gets!...\nPhoenix:\nM-Mia!\nMia:\nI guess I made it just in time, wouldn't you say?\nPhoenix:\nY-You... But... P-Pearls!\nMia:\nHer clothes ARE a bit small... Anyway, what are you waiting for, Phoenix!? Let's go!\nPhoenix:\nB-But how!? She's already taken away every advantage!\nMia:\nThe advantage is still in your hand! Think carefully, one more time, about what you saw in the Channeling Chamber. Do you remember what you told me yesterday?\nPhoenix:\nD-Dr. Grey!!\n*klik*\n???:\n...I was... murdered...\nPhoenix:\nW-What!?\n*klik*\nPhoenix:\nLotta! At a time like this!?\nLotta:\nTimes like this are perfect for snapping up shots!\nMia:\nYou see... There is one final piece to this puzzle. (Changed from [You see... There is one final piece of the puzzle.] in the original release)\nPhoenix:\nMia...?\nMia:\nQuestion Lotta one more time, Phoenix. I don't know if she's doing it unconsciously or on purpose, but... (Changed from [I don't know if she's doing it subconsciously or on purpose, but...] in the original release) she's not testifying truthfully.\nJudge:\nNow then, this court would like to end the cross-examination period.\nPhoenix:\nPhoenix:\nPlease wait, Your Honor! The defense would like to request that the witness testify one more time.\nJudge:\nOverruled. I'm afraid you're too late, Mr. Wright. The cross-examination has already ended. Furthermore, any unrelated ques- Aah!\nvon Karma:\nIt's fine. I'll allow another testimony. A Von Karma's case is perfect. Absolutely flawless. And what better time than this for you to see that.\nJudge:\nB-But... I mean... I have some place I must go after this... Mmph! A-Al-Alright! I'll allow it! Ms. Hart! Hurry and give us another testimony!\nLotta:\nWell... heck... What am I supposed to talk about?\nPhoenix:\nPlease tell us once more, what happened when you burst into the Channeling Chamber.\nLotta:\nOK! You got it!\nMia:\nSee, you got through to the judge somehow, right?\nPhoenix:\n(Well, actually it was Von Karma's whip that got through to him...)\nWitness Testimony\n-- Witness's Account, Pt. 2 --\nLotta:\nWhen we broke into that room, all I could focus on was Maya.\nI was... uh, kinda scared of the dead body, so I didn't take a good look at it.\nI'm really bad when it comes to blood and ghosts and stuff.\nBut I still managed to point my camera at Maya and take a shot!\nJudge:\nNothing sounds different from before...\nPhoenix:\n(Some parts of her testimony were very vague. I should press her on those sections!)\nvon Karma:\nStruggle all you like as you taste the bitterness of your defeat. Well, amuse me with your useless questions, Mr. Phoenix Wright. I'm waiting...\nCross Examination\n-- Witness' Account, Pt.2 --\nLotta:\nWhen we broke into that room, all I could focus on was Maya.\nLotta:\nI was... uh, kinda scared of the dead body, so I didn't take a good look at it.\nLotta:\nI'm really bad when it comes to blood and ghosts and stuff.\nLotta:\nBut I still managed to point my camera at Maya and take a shot!\nMia:\nThere must be something we can use in her testimony just now. We must find it! At all costs...\nPhoenix:\nTwo, right?\nLotta:\nT-Two what?\nPhoenix:\nTwo shots. You took two shots.\nJudge:\nBut... Only one has been submitted as evidence!\nPhoenix:\nMs. Hart! Where is the other picture you have been withholding!?\nLotta:\nNo, no, no! You've got it all wrong! It's not me! I-I didn't mean anything bad! I know I can be a little mean, but I ain't evil!\nPhoenix:\n(Well, at least she knows herself...)\nJudge:\nThen why have you not shown this \"other picture\" to this court yet?\nLotta:\nWell, ain't it obvious!? That prosecutor woman told me to shut my trap about it!\nPhoenix:\nW-What!? V... Von Karma!!\nJudge:\nM-M-Ms. von Karma! Y-Y-You... You're hiding critical evidence...!\nvon Karma:\n...\nPhoenix:\n(Unforgivable, von Karma. Suppressing evidence like this... You're as bad as your father!)\nJudge:\nMs. von Karma. Would you care to explain yourself to this court?\nvon Karma:\nI thought this picture was not important, and thus, felt no need to submit it. That's all.\nPhoenix:\nH-How could you think...!?\nvon Karma:\nThe pictures were more or less the same, so why bother with the second? I mean, it's just so much more trouble than it's worth for me to submit this as evidence.\nPhoenix:\n\"M-More trouble that [sic] it's worth!?\" How... How can you say that!?\nvon Karma:\nIf you want to see it that badly, I'll submit it.\nLotta's Photo 2 added to the Court Record.\nJudge:\n... Wh-What is...? What is this picture!?\nvon Karma:\nIt's obviously the second picture the witness took that day at the scene of the crime. Well, it's a little off-center, but that's what you get with a nervous amateur.\nJudge:\nUm... I think the important point here is the person in this picture! (Changed from [Well, I think the important point here is the person in this picture!] in the original release) This is most definitely NOT Maya Fey! What is the meaning of this!?\nPhoenix:\n(This might be the break I was looking for... Now, should I or should I not insist that the person in this picture is not Maya?)\nvon Karma:\nYour Honor. I would like for you to take a look at this picture. This was taken yesterday at the Detention Center's Visitor's Room. This is Mr. Phoenix Wright and the defendant, Maya Fey during his visit...\nJudge:\nMaya Fey? But... Isn't this a totally different person!?\nvon Karma:\nShe looks this way because she is obviously in the middle of channeling a spirit!\nJudge:\nIt's unbelievable... That she can...\nvon Karma:\nYet, it is the truth. (Changed from [However, it is true.] in the original release) When Maya Fey is in that state, she physically changes into the person she's calling!\nJudge:\n...\nMia:\nMs. von Karma. A word, if I may. (Changed from [I wonder if she knows what she's doing...] in the original release)\nPhoenix:\n(M-Mia!?) (Question mark not present in the original release)\nMia:\nTaking pictures of someone during a private visit is illegal. Surely, you must know that that picture can't be submitted as evidence. (Changed from [That picture can't be submitted as evidence.] in the original release)\nvon Karma:\n... Obviously, I know this picture is illegal. (Changed from [Obviously, this picture is illegal.] in the original release) But I never intended to submit it as evidence in the first place!\nPhoenix:\n(Wh-What is she...?)\nvon Karma:\nFrom the moment I showed this picture to the court, this case became all mine. After all, this image has now been forever burned into the judge's mind.\nJudge:\n...\nPhoenix:\n(I... I don't have even a single witty line...)\nMia:\nIt looks like we've been had.\nJudge:\nI don't claim to understand this, and I still cannot believe it... Are you saying that this person... this person is the defendant, Maya Fey!?\nPhoenix:\n(If I give up here, the trial will end! But... If I slip up and say something wrong, it will cost me... Is there any way I can prove that the person in this picture is not Maya!?)\nvon Karma:\nSo, you think you've spotted a problem with this picture? Then earn your keep. Why don't you point out exactly what is so strange in this picture for the court?\nPhoenix:\nPlease direct your attention here!\nJudge:\n...T-To the sleeve? But... But there isn't anything odd about it...\nPhoenix:\nAnd that is exactly what is so odd. Something that should be there is suddenly missing.\nvon Karma:\n\"Should be there\"...? Aaaaah!\nPhoenix:\nThere was a bullet hole in the sleeve of the defendant's costume! If that's the case, then it should be in this picture as well!\nJudge:\nMs. von Karma!! Y-You... You intended to hide this valuable piece of evidence!?\nvon Karma:\n...\nJudge:\nYou will most certainly be assigned a penalty for this!\nPhoenix:\n(Alright. This should do some major damage to her argument...)\nMia:\nDon't celebrate yet.\nPhoenix:\nYou like to bring down the mood, don't you?\nMia:\nTake a look at Ms. von Karma's face.\nPhoenix:\n(Argh! She's got that condescending grin plastered all over her face again.)\nvon Karma:\n...Tsk, tsk, jumping the gun again, I see. Your Honor! I would like to extend an apology on behalf of those incompetent fools.\nJudge:\nWh-What do you mean? And what \"incompetent fools\"...?\nvon Karma:\nIf those fools down at the precinct hadn't missed the bullet hole, I would have gotten a report about it. As I didn't, I could not have known that this picture was of any value to this case.\nJudge:\nHmm, I see...\nPhoenix:\n(She's lying through her teeth! I know it! That woman knew about everything! The bullet hole, the picture -- everything!)\nMia:\nBut you can't prove that. Franziska von Karma's idea of a \"perfect case\" is quite fascinating, don't you think?\nvon Karma:\nYour Honor. You need not worry. If you must assign a penalty, I'll personally make sure that detective gets what's coming. I'm sure there will be a great gnashing of teeth at the next salary discussion.\nPhoenix:\n(Poor Gumshoe...)\nJudge:\nIn any case, this is a very big problem! When the defendant was taken into custody, her costume had a bullet hole in its sleeve. However, from this photo, it would appear that right after the shooting, there was none!\nvon Karma:\n...\nMia:\nThe judge is confused by this strange twist of events. This is your chance, Phoenix! Load all you've got into this one shot, alright!?\nPhoenix:\nGot it! (Watch this, Maya!) Your Honor! There is only one logical explanation for the contradiction!\nPhoenix:\nThe defendant's sleeve had a bullet hole in it. However, this person clearly does not. There can be only one explanation. The person who shot Dr. Grey was not the defendant, but a different person altogether!\nvon Karma:\nWha-Whaaaat!?\nJudge:\nOrder! Order! Order! If order is not restored, I will suspend this trial! Oww!\nPhoenix:\nAah!\nLotta:\nWhy me!?\nvon Karma:\nThe defense's... The defense's argument is a complete mess!\nPhoenix:\nA complete mess? I fail to see how! Please, enlighten us.\nvon Karma:\nHey, witness!\nLotta:\nAah! What the heck!? Is that any way to ask a gal a favor!?\nvon Karma:\nBe quiet you! You were the one who said it was only the two of them when you entered the room!\nLotta:\nWell, ya know...\nvon Karma:\nIf you were lying, I swear that my whip will be the last thing you see!\nLotta:\nL-Look, sis... You're lookin' mighty scary so why don't we say you... Waah! I-I swear! I wasn't lyin' or nothin'! There wasn't anyone else in there! Honest!\nvon Karma:\nYou see! Now riddle me this, Mr. Phoenix Wright!? Where did the defendant vanish to!? And where did this other woman appear from!?\nPhoenix:\nUmm... (Why is it lately, all I want to do is cry...?)\nJudge:\nWell, if the person in this picture is not the defendant, then this poses 2 very big questions. First, where did the defendant vanish to, and second, where did this person come from?\nvon Karma:\nThat's right! Now hurry up and answer, Mr. Phoenix Wright!\nMia:\nCome on! You can't fall apart here, Phoenix Wright!\nPhoenix:\n(I can't believe that even Mia's calling me by my full name... But... I mean... How am I supposed to prove something like this!?)\nvon Karma:\nHad enough yet, Mr. Phoenix Wright? Or do you think you have enough in you to turn things around even now!?\nPhoenix:\n(To \"turn things around\"... That's right. Mia would always turn things around and change her perspective!)\nMia:\nPhoenix...?\nPhoenix:\n(So, where did this intruder appear from, and where did Maya disappear to? I need to look at this situation from a different angle! Let's see... What if before we broke in, the third person was already in the room... And what if Maya had left that room somehow... If I could prove that either one of those conditions were true...)\nJudge:\nMr. Wright. Let's hear what you've come up with.\nPhoenix:\nI think what happened before we forced our way into the Channeling Chamber is...\nPhoenix:\nMs. Hart. Do you remember this key?\nLotta:\nUm... Well, I've seen it... Hey! That's the Channeling Chamber key, right? Before the channeling started, Maya locked the door from the inside with that...\nvon Karma:\nThe defendant herself locked the door...?\nLotta:\nYeah! That's why we all couldn't get the door open. That key's the only one of its kind, after all.\nJudge:\nOh... One of a kind, you say?\nvon Karma:\n...! Wait... Mr. Phoenix Wright...\nPhoenix:\nYes? (It looks like she's catching on...)\nvon Karma:\nI'm afraid to ask, but... Why is that key currently in your possession?\nJudge:\nHuh? What do you mean?\nPhoenix:\nIf Maya Fey locked herself in, then the key should have been with her.\nJudge:\nYes, agreed.\nPhoenix:\nHowever, she did not have the key at the time of her arrest!\nLotta:\nAah! Well, ain't that a kick! So how come you're holdin' it!?\nPhoenix:\nI got this as a present from a certain little girl. And that little girl was nowhere near the crime scene at the time!\nvon Karma:\nTh-Th-That's preposterous!\nPhoenix:\nThis means that Maya Fey must have left the room! If she had not, then I would not be holding this key you see before you!\nvon Karma:\nN-Nooooooo!\nJudge:\nIt seems we have come to an impasse. This picture has clearly captured the face of the murderer. However, is this person the defendant or not? The defense is arguing that this person is not the defendant. Furthermore, as proof, this key has been submitted as evidence. Ms. von Karma.\nvon Karma:\nHow. Can. This. Be!?\nJudge:\nAt this point in time, a verdict on the defendant's guilt is not possible. (Changed from [At this point in time, a verdict on the defendant is not possible.] in the original release)\nvon Karma:\nMy perfect case! How is there a flaw in my perfect case! Don't think you've won yet, Mr. Phoenix Wright! I am a prodigy! I have never lost a case! And I don't intend to lose here in this courtroom to a fool like you! I don't care what I have to do... I will get my guilty verdict!\nJudge:\nThat's enough! If you would like to continue, do so in the lobby. Court will reconvene tomorrow at 10 AM. That is all. Court is adjourned.\nJune 21, 1:32 PMDistrict CourtDefendant Lobby No. 3\nMaya:\nWoooow! That was you Pearly!? You summoned my sis!?\nPearl:\nYes. I felt I had no choice...\nMaya:\nGreat going, Pearly! I knew you were special! Hey, Nick, did you know?\nPhoenix:\n(...Umm, yeah. It's not like anyone else in there could have done that.)\nMaya:\nHmm, Nick... I know you're trying really hard and all, but... I really don't remember ever leaving that room.\nPearl:\nAnd I don't think that a third person... could have gone into that room.\nPhoenix:\nY-Yeah... Well, at least we have until tomorrow to figure things out. Like, what happened in that room, for instance.\nMaya:\nYeah. I'm counting on you!\nPearl:\nAh... I envy the two of you...\nMaya:\nOh, by the way, Nick. Do you think you could take Pearly back home for me?\nPhoenix:\nSure. Alright, Pearls. You ready to go buy some tickets?\nPearl:\nHuh? A tik-ket?\nPhoenix:\n(Poor thing... So sheltered.)\nTo be continued.\n\nJune 21, 3:24 PMKurain Village\nPearl:\nThank you very much for bringing me home, Mr. Nick.\nPhoenix:\nYou're welcome. I had to come and look into a few things here today anyway.\nPearl:\nUm... I thought about this a little.\nPhoenix:\n?\nPearl:\nIf Mystic Maya didn't kill that nice man...\nPhoenix:\nShe definitely didn't!\nPearl:\nYes, of course. But if she didn't... Then someone else did, right? Um, that \"murderer\" person!\nPhoenix:\nYes, Pearls.\nPearl:\nOh... I see...\nPhoenix:\n(I wonder what's wrong... She seems sad...)\nJune 21Wright & Co. Law Offices\nPhoenix:\nThis case has had me out of the office most of the time... I can come back tomorrow. Helping Maya should be my top priority now.\nJune 21Detention CenterVisitor's Room\nPhoenix:\n(Maya must still be in questioning... She'll probably be done in a little bit, so I'll come back later...)\nJune 21Fey ManorMeditation Room\nPhoenix:\n(It's really empty... There's supposed to be training held today, but I guess it's already over...)\nJune 21Fey ManorChanneling Chamber\nPhoenix:\n(...Hmm, looks like Morgan's here too, but she hasn't noticed me yet... What is she doing...? She looks like she's talking to a picture...)\nMorgan:\n...Don't you see? Take a look around... Finally, my chance has come... I've waited for this day for so long! That's right... Prepare yourself, dear Misty...\nPhoenix:\n(What in the...!?)\nMorgan:\nWho's there!? ...Oh, if it isn't Mr. Wright...\nPhoenix:\nUm... Just curious, but that picture you were just looking at...\nMorgan:\nOh, today was that event, was it not, good sir? I heard you did well.\nPhoenix:\nHuh, oh, yes... Thank you.\nMorgan:\nI am terribly sorry I could not attend the trial today. Please accept my apology. I had a previous engagement, as I had to watch over the trainees' training today.\nPhoenix:\n(I get the sense she really doesn't want to talk about the picture...)\nMorgan:\nAll because the Master can't be here with us, you understand. And that is why a lowly branch family member such as myself must do this.\nJune 21Fey ManorWinding Way\nPhoenix:\n(Looks like there's no one here... And even though the weather is gorgeous today, it's raining inside my heart...)\nJune 21Fey ManorSide Room\nPhoenix:\n(The bedding is all laid out today too. Guess I'll leave them alone for now...)\nAfter presenting Black Key in Kurain Village:\nJune 21Fey ManorWinding Way\nPhoenix:\n(Hey, there's someone by the incinerator... Ooh, looks like they've noticed me. And are now running at top speed towards me...)\nIni:\nOh, hey! *huff, huff* Like, *huff, huff* You're that dentist guy.\nPhoenix:\nActually, it's Phoenix Wright, attorney at law. Nice to see you again.\nIni:\nOoh, like, real suave. So, it's, like, my turn. It's nice to see you, too.\nPhoenix:\nSo, what's up? You're all out of breath...\nIni:\nL-Like, huh? Oh! Like you mean... Like, I'm just totally happy and like, totally excited to be here.\nPhoenix:\nExcited?\nIni:\nLike, I mean, there are so many things to, like, see! It's, like, the real deal here!\nPhoenix:\nOh, really? For example...?\nIni:\nFor example... Like, that urn over there. Do you, like, know about it?\nPhoenix:\n(All I see is an old, cracked piece of pottery...)\nAfter clearing all Talk options in Fey Manor - Channeling Chamber, and presenting Black Key in Kurain Village, then examining incinerator in Fey Manor - Winding Way:\nJune 21Detention CenterVisitor's Room\nMaya:\nHey, Nick... I've been waiting...\nPhoenix:\n(...She looks so helpless...)\nMaya:\nSo? So? How was it!? What did you find out!?\nPhoenix:\nUm... Well... I found a few things...\nMaya:\nIs it so bad that you can't even look me in the eye? (Changed from [My eyes are tearing up, Nick. Don't make me cry...] in the original release)\nPhoenix:\nI... I just need a little more time. It'll all come together by tomorrow, I promise.\nMaya:\nI'm sorry, Nick. Every time I see you, all I do is cause trouble...\nAfter clearing \"Ball\" Talk option in Detention Center - Visitor's Room:\nJune 21Kurain Village\nPhoenix:\nAh!\nLotta:\nAAAAAAAAH!\nPhoenix:\nH-Hey! Wait! Please! Lotta! ... (She ran off into the manor...)\nJune 21Fey ManorMeditation Room\nPhoenix:\nLotta...\nLotta:\nAaack!\nPhoenix:\nH-Hey!\nI'm tellin' ya, quit followin' me, ya hear!? I'm a worthless piece of trash! Ya lay eyes on me, and they'll turn ta dust!\nPhoenix:\n(...*sigh*...)\nChanneling Chamber\nPhoenix:\nHey! Morgan!\nMorgan:\nYes, what is it? ...And must you be so noisy!? We have a rule here: \"The hallway is not for running\" Now then, in a calm manner ask your question.\nPhoenix:\nOkay... Anyway, did you see Lotta come by here?\nMorgan:\nAh, that girl from the \"Heartland\"... I'm sorry, but she did not pass by here at any time.\nPhoenix:\n(Grr... Lotta! You sure know how to waste a man's time...)\nJune 21Fey ManorSide Room\nPhoenix:\nI'm pretty sure I saw Lotta run in this direction... but it doesn't look like she's here...\nJune 21Fey ManorMeditation Room\nPearl:\nOh, Mr. Nick! That person ran by here just now.\nPhoenix:\nWhat person?\nPearl:\nUm, you know... The person with the fluffy cotton candy hair...\nPhoenix:\n(Ah, she means Lotta.)\nPearl:\nShe said, \"Don't look at me with 'em eyes!\" but... I'm not that scary, am I...?\nPhoenix:\n...I don't think that's quite what she meant.\nPearl:\nOh, that's right. She also wanted me to tell you, \"Goin' on a trip to find myself, so don't ya bother findin' me!\"\nPhoenix:\nO-Oh... Well, thanks.\nPearl:\nYou're welcome.\nAfter examining the \"Clothing box\"  in Fey Manor - Side Room and adding it to the Court Record:\nJune 21Detention CenterVisitor's Room\nPhoenix:\nM-Mia!\nMia:\nPhoenix, it's good to see you. I was really worried so I thought I'd see how you were doing.\nPhoenix:\n...You might get caught on film again...\nMia:\nThere are certain risks you have to take in life, or in my case, death. Anyway, how are you doing? Have you found anything useful?\nPhoenix:\nUm, only a little. I think I'm slowly beginning to understand everything, piece by piece.\nMia:\nEverything will resolve itself by tomorrow, somehow.\nAfter clearing all Talk options:\nMia:\nWell, it's about time I left.\nPhoenix:\nM-Mia!\nMia:\nWe'll be in big trouble if the guard sees me here... Phoenix...\nPhoenix:\nYes, Chief!\nMia:\nThere is still a lot of dirt left in this case. Once you think you've gathered all the evidence, then come back.\nPhoenix:\n...Yes, Chief.\nAfter clearing \"Sacred Urn\" Talk option in Fey Manor - Meditation Room:\nJune 21Kurain Village\nPhoenix:\n(Phew. I think I've found everything I can. But I can't see how it all adds up... Hmm... (Changed from [But I can't see how they all add up... Hmm...] in the original release))\n...H... He...\nPhoenix:\n(And is Ini Miney being here just a coincidence...?)\n...Hey, Mister...\nPhoenix:\n(How is it that the spirit Dr. Grey wanted to call just happened to be that nurse, and that nurse turns out to be Ini's sister... It's too... convenient...)\n...Hey! Phoenix! I'm talkin' to you!\nPhoenix:\n(I wish I knew a little more about Ini, but where am I going to find info like that?)\nOh, I get it. Ya can't be bothered to look over at trash like me. Is that it, Mr. High-and-Mighty!?\nPhoenix:\nAah! L-Lotta!\nLotta:\nOh, so ya finally noticed!\nPhoenix:\n(I thought I heard a mosquito buzzing in my ear, although I couldn't understand a word...)\nLotta:\nWell, I gotta hand it to ya. Ya sure know how to chase down garbage! I mean, I'm grateful to ya for chasin' this large lump of one around like this.\nPhoenix:\nUm... Thanks...?\nLotta:\nBut ya know, you're just wastin' yer time. I'll be fine on my own.\nPhoenix:\nWh-What are you going on about? And as for \"following\" or \"chasing\" or whatever it is, isn't that what YOU'RE doing!?\nLotta:\nUm, well, ya see... Well, yer not exactly a real gentleman with a lady's heart, are ya?\nPhoenix:\n(You're not exactly the world's number one charmer either, sister.)\nAfter clearing \"Ini Miney\" Talk option in Kurain Village:\nJune 21Hotti ClinicReception\nPhoenix:\n(...So, this is where Ini was hospitalized...)\n???:\nHmm, yes... Are you here to visit a patient? Hmm...\nPhoenix:\nAh, yes... Are you a doctor here...?\n???:\nHmm, yes... I'm Director Hotti... Hoh, hoh.\nPhoenix:\n(Ack! I didn't think I'd be speaking with the Director himself...)\nHotti:\nHmm, yes...? So what can I help you with? Uh, huh...\nPhoenix:\nI'd like to ask you a few questions about Ms. Ini Miney.\nHotti:\nHmm? Ms. Miney? Ms. Ini Miney? ...Hmm... Yes... Hmm... OH! Her! Ah, it's too bad. I'll tell you something. That girl left here a long time ago.\nNurse:\nHere you are! Sir!\nPhoenix:\n?\nNurse:\nYou know you shouldn't be up and about! Come on, it's back to your room with you!\nHotti:\nAh, Sweet'ums! Calm down, calm down. Don't be so harsh to an old man like me.\nNurse:\nDon't you dare start that \"Sweet'ums\" thing with me! If you don't behave, you'll get yourself tossed out of this hospital!\nPhoenix:\n(Wow. I didn't think nurses could be this direct or forceful towards their boss.)\nNurse:\nCome now. Be a good boy and give me the Director's white lab coat!\nHotti:\nOK, OK. I got it. I. Got. It. Hmm, yes...\nPhoenix:\n...\nHotti:\n...\nPhoenix:\nUm...\nHotti:\nHmm, yes? Uh, huh?\nPhoenix:\nDon't \"Hmm, yes\" me. Who in the world are you?\nHotti:\nI'm Director Hotti. Hoh, hoh.\nPhoenix:\n...\nPhoenix:\n(The nurse went off somewhere... Oh the inhumanity. Only person I can talk to... ...is this guy... ...Uuuugh...)\nAfter clearing \"The operation\" and \"The accident\" Talk options:\nHotti:\nIt's been half a year since Miss Ini had her surgery and got better. She was discharged sometime in December last year.\nPhoenix:\n(It's already been half a year, huh...?)\nHotti:\nHmm, yes... So, how was I? I was a real help, wasn't I? Hmm, yes...\nPhoenix:\nY-Yes... Thank you very much.\nHotti:\nHmm, yes... Well, then, I'll be getting back to my room then. Tell Miss Ini I said hi, OK? Hmm, yes...\nPhoenix:\n(It's time for me to leave too, hmm, yes... Ack! OK, it's definitely time to leave!)\nJune 21Kurain Village\nLotta:\nHey! So how was it!? Didja go to the clinic?\nPhoenix:\nYeah... I found out a few things... I guess...\nLotta:\n...What's the matter? Ya ain't lookin' so well. Ah, yeah. So earlier, that ol' granny called the cops.\nPhoenix:\n...Huh? The cops? Why would Morgan call the police?\nLotta:\nShe said she had \"somethin' to tell 'em\". Things are sure gettin' interestin'.\nJune 21Fey ManorWinding Way\nIni:\nHey! Like, I haven't seen you in a while...\nPhoenix:\nYeah. (I think I have enough to finally unlock her secret...)\nIni:\n...Like, what's with that scary look on your face...?\nAfter clearing \"Dr. Grey\" Talk option in Fey Manor - Winding Way:\nJune 21Kurain Village\nPhoenix:\n...? Looks like something's up...\nPearl:\nS-Stop... Stop! Leave my mother alone!\nGumshoe:\nO-Ow! H-Hey, hold on, OK, pal!? I'm not gonna hurt...\nMorgan:\nPearl, dear. It is perfectly alright. I will be out for a short while with this young man.\nPearl:\nMother! Please, let me go too!\nMorgan:\nNo, you must stay here and protect the manor.\nPearl:\nBut...\nGumshoe:\nAww, don't make that face. Hey, I'll tell you what! I'll show you something cool. Here, look! It's a real pistol...\nMorgan:\nDetective! Do not upset me further!\nGumshoe:\nAh... Sorry...\nPhoenix:\n(...Poor Gumshoe... Being dragged off by the ear like that by Morgan... Owww...)\nPearl:\nMother...\nJune 21, 6:38 PMDetention CenterVisitor's Room\nMia:\nYou kept me waiting, Phoenix.\nPhoenix:\nMia!\nMia:\nSo, how are the preparations?\nPhoenix:\nI think I have enough evidence and information now... I think...\nMia:\nEverything will be on your shoulders tomorrow. Whether Maya is found guilty or innocent... It's a heavy weight to bear.\nPhoenix:\n(Hmm... If memory serves... Mia had a few Psyche-Locks of her own...) Mia. I'm ready to unlock the last piece of information I need now. (Changed from [Mia. I'm going to get the last piece of information I need.] in the original release)\nMia:\nSure. I welcome you to try.\nMia:\n...Something's been bothering me all this time. This crime is something no normal person could carry out. The person would have to know a lot about Fey Manor and the village itself to do this.\nPhoenix:\n...But Morgan already has an alibi...\nMia:\nYes, which is why I can't figure out how it was done. We can assume that Ini Miney is involved somehow...\nPhoenix:\nBut we have one big problem on our hands.\nMia:\n...A problem? With what?\nPhoenix:\nWe don't have a motive. Why would Morgan want to kill Dr. Grey? Why would she have to? Also, we don't really know for sure that she was cooperating with Ini.\nMia:\n...\nPhoenix:\n(Mia doesn't have a clue either, huh?)\nMia:\nHmm... Then, there is only one possibility...\nPhoenix:\nHuh!?\nMia:\nThink about it, Phoenix. Why would my aunt do something like this? And why would she do it in such an underhanded fashion?\nPhoenix:\nUm... because...?\nMia:\nMother... She is the one who holds the key to this.\nPhoenix:\nMother? Whose? Mine?\nMia:\nDon't be silly. Mine, of course! Misty Fey.\nPhoenix:\n(Mia and Maya's mother? Why would she bring her up now...?)\nMia:\nNow then... Looks like we've gathered everything we could. All we have to do is win tomorrow! Everything will become apparent then.\nPhoenix:\nR-Right, Chief! We won't lose!\nTo be continued.",
  "characters": [
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Maya Fey",
      "age": "18",
      "gender": "Female",
      "description1": "My assistant until a year ago. Now she's training to be a spirit medium.",
      "description2": "The defendant, and my client. Was arrested on suspicion of murder while channeling."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Dr. Turner Grey",
      "age": "35",
      "gender": "Male",
      "description1": "The director of the Grey Surgical Clinic where the malpractice incident occurred.",
      "description2": "Grey Surgical Clinic Director. Had a malpractice incident. Murdered during a channeling."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Pearl Fey",
      "age": "8",
      "gender": "Female",
      "description1": "Ran away as soon as she saw me. A girl who is Maya's little cousin.",
      "description2": "Maya's cousin. A channeling prodigy with intense spiritual power. Also the youngest."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Morgan Fey",
      "age": "??",
      "gender": "Female",
      "description1": "Maya's aunt. She has a strange, powerful aura about her.",
      "description2": "Maya's aunt. A member of the Fey clan branch family. She is the mother of Pearl."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Lotta Hart",
      "age": "23",
      "gender": "Female",
      "description1": "Claims to be an investigative photographer. She lives for the next big scoop."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Dick Gumshoe",
      "age": "31",
      "gender": "Male",
      "description1": "Detective at the local precinct. In charge of the initial investigation."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Ini Miney",
      "age": "21",
      "gender": "Female",
      "description1": "College student. A huge fan of the occult and is doing research in parapsychology.",
      "description2": "College student. Researching parapsychology. Older sister, Mimi, died in a car accident."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Mimi Miney",
      "age": "deceased",
      "gender": "Female",
      "description1": "Died in a car accident 1 year ago. Was Ini's older sister, nurse at Dr. Grey's clinic."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Mia Fey",
      "age": "deceased",
      "gender": "Female",
      "description1": "Maya's older sister. She was a top notch lawyer and my mentor and friend forever."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Franziska von Karma",
      "age": "18",
      "gender": "Female",
      "description1": "Became a prosecutor in Germany at age 13. A prodigy who has never known defeat."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Ami Fey",
      "age": "deceased",
      "gender": "Female",
      "description1": "Kurain Channeling Technique founder. Legend says her soul is sealed in the Sacred Urn."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Director Hotti (purported)",
      "age": "??",
      "gender": "Male",
      "description1": "A peculiar patient who claims to be Director Hotti. Seems to be extremely \"healthy\"."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "It's my all-important badge. It shows that I am a defense attorney."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Guidemap (Fey Manor)",
      "type": "Maps",
      "obtained": "Received from Dr. Grey.",
      "description1": "A diagram of Fey Manor. Meditation room to the south. Channeling chamber north of meditation room. Side room to the east, have to go through winding path from meditation room to get to side room."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Maya's Magatama",
      "type": "Other",
      "obtained": "Received from Maya Fey.",
      "description1": "Slightly translucent. It's small, but it has a deep, profound aura about it.",
      "description2": "Slightly translucent. It radiates softly with a mysterious light."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Newspaper Clipping 1",
      "type": "Evidence",
      "obtained": "Retrieved at the Wright & Co. Law Offices.",
      "description1": "One year ago on May 2nd, 14 patients died from malpractice at Grey Surgical Clinic."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Folding Screen",
      "type": "Evidence",
      "obtained": "Retrieved from the channeling chamber.",
      "description1": "About 8 inches off the ground is a small hole that looks like a bullet hole."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Black Key",
      "type": "Evidence",
      "obtained": "Received from Pearl Fey.",
      "description1": "An old steel key. A green jewel is set in the center of the key's grip."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Newspaper Clipping 2",
      "type": "Evidence",
      "obtained": "Received from Detective Gumshoe.  → Received from Director Hotti.",
      "description1": "Mimi Miney, nurse at Grey Surgical Clinic, died after falling asleep at the wheel.",
      "description2": "Articles about the car accident. This is a newspaper clipping about the death of Mimi Miney, the nurse who worked at Turner Grey's clinic. It reads how Mimi died as a result of her car crashing when she fell asleep at the wheel and Director Hotti fills in some further parts of the article later on. The content is as follows-Highway of Nightmares-May 24 - Late last night, two women's car crashed into a highway center divide. One of the women was not able to escape the flaming wreckage and died at the site. Ongoing investigation has revealed that the driver had fallen asleep at the wheel. -Ms. Ini Miney Holds Interview About Crash- I was like, really tired and I dropped off to sleep. Then there was this crash, and like, I woke up in a huge sea of flames. I was like, still half-asleep, but I opened the right door and like, got out. I don't, like, remember anything else. -Doctor Lurking in the Shadows? If Ms. Ini Miney is to be believed, the one driving the car was her sister, Mimi Miney. Mimi Miney was the nurse at Grey Surgical Clinic where 14 patients were accidentally overdosed to their death. Is this then, just a mere coincidence...? "
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Floor Plans (Crime Scene)",
      "type": "Maps",
      "obtained": "Submitted as evidence during the trial.",
      "description1": "A diagram of the Channeling Chamber. A four sectioned mat in front of a platform at the head."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Dr. Grey's Autopsy Report",
      "type": "Reports",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "After being stabbed in the chest, he was shot in the forehead at point-blank.",
      "description2": "Stabbed in chest then shot at point-blank. Gunpowder residue around bullet hole."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Pistol",
      "type": "Weapons",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Murder weapon. Was Grey's. Two shots fired. Bears Maya's and Grey's fingerprints."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Knife",
      "type": "Weapons",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Murder weapon. A small fruit knife. Belongs to the Fey's. Bears Maya's fingerprints."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Maya's Costume",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Clothes Maya was wearing at the time of the murder. There are blood splatters on it.",
      "description2": "Clothes Maya was wearing at the time of the murder. This is Maya's robe that she wore on the day of Turner Grey's murder. It is stained with blood splatter and a bullet hole is present in the sleeve. The robe is otherwise clean. It is purple in color."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Lotta's Photo 1",
      "type": "Photographs",
      "obtained": "Received from Lotta Hart.",
      "description1": "A picture taken at the murder scene. This is a photo taken by Lotta Hart of Maya Fey after they break into the Channeling Chamber when they hear a gunshot. Turner Grey is lying dead on the floor after being shot."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Lotta's Photo 2",
      "type": "Photographs",
      "obtained": "Submitted as evidence by Franziska von Karma.",
      "description1": "A picture taken at the murder scene. This is the second photo taken by Lotta Hart of Maya Fey after they break into the Channeling Chamber when they hear a gunshot. Turner Grey is lying dead on the floor after being shot behind her. Maya Fey is standing, pistol in hand, wearing a blood-splattered robe."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Sacred Urn",
      "type": "Other",
      "obtained": "Retrieved from the Winding Way.",
      "description1": "Ami Fey's spirit is sealed within. It's chipped and cracked all over.",
      "description2": "Broken by Pearl right before the murder. Under repair in the hallway until police came."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Cloth Scrap",
      "type": "Evidence",
      "obtained": "Retrieved from the Winding Way.",
      "description1": "Unburned remains found inside the garden incinerator. Small amount of blood is on it."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Pearl's Ball",
      "type": "Other",
      "obtained": "Retrieved from the Side Room.",
      "description1": "Pearl's favorite toy. She was playing with this at the time of the murder, it seems."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Clothing Box",
      "type": "Evidence",
      "obtained": "Retrieved from the Side Room.",
      "description1": "There is a hole that looks like a bullet hole about 8 inches off the ground."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "License Photo",
      "type": "Photographs",
      "obtained": "Received from Director Hotti.",
      "description1": "Ini's photo for her driver's license. Director Hotti's treasured possession."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "Reunion, and Turnabout\n\n\n\n\n\n\n\n\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 4June 22, 9:51 AMDistrict CourtDefendant Lobby No. 3Maya:\nUm... Nick...Phoenix:\nYeah?Maya:\nDid you know that Von Karma's daughter is only 18... Just like me...?Phoenix:\nUm, yeah. ...Why?Maya:\nI was just thinking about how strong she is... I mean, she's been in Germany all this time all by herself, and she's so grown up!Phoenix:\n...Yeah, and I'm sure she felt a lot of pressure from her father's reputation.Maya:\n...And then you look at me, and, well... I'm the daughter of the Master, but I'm still just a little girl. And on top of that, I'm the suspect in a murder trial.Phoenix:\n(Um... But I think you're really strong too, Maya, for all you've gone through...)Pearl:\nGood morning! The two of you look like you're doing well today. I'm happy for you!Maya:\nHey! Morning, Pearly!Pearl:\nYou'll be safe today, Mystic Maya!Maya:\nHuh? What do you mean?Pearl:\nMy mother is coming today to show her support!Maya:\nY-Yeah... Yeah! That's right, Pearly!Phoenix:\nHey, Pearls...Pearl:\n...? Yes, Mr. Nick?Phoenix:\nUm, do you think you could do me a big favor? Could you channel Mia today too?Pearl:\nHuh? ...I was sort of hoping to sit in the audience today and watch...Phoenix:\n...Please. It's very important to me. I don't feel confident enough without her help...Pearl:\nMr. Nick! That's enough! You can't show weakness in front of the person you love!Maya:\nP-Pearly! N-Not this again...Phoenix:\nPlease, can you do this for us, Pearls?Pearl:\nUm... Alright. I'll do it. I'll do it for Mystic Maya's sake. See you later, then! I'll leave you two to your alone time!Phoenix:\n...Phew, thank goodness.Maya:\nNick?Phoenix:\nThis way, Pearls won't be able to see today's trial...Maya:\n...Wh-What do you mean...? What's going on...?June 22, 10:00 AMDistrict CourtCourtroom No. 2Judge:\nCourt is now in session for the trial of Maya Fey.Phoenix:\nThe defense is ready, Your Honor.von Karma:\nLet's start already. Mr. Phoenix Wright. I look forward to tonight's news with great joy. The image of your defeated face will be transmitted all over the world!Mia:\nAll over the world, huh? Sounds like you've made quite a name for yourself, Phoenix.von Karma:\nDon't be foolish, you foolish fool wearing the foolishly foolish clothes. The famous one is me! I'm the prodigy who has never lost a case since becoming a prosecutor five years ago. Naturally, the world's eyes are on me, as I conduct my first trial in this country!Mia:\nUh, huh... That's nice, Ms. von Karma.von Karma:\nHmph. Glad to see you're in such good \"spirits\" today, Ms. Fey.Phoenix:\n(Uhh... It's true what they say... Women really are scary when they fight... *gulp*)Judge:\nNow then. A very interesting theory was presented during yesterday's session.von Karma:\nThat the defendant could have left the Channeling Chamber, correct?Judge:\nYes. And this key is proof of that. This key, the only key to the Channeling Chamber, was not where it should have been.von Karma:\nYour Honor, I would like to say one thing before we begin.Judge:\nA-Alright... Let's hear it.von Karma:\nThe prosecution has determined that from the time of the murder to the time of arrest, the defendant did indeed leave the room at one point.Phoenix:\nWh-What!?Judge:\nBut... Ms. von Karma! Then... How do you explain this picture? Are you saying then, that the person in this picture is not the defendant...?von Karma:\nI never said that wasn't the defendant.Judge:\nTh-Then what is the meaning of this...?von Karma:\nAll I am saying is that Maya Fey, after killing the victim, exited the room. And I believe that is when she dropped this key.Judge:\nCan you substantiate your claim?von Karma:\nIsn't that what I'm here for? The prosecution would like to call the defendant's aunt, Morgan Fey, to the stand.Mia:\n...Just as I suspected. Aunt Morgan...Phoenix:\n(Poor Mia... She seems really torn by this...)von Karma:\nWitness. Name and occupation.Morgan:\nMy name is Morgan Fey, and I am a spirit medium, in a manner of speaking...Judge:\nI'm sorry, but what do you mean, \"in a manner of speaking\"...? Aaah!von Karma:\nI don't think anyone really cares. Now then, after the murder took place, you kept watch over the defendant, correct?Morgan:\nYes, that is correct. I performed the Spirit Severing Technique on Mystic Maya then.Judge:\nS-Spirit Severing Technique?Morgan:\nA technique to remove a spirit from a body and send it back to the other world. That is...Judge:\nYes...? That is...? Mmfph!von Karma:\nYou. Be quiet. Now, witness. Something happened while you were performing this technique, correct?Morgan:\n...Yes, that is correct.Phoenix:\nWh-What in the world could've...!?Morgan:\nMystic Maya... She escaped from the room...Judge:\nWh-What!?von Karma:\nAnd here we come to the heart of the matter. Maya Fey, while in a possessed state, managed to escape from the Channeling Chamber!Judge:\nOrder! Order! Order! Ms. Fey! Please testify to this court what happened during that time!Morgan:\nYour Honor, I will try my best...Mia:\nI think someone just upped the ante on this trial...Witness Testimony-- Maya's Escape --Morgan:\nAfter we heard the gunshots, those two broke the door open and entered the Chamber.\nI requested that Mr. Wright and the other lady please contact the police.\nA pistol was hanging from Mystic Maya's hand and she was in a daze...\nThen, quite suddenly, she thrusted me away from herself and escaped from the room.\nWith great strength, she hit the base of my neck and I fainted for a short while...\nI'm afraid I have no knowledge of where she went after that.Phoenix:\nWhy have you hidden this until now!?Morgan:\nI... I did not wish to cause more trouble for Mystic Maya. However... I must correct falsities when they arise.von Karma:\nThat's right. She is simply correcting a falsity, Mr. Phoenix Wright.Phoenix:\n(Why is she making it a point to take a stab at me... Never mind.)Judge:\nMr. Wright, your cross-examination, please.Mia:\nMy aunt is a very smart and sly person. It's going to be hard for us to find a crack in her testimony...Cross Examination",
      "testimonies": [
        {
          "testimony": "After we heard the gunshots, those two broke the door open and entered the Chamber.",
          "person": "Morgan",
          "present": []
        },
        {
          "testimony": "I requested that Mr. Wright and the other lady please contact the police.",
          "person": "Morgan",
          "present": []
        },
        {
          "testimony": "A pistol was hanging from Mystic Maya's hand and she was in a daze...",
          "person": "Morgan",
          "present": []
        },
        {
          "testimony": "Then, quite suddenly, she thrusted me away from herself and escaped from the room.",
          "person": "Morgan",
          "present": []
        },
        {
          "testimony": "With great strength, she hit the base of my neck and I fainted for a short while...",
          "person": "Morgan",
          "present": []
        },
        {
          "testimony": "I'm afraid I have no knowledge of where she went after that.",
          "person": "Morgan",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- Maya's Escape --Morgan:\nAfter we heard the gunshots, those two broke the door open and entered the Chamber.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nJust now, you said, \"those two.\" Who were the two people you were referring to?\nMorgan:\nI was referring to that foreign lady and yourself, good sir.\nPhoenix:\nUm, Lotta's not a foreigner... despite how she talks...\nMorgan:\nOh, is that so? I'm sorry... I simply could not understand her atrocious English, not to mention she looked awful!\nPhoenix:\n(I can already see people in the heartland gearing up for a riot...)\nMorgan:\nIn any case, I have already sent the repair bill to your office, Mr. Wright.\nPhoenix:\nOh, uh, thanks.\nJudge:\nHmm... What did you do after that, Ms. Fey?Morgan:\nI requested that Mr. Wright and the other lady please contact the police.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas it really necessary to have two people do something so simple as call the police? If there was a possibility of escape, then one of us should have stayed behind!\nJudge:\nHmm, yes. That is a very good point.\nMorgan:\nAt that time, I, myself, was a little confused. On top of which, there was another...\nJudge:\nAnother what, madam?\nMorgan:\nOh, it's nothing. No need to concern yourself.\nPhoenix:\n(I want to hear the end of that sentence...)\n\n\n\nQuestion further\n\n\n\n\n\n\n\nPhoenix:\nThere was another reason you wanted both of us out of that room, wasn't there!?\nMorgan:\n...\nPhoenix:\nYou must testify! Why did you chase us out of the room!?\nMorgan:\n...I simply did not wish for there to be more victims.\nPhoenix:\n...!\nMorgan:\n\"The lives of both the good sir and that camera woman may be in danger...\" is what I thought to myself.\nJudge:\nWell, that was very noble of you, Ms. Fey.\nPhoenix:\n(This is bad... Now people have a good impression of her and a bad one of us...)\nMia:\nLooks like she caught us napping. That's my aunt for you...\nJudge:\nAre you satisfied now, Mr. Wright? Ms. Fey, please continue.\nLeads back to cross-examination\n\n\n\n\nLeave her be (before pressing third, fourth, and sixth statements)\n\n\n\n\n\n\n\nPhoenix:\n(The last bit of her sentence sounds like a red herring... If that's the case, I'm not going to fall into her trap today.)\nJudge:\nIf the defense has no further questions, let us press on.\nLeads back to cross-examination\n\n\n\n\nLeave her be (after pressing third, fourth, and sixth statements)\n\n\n\n\n\n\n\nPhoenix:\n(The last bit of her sentence sounds like a red herring... If that's the case, I'm not going to fall into her trap today.)\nLeads to:\n\"That's enough!\"Morgan:\nA pistol was hanging from Mystic Maya's hand and she was in a daze...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nDuring our investigation, you stated that you struck the defendant on the head, and this strike caused Maya to lose conciousness. Do you stand by this statement?\nMorgan:\nI'm afraid I don't. The statement I gave you was a lie...\nPhoenix:\n...! B-But why would you lie about something like that!?\nMorgan:\nIt is very painful for me to say this, however...\nvon Karma:\n\nvon Karma:\nThe witness was lying to cover for the defendant.\nPhoenix:\n(She was... covering for Maya...?)\n\n\n\nQuestion further\n\n\n\n\n\n\n\nPhoenix:\nSo, you were \"covering for the defendant\"!?\nMorgan:\nWell, yes... It was only later that I was informed of what had occurred. That the renegade Mystic Maya had done something very unexpected...\nJudge:\nS-Something unexpected!? What, pray tell, did sh-- Oogh!\nvon Karma:\nThis witness didn't and couldn't have seen what happened. If you want to know what this unexpected thing was, there is always later.\nJudge:\nY-Yes, very well...\nPhoenix:\n(Ugh... Why does it suddenly feel like there's a rock in the pit of my stomach...?)\nvon Karma:\nNow, witness, continue with what happened.\nLeads back to cross-examination\n\n\n\n\nLeave her be (before pressing second, fourth, and sixth statements)\n\n\n\n\n\n\n\nPhoenix:\n(I'm sure Von Karma's allowing this testimony because it's advantageous to her... ...Which means I shouldn't press Morgan any further...)\nvon Karma:\nYou're finally beginning to understand, aren't you, Mr. Phoenix Wright... Now, witness, continue with what happened.\nLeads back to cross-examination\n\n\n\n\nLeave her be (after pressing second, fourth, and sixth statements)\n\n\n\n\n\n\n\nPhoenix:\n(I'm sure Von Karma's allowing this testimony because it's advantageous to her... ...Which means I shouldn't press Morgan any further...)\nLeads to:\n\"That's enough!\"Morgan:\nThen, quite suddenly, she thrusted me away from herself and escaped from the room.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas it really that easy for her to escape from you?\nMorgan:\nI'm ashamed to admit to such a thing, however, yes...\nPhoenix:\nBut you are physically larger and stronger than the defendant. There is no way she could have escaped from you so easily...\nvon Karma:\n\nvon Karma:\nHave you forgotten already, Mr. Phoenix Wright? What about this picture!? Remember that at the time, the defendant was not physically \"Maya Fey\".\nPhoenix:\n...Ack!\nJudge:\nHmm... Growing old is such a mysterious thing. Trust me, I know first-hand.\nMorgan:\nBasically, Mystic Maya's body was still that of the nurse she had called.\nPhoenix:\nBut if she had run away, wouldn't you have given chase right away!?\nMorgan:\nWell, yes, I would have... however...Morgan:\nWith great strength, she hit the base of my neck and I fainted for a short while...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou fainted...?\nMorgan:\nI became dizzy, and then collapsed onto the floor.\nJudge:\nHow long were you unconscious?\nMorgan:\nI... I'm not sure. About ten minutes, perhaps.\nJudge:\nHmm... And the defendant almost certainly went somewhere in that time...\nvon Karma:\nHappy? Witness, elaborate on that point for us.Morgan:\nI'm afraid I have no knowledge of where she went after that.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nIs that because you were unconscious?\nMorgan:\nWhy, yes...\nPhoenix:\n(Great, well, now what...?)\n\n\n\nQuestion further\n\n\n\n\n\n\n\nPhoenix:\nSo while you were unconscious, you have absolutely no idea where the defendant went?\nMorgan:\nI would think that's obvious, good sir.\nPhoenix:\nIf that's true... then how can you know for sure that the defendant left the Channeling Chamber at all!?\nJudge:\nNow that you mention it... I have to wonder myself!\nvon Karma:\nIt's true that this witness is not able to confirm this. But the key word here is \"this\" witness.\nPhoenix:\nWhat do you mean by that!?\nMia:\nIt means she has another witness up her sleeve. That's what. It looks like Ms. von Karma is ready to move on to her next witness.\nLeads back to cross-examination\n\n\n\n\nLeave her be (before pressing second, third, and fourth statements)\n\n\n\n\n\n\n\nPhoenix:\n(If she fainted, then there's no way she can testify any more than she has... If I press her, I'm not going to get anything useful anyway...)\nJudge:\nHmm... Well, then... Let's continue on with the testimony, shall we?\nLeads back to cross-examination\n\n\n\n\nLeave her be (after pressing second, third, and fourth statements)\n\n\n\n\n\n\n\nPhoenix:\n(If she fainted, then there's no way she can testify any more than she has... If I press her, I'm not going to get anything useful anyway...)\nLeads to:\n\"That's enough!\"Mia:\nI can't see a crack in her testimony...Phoenix:\nWh-What should we do...?Mia:\nFor now, we should try and get more information out of her. After we get more information from her we may be able to use it later to our advantage.After pressing second, third, fourth, and sixth statements:Judge:\nThat's enough! From what I can tell, there is nothing wrong with this witness's testimony. And from what she has said, we can establish that Maya Fey did leave the Chamber.Phoenix:\n(Hmm... I hope this isn't going to come back and bite us in the butt...)von Karma:\nNow, let's take the next logical step and ask, \"Where did the defendant go after leaving the Channeling Chamber?\"Judge:\nYes, yes... That is exactly what we should b-- Eeek!von Karma:\nBe quiet, you! Now then, what the escapee had done was she had gone to speak with a certain person!Phoenix:\nShe... She went to speak with someone!?Judge:\nWh-Who was it!?von Karma:\nThe prosecution calls Ms. Ini Miney, who was sleeping in the Side Room at the time.Phoenix:\nI-Ini Miney...?Mia:\nI think you can see where this is headed...von Karma:\nWitness. Name and occupation.Ini:\nUm... OK, so my name is, like, Ini Miney. I'm, like, researching, like, parapsychology stuff at the, um, university.Judge:\nWhat is this \"parapsychology\"?Ini:\nUm... Let's see... It's, like, I guess, most people call it \"occult stuff\".Judge:\nEven if that's what most people call it, I can't say I understand what that means...von Karma:\nThen I suggest you go home and research it yourself.Judge:\nYes, sir.von Karma:\nNow then, Ms. Miney, after the murder took place, you spoke with the defendant, Maya Fey. Is this correct?Ini:\nUm... Well... Hmm... Like, I guess...von Karma:\nIf that's the case, then let's hear your testimony. That IS alright, isn't it, Your Honor?Judge:\nYes, sir.Phoenix:\n(For the love of all things good, Your Honor, have some spine... For my sake...)Witness Testimony-- After the Murder --Ini:\nLike, when the channeling started, I was, like, sleeping in the Side Room.\nLike, a little later, someone came into the room, like, really suddenly.\nIt was, like, oh my gawd, totally my sister!\nI, like, hadn't seen her in like, so long... I was so happy in, like, a sad way...\nMy sister... She, like, told me something, like, totally terrible.Judge:\nNow hold your horses, young lady! You're saying the person that entered was your sister!? Don't you mean the defendant, Maya Fey...?von Karma:\nReally, now... Your Honor. Maya Fey was still in the middle of channeling at that time.Judge:\nA-Are you saying that the spirit was the spirit of this witness's sister!?von Karma:\nYes, Mimi Miney. She was a nurse at Dr. Grey's clinic.Judge:\nOh... W-Well... This is...von Karma:\nWitness.Ini:\nLike, yeah?von Karma:\nIn your testimony, you mentioned a \"terrible\" thing. Why don't you tell the court what this terrible thing was? I'm sure we'd love to hear about it.Ini:\n...Um, like... Do I totally, like, really have to?von Karma:\nOf course.Judge:\nMs. Miney... please.Ini:\n... My sister... Like, this is what she said to me.That was... no accident... I was drugged... with sleeping pills... I was murdered... by that person... That's why... I took... my revenge... It's only fair... Isn't it... ...Ini?Judge:\nShe \"took her revenge?\" Are you sure that's what she said?Ini:\nY-Yes...von Karma:\nThere, are you satisfied, Your Honor?Judge:\n...I still can't believe it. I can't believe that a spirit would go so far as to use a medium to get revenge...von Karma:\nIt is a bit hard to swallow, however, all the evidence and testimonies point to this as the truth! ...The end.Judge:\n...What do you think, Mr. Wright? It certainly seems like all the loose ends are accounted for...Phoenix:\n(This... This testimony just now... Was it all made up? Was it just one huge lie...?)Mia:\nOf course it was, Phoenix.Phoenix:\n...Mia! What do you mean?Mia:\nIt's well constructed... but that's all it is. But even the most well-spun lies can be undone. We can do it, Phoenix. Let's find that one loose thread and unwind this tapestry of lies.Phoenix:\nYour Honor! There is room for doubt, so the defense will cross-examine this witness. We believe that our cross-examination will reveal the real truth behind this murder!von Karma:\nYet again the foolish fool spouts out more foolishly foolish drabble... I wonder if you'll make this one more entertaining than the last...Cross Examination",
      "testimonies": [
        {
          "testimony": "Like, when the channeling started, I was, like, sleeping in the Side Room.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "Like, a little later, someone came into the room, like, really suddenly.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "It was, like, oh my gawd, totally my sister!",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "I, like, hadn't seen her in, like, so long... I was so happy in, like, a sad way...",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "I wasn't, like, scared at all. And, like, her costume looked totally, like, normal.",
          "person": "Ini",
          "present": [
            "Maya's Costume",
            "Lotta's Photo 2"
          ],
          "source": {
            "evidence_span": "wearing a blood-splattered robe",
            "testimony_span": "her costume looked totally, like, normal",
            "explanation": "Maya Fey's costume was splattered with blood, so it could not have been normal when seen by the witness.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "easy"
          }
        },
        {
          "testimony": "My sister... She, like, told me something, like, totally terrible.",
          "person": "Ini",
          "present": []
        }
      ],
      "noPresent": false,
      "difficulty": "easy",
      "labels": [
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims the defendant's costume looked normal.",
        "Fact 2: The evidence suggests the defendant's costume was blood-splattered.",
        "Fact 3: If a clothing is blood-splattered, it cannot be considered normal."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- After the Murder --Ini:\nLike, when the channeling started, I was, like, sleeping in the Side Room.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas that because of your, um... sesame allergy, was it?\nIni:\nLike, that's right. I, like, think there were sesame seeds, like, in the lunch they served that day. I had this, like, premonition that it was going to totally be a \"seedy\" day.\nvon Karma:\nYes, indeed.\nJudge:\nHmm... I see...\nPhoenix:\n(...Am I the only one who missed the boat here...?)\nJudge:\nAnyway, so you were taking a nap. Did something happen while you were sleeping?Ini:\nLike, a little later, someone came into the room, like, really suddenly.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nDo you know the time?\nIni:\nUm, uh... Like, maybe a little before 11 AM? Something like that, I think...\nPhoenix:\nE-Eleven AM...?\nIni:\nYeah. Like, my stomach is totally ready for, like, food.\nPhoenix:\n... Ah, no... I think you misunderstood me... I'm not asking what time it is now... I meant what time was it when the \"someone\" came into your room!\nIni:\nOh! So, like, that's what you meant! Like, you shoulda been more, like, clear about it!\nPhoenix:\nS-Sorry. My bad.\nIni:\nNo, it's OK. Like, it's really...\nPhoenix:\n...\nIni:\n...?\nPhoenix:\n...That's it? Why'd you stop mid-sentence!?\nIni:\nDid I? ...So, like... what was I talking about again...?\nPhoenix:\n... N-Never mind...\nvon Karma:\n...Witness. About this person who entered the Side Room...Ini:\nIt was, like, oh my gawd, totally my sister!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAre you absolutely sure?\nIni:\n...I guess?\nPhoenix:\nYou \"guess\"...? Was it or was it not your sister who entered?\nIni:\nLike, I don't know. I mean, like, I totally don't know \"your sister\" at all, Mr. Smith.\nPhoenix:\n(First off, my name is not Mr. Smith. Second, I'm an only child. ...Hmm, but more than that, she's managed to mess up the question with her answer...)\nJudge:\nWell, Mr. Wright?\nPhoenix:\nTh-The defense rests...\nvon Karma:\nWell, that was a colossal waste of our time! Now then, witness. How did you feel when you saw Ms. Mimi Miney?Ini:\nI, like, hadn't seen her in, like, so long... I was so happy in, like, a sad way...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou were... happy in a sad way...?\nIni:\nYeah, like, I mean, it was my sister!\nPhoenix:\nBut wouldn't most people react here with surprise at seeing a dead loved one alive again?\nIni:\nUm, but, like, maybe if I was, like, someone who didn't know about, like, the occult. But I, like, know all about the Kurain Channeling Technique.\nvon Karma:\nThe point here, is the witness immediately recognized that it was her \"sister\".\nIni:\nYeah, like, what she said.\nPhoenix:\n(Hmm... Should I drop this  line of questioning...?)\n\n\n\nQuestion further\n\n\n\n\n\n\n\nPhoenix:\nSo you really didn't think anything \"strange\" of the whole encounter?\nIni:\nNo. Like, there wasn't any reason for me to, like, think anything was \"strange\".\nPhoenix:\nBut... OWW!\nvon Karma:\nDon't keep badgering her.\nPhoenix:\n...You know the phrase, \"Objection!\"? Could you try using that once in a while...?\nJudge:\nHmm... Mr. Wright. This question of what the witness felt when she saw her sister... is it really that important?\n\n\n\nOh, it's nothing.\n\n\n\n\n\n\n\nPhoenix:\n\"Is it really that important?\" Let me ask you: Is it really that important for you to ask?\nJudge:\nOf course it's very important.\nPhoenix:\nWell, I don't think it's that important at all! Yeow!\nvon Karma:\nStop spewing such nonsensical things then. Pay no attention to this twit and continue, witness.\nIni:\nLike, OK.\nLeads back to cross-examination\n\n\n\n\nIt is very important.\n\n\n\n\n\n\n\nPhoenix:\nIt is very important! (Although I haven't quite figured out what \"it\" is yet. But I've got to bluff for now and make it seem like I know what I'm talking about...)\nJudge:\nAlright, Mr. Wright. Ms. Miney, please amend your testimony.\nIni:\nLike, OK. I'm, like, totally cool with that.\nChanges statement from \"I, like, hadn't seen her in, like, so long... I was so happy in, like, a sad way...\" to \"I wasn't, like, scared at all. And, like, her costume looked totally, like, normal.\"\n\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(There's no need to press her over something this minor... I should be trying to find a more decisive problem with her testimony...)\nIni:\nSo, like, is it OK? I'm going to, like, finish my story, OK?\nLeads back to cross-examinationIni:\nI wasn't, like, scared at all. And, like, her costume looked totally, like, normal.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo, there was nothing odd at all about your sister's appearance?\nIni:\nLike, yeah. Nothing was, like, weird.\nPhoenix:\n(...Hmm...)\nMia:\n...\nPhoenix:\n(Hm? ...Mia's talking to herself like she's found something wrong...)\nMia:\n...That's impossible...\nPhoenix:\n(...?)\nIni:\nLike, is everything OK? Can I, like, go on...?Present Maya's Costume or Lotta's Photo 2\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"That was a very well-spun lie, Ms. Ini.\"Ini:\nMy sister... She, like, told me something, like, totally terrible.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSomething \"terrible\"? What was this thing she told you?\nIni:\nHuh? Like, didn't I just, like, tell you about it? Did you, like, forget already?\nvon Karma:\nA foolish fool with a foolish sieve for a brain only speaks foolishly with foolish words.\nPhoenix:\n(Well, excuuuse me, Princess. ...Anyway, should I ask to hear the story again...?)\n\n\n\nDon't bother asking\n\n\n\n\n\n\n\nPhoenix:\n(I did just hear this story. It's not like my memory is that bad...) Actually, the defense is fine and does not need to hear the story again.\nJudge:\nVery well. You may continue your testimony, Ms. Miney.\nLeads back to cross-examination\n\n\n\n\nAsk to hear it again\n\n\n\n\n\n\n\nPhoenix:\nI'm sorry, but could I hear the story one more time?\nIni:\nLike, sure, no problem. I'll even, like, tell it all spooky-like for you.\n\n\nThat was... no accident... I was drugged... with sleeping pills... I was murdered... by that person... That's why... I took... my revenge... It's only fair... Isn't it... ...Ini?\n\n\nIni:\n...Like, how was that?\nJudge:\nIt was a little scary...\nIni:\nLike, I'm sorry. Maybe I, like, put too much spookiness into it...?\nLeads back to cross-examinationPhoenix:\n(I know there has to be something here I can use... But where!?)Mia:\nShe really put a lot of thought into this lie, didn't she? We can't rush this. Let's take it slowly, one step at a time. She's bound to slip up somewhere. Don't give up. But don't get careless, OK? Remember, calm and collected.Phoenix:\nThat was a very well-spun lie, Ms. Ini.Ini:\n...!von Karma:\nWh-What are you babbling about this time, Mr. Phoenix Wright!?Phoenix:\nIt's well constructed... but that's all it is.Mia:\nStealing MY lines now, are we, Phoenix?Phoenix:\nMs. Miney, may I remind you of what you said? You said that there was nothing strange about your sister's appearance.Ini:\nL-Like, yeah... And...?Phoenix:\nBut I don't think that's what you were thinking at all. Take a look at this picture. (Changed from [But I don't really think you thought that at all. Take a look at this picture.] in the original release) This is a picture of the \"sister\" you met. I would think that even you would be surprised if someone like this appeared before you.von Karma:\n... The blood spray...Phoenix:\nMs. Miney! Why did you not include the blood you saw in your testimony!? If you were really testifying, and not lying, you would have noted it right off the bat!Ini:\nUmmm...!Judge:\nOrder! Order! Ms. Miney! What is the meaning of this!?Ini:\n...Judge:\n...Ms. Miney?Ini:\nI'm thinking! Don't interrupt me!Judge:\n...Um, that... Eep!von Karma:\nAnd what are you stammering about, Your Honor...?Judge:\nUm, uh... Well... I... I uhh...Mia:\nThat witness... Her personality did a complete 180 there.Phoenix:\nLots of people do that when they get on the stand, though.Mia:\n...von Karma:\nFirst of all, calm yourself down, witness.Ini:\n... Like, I'm sorry. I, like, didn't mean to snap...von Karma:\nNow, hurry up with the testimony.Judge:\nI-If you please...Phoenix:\n(Ugh... The judge still looks a little shaken up... A lot of help he's going to be...)Witness Testimony-- After the Murder, Pt.2 --Ini:\nLike, the Side Room was, like, kinda dark, you know?\nSo like, the costume is, like, purple, right? The blood totally blended right in.\nAnd I, like, persuaded my sister it wasn't, like, right to do something like that.\nAnd then... like, I took my sister to the Channeling Chamber.Judge:\nHmm... Yes, now I see. And you have given us a clear reason for why you didn't notice the blood.Ini:\nYou think? Like, thanks, gramps!Judge:\nAre you satisfied, Mr. Wright?Phoenix:\n...Judge:\nAlright, I guess not... Very well. You may question the witness.Cross Examination",
      "testimonies": [
        {
          "testimony": "Like, the Side Room was, like, kinda dark, you know?",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "So like, the costume is, like, purple, right? The blood totally blended right in.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "And I, like, persuaded my sister it wasn't, like, right to do something like that.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "And then... like, I took my sister to the Channeling Chamber.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "I, like, didn't see anyone on the way to, like, the Channeling Chamber.",
          "person": "Ini",
          "present": [
            "Sacred Urn",
            "Pearl Fey"
          ],
          "source": {
            "evidence_span": "Under repair in the hallway until police came.",
            "testimony_span": "I, like, didn't see anyone on the way to, like, the Channeling Chamber",
            "explanation": "Pearl Fey was repairing the urn in the hallway, so the witness would have had seen her if she did pass by.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "medium"
          }
        }
      ],
      "noPresent": false,
      "difficulty": "medium",
      "labels": [
        "spatial",
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims nobody was seen on the way to the Channeling Chamber.",
        "Fact 2: The evidence suggests Pearl Fey was repairing the urn in the hallway.",
        "Fact 3: The hallway is on the way to the Channeling Chamber.",
        "Fact 4: If a person is in the hallway, someone passing by would have seen them."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- After the Murder, Pt.2 --Ini:\nLike, the Side Room was, like, kinda dark, you know?Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nReally? Because I thought it was pretty bright inside that room.\nvon Karma:\n\nvon Karma:\nDon't push your subjective opinions onto this court.\nIni:\nLike, that's right!\nPhoenix:\nUm, excuse me, but how is my statement any more subjective than Ms. Miney's?\nvon Karma:\nYou are such a hopeless cause. Witness, you may feel free to ignore this trite little man.\nIni:\nLike, OK.\nPhoenix:\n(Uuugh... Can't breathe... Let me outta here...)Ini:\nSo like, the costume is, like, purple, right? The blood totally blended right in.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou... didn't see the blood...?\nIni:\nLike, yeah.\nPhoenix:\nBut she must have had the gun with her at that time as well.\nIni:\n...! That's um...\nPhoenix:\nAre you going to tell me next that you didn't notice the gun either!?\nIni:\nI, like, totally didn't. All I was looking at was, like, her face...\nJudge:\nHmm...\nvon Karma:\n... Continue.Ini:\nAnd I, like, persuaded my sister it wasn't, like, right to do something like that.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAnd what was your sister, Ms. Mimi Miney, like at the time?\nIni:\nWell, she was, like, totally flipped out 'cause she just shot Dr. Grey... But, I think, like, she knew. She, like, said she did something really bad. And, like, she said she wanted to go with me to, like, apologize to Ms. Morgan.\nPhoenix:\nDid Mimi's spirit really say all that to you...?\nIni:\nLike, yeah...Press (after pressing fourth statement, before adding statement)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAnd what was your sister, Ms. Mimi Miney, like at the time?\nIni:\nWell, she was, like, totally flipped out 'cause she just shot Dr. Grey... But, I think, like, she knew. She, like, said she did something really bad. And, like, she said she wanted to go with me to, like, apologize to Ms. Morgan.\nPhoenix:\nDid Mimi's spirit really say all that to you...?\nIni:\nLike, yeah...\nPhoenix:\nMay I ask you one more thing, Ms. Miney?\nIni:\nLike, sure.\nPhoenix:\nWas there anything you found strange, unusual, or just out of place?\nIni:\nSomething out of place? Huh? Like, when do you mean?\nPhoenix:\nUh, when...? Um... When you...\n\n\n\nwere in the Side Room.\n\n\n\n\n\n\n\nPhoenix:\nI'm talking about when you were in the Side Room, of course!\nIni:\nUm... Like, no, nothing strange.\nPhoenix:\n(Hmm... What should I do...?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nThink harder! I know you can remember something!\nIni:\nI, like, totally can't!\nvon Karma:\nJust give up already, Mr. Phoenix Wright.\nPhoenix:\n(I wonder if I put too much faith in Ini's ability to do anything with that brain...)\nLeads back to cross-examination\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(Even if I push her, this is probably a dead end... I should search for something stronger to hook her with.)\nJudge:\n...Hmm... Well, if the defense is finished, please continue with your testimony.\nIni:\nLike, OK.\nLeads back to cross-examination\n\n\n\n\n\nwere going to the crime scene.\n\n\n\n\n\n\n\nPhoenix:\nI'm talking about when you were going to the Channeling Chamber, of course!\nIni:\nUm... Like, no, nothing strange.\nPhoenix:\n(She answered rather quickly... Now what...?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nThink harder! I know you can remember something!\nIni:\nI, like, totally can't!\nPhoenix:\nThat's not good enough! You have to explain yourself clearly to this court!\nJudge:\nHmm... Do you think, Mr. Wright, that whether or not there was something odd on the way to the Channeling Chamber is all that important?\n\n\n\nIt's very important.\n\n\n\n\n\n\n\nPhoenix:\nI ask because it is VERY important! (...Not that I know where I'm going with this...)\nJudge:\nVery well. Ms. Miney, if you will, please include a statement about this in your testimony.\nIni:\nLike, I don't get why, but, OK.\nAdds statement \"I, like, didn't see anyone on the way to, like, the Channeling Chamber.\"\n\n\n\n\nIt's not that important.\n\n\n\n\n\n\n\nPhoenix:\n...Actually, I really have no idea!\nJudge:\nThen don't say it like you know what you're talking about!\nvon Karma:\nThis has been the most extravagant waste of time that I've ever seen.\nJudge:\nLet's continue on with the testimony.\nLeads back to cross-examination\n\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(Even if I push her, this is probably a dead end... I should search for something stronger to hook her with.)\nJudge:\n...Hmm... Well, if the defense is finished, please continue with your testimony.\nIni:\nLike, OK.\nLeads back to cross-examination\n\n\n\n\n\narrived at the crime scene.\n\n\n\n\n\n\n\nPhoenix:\nI'm talking about when you arrived at the Channeling Chamber, of course!\nIni:\nUm... Like, no, nothing strange.\nPhoenix:\n(Hmm... What should I do...?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nThink harder! I know you can remember something!\nIni:\nI, like, totally can't!\nvon Karma:\nJust give up already, Mr. Phoenix Wright.\nPhoenix:\n(I wonder if I put too much faith in Ini's ability to do anything with that brain...)\nLeads back to cross-examination\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(Even if I push her, this is probably a dead end... I should search for something stronger to hook her with.)\nJudge:\n...Hmm... Well, if the defense is finished, please continue with your testimony.\nIni:\nLike, OK.\nLeads back to cross-examinationIni:\nAnd then... like, I took my sister to the Channeling Chamber.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas your sister calm by that time?\nIni:\nLike, I guess so... I guess maybe, like, taking her revenge on Dr. Grey, like, made her feel a lot better...\nvon Karma:\nI'd like to feel a lot better too... Mr. Phoenix Wright. The sooner the better...\nPhoenix:\n(She says with her whip at the ready...)\nIni:\nAnd, like, Ms. Morgan was the only one in the Channeling Chamber, you know?Press (after pressing third statement, before adding statement)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas your sister calm by that time?\nIni:\nLike, I guess so... I guess maybe, like, taking her revenge on Dr. Grey, like, made her feel a lot better...\nvon Karma:\nI'd like to feel a lot better too... Mr. Phoenix Wright. The sooner the better...\nPhoenix:\n(She says with her whip at the ready...)\nIni:\nAnd, like, Ms. Morgan was the only one in the Channeling Chamber, you know?\nPhoenix:\nMay I ask you one more thing, Ms. Miney?\nIni:\nLike, sure.\nPhoenix:\nWas there anything you found strange, unusual, or just out of place?\nIni:\nSomething out of place? Huh? Like, when do you mean?\nPhoenix:\nUh, when...? Um... When you...\n\n\n\nwere in the Side Room.\n\n\n\n\n\n\n\nPhoenix:\nI'm talking about when you were in the Side Room, of course!\nIni:\nUm... Like, no, nothing strange.\nPhoenix:\n(Hmm... What should I do...?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nThink harder! I know you can remember something!\nIni:\nI, like, totally can't!\nvon Karma:\nJust give up already, Mr. Phoenix Wright.\nPhoenix:\n(I wonder if I put too much faith in Ini's ability to do anything with that brain...)\nLeads back to cross-examination\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(Even if I push her, this is probably a dead end... I should search for something stronger to hook her with.)\nJudge:\n...Hmm... Well, if the defense is finished, please continue with your testimony.\nIni:\nLike, OK.\nLeads back to cross-examination\n\n\n\n\n\nwere going to the crime scene.\n\n\n\n\n\n\n\nPhoenix:\nI'm talking about when you were going to the Channeling Chamber, of course!\nIni:\nUm... Like, no, nothing strange.\nPhoenix:\n(She answered rather quickly... Now what...?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nThink harder! I know you can remember something!\nIni:\nI, like, totally can't!\nPhoenix:\nThat's not good enough! You have to explain yourself clearly to this court!\nJudge:\nHmm... Do you think, Mr. Wright, that whether or not there was something odd on the way to the Channeling Chamber is all that important?\n\n\n\nIt's very important.\n\n\n\n\n\n\n\nPhoenix:\nI ask because it is VERY important! (...Not that I know where I'm going with this...)\nJudge:\nVery well. Ms. Miney, if you will, please include a statement about this in your testimony.\nIni:\nLike, I don't get why, but, OK.\nAdds statement \"I, like, didn't see anyone on the way to, like, the Channeling Chamber.\"\n\n\n\n\nIt's not that important.\n\n\n\n\n\n\n\nPhoenix:\n...Actually, I really have no idea!\nJudge:\nThen don't say it like you know what you're talking about!\nvon Karma:\nThis has been the most extravagant waste of time that I've ever seen.\nJudge:\nLet's continue on with the testimony.\nLeads back to cross-examination\n\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(Even if I push her, this is probably a dead end... I should search for something stronger to hook her with.)\nJudge:\n...Hmm... Well, if the defense is finished, please continue with your testimony.\nIni:\nLike, OK.\nLeads back to cross-examination\n\n\n\n\n\narrived at the crime scene.\n\n\n\n\n\n\n\nPhoenix:\nI'm talking about when you arrived at the Channeling Chamber, of course!\nIni:\nUm... Like, no, nothing strange.\nPhoenix:\n(Hmm... What should I do...?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nThink harder! I know you can remember something!\nIni:\nI, like, totally can't!\nvon Karma:\nJust give up already, Mr. Phoenix Wright.\nPhoenix:\n(I wonder if I put too much faith in Ini's ability to do anything with that brain...)\nLeads back to cross-examination\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(Even if I push her, this is probably a dead end... I should search for something stronger to hook her with.)\nJudge:\n...Hmm... Well, if the defense is finished, please continue with your testimony.\nIni:\nLike, OK.\nLeads back to cross-examinationIni:\nI, like, didn't see anyone on the way to, like, the Channeling Chamber.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nTry to remember that time!\nIni:\n... Oh! Like, I remember! I remember, like, I totally didn't see anyone on the way.\nPhoenix:\n(Hmm... I guess this really is a dead end...)\nMia:\nSomething you finally pull out of a witness is never a dead end, Phoenix.Present Sacred Urn\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nI've finally found the fault, or I guess in your case, the \"crack\" in your perfect lie.\nIni:\n...\nPhoenix:\nTake a look at this urn.\nIni:\nLike, urn...?\nPhoenix:\nThere are cracks. Do you see them?\nIni:\nS-So? Like, what does that prove?\nvon Karma:\n\nvon Karma:\nWho cares about some worn-out old urn!?\nIni:\nLike, yeah. I already, like, said I didn't see, like, anyone on the way to the Channeling Chamber. I didn't, like, totally say anything about, like, an urn, did I?\nPhoenix:\nIt looks like you still don't understand. I propose that if you had really been walking along the Winding Way at that time, there was no way you could not have seen this person!\n\n\n\nPresent Pearl Fey profile\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"I'd like to introduce someone to you.\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nOops, silly me. Slip of the finger.\nJudge:\nM-Mr. Wright. You need to keep control of that finger of yours.\nPhoenix:\n...As I thought, this is the wrong piece of evidence. Oww!\nvon Karma:\nAn irresponsible lawyer has no place in this court! I suggest you go home!\nPhoenix:\n(Oww... So it's come down to a blunt \"go home\"...)\nMia:\nDon't over-think this. All you need to do is remember what happened yesterday.\nLeads back to:\n\"I propose that if you had really been walking along the Winding Way at that time,\"\n\n\nPhoenix:\nI'd like to introduce someone to you. This is Ms. Morgan Fey's daughter, Pearl Fey.\nJudge:\nY-Yes...? And how is this child relevant...?\nPhoenix:\nIt just so happens that at the time of the murder, Pearl was playing in the center garden.\nJudge:\nOh...\nPhoenix:\nAnd she just happened to break this urn.\nJudge:\nOh... OHHH!\nvon Karma:\nW-Wait! She... broke the urn...?\nPhoenix:\nYup. She accidentally knocked it over with her ball!\nIni:\nNnaaawrr!\nLeads to:\n\"And Pearl was the one who put it back together...\"Present Pearl Fey profile\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou say that you didn't see anyone on the way to the Channeling Chamber... However, that is impossible!\nIni:\n...Like, what you do mean?...\nPhoenix:\nI'd like to introduce someone to you. This is Ms. Morgan Fey's daughter, Pearl Fey.\nvon Karma:\nInteresting, you have a semi-intelligent look on your face. So? What about this child?\nPhoenix:\nIt just so happens that at the time of the murder, Pearl was playing in the center garden.\nvon Karma:\nThe garden...?\nPhoenix:\nYup! Which means anyone walking through the area would have to have seen her! So, Ms. Miney, what do you have to say to that!?\nIni:\nNnaaawrr!\nvon Karma:\n\nvon Karma:\nAs the court can see... she's a bit of an airhead. Also, she was leading her \"sister\" at that time. Do you honestly think she would have noticed a simple child playing!? Preposteous!\nPhoenix:\n\nPhoenix:\nIt's not preposterous, and I can prove it!\nvon Karma:\nWh-What sort of foolish...\nPhoenix:\nThere is no way someone walking along the Winding Way could not have noticed Pearl!\n\n\n\nPresent Sacred Urn\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"This urn is my proof.\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nOops, silly me. Slip of the finger.\nJudge:\nM-Mr. Wright. You need to keep control of that finger of yours.\nPhoenix:\n...As I thought, this is the wrong piece of evidence. Oww!\nvon Karma:\nAn irresponsible lawyer has no place in this court! I suggest you go home!\nPhoenix:\n(Oww... So it's come down to a blunt \"go home\"...)\nMia:\nDon't over-think this. All you need to do is remember what happened yesterday.\nLeads back to:\n\"There is no way someone walking along the Winding Way could not have noticed Pearl!\"\n\n\nPhoenix:\nThis urn is my proof.\nvon Karma:\nAn old, cracked clay pot? What is that going to prove?\nPhoenix:\nDo you know why it's cracked? It's because Pearl broke it! That's why!\nJudge:\nShe broke the urn...? Yeow!\nvon Karma:\nWhy... Why do I feel like you're about to ruin my beautiful day...?\nPhoenix:\nThis urn was broken around the time the channeling started!\nIni:\nAh!\nLeads to:\n\"And Pearl was the one who put it back together...\"Phoenix:\n(No good. I can't find anything wrong...)Mia:\nPhoenix, the Judge believes this testimony. If you don't find some sort of hitch in her statement...Phoenix:\nHe'll end the trial... I know...Mia:\nWe have to give it another shot! It doesn't matter how many times we listen. We can't give up!Phoenix:\nAnd Pearl was the one who put it back together... ...while sitting right in the middle of the Winding Way!Ini:\nWH-WHAAAAAAAAAAAAAT!?Phoenix:\nMs. Miney.Ini:\n...!Phoenix:\nPearl was there, in the Winding Way at that time. She was hard at work, putting the pieces of the urn back together, you see. If you couldn't see that while you were walking, I'd have to declare you legally blind!Ini:\nG...Grrrrr...Phoenix:\nI think I have sufficiently proven one thing, Ms. Miney. You are a masterful liar!Ini:\nArghnnn!Judge:\nMr. Wright! You need to watch what you say!Phoenix:\nThe one who needs to watch what she's saying is the witness! So, Ms. Miney! Tell us the truth!Ini:\nA-About what!?Phoenix:\nAbout what!? About where you really were at the time of the murder, of course!von Karma:von Karma:\nThe witness just testified about that!Ini:\nTh-That's right! I was, like, sleeping in the Side Room...Phoenix:\n(...Can I really believe her? Was she really sleeping in the Side Room...!?)Yeah, I guess so.\n\n\n\n\n\n\n\nPhoenix:\nYeah, I guess so. Sorry, my mistake.\nJudge:\nVery well. Now, then, let's proceed.\nMia:\nWait! Phoenix!\nPhoenix:\nWh-What? Did I miss something again?\nMia:\nYou shouldn't let up on this line of questioning.\nPhoenix:\nHuh? Why not?\nMia:\nWho is the only person you didn't see with your own eyes at the time of the murder?\nPhoenix:\nIt was Ini Miney, correct?\nMia:\nWhich means, you can safely assume... She is the real murderer.\nPhoenix:\nThat's a pretty daring assumption...\nMia:\nBut it's the most obvious, isn't it? I mean, is there anyone else?\nPhoenix:\nWell, no, I guess not.\nMia:\nIt's worth a shot, even if it's in the dark. So, let's try to prove that Ms. Miney was not in the Side Room at the time!\nPhoenix:\n(Umm, this is bluff number...? We've done this so many times in this case I've lost count.)\nLeads to:\n\"Your lies end here!\"There is no way!\n\n\n\n\n\n\n\nLeads to:\n\"Your lies end here!\"Phoenix:\nYour lies end here!Ini:\nWh-What do you!?Phoenix:\nThe witness says that during the actual murder, she was asleep in the Side Room. And I say that's not possible, because there is clearly a contradiction here!Judge:\nA contradiction...!? Where is this contradiction!?It's in her testimony just now.\n\n\n\n\n\n\n\nLeads to:\n\"Earlier in your testimony, Ms. Miney, you made the following statement.\"It's in the evidence.\n\n\n\n\n\n\n\nPhoenix:\nThe answer is in the Court Record!\nJudge:\nWh-What!?\nvon Karma:\nHmph. Planning to throw out another irrelevant piece of evidence?\nJudge:\nVery well. The court will see this evidence...\nMia:\nWait!\nPhoenix:\nM-Mia!\nMia:\nI don't know what you plan on showing to the court, but I can guarantee you the answer is not there. Just this once, I'll lend you a hand. Now, rethink your answer.\nPhoenix:\nA-Alright...\nJudge:\nMr. Wright. What is your answer?\nPhoenix:\n(Argh! OK, time to add another bluff to the pile...)\nLeads back to:\n\"The witness says that during the actual murder, she was asleep in the Side Room.\"Help me, Mia!\n\n\n\n\n\n\n\nPhoenix:\n(Hmm, I may have overreached on this one... Is there really a contradiction somewhere...?)\nMia:\nDon't worry, you're on the right path, Phoenix. It might be a little hard for you to see the contradiction, but it's there. So, just this once, do you want me to help you out?\n\n\n\nYes, please help me!\n\n\n\n\n\n\n\nPhoenix:\nPlease, I need your help right now!\nMia:\nH-Hold on... First, calm down, Phoenix. ...Good. ...That girl... She slipped up with her words.\nPhoenix:\n...Her words?\nMia:\nIf she really was in the Side Room the entire time, then she just testified about something she shouldn't have any knowledge of.\nPhoenix:\nA-And what is that!?\nMia:\nThe rest is for you to figure out on your own.\nJudge:\nMr. Wright. What is your answer?\nPhoenix:\n(Argh! OK, time to add another bluff to the pile...)\nLeads back to:\n\"The witness says that during the actual murder, she was asleep in the Side Room.\"\n\n\n\n\nNo, I think I can do it.\n\n\n\n\n\n\n\nPhoenix:\n(Hmm, it's \"hard for me to see\"...? I can't just accept her help without thinking it through myself!)\nMia:\nHa ha, that's the spirit. Give it another try.\nJudge:\nMr. Wright. What is your answer?\nPhoenix:\n(Argh! OK, time to add another bluff to the pile...)\nLeads back to:\n\"The witness says that during the actual murder, she was asleep in the Side Room.\"Phoenix:\nEarlier in your testimony, Ms. Miney, you made the following statement.Ini:\nAnd, like, Ms. Morgan was the only one in the Channeling Chamber, you know?Phoenix:\nIt's true that at the time, both myself and Ms. Hart were not there. We had gone to call the police.Ini:\n...S-So? Like, what does that, like, have to do with anything!?Phoenix:\nIt's very simple. Ms. Miney, how did you know that fact?Ini:\n...H-How...?Phoenix:\nI concede that Ms. Fey was the only person in the Channeling Chamber. However, someone who was \"asleep\" in the Side Room could not have known that!Ini:\n...!Phoenix:\nWhich means, Ms. Miney! You did, in fact, go to the Channeling Chamber. But you didn't go there by way of the Winding Way! (Changed from [However, you didn't go there by way of the Winding Way!] in the original release)Ini:\nGwaaaaaaaaaaaa!Judge:\nB-But! Look at the manor guidemap! If one were to go between the Side Room and the Channeling Chamber, one would have to use the Winding Way!Phoenix:\nYes, that's right, Your Honor. Which is why... Which is why I ask this very important question! Where was the witness at the time of the murder!?Ini:\n...Umm... Urrrr...Phoenix:\nMs. Miney! Please answer the question!von Karma:von Karma:\n... Don't ask a question off of a baseless assumption, if you please...Phoenix:\n...!von Karma:\nWell, I suppose since you've put it out on the table, Mr. Phoenix Wright... you might as well answer the question for us! Where was the witness at the time of the murder!?Mia:\nNow's your chance, Phoenix.Phoenix:\nYeah!Mia:\nThe only person who could have killed Dr. Grey was Ini Miney! So now is the time to prove it!Judge:\nNow, then, Mr. Wright. Let's hear your answer. Where was the witness when the murder took place?Present Channeling Chamber\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Ms. Miney was here, of course!\"Present anywhere else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nShe was here...\nMia:\nPhoenix! Did you turn the map upside down!?\nPhoenix:\n(...Oww... Sh-She slapped me on the wrist...)\nMia:\nThere is no way she could've committed the crime from there!\nJudge:\n*ahem* You two! Keep disrupting this court, and this trial is over. Is that clear!?\nPhoenix:\nY-Yes, Your Honor... Sorry...\nLeads back to:\n\"Now, then, Mr. Wright. Let's hear your answer.\"Phoenix:\nMs. Miney was here, of course!Judge:\nWha... But... But that's... the Channeling Chamber...von Karma:\nIsn't that the crime scene!?Phoenix:\nThat's right! Ms. Miney was at the scene of the crime!Judge:\nOrder! Order! Order! ...That's... Why, that is... Uwaah!von Karma:\nMr. Phoenix Wright! Have you lost your mind!? Yesterday's testimony established that only the victim and the defendant were in the Chamber when the channeling started!Judge:\nYes! Yes, that is correct! Please, explain yourself, Mr. Wright!Phoenix:\nSimple. Ms. Ini Miney was hiding at the scene of the crime.Ini:\nI... I was hiding!? Where!? Like, where was I hiding!?Present area behind folding screen\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Here, of course.\"Present anywhere else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nMs. Miney was hiding here! Owww!\nvon Karma:\nIf you're going to tell a joke, at least make it one I'll laugh at.\nIni:\nHah! Go home, boy, and look up what \"hiding\" means!\nPhoenix:\n(Argh... Looks like I'm going to have to one up her!) Yeah, count on it!\nMia:\nPhoenix, you can't lose your cool like this! ...And, grow up.\nPhoenix:\nEh?... Oh, um, sorry, Chief...\nvon Karma:\nYou still haven't learned your lesson, have you, Mr. Phoenix Wright!?\nLeads back to:\n\"Where!? Like, where was I hiding!?\"Phoenix:\nHere, of course.Judge:\nB-Behind the folding screen? Aah!von Karma:\nDon't make me say this again! Recall yesterday's testimony!Lotta:\nThere ain't no way anyone was hangin' out behind that foldin' screen!Ini:\nSee! You stupid jerk! Quit being so quick to pin it on me, slimeball!Judge:\n...N-Now, now... Ms. Miney... One so young as you shouldn't be saying...Ini:\nShut it, gramps. As if you know exactly how old I am!Judge:\nI-I'm sorry!Phoenix:\n(Looks like the pipe's about to burst... Guess I should help it along...) The witness was hiding behind the folding screen... With the help of this!Present Clothing Box\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Ms. Miney!\"Present anything else\n\n\n\n\n\n\n\nPhoenix:\n\nIni:\nYeah, you go ahead and use that to hide!\nvon Karma:\nAnd you should hide in shame until you die!\nPhoenix:\n(What's with these two...? It's like they did a mind meld all of a sudden...)\nMia:\nDon't let them affect you! Just think about the correct answer.\nIni:\nWhat's wrong, boy!? Come on, say something, you loser!\nLeads back to:\n\"...N-Now, now... Ms. Miney... One so young as you shouldn't be saying...\"Phoenix:\nMs. Miney! How you were able to hide at the scene of the crime is very simple! You were hiding inside this box!Ini:\nAaah! Th-Th-That tiny little box!? No person could fit in that!Phoenix:\nSorry, but your theory has already been disproved. (Lotta disproved you when she was hiding from me in it.)Ini:\nUmm...!von Karma:von Karma:\nBut that clothing box was in the Side Room, right!? Which means it has nothing to do with the murder at all!Ini:\nTh-That's right! I was sleeping there, so I should know! That clothing box was there in the Side Room, the whole time!Judge:\nHmm... Mr. Wright. Do you think you can prove where the clothing box was at the time of the crime?No, I can't.\n\n\n\n\n\n\n\nPhoenix:\nHmm... It's kind of hard to prove...\nMia:\n...\nPhoenix:\nUm... I guess by that look, there is a way to prove it?\nMia:\nIf you look in the Court Record.\nPhoenix:\n(Guess I should take a look at the Court Record...)\nJudge:\nWell, then. If there are...\nPhoenix:\n\nPhoenix:\nP-Please wait... I said it was hard, but I didn't say it was impossible to prove!\nJudge:\nThen stop puffing up your feathers and hurry up!\nLeads to:\n\"And now, I present the piece of evidence that will prove\"Yes, I can with some evidence.\n\n\n\n\n\n\n\nLeads to:\n\"And now, I present the piece of evidence that will prove\"Phoenix:\nAnd now, I present the piece of evidence that will prove this clothing box was at the scene of the crime when the murder took place!Present Folding Screen or Clothing Box\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Take a look at this clothing box.\"Present anything else\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\n..............................\nPhoenix:\n...Um... Your Honor...?\nJudge:\nI... um, fell asleep...\nMia:\nYou got lucky, Phoenix! Now give it another shot!\nPhoenix:\nA-Alright...\nLeads back to:\n\"And now, I present the piece of evidence that will prove\"Phoenix:\nTake a look at this clothing box.Ini:\nYou're soooo stupid. As if there's any sort of evidence in that old thing.Judge:\n...! Th-This... What on earth...!? Mfph!von Karma:\nI don't have time for you to sit there surprised. Hurry up and say it already!Judge:\nTh-There's a hole! About 8 inches off the ground!Phoenix:\nHmm, a hole about 8 inches off the ground. Where have we heard that before...?von Karma:\n...The folding screen... It had a hole at the same height...Phoenix:\nThat's right! I hope this has opened your eyes to what happened! At the time of the shooting, the clothing box was sitting behind the folding screen. Which is why the bullet from the pistol hit both the box and the folding screen! It went through the screen, and then into the box.Ini:\n...Nnngh...!Phoenix:\nMs. Miney! You were hiding behind the folding screen, waiting for your chance! Yes, for your chance to kill Dr. Grey!Ini:\nAaaaaaaaaaaaah!Judge:\nOrder! Order! ...So what you are saying--von Karma:von Karma:\nTh-Then... Mr. Phoenix Wright! What about this picture!? Are you saying that the person in this photo... is Ms. Ini Miney!?Phoenix:\nThat is exactly what I am saying! Ms. Ini Miney! You were hiding inside this clothing box all along! And you wore a medium's costume to masquerade as Maya Fey!Judge:\nT-To masquerade as Maya Fey!?Phoenix:\nShe had it planned from the very beginning! She would kill Dr. Grey, and pin the blame on my client!Ini:\n...N...No... S-Stop...von Karma:\n...I can't stand to listen to any more of this foolishness! If that's the case, Mr. Phoenix Wright, then I have a proposition! This whole idea that the witness moved the clothing box to the crime scene, pretended to be the defendant, killed the victim, and then fled the scene of the crime; It's not possible for one person to do all that by herself!Correct. It's not possible.\n\n\n\n\n\n\n\nLeads to:\n\"It really is impossible.\"No, it is possible.\n\n\n\n\n\n\n\nPhoenix:\nI'm sure it's possible if you were to try! Ow!\nvon Karma:\nI don't want to hear \"if\"! If you're going to give me \"if\", then give me some proof along with it. Where did Ini Miney get the costume then!? How about the wig!?\nPhoenix:\nUh, I wasn't talking about that exact point... I meant, people, humans. If we want to do something bad enough, then...\nJudge:\nThat's enough! Beyond simply proposing that it is possible for one person to commit this crime, it is the duty of a lawyer to back up his or her claims.\nIni:\nYeah, it's your duty!\nJudge:\nIf you can't do that, then your proposal falls flat.\nIni:\nYeah, it totally falls flat!\nPhoenix:\n(...Why... Why do you have to hurt me so...?)\nMia:\nIt's alright, Phoenix.\nPhoenix:\nHuh?\nMia:\nIt isn't possible for one person to commit this crime, but...\nPhoenix:\n(... Ack! That's... That's right!)\nLeads to:\n\"It really is impossible.\"Phoenix:\nIt really is impossible. For one person to do all the preparations, that is. Owww!von Karma:\nNeed I remind you!? The foolish receive no mercy...Phoenix:\nW-Wait! Ms. von Karma... You said it was not possible for \"one person\", correct?von Karma:\nWh--! Y-You can't be serious...Ini:\n...*huff*...*huff*...Phoenix:\nMs. Miney! You had an accomplice!Present Morgan Fey profile\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"...Grr... This person...!\"Present anything else\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\nThe accomplice was...?? Any thoughts, Ms. von Karma?\nvon Karma:\n... I don't even want to waste the energy to raise my whip. His lady friend can deal with him.\nMia:\nReally, Phoenix! You even got Ms. von Karma to give up on you too!\nPhoenix:\n...\"Too\"?\nMia:\nAs in, \"me too\".\nPhoenix:\nO-Oh... Okay, I'll think more carefully this time...\nLeads back to:\n\"Ms. Miney!\"Ini:\n...Grr... This person...!Phoenix:\nIf it wasn't someone from Kurain Village, you couldn't have gotten the costume. And if it wasn't someone from the Fey household, you wouldn't have that box to use.von Karma:\nMorgan... Fey!Judge:\nIsn't that the wonderful lady witness we had earlier!?Phoenix:\nWhat do you have to say to this, Ms. Miney!?Ini:\n...Grrr... Grrrrrrrrrrr...Phoenix:\nYou shot Dr. Grey with your own two hands! Do you deny it!?Ini:\nAaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaah!Phoenix:\nI think this is what really happened. The murderer had planted herself at the scene of the crime long beforehand. Dressed in a medium's costume and wearing a wig, she pretended to be the defendant. And then, the channeling started. The murderer crept silently towards the other two, both of whom had their eyes closed. ...First, she drugged Maya Fey with a strong sleeping agent. Then, she stabbed Dr. Grey with the knife! Next, she hid my client inside the clothing box... She did that so she could take Maya's place and frame her for the crime.Mia:\n...But that's when something unexpected happened.Judge:\nUnexpected...?Phoenix:\nYes.*bang!*Phoenix:\nDr. Grey was actually not yet dead! With the last of his strength, he fired a shot at his attacker! And that is why the hole in the folding screen was so low to the ground! The murderer then took the gun from Dr. Grey, and...*bang!*Judge:\nAfter that, you and the other lady thought to break into the room...?Phoenix:\nYes, a gunshot is certainly something you wouldn't expect to hear. Which is why, upon hearing the shots, we forced our way into the Channeling Chamber.*klik*Phoenix:\nMs. Miney... She immediately covered her own costume with blood...*klik*Phoenix:\nAnd pretended to be Maya Fey.von Karma:\nB-But! That sort of deception would have been easy to see through!Phoenix:\nWhich is precisely why Ms. Morgan Fey chased us out.Morgan:\nPlease leave this area to me. Go quickly and inform the police! Hurry! Before there are more victims here!Judge:\nWh-What is one supposed to say...?Phoenix:\nThis is the real truth behind this murder....Ha... ...Ahahahaha...Judge:\nWh-Who is that!? Laughing at a time like this...!? Ack!von Karma:\nOh, you simpleminded fools. I'm sorry, are you still by chance, evolving?Phoenix:\nWh-What is it this time...?Judge:\nM-Ms. von Karma... Surely...von Karma:\nOf course it was me! Do you really think someone of Von Karma blood would lose due to something this petty?Phoenix:\nWHAT IN THE WORLD!?von Karma:\nMr. Phoenix Wright! Your argument is flawed in one very crucial area!Phoenix:\nAnd that is...?von Karma:\nIf this witness is the real murderer... why would she go through all this trouble?Phoenix:\n...Huh?von Karma:\nWorking together with a medium, pretending to be one, putting on this whole act... What reason would she have to do such foolish things?Phoenix:\nEh? Well, that's... Uh...Ini:\nYeah, that's right! That's exactly what I was gonna say!von Karma:\nOh, and one other thing. Why would Ms. Ini Miney want to kill Dr. Grey? Where is her motive?Ini:\nYeah! That's exactly what I wanted to say too! Yeah! Motive! I don't have a motive!Phoenix:\nA... motive... That's... (I can't say she has no motive here! I have to think of a motive now! What is her reason for wanting Dr. Grey dead...?) The reason you wanted Dr. Grey dead is this!Present Newspaper Clipping 2 or Mimi Miney profile\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"...Hah!\"Present anything else\n\n\n\n\n\n\n\nPhoenix:\n\nIni:\nHo-hum, ho-hum... Is this a word search? I'm having a tough time finding the word \"motive!\"\nJudge:\nUuugh... My breathing is becoming labored...\nMia:\nMy eyesight is failing me...\nvon Karma:\nMakes you not want to get old, doesn't it, Mr. Phoenix Wright?\nPhoenix:\n(...Ack! I've got to take my time and think carefully about this...)\nMia:\nPhoenix, think back! What kind of ax would Ini have to grind with Dr. Grey? ... There is only one reason, right?\nPhoenix:\n(...Only one...?)\nLeads back to:\n\"A... motive... That's... (I can't say she has no motive here!)\"Ini:\n...Hah! Just as I thought. You bore me with your silly answers, Phoenix Wright!Phoenix:\n(Just great. Now even SHE is calling me by my full name...)Ini:\nYou think I did this to get revenge for my sister's death?Phoenix:\nYes! Because through that accident, you suffered a lot of hurt and pain yourself!Ini:\nDon't be stupid! No one has proof that Dr. Grey drugged my sister, right? And you want to say I wanted to take revenge based on nothing?Judge:\nWh-What do you mean by that...?Ini:\nSenile, stupid gramps. ... I'm, like, going to explain, so, like, please listen, OK? It's been over half a year since I was discharged from the hospital. If I, like, wanted revenge, then, like, I wouldn't have waited this long. Um, and 'sides, like, the guy that thought of the spirit thing, was, like, Dr. Grey. It was, like, a total coincidence he asked me about it, you know?Phoenix:\n(She... She's back to her airhead persona...!) (Changed from [She... She's back to her airhead self...!] in the original release) H-However, you see-- Eeeowch!von Karma:\nPathetic, Mr. Phoenix Wright. You failed to support your own theory. ...The end.Judge:\nI think we have our answer, Mr. Phoenix Wright. What Ms. Miney has stated is very true. The revenge plan is overly complicated, and she has no motive in the first place. Furthermore, there is no reason for Ms. Morgan Fey to cooperate with this plan. You don't even have any truly decisive pieces of evidence to demonstrate your point.von Karma:\nTsk, tsk. So many faults, Mr. Phoenix Wright. You should really learn your place.Phoenix:\nNnghuuurk! (Wh-What happened!? I thought I had her for sure!...)Ini:\nHee hee... See, like, that's what I, like, told you!Phoenix:\n...?Ini:\nI hope you liked your slice of humble pie! (Changed from [I'm going to serve you a slice of humble pie!] in the original release)Judge:\nVery well, I now conclude the cross-examination of Ms. Ini Miney!???:Mia:\nYour Honor. Please, allow the defense one more minute.Judge:\nAlright.Mia:\nYou can't lose here. Have faith in yourself, Phoenix!Phoenix:\nMia...Mia:\nYes, it does sound like a ridiculously messed up plan for a murder, but you know, regardless, that girl trained for this crime.Phoenix:\n...R-Really?Mia:\n... Listen, Phoenix. Everything happens for a reason. There is a reason for why she had to kill Dr. Grey. And it is also the reason she had no choice but to kill him in this fashion.Judge:\nTime is up, Mr. Wright. Your final answer, please. If you want to say that you can prove Ms. Miney had a motive, then... why did she kill the victim in this way? Can you provide the reason?Phoenix:\n(...Can I... Can I really do this...?)Yes, I can.\n\n\n\n\n\n\n\nLeads to:\n\"I am not totally confident here, but I know that I must press on no matter what...\"No, I can't.\n\n\n\n\n\n\n\nLeads to:\n\"I am not totally confident here, but I know that I must press on no matter what...\"Phoenix:\n(I am not totally confident here, but I know that I must press on no matter what...)Mia:\nThat's right, Phoenix! Only you can do this now!Phoenix:\nI will show and substantiate the fact that Ms. Miney had a motive!Ini:\nHa ha ha. Too bad. You're too late! My cross-examination has already ended, after all. Eeek!von Karma:\n...Interesting. I'll let you have your chance, Mr. Phoenix Wright.Ini:\nWh-What!? Y-You're supposed to be on my side! Aiiiii!von Karma:\nA Von Karma only cares about the perfect win. As long as you have the will to fight, I will knock you down, Mr. Phoenix Wright!Phoenix:\n...von Karma:\nAnd I don't care if you are my witness! So help me, I will throw you out of my way! (Changed from [And I don't care if you are my witness! So help me, I will blow you out of my way!] in the original release)Ini:\nN-No way...Judge:\nVery well. The court will take a 5 minute recess. We will continue the cross-examination after we reconvene.Ini:\nH-Hey! W-Wait a sec, here!To be continued.June 22, 12:04 PMDistrict CourtDefendant Lobby No. 3Maya:\n...Is it really true... about my aunt...?Phoenix:\nI'm afraid so, Maya. There is no way Ini could've killed Dr. Grey by herself. And under the circumstances, there's no one else other than your aunt, Morgan.Maya:\nThat... That's terrible... Why? Why would my aunt...?Everything is going just as I predicted, Mr. Phoenix Wright.Phoenix:\nAck! Ms. von Karma!Maya:\nWhy are you doing this!? Why are you trying to take revenge on Nick!? Nick had nothing to do with what happened to your dad.von Karma:\nDon't you have something better to be worrying about? Say, your own situation?Maya:\nUgnn... ...Looking down on me, even though we're the same age...Phoenix:\nAre you done yet? You've caused me enough pain and suffering.von Karma:\nNot yet. My goal is to defeat you, and let the whole world know of your defeat.Phoenix:\n...But even if you do that, it won't bring your father back...von Karma:\n... Hmph. ...Whatever. In the meantime, let's bring this match to its conclusion. And then we'll know who the real winner is.June 22, 12:10 PMDistrict CourtCourtroom No. 2Judge:\nCourt will now reconvene. Mr. Wright.Phoenix:\nYes, Your Honor?Judge:\nCan you prove Ms. Ini Miney had a motive?Phoenix:\nYes, I believe I can. (Ini Miney and Dr. Grey have only one point of connection. And that is the car accident one year ago. The motive I'm looking for must be there...) Ms. Miney. Please testify to this court about your car accident last year.Ini:\nHuh? I thought, like, you wanted to, like, ask about my, like, motive. I, like, don't see the point in, like, bringing up the past.Judge:\nMs. Miney, if you please.Ini:\n...OK, OK. Like, I totally don't think it'll do any good, but...Witness Testimony-- Last Year's Accident --Ini:\nThat was... like, last year, in May.\nLike, something really bad had happened at, like, my sister's clinic around then...\nAnd like, the night of the accident, my sis was totally tired while she was driving.\nI was, like, totally pooped too, so I, like, fell asleep in the passenger's seat...\nI, like, woke up 'cause of a jolt, and, like, it was a sea of flames around me.\nI, like, opened the door and, like, got away.Judge:\nHmm... I think I've heard of this incident.Phoenix:\nIt was all the talk on the tabloid shows, day after day, last year.Judge:\nYes, and there was talk about Dr. Grey... drugging your sister...? Gwuugh!von Karma:\nThose were merely \"rumors\". ...Totally baseless gossip.Judge:\nHmm, yes... Mr. Wright, you may question the witness.Mia:\nRight now, it's impossible to prove that Dr. Grey did in fact drug Ms. Miney's sister.Phoenix:\nYeah... Which means I'll have to work this from another angle.Cross Examination",
      "testimonies": [
        {
          "testimony": "That was... like, last year, in May.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "Like, something really bad had happened at, like, my sister's clinic around then...",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "And like, the night of the accident, my sis was totally tired while she was driving.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "I was, like, totally pooped too, so I, like, fell asleep in the passenger's seat...",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "I, like, woke up 'cause of a jolt, and, like, it was a sea of flames around me.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "I, like, opened the door and, like, got away.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "I, like, didn't have my license, so, like, I couldn't take over driving for her.",
          "person": "Ini",
          "present": [
            "License Photo"
          ],
          "source": {
            "evidence_span": "Ini's photo for her driver's license",
            "testimony_span": "I, like, didn't have my license",
            "explanation": "Ini's photo for her driver's license suggests that she did have a license, contrary to what she clams.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "easy"
          }
        }
      ],
      "noPresent": false,
      "difficulty": "easy",
      "labels": [
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims she didn't have a driver's license",
        "Fact 2: The evidence suggests that she did have a driver's license"
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- Last Year's Accident --Ini:\nThat was... like, last year, in May.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nDidn't some sort of medical malpractice happen at your sister's hospital then...?\nIni:\nYeah, like, that was in May too. Like, the thing with all the patients dying was, like, May 2nd, and like, our accident was, like, on the 24th.\nPhoenix:\nTwo accidents back to back... Do you assume it's just a coincidence?\nIni:\nMy sis was, like, totally tired, so that's why, duh.Ini:\nLike, something really bad had happened at, like, my sister's clinic around then...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThat was the malpractice incident where 14 patients died, correct?\nIni:\nYeah.\nPhoenix:\nWhat was the cause of the mistake?\nIni:\nLike, I heard it was 'cause the medicines, like, got mixed up.\nPhoenix:\nWas that the fault of your sister, Mimi Miney?\nIni:\nLike, no way. Dr. Grey, like, wanted to blame it on my sis...\nvon Karma:\n\nvon Karma:\nThat incident has nothing to do with our murder here. Besides, the police report has already documented that it was entirely Mimi Miney's fault.\nPhoenix:\n(Which means as far as the \"real\" facts are concerned... Mimi Miney is the one who made the mistake...)\nIni:\nBut, like, it really wasn't my sis...Ini:\nAnd like, the night of the accident, my sis was totally tired while she was driving.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nShe was \"totally tired\"? You mean, exhausted?\nIni:\nLike, she had to talk to the police, and, like, was being investigated, like, every day. It was, like, a totally terrible situation.\nPhoenix:\nIt's no wonder, then, that the car accident happened, huh?\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nSo then, why didn't you ask to switch places?\nIni:\nHuh? Like, what are you talking about?\nPhoenix:\nI meant switch drivers. If your sister was so tired, then you should have switched with her.\nJudge:\nTrue, true.\nIni:\nAh, but like... I don't, like, have a driver's license...\nvon Karma:\nThis is news to me. I was not aware you didn't have your license, Ms. Miney.\nJudge:\nHmm... Ms. Miney, please amend your testimony.\nIni:\nLike, OK. Anyway...\nAdds statement \"I, like, didn't have my license, so, like, I couldn't take over driving for her.\"\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(There's no point in asking her about her sister. I should be trying to find out more information about Ini!)\nIni:\nSo, like, can I go on?\nLeads back to cross-examinationPress (after adding statement)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYour sister... Mimi Miney, was she that exhausted?\nIni:\nLike, she had to talk to the police, and, like, was being investigated, like, every day. It was, like, a totally terrible situation.\nJudge:\nAh, if only you had your license and were able to drive for your sister.\nIni:\nY-Yeah... That was, like, too bad...\nvon Karma:\nNow, then, witness. Continue with your testimony.Ini:\nI was, like, totally pooped too, so I, like, fell asleep in the passenger's seat...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe accident happened at night, correct...?\nIni:\nYeah, like, it was at, like, 1 AM or so, I think. I had, like, a paper due, like, really soon... so, like, I hadn't slept and was working, like, real hard.\nvon Karma:\nSo it was because the two of you were so tired that this accident happened.Ini:\nI, like, woke up 'cause of a jolt, and, like, it was a sea of flames around me.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAnd your sister? What happened to her?\nIni:\nI... I didn't see her... The car was, like, totally black, and there was, like, a ton of smoke... I, like, totally had, like, no clue what was going on.Ini:\nI, like, opened the door and, like, got away.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nPlease tell us about your escape in more detail.\nIni:\nI... I, like, kept wanting to forget that time, so, like, I don't remember things about the accident in, like, details anymore...\nJudge:\nHmm, well, it's alright. No need to push yourself.\nIni:\nI think I, like, gave an interview after the accident. Like, that would probably be the most accurate, you know?\nPhoenix:\n(Hmm, if it's that article, then I've already got it...)Ini:\nI, like, didn't have my license, so, like, I couldn't take over driving for her.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAnd that's why you were in the passenger's seat?\nIni:\nLike, yeah. I was, like, at my college's research lab 'till, like, really late... So my sis was, like, giving me a ride home.\nPhoenix:\nI see...\nMia:\nPhoenix.\nPhoenix:\nY-Yes?\nMia:\nYou can't do this. You're being too easy on her.Present License Photo\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Ms. Miney. That was a lame lie just now.\"Phoenix:\n(There's got to be some sort of secret sleeping in this testimony...)Mia:\nYes, so let's find that one crushing contradiction and end this!Phoenix:\nMs. Miney. That was a lame lie just now.Ini:\nLike, what do you mean?Phoenix:\nI know you had a license back then! This is a photo you took for the express purpose of getting a driver's license!Ini:\nUmm...Judge:\nWhat is the meaning of this, Ms. Miney!?Ini:\nAh, um... Uh... That's... That's right! Y-Yeah, I had, like, a license... But... ... But I didn't get it until after the accident!Phoenix:\nNo, you had it. You had it at the time of the accident! Director Hotti... or the guy pretending to be him anyway, said so!Ini:\nWhat, are you talking about that perverted fake clinic director?Phoenix:\nYes, that perverted fake clinic director. And how did you know he was perverted. Eowch!von Karma:\nNo one cares. Witness. When did you receive your driver's license?Ini:\nLike, last November.Phoenix:\nWhat? N-N-November...?von Karma:\nThe accident happened last May. That's a half year lapse in time, Mr. Phoenix Wright.Phoenix:\nWh-Wh-Wh-Wh-What in the!?Judge:\nTh-Th-Th-Th-That's what happened, Mr. Wright! At the time of the accident, Ms. Miney did not have a driver's license.Phoenix:\nUuuuurk... OW!von Karma:\nCry, and my whip will accommodate.Judge:\nAnyway, without a license, the witness and her sister could not have switched drivers.Ini:\nI'm, like, glad you get it, but... like, even if I had my license, I, like, don't think my sis woulda, like, let me drive.Phoenix:\n(...Hmm...) Yeow!Mia:\nDon't just stand there \"hmm\"-ing to yourself!Phoenix:\nNot you too, Mia! With the whip... And the pain... And the oww...Mia:\nMs. Miney! Why do you think you would not have been allowed to drive anyway?Ini:\nEh? Um... That's because...Judge:\nI think this situation calls for a more detailed testimony. Ms. Miney, if you please.Ini:\nEh? Like, how annoying. Oops, like, sorry. Didn't mean to be mean...Witness Testimony-- I Wouldn't Be Allowed --Ini:\nLike, around that time, I was, like, really close to getting my license.\nMy sis was, like, this totally big fan of cars and, like, really valued them.\nShe, like, had just gotten this really shiny, bright red sports car.\nShe, like, would say things like, \"No way am I letting a newb drive my car!\"\nSo, like, that's why I ended up in the passenger's seat that night too.Judge:\nHmm... I see... A bright red car for sports... Now then, the defense may question the witness.Phoenix:\n(Hmm... I'm not terribly knowledgeable about cars, but...)Cross Examination",
      "testimonies": [
        {
          "testimony": "Like, around that time, I was, like, really close to getting my license.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "My sis was, like, this totally big fan of cars and, like, really valued them.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "She, like, had just gotten this really shiny, bright red sports car.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "My sis' new car was, like, a totally special model from England.",
          "person": "Ini",
          "present": [
            "Newspaper Clipping 2"
          ],
          "source": {
            "evidence_span": "but I opened the right door and like, got out",
            "testimony_span": "a totally special model from England",
            "explanation": "A car from England has the driver side door on the right. If th witness got out from the right, she must have been the driver, not the passenger.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "common sense"
          }
        },
        {
          "testimony": "She, like, would say things like, \"No way am I letting a newb drive my car!\"",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "So, like, that's why I ended up in the passenger's seat that night too.",
          "person": "Ini",
          "present": [
            "Newspaper Clipping 2"
          ],
          "source": {
            "evidence_span": "but I opened the right door and like, got out",
            "testimony_span": "that's why I ended up in the passenger's seat",
            "explanation": "A car from England has the driver side door on the right. If th witness got out from the right, she must have been the driver, not the passenger.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "common sense"
          }
        }
      ],
      "noPresent": false,
      "difficulty": "common sense",
      "labels": [
        "object property",
        "spatial"
      ],
      "reasoning": [
        "Fact 1: The witness claims she was in the passenger's seat.",
        "Fact 2: The witness claims she was in an English car.",
        "Fact 3: The evidence suggests she was seated on the right.",
        "Fact 4: An English car has the driver's seat on the right."
      ]
    }
    
  ]
}