{
  "previousContext": "",
  "characters": [
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Maya Fey",
      "age": "18",
      "gender": "Female",
      "description1": "My assistant until a year ago. Now she's training to be a spirit medium.",
      "description2": "The defendant, and my client. Was arrested on suspicion of murder while channeling."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Dr. Turner Grey",
      "age": "35",
      "gender": "Male",
      "description1": "The director of the Grey Surgical Clinic where the malpractice incident occurred.",
      "description2": "Grey Surgical Clinic Director. Had a malpractice incident. Murdered during a channeling."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Pearl Fey",
      "age": "8",
      "gender": "Female",
      "description1": "Ran away as soon as she saw me. A girl who is Maya's little cousin.",
      "description2": "Maya's cousin. A channeling prodigy with intense spiritual power. Also the youngest."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Morgan Fey",
      "age": "??",
      "gender": "Female",
      "description1": "Maya's aunt. She has a strange, powerful aura about her.",
      "description2": "Maya's aunt. A member of the Fey clan branch family. She is the mother of Pearl."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Lotta Hart",
      "age": "23",
      "gender": "Female",
      "description1": "Claims to be an investigative photographer. She lives for the next big scoop."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Dick Gumshoe",
      "age": "31",
      "gender": "Male",
      "description1": "Detective at the local precinct. In charge of the initial investigation."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Ini Miney",
      "age": "21",
      "gender": "Female",
      "description1": "College student. A huge fan of the occult and is doing research in parapsychology.",
      "description2": "College student. Researching parapsychology. Older sister, Mimi, died in a car accident."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Mimi Miney",
      "age": "deceased",
      "gender": "Female",
      "description1": "Died in a car accident 1 year ago. Was Ini's older sister, nurse at Dr. Grey's clinic."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Mia Fey",
      "age": "deceased",
      "gender": "Female",
      "description1": "Maya's older sister. She was a top notch lawyer and my mentor and friend forever."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Franziska von Karma",
      "age": "18",
      "gender": "Female",
      "description1": "Became a prosecutor in Germany at age 13. A prodigy who has never known defeat."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Ami Fey",
      "age": "deceased",
      "gender": "Female",
      "description1": "Kurain Channeling Technique founder. Legend says her soul is sealed in the Sacred Urn."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Director Hotti (purported)",
      "age": "??",
      "gender": "Male",
      "description1": "A peculiar patient who claims to be Director Hotti. Seems to be extremely \"healthy\"."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "It's my all-important badge. It shows that I am a defense attorney."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Guidemap (Fey Manor)",
      "type": "Maps",
      "obtained": "Received from Dr. Grey.",
      "description1": "A diagram of Fey Manor. Meditation room to the south. Channeling chamber north of meditation room. Side room to the east, have to go through winding path from meditation room to get to side room."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Maya's Magatama",
      "type": "Other",
      "obtained": "Received from Maya Fey.",
      "description1": "Slightly translucent. It's small, but it has a deep, profound aura about it.",
      "description2": "Slightly translucent. It radiates softly with a mysterious light."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Newspaper Clipping 1",
      "type": "Evidence",
      "obtained": "Retrieved at the Wright & Co. Law Offices.",
      "description1": "One year ago on May 2nd, 14 patients died from malpractice at Grey Surgical Clinic."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Folding Screen",
      "type": "Evidence",
      "obtained": "Retrieved from the channeling chamber.",
      "description1": "About 8 inches off the ground is a small hole that looks like a bullet hole."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Black Key",
      "type": "Evidence",
      "obtained": "Received from Pearl Fey.",
      "description1": "An old steel key. A green jewel is set in the center of the key's grip."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Newspaper Clipping 2",
      "type": "Evidence",
      "obtained": "Received from Detective Gumshoe.  → Received from Director Hotti.",
      "description1": "Mimi Miney, nurse at Grey Surgical Clinic, died after falling asleep at the wheel.",
      "description2": "Articles about the car accident. This is a newspaper clipping about the death of Mimi Miney, the nurse who worked at Turner Grey's clinic. It reads how Mimi died as a result of her car crashing when she fell asleep at the wheel and Director Hotti fills in some further parts of the article later on. The content is as follows-Highway of Nightmares-May 24 - Late last night, two women's car crashed into a highway center divide. One of the women was not able to escape the flaming wreckage and died at the site. Ongoing investigation has revealed that the driver had fallen asleep at the wheel. -Ms. Ini Miney Holds Interview About Crash- I was like, really tired and I dropped off to sleep. Then there was this crash, and like, I woke up in a huge sea of flames. I was like, still half-asleep, but I opened the right door and like, got out. I don't, like, remember anything else. -Doctor Lurking in the Shadows? If Ms. Ini Miney is to be believed, the one driving the car was her sister, Mimi Miney. Mimi Miney was the nurse at Grey Surgical Clinic where 14 patients were accidentally overdosed to their death. Is this then, just a mere coincidence...? "
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Floor Plans (Crime Scene)",
      "type": "Maps",
      "obtained": "Submitted as evidence during the trial.",
      "description1": "A diagram of the Channeling Chamber. A four sectioned mat in front of a platform at the head."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Dr. Grey's Autopsy Report",
      "type": "Reports",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "After being stabbed in the chest, he was shot in the forehead at point-blank.",
      "description2": "Stabbed in chest then shot at point-blank. Gunpowder residue around bullet hole."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Pistol",
      "type": "Weapons",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Murder weapon. Was Grey's. Two shots fired. Bears Maya's and Grey's fingerprints."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Knife",
      "type": "Weapons",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Murder weapon. A small fruit knife. Belongs to the Fey's. Bears Maya's fingerprints."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Maya's Costume",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Clothes Maya was wearing at the time of the murder. There are blood splatters on it.",
      "description2": "Clothes Maya was wearing at the time of the murder. This is Maya's robe that she wore on the day of Turner Grey's murder. It is stained with blood splatter and a bullet hole is present in the sleeve. The robe is otherwise clean. It is purple in color."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Lotta's Photo 1",
      "type": "Photographs",
      "obtained": "Received from Lotta Hart.",
      "description1": "A picture taken at the murder scene. This is a photo taken by Lotta Hart of Maya Fey after they break into the Channeling Chamber when they hear a gunshot. Turner Grey is lying dead on the floor after being shot."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Lotta's Photo 2",
      "type": "Photographs",
      "obtained": "Submitted as evidence by Franziska von Karma.",
      "description1": "A picture taken at the murder scene. This is the second photo taken by Lotta Hart of Maya Fey after they break into the Channeling Chamber when they hear a gunshot. Turner Grey is lying dead on the floor after being shot behind her. Maya Fey is standing, pistol in hand, wearing a blood-splattered robe."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Sacred Urn",
      "type": "Other",
      "obtained": "Retrieved from the Winding Way.",
      "description1": "Ami Fey's spirit is sealed within. It's chipped and cracked all over.",
      "description2": "Broken by Pearl right before the murder. Under repair in the hallway until police came."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Cloth Scrap",
      "type": "Evidence",
      "obtained": "Retrieved from the Winding Way.",
      "description1": "Unburned remains found inside the garden incinerator. Small amount of blood is on it."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Pearl's Ball",
      "type": "Other",
      "obtained": "Retrieved from the Side Room.",
      "description1": "Pearl's favorite toy. She was playing with this at the time of the murder, it seems."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "Clothing Box",
      "type": "Evidence",
      "obtained": "Retrieved from the Side Room.",
      "description1": "There is a hole that looks like a bullet hole about 8 inches off the ground."
    },
    {
      "currentChapter": "Reunion, and Turnabout",
      "name": "License Photo",
      "type": "Photographs",
      "obtained": "Received from Director Hotti.",
      "description1": "Ini's photo for her driver's license. Director Hotti's treasured possession."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "Reunion, and Turnabout\n\n\n\n\n\n\n\n\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 4June 22, 9:51 AMDistrict CourtDefendant Lobby No. 3Maya:\nUm... Nick...Phoenix:\nYeah?Maya:\nDid you know that Von Karma's daughter is only 18... Just like me...?Phoenix:\nUm, yeah. ...Why?Maya:\nI was just thinking about how strong she is... I mean, she's been in Germany all this time all by herself, and she's so grown up!Phoenix:\n...Yeah, and I'm sure she felt a lot of pressure from her father's reputation.Maya:\n...And then you look at me, and, well... I'm the daughter of the Master, but I'm still just a little girl. And on top of that, I'm the suspect in a murder trial.Phoenix:\n(Um... But I think you're really strong too, Maya, for all you've gone through...)Pearl:\nGood morning! The two of you look like you're doing well today. I'm happy for you!Maya:\nHey! Morning, Pearly!Pearl:\nYou'll be safe today, Mystic Maya!Maya:\nHuh? What do you mean?Pearl:\nMy mother is coming today to show her support!Maya:\nY-Yeah... Yeah! That's right, Pearly!Phoenix:\nHey, Pearls...Pearl:\n...? Yes, Mr. Nick?Phoenix:\nUm, do you think you could do me a big favor? Could you channel Mia today too?Pearl:\nHuh? ...I was sort of hoping to sit in the audience today and watch...Phoenix:\n...Please. It's very important to me. I don't feel confident enough without her help...Pearl:\nMr. Nick! That's enough! You can't show weakness in front of the person you love!Maya:\nP-Pearly! N-Not this again...Phoenix:\nPlease, can you do this for us, Pearls?Pearl:\nUm... Alright. I'll do it. I'll do it for Mystic Maya's sake. See you later, then! I'll leave you two to your alone time!Phoenix:\n...Phew, thank goodness.Maya:\nNick?Phoenix:\nThis way, Pearls won't be able to see today's trial...Maya:\n...Wh-What do you mean...? What's going on...?June 22, 10:00 AMDistrict CourtCourtroom No. 2Judge:\nCourt is now in session for the trial of Maya Fey.Phoenix:\nThe defense is ready, Your Honor.von Karma:\nLet's start already. Mr. Phoenix Wright. I look forward to tonight's news with great joy. The image of your defeated face will be transmitted all over the world!Mia:\nAll over the world, huh? Sounds like you've made quite a name for yourself, Phoenix.von Karma:\nDon't be foolish, you foolish fool wearing the foolishly foolish clothes. The famous one is me! I'm the prodigy who has never lost a case since becoming a prosecutor five years ago. Naturally, the world's eyes are on me, as I conduct my first trial in this country!Mia:\nUh, huh... That's nice, Ms. von Karma.von Karma:\nHmph. Glad to see you're in such good \"spirits\" today, Ms. Fey.Phoenix:\n(Uhh... It's true what they say... Women really are scary when they fight... *gulp*)Judge:\nNow then. A very interesting theory was presented during yesterday's session.von Karma:\nThat the defendant could have left the Channeling Chamber, correct?Judge:\nYes. And this key is proof of that. This key, the only key to the Channeling Chamber, was not where it should have been.von Karma:\nYour Honor, I would like to say one thing before we begin.Judge:\nA-Alright... Let's hear it.von Karma:\nThe prosecution has determined that from the time of the murder to the time of arrest, the defendant did indeed leave the room at one point.Phoenix:\nWh-What!?Judge:\nBut... Ms. von Karma! Then... How do you explain this picture? Are you saying then, that the person in this picture is not the defendant...?von Karma:\nI never said that wasn't the defendant.Judge:\nTh-Then what is the meaning of this...?von Karma:\nAll I am saying is that Maya Fey, after killing the victim, exited the room. And I believe that is when she dropped this key.Judge:\nCan you substantiate your claim?von Karma:\nIsn't that what I'm here for? The prosecution would like to call the defendant's aunt, Morgan Fey, to the stand.Mia:\n...Just as I suspected. Aunt Morgan...Phoenix:\n(Poor Mia... She seems really torn by this...)von Karma:\nWitness. Name and occupation.Morgan:\nMy name is Morgan Fey, and I am a spirit medium, in a manner of speaking...Judge:\nI'm sorry, but what do you mean, \"in a manner of speaking\"...? Aaah!von Karma:\nI don't think anyone really cares. Now then, after the murder took place, you kept watch over the defendant, correct?Morgan:\nYes, that is correct. I performed the Spirit Severing Technique on Mystic Maya then.Judge:\nS-Spirit Severing Technique?Morgan:\nA technique to remove a spirit from a body and send it back to the other world. That is...Judge:\nYes...? That is...? Mmfph!von Karma:\nYou. Be quiet. Now, witness. Something happened while you were performing this technique, correct?Morgan:\n...Yes, that is correct.Phoenix:\nWh-What in the world could've...!?Morgan:\nMystic Maya... She escaped from the room...Judge:\nWh-What!?von Karma:\nAnd here we come to the heart of the matter. Maya Fey, while in a possessed state, managed to escape from the Channeling Chamber!Judge:\nOrder! Order! Order! Ms. Fey! Please testify to this court what happened during that time!Morgan:\nYour Honor, I will try my best...Mia:\nI think someone just upped the ante on this trial...Witness Testimony-- Maya's Escape --Morgan:\nAfter we heard the gunshots, those two broke the door open and entered the Chamber.\nI requested that Mr. Wright and the other lady please contact the police.\nA pistol was hanging from Mystic Maya's hand and she was in a daze...\nThen, quite suddenly, she thrusted me away from herself and escaped from the room.\nWith great strength, she hit the base of my neck and I fainted for a short while...\nI'm afraid I have no knowledge of where she went after that.Phoenix:\nWhy have you hidden this until now!?Morgan:\nI... I did not wish to cause more trouble for Mystic Maya. However... I must correct falsities when they arise.von Karma:\nThat's right. She is simply correcting a falsity, Mr. Phoenix Wright.Phoenix:\n(Why is she making it a point to take a stab at me... Never mind.)Judge:\nMr. Wright, your cross-examination, please.Mia:\nMy aunt is a very smart and sly person. It's going to be hard for us to find a crack in her testimony...Cross Examination",
      "testimonies": [
        {
          "testimony": "After we heard the gunshots, those two broke the door open and entered the Chamber.",
          "person": "Morgan",
          "present": []
        },
        {
          "testimony": "I requested that Mr. Wright and the other lady please contact the police.",
          "person": "Morgan",
          "present": []
        },
        {
          "testimony": "A pistol was hanging from Mystic Maya's hand and she was in a daze...",
          "person": "Morgan",
          "present": []
        },
        {
          "testimony": "Then, quite suddenly, she thrusted me away from herself and escaped from the room.",
          "person": "Morgan",
          "present": []
        },
        {
          "testimony": "With great strength, she hit the base of my neck and I fainted for a short while...",
          "person": "Morgan",
          "present": []
        },
        {
          "testimony": "I'm afraid I have no knowledge of where she went after that.",
          "person": "Morgan",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- Maya's Escape --Morgan:\nAfter we heard the gunshots, those two broke the door open and entered the Chamber.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nJust now, you said, \"those two.\" Who were the two people you were referring to?\nMorgan:\nI was referring to that foreign lady and yourself, good sir.\nPhoenix:\nUm, Lotta's not a foreigner... despite how she talks...\nMorgan:\nOh, is that so? I'm sorry... I simply could not understand her atrocious English, not to mention she looked awful!\nPhoenix:\n(I can already see people in the heartland gearing up for a riot...)\nMorgan:\nIn any case, I have already sent the repair bill to your office, Mr. Wright.\nPhoenix:\nOh, uh, thanks.\nJudge:\nHmm... What did you do after that, Ms. Fey?Morgan:\nI requested that Mr. Wright and the other lady please contact the police.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas it really necessary to have two people do something so simple as call the police? If there was a possibility of escape, then one of us should have stayed behind!\nJudge:\nHmm, yes. That is a very good point.\nMorgan:\nAt that time, I, myself, was a little confused. On top of which, there was another...\nJudge:\nAnother what, madam?\nMorgan:\nOh, it's nothing. No need to concern yourself.\nPhoenix:\n(I want to hear the end of that sentence...)\n\n\n\nQuestion further\n\n\n\n\n\n\n\nPhoenix:\nThere was another reason you wanted both of us out of that room, wasn't there!?\nMorgan:\n...\nPhoenix:\nYou must testify! Why did you chase us out of the room!?\nMorgan:\n...I simply did not wish for there to be more victims.\nPhoenix:\n...!\nMorgan:\n\"The lives of both the good sir and that camera woman may be in danger...\" is what I thought to myself.\nJudge:\nWell, that was very noble of you, Ms. Fey.\nPhoenix:\n(This is bad... Now people have a good impression of her and a bad one of us...)\nMia:\nLooks like she caught us napping. That's my aunt for you...\nJudge:\nAre you satisfied now, Mr. Wright? Ms. Fey, please continue.\nLeads back to cross-examination\n\n\n\n\nLeave her be (before pressing third, fourth, and sixth statements)\n\n\n\n\n\n\n\nPhoenix:\n(The last bit of her sentence sounds like a red herring... If that's the case, I'm not going to fall into her trap today.)\nJudge:\nIf the defense has no further questions, let us press on.\nLeads back to cross-examination\n\n\n\n\nLeave her be (after pressing third, fourth, and sixth statements)\n\n\n\n\n\n\n\nPhoenix:\n(The last bit of her sentence sounds like a red herring... If that's the case, I'm not going to fall into her trap today.)\nLeads to:\n\"That's enough!\"Morgan:\nA pistol was hanging from Mystic Maya's hand and she was in a daze...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nDuring our investigation, you stated that you struck the defendant on the head, and this strike caused Maya to lose conciousness. Do you stand by this statement?\nMorgan:\nI'm afraid I don't. The statement I gave you was a lie...\nPhoenix:\n...! B-But why would you lie about something like that!?\nMorgan:\nIt is very painful for me to say this, however...\nvon Karma:\n\nvon Karma:\nThe witness was lying to cover for the defendant.\nPhoenix:\n(She was... covering for Maya...?)\n\n\n\nQuestion further\n\n\n\n\n\n\n\nPhoenix:\nSo, you were \"covering for the defendant\"!?\nMorgan:\nWell, yes... It was only later that I was informed of what had occurred. That the renegade Mystic Maya had done something very unexpected...\nJudge:\nS-Something unexpected!? What, pray tell, did sh-- Oogh!\nvon Karma:\nThis witness didn't and couldn't have seen what happened. If you want to know what this unexpected thing was, there is always later.\nJudge:\nY-Yes, very well...\nPhoenix:\n(Ugh... Why does it suddenly feel like there's a rock in the pit of my stomach...?)\nvon Karma:\nNow, witness, continue with what happened.\nLeads back to cross-examination\n\n\n\n\nLeave her be (before pressing second, fourth, and sixth statements)\n\n\n\n\n\n\n\nPhoenix:\n(I'm sure Von Karma's allowing this testimony because it's advantageous to her... ...Which means I shouldn't press Morgan any further...)\nvon Karma:\nYou're finally beginning to understand, aren't you, Mr. Phoenix Wright... Now, witness, continue with what happened.\nLeads back to cross-examination\n\n\n\n\nLeave her be (after pressing second, fourth, and sixth statements)\n\n\n\n\n\n\n\nPhoenix:\n(I'm sure Von Karma's allowing this testimony because it's advantageous to her... ...Which means I shouldn't press Morgan any further...)\nLeads to:\n\"That's enough!\"Morgan:\nThen, quite suddenly, she thrusted me away from herself and escaped from the room.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas it really that easy for her to escape from you?\nMorgan:\nI'm ashamed to admit to such a thing, however, yes...\nPhoenix:\nBut you are physically larger and stronger than the defendant. There is no way she could have escaped from you so easily...\nvon Karma:\n\nvon Karma:\nHave you forgotten already, Mr. Phoenix Wright? What about this picture!? Remember that at the time, the defendant was not physically \"Maya Fey\".\nPhoenix:\n...Ack!\nJudge:\nHmm... Growing old is such a mysterious thing. Trust me, I know first-hand.\nMorgan:\nBasically, Mystic Maya's body was still that of the nurse she had called.\nPhoenix:\nBut if she had run away, wouldn't you have given chase right away!?\nMorgan:\nWell, yes, I would have... however...Morgan:\nWith great strength, she hit the base of my neck and I fainted for a short while...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou fainted...?\nMorgan:\nI became dizzy, and then collapsed onto the floor.\nJudge:\nHow long were you unconscious?\nMorgan:\nI... I'm not sure. About ten minutes, perhaps.\nJudge:\nHmm... And the defendant almost certainly went somewhere in that time...\nvon Karma:\nHappy? Witness, elaborate on that point for us.Morgan:\nI'm afraid I have no knowledge of where she went after that.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nIs that because you were unconscious?\nMorgan:\nWhy, yes...\nPhoenix:\n(Great, well, now what...?)\n\n\n\nQuestion further\n\n\n\n\n\n\n\nPhoenix:\nSo while you were unconscious, you have absolutely no idea where the defendant went?\nMorgan:\nI would think that's obvious, good sir.\nPhoenix:\nIf that's true... then how can you know for sure that the defendant left the Channeling Chamber at all!?\nJudge:\nNow that you mention it... I have to wonder myself!\nvon Karma:\nIt's true that this witness is not able to confirm this. But the key word here is \"this\" witness.\nPhoenix:\nWhat do you mean by that!?\nMia:\nIt means she has another witness up her sleeve. That's what. It looks like Ms. von Karma is ready to move on to her next witness.\nLeads back to cross-examination\n\n\n\n\nLeave her be (before pressing second, third, and fourth statements)\n\n\n\n\n\n\n\nPhoenix:\n(If she fainted, then there's no way she can testify any more than she has... If I press her, I'm not going to get anything useful anyway...)\nJudge:\nHmm... Well, then... Let's continue on with the testimony, shall we?\nLeads back to cross-examination\n\n\n\n\nLeave her be (after pressing second, third, and fourth statements)\n\n\n\n\n\n\n\nPhoenix:\n(If she fainted, then there's no way she can testify any more than she has... If I press her, I'm not going to get anything useful anyway...)\nLeads to:\n\"That's enough!\"Mia:\nI can't see a crack in her testimony...Phoenix:\nWh-What should we do...?Mia:\nFor now, we should try and get more information out of her. After we get more information from her we may be able to use it later to our advantage.After pressing second, third, fourth, and sixth statements:Judge:\nThat's enough! From what I can tell, there is nothing wrong with this witness's testimony. And from what she has said, we can establish that Maya Fey did leave the Chamber.Phoenix:\n(Hmm... I hope this isn't going to come back and bite us in the butt...)von Karma:\nNow, let's take the next logical step and ask, \"Where did the defendant go after leaving the Channeling Chamber?\"Judge:\nYes, yes... That is exactly what we should b-- Eeek!von Karma:\nBe quiet, you! Now then, what the escapee had done was she had gone to speak with a certain person!Phoenix:\nShe... She went to speak with someone!?Judge:\nWh-Who was it!?von Karma:\nThe prosecution calls Ms. Ini Miney, who was sleeping in the Side Room at the time.Phoenix:\nI-Ini Miney...?Mia:\nI think you can see where this is headed...von Karma:\nWitness. Name and occupation.Ini:\nUm... OK, so my name is, like, Ini Miney. I'm, like, researching, like, parapsychology stuff at the, um, university.Judge:\nWhat is this \"parapsychology\"?Ini:\nUm... Let's see... It's, like, I guess, most people call it \"occult stuff\".Judge:\nEven if that's what most people call it, I can't say I understand what that means...von Karma:\nThen I suggest you go home and research it yourself.Judge:\nYes, sir.von Karma:\nNow then, Ms. Miney, after the murder took place, you spoke with the defendant, Maya Fey. Is this correct?Ini:\nUm... Well... Hmm... Like, I guess...von Karma:\nIf that's the case, then let's hear your testimony. That IS alright, isn't it, Your Honor?Judge:\nYes, sir.Phoenix:\n(For the love of all things good, Your Honor, have some spine... For my sake...)Witness Testimony-- After the Murder --Ini:\nLike, when the channeling started, I was, like, sleeping in the Side Room.\nLike, a little later, someone came into the room, like, really suddenly.\nIt was, like, oh my gawd, totally my sister!\nI, like, hadn't seen her in like, so long... I was so happy in, like, a sad way...\nMy sister... She, like, told me something, like, totally terrible.Judge:\nNow hold your horses, young lady! You're saying the person that entered was your sister!? Don't you mean the defendant, Maya Fey...?von Karma:\nReally, now... Your Honor. Maya Fey was still in the middle of channeling at that time.Judge:\nA-Are you saying that the spirit was the spirit of this witness's sister!?von Karma:\nYes, Mimi Miney. She was a nurse at Dr. Grey's clinic.Judge:\nOh... W-Well... This is...von Karma:\nWitness.Ini:\nLike, yeah?von Karma:\nIn your testimony, you mentioned a \"terrible\" thing. Why don't you tell the court what this terrible thing was? I'm sure we'd love to hear about it.Ini:\n...Um, like... Do I totally, like, really have to?von Karma:\nOf course.Judge:\nMs. Miney... please.Ini:\n... My sister... Like, this is what she said to me.That was... no accident... I was drugged... with sleeping pills... I was murdered... by that person... That's why... I took... my revenge... It's only fair... Isn't it... ...Ini?Judge:\nShe \"took her revenge?\" Are you sure that's what she said?Ini:\nY-Yes...von Karma:\nThere, are you satisfied, Your Honor?Judge:\n...I still can't believe it. I can't believe that a spirit would go so far as to use a medium to get revenge...von Karma:\nIt is a bit hard to swallow, however, all the evidence and testimonies point to this as the truth! ...The end.Judge:\n...What do you think, Mr. Wright? It certainly seems like all the loose ends are accounted for...Phoenix:\n(This... This testimony just now... Was it all made up? Was it just one huge lie...?)Mia:\nOf course it was, Phoenix.Phoenix:\n...Mia! What do you mean?Mia:\nIt's well constructed... but that's all it is. But even the most well-spun lies can be undone. We can do it, Phoenix. Let's find that one loose thread and unwind this tapestry of lies.Phoenix:\nYour Honor! There is room for doubt, so the defense will cross-examine this witness. We believe that our cross-examination will reveal the real truth behind this murder!von Karma:\nYet again the foolish fool spouts out more foolishly foolish drabble... I wonder if you'll make this one more entertaining than the last...Cross Examination",
      "testimonies": [
        {
          "testimony": "Like, when the channeling started, I was, like, sleeping in the Side Room.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "Like, a little later, someone came into the room, like, really suddenly.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "It was, like, oh my gawd, totally my sister!",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "I, like, hadn't seen her in, like, so long... I was so happy in, like, a sad way...",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "I wasn't, like, scared at all. And, like, her costume looked totally, like, normal.",
          "person": "Ini",
          "present": [
            "Maya's Costume",
            "Lotta's Photo 2"
          ],
          "source": {
            "evidence_span": "wearing a blood-splattered robe",
            "testimony_span": "her costume looked totally, like, normal",
            "explanation": "Maya Fey's costume was splattered with blood, so it could not have been normal when seen by the witness.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty1": "hard",
            "difficulty2": "easy"
          }
        },
        {
          "testimony": "My sister... She, like, told me something, like, totally terrible.",
          "person": "Ini",
          "present": []
        }
      ],
      "noPresent": false,
      "difficulty": "easy",
      "is_self_contained": "yes"
    },
    {
      "category": "cross_examination",
      "newContext": "-- After the Murder --Ini:\nLike, when the channeling started, I was, like, sleeping in the Side Room.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas that because of your, um... sesame allergy, was it?\nIni:\nLike, that's right. I, like, think there were sesame seeds, like, in the lunch they served that day. I had this, like, premonition that it was going to totally be a \"seedy\" day.\nvon Karma:\nYes, indeed.\nJudge:\nHmm... I see...\nPhoenix:\n(...Am I the only one who missed the boat here...?)\nJudge:\nAnyway, so you were taking a nap. Did something happen while you were sleeping?Ini:\nLike, a little later, someone came into the room, like, really suddenly.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nDo you know the time?\nIni:\nUm, uh... Like, maybe a little before 11 AM? Something like that, I think...\nPhoenix:\nE-Eleven AM...?\nIni:\nYeah. Like, my stomach is totally ready for, like, food.\nPhoenix:\n... Ah, no... I think you misunderstood me... I'm not asking what time it is now... I meant what time was it when the \"someone\" came into your room!\nIni:\nOh! So, like, that's what you meant! Like, you shoulda been more, like, clear about it!\nPhoenix:\nS-Sorry. My bad.\nIni:\nNo, it's OK. Like, it's really...\nPhoenix:\n...\nIni:\n...?\nPhoenix:\n...That's it? Why'd you stop mid-sentence!?\nIni:\nDid I? ...So, like... what was I talking about again...?\nPhoenix:\n... N-Never mind...\nvon Karma:\n...Witness. About this person who entered the Side Room...Ini:\nIt was, like, oh my gawd, totally my sister!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAre you absolutely sure?\nIni:\n...I guess?\nPhoenix:\nYou \"guess\"...? Was it or was it not your sister who entered?\nIni:\nLike, I don't know. I mean, like, I totally don't know \"your sister\" at all, Mr. Smith.\nPhoenix:\n(First off, my name is not Mr. Smith. Second, I'm an only child. ...Hmm, but more than that, she's managed to mess up the question with her answer...)\nJudge:\nWell, Mr. Wright?\nPhoenix:\nTh-The defense rests...\nvon Karma:\nWell, that was a colossal waste of our time! Now then, witness. How did you feel when you saw Ms. Mimi Miney?Ini:\nI, like, hadn't seen her in, like, so long... I was so happy in, like, a sad way...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou were... happy in a sad way...?\nIni:\nYeah, like, I mean, it was my sister!\nPhoenix:\nBut wouldn't most people react here with surprise at seeing a dead loved one alive again?\nIni:\nUm, but, like, maybe if I was, like, someone who didn't know about, like, the occult. But I, like, know all about the Kurain Channeling Technique.\nvon Karma:\nThe point here, is the witness immediately recognized that it was her \"sister\".\nIni:\nYeah, like, what she said.\nPhoenix:\n(Hmm... Should I drop this  line of questioning...?)\n\n\n\nQuestion further\n\n\n\n\n\n\n\nPhoenix:\nSo you really didn't think anything \"strange\" of the whole encounter?\nIni:\nNo. Like, there wasn't any reason for me to, like, think anything was \"strange\".\nPhoenix:\nBut... OWW!\nvon Karma:\nDon't keep badgering her.\nPhoenix:\n...You know the phrase, \"Objection!\"? Could you try using that once in a while...?\nJudge:\nHmm... Mr. Wright. This question of what the witness felt when she saw her sister... is it really that important?\n\n\n\nOh, it's nothing.\n\n\n\n\n\n\n\nPhoenix:\n\"Is it really that important?\" Let me ask you: Is it really that important for you to ask?\nJudge:\nOf course it's very important.\nPhoenix:\nWell, I don't think it's that important at all! Yeow!\nvon Karma:\nStop spewing such nonsensical things then. Pay no attention to this twit and continue, witness.\nIni:\nLike, OK.\nLeads back to cross-examination\n\n\n\n\nIt is very important.\n\n\n\n\n\n\n\nPhoenix:\nIt is very important! (Although I haven't quite figured out what \"it\" is yet. But I've got to bluff for now and make it seem like I know what I'm talking about...)\nJudge:\nAlright, Mr. Wright. Ms. Miney, please amend your testimony.\nIni:\nLike, OK. I'm, like, totally cool with that.\nChanges statement from \"I, like, hadn't seen her in, like, so long... I was so happy in, like, a sad way...\" to \"I wasn't, like, scared at all. And, like, her costume looked totally, like, normal.\"\n\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(There's no need to press her over something this minor... I should be trying to find a more decisive problem with her testimony...)\nIni:\nSo, like, is it OK? I'm going to, like, finish my story, OK?\nLeads back to cross-examinationIni:\nI wasn't, like, scared at all. And, like, her costume looked totally, like, normal.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo, there was nothing odd at all about your sister's appearance?\nIni:\nLike, yeah. Nothing was, like, weird.\nPhoenix:\n(...Hmm...)\nMia:\n...\nPhoenix:\n(Hm? ...Mia's talking to herself like she's found something wrong...)\nMia:\n...That's impossible...\nPhoenix:\n(...?)\nIni:\nLike, is everything OK? Can I, like, go on...?Present Maya's Costume or Lotta's Photo 2\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"That was a very well-spun lie, Ms. Ini.\"Ini:\nMy sister... She, like, told me something, like, totally terrible.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSomething \"terrible\"? What was this thing she told you?\nIni:\nHuh? Like, didn't I just, like, tell you about it? Did you, like, forget already?\nvon Karma:\nA foolish fool with a foolish sieve for a brain only speaks foolishly with foolish words.\nPhoenix:\n(Well, excuuuse me, Princess. ...Anyway, should I ask to hear the story again...?)\n\n\n\nDon't bother asking\n\n\n\n\n\n\n\nPhoenix:\n(I did just hear this story. It's not like my memory is that bad...) Actually, the defense is fine and does not need to hear the story again.\nJudge:\nVery well. You may continue your testimony, Ms. Miney.\nLeads back to cross-examination\n\n\n\n\nAsk to hear it again\n\n\n\n\n\n\n\nPhoenix:\nI'm sorry, but could I hear the story one more time?\nIni:\nLike, sure, no problem. I'll even, like, tell it all spooky-like for you.\n\n\nThat was... no accident... I was drugged... with sleeping pills... I was murdered... by that person... That's why... I took... my revenge... It's only fair... Isn't it... ...Ini?\n\n\nIni:\n...Like, how was that?\nJudge:\nIt was a little scary...\nIni:\nLike, I'm sorry. Maybe I, like, put too much spookiness into it...?\nLeads back to cross-examinationPhoenix:\n(I know there has to be something here I can use... But where!?)Mia:\nShe really put a lot of thought into this lie, didn't she? We can't rush this. Let's take it slowly, one step at a time. She's bound to slip up somewhere. Don't give up. But don't get careless, OK? Remember, calm and collected.Phoenix:\nThat was a very well-spun lie, Ms. Ini.Ini:\n...!von Karma:\nWh-What are you babbling about this time, Mr. Phoenix Wright!?Phoenix:\nIt's well constructed... but that's all it is.Mia:\nStealing MY lines now, are we, Phoenix?Phoenix:\nMs. Miney, may I remind you of what you said? You said that there was nothing strange about your sister's appearance.Ini:\nL-Like, yeah... And...?Phoenix:\nBut I don't think that's what you were thinking at all. Take a look at this picture. (Changed from [But I don't really think you thought that at all. Take a look at this picture.] in the original release) This is a picture of the \"sister\" you met. I would think that even you would be surprised if someone like this appeared before you.von Karma:\n... The blood spray...Phoenix:\nMs. Miney! Why did you not include the blood you saw in your testimony!? If you were really testifying, and not lying, you would have noted it right off the bat!Ini:\nUmmm...!Judge:\nOrder! Order! Ms. Miney! What is the meaning of this!?Ini:\n...Judge:\n...Ms. Miney?Ini:\nI'm thinking! Don't interrupt me!Judge:\n...Um, that... Eep!von Karma:\nAnd what are you stammering about, Your Honor...?Judge:\nUm, uh... Well... I... I uhh...Mia:\nThat witness... Her personality did a complete 180 there.Phoenix:\nLots of people do that when they get on the stand, though.Mia:\n...von Karma:\nFirst of all, calm yourself down, witness.Ini:\n... Like, I'm sorry. I, like, didn't mean to snap...von Karma:\nNow, hurry up with the testimony.Judge:\nI-If you please...Phoenix:\n(Ugh... The judge still looks a little shaken up... A lot of help he's going to be...)Witness Testimony-- After the Murder, Pt.2 --Ini:\nLike, the Side Room was, like, kinda dark, you know?\nSo like, the costume is, like, purple, right? The blood totally blended right in.\nAnd I, like, persuaded my sister it wasn't, like, right to do something like that.\nAnd then... like, I took my sister to the Channeling Chamber.Judge:\nHmm... Yes, now I see. And you have given us a clear reason for why you didn't notice the blood.Ini:\nYou think? Like, thanks, gramps!Judge:\nAre you satisfied, Mr. Wright?Phoenix:\n...Judge:\nAlright, I guess not... Very well. You may question the witness.Cross Examination",
      "testimonies": [
        {
          "testimony": "Like, the Side Room was, like, kinda dark, you know?",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "So like, the costume is, like, purple, right? The blood totally blended right in.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "And I, like, persuaded my sister it wasn't, like, right to do something like that.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "And then... like, I took my sister to the Channeling Chamber.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "I, like, didn't see anyone on the way to, like, the Channeling Chamber.",
          "person": "Ini",
          "present": [
            "Sacred Urn",
            "Pearl Fey"
          ],
          "source": {
            "evidence_span": "Under repair in the hallway until police came.",
            "testimony_span": "I, like, didn't see anyone on the way to, like, the Channeling Chamber",
            "explanation": "Pearl Fey was repairing the urn in the hallway, so the witness would have had seen her if she did pass by.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty1": "medium",
            "difficulty2": "hard"
          }
        }
      ],
      "noPresent": false,
      "difficulty": "medium",
      "is_self_contained": "yes"
    },
    {
      "category": "cross_examination",
      "newContext": "-- After the Murder, Pt.2 --Ini:\nLike, the Side Room was, like, kinda dark, you know?Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nReally? Because I thought it was pretty bright inside that room.\nvon Karma:\n\nvon Karma:\nDon't push your subjective opinions onto this court.\nIni:\nLike, that's right!\nPhoenix:\nUm, excuse me, but how is my statement any more subjective than Ms. Miney's?\nvon Karma:\nYou are such a hopeless cause. Witness, you may feel free to ignore this trite little man.\nIni:\nLike, OK.\nPhoenix:\n(Uuugh... Can't breathe... Let me outta here...)Ini:\nSo like, the costume is, like, purple, right? The blood totally blended right in.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou... didn't see the blood...?\nIni:\nLike, yeah.\nPhoenix:\nBut she must have had the gun with her at that time as well.\nIni:\n...! That's um...\nPhoenix:\nAre you going to tell me next that you didn't notice the gun either!?\nIni:\nI, like, totally didn't. All I was looking at was, like, her face...\nJudge:\nHmm...\nvon Karma:\n... Continue.Ini:\nAnd I, like, persuaded my sister it wasn't, like, right to do something like that.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAnd what was your sister, Ms. Mimi Miney, like at the time?\nIni:\nWell, she was, like, totally flipped out 'cause she just shot Dr. Grey... But, I think, like, she knew. She, like, said she did something really bad. And, like, she said she wanted to go with me to, like, apologize to Ms. Morgan.\nPhoenix:\nDid Mimi's spirit really say all that to you...?\nIni:\nLike, yeah...Press (after pressing fourth statement, before adding statement)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAnd what was your sister, Ms. Mimi Miney, like at the time?\nIni:\nWell, she was, like, totally flipped out 'cause she just shot Dr. Grey... But, I think, like, she knew. She, like, said she did something really bad. And, like, she said she wanted to go with me to, like, apologize to Ms. Morgan.\nPhoenix:\nDid Mimi's spirit really say all that to you...?\nIni:\nLike, yeah...\nPhoenix:\nMay I ask you one more thing, Ms. Miney?\nIni:\nLike, sure.\nPhoenix:\nWas there anything you found strange, unusual, or just out of place?\nIni:\nSomething out of place? Huh? Like, when do you mean?\nPhoenix:\nUh, when...? Um... When you...\n\n\n\nwere in the Side Room.\n\n\n\n\n\n\n\nPhoenix:\nI'm talking about when you were in the Side Room, of course!\nIni:\nUm... Like, no, nothing strange.\nPhoenix:\n(Hmm... What should I do...?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nThink harder! I know you can remember something!\nIni:\nI, like, totally can't!\nvon Karma:\nJust give up already, Mr. Phoenix Wright.\nPhoenix:\n(I wonder if I put too much faith in Ini's ability to do anything with that brain...)\nLeads back to cross-examination\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(Even if I push her, this is probably a dead end... I should search for something stronger to hook her with.)\nJudge:\n...Hmm... Well, if the defense is finished, please continue with your testimony.\nIni:\nLike, OK.\nLeads back to cross-examination\n\n\n\n\n\nwere going to the crime scene.\n\n\n\n\n\n\n\nPhoenix:\nI'm talking about when you were going to the Channeling Chamber, of course!\nIni:\nUm... Like, no, nothing strange.\nPhoenix:\n(She answered rather quickly... Now what...?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nThink harder! I know you can remember something!\nIni:\nI, like, totally can't!\nPhoenix:\nThat's not good enough! You have to explain yourself clearly to this court!\nJudge:\nHmm... Do you think, Mr. Wright, that whether or not there was something odd on the way to the Channeling Chamber is all that important?\n\n\n\nIt's very important.\n\n\n\n\n\n\n\nPhoenix:\nI ask because it is VERY important! (...Not that I know where I'm going with this...)\nJudge:\nVery well. Ms. Miney, if you will, please include a statement about this in your testimony.\nIni:\nLike, I don't get why, but, OK.\nAdds statement \"I, like, didn't see anyone on the way to, like, the Channeling Chamber.\"\n\n\n\n\nIt's not that important.\n\n\n\n\n\n\n\nPhoenix:\n...Actually, I really have no idea!\nJudge:\nThen don't say it like you know what you're talking about!\nvon Karma:\nThis has been the most extravagant waste of time that I've ever seen.\nJudge:\nLet's continue on with the testimony.\nLeads back to cross-examination\n\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(Even if I push her, this is probably a dead end... I should search for something stronger to hook her with.)\nJudge:\n...Hmm... Well, if the defense is finished, please continue with your testimony.\nIni:\nLike, OK.\nLeads back to cross-examination\n\n\n\n\n\narrived at the crime scene.\n\n\n\n\n\n\n\nPhoenix:\nI'm talking about when you arrived at the Channeling Chamber, of course!\nIni:\nUm... Like, no, nothing strange.\nPhoenix:\n(Hmm... What should I do...?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nThink harder! I know you can remember something!\nIni:\nI, like, totally can't!\nvon Karma:\nJust give up already, Mr. Phoenix Wright.\nPhoenix:\n(I wonder if I put too much faith in Ini's ability to do anything with that brain...)\nLeads back to cross-examination\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(Even if I push her, this is probably a dead end... I should search for something stronger to hook her with.)\nJudge:\n...Hmm... Well, if the defense is finished, please continue with your testimony.\nIni:\nLike, OK.\nLeads back to cross-examinationIni:\nAnd then... like, I took my sister to the Channeling Chamber.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas your sister calm by that time?\nIni:\nLike, I guess so... I guess maybe, like, taking her revenge on Dr. Grey, like, made her feel a lot better...\nvon Karma:\nI'd like to feel a lot better too... Mr. Phoenix Wright. The sooner the better...\nPhoenix:\n(She says with her whip at the ready...)\nIni:\nAnd, like, Ms. Morgan was the only one in the Channeling Chamber, you know?Press (after pressing third statement, before adding statement)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWas your sister calm by that time?\nIni:\nLike, I guess so... I guess maybe, like, taking her revenge on Dr. Grey, like, made her feel a lot better...\nvon Karma:\nI'd like to feel a lot better too... Mr. Phoenix Wright. The sooner the better...\nPhoenix:\n(She says with her whip at the ready...)\nIni:\nAnd, like, Ms. Morgan was the only one in the Channeling Chamber, you know?\nPhoenix:\nMay I ask you one more thing, Ms. Miney?\nIni:\nLike, sure.\nPhoenix:\nWas there anything you found strange, unusual, or just out of place?\nIni:\nSomething out of place? Huh? Like, when do you mean?\nPhoenix:\nUh, when...? Um... When you...\n\n\n\nwere in the Side Room.\n\n\n\n\n\n\n\nPhoenix:\nI'm talking about when you were in the Side Room, of course!\nIni:\nUm... Like, no, nothing strange.\nPhoenix:\n(Hmm... What should I do...?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nThink harder! I know you can remember something!\nIni:\nI, like, totally can't!\nvon Karma:\nJust give up already, Mr. Phoenix Wright.\nPhoenix:\n(I wonder if I put too much faith in Ini's ability to do anything with that brain...)\nLeads back to cross-examination\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(Even if I push her, this is probably a dead end... I should search for something stronger to hook her with.)\nJudge:\n...Hmm... Well, if the defense is finished, please continue with your testimony.\nIni:\nLike, OK.\nLeads back to cross-examination\n\n\n\n\n\nwere going to the crime scene.\n\n\n\n\n\n\n\nPhoenix:\nI'm talking about when you were going to the Channeling Chamber, of course!\nIni:\nUm... Like, no, nothing strange.\nPhoenix:\n(She answered rather quickly... Now what...?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nThink harder! I know you can remember something!\nIni:\nI, like, totally can't!\nPhoenix:\nThat's not good enough! You have to explain yourself clearly to this court!\nJudge:\nHmm... Do you think, Mr. Wright, that whether or not there was something odd on the way to the Channeling Chamber is all that important?\n\n\n\nIt's very important.\n\n\n\n\n\n\n\nPhoenix:\nI ask because it is VERY important! (...Not that I know where I'm going with this...)\nJudge:\nVery well. Ms. Miney, if you will, please include a statement about this in your testimony.\nIni:\nLike, I don't get why, but, OK.\nAdds statement \"I, like, didn't see anyone on the way to, like, the Channeling Chamber.\"\n\n\n\n\nIt's not that important.\n\n\n\n\n\n\n\nPhoenix:\n...Actually, I really have no idea!\nJudge:\nThen don't say it like you know what you're talking about!\nvon Karma:\nThis has been the most extravagant waste of time that I've ever seen.\nJudge:\nLet's continue on with the testimony.\nLeads back to cross-examination\n\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(Even if I push her, this is probably a dead end... I should search for something stronger to hook her with.)\nJudge:\n...Hmm... Well, if the defense is finished, please continue with your testimony.\nIni:\nLike, OK.\nLeads back to cross-examination\n\n\n\n\n\narrived at the crime scene.\n\n\n\n\n\n\n\nPhoenix:\nI'm talking about when you arrived at the Channeling Chamber, of course!\nIni:\nUm... Like, no, nothing strange.\nPhoenix:\n(Hmm... What should I do...?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nThink harder! I know you can remember something!\nIni:\nI, like, totally can't!\nvon Karma:\nJust give up already, Mr. Phoenix Wright.\nPhoenix:\n(I wonder if I put too much faith in Ini's ability to do anything with that brain...)\nLeads back to cross-examination\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(Even if I push her, this is probably a dead end... I should search for something stronger to hook her with.)\nJudge:\n...Hmm... Well, if the defense is finished, please continue with your testimony.\nIni:\nLike, OK.\nLeads back to cross-examinationIni:\nI, like, didn't see anyone on the way to, like, the Channeling Chamber.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nTry to remember that time!\nIni:\n... Oh! Like, I remember! I remember, like, I totally didn't see anyone on the way.\nPhoenix:\n(Hmm... I guess this really is a dead end...)\nMia:\nSomething you finally pull out of a witness is never a dead end, Phoenix.Present Sacred Urn\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nI've finally found the fault, or I guess in your case, the \"crack\" in your perfect lie.\nIni:\n...\nPhoenix:\nTake a look at this urn.\nIni:\nLike, urn...?\nPhoenix:\nThere are cracks. Do you see them?\nIni:\nS-So? Like, what does that prove?\nvon Karma:\n\nvon Karma:\nWho cares about some worn-out old urn!?\nIni:\nLike, yeah. I already, like, said I didn't see, like, anyone on the way to the Channeling Chamber. I didn't, like, totally say anything about, like, an urn, did I?\nPhoenix:\nIt looks like you still don't understand. I propose that if you had really been walking along the Winding Way at that time, there was no way you could not have seen this person!\n\n\n\nPresent Pearl Fey profile\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"I'd like to introduce someone to you.\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nOops, silly me. Slip of the finger.\nJudge:\nM-Mr. Wright. You need to keep control of that finger of yours.\nPhoenix:\n...As I thought, this is the wrong piece of evidence. Oww!\nvon Karma:\nAn irresponsible lawyer has no place in this court! I suggest you go home!\nPhoenix:\n(Oww... So it's come down to a blunt \"go home\"...)\nMia:\nDon't over-think this. All you need to do is remember what happened yesterday.\nLeads back to:\n\"I propose that if you had really been walking along the Winding Way at that time,\"\n\n\nPhoenix:\nI'd like to introduce someone to you. This is Ms. Morgan Fey's daughter, Pearl Fey.\nJudge:\nY-Yes...? And how is this child relevant...?\nPhoenix:\nIt just so happens that at the time of the murder, Pearl was playing in the center garden.\nJudge:\nOh...\nPhoenix:\nAnd she just happened to break this urn.\nJudge:\nOh... OHHH!\nvon Karma:\nW-Wait! She... broke the urn...?\nPhoenix:\nYup. She accidentally knocked it over with her ball!\nIni:\nNnaaawrr!\nLeads to:\n\"And Pearl was the one who put it back together...\"Present Pearl Fey profile\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou say that you didn't see anyone on the way to the Channeling Chamber... However, that is impossible!\nIni:\n...Like, what you do mean?...\nPhoenix:\nI'd like to introduce someone to you. This is Ms. Morgan Fey's daughter, Pearl Fey.\nvon Karma:\nInteresting, you have a semi-intelligent look on your face. So? What about this child?\nPhoenix:\nIt just so happens that at the time of the murder, Pearl was playing in the center garden.\nvon Karma:\nThe garden...?\nPhoenix:\nYup! Which means anyone walking through the area would have to have seen her! So, Ms. Miney, what do you have to say to that!?\nIni:\nNnaaawrr!\nvon Karma:\n\nvon Karma:\nAs the court can see... she's a bit of an airhead. Also, she was leading her \"sister\" at that time. Do you honestly think she would have noticed a simple child playing!? Preposteous!\nPhoenix:\n\nPhoenix:\nIt's not preposterous, and I can prove it!\nvon Karma:\nWh-What sort of foolish...\nPhoenix:\nThere is no way someone walking along the Winding Way could not have noticed Pearl!\n\n\n\nPresent Sacred Urn\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"This urn is my proof.\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nOops, silly me. Slip of the finger.\nJudge:\nM-Mr. Wright. You need to keep control of that finger of yours.\nPhoenix:\n...As I thought, this is the wrong piece of evidence. Oww!\nvon Karma:\nAn irresponsible lawyer has no place in this court! I suggest you go home!\nPhoenix:\n(Oww... So it's come down to a blunt \"go home\"...)\nMia:\nDon't over-think this. All you need to do is remember what happened yesterday.\nLeads back to:\n\"There is no way someone walking along the Winding Way could not have noticed Pearl!\"\n\n\nPhoenix:\nThis urn is my proof.\nvon Karma:\nAn old, cracked clay pot? What is that going to prove?\nPhoenix:\nDo you know why it's cracked? It's because Pearl broke it! That's why!\nJudge:\nShe broke the urn...? Yeow!\nvon Karma:\nWhy... Why do I feel like you're about to ruin my beautiful day...?\nPhoenix:\nThis urn was broken around the time the channeling started!\nIni:\nAh!\nLeads to:\n\"And Pearl was the one who put it back together...\"Phoenix:\n(No good. I can't find anything wrong...)Mia:\nPhoenix, the Judge believes this testimony. If you don't find some sort of hitch in her statement...Phoenix:\nHe'll end the trial... I know...Mia:\nWe have to give it another shot! It doesn't matter how many times we listen. We can't give up!Phoenix:\nAnd Pearl was the one who put it back together... ...while sitting right in the middle of the Winding Way!Ini:\nWH-WHAAAAAAAAAAAAAT!?Phoenix:\nMs. Miney.Ini:\n...!Phoenix:\nPearl was there, in the Winding Way at that time. She was hard at work, putting the pieces of the urn back together, you see. If you couldn't see that while you were walking, I'd have to declare you legally blind!Ini:\nG...Grrrrr...Phoenix:\nI think I have sufficiently proven one thing, Ms. Miney. You are a masterful liar!Ini:\nArghnnn!Judge:\nMr. Wright! You need to watch what you say!Phoenix:\nThe one who needs to watch what she's saying is the witness! So, Ms. Miney! Tell us the truth!Ini:\nA-About what!?Phoenix:\nAbout what!? About where you really were at the time of the murder, of course!von Karma:von Karma:\nThe witness just testified about that!Ini:\nTh-That's right! I was, like, sleeping in the Side Room...Phoenix:\n(...Can I really believe her? Was she really sleeping in the Side Room...!?)Yeah, I guess so.\n\n\n\n\n\n\n\nPhoenix:\nYeah, I guess so. Sorry, my mistake.\nJudge:\nVery well. Now, then, let's proceed.\nMia:\nWait! Phoenix!\nPhoenix:\nWh-What? Did I miss something again?\nMia:\nYou shouldn't let up on this line of questioning.\nPhoenix:\nHuh? Why not?\nMia:\nWho is the only person you didn't see with your own eyes at the time of the murder?\nPhoenix:\nIt was Ini Miney, correct?\nMia:\nWhich means, you can safely assume... She is the real murderer.\nPhoenix:\nThat's a pretty daring assumption...\nMia:\nBut it's the most obvious, isn't it? I mean, is there anyone else?\nPhoenix:\nWell, no, I guess not.\nMia:\nIt's worth a shot, even if it's in the dark. So, let's try to prove that Ms. Miney was not in the Side Room at the time!\nPhoenix:\n(Umm, this is bluff number...? We've done this so many times in this case I've lost count.)\nLeads to:\n\"Your lies end here!\"There is no way!\n\n\n\n\n\n\n\nLeads to:\n\"Your lies end here!\"Phoenix:\nYour lies end here!Ini:\nWh-What do you!?Phoenix:\nThe witness says that during the actual murder, she was asleep in the Side Room. And I say that's not possible, because there is clearly a contradiction here!Judge:\nA contradiction...!? Where is this contradiction!?It's in her testimony just now.\n\n\n\n\n\n\n\nLeads to:\n\"Earlier in your testimony, Ms. Miney, you made the following statement.\"It's in the evidence.\n\n\n\n\n\n\n\nPhoenix:\nThe answer is in the Court Record!\nJudge:\nWh-What!?\nvon Karma:\nHmph. Planning to throw out another irrelevant piece of evidence?\nJudge:\nVery well. The court will see this evidence...\nMia:\nWait!\nPhoenix:\nM-Mia!\nMia:\nI don't know what you plan on showing to the court, but I can guarantee you the answer is not there. Just this once, I'll lend you a hand. Now, rethink your answer.\nPhoenix:\nA-Alright...\nJudge:\nMr. Wright. What is your answer?\nPhoenix:\n(Argh! OK, time to add another bluff to the pile...)\nLeads back to:\n\"The witness says that during the actual murder, she was asleep in the Side Room.\"Help me, Mia!\n\n\n\n\n\n\n\nPhoenix:\n(Hmm, I may have overreached on this one... Is there really a contradiction somewhere...?)\nMia:\nDon't worry, you're on the right path, Phoenix. It might be a little hard for you to see the contradiction, but it's there. So, just this once, do you want me to help you out?\n\n\n\nYes, please help me!\n\n\n\n\n\n\n\nPhoenix:\nPlease, I need your help right now!\nMia:\nH-Hold on... First, calm down, Phoenix. ...Good. ...That girl... She slipped up with her words.\nPhoenix:\n...Her words?\nMia:\nIf she really was in the Side Room the entire time, then she just testified about something she shouldn't have any knowledge of.\nPhoenix:\nA-And what is that!?\nMia:\nThe rest is for you to figure out on your own.\nJudge:\nMr. Wright. What is your answer?\nPhoenix:\n(Argh! OK, time to add another bluff to the pile...)\nLeads back to:\n\"The witness says that during the actual murder, she was asleep in the Side Room.\"\n\n\n\n\nNo, I think I can do it.\n\n\n\n\n\n\n\nPhoenix:\n(Hmm, it's \"hard for me to see\"...? I can't just accept her help without thinking it through myself!)\nMia:\nHa ha, that's the spirit. Give it another try.\nJudge:\nMr. Wright. What is your answer?\nPhoenix:\n(Argh! OK, time to add another bluff to the pile...)\nLeads back to:\n\"The witness says that during the actual murder, she was asleep in the Side Room.\"Phoenix:\nEarlier in your testimony, Ms. Miney, you made the following statement.Ini:\nAnd, like, Ms. Morgan was the only one in the Channeling Chamber, you know?Phoenix:\nIt's true that at the time, both myself and Ms. Hart were not there. We had gone to call the police.Ini:\n...S-So? Like, what does that, like, have to do with anything!?Phoenix:\nIt's very simple. Ms. Miney, how did you know that fact?Ini:\n...H-How...?Phoenix:\nI concede that Ms. Fey was the only person in the Channeling Chamber. However, someone who was \"asleep\" in the Side Room could not have known that!Ini:\n...!Phoenix:\nWhich means, Ms. Miney! You did, in fact, go to the Channeling Chamber. But you didn't go there by way of the Winding Way! (Changed from [However, you didn't go there by way of the Winding Way!] in the original release)Ini:\nGwaaaaaaaaaaaa!Judge:\nB-But! Look at the manor guidemap! If one were to go between the Side Room and the Channeling Chamber, one would have to use the Winding Way!Phoenix:\nYes, that's right, Your Honor. Which is why... Which is why I ask this very important question! Where was the witness at the time of the murder!?Ini:\n...Umm... Urrrr...Phoenix:\nMs. Miney! Please answer the question!von Karma:von Karma:\n... Don't ask a question off of a baseless assumption, if you please...Phoenix:\n...!von Karma:\nWell, I suppose since you've put it out on the table, Mr. Phoenix Wright... you might as well answer the question for us! Where was the witness at the time of the murder!?Mia:\nNow's your chance, Phoenix.Phoenix:\nYeah!Mia:\nThe only person who could have killed Dr. Grey was Ini Miney! So now is the time to prove it!Judge:\nNow, then, Mr. Wright. Let's hear your answer. Where was the witness when the murder took place?Present Channeling Chamber\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Ms. Miney was here, of course!\"Present anywhere else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nShe was here...\nMia:\nPhoenix! Did you turn the map upside down!?\nPhoenix:\n(...Oww... Sh-She slapped me on the wrist...)\nMia:\nThere is no way she could've committed the crime from there!\nJudge:\n*ahem* You two! Keep disrupting this court, and this trial is over. Is that clear!?\nPhoenix:\nY-Yes, Your Honor... Sorry...\nLeads back to:\n\"Now, then, Mr. Wright. Let's hear your answer.\"Phoenix:\nMs. Miney was here, of course!Judge:\nWha... But... But that's... the Channeling Chamber...von Karma:\nIsn't that the crime scene!?Phoenix:\nThat's right! Ms. Miney was at the scene of the crime!Judge:\nOrder! Order! Order! ...That's... Why, that is... Uwaah!von Karma:\nMr. Phoenix Wright! Have you lost your mind!? Yesterday's testimony established that only the victim and the defendant were in the Chamber when the channeling started!Judge:\nYes! Yes, that is correct! Please, explain yourself, Mr. Wright!Phoenix:\nSimple. Ms. Ini Miney was hiding at the scene of the crime.Ini:\nI... I was hiding!? Where!? Like, where was I hiding!?Present area behind folding screen\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Here, of course.\"Present anywhere else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nMs. Miney was hiding here! Owww!\nvon Karma:\nIf you're going to tell a joke, at least make it one I'll laugh at.\nIni:\nHah! Go home, boy, and look up what \"hiding\" means!\nPhoenix:\n(Argh... Looks like I'm going to have to one up her!) Yeah, count on it!\nMia:\nPhoenix, you can't lose your cool like this! ...And, grow up.\nPhoenix:\nEh?... Oh, um, sorry, Chief...\nvon Karma:\nYou still haven't learned your lesson, have you, Mr. Phoenix Wright!?\nLeads back to:\n\"Where!? Like, where was I hiding!?\"Phoenix:\nHere, of course.Judge:\nB-Behind the folding screen? Aah!von Karma:\nDon't make me say this again! Recall yesterday's testimony!Lotta:\nThere ain't no way anyone was hangin' out behind that foldin' screen!Ini:\nSee! You stupid jerk! Quit being so quick to pin it on me, slimeball!Judge:\n...N-Now, now... Ms. Miney... One so young as you shouldn't be saying...Ini:\nShut it, gramps. As if you know exactly how old I am!Judge:\nI-I'm sorry!Phoenix:\n(Looks like the pipe's about to burst... Guess I should help it along...) The witness was hiding behind the folding screen... With the help of this!Present Clothing Box\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Ms. Miney!\"Present anything else\n\n\n\n\n\n\n\nPhoenix:\n\nIni:\nYeah, you go ahead and use that to hide!\nvon Karma:\nAnd you should hide in shame until you die!\nPhoenix:\n(What's with these two...? It's like they did a mind meld all of a sudden...)\nMia:\nDon't let them affect you! Just think about the correct answer.\nIni:\nWhat's wrong, boy!? Come on, say something, you loser!\nLeads back to:\n\"...N-Now, now... Ms. Miney... One so young as you shouldn't be saying...\"Phoenix:\nMs. Miney! How you were able to hide at the scene of the crime is very simple! You were hiding inside this box!Ini:\nAaah! Th-Th-That tiny little box!? No person could fit in that!Phoenix:\nSorry, but your theory has already been disproved. (Lotta disproved you when she was hiding from me in it.)Ini:\nUmm...!von Karma:von Karma:\nBut that clothing box was in the Side Room, right!? Which means it has nothing to do with the murder at all!Ini:\nTh-That's right! I was sleeping there, so I should know! That clothing box was there in the Side Room, the whole time!Judge:\nHmm... Mr. Wright. Do you think you can prove where the clothing box was at the time of the crime?No, I can't.\n\n\n\n\n\n\n\nPhoenix:\nHmm... It's kind of hard to prove...\nMia:\n...\nPhoenix:\nUm... I guess by that look, there is a way to prove it?\nMia:\nIf you look in the Court Record.\nPhoenix:\n(Guess I should take a look at the Court Record...)\nJudge:\nWell, then. If there are...\nPhoenix:\n\nPhoenix:\nP-Please wait... I said it was hard, but I didn't say it was impossible to prove!\nJudge:\nThen stop puffing up your feathers and hurry up!\nLeads to:\n\"And now, I present the piece of evidence that will prove\"Yes, I can with some evidence.\n\n\n\n\n\n\n\nLeads to:\n\"And now, I present the piece of evidence that will prove\"Phoenix:\nAnd now, I present the piece of evidence that will prove this clothing box was at the scene of the crime when the murder took place!Present Folding Screen or Clothing Box\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Take a look at this clothing box.\"Present anything else\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\n..............................\nPhoenix:\n...Um... Your Honor...?\nJudge:\nI... um, fell asleep...\nMia:\nYou got lucky, Phoenix! Now give it another shot!\nPhoenix:\nA-Alright...\nLeads back to:\n\"And now, I present the piece of evidence that will prove\"Phoenix:\nTake a look at this clothing box.Ini:\nYou're soooo stupid. As if there's any sort of evidence in that old thing.Judge:\n...! Th-This... What on earth...!? Mfph!von Karma:\nI don't have time for you to sit there surprised. Hurry up and say it already!Judge:\nTh-There's a hole! About 8 inches off the ground!Phoenix:\nHmm, a hole about 8 inches off the ground. Where have we heard that before...?von Karma:\n...The folding screen... It had a hole at the same height...Phoenix:\nThat's right! I hope this has opened your eyes to what happened! At the time of the shooting, the clothing box was sitting behind the folding screen. Which is why the bullet from the pistol hit both the box and the folding screen! It went through the screen, and then into the box.Ini:\n...Nnngh...!Phoenix:\nMs. Miney! You were hiding behind the folding screen, waiting for your chance! Yes, for your chance to kill Dr. Grey!Ini:\nAaaaaaaaaaaaah!Judge:\nOrder! Order! ...So what you are saying--von Karma:von Karma:\nTh-Then... Mr. Phoenix Wright! What about this picture!? Are you saying that the person in this photo... is Ms. Ini Miney!?Phoenix:\nThat is exactly what I am saying! Ms. Ini Miney! You were hiding inside this clothing box all along! And you wore a medium's costume to masquerade as Maya Fey!Judge:\nT-To masquerade as Maya Fey!?Phoenix:\nShe had it planned from the very beginning! She would kill Dr. Grey, and pin the blame on my client!Ini:\n...N...No... S-Stop...von Karma:\n...I can't stand to listen to any more of this foolishness! If that's the case, Mr. Phoenix Wright, then I have a proposition! This whole idea that the witness moved the clothing box to the crime scene, pretended to be the defendant, killed the victim, and then fled the scene of the crime; It's not possible for one person to do all that by herself!Correct. It's not possible.\n\n\n\n\n\n\n\nLeads to:\n\"It really is impossible.\"No, it is possible.\n\n\n\n\n\n\n\nPhoenix:\nI'm sure it's possible if you were to try! Ow!\nvon Karma:\nI don't want to hear \"if\"! If you're going to give me \"if\", then give me some proof along with it. Where did Ini Miney get the costume then!? How about the wig!?\nPhoenix:\nUh, I wasn't talking about that exact point... I meant, people, humans. If we want to do something bad enough, then...\nJudge:\nThat's enough! Beyond simply proposing that it is possible for one person to commit this crime, it is the duty of a lawyer to back up his or her claims.\nIni:\nYeah, it's your duty!\nJudge:\nIf you can't do that, then your proposal falls flat.\nIni:\nYeah, it totally falls flat!\nPhoenix:\n(...Why... Why do you have to hurt me so...?)\nMia:\nIt's alright, Phoenix.\nPhoenix:\nHuh?\nMia:\nIt isn't possible for one person to commit this crime, but...\nPhoenix:\n(... Ack! That's... That's right!)\nLeads to:\n\"It really is impossible.\"Phoenix:\nIt really is impossible. For one person to do all the preparations, that is. Owww!von Karma:\nNeed I remind you!? The foolish receive no mercy...Phoenix:\nW-Wait! Ms. von Karma... You said it was not possible for \"one person\", correct?von Karma:\nWh--! Y-You can't be serious...Ini:\n...*huff*...*huff*...Phoenix:\nMs. Miney! You had an accomplice!Present Morgan Fey profile\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"...Grr... This person...!\"Present anything else\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\nThe accomplice was...?? Any thoughts, Ms. von Karma?\nvon Karma:\n... I don't even want to waste the energy to raise my whip. His lady friend can deal with him.\nMia:\nReally, Phoenix! You even got Ms. von Karma to give up on you too!\nPhoenix:\n...\"Too\"?\nMia:\nAs in, \"me too\".\nPhoenix:\nO-Oh... Okay, I'll think more carefully this time...\nLeads back to:\n\"Ms. Miney!\"Ini:\n...Grr... This person...!Phoenix:\nIf it wasn't someone from Kurain Village, you couldn't have gotten the costume. And if it wasn't someone from the Fey household, you wouldn't have that box to use.von Karma:\nMorgan... Fey!Judge:\nIsn't that the wonderful lady witness we had earlier!?Phoenix:\nWhat do you have to say to this, Ms. Miney!?Ini:\n...Grrr... Grrrrrrrrrrr...Phoenix:\nYou shot Dr. Grey with your own two hands! Do you deny it!?Ini:\nAaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaah!Phoenix:\nI think this is what really happened. The murderer had planted herself at the scene of the crime long beforehand. Dressed in a medium's costume and wearing a wig, she pretended to be the defendant. And then, the channeling started. The murderer crept silently towards the other two, both of whom had their eyes closed. ...First, she drugged Maya Fey with a strong sleeping agent. Then, she stabbed Dr. Grey with the knife! Next, she hid my client inside the clothing box... She did that so she could take Maya's place and frame her for the crime.Mia:\n...But that's when something unexpected happened.Judge:\nUnexpected...?Phoenix:\nYes.*bang!*Phoenix:\nDr. Grey was actually not yet dead! With the last of his strength, he fired a shot at his attacker! And that is why the hole in the folding screen was so low to the ground! The murderer then took the gun from Dr. Grey, and...*bang!*Judge:\nAfter that, you and the other lady thought to break into the room...?Phoenix:\nYes, a gunshot is certainly something you wouldn't expect to hear. Which is why, upon hearing the shots, we forced our way into the Channeling Chamber.*klik*Phoenix:\nMs. Miney... She immediately covered her own costume with blood...*klik*Phoenix:\nAnd pretended to be Maya Fey.von Karma:\nB-But! That sort of deception would have been easy to see through!Phoenix:\nWhich is precisely why Ms. Morgan Fey chased us out.Morgan:\nPlease leave this area to me. Go quickly and inform the police! Hurry! Before there are more victims here!Judge:\nWh-What is one supposed to say...?Phoenix:\nThis is the real truth behind this murder....Ha... ...Ahahahaha...Judge:\nWh-Who is that!? Laughing at a time like this...!? Ack!von Karma:\nOh, you simpleminded fools. I'm sorry, are you still by chance, evolving?Phoenix:\nWh-What is it this time...?Judge:\nM-Ms. von Karma... Surely...von Karma:\nOf course it was me! Do you really think someone of Von Karma blood would lose due to something this petty?Phoenix:\nWHAT IN THE WORLD!?von Karma:\nMr. Phoenix Wright! Your argument is flawed in one very crucial area!Phoenix:\nAnd that is...?von Karma:\nIf this witness is the real murderer... why would she go through all this trouble?Phoenix:\n...Huh?von Karma:\nWorking together with a medium, pretending to be one, putting on this whole act... What reason would she have to do such foolish things?Phoenix:\nEh? Well, that's... Uh...Ini:\nYeah, that's right! That's exactly what I was gonna say!von Karma:\nOh, and one other thing. Why would Ms. Ini Miney want to kill Dr. Grey? Where is her motive?Ini:\nYeah! That's exactly what I wanted to say too! Yeah! Motive! I don't have a motive!Phoenix:\nA... motive... That's... (I can't say she has no motive here! I have to think of a motive now! What is her reason for wanting Dr. Grey dead...?) The reason you wanted Dr. Grey dead is this!Present Newspaper Clipping 2 or Mimi Miney profile\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"...Hah!\"Present anything else\n\n\n\n\n\n\n\nPhoenix:\n\nIni:\nHo-hum, ho-hum... Is this a word search? I'm having a tough time finding the word \"motive!\"\nJudge:\nUuugh... My breathing is becoming labored...\nMia:\nMy eyesight is failing me...\nvon Karma:\nMakes you not want to get old, doesn't it, Mr. Phoenix Wright?\nPhoenix:\n(...Ack! I've got to take my time and think carefully about this...)\nMia:\nPhoenix, think back! What kind of ax would Ini have to grind with Dr. Grey? ... There is only one reason, right?\nPhoenix:\n(...Only one...?)\nLeads back to:\n\"A... motive... That's... (I can't say she has no motive here!)\"Ini:\n...Hah! Just as I thought. You bore me with your silly answers, Phoenix Wright!Phoenix:\n(Just great. Now even SHE is calling me by my full name...)Ini:\nYou think I did this to get revenge for my sister's death?Phoenix:\nYes! Because through that accident, you suffered a lot of hurt and pain yourself!Ini:\nDon't be stupid! No one has proof that Dr. Grey drugged my sister, right? And you want to say I wanted to take revenge based on nothing?Judge:\nWh-What do you mean by that...?Ini:\nSenile, stupid gramps. ... I'm, like, going to explain, so, like, please listen, OK? It's been over half a year since I was discharged from the hospital. If I, like, wanted revenge, then, like, I wouldn't have waited this long. Um, and 'sides, like, the guy that thought of the spirit thing, was, like, Dr. Grey. It was, like, a total coincidence he asked me about it, you know?Phoenix:\n(She... She's back to her airhead persona...!) (Changed from [She... She's back to her airhead self...!] in the original release) H-However, you see-- Eeeowch!von Karma:\nPathetic, Mr. Phoenix Wright. You failed to support your own theory. ...The end.Judge:\nI think we have our answer, Mr. Phoenix Wright. What Ms. Miney has stated is very true. The revenge plan is overly complicated, and she has no motive in the first place. Furthermore, there is no reason for Ms. Morgan Fey to cooperate with this plan. You don't even have any truly decisive pieces of evidence to demonstrate your point.von Karma:\nTsk, tsk. So many faults, Mr. Phoenix Wright. You should really learn your place.Phoenix:\nNnghuuurk! (Wh-What happened!? I thought I had her for sure!...)Ini:\nHee hee... See, like, that's what I, like, told you!Phoenix:\n...?Ini:\nI hope you liked your slice of humble pie! (Changed from [I'm going to serve you a slice of humble pie!] in the original release)Judge:\nVery well, I now conclude the cross-examination of Ms. Ini Miney!???:Mia:\nYour Honor. Please, allow the defense one more minute.Judge:\nAlright.Mia:\nYou can't lose here. Have faith in yourself, Phoenix!Phoenix:\nMia...Mia:\nYes, it does sound like a ridiculously messed up plan for a murder, but you know, regardless, that girl trained for this crime.Phoenix:\n...R-Really?Mia:\n... Listen, Phoenix. Everything happens for a reason. There is a reason for why she had to kill Dr. Grey. And it is also the reason she had no choice but to kill him in this fashion.Judge:\nTime is up, Mr. Wright. Your final answer, please. If you want to say that you can prove Ms. Miney had a motive, then... why did she kill the victim in this way? Can you provide the reason?Phoenix:\n(...Can I... Can I really do this...?)Yes, I can.\n\n\n\n\n\n\n\nLeads to:\n\"I am not totally confident here, but I know that I must press on no matter what...\"No, I can't.\n\n\n\n\n\n\n\nLeads to:\n\"I am not totally confident here, but I know that I must press on no matter what...\"Phoenix:\n(I am not totally confident here, but I know that I must press on no matter what...)Mia:\nThat's right, Phoenix! Only you can do this now!Phoenix:\nI will show and substantiate the fact that Ms. Miney had a motive!Ini:\nHa ha ha. Too bad. You're too late! My cross-examination has already ended, after all. Eeek!von Karma:\n...Interesting. I'll let you have your chance, Mr. Phoenix Wright.Ini:\nWh-What!? Y-You're supposed to be on my side! Aiiiii!von Karma:\nA Von Karma only cares about the perfect win. As long as you have the will to fight, I will knock you down, Mr. Phoenix Wright!Phoenix:\n...von Karma:\nAnd I don't care if you are my witness! So help me, I will throw you out of my way! (Changed from [And I don't care if you are my witness! So help me, I will blow you out of my way!] in the original release)Ini:\nN-No way...Judge:\nVery well. The court will take a 5 minute recess. We will continue the cross-examination after we reconvene.Ini:\nH-Hey! W-Wait a sec, here!To be continued.June 22, 12:04 PMDistrict CourtDefendant Lobby No. 3Maya:\n...Is it really true... about my aunt...?Phoenix:\nI'm afraid so, Maya. There is no way Ini could've killed Dr. Grey by herself. And under the circumstances, there's no one else other than your aunt, Morgan.Maya:\nThat... That's terrible... Why? Why would my aunt...?Everything is going just as I predicted, Mr. Phoenix Wright.Phoenix:\nAck! Ms. von Karma!Maya:\nWhy are you doing this!? Why are you trying to take revenge on Nick!? Nick had nothing to do with what happened to your dad.von Karma:\nDon't you have something better to be worrying about? Say, your own situation?Maya:\nUgnn... ...Looking down on me, even though we're the same age...Phoenix:\nAre you done yet? You've caused me enough pain and suffering.von Karma:\nNot yet. My goal is to defeat you, and let the whole world know of your defeat.Phoenix:\n...But even if you do that, it won't bring your father back...von Karma:\n... Hmph. ...Whatever. In the meantime, let's bring this match to its conclusion. And then we'll know who the real winner is.June 22, 12:10 PMDistrict CourtCourtroom No. 2Judge:\nCourt will now reconvene. Mr. Wright.Phoenix:\nYes, Your Honor?Judge:\nCan you prove Ms. Ini Miney had a motive?Phoenix:\nYes, I believe I can. (Ini Miney and Dr. Grey have only one point of connection. And that is the car accident one year ago. The motive I'm looking for must be there...) Ms. Miney. Please testify to this court about your car accident last year.Ini:\nHuh? I thought, like, you wanted to, like, ask about my, like, motive. I, like, don't see the point in, like, bringing up the past.Judge:\nMs. Miney, if you please.Ini:\n...OK, OK. Like, I totally don't think it'll do any good, but...Witness Testimony-- Last Year's Accident --Ini:\nThat was... like, last year, in May.\nLike, something really bad had happened at, like, my sister's clinic around then...\nAnd like, the night of the accident, my sis was totally tired while she was driving.\nI was, like, totally pooped too, so I, like, fell asleep in the passenger's seat...\nI, like, woke up 'cause of a jolt, and, like, it was a sea of flames around me.\nI, like, opened the door and, like, got away.Judge:\nHmm... I think I've heard of this incident.Phoenix:\nIt was all the talk on the tabloid shows, day after day, last year.Judge:\nYes, and there was talk about Dr. Grey... drugging your sister...? Gwuugh!von Karma:\nThose were merely \"rumors\". ...Totally baseless gossip.Judge:\nHmm, yes... Mr. Wright, you may question the witness.Mia:\nRight now, it's impossible to prove that Dr. Grey did in fact drug Ms. Miney's sister.Phoenix:\nYeah... Which means I'll have to work this from another angle.Cross Examination",
      "testimonies": [
        {
          "testimony": "That was... like, last year, in May.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "Like, something really bad had happened at, like, my sister's clinic around then...",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "And like, the night of the accident, my sis was totally tired while she was driving.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "I was, like, totally pooped too, so I, like, fell asleep in the passenger's seat...",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "I, like, woke up 'cause of a jolt, and, like, it was a sea of flames around me.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "I, like, opened the door and, like, got away.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "I, like, didn't have my license, so, like, I couldn't take over driving for her.",
          "person": "Ini",
          "present": [
            "License Photo"
          ],
          "source": {
            "evidence_span": "Ini's photo for her driver's license",
            "testimony_span": "I, like, didn't have my license",
            "explanation": "Ini's photo for her driver's license suggests that she did have a license, contrary to what she clams.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "easy"
          }
        }
      ],
      "noPresent": false,
      "difficulty": "easy",
      "is_self_contained": "yes"
    },
    {
      "category": "cross_examination",
      "newContext": "-- Last Year's Accident --Ini:\nThat was... like, last year, in May.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nDidn't some sort of medical malpractice happen at your sister's hospital then...?\nIni:\nYeah, like, that was in May too. Like, the thing with all the patients dying was, like, May 2nd, and like, our accident was, like, on the 24th.\nPhoenix:\nTwo accidents back to back... Do you assume it's just a coincidence?\nIni:\nMy sis was, like, totally tired, so that's why, duh.Ini:\nLike, something really bad had happened at, like, my sister's clinic around then...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThat was the malpractice incident where 14 patients died, correct?\nIni:\nYeah.\nPhoenix:\nWhat was the cause of the mistake?\nIni:\nLike, I heard it was 'cause the medicines, like, got mixed up.\nPhoenix:\nWas that the fault of your sister, Mimi Miney?\nIni:\nLike, no way. Dr. Grey, like, wanted to blame it on my sis...\nvon Karma:\n\nvon Karma:\nThat incident has nothing to do with our murder here. Besides, the police report has already documented that it was entirely Mimi Miney's fault.\nPhoenix:\n(Which means as far as the \"real\" facts are concerned... Mimi Miney is the one who made the mistake...)\nIni:\nBut, like, it really wasn't my sis...Ini:\nAnd like, the night of the accident, my sis was totally tired while she was driving.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nShe was \"totally tired\"? You mean, exhausted?\nIni:\nLike, she had to talk to the police, and, like, was being investigated, like, every day. It was, like, a totally terrible situation.\nPhoenix:\nIt's no wonder, then, that the car accident happened, huh?\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nSo then, why didn't you ask to switch places?\nIni:\nHuh? Like, what are you talking about?\nPhoenix:\nI meant switch drivers. If your sister was so tired, then you should have switched with her.\nJudge:\nTrue, true.\nIni:\nAh, but like... I don't, like, have a driver's license...\nvon Karma:\nThis is news to me. I was not aware you didn't have your license, Ms. Miney.\nJudge:\nHmm... Ms. Miney, please amend your testimony.\nIni:\nLike, OK. Anyway...\nAdds statement \"I, like, didn't have my license, so, like, I couldn't take over driving for her.\"\n\n\n\n\nLeave her be\n\n\n\n\n\n\n\nPhoenix:\n(There's no point in asking her about her sister. I should be trying to find out more information about Ini!)\nIni:\nSo, like, can I go on?\nLeads back to cross-examinationPress (after adding statement)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYour sister... Mimi Miney, was she that exhausted?\nIni:\nLike, she had to talk to the police, and, like, was being investigated, like, every day. It was, like, a totally terrible situation.\nJudge:\nAh, if only you had your license and were able to drive for your sister.\nIni:\nY-Yeah... That was, like, too bad...\nvon Karma:\nNow, then, witness. Continue with your testimony.Ini:\nI was, like, totally pooped too, so I, like, fell asleep in the passenger's seat...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe accident happened at night, correct...?\nIni:\nYeah, like, it was at, like, 1 AM or so, I think. I had, like, a paper due, like, really soon... so, like, I hadn't slept and was working, like, real hard.\nvon Karma:\nSo it was because the two of you were so tired that this accident happened.Ini:\nI, like, woke up 'cause of a jolt, and, like, it was a sea of flames around me.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAnd your sister? What happened to her?\nIni:\nI... I didn't see her... The car was, like, totally black, and there was, like, a ton of smoke... I, like, totally had, like, no clue what was going on.Ini:\nI, like, opened the door and, like, got away.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nPlease tell us about your escape in more detail.\nIni:\nI... I, like, kept wanting to forget that time, so, like, I don't remember things about the accident in, like, details anymore...\nJudge:\nHmm, well, it's alright. No need to push yourself.\nIni:\nI think I, like, gave an interview after the accident. Like, that would probably be the most accurate, you know?\nPhoenix:\n(Hmm, if it's that article, then I've already got it...)Ini:\nI, like, didn't have my license, so, like, I couldn't take over driving for her.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAnd that's why you were in the passenger's seat?\nIni:\nLike, yeah. I was, like, at my college's research lab 'till, like, really late... So my sis was, like, giving me a ride home.\nPhoenix:\nI see...\nMia:\nPhoenix.\nPhoenix:\nY-Yes?\nMia:\nYou can't do this. You're being too easy on her.Present License Photo\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Ms. Miney. That was a lame lie just now.\"Phoenix:\n(There's got to be some sort of secret sleeping in this testimony...)Mia:\nYes, so let's find that one crushing contradiction and end this!Phoenix:\nMs. Miney. That was a lame lie just now.Ini:\nLike, what do you mean?Phoenix:\nI know you had a license back then! This is a photo you took for the express purpose of getting a driver's license!Ini:\nUmm...Judge:\nWhat is the meaning of this, Ms. Miney!?Ini:\nAh, um... Uh... That's... That's right! Y-Yeah, I had, like, a license... But... ... But I didn't get it until after the accident!Phoenix:\nNo, you had it. You had it at the time of the accident! Director Hotti... or the guy pretending to be him anyway, said so!Ini:\nWhat, are you talking about that perverted fake clinic director?Phoenix:\nYes, that perverted fake clinic director. And how did you know he was perverted. Eowch!von Karma:\nNo one cares. Witness. When did you receive your driver's license?Ini:\nLike, last November.Phoenix:\nWhat? N-N-November...?von Karma:\nThe accident happened last May. That's a half year lapse in time, Mr. Phoenix Wright.Phoenix:\nWh-Wh-Wh-Wh-What in the!?Judge:\nTh-Th-Th-Th-That's what happened, Mr. Wright! At the time of the accident, Ms. Miney did not have a driver's license.Phoenix:\nUuuuurk... OW!von Karma:\nCry, and my whip will accommodate.Judge:\nAnyway, without a license, the witness and her sister could not have switched drivers.Ini:\nI'm, like, glad you get it, but... like, even if I had my license, I, like, don't think my sis woulda, like, let me drive.Phoenix:\n(...Hmm...) Yeow!Mia:\nDon't just stand there \"hmm\"-ing to yourself!Phoenix:\nNot you too, Mia! With the whip... And the pain... And the oww...Mia:\nMs. Miney! Why do you think you would not have been allowed to drive anyway?Ini:\nEh? Um... That's because...Judge:\nI think this situation calls for a more detailed testimony. Ms. Miney, if you please.Ini:\nEh? Like, how annoying. Oops, like, sorry. Didn't mean to be mean...Witness Testimony-- I Wouldn't Be Allowed --Ini:\nLike, around that time, I was, like, really close to getting my license.\nMy sis was, like, this totally big fan of cars and, like, really valued them.\nShe, like, had just gotten this really shiny, bright red sports car.\nShe, like, would say things like, \"No way am I letting a newb drive my car!\"\nSo, like, that's why I ended up in the passenger's seat that night too.Judge:\nHmm... I see... A bright red car for sports... Now then, the defense may question the witness.Phoenix:\n(Hmm... I'm not terribly knowledgeable about cars, but...)Cross Examination",
      "testimonies": [
        {
          "testimony": "Like, around that time, I was, like, really close to getting my license.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "My sis was, like, this totally big fan of cars and, like, really valued them.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "She, like, had just gotten this really shiny, bright red sports car.",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "My sis' new car was, like, a totally special model from England.",
          "person": "Ini",
          "present": [
            "Newspaper Clipping 2"
          ],
          "source": {
            "evidence_span": "but I opened the right door and like, got out",
            "testimony_span": "a totally special model from England",
            "explanation": "A car from England has the driver side door on the right. If th witness got out from the right, she must have been the driver, not the passenger.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "common sense"
          }
        },
        {
          "testimony": "She, like, would say things like, \"No way am I letting a newb drive my car!\"",
          "person": "Ini",
          "present": []
        },
        {
          "testimony": "So, like, that's why I ended up in the passenger's seat that night too.",
          "person": "Ini",
          "present": [
            "Newspaper Clipping 2"
          ],
          "source": {
            "evidence_span": "but I opened the right door and like, got out",
            "testimony_span": "that's why I ended up in the passenger's seat",
            "explanation": "A car from England has the driver side door on the right. If th witness got out from the right, she must have been the driver, not the passenger.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "common sense"
          }
        }
      ],
      "noPresent": false,
      "difficulty": "common sense",
      "is_self_contained": "yes"
    }
  ]
}