{
  "previousContext": "",
  "characters": [
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Maya Fey",
      "age": "18",
      "gender": "Female",
      "description1": "My assistant and a disciple in the Kurain tradition of spirit channeling."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Dick Gumshoe",
      "age": "31",
      "gender": "Male",
      "description1": "Detective at the local precinct. In charge of the initial investigation."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Franziska von Karma",
      "age": "18",
      "gender": "Female",
      "description1": "A prosecutor in Germany since age 13, she has come to America to defeat me in court."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Max",
      "age": "21",
      "gender": "Male",
      "description1": "A \"fabulous\" magician famed for his aerial illusions. Accused of murder."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Regina Berry",
      "age": "16",
      "gender": "Female",
      "description1": "The idol of the Berry Big Circus and daughter to Russel Berry, the Ringmaster."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Russell Berry",
      "age": "52",
      "gender": "Male",
      "description1": "The victim and Ringmaster of the Berry Big Circus. Regina Berry's father."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Ben",
      "age": "31",
      "gender": "Male",
      "description1": "Real Name: Benjamin Woodman. A ventriloquist. Conversing with him is really tiring.",
      "description2": "Real Name: Benjamin Woodman. Without his puppet Trilo, Ben won't say much."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Moe",
      "age": "46",
      "gender": "Male",
      "description1": "Real Name: Lawrence Curls. The Ringmaster's old friend, a pleasant stooge of a clown."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Acro",
      "age": "26",
      "gender": "Male",
      "description1": "Real Name: Ken Dingling. A star acrobat currently undergoing rehabilitation.",
      "description2": "Real Name: Ken Dingling. Seriously injured both legs while training six months ago."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Bat",
      "age": "22",
      "gender": "Male",
      "description1": "Real Name: Sean Dingling. Bit on the head six months ago by Léon. Still in a coma."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "It's my all-important badge. It shows that I am a defense attorney."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Maya's Magatama",
      "type": "Other",
      "obtained": "Received from Maya Fey.",
      "description1": "Slightly translucent. It radiates softly with a mysterious light."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Crime Photo",
      "type": "Photographs",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "A picture of the crime scene. A person is lying on a case in the snow. There victim’s footprints leading to where he is are visible."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Silk Hat",
      "type": "Evidence",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "Made-to-order fedora that is a symbol of Max's fabulousness. Found at the crime scene."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Max G. Promo Poster",
      "type": "Other",
      "obtained": "Received from the Big Top - Ringmaster's Room.",
      "description1": "Emblazoned with Max's three famous symbols. A silk hat, cloak and white roses."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Ringmaster's Papers",
      "type": "Documents",
      "obtained": "Received from the Big Top - Ringmaster's Room.",
      "description1": "Documents related to Max's salary negotiations. He got an enormous raise 1 week ago."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Circus Map",
      "type": "Maps",
      "obtained": "Received from Moe.",
      "description1": "A map of the Berry Big Circus. The circus is depicted on the left. The ring master’s room and cafeteria are on the northeast of the circus. To the right is the lodging house. Moe is on the first floor and Acro is on the third."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Broken Bottle",
      "type": "Evidence",
      "obtained": "Retrieved from the Big Top - Cafeteria.",
      "description1": "An orange juice bottle that was found broken on the cafeteria floor."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Trilo Quist",
      "type": "Other",
      "obtained": "Retrieved from the Big Top - Ringmaster's Room.",
      "description1": "A ventriloquist's puppet. An operatic tenor who doubles as Ben's sidekick."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Money the Monkey",
      "type": "Other",
      "obtained": "Retrieved from Acro's Room.",
      "description1": "A monkey who takes care of Acro. Habitually gathers all sorts of shiny objects."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Ring",
      "type": "Other",
      "obtained": "Retrieved from Acro's Room.",
      "description1": "A cheap ring with an eerie sparkle. \"From T to R\" is engraved on it."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Russell's Autopsy Report",
      "type": "Reports",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Time of death: 10:15 PM. Cause: Blunt force trauma to the back of the head."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Wooden Box",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "The victim was hunched over this 20 lb. box. It was locked by a small key."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Small Seasoning Bottle",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Found inside the Wooden Box the victim was hunched over. It contains pepper."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Grand Prix Photo",
      "type": "Photographs",
      "obtained": "Received from Max.",
      "description1": "Photo of Max's Award Ceremony. Max is standing at the center holding a trophy. Two girls stand to either side. The bust of max is right next to him."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Max G. Bust",
      "type": "Photographs",
      "obtained": "Retrieved from the Big Top - Cafeteria.",
      "description1": "Bronze statue taken from the cafeteria before the crime. It looks rather heavy."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Note",
      "type": "Evidence",
      "obtained": "Received from Moe.  → Retrieved from the Big Top - Ringmaster's Room.",
      "description1": "Posted in the Cafeteria on the day of the crime, then torn. States: \"To The Murderer!\"",
      "description2": "Torn by Ringmaster, found in his tailcoat pocket. Reads To The Murderer! You haven't forgotten what happened six months ago, have you? I have conclusive evidence of what took place. Meet at 10:00 PM tonight at the lodging house plaza.",
      "description3": "Found in Regina's pocket on the morning of crime. Reads To The Murderer! You haven't forgotten what happened six months ago, have you? I have conclusive evidence of what took place. Meet at 10:00 PM tonight at the lodging house plaza.",
      "description4": "Placed by Acro in Regina's pocket on morning of crime. Reads To The Murderer!\n\nYou haven't forgotten what\nhappened six months ago,\nhave you? I have conclusive\nevidence of what took place.\n\nMeet at 10:00 PM tonight\nat the lodging house plaza.\n"
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Stage Costume",
      "type": "Other",
      "obtained": "Retrieved from Money the Monkey.",
      "description1": "A shiny spangled vest. It's not Maya's size at all."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Léon",
      "type": "Other",
      "obtained": "Received from Regina.",
      "description1": "The animal show's lion. Shot by the Ringmaster six months ago for biting a performer."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Scarf",
      "type": "Other",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "Bat's scarf. Stained with his blood and a small quantity of pepper."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "Turnabout Big Top\n\n\n\n\n\n\n\n\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 4December 29, 9:43 AMDistrict CourtDefendant Lobby No. 5Max:\n...Phoenix:\nGood morning Max.Max:\n...Maya:\nMax?Max:\nMil... Milk...Maya:\nWhat?Max:\nIf I don't have a glass of milk before I go on stage... I just can't function sweetie.Maya:\nSt-Stage? Don't worry... There won't be a stage. All you have to do is sit down.Max:\nI guess...Maya:\nNick. Max is really nervous.Phoenix:\nThat's understandable.Max:\nHey! My sweeties!!Phoenix:\nW-What!?Max:\nYou don't think I should fly, do you?Phoenix:\nHuh?Max:\nYou know... You've got to make a good first impression! When I enter the room, maybe I should fly in and warm up the crowd a little...Phoenix:\nNo no no no no... We can't be having you flying around the courtroom... It just wouldn't be right. Imagine if you hit someone!Maya:\nDon't worry Max... Just do what Nick says and everything will be OK.Max:\nOh sweetie!!Phoenix:\nWhat is it this time, Max?Max:\nWhy don't you try flying into the courtroom?Phoenix:\n...Max:\nI can see it now... The dashing young lawyer flying fabulously in from above! One glimpse of that, and everyone in the room will be on your side!Maya:\nMax... Really... No one needs to fly today. ... Nick? What's with that look in your eyes?Phoenix:\n(I like the sound of that... \"Dashing young lawyer flying fabulously...\")December 29, 10:00 AMDistrict CourtCourtroom No. 2Judge:\nAnd now the case of one... ............Phoenix:\n............von Karma:\n............Judge:\n............ What!?von Karma:\nYour Honor! Get on with it!Judge:\nOh... Sorry... I just realized that the defendant's name is Billy Bob Johns.Phoenix:\nSo...Judge:\nWell, isn't the defendant also known as Maximillion Galactica?Phoenix:\nYes, Your Honor, he does often go by that name.Judge:\nYou know, my grandchild is a huge fan of his. I think everyone here wouldn't mind if we call the defendant Maximillion Galactica... It sounds more... Friendly.Phoenix:\n(Hmm... I wonder if that is to our advantage?)Judge:\nMs. von Karma. Your opening statement if you please.von Karma:\n...I hope you didn't bother thinking you'd win this one Mr. Phoenix Wright.Phoenix:\nEh?von Karma:\nThat spirit channeling trial was a sham! I refuse to acknowledge its legitimacy! It did not count! Do you hear me!?Phoenix:\n(She must still be upset about what happened last time...)von Karma:\nYou have no chance. Zero. Zilch. Nada. I'm not losing this case! Why, you ask? Because it is not in the nature of a Von Karma to lose at anything!!Maya:\nI guess being born with the name Von Karma is a free pass to be arrogant and annoying.von Karma:\nWatch and learn, Mr. Phoenix Wright! I'll show you the textbook procedure for proving how absolutely guilty you are!!Phoenix:\nM-M-M-Me!? ... Guilty!? What are you talking about!?von Karma:\n...It will be my ultimate revenge...Maya:\nBut it's not like it'll bring her dad back... (Changed from [Her dad is gone you know...] in the original release)von Karma:\nThere. Opening statement complete. Now, let's hurry and wrap up this waste of time. (Chagned from [The prosecution is finished. Let's hurry and wrap up this waste of time.] in the original release)Judge:\nVery well. You may call your first witness Ms. von Karma. (Changed from [You may call your first witness Ms. von Karma.] in the original release)von Karma:\nDetective Dick Gumshoe! Get up there! NOW!!von Karma:\nSorry to keep you from work, as I'm sure you need every penny you can earn, Detective.Gumshoe:\nDon't mention it! It's no trouble at all! I've been looking forward to this.von Karma:\nVery well. I would like you to begin by shedding light on the events in question.Gumshoe:\nAt your service, sir.Judge:\nAlright, Detective. You may proceed with your testimony.Witness Testimony-- Details of the Events --Gumshoe:\nThe night of the crime, snow was falling until 9:40 PM, making it extremely cold out.\nAll of the circus performers gathered in the Big Top to practice their routines.\nThe practice session broke up around 10 PM.\nThe murder itself took place in the plaza in front of the lodging house at 10:15 PM.\nThe victim was found bent over a wooden box dead as a doornail.\nThe cause of death was blunt force trauma that snapped a vertebrae in his neck.Judge:\nI see... He was beaten to death.Gumshoe:\nHere is the autopsy report for the victim.Judge:\nThe court accept [sic] this into evidence.Autopsy Report added to the Court Record.Judge:\nA blunt object... Hmm... Very well... Mr. Wright, you may begin your cross-examination.Phoenix:\nYes, Your Honor.Cross Examination",
      "testimonies": [
        {
          "testimony": "The night of the crime, snow was falling until 9:40 PM, making it extremely cold out.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "All of the circus performers gathered in the Big Top to practice their routines.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "The practice session broke up around 10 PM.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "The murder itself took place in the plaza in front of the lodging house at 10:15 PM.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "The victim was found bent over a wooden box dead as a doornail.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "The cause of death was blunt force trauma that snapped a vertebrae in his neck.",
          "person": "Gumshoe",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- Details of the Events --Gumshoe:\nThe night of the crime, snow was falling until 9:40 PM, making it extremely cold out.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nLet me ask you about the snow...\nGumshoe:\nIt was nearly a blizzard up until the time of the crime.\nPhoenix:\nDid it pile up?\nGumshoe:\nIt wasn't such a big deal... Maybe about an inch and a half was on the ground. The snow froze in place and stayed on the ground until the next day.\nPhoenix:\n(Hmm... The snow... Let me see... There's got to be more to this...)\nMaya:\nEh? What's the matter? Nick?\nPhoenix:\nI need to take a look at the Court Record...\nJudge:\nMr. Gumshoe, what were the members of the circus doing on the night of the crime?Press (after selecting \"About the contents\" upon pressing fifth statement and pressing sixth statement)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nLet me ask you about the snow...\nGumshoe:\nIt was nearly a blizzard up until the time of the crime.\nPhoenix:\nDid it pile up?\nGumshoe:\nIt wasn't such a big deal... Maybe about an inch and a half was on the ground. The snow froze in place and stayed on the ground until the next day.\nPhoenix:\n(Hmm... The snow... Let me see... There's got to be more to this...)\nMaya:\nEh? What's the matter? Nick?\nPhoenix:\nI need to take a look at the Court Record...\nLeads to:\n\"Well, I think we have a good feel for the details of the event now.\"Gumshoe:\nAll of the circus performers gathered in the Big Top to practice their routines.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhen you say \"all of the circus performers\"... Who do you mean?\nGumshoe:\nEveryone but the dancers and staff were there. Regina the animal tamer, Moe the clown, Ben the Ventriloquist... And of course, the defendant, Maximillion Galactica, and his victim, the Ringmaster. Oh, I almost forgot... Regent the tiger was there as well.\nPhoenix:\nOut of curiosity, what about the circus monkey?\nGumshoe:\nWhen I was investigating yesterday, he happened to snatch my wristwatch.\nJudge:\nDetective, you are welcome to file a police report AFTER these proceedings!Gumshoe:\nThe practice session broke up around 10 PM.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAfter the practice was over, where did everyone head off to...?\nGumshoe:\nRegina was playing with Regent, while Moe went back to his room tired from work... Ben the ventriloquist went to the front gate absorbed in his own world... The Ringmaster and Max went off to the Ringmaster's room to talk privately.\nJudge:\nTalk privately, huh? That's awfully suspicious... You wouldn't happen to know what they were talking about would you?\nGumshoe:\nIt seems they were negotiating Max's salary...\nPhoenix:\n(Actually, Max was asking for Regina's hand in marriage!)Gumshoe:\nThe murder itself took place in the plaza in front of the lodging house at 10:15 PM.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nI'd like you to be a bit more specific about the events at 10:15 PM.\nGumshoe:\nUh... Umm... OK... Not a problem, pal. We've got a witness that told us how the whole thing went down. OWWW!!\nvon Karma:\nThis is totally meaningless. Time to move on!\nJudge:\nHmm... Alright... We'll just have to revisit that testimony later. Detective Gumshoe, would you mind telling us how the victim met his end?Gumshoe:\nThe victim was found bent over a wooden box dead as a doornail.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nA \"wooden box\"?\nGumshoe:\nThat's right. The victim must have been carrying the wooden box when he was killed.\nJudge:\nCarrying the box, huh?\nGumshoe:\nIt was a rather strange wooden box, Your Honor.\nJudge:\nWhat do you mean?\nGumshoe:\nWell... It was much heavier than it looked... Not to mention it was locked.\nJudge:\nLocked, you say?\nWooden Box added to the Court Record.\nPhoenix:\n(This may be my only chance, so I might as well ask some questions...)\n\n\n\nAbout the Wooden Box\n\n\n\n\n\n\n\nPhoenix:\nThis wooden box... You figure it weighs about 20 pounds, right?\nGumshoe:\nSounds about right. The whole thing is lined with iron.\nPhoenix:\nIron plating? Why do you think it's lined with iron?\nGumshoe:\nI figure they just did it to make the box heavier... Yeowch!!\nvon Karma:\nI think we could all do without your guesses, Detective. Stick to what little you actually know!\nGumshoe:\nS-S-Sorry... Suffice it to say, the box is really heavy.\nvon Karma:\nMuch better. You may continue on, Detective.\nLeads back to cross-examination\n\n\n\n\nAbout the lock\n\n\n\n\n\n\n\nPhoenix:\nYou said the box was locked. How exactly was it locked?\nGumshoe:\nWell... It had quite a sturdy lock on it. It took quite a bit to open that bad boy up.\nPhoenix:\nSo, when you found the box, it was locked, correct?\nGumshoe:\nYes, it was. Some of the forensics team took it back to the precinct to crack it open.\nJudge:\nI see... Continue Detective Gumshoe.\nLeads back to cross-examination\n\n\n\n\nAbout the contents\n\n\n\n\n\n\n\nPhoenix:\nDo you mind telling us what was inside that box?\nGumshoe:\nWell, when we found the box, it was locked tighter than Fort Knox. So we took it back to the station and cracked it open. All that was inside was this little bottle...\nJudge:\nBottle? What is that, Detective?\nGumshoe:\nExactly what it looks like Your Honor. It's a condiment bottle.\nPhoenix:\nWhat's inside the bottle?\nGumshoe:\nIt's filled with... pepper.\nJudge:\nPepper...? Why in the world was it locked in that big box?\nPhoenix:\n(There was only one little bottle in that huge box...?)\nMaya:\nI wonder if that has some sort of special meaning?\nSmall Seasoning Bottle added to the Court Record.\nLeads back to cross-examinationPress (subsequent times)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nA \"wooden box\"?\nGumshoe:\nThat's right. The victim must have been carrying the wooden box when he was killed.\nJudge:\nCarrying the box, huh?\nGumshoe:\nIt was a rather strange wooden box, Your Honor.\nJudge:\nWhat do you mean?\nGumshoe:\nWell... It was much heavier than it looked... Not to mention it was locked.\nJudge:\nLocked, you say?\nPhoenix:\n(This may be my only chance, so I might as well ask some questions...)\n\n\n\nAbout the Wooden Box\n\n\n\n\n\n\n\nPhoenix:\nThis wooden box... You figure it weighs about 20 pounds, right?\nGumshoe:\nSounds about right. The whole thing is lined with iron.\nPhoenix:\nIron plating? Why do you think it's lined with iron?\nGumshoe:\nI figure they just did it to make the box heavier... Yeowch!!\nvon Karma:\nI think we could all do without your guesses, Detective. Stick to what little you actually know!\nGumshoe:\nS-S-Sorry... Suffice it to say, the box is really heavy.\nvon Karma:\nMuch better. You may continue on, Detective.\nLeads back to cross-examination\n\n\n\n\nAbout the lock\n\n\n\n\n\n\n\nPhoenix:\nYou said the box was locked. How exactly was it locked?\nGumshoe:\nWell... It had quite a sturdy lock on it. It took quite a bit to open that bad boy up.\nPhoenix:\nSo, when you found the box, it was locked, correct?\nGumshoe:\nYes, it was. Some of the forensics team took it back to the precinct to crack it open.\nJudge:\nI see... Continue Detective Gumshoe.\nLeads back to cross-examination\n\n\n\n\nAbout the contents\n\n\n\n\n\n\n\nPhoenix:\nDo you mind telling us what was inside that box?\nGumshoe:\nWell, when we found the box, it was locked tighter than Fort Knox. So we took it back to the station and cracked it open. All that was inside was this little bottle...\nJudge:\nBottle? What is that, Detective?\nGumshoe:\nExactly what it looks like Your Honor. It's a condiment bottle.\nPhoenix:\nWhat's inside the bottle?\nGumshoe:\nIt's filled with... pepper.\nJudge:\nPepper...? Why in the world was it locked in that big box?\nPhoenix:\n(There was only one little bottle in that huge box...?)\nMaya:\nI wonder if that has some sort of special meaning?\nLeads back to cross-examinationGumshoe:\nThe cause of death was blunt force trauma that snapped a vertebrae in his neck.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAccording to the Autopsy Report, the murder weapon was a blunt object, correct?\nGumshoe:\nYou've done your homework, pal.\nPhoenix:\nAnd you haven't found this murder weapon, have you?\nvon Karma:\nThe police are searching for it as we speak.\nGumshoe:\nMy theory is that it is something the perpetrator ran off with.\nJudge:\nYou would think so... Especially since you didn't find it on the scene.\nGumshoe:\nNo no no... I bet he made it disappear with magic... Ho ho ho!Maya:\nThere wasn't much that we could go after Gumshoe with this time...Phoenix:\nHe gave us the facts, as he saw them. But there's gotta be more to this.Maya:\nI didn't see anything... But that's why you're the lawyer and I'm the medium.After pressing first and sixth statements and selecting \"About the contents\" upon pressing fifth statement:Judge:\nWell, I think we have a good feel for the details of the event now.Phoenix:\n(I guess that's all we're gonna get out of Gumshoe in this case...)Maya:\nYou mean all we're gonna get out of him is that little bottle of pepper?von Karma:\nNow that we have wrapped up with the Detective, I'd like to call my next witness.Gumshoe:\nEh? I'm not even off the stand yet!von Karma:\nObviously... But that's due to you being slow and unable to take a hint!Gumshoe:\nI dunno, but \"wrapped up\" has such a mean sound to it... I'm a sensitive guy...Judge:\nThank you very much, Detective Gumshoe. You may step down. Ms. von Karma. Call your next witness.von Karma:\nI would like to call Mr. Benjamin Woodman to the stand.Phoenix:\n(She must be talking about Ben the ventriloquist...)Maya:\nI wonder if Trilo will show up on the stand as well...?von Karma:\nPlease state your name and occupation for the record.Trilo:\nMy full name is Trilo Quist. I am employed as an opera tenor.Judge:\nEx-Excuse me! The witness called to the stand was one Mr. Benjamin Woodman, Ventriloquist.Trilo:\nThat robe must be cutting off your circulation. I said that I was a singer!! Maybe you don't believe me. Fine. I'll grace you with a song. *Ahem*... Mi mi mi mi mi! The world of the law... Exciting and daring... Guilt or innocence... Decided by a judge dressed up like a woman!! ...Well, what do you think?von Karma:\n...Judge:\n...Maya:\nIt had a good rhythm...Phoenix:\nIt's just the lyrics... They leave something to be desired, so to speak.Ben:\nT-Trilo! You know better than to insult a judge!!Trilo:\nShuddup! Just look at your nose. You would think you'd have the sense to fix it!! It's so ugly I want to punch you in the face on the off change swelling would help. You know that your nose is the reason you'll never be an A-List star.Maya:\nCelebrities must really enjoy saying everything that flashes into their minds.Judge:\nWhat's going on here!? Order! Order! I demand to know who the witness is!!Ben:\nDon't... Don't worry about me, sir. I'll let Trilo handle this.Judge:\nI'm not worried about you one bit... I'm worried about getting testimony in my court! OUCH!!von Karma:\nYou won't get anywhere trying to figure out this witness! Now let's proceed!Witness Testimony-- What You Witnessed --Trilo:\nOnce practice was over, I left the tent with the stooge... I mean clown.\nOnce we got to the lodging house, I ditched him and went back to the plaza's entrance. (Changed from [Once we got to the lodging house, I ditched him and went over to the plaza.] in the original release)\nThat's when I saw Max, heading towards the scene of the crime.\nHe was the only one heading that way... How could that punk not be the killer!?\nThen the police showed up, and took magic boy away.von Karma:\nYou saw Maximillion Galactica heading towards the scene? You're sure of that?Trilo:\nWithout a doubt. He had on his silk hat, cloak, and the dumb white roses on his chest. How can you mistake someone with that crazy get-up and his nose stuck up so high...Judge:\nTh-That's enough... I think we all get the picture. Just one thing... You said you \"ditched\" the clown.Trilo:\nThat's right, dress-boy.Judge:\nWell, since you weren't with him, couldn't that mean the clown committed the crime?Phoenix:\n(Hmm... He's got a point.)von Karma:\nWhat a shame... It was a nice theory, but the clown can't be the criminal.Judge:\nWhy's that?von Karma:\nHere's absolute proof.Judge:\nA... silk hat?von Karma:\nThis was found at the scene of the crime. It belongs to the defendant.Phoenix:\nAh...von Karma:\nWithout question, he was wearing his signature hat during practice. If the clown was the murderer, there would be no reason for this hat to be at the scene.Judge:\nHmm... Well done, Ms. von Karma. Your prosecutorial skills are unrivaled. Well done.von Karma:\nThank you for stating the obvious... Mr. Phoenix Wright, what do you have to say?Phoenix:\nO-OK... (I guess she's the boss again today...)Cross Examination",
      "testimonies": [
        {
          "testimony": "Once practice was over, I left the tent with the stooge... I mean clown.",
          "person": "Trilo",
          "present": []
        },
        {
          "testimony": "Once we got to the lodging house, I ditched him and went back to the plaza's entrance. (Changed from [Once we got to the lodging house, I ditched him and went over to the plaza.] in the original release)",
          "person": "Trilo",
          "present": []
        },
        {
          "testimony": "That's when I saw Max, heading towards the scene of the crime.",
          "person": "Trilo",
          "present": []
        },
        {
          "testimony": "He was the only one heading that way... How could that punk not be the killer!?",
          "person": "Trilo",
          "present": []
        },
        {
          "testimony": "Then the police showed up, and took magic boy away.",
          "person": "Trilo",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- What You Witnessed --Trilo:\nOnce practice was over, I left the tent with the stooge... I mean clown.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe clown... You're talking about Moe?\nTrilo:\nOf course I'm talking about that old fart. He's so pathetic, I can't stand him! Just a little bit of exercise and his makeup is running all over the place... Once practice was over, he was 9/10ths of the way to keeling over for good...\nPhoenix:\nPoor guy...\nTrilo:\nWe didn't have any choice, so Ben took him back to his room. When it comes to being a first place loser, that guy's ahead of the pack!\nJudge:\nHmm... Then what happened?Trilo:\nOnce we got to the lodging house, I ditched him and went back to the plaza's entrance. (Changed from [Once we got to the lodging house, I ditched him and went over to the plaza.] in the original release)Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat did you do then?\nTrilo:\nI went over to the Plaza to do some thinking.\nPhoenix:\nIt was awfully cold out that night... Especially with all the snow around... Wouldn't thinking in your nice warm lodging house have been a better idea?\nvon Karma:\n\nvon Karma:\nMr. Phoenix Wright. I think you should leave the thinking to the witness.\nPhoenix:\n(But I'm a good thunker* ([sic])! At least my teachers always said I was...)Trilo:\nThat's when I saw Max, heading towards the scene of the crime.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAre you sure it was really Max Galactica?\nTrilo:\nOf course I'm sure. How could you mistake someone wearing such a snobby 3 piece get-up!\nPhoenix:\nSnobby 3 piece get-up?\nTrilo:\nGet the wax out of your ears! Lawyers nowadays... You're like talking to a brick wall! Max's 3 piece get-up! Jeez! Could you be any more dense! All together now!\n\"SILK HAT! CLOAK! WHITE ROSES!\"\nTrilo:\nThank you!\nMaya:\nNick, I think you should put a little bit more effort into preparing your questions...Trilo:\nHe was the only one heading that way... How could that punk not be the killer!?Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou saw Max and only Max, right Trilo?\nTrilo:\nThat's right. And that makes him the killer! There was only one person headed that way that night.\nJudge:\nHmm... That makes quite a bit of sense and makes Max one suspicious character...\nPhoenix:\n(There's more to this story than meets the eye... Is there something amiss in this?)\n\n\n\nNo problems.\n\n\n\n\n\n\n\nPhoenix:\n(I can't really see anything wrong with what Ben... I mean Trilo said.)\nMaya:\nMaybe you should take a step back and look things over again, Nick.\nLeads back to cross-examination\n\n\n\n\nThere is no proof it was Max.\n\n\n\n\n\n\n\nPhoenix:\nWait a second! There's no proof that the witness saw Maximillion Galactica...\nTrilo:\nHey! Hey! You still don't get it, do ya? I saw what I saw... It was Max's 3 piece joke of a costume! Alright! Lets [sic] say it all together now!\n\"SILK HAT! CLOAK! WHITE ROSES!\"\nTrilo:\nThank you!\nJudge:\nI think you should study up on your celebrities, Mr. Wright!\nPhoenix:\n(Great, I'm getting shut down by a toy!)\nLeads back to cross-examination\n\n\n\n\nBen only saw Max?\n\n\n\n\n\n\n\nPhoenix:\nThat's a bit strange, don't you think?\nTrilo:\nWhat's strange!?\nPhoenix:\nThat you only saw Max... Doesn't it seem like you should have seen someone else as well?\nJudge:\nWhat? Where are you going with this, Mr. Wright? Who else do you suppose this witness could have seen?\n\n\n\nPresent Russell Berry profile (before correctly presenting Regina Berry profile upon pressing fifth statement)\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\nThat's the... victim...\nPhoenix:\nThat's correct. If Trilo was at the entrance to the plaza... He should have seen the Ringmaster as well! Ah-hah!\nvon Karma:\nObviously the Ringmaster arrived at the scene of the crime before the witness could have seen him! Anyone with sense could have figured that one out!\nPhoenix:\nWhat are you talking about!? The Ringmaster and Max went together to the Ringmaster's room!\nvon Karma:\nIs that according to the defendant? A likely story! If Maximillion Galactica was supposed to be in the Ringmaster's room, why was he, just as the witness stated... At the scene of the crime!?\nPhoenix:\nAhh!!\nJudge:\nI see... It seems that at this stage I have no reason to doubt this witness's testimony. And there are clearly no conclusive contradictions.\nPhoenix:\nHe's right...\nvon Karma:\nA brilliant judgment, Your Honor. Now, let's move along with the testimony!\nLeads back to cross-examination\n\n\n\n\nPresent Russell Berry profile (after correctly presenting Regina Berry profile upon pressing fifth statement)\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\nThat's the... victim...\nPhoenix:\nThat's correct. If Trilo was at the entrance to the plaza... He should have seen the Ringmaster as well! Ah-hah!\nvon Karma:\nObviously the Ringmaster arrived at the scene of the crime before the witness could have seen him! Anyone with sense could have figured that one out!\nPhoenix:\nWhat are you talking about!? The Ringmaster and Max went together to the Ringmaster's room!\nvon Karma:\nIs that according to the defendant? A likely story! If Maximillion Galactica was supposed to be in the Ringmaster's room, why was he, just as the witness stated... At the scene of the crime!?\nPhoenix:\nAhh!!\nJudge:\nI see...\nLeads to:\n\"Alright!\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nPhoenix:\n\nTrilo:\n...\nBen:\n...\nTrilo:\nDon't hold your tongue Ben! It's your job to answer all the stupid questions.\nBen:\nI'm sorry Trilo...\nPhoenix:\n(I've gotta find a way to get more information out of this witness...)\nMaya:\nThink about it some more Nick! I'm sure you'll come up with something!!\nLeads back to cross-examinationPress (after correctly presenting Russell Berry profile)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou saw Max and only Max that night?\nTrilo:\nJeez, you're persistent. You can ask all you want, my answer won't change! The only person I saw that night was Maximillion Galactica!\nPhoenix:\n(He really needs to improve his manners...)\nvon Karma:\nYou've heard what he has to say. Let him continue with his testimony!Trilo:\nThen the police showed up, and took magic boy away.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAround what time did the police arrive at the scene?\nTrilo:\nHmm... I suppose that would have been around... Hey, what time was it!?\nBen:\nHuh!? Umm... I think it was around... I'd say a bit after 10:30 PM... I think...\nPhoenix:\nPractice ended at 10 PM so you hung around the lodging house the entire time?\nBen:\nI... I... I... I guess that sounds about right...\nPhoenix:\nWasn't it awfully cold? I can't believe you'd just stand outside in that weather!\nBen:\nWell... Uh... The truth is...\nTrilo:\nWill you shut up, you big nosed dope! Why are you telling him anything extra!? Why can't you believe that we'd just stand outside in that weather?\nPhoenix:\nWell, maybe you were waiting for someone?\nTrilo:\nW-W-W-W-WHAT!? WHO SAID WE WERE WAITING FOR SOMEONE!?\nvon Karma:\n\nvon Karma:\nMr. Phoenix Wright! We can all do without your off-handed theories!\nPhoenix:\n\nPhoenix:\nBut! This witness! He's cracking under the pressure already! I'm on to something!\nJudge:\nHmm... Mr. Wright! Who do you suppose the witness was waiting for out in the cold that night?\n\n\n\nPresent Regina Berry profile (before correctly presenting Russell Berry profile upon pressing fourth statement)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWell, if he was waiting outside in the cold, it was for one person... And one person only! He was waiting for the animal tamer, Regina!\nTrilo:\nWAAAAHHHH!!\nPhoenix:\nYou were waiting outside for Regina to come back to the lodging house. Am I mistaken?\nTrilo:\n...\nJudge:\nIs this true?\nBen:\nWell... I... Umm... You can't really ask me that question...\nTrilo:\nWho cares who I was waiting for that night! What's important is what I saw! Don't you forget it!!\nJudge:\nWell well well... The puppet may be a bit stiff, but he's right.\nPhoenix:\nEh...\nJudge:\nIt seems that at this stage I have no reason to doubt this witness's testimony. And there are clearly no conclusive contradictions.\nPhoenix:\nHe's right...\nvon Karma:\nA brilliant judgment, Your Honor. Now, let's move along with the testimony!\nLeads back to cross-examination\n\n\n\n\nPresent Regina Berry profile (after correctly presenting Russell Berry profile upon pressing fourth statement)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWell, if he was waiting outside in the cold, it was for one person... And one person only! He was waiting for the animal tamer, Regina!\nTrilo:\nWAAAAHHHH!!\nPhoenix:\nYou were waiting outside for Regina to come back to the lodging house. Am I mistaken?\nTrilo:\n...\nJudge:\nIs this true?\nBen:\nWell... I... Umm... You can't really ask me that question...\nTrilo:\nWho cares who I was waiting for that night! What's important is what I saw! Don't you forget it!!\nJudge:\nWell well well... The puppet may be a bit stiff, but he's right.\nPhoenix:\nEh...\nLeads to:\n\"Alright!\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nPhoenix:\n\nTrilo:\n...\nBen:\n...\nTrilo:\nDon't hold your tongue Ben! It's your job to answer all the stupid questions.\nBen:\nI'm sorry Trilo...\nPhoenix:\n(I've gotta find a way to get more information out of this witness...)\nMaya:\nThink about it some more Nick! I'm sure you'll come up with something!!\nLeads back to cross-examinationPress (after correctly presenting Regina Berry profile)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat time did the police arrive on the scene would you say?\nTrilo:\nThey could have shown up at any time and nothing would change... A little after 10:30 PM... There's not a doubt in my mind!\nPhoenix:\n(It doesn't look like he is lying about this...)Maya:\nHmm... Trilo wouldn't happen to have an ulterior motive for incriminating Max, would he?Phoenix:\nWell, Max is part of that bitter love triangle with Regina. Which is probably why Max conked him over the head.Maya:\nUmm Nick... Wasn't Ben the one who got knocked over the head?Phoenix:\nUh... Yeah... I think so... I dunno anymore!Phoenix:\nAlright! There is obviously a reason why this witness was there that night! He spent all that time waiting for Regina to arrive! Moreover... Even if someone else would've walked right in front of him, I doubt he would have paid them a second thought!Trilo:\nAHHHH!!Judge:\nThat makes perfect sense.von Karma:von Karma:\nWhat did you just say!? The witness saw the defendant at the scene of the crime!!Phoenix:Phoenix:\nHowever, he did not see the victim on the way to his eventual demise! If you accept that, then you must accept that there is a high likelihood that... He could have missed someone else other than Max heading to the scene! OWWW!!von Karma:\nThere is absolutely no proof that the witness was waiting for the animal tamer!Trilo:\nUmm... Umm... I guess you got me... Alright! Alright! I'll spill the beans for real this time! It's true. I was waiting for Regina.Ben:\nPAIN!!von Karma:\nDon't volunteer things!!Judge:\nMr. Quist, tell us the truth this time... And I mean the whole truth! Were you or were you not waiting for Regina at the entrance to the lodging house?Trilo:\nI was! I was waiting to propose to her!!Judge:\nYou were what!? Waiting to... propose!?Trilo:\nWhat's the matter!? You think that humans have a monopoly on marriage!?Judge:\nThat... The matter of puppet marriage is not under review in this case!Trilo:\nYou're the judge! I mean, look at your horrible outfit!!Ben:\nMORE PAIN!!von Karma:\nHmph. Thanks to your bumbling, my perfect plan is not so perfect anymore! Now we have to waste time getting to the bottom of some silly proposal by a puppet!!Witness Testimony-- About the Proposal --Trilo:\nDon't be so surprised that I was going to propose to Regina!\nI even had something to give to her...\nI kept it in my pocket, waiting for the chance to propose and give it to her.\nOf course, I also had it in my pocket that night. It was a present for her.\nIn the end, I wasn't able to give it to her, so I've still got it in my pocket!Judge:\nYou were going to propose... You... A puppet...Trilo:\nDon't be so obtuse! Just because I'm a puppet doesn't mean I can't love!Judge:\nI guess you're right... Just because I'm old doesn't mean I couldn't propose to her too!Trilo:\nExactly!Phoenix:\n(His Honor is looking a little less than honorable right now...)Judge:\nOK, Mr. Wright... Please continue with your examination... *sigh*Maya:\nWhat was with that sigh at the end... (Changed from [Aww... Did you hear that? His sigh seemed a little wistful.] in the original release)Cross Examination",
      "testimonies": [
        {
          "testimony": "Don't be so surprised that I was going to propose to Regina!",
          "person": "Trilo",
          "present": []
        },
        {
          "testimony": "I even had something to give to her...",
          "person": "Trilo",
          "present": []
        },
        {
          "testimony": "I planned on giving an engagement ring to Regina...",
          "person": "Trilo",
          "present": []
        },
        {
          "testimony": "I kept it in my pocket, waiting for the chance to propose and give it to her.",
          "person": "Trilo",
          "present": [
            "Ring"
          ],
          "source": {
            "evidence_span": "N/A",
            "testimony_span": "I kept it in my pocket",
            "explanation": "The ring should not be found by Phoenix if it was indeed kept by the witness.",
            "is_self_contained": "no",
            "context_span": "Maya:\nWhat's the matter? Did you find something?\n\nPhoenix:\nYeah. Check this out.\n\nMaya:\nIt's a ring...\n\nPhoenix:\nThere's something engraved on it... \"From T to R\"...\n\nRing put in pocket."
          }
        },
        {
          "testimony": "Of course, I also had it in my pocket that night. It was a present for her.",
          "person": "Trilo",
          "present": [
            "Ring"
          ],
          "source": {
            "evidence_span": "N/A",
            "testimony_span": "I also had it in my pocket that night",
            "explanation": "The ring should not be found by Phoenix if it was indeed kept by the witness.",
            "is_self_contained": "no",
            "context_span": "Maya:\nWhat's the matter? Did you find something?\n\nPhoenix:\nYeah. Check this out.\n\nMaya:\nIt's a ring...\n\nPhoenix:\nThere's something engraved on it... \"From T to R\"...\n\nRing put in pocket."
          }
        },
        {
          "testimony": "In the end, I wasn't able to give it to her, so I've still got it in my pocket!",
          "person": "Trilo",
          "present": [
            "Ring"
          ],
          "source": {
            "evidence_span": "N/A",
            "testimony_span": "I've still got it in my pocket",
            "explanation": "The ring should not be found by Phoenix if it was indeed kept by the witness.",
            "is_self_contained": "no",
            "context_span": "Maya:\nWhat's the matter? Did you find something?\n\nPhoenix:\nYeah. Check this out.\n\nMaya:\nIt's a ring...\n\nPhoenix:\nThere's something engraved on it... \"From T to R\"...\n\nRing put in pocket."
          }
        }
      ],
      "noPresent": false,
      "is_self_contained": "no"
    },
    {
      "category": "cross_examination",
      "newContext": "-- About the Proposal --Trilo:\nDon't be so surprised that I was going to propose to Regina!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nBy proposal, you mean proposing marriage, correct? To Regina.\nTrilo:\nOf course that's what I meant! What kinda stupid question is that!? I wasn't going to propose that we become sort of outlaw biker gang together!! Right, Ben!?\nBen:\nYe-Yeah...\nTrilo:\nGot it!? That's the truth!Trilo:\nI even had something to give to her...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat was it exactly that you planned on giving her?\nTrilo:\nYou know exactly what I was going to give her, numbskull! The only thing I could find that could match Regina's beauty!\nvon Karma:\nAnswer his question! What was it!?\nTrilo:\nYou're gonna die when you hear this... It's an engagement ring!!\nvon Karma:\nEngagement (Changed from [An] in the original release)\nJudge:\nEngagement ring!?!? (Changed from [An Engagement Ring!?!?] in the original release)\nPhoenix:\n(Wow... Those two nearly fell out of their chairs!)\nvon Karma:\nMr. Phoenix Wright's joke has gone too far! Time for this to end right here!\nPhoenix:\n(Franziska's whip looks like it's about to lash out at almost anything... One hit from that thing will probably shut someone up for a long time...)\n\n\n\nPain equals bad\n\n\n\n\n\n\n\nPhoenix:\n(I think I'm gonna live to fight another day and shut up now...)\nMaya:\nNick! Don't be such a coward!\nLeads back to cross-examination\n\n\n\n\nPush on anyway\n\n\n\n\n\n\n\nPhoenix:\nIt may be something of a joke, but this is a historic moment! The first time that a puppet has ever proposed to a human being... OWWW!!\nvon Karma:\nI advise you to cut this argument short...\nJudge:\nI'm going to have to agree with the defense here. Will the witness please revise their testimony... Specifically about the engagement ring... I'd like to stick to facts, not sociology.\nTrilo:\nYou sure do enjoy sweating the details, especially for a man in a black bath robe...\nChanges statement from \"I even had something to give to her...\" to \"I planned on giving an engagement ring to Regina...\"Trilo:\nI planned on giving an engagement ring to Regina...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAn engagement ring...?\nTrilo:\nUh huh! It's actually a diamond shaped stone cut from glass! Even more brilliant than the real thing! I think Regina is going to love it!\nPhoenix:\n(It's just a ring...)\nMaya:\nWhat's the matter, Nick?\nPhoenix:\nWell... There's got to be something I can catch him on...Trilo:\nI kept it in my pocket, waiting for the chance to propose and give it to her.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWho's pocket was the ring in?\nTrilo:\nMine of course! What a stupid question!! You've got to be kidding me! You think Ben could pull that off!?\nBen:\nI-I'm s-s-sorry... R-R-Really...\nTrilo:\nYou don't have to apologize for that!! He's the one who should be apologizing!!\nPhoenix:\n(Really?)Present Ring (after changing second statement)\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Trilo, do you mind if I show you something?\"Trilo:\nOf course, I also had it in my pocket that night. It was a present for her.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo you went to the lodging house to give it to her?\nTrilo:\nThat's right! I tried to give it to her during practice so many times that I lost count, but... That uppity snob kept getting in the way!\nMax:\nUppity snob!? He couldn't possibly be talking about me... Maximillion Galactica! When I get a hold of him, I'm gonna saw his wood block in half... And not with magic!!\nJudge:\n...\nPhoenix:\nWell... They always say that love creates rivalries.\nJudge:\nSo what about this present?Present Ring (after changing second statement)\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Trilo, do you mind if I show you something?\"Trilo:\nIn the end, I wasn't able to give it to her, so I've still got it in my pocket!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo you are still thinking of trying to give it to Regina...?\nTrilo:\nOf course I am! I spent three months salary on this thing! I'm not gonna give up that easily!\nMaya:\nHmm, I wonder how much he receives for appearing in the circus?\nPhoenix:\nProbably way more than he deserves.Present Ring (after changing second statement)\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Trilo, do you mind if I show you something?\"Maya:\nHow about it Nick?Phoenix:\nI think it's time to unwrap this toy's testimony.Maya:\nThat's the spirit Nick! Give him heck!Phoenix:\n(The judge has that dazed and confused look again. Maybe he should get out more.) (Changed from [Uh oh, the judge has that dazed look again. Maybe he should get out more.] in the original release)Phoenix:\nTrilo, do you mind if I show you something?Ben:\nWhat is it?Trilo:\nWhat are you talking about!?Phoenix:\n(Uh oh... Looks like they're going to double team me now...) Do you recognize this ring?Trilo:\nAh! That's... That's... That's mine!! Give it back! Thief! Thief!Phoenix:\nDidn't you just testify about this very object? I believe you said... \"In the end, I wasn't able to give it to her, so I've still got it in my pocket!\" Why then, do I have it right here...?Trilo:\nAAAAAAAAAARRRRRGHHHHH!!Judge:\nWhat is going on here!?Trilo:\nThat's... That's... Ben! Say something!!Ben:\nEh? Don't put me on the spot like that Trilo!!Phoenix:\nI found this in Money's room...Judge:\nM-M-Money's room? You mean a room they put money, like a bank vault?Trilo:\nHah! That filthy monkey is gonna get what's coming to him!!Judge:\nMr. Quist, I would prefer if you avoided slandering innocent fiats in my court.Phoenix:\nWell, Your Honor... Money really is a monkey... In every sense of the word.Judge:\nAh. I see... Well then...Phoenix:\nMoney likes to go after the shiniest things that he can find and gather them up.Judge:\nShiny... Things?Phoenix:\nTrilo! When was this ring stolen from you?Ben:\nWell... I suppose it was... That time... You know... That night... The night of the crime...von Karma:\nWhat did you just say!?Phoenix:\nDetails... I need more details...Ben:\nWell... It was stolen right after Max showed up in the plaza...Phoenix:\nRight about when you saw the defendant walk past, correct?Ben:\nWell... Umm... I guess you... Might... Umm... Be able to say that... The ring might have... Well... It could have been... Taken around that time...???:\nOooo-Ooooh!Ben:\nAhhhhh... Yeowwwwwwwww... Ohhhhhhhhhh...Trilo:\nBen! What's with you!? ... Oh, whatever... It has nothing to do with anything! Especially not who committed the murder!!Phoenix:\nIt's not for you to decide what has to do with what! Now, Trilo! Back to the topic at hand!Trilo:\nI haven't admitted a thing! Not I... Mr. Trilo Quist!Phoenix:\nWhat did you do when the ring was taken, Trilo?Trilo:\nYou know exactly what I did! I chased after that ring snatching monkey Money!!Phoenix:\nBut you weren't able to catch up with him, were you?Trilo:\nIt's all this slow loafy fool called Ben's fault! While he was fumbling his way through the snow, that dumb monkey was able to get away!Judge:\nThat is indeed an incredible shame.Phoenix:\nWell... This does indeed prove one very important point.von Karma:\nProve an important point!? What point could that possibly be?Ben doesn't exercise enough.\n\n\n\n\n\n\n\nPhoenix:\nObviously that one Mr. Benjamin Woodman is lacking in the area of exercise!!\nJudge:\n...\nvon Karma:\n...\nTrilo:\n...\nPhoenix:\nThis is clear from the testimony we have just listened to!! He was too slow and awkward to catch a monkey fleeing through the snow!!! (This revelation doesn't seem to be registering too well around the courtroom...)\nMaya:\nMaybe you should leave the courtroom drama for video games and rethink that one...\nPhoenix:\nUmm... OK.\nLeads back to:\n\"Well... This does indeed prove one very important point.\"Ben's testimony has a flaw.\n\n\n\n\n\n\n\nLeads to:\n\"There is a huge contradiction in this witness's testimony!\"Phoenix:\nThere is a huge contradiction in this witness's testimony!von Karma:\nCo-Contradiction!?Phoenix:\nThe witness just testified to the following effect -- Up until the police arrived, he didn't move from the entrance to the plaza. HOWEVER! The witness just stated that he chased after Money the monkey. When the witness was off chasing Money, there was no one watching the plaza!von Karma:\nWhat is the meaning of all this, Mr. Phoenix Wright!? Where are you going with this little theory of yours?Phoenix:\nI'm saying that there is no possible way that this witness saw the plaza the entire time! That's where I'm going with this little theory! Which leads me to my next point. It is entirely possible that someone other than the defendant was at the scene!Judge:\nInteresting, Mr. Wright.von Karma:von Karma:\nWell then tell me this, Mr. Phoenix Wright!! Do you have any proof that something slipped past this vigilant ventriloquist?Phoenix:Phoenix:\nWell, he obviously didn't see the victim, the Ringmaster, arrive on the scene!von Karma:\nHowever, that doesn't change the fact that he saw the defendant arrive!Phoenix:\nThe witness is lying! He is blinded by his rivalry with Max!Judge:\nWell... The defense's argument does hold water. This witness does have a history of animosity towards the defendant.Trilo:\nWhat!? How dare you!? I wouldn't lie just to get that dorkface in trouble! He's not even worth it!! I saw him! No doubt about it! I saw that worthless liar!Judge:\nWell... Just for clarity's sake, let's flesh out exactly who you saw on that night.Trilo:\nHah! I've told you so many times, you'd think you'd know my story's not changing!Phoenix:\n(You've already changed your story, stick boy! And I'm sure it will change some more.)Maya:\nWhere there is one lie, there are usually many more behind it.Phoenix:\nExactly, Maya. That's why we have to keep after him!Maya:\nYeah!Witness Testimony-- Witnessing Max --Trilo:\nI'll give you that I was waiting that night for Regina.\nBut that doesn't change the fact that I saw Max in the plaza that night!\nHe showed up after I had been waiting there for about five minutes.\nI said \"good evening\" to him, but he didn't even acknowledge my presence!\nI'm absolutely sure it was him! I saw Maximillion Galactica at the scene!!\nThere's no way I could mistake someone wearing those three ridiculous symbols!Judge:\nHmm...von Karma:\nSo that means that Money didn't show up until after you saw Max?Trilo:\nThat's right. Money ran up less than a minute after I saw Max.Phoenix:\nThen Money snatched the ring, and you went chasing after him?Judge:\nHow long was it until you came back to where you were waiting?Trilo:\nWell. Let's see... I'd say about...Ben:\nI suppose five minutes. I think...von Karma:\nSo the victim could have arrived on the scene in that five minute stretch.Judge:\nMr. Wright, please proceed with your cross-examination.Cross Examination",
      "testimonies": [
        {
          "testimony": "I'll give you that I was waiting that night for Regina.",
          "person": "Trilo",
          "present": []
        },
        {
          "testimony": "But that doesn't change the fact that I saw Max in the plaza that night!",
          "person": "Trilo",
          "present": []
        },
        {
          "testimony": "He showed up after I had been waiting there for about five minutes.",
          "person": "Trilo",
          "present": []
        },
        {
          "testimony": "I said \"good evening\" to him, but he didn't even acknowledge my presence!",
          "person": "Trilo",
          "present": [
            "Broken Bottle",
            "Regina Berry"
          ],
          "source": {
            "evidence_span": "An orange juice bottle that was found broken on the cafeteria floor",
            "testimony_span": "I said \"good evening\" to him",
            "explanation": "The broken bottle is the aftermath of a fight on the day of the crime between the defendant and witness. So, there is no way they would have suddenly become cordial that evening and greet each other.",
            "is_self_contained": "no",
            "context_span": "Maya:\nThat reminds me... What was it that Moe said?\n\nPhoenix:\nHe said that yesterday morning Max \"clonked\" Ben over the head here."
          }
        },
        {
          "testimony": "I'm absolutely sure it was him! I saw Maximillion Galactica at the scene!!",
          "person": "Trilo",
          "present": []
        },
        {
          "testimony": "There's no way I could mistake someone wearing those three ridiculous symbols!",
          "person": "Trilo",
          "present": []
        }
      ],
      "noPresent": false,
      "is_self_contained": "no"
    },
    {
      "category": "cross_examination",
      "newContext": "-- Witnessing Max --Trilo:\nI'll give you that I was waiting that night for Regina.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo you were only concerned with waiting for Regina that night?  That means you probably wouldn't have noticed if someone else showed up.\nTrilo:\nYou should think about how many eyes I actually have. I've got four, you know! Four. F-O-U-R. Counting Ben of course... With that many eyes, do you really think something would have slipped by me?\nJudge:\nFour eyes is an awful lot of attention directed at one area, I suppose...\nPhoenix:\n(Yikes! The judge is even more dangerous to our case than Trilo!)Trilo:\nBut that doesn't change the fact that I saw Max in the plaza that night!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo you saw Max coming out of the Big Top that night?\nTrilo:\nOf course that's where I saw him coming from! I was staring at the entrance to the tent the entire time!\nPhoenix:\n(I guess that makes sense, especially since he was waiting for Regina.)Trilo:\nHe showed up after I had been waiting there for about five minutes.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAbout what time would you say these events took place?\nTrilo:\nYou're one of the dumbest people on the planet if you can't figure it out yourself! You already know that practice finished promptly at 10 PM! And you already know that I went to the lodging house right after practice! You don't need to be a brain surgeon to know around what time it was when I saw him... Just add ten more minutes! I'm sure you can do that! Now what time was it?\nJudge:\nIndeed, what time was it?\nPhoenix:\nHmm... What time was it? Lemme think about that for a second......... ...YEOW!! I'm no good at math!\nvon Karma:\n*sigh* It was 10:10 PM!\nJudge:\nAhhh, yes. That sounds about right!\nTrilo:\nIt sounds about right because that's the time that I saw Max on the scene!Trilo:\nI said \"good evening\" to him, but he didn't even acknowledge my presence!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo you testified that you said \"good evening\" to Max that night.\nTrilo:\nYou must enjoy asking incredibly obvious questions! You say \"good morning\" in the morning, and \"good afternoon\" during the day, right? And it's obvious that I'd say \"good night\" to someone at night!!\nBen:\n...\nTrilo:\nWhat Ben!? You've got something to add!? Lemme guess... \"That's not it Trilo! You say 'good evening' at night!\"\nBen:\nAh... I'm sorry Trilo...\nJudge:\nMr. Quist, I would prefer if you kept your ventriloquist's act outside of the courtroom!\nTrilo:\nImpossible! A performer lives and breathes his performances! You should know better!!\nPhoenix:\n(There's got to be something wrong with this bit of testimony...)\n\n\n\nNothing especially\n\n\n\n\n\n\n\nPhoenix:\n(I guess it's kinda petty to bad mouth someone's performances...)\nMaya:\nI think so too... I guess you really are \"Wright all the time!\"\nPhoenix:\nGlad to see you finally coming around to that.\nJudge:\nContinue with the cross-examination please!\nLeads back to cross-examination\n\n\n\n\nTrilo's evening greeting\n\n\n\n\n\n\n\nPhoenix:\nIsn't that a bit strange to you?\nTrilo:\nWhat do you mean?\nPhoenix:\nWell, if you hate Max so much, why would you bother being nice to him? It strikes me as somewhat strange.\nTrilo:\nWhy would it strike you as strange?\nvon Karma:\nExactly! How is it strange to be cordial to one of your coworkers?\nPhoenix:\nWell... If it was simply just being cordial to a coworker I would understand... OWW!! That hurt!!\nvon Karma:\nMaybe you should think of having some proof before your lips start flapping next time! Proof is everything in this world! You should have learned that back in grade school!!\nPhoenix:\n(There's no reason that Trilo would ever say something nice to Max... But how do I go about proving that with the evidence?)\nMaya:\nBluffing is everything in this world! ...But I'm sure you already learned that one!!\nPhoenix:\nI guess I can give it a shot...\nJudge:\nThe witness will resume his testimony.\nLeads back to cross-examination\n\n\n\n\nBen's half of the comedy act\n\n\n\n\n\n\n\nPhoenix:\nI hate to say it, but Ben's part of your little act is coming off a bit stale! I'm sure that if a pro was to review your work, he would say... OWWW!!\nvon Karma:\nYou're not trying to pass yourself off as a professional performer, are you? Don't get so wrapped up in yourself, Mr. Phoenix Wright! You! Should know! Better!\nPhoenix:\nOW! OWWW! AWWWWWW! THAT HURTS!!\nvon Karma:\nThat should have set him straight! You may proceed with your testimony, Witness.\nLeads back to cross-examinationPresent Broken Bottle or Regina Berry profile\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Trilo, is it not true that you had a fight with Max on the day of the murder?\"Trilo:\nI'm absolutely sure it was him! I saw Maximillion Galactica at the scene!!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou are 100% absolutely sure of what you just said?\nTrilo:\nI told you already! Jeez!! I am 100% absolutely sure!\nvon Karma:\nThere's no way that he could be any more confident than that, right?Trilo:\nThere's no way I could mistake someone wearing those three ridiculous symbols!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThose three ridiculous symbols, huh?\nTrilo:\nOut of curiosity, exactly how many times have you asked that question by now? If you're gonna ask again, I'll answer with a chorus... Everyone together now!\nJudge:\n\"SILK HAT!\nMaya:\nCLOAK!\nWHITE ROSES!\"\nTrilo:\nThank you very much!\nPhoenix:\nMaya... You didn't have to join in did you!?\nMaya:\nBut... It's fun shouting out with everyone else!!Maya:\nThere has to be a hole in his testimony somewhere.Phoenix:\nI agree. But do we have the proof to make something stick?Maya:\nAll we can do is try, right Nick!? We've gotta have something that will prove useful.Phoenix:\nAll right, time to go to work.Phoenix:\nTrilo, is it not true that you had a fight with Max on the day of the murder?von Karma:\nA fight?Phoenix:\nA fight over Regina to be exact.Trilo:\nIt wasn't that big of a deal! It was just an argument... A disagreement at most!Phoenix:\nA disagreement usually doesn't end with someone getting clonked over the head...Trilo:\nAHHHH!!Phoenix:\nThat morning, Ben got clobbered over the head by Max, didn't he?Judge:\nWh-What? Is that an admission of assault and battery? OUCH!!von Karma:\nBefore we handle that, we should wrap up the defendant's murder charge first!Phoenix:\nThe truth is that on the day of the crime, the defendant and witness had a huge fight! There is absolutely no way they would have suddenly become cordial that evening! Moreover, just consider the personality of the witness on stand! There is no way a puppet this lewd would just up and say \"good evening\" to his rival!Trilo:\nGWWAAAAHHHH!!von Karma:von Karma:\nAre you saying this witness is lying!? That he is trying to frame the defendant by claiming to have seen him at the crime scene!?Trilo:\nI-I-I... I didn't tell a single lie! Honestly! I just...Judge:\nThat's enough from you Mr. Quist! Mr. Wright...Phoenix:\nYes, Your Honor.Judge:\nLet's clarify this testimony for the court... Could you explain your theory about who the witness actually saw that night?He didn't see anyone.\n\n\n\n\n\n\n\nPhoenix:\nOf course, the witness did not see a soul that night.\nJudge:\nI see...\nTrilo:\nWho... Who do you think you are to just up and decide what it is I saw that night!?\nvon Karma:\nA fool can only understand a foolish foolery uttered by the most foolish of fools. The witness \"didn't see anyone\"... You wouldn't happen to have proof to back up that statement, would you?\nPhoenix:\n*gulp*\nMaya:\nNick, I just thought of something... If Ben and Trilo really didn't see anyone that night, they wouldn't have testified that they greeted someone that night, would they?\nPhoenix:\nWh-What do you mean?\nMaya:\nI think that Trilo really did say \"good evening\" to someone that night.\nPhoenix:\nBut... Trilo and Max... They were in the middle of a huge fight.\nJudge:\nMaybe you should think this over some more on your own time, Mr. Wright.\nLeads back to:\n\"Let's clarify this testimony for the court...\"He saw the defendant.\n\n\n\n\n\n\n\nPhoenix:\nOf course he saw the defendant! How could he miss Maximillion Galactica!? OWWWW!!\nvon Karma:\nYou said that Trilo would have no reason to greet Max if they had met that night! You said that, did you not!? Mr. Phoenix Wright!!\nPhoenix:\nAhh...\nvon Karma:\n\"Ahh...\" is not the correct answer!\nJudge:\nMr. Wright! I'm afraid that \"Ahh\" has just landed the defense a penalty!\nPhoenix:\n(Foiled again...)\nMaya:\nNick, you've got to think about things a bit more and give it another shot!\nPhoenix:\nYeah, I know... (And by the looks of things I've gotta hurry up!)\nLeads back to:\n\"Let's clarify this testimony for the court...\"He saw a different person.\n\n\n\n\n\n\n\nLeads to:\n\"It is my belief that the witness did indeed see someone that night...\"Phoenix:\nIt is my belief that the witness did indeed see someone that night... It was just someone else! That's who he said \"good evening\" to.von Karma:\nWhat kind of theory is that!?Phoenix:\nThe correct one. Furthermore, I don't believe the person the witness saw was Max at all.von Karma:\nWh-What!?Phoenix:\nIf he had truly met Max that night, there would have been no greeting at all. Which means there is only one proper answer. The person the witness saw that night was not Maximillion Galactica. That is why Trilo made the effort to greet whoever it was that he saw that evening. Or \"good evening\" as he put it.Trilo:\nUhh...von Karma:\nWhat in the world... You...Judge:\nWould the defense kindly explain who it was Trilo saw that evening then?Present Russell Berry profile\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Considering the ill temper of this witness, there is only one person he would greet!\"Present anything else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThis is the person that this witness felt the need to greet that night!\nJudge:\nHmm... How about it, Mr. Quist?\nTrilo:\nHow about you stop asking me these ridiculous questions! You can show me all the crappy pictures you'd like, there's not one I wouldn't greet!\nBen:\n...\nTrilo:\nWhat the oak are you doing, Woodman? You better not say, \"Trilo watch your mouth!\"\nBen:\nAhh... Well... OK. Sorry about that, Trilo.\nJudge:\nOrder! ORDER! There will be order in my courtroom! Mr. Wright!!\nPhoenix:\n(Uh oh, now I've done it!)\nJudge:\nYou better rethink this line of questioning before I lose my patience with you!!\nLeads back to:\n\"Would the defense kindly explain who it was Trilo saw that evening then?\"Phoenix:\nConsidering the ill temper of this witness, there is only one person he would greet!Judge:\nIt must be Regina! It's Regina right!? She's so cute!!Phoenix:\nNo, Your Honor, it is not Regina. If it was Regina, Trilo would have given her the engagement ring as a present.Judge:\nOh... Yeah... I suppose you've got a point there.von Karma:\nIt was Russell Berry. The victim himself, was it not?Phoenix:\nYou are correct. It was indeed Russell Berry.Trilo:\n...!Phoenix:\nThe person you saw that evening was the victim, the Ringmaster, Russell Berry. That's why you greeted him Trilo. Isn't that correct?Trilo:\n... *gulp*Phoenix:\nAnswer the question, Mr. Quist!Trilo:\nWAAAAHHHH!! AH!Judge:\nORDER! ORDER! How do you respond to this!?Trilo:\nWa-Wait a second!! Well, at first I thought it was the old man! But! But! Once I got a better look at him, it was obviously Maximillion Galactica!Judge:\nI think it is high time that we clear the air about this question! Mr. Quist obviously witnessed a single person in the area of the plaza that evening. The problem is identifying exactly who that person was... Was it Maximillion Galactica? Or was it the Ringmaster, one Mr. Russell Berry?von Karma:\nThe prosecution argues that it was the defendant that the witness saw that night! The witness has clearly stated that he saw the defendant's three symbols!Phoenix:\nThree symbols?Trilo:\nAlright... This is getting old. C'mon man! You've gotta remember them by now!! Here we go again! Everyone... All together now!! OWWWWW!!von Karma:\nYes, yes... We know... The silk hat, cloak, and white roses...Phoenix:Phoenix:\nA silk hat and a cloak! Anyone could wear them! They'd even look good on me!von Karma:\nWhat was that!?Phoenix:\nWell, the witness has endlessly repeated that he saw Max's three symbols... However, how do we really know it was Maximillion Galactica? It could have been someone else, dressed up as him. Possibly even Russell Berry!von Karma:\nWHAT!?Judge:\nMs. von Karma.von Karma:\n...Judge:\nDo you have clear evidence that the person the witness saw was the defendant?von Karma:\nWell... I...Judge:\nIf that's the case, then it is impossible for me to make a judgment at this point.Phoenix:\n(Yes! I think we've finally won a point in this one!!)von Karma:\n... That is very... Unfortunate.Phoenix:\nHuh?von Karma:\nYou're just a little too excited for your own good, Mr. Phoenix Wright.Phoenix:\nWhat do you mean by that?von Karma:\nYou merely established one thing from this witness. You established that this witness saw one person in the plaza that night. I applaud you on your effort, but...Judge:\nBut...?von Karma:\nWho that person was can only be answered by the next witness!Phoenix:\nHUH!?von Karma:\nYour Honor, the prosecution will provide, beyond a shadow of a doubt, an answer to that question, and evidence that clearly establishes one thing. That there is no one other than Maximillion Galactica responsible for this crime!Judge:\nVery well. The court will take a 10 minute recess. During that time, I request the prosecution prepare their next witness. Court is now in recess!To be continued.December 29, 11:54 AMDistrict CourtDefendant Lobby No. 5Max:\nSw-Sweetie! You have to believe me! I didn't go anywhere near that crime scene!Maya:\nSo then, where were you when the murder took place?Max:\nWe talked about it yesterday, remember? I was in the Ringmaster's room!Phoenix:\nAnd while you were there, it was the Ringmaster who left the room, right?Max:\nExactly. He told me to wait in the room because he would \"be right back\".Maya:\nThat's when the Ringmaster headed to the scene of the crime... Right?Phoenix:\nThat's what it seems like.Maya:\nBut... The Ringmaster must've been wearing Max's costume. Right?Max:\nOh! Sweetie! I just remembered! I went straight to the Ringmaster's room still dressed in my stage clothes. But when I got there, I went ahead and took the costume off.Maya:\nWhich means?Phoenix:\nIt means that the Ringmaster could have taken his costume, and went out looking like Max!Max:\nFABULOUS! That's a fabulously possible possibility!Maya:\nHeh Heh... Well done, Nick.Max:\nHowever, sweetie... Why would the Ringmaster want to dress up like me? Isn't that a bit strange?Phoenix:\nHmm...Max:\nIf you think about it, all they found at the crime scene was my silk hat. What about my cloak? Where did that go?Phoenix:\nDouble hmm...Maya:\nWow Max. I never thought of that. You should be a detective or something!Max:\nWell, I was never quite sure what to be when I grew up... Magician or President? You have no idea how hard it was to make a decision!Maya:\nThat's really cool...Phoenix:\n(Fabulous... This mystery just keeps getting deeper...)December 29, 12:06 PMDistrict CourtCourtroom No. 2Judge:\nNow that everyone is back, let's get started. The court is now back in session. Ms. von Karma, please proceed with the prosecution's case.von Karma:\nVery well... I will now call my next witness. A pitiful clown with the unfortunate distinction of having seen the entire thing. Will Mr. Lawrence Curls please take the stand!Phoenix:\n(Why did she just call him a \"pitiful\" clown?)von Karma:\nThe witness will state his name and occupation for the court record.Moe:\n...von Karma:\n...Moe:\n... In West Clownadelphia, born and raised, on the playground is where I spent my clowin...von Karma:\n... Name and occupation.Judge:\nWill the witness please inform the court why he is speaking autobiographical gibberish?Moe:\nO-Oh... I-I'm sorry... I'm just not used to being in court. I've never been in a courtroom in my life. I wasn't quite sure what joke is best suited to this sort of occasion.Judge:\nWhat in the world are you talking about!? You're in a grand hall of justice, not some comedy club! Since it's easy to see your occupation, please state your name for the court.Moe:\n... Oh... Yeah... Maybe this joke is OK... \"Mom, do I have to wear pants?\" \"The sign only says no shirt, no shoes, no service.\" Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha!.....................Moe:\nOK! OK! How about this? \"Have you met my proctologist? Dr. Seymour Butts!!\" How was that one!? Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! ...But a couple of clowns who were up to no good... Started makin' trouble in... (Changed from [...But a couple of clowns, they were up to no good... Started makin' trouble in...] in the original release)von Karma:\nYour name...Moe:\nLawrence Curls. Professional funnyman, also known as Moe the clown.von Karma:\nYou witnessed the scene at around 10:15 PM the day of the murder. Correct?Moe:\nYes... Yes it is.Judge:\nVery well, Mr. Curls. Will you please testify to what you saw that evening?Moe:\nA rabbi, a priest, and a Rastafarian walked into this plaza...Judge:\nWithout the humor please.Moe:\nOK...Maya:\nAww... Poor Moe can't be his normal stoogey self in court.Witness Testimony-- What You Witnessed --Moe:\nI know... I know... I'm not the greatest comedian in the world...\nI haven't been able to make people laugh for 10 years!\nNo matter what I say, all I get in return is a vacant stare and polite applause.\nSince no one ever laughs at my jokes, I've taken to laughing at them myself.\nIt's a bad habit, but hey, at least I'm trying!!\nImagine my predicament! I'm a clown who can't make people laugh!! I'm almost useless!\nBut I keep trying... I even tried to come up with jokes just for today!!\nBut this atmosphere is very nerve-racking! I decided to try making everyone laugh!\nSeriously... Everyone... What do you think of me? How am I doing?Judge:\n...von Karma:\n...Phoenix:\nUmm... Aren't we the ones supposed to be asking the questions here?von Karma:\nWitness...Moe:\nHuh?von Karma:\nWe will listen to your call for help after the court proceedings are over. Thus, please stick with the facts of this case.Moe:\nReally!? You'll really hear me out!?von Karma:\nWell, I'll make sure that one of my staff will be your straight man later.Moe:\nThank you!! Thank you!! I can't wait!!Phoenix:\n(Poor Gumshoe...)Judge:\nNow that that's settled, shall we begin once again with the testimony!?Moe:\nOf course we can! I'll talk for as long as you want!!Witness Testimony-- What You Witnessed --Moe:\nThe night of the murder, after practice was over, I went straight back to my room.\nYou have no idea how tired I was that night. I was pooped.\nI thought I'd go straight to sleep, but before I did, I glanced out the window.\nThat's when I saw two silhouettes! They were a bit far away though!\nIt was the Ringmaster, and he was with Max, who was wearing his cloak!\nI kept watching them, and all of a sudden, Max clonked the Ringmaster over the head!Judge:\nThat's very interesting... If this eyewitness account is to be believed, I have enough to pass judgment right now...von Karma:\nOf course you can! There is no way that this account can be criticized.Judge:\nHowever... The witness is a bit, how do you say, \"off-kilter\"... Almost like he has some sort of atmosphere of guilt surrounding him.Moe:\nAha! Aha! Aha! That must be because of my insincere smile...Judge:\nMr. Wright, please begin the defense's cross-examination.Phoenix:\nYes, Your Honor.Maya:\nNick! You've gotta find some kind of contradiction in his testimony!Phoenix:\nI know that!Judge:\nMr. Wright.Phoenix:\nYour Honor?Judge:\nI'm afraid that if you push this witness too far, it would bring disaster upon the court. Thus, I sincerely hope you are not going to engage in pointless saber-rattling.Phoenix:\nI understand, Your Honor.von Karma:\nIf you cause this clown to stray from the facts, I'll hold you responsible!Phoenix:\n(Why am I responsible!? I'm not the one with the corny jokes.)Cross Examination",
      "testimonies": [
        {
          "testimony": "The night of the murder, after practice was over, I went straight back to my room.",
          "person": "Moe",
          "present": []
        },
        {
          "testimony": "You have no idea how tired I was that night. I was pooped.",
          "person": "Moe",
          "present": []
        },
        {
          "testimony": "I thought I'd go straight to sleep, but before I did, I glanced out the window.",
          "person": "Moe",
          "present": []
        },
        {
          "testimony": "I heard a huge noise outside the window, and that's what made me take a look outside...",
          "person": "Moe",
          "present": []
        },
        {
          "testimony": "That's when I saw two silhouettes! They were a bit far away though!",
          "person": "Moe",
          "present": []
        },
        {
          "testimony": "It was the Ringmaster, and he was with Max, who was wearing his cloak!",
          "person": "Moe",
          "present": []
        },
        {
          "testimony": "I kept watching them, and all of a sudden, Max clonked the Ringmaster over the head!",
          "person": "Moe",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- What You Witnessed --Moe:\nThe night of the murder, after practice was over, I went straight back to my room.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou'd say that practice wrapped up around 10 PM correct?\nMoe:\nSee, that's the thing...\nPhoenix:\nHuh?\nMoe:\nHow exactly am I supposed to make a joke about 10:00 PM? Now eight o'clock... That's something a clown can riff off of... Let's just pretend it was eight o'clock... That way I can make a great joke!\n\n\n\nLet's not...\n\n\n\n\n\n\n\nPhoenix:\nLet's not make it 8:00 PM, alright Moe?\nMoe:\nWhat do you mean let's not! Don't take the clown out of the clowning around!\nMaya:\nC'mon Nick, just listen to his joke!\nPhoenix:\nThere are three reasons why I don't want to... One, I probably won't laugh. Two, I'll get hit with a penalty. Three, I'll get whipped. Will the witness just proceed with his factual testimony...\nMaya:\nYou are sooo boring.\nLeads back to cross-examination\n\n\n\n\nAlright, eight o'clock then...\n\n\n\n\n\n\n\nMoe:\nYou know you want to hear the joke... A man goes to his doctor and the doctor asks, \"How is number 1?\" The man says \"Everyday at six.\" The doctor asks, \"And 2?\" The man says \"Everyday at seven.\" \"Then what's the matter?\" \"I slept til eight.\"\nvon Karma:\nWitness! These are exactly the type of jokes you should save for Gumshoe!\nPhoenix:\n... OWWW!!\nvon Karma:\nYou knew what would happen! Don't look at me like that!\nJudge:\nMr. Wright, you're hereby penalized! This will not become a kangaroo court!\nPhoenix:\n(This isn't funny at all... In more ways that* ([sic]) one...)\nLeads back to cross-examinationMoe:\nYou have no idea how tired I was that night. I was pooped.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou were \"pooped\" that night?\nMoe:\nYes. I was very very tired... Not to mention I had some bad Mexican food.\nPhoenix:\nWhat?\nMoe:\nThe double cheese double bean enchilada is a dangerous menu item... What happened after that, as they say, \"happens\"... Aha! Aha! Aha! Aha! Aha! Aha! That one was cool, huh? I hear the kids really love toilet humor these days...\nPhoenix:\nThat joke was so hip, I don't want to ruin it with a reply.\nJudge:\nI've got a good reply though. That joke was so funny it just earned you a penalty!Moe:\nI thought I'd go straight to sleep, but before I did, I glanced out the window.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou just happened to glance out of the window?\nMoe:\nYou could say that. You could also say I peeked, stared, glimpsed, peeped, eyeballed...\nJudge:\nMr. Curls!!\nMoe:\nOh... I guess synonyms aren't allowed either...\nPhoenix:\n(What should I do? I wonder if I should press him further on this issue...)\n\n\n\nLet it rest.\n\n\n\n\n\n\n\nPhoenix:\nVery well, Moe. How about we get back to your testimony now?\nJudge:\nThis is definitely one of your more straightforward cross-examinations, Mr. Wright.\nPhoenix:\n(Of course! You threatened me with a penalty if I don't keep this stooge in check!)\n\n\n\n\nKeep pressing.\n\n\n\n\n\n\n\nPhoenix:\nExactly why did you look out of your window that night?\nMoe:\nWhy!? Why!? Clowns don't need a reason to look out their windows, do they!?\nPhoenix:\nThat's not what I meant. I meant that... Well... When we spoke yesterday...\n\n\nMoe:\nOnce I had tucked myself into bed, I heard this amazing noise. It was incredibly loud. It sounded like a giant \"THUMP\"!\n\n\nMoe:\n... Oh yeah! I forgot about that!!\nvon Karma:\nYou... forgot!?\nPhoenix:\nYour Honor, the witness looked out of his window upon hearing a loud sound. He did not just simply \"glance\" out of his window that night.\nMoe:\nOh yeah! That's right! I forgot to mention that \"THUMP\" didn't I? Owwy Oww Oww...\nvon Karma:\nThat's not something you just \"forget to mention\"!\nPhoenix:\nUmm... Yeah... What she said... I believe it would be best if Moe were to revise his testimony.\nJudge:\nHmm... Very well. Mr. Curls. Please revise your testimony.\nPhoenix:\n(This should start turning the tables in our favor!)\nChanges statement from \"I thought I'd go straight to sleep, but before I did, I glanced out the window.\" to \"I heard a huge noise outside the window, and that's what made me take a look outside...\"Moe:\nI heard a huge noise outside the window, and that's what made me take a look outside...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat was the sound like?\nMoe:\nWell... I guess it kinda sounded like... Hmm... I guess you could say...\nJudge:\nMr. Curls. May the court remind you that humor is unnecessary.\nMoe:\nDoh! How'd you know that I was gonna make a joke! Aha! Aha! Aha! Aha! Aha! I guess that the sound sounded like a... I suppose it sounded like someone getting hit with something very hard... Yep. That's what it sounded like. Honestly.\nJudge:\n\"Someone getting hit...\" huh?\nvon Karma:\nWhat then? You went to look out the window and you saw...Moe:\nThat's when I saw two silhouettes! They were a bit far away though!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nFar away you say... If you had to say exactly, how far away were they?\nMoe:\nLet me think about that for a second... If my room is here... And they looked about yay-big... I'd say they were about 30 feet from my window.\nvon Karma:\nJust 30 feet? That's not far at all!\nMoe:\nIt was snowing that night, and it cut down on visibility.\nJudge:\nI see. Please continue with your testimony regarding the two shadows that you saw.Moe:\nIt was the Ringmaster, and he was with Max, who was wearing his cloak!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou'd say you clearly saw this? Even though you were, by your own admission, far away?\nMoe:\nThat's right. I had been thinking about it over and over since that night, but things didn't really make sense until I spoke with the prosecutor, Ms. von Karma. But now I am 100% certain that it was Max and the Ringmaster that I saw that night. Just think about it? How could I be wrong if Max is always wearing his uppity symbols?\nPhoenix:\nUppity symbols?\nMoe:\nLawyers nowadays!! Do you even have to go to school anymore to be one? Alright! Everyone knows what to do!! Altogether now!! Say it with Uncle Moe!\n.....................\nMoe:\n... See what I mean!! It's always like this! The crown never wants to go along with me! I must really be utterly and completely worthless as a clown... Yeowza!\nvon Karma:\nEnough foolishness, get back on track!\nJudge:\nWill the witness please testify as to what he saw... And only what he saw!Moe:\nI kept watching them, and all of a sudden, Max clonked the Ringmaster over the head!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou say you saw the Ringmaster get \"clonked\" over the head!?\nMoe:\nYes, I did!! It's the climax of my story!\nPhoenix:\n(He really does enjoy the completely random non sequitur...) What would you say the victim was struck with?\nMoe:\nYou mean weapon? I have no idea. A weapon wasn't found at the murder scene, right?\nPhoenix:\nThat's not what I meant... You did say you did see \"everything\", didn't you? (Changed from [No no no... You did say you saw the entire thing, didn't you?] in the original release)\nMoe:\nWell... I, umm... Yeah, I suppose I did. Wait... No I didn't. I didn't see a weapon... Heh heh heh!\nPhoenix:\nMoe! Did you or did you not see the crime of murder committed that night!?\nvon Karma:\n\nvon Karma:\nI will not permit you to harass my witness in this manner! You'd better have an excellent reason for attacking this poor, poor clown. Because if you don't... You know what is waiting for you... A nice penalty!\nPhoenix:\n*gulp* (Wasn't that a bit melodramatic...)\nvon Karma:\nSo what will it be then, Mr. Phoenix Wright? Do you have any clear basis to believe that my witness did not see the crime?\n\n\n\nOf course I don't!\n\n\n\n\n\n\n\nPhoenix:\nWell... See... Right now, I don't have a clear basis to be thinking that...\nvon Karma:\nThen this is just another one of your pointless efforts to badger my witness! Thus, you have just earned yourself a penalty... FROM ME!!\nJudge:\nNow wait a second Ms. von Karma! This time, I do not feel the need to treat Mr. Wright so harshly.\nPhoenix:\nThat's right! What he said! (Bailed out by the judge! What an honor indeed!)\nJudge:\nIf we must penalize Mr. Wright for his display, I think a verbal censure would be best.\nPhoenix:\nHuh?\nJudge:\nYou know the rules Mr. Wright. There is no room for baseless hounding in this courtroom.\nPhoenix:\n(I guess he didn't really bail me out after all...)\nLeads back to cross-exmaination\n\n\n\n\nOf course I do! (before changing third statement)\n\n\n\n\n\n\n\nPhoenix:\nOf course I have grounds to make this claim!\nvon Karma:\nThen let's hear it!\nPhoenix:\nThat's something I can't share with you at this time.\nJudge:\nW-W-What did you just say!? Mr. Wright!!\nPhoenix:\n(I know there's something wrong with this testimony... But I can't put why I feel this way into words for the Judge...)\nMaya:\nMaybe we should get a bit more information... Once we find something more solid, we can give it another shot!\nPhoenix:\nYeah, you're right...\nJudge:\nMr. Wright, before we resume testimony, you know that you must be penalized.\nPhoenix:\n(Yikes. That's harsh...)\nLeads back to cross-examination\n\n\n\n\nOf course I do! (after changing third statement)\n\n\n\n\n\n\n\nLeads to:\n\"I've got a great reason to make my claim!\"Maya:\nYou know... Moe's testimony and what he told us yesterday are kinda different...Phoenix:\nYeah I noticed. We've just got to pinpoint what's changed.Maya:\nYou can do it, Nick!Phoenix:\nI've got a great reason to make my claim!von Karma:\nAnd I suppose you will be telling us all that \"great\" reason?Phoenix:\nOf course I will... The reason is... The witness' very own testimony!Judge:\nWhat is the meaning of that Mr. Wright?Phoenix:\nMoe said that he heard a sound like a \"thump\" of someone getting hit.Judge:\nHmm... He did say that.Phoenix:\nHowever, Moe just stated the following under oath.Moe:\nI kept watching them, and all of a sudden, Max clonked the Ringmaster over the head!Phoenix:\nIf Moe is to be believed when he says he looked out the window upon hearing a sound, there is no way that he could have seen Max \"clonk\" anyone!Moe:\nIn 1972, a crack clown unit was sent to prison by a circus court for a crime...Judge:\nMr. Curls! How do you respond to Mr. Wright's assessment!!?Moe:\n...they didn't commit. These clowns promptly escaped from a maximum security clown car...Judge:\nMr. Curls, are you reciting the C-Team theme to anger this court?Moe:\nNo no no... I'm just stalling for time while I jog my memory...Maya:\nGreat job, Nick!Phoenix:\nThese types of witnesses always seem to have a selective memory... You just have to peel back the layers of the clown make-up to find the truth.Moe:\nWell... Umm...Judge:\nAhh, you're back from your jog?Moe:\nWell... It pretty much happened the way I said.Phoenix:\n\"Pretty much\"...?Moe:\nWhen I looked out my window that night, the Ringmaster was already face down in the snow. The prosecution helped me fill in the gaps of my statement.Phoenix:\n(Von... Von Karma!! Tampering with witnesses again!!)von Karma:\n...Judge:\nSo now you are saying that you did not see the defendant \"clonk\" the Ringmaster?Moe:\nY-Yes... When I looked out my window, the Ringmaster had already checked out.Judge:\nChecked out?Moe:\nYep. He was on permanent vacation as they say. Aha! Aha! Aha! Aha! Aha!Judge:\nMr. Curls!!Moe:\nYour Honor?Judge:\nYou did not witness the actual crime; however, you still say you saw the criminal, correct?Moe:\nY-Y-YES!! Exactly! The Ringmaster was slumped over and I saw someone's silhouette next to him.Judge:\nVery well. Then please testify to this silhouette you saw... I expect the truth! And if I even catch a hint of a joke from you... I will put you in a holding cell until you learn court etiquette, got it!?Moe:\nGot it.Witness Testimony-- The Silhouette --Moe:\nI was a bit far away, but that shadow could only have belonged to Max.\nThere's no doubting it. Especially since I saw his uppity symbols.\nHis silk hat. That black cloak. They were all there!\nHis face was silhouetted, but there was no doubt that it was him.\nHis cloak was fluttering in the wind, so I couldn't really see what he was carrying.Judge:\nHmm... It does seem as if the defendant was at the scene of the crime.von Karma:\nIt took the clown long enough to get his facts straight. (Changed from [You took your time realizing that, didn't you!?] in the original release) But whatever. This should finally be good enough, yes? (Changed from [Whatever. That should be enough, right!?] in the original release)Judge:\nIt is decisive testimony...Maya:\nWas Max really at the crime scene that night...?Phoenix:\nHe said he wasn't there. We have to believe in that. (Changed from [He said he wasn't there. We have to keep believing that.] in the original release)Judge:\nAlright, Mr. Wright. Commence your cross-examination.Cross Examination",
      "testimonies": [
        {
          "testimony": "I was a bit far away, but that shadow could only have belonged to Max.",
          "person": "Moe",
          "present": []
        },
        {
          "testimony": "There's no doubting it. Especially since I saw his uppity symbols.",
          "person": "Moe",
          "present": [
            "Max G. Promo Poster"
          ],
          "source": {
            "evidence_span": "Max's three famous symbols. A silk hat, cloak and white roses",
            "testimony_span": "N/A",
            "explanation": "The witness failed to mention one of Max's three symbols.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "His silk hat. That black cloak. They were all there!",
          "person": "Moe",
          "present": [
            "Max G. Promo Poster"
          ],
          "source": {
            "evidence_span": "Max's three famous symbols. A silk hat, cloak and white roses",
            "testimony_span": "His silk hat. That black cloak.",
            "explanation": "The witness failed to mention one of Max's three symbols.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "His face was silhouetted, but there was no doubt that it was him.",
          "person": "Moe",
          "present": []
        },
        {
          "testimony": "His cloak was fluttering in the wind, so I couldn't really see what he was carrying.",
          "person": "Moe",
          "present": []
        }
      ],
      "noPresent": false,
      "is_self_contained": "yes"
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Silhouette --Moe:\nI was a bit far away, but that shadow could only have belonged to Max.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nDon't you think that you are going a little overboard with how explicit you're being? 'That shadow belonged to Max' is an awfully firm statement, don't you think?\nMoe:\nWhat are you getting at...?\nPhoenix:\nI'm just saying that one of your fellow performer's life is on the line here. Are you truly, 100% absolutely certain that it was Max?\nMoe:\n... I'm not the kind of person who would lie about something as serious as this! The silhouette I saw was Max. I'm convinced of that.\nPhoenix:\n(It doesn't seem like he is jumping to any conclusions this time...) Let's go over this again then. What makes you so sure that you saw Max that night?Moe:\nThere's no doubting it. Especially since I saw his uppity symbols.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nTrilo said the same thing. But if it was just the symbols, then even I could have been wearing them. What if someone had just taken Max's symbols and worn them?\nMoe:\nI thought of that myself. But just looking at the shape of the face I saw, it must have been Max.\nJudge:\nHmm... You're sure of that!?\nvon Karma:\nSuch a silly little boy... He threw his entire case headlong into a trap!Present Max G. Promo Poster\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"You say you saw all of Max's \"uppity\" symbols?\"Moe:\nHis silk hat. That black cloak. They were all there!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou're sure that is what you saw that night?\nMoe:\nExactly what I said I saw is exactly what I saw. I've got eyes like a hawk!\nPhoenix:\n(Umm... Don't birds have terrible night vision?)\nMoe:\nBut that's not all I saw!Present Max G. Promo Poster\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"You say you saw all of Max's \"uppity\" symbols?\"Moe:\nHis face was silhouetted, but there was no doubt that it was him.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou were able to see that kind of detail from your window?\nvon Karma:\n\nvon Karma:\nThere was a light near the scene of the crime. Anyone with decent eyesight should have been able to see that much.\nPhoenix:\nOut of curiosity Moe, what is your eyesight like?\nMoe:\nI can see like a hawk out of my left eye, and an eagle out of my right eye...\nvon Karma:\nOur records say his eyesight is a perfect 20/20.\nPhoenix:\n(That must mean he could have seen the crime scene clearly.)\nJudge:\nHmm... The more we look into this matter, the more suspicious it becomes.\nMoe:\nHey! You asked me what my eyesight was like, not what it actually was!Moe:\nHis cloak was fluttering in the wind, so I couldn't really see what he was carrying.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo, you didn't actually see what the criminal was holding?\nMoe:\nThat's correct. I've been curious to know what caused that loud noise... It must have been something incredibly hard.\nPhoenix:\n(Too bad they haven't found the murder weapon to know for sure...)\nMaya:\nThey claim it was a blunt object... At least it says so in the autopsy report.Phoenix:\n(With Trilo's testimony, and now Moe's... It really seems like Max is the killer.)Maya:\nN-Nick... You've gotta find a contradiction in this.Phoenix:\nThat's not going to be enough...Maya:\nWhat?Phoenix:\nI have to prove that Moe saw someone other than Max that night! That's the only thing that will help! I've gotta do it!Phoenix:\nYou say you saw all of Max's \"uppity\" symbols?Moe:\nI suppose so... The silk hat and the cloak, right?Phoenix:\nMoe... Everyone knows that Maximillion Galactica has three uppity symbols!Moe:\nThree symbols?Maya:\nYay! Everyone get ready!! All... Together... Now...\"SILK HAT! CLOAK! WHITE ROSES!\"Moe:\nWhat the!?von Karma:\nWho cares if he knew that there were three or not! He saw what he saw. And he saw the symbols. He just forgot to mention one.Moe:\n...von Karma:\nIsn't that right, Moe?Moe:\n... Do you like Pi? I love Pi! 3.141592653589793238462643383279! Tasty!von Karma:\nSilence fool! You are to respond with the whole truth! No fractions!Judge:\nOrder! Order!Phoenix:\nMoe! You didn't see the roses, did you!?Moe:\nTo be honest... There wasn't any roses on the person I saw...von Karma:von Karma:\nThe crime scene was dark! It's obvious it was too dark to see that kind of detail!Phoenix:Phoenix:\nBut the witness said he was able to see the silhouette of the criminal's face. Not to mention that the roses are white! There's no way he could have missed them!von Karma:von Karma:\nThen the roses must have fallen off when the defendant assaulted the victim!Phoenix:\nIf that was the case, then the police would have found them near the crime scene!Judge:\nMr. Wright! Are these white roses truly material to the facts of this case?von Karma:\nClearly not! He is just toying with this court!Phoenix:\n... (I got her on the ropes now... These seemingly insignificant facts have never failed to lead me to the truth yet! (Changed from [Whenever there's a nugget of truth, it always seems to peek out at me... Then run away.] in the original release)) Someone is toying with the court, but it's not me! Your Honor! Do you recall Trilo's testimony?Trilo:\nThere's no way I could mistake someone wearing those three ridiculous symbols!Trilo:\nHow can you mistake someone with that crazy get-up and his nose stuck up so high...Trilo:\nHow could you mistake someone wearing such a snobby 3 piece get-up!Phoenix:\nTrilo saw them all! Trilo saw all three of Max's symbols! However, this witness claims there were no white roses on the person he saw! There is absolutely no doubt that this is a contradiction!Judge:\nHmm... Now what am I supposed to think? One is supposed to disregard the pointless, but this...von Karma:\nJudge! Forget the roses! Think about his other testimony! The witness has stated without a doubt that he saw Maximillion Galactica! Nothing else matters! Let's wrap this case up now!Phoenix:\nYour Honor! It may be trivial, but it does cast doubt on the prosecution's case. (Changed from [Your Honor! It may be trivial, but there should still be doubt lingering in your mind!] in the original release)Judge:\n... Frankly, I have my doubts about this witness. It seems that, unlike wine, the witness has not grown more mature with age.Moe:\nI'm not... mature...Judge:\nI've come to a conclusion... I'm 99% certain that this witness saw the defendant. However! My remaining one percent of doubt is quite reasonable! Which means that for my peace of mind, I'm going to request a bit more testimony.von Karma:\nW-What!?Judge:\nIf there are no contradictions in his next statement, I am prepared to issue a ruling.Phoenix:\n(A ruling...!!)Maya:\nNick! This is your last chance!Witness Testimony-- The Silhouette, Part 2 --Moe:\nThere's no doubt in my mind! There were no white roses that night!\nHowever, all of the other symbols were there... I'm equally sure of that.\nEspecially the silk hat! There is no way I could forget seeing the decorations on it!\nHe was wearing it the entire time that he was on the scene!Judge:\nMr. Wright... You've got one last chance at this.Phoenix:\nJust one chance?Judge:\nI will not allow even the slightest hint of badgering against this witness. If you are going to prove to me there's a contradiction with Mr. Curls' statement, you'd better have at least a shred of evidence to back up your accusations.Phoenix:\n(I've only got a single shot as [sic] this... I've got to be careful.) I understand, Your Honor. One chance is all I will need!Cross Examination",
      "testimonies": [
        {
          "testimony": "There's no doubt in my mind! There were no white roses that night!",
          "person": "Moe",
          "present": []
        },
        {
          "testimony": "However, all of the other symbols were there... I'm equally sure of that.",
          "person": "Moe",
          "present": []
        },
        {
          "testimony": "Especially the silk hat! There is no way I could forget seeing the decorations on it!",
          "person": "Moe",
          "present": []
        },
        {
          "testimony": "He was wearing it the entire time that he was on the scene!",
          "person": "Moe",
          "present": [
            "Silk Hat"
          ],
          "source": {
            "evidence_span": "Found at the crime scene.",
            "testimony_span": "He was wearing it the entire time that he was on the scene",
            "explanation": "Since the hat was found at the crime scene, it was impossible that Max was wearing it the entire time that he was on the scene.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        }
      ],
      "noPresent": false,
      "is_self_contained": "yes"
    }
  ]
}