{
  "previousContext": "Episode 3Turnabout Big Top\nLadies and Gentlemen! Boys and Girls! Welcome to the show! Prepare to witness a man who has mastered the wonder of flight... The World's Greatest Magician... The one... The only... Maximillion Galactica!\nDecember 26, 8:12 PMBerry Big CircusCircus Entrance\nPearl:\nWow... That was like being in a dream... (Changed from [Wow... That was like living a dream...] in the original release) I haven't even caught my breath yet.\nMaya:\nHehe... That was amazing! Wasn't it Pearly!?\nPearl:\nIt was great! There was a dancing bear... And a tiger that jumped through a ring of fire... An elephant that rode a giant ball... (Changed from [And a tiger that jumped though [sic] a ring of fire... An elephant who rode a giant ball...] in the original release) Not to mention that guy who flew through the air!\nMaya:\nYeah! Max Galactica! He was absolutely fabulous!\nPearl:\nHuh? ...What? Max...\nMaya:\nMax Galactica! The World's Greatest Magician!\nPearl:\nA magic-ician?\nMaya:\nNo, a magician.\nPearl:\nUmm... Mr. Nick.\nPhoenix:\nHuh? What is it, Pearls?\nPearl:\nDoes magic have anything to do with channeling spirits?\nPhoenix:\n(I don't think it has anything to do with channeling...) You don't know about magic, do you Pearls?\nPearl:\nI'm sorry...\nPhoenix:\n(I braved the winter cold and took Pearls to see the circus. It's been six months since the incident in Kurain Village... and it was during that trying time that I met Pearls... (Changed from [It was during that terrible time that I met Pearls...] in the original release) Thankfully, she seems to be recovering from it, and is returning to her normal self. (Changed from [It seems like she is starting to get back to normal...] in the original release))\nMaya:\nAhh... It's time to go.\nPearl:\nYou're right. We can't miss the last train.\nPhoenix:\nPearls! You remembered the train!\nPearl:\nOf course I did! But I don't really understand what everyone means by \"express train\".\nMaya:\nWell, Nick... See you later. I'll come by to help clean the office. It's gotta be spotless for the new year.\nPhoenix:\nDon't worry about it. Really.\nPearl:\nYou are going to visit Mr. Nick on New Year's?\nMaya:\nMaybe.\nPearl:\nI am glad you will get to spend your New Year's with your special someone!\nMaya:\nP-PEARLY!! Look! It's time to go!\nPearl:\nHappy New Year, Mr. Nick!\nPhoenix:\n(\"Happy New Year\"... I really hope it will turn out that way...)\nDecember 28, 9:12 AMWright & Co. Law Offices\nPhoenix:\n(Well... Today wraps it up for this year... I hope I can finish cleaning this place up in one day.)\nPhone:\n.............................. ...*beep*...\nPhoenix:\n...Hello. This is the Wright & Co. Law Offices.\nMaya:\nNick!! It's t-t-terrible!!\nPhoenix:\nAhh, Maya. Perfect timing... Things are terrible here too!\nMaya:\nHuh?\nPhoenix:\nThe office is a terrible mess! And I have to clean it up!\nMaya:\nWhat are you talking about!?\nPhoenix:\nUmmm... My dirty office. What are you talking about?\nMaya:\nListen Nick! You have to turn on the TV!\nPhoenix:\n(The TV?)\nTV:\n...Now let's check in at the scene!\nPhoenix:\n(Huh? What happened...?)\nTV:\n...Thank you. We're here at the Berry Big Circus. The Berry Big Circus has become the center of a sensational murder. The scene has created quite a stir among the throngs of excited onlookers!\nPhoenix:\nThe Very... I mean... The Berry Big Circus...\nMaya:\nThat's the circus we went to!! Right!?\nPhoenix:\nThey're saying that there was a... murder.\nMaya:\nYeah! They arrested him too!\nPhoenix:\nA-Arrested who?\nMaya:\nMax! They arrested Max Galactica!!\nPhoenix:\n(Maximillion Galactica. Fans call him Max. A popular magician who can fly through the sky at will... Maya said she was a huge fan of Max...)\nMaya:\nAlright Nick! I'll see you in two hours at the Detention Center.\nPhoenix:\nHuh? What?\nMaya:\nSee you there. You've still got plenty of time to clean up your office later!\nPhoenix:\nW-WWWHHHAATTT!?\nPhone:\n...*beep*...\nDecember 28, 11:19 AMDetention CenterVisitor's Room\nMaya:\nWhat are they talking about? Why did they arrest Max?\nPhoenix:\nYou're asking the wrong man on that one, Maya. Maybe he used his magical skills to deal death with a slight [sic] of hand...\nMaya:\nMaximillion Galactica would never do such a thing!!\n???:\nFABULOUS!! What the young lady just said was absolutely fabulous! What a clever girl! Such a fabulous understanding of events!\nPhoenix:\n(...What's with all this fabulous talk...)\nMax:\nWelcome to the Visitor's Room!\nMaya:\nIt's MAX!! Nick!! Look! It's the real Maximillion Galactica!!\nMax:\nAlright sweetie. Pick a card, any card.\nMaya:\nH-H-He called me sweetie! *swoon* Nick!!\nMax:\nAh ha ha ha... Time's running out sweetie! Pick a card, any card!\nMaya:\nT-This one...\nMax:\nUh-huh. I thought you would pick that one sweetie. The ace of hearts!\nMaya:\nAHHHH!!! He got it! He got it! NICK! LOOK! HE GOT IT!!\nMax:\nWhat can I say sweetie... You've stolen one of my most valued possessions. One of Maximillion Galactica's hearts...\nMaya:\nMax... *swoon*\nMax:\nWell... Time to make this an absolutely fabulous time!\nMaya:\nMax! You should let Nick pick a card!!\nPhoenix:\n(Eek... I don't want to steal one of his hearts...)\nMax:\nAnd you are...? Oh, how silly of me! You must be sweetie's driver!\nPhoenix:\nHer driver?\nMax:\nWhatever... Hurry up and pick a card, any card...\nPhoenix:\nUmm... I want this one.\nMax:\nSo sweetie, let's be honest here... You came to this visitor's room to visit me, didn't you?\nMaya:\nY-Yes! I'm your biggest fan!!\nMax:\nFabulous! Absolutely fabulous! Thank you so much!!\nPhoenix:\nHey... Umm... What about my card?\nMax:\nThink of it as a souvenir.\nPhoenix:\n...\nMaya:\nWell Nick... I think it's time to get to work.\nPhoenix:\n...\nMaya:\nWhat's the matter, Nick? Why are you looking at the ceiling?\nPhoenix:\nI was just thinking about what I should have for lunch.\nMax:\nSweetie... Drop porcupine head over there. Shower me with your attention. OK?\nMaya:\nO-O-O-Oh, yes...! (Changed from [Y-Y-Y-Yes...] in the original release)\nMax:\nAb-so-lute-ly... FABULOUS!!\nPhoenix:\n(Absolutely cringe inducing.)\nAfter clearing all Talk options and presenting Attorney's Badge:\nMax:\n... Anyways... I've been curious about something for a while now.\nMaya:\nWhat's that?\nMax:\nWhy do you keep looking at me with such a sad look on your face, sweetie?\nMaya:\nBe-Because! You've been arrested! For murder!\nMax:\nOh, don't be ignorant. They wouldn't arrest someone like me!!\nPhoenix:\nWhy is that?\nMax:\nObviously because I'm the fabulous Maximillion Galactica!\nPhoenix:\nSo?\nMax:\nI'm the very big star of the Berry Big Circus.\nPhoenix:\nAnd that means?\nMax:\nI'm rich. I'm paid fabulous sums!\nPhoenix:\nWhich means what?\nMax:\n...\nMaya:\nMax...\nMax:\nQuit joking around! You've got to be pulling my magic wand! The police aren't really serious about all this, are they?\nPhoenix:\nThey don't arrest people as a joke.\nMax:\n...!!\nMaya:\nLook at Max... He's crushed...\nPhoenix:\nWell he needed to wake up and smell the coffee. (This is serious business.)\nMax:\nUmm... Umm...\nPhoenix:\nYes?\nMax:\nPorcu... I mean, Sir. You're a lawyer, right?\nPhoenix:\nHuh? Oh, yeah. I'm an attorney.\nMax:\nPlease! Help me! I didn't kill nobody!\nMaya:\n\"Didn't kill nobody!?\"\nMax:\nI may be more spoiled than a hog in a hamburger mud pit... But a killer!? That's insane... I... I... I could never...\nMaya:\nM-Max?\nMax:\nI swear!! I just wanted to pay off my daddy's debt... He's back on the farm...\nPhoenix:\nOK... OK... I'll take your case.\nMax:\nR-Really?\nPhoenix:\nReally.\nMax:\nUh... Thank ya much. Ya'll sure are nice folks.\nMaya:\nUmm... Max.\nMax:\nYes?\nMaya:\nWhat's your real name?\nMax:\nIt's Billy Bob Johns...\nMaya:\n............ (Changed from [... Ugh...] in the original release)\nPhoenix:\nWhat's the matter, Maya?\nMaya:\nHe's really just a country bumpkin!\nPhoenix:\n...\nMax:\n...Ahem. I must apologize for not being my absolutely fabulous self just now, sweetie.\nMaya:\nH-Huh?\nMax:\nMr. Attorney.\nPhoenix:\nYes?\nMax:\nA few minutes ago, you took one of my cards, didn't you?\nPhoenix:\n(Hmm... Now that he mentions it... I did take a card.)\nMax:\nIt was the 10 of Hearts. Right?\nPhoenix:\n(Wha... How'd he... He got it right, again!)\nMax:\nWhat can I say? You, too... You've stolen some of my most valued possessions. Ten of Maximillion Galactica's hearts...\nPhoenix:\n(You sure do have a lot of hearts, don't you?)\nMax:\nAh ha ha ha... I'm putting my faith in you sweetie.\nPhoenix:\n(He didn't just call me sweetie, did he?)\nMaya:\nAlright! Let's make this an absolutely fabulous case! C'mon, Nick!\nDecember 28Wright & Co. Law Offices\nPhoenix:\nAlright... We've got lots of things we have to look into. No time for slacking. Let's get going.\nMaya:\nOK.\nPhoenix:\n? What's the matter? You seem down.\nMaya:\nMaximilion Galactica... Who would have guessed he was country bumpkin?\nDecember 28Berry Big CircusCircus Entrance\nMaya:\nWe're here again...\nPhoenix:\nYep. But this time we are here for work. (It hasn't been that long since the crime, so the police are still on the scene.)\nMaya:\nLet's find someone who might know something about what happened.\nPhoenix:\nSounds like a plan.\nDecember 28Lodging HousePlaza\nPhoenix:\nThis seems to be a dorm where all the performers in the circus stay...\nMaya:\nReally!? So we might run into that stoogey clown here, right? He's so kooky! (Changed from [Really!? So that stoogey clown should be here, huh? He's so kooky!] in the original release)\n???:\nAhhh! It's you two!\nMaya:\nOh... Detective Gumshoe!\nGumshoe:\nHow is it you guys always seem to know when I'm working a crime scene, pal? (Changed from [I always see you hanging around when I'm working a crime scene, pal.] in the original release)\nMaya:\nBecause you're always working, Detective. (Changed from [You always seem to be working so hard, Detective.] in the original release)\nGumshoe:\nWell, I'd rather not be always working, but with crime, you don't make your own hours. (Changed from [I'd rather not be working hard, but with crime you don't make your own hours.] in the original release) If I have to be at the circus anyway, I want to see the lion tamer and the tightrope. However, no matter where I go, the show is always the same... Dead body. Stage left.\nMaya:\nNick! Nick! He complained!!\nPhoenix:\nHeh heh... That's a rarity. Let's get back to business now, OK?\nAfter clearing \"The eyewitness\" Talk option in Lodging House - Plaza:\nDecember 28Lodging Hall 1st FloorMoe's Room\nPhoenix:\nI wonder whose room this is. (Changed from [This is it?] in the original release)\nMaya:\nThe nametag on the door says \"Moe\" on it.\nPhoenix:\nI guess he's not here...\nMaya:\nWow... It's a real mess in here!\nPhoenix:\n(My room's probably worse though...)\nMaya:\nOh well... I give up. We'll have to come back later.\nDecember 28Berry Big CircusBig Top\nPhoenix:\nThe circus stage sure doesn't look this small from out in the audience...\nMaya:\nWow... This is where they all perform, isn't it? Nick! Do some somersaults!\nPhoenix:\nI'm not doing any somersaults.\nMaya:\nWhy not!? You look like you'd be great at it!\nPhoenix:\n(Why do I look like I'd be great at somersaults!?)\n???:\nGrrrrrrrrrrrrrr...\nMaya:\nHuh? Nick?\nPhoenix:\nIt wasn't me.\n???:\nGrrrrrrrrrrr... Grawwwwwww!!\nMaya:\nT-T-T-T-T-T-T... TIGER!!\nPhoenix:\nH-H-H-He's c-c-coming this way!!\n???:\nGrrrrrrrrr... Grawwwwwww!!\nPhoenix:\nAHHHHHHHHHHH!!\nMaya:\nNick! You're too young to die! NICK!!\n???:\nSTAY! STAY! HEEL!\n???:\nGrrrrrrrrr...\nPhoenix:\n(I'm still here... I'm not dead, yet!!)\nMaya:\nN-Nick! Nick! Are you OK?\n???:\nAhahaha! Scared ya didn't I? Regent is such a cute tiger! Isn't he!?\nPhoenix:\n...\nMaya:\n...\n???:\nWhat's the matter? You two sure are quiet.\nMaya:\nDon't \"What's the matter?\" me! N-Nick... He almost died there!!\n???:\nHah! He wasn't anywhere close to getting hurt, let alone dying! This little tiger hardly ever bites people. And besides, people normally never get to play with a wild tiger, right? So if you think about it, you're actually really lucky!\nPhoenix:\nHuh!?\n???:\nYou agree, don't you?\nPhoenix:\n... I guess...\nMaya:\nW-W-W-What do you mean you guess!? Why are you agreeing with her?\n???:\nWoohoo!! Your costume...\nMaya:\nEh?\n???:\nIt's cute. I wanna try it on!!\nMaya:\nC-Costume? You mean my clothes...?\n???:\nYou don't mind letting me try it on, right?\nMaya:\nUhh... I guess not...\n???:\nREALLY!? Hehehehehe!! You're the best!\nPhoenix:\n(Wow... The tables turned quickly on that one. So much for the tiger thing...)\n???:\nOh! I forgot to introduce myself. I'm Regina Berry... The renowned animal tamer of the Berry Big Circus!\nMaya:\nMy name's Maya Fey. I'm a spirit medium.\nPhoenix:\nPhoenix Wright. Attorney at law. (When you put us up next to an animal tamer, I bet we really look odd!)\nRegina:\nNice to meet ya!\nPhoenix:\nUhh... Likewise...\nDetention Center\nAfter clearing \"Something unusual\" and \"The eyewitness\" Talk options in Lodging House - Plaza, and visiting Big Top:\nDecember 28Detention CenterVisitor's Room\nMaya:\n... Max isn't here.\nPhoenix:\nHe must be in questioning.\nMaya:\nAww... I wanted to see a magic trick.\nPhoenix:\nHe should be back in a little bit.\nMaya:\nI guess so.\nLodging House - Plaza\nWright & Co. Law Offices\nAfter presenting Russell Berry profile in Berry Big Circus - Big Top:\nDecember 28Big TopRingmaster's Room\nMaya:\nThis was the Ringmaster's room?\nPhoenix:\nYes. This room belonged to the victim. Which means this must be where Max met the Ringmaster last night.\nMaya:\nNow that you mention it, that is what he said.\nPhoenix:\nI wonder what... Hmm... That's an interesting poster. (Changed from [I wonder what... Hmm... That's an intresting [sic] poster.] in the original release)\nMaya:\nAh! It's a poster of Max! I want it! I want it! Nick! I want it!\nPhoenix:\nI wanna get outta here...\nAfter clearing \"The eyewitness\" Talk option in Lodging House - Plaza and clearing \"\"What's on your mind?\"\" Talk option in Berry Big Circus - Big Top:\nDecember 28Berry Big CircusCircus Entrance\nMaya:\nHuh? Hey Nick! Look over there!\nPhoenix:\nWhat?\nMaya:\nThere's someone over there! Ex-Excuse me!\n???:\n...\nPhoenix:\nHello.\n???:\n...\nMaya:\nWow! He sure is a quiet one! Excuse me!!\n???:\nWha... Ha... Huh? M-Me?\nPhoenix:\nYes. You work at the circus don't you?\n???:\nN-No. I'm just your everyday average Joe.\nMaya:\nAn average Joe who just happens to hang out at the circus? I don't think so.\n???:\nY-Yes I am. I've got nothing to do with what's going on here.\nPhoenix:\n(He's lying. Like any regular person would hang around the circus... Dressed like that!) I'm an attorney. My name is Phoenix Wright.\nMaya:\nI'm a spirit medium. My name is Maya.\n???:\nWell... I... Um... Just happened to be... Umm... Passing by...\nPhoenix:\nI don't suppose you happen to be some kind of carny?\n???:\nNot a c-c-carny... I-I'm a p-performer. Actually, I'm a v-v-v-ventriloquist.\nMaya:\nVentriloquist?\n???:\nHe-he-he-he-he-he-he... I-I-I'm Benjamin Wo-Wo-Wo-Woodman...\nMaya:\nYour last name is Woodman? *snicker* (Changed from [You're [sic] last name is Woodman? *snicker*] in the original release)\n???:\nY-Yes... T-T-That's right... But e-everyone c-c-calls me B-B-B-B-B-Ben.\nMaya:\nAh... Yes yes yes... That's your alias, right?\nPhoenix:\nI believe they call it a stage name.\nBig Top\nWright & Co. Law Offices\nAfter clearing \"Something unusual\" and \"The eyewitness\" Talk option in Lodging House - Plaza and clearing \"\"What's on your mind?\"\" Talk option in Berry Big Circus - Big Top, then visiting Berry Big Circus - Circus Entrance:\nDecember 28Lodging Hall 1st FloorMoe's Room\nMaya:\nHello...?\n???:\nKABLAMMO! CONGRATULATIONS! YOU'RE THE BIG WEINER! The one millionth visitor to the room of one Mr. Moe Curls, AKA ME!!\nPhoenix:\n(Earplugs... Must... Find... Earplugs...)\nMoe:\nTo celebrate this momentous occasion, would you care for an organic grape? Just one! Did you get my joke right there!? Aha! Aha! Aha! Aha! Aha!\nPhoenix:\n...\nMoe:\nI welched on giving you more than one!!\nPhoenix:\nUmm...\nMoe:\nNo no no! If it was funny, it is your duty as a human being to laugh!! People who don't laugh are usually last-seen in Lan-sing. Catch my drift? Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha!\nPhoenix:\nUmm... Maya?\nMaya:\nAha! Aha! Aha! Aha! Aha! Aha! Aha! Aha!\nPhoenix:\n(This is like some Faustian nightmare...)\nMaya:\nC'mon! It was funny! Clowns are always funny in my book!\nPhoenix:\nIn my book, they're just funny lookin'.\nMoe:\nYou sure do have a great taste in clothes girlie! Look at that garb! You look just like Gretta Garb... OH! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha!\nPhoenix:\n*sigh* I'm goin' home...\nMaya:\nNo! Nick! You can't!!\nPhoenix:\nYou know, I can excuse a bad joke or two... But this stooge keeps laughing at his own jokes! That's what I object to!\nMaya:\nOK OK... I get it. But you have to admit he is kinda funny...\nPhoenix:\n(Argghhh... No, I do not have to admit that, because he isn't!)\nMoe:\nAha! Aha! Aha! Aha! Aha! Aha! Aha! Aha!\nWright & Co. Law Offices\nBig Top\nAfter presenting Max profile in Lodging Hall 1st Floor - Moe's Room:\nDecember 28Big TopCafeteria\nMaya:\nEww... This place is gross.\nPhoenix:\nThis must be because of last night. They didn't have time to clean up after dinner because of the murder.\nMaya:\nThat reminds me... What was it that Moe said?\nPhoenix:\nHe said that yesterday morning Max \"clonked\" Ben over the head here.\nMaya:\nHe also said that, \"There's Gotti be something interesting there.\" Nick? What's \"Gotti be interesting?\"\nPhoenix:\nDon't ask...\nMaya:\nHmph!\nAfter examining posters and table in Big Top - Ringmaster's Room and clearing all Talk options in Lodging Hall 1st Floor - Moe's Room:\nDecember 28Detention CenterVisitor's Room\nMax:\nOh! It's my two sweeties! Welcome to the Detention Center!!\nPhoenix:\n(...*sigh* Did he just call me his sweetie!? AGAIN!?)\nMax:\nWhat's on today's agenda? What can I help you with?\nPhoenix:\nWell, we've gathered quite a few clues...\nMax:\nWON-DER-FUL-LY FAN-TAB-U-LOSO!! I mean fabulous!\nPhoenix:\nThat's why we came to meet with you again.\nMax:\nWh-Wh-What's w-w-wrong!? Quit making such a scary face!\nPhoenix:\nOK then Max... Let's make this \"absolutely fabulous\"!!\nAfter clearing \"\"Shut him up\"\" Talk option in Detention Center - Visitor's Room:\nDecember 28Berry Big CircusCircus Entrance\nMaya:\nHuh? Ben's not here anymore!\nPhoenix:\nYeah... I wanted to ask him something.\nMaya:\nIt's cold out... He's probably in the tent.\nDecember 28Berry Big CircusBig Top\nMaya:\nWhat do you think, Nick? I wonder if we've been making any progress...\nPhoenix:\nDon't be so negative... Of course we are making progress.\nMaya:\nBut... Everyone loved the Ringmaster... And there's no sign of footprints on the scene... There's still a lot of mysteries left to be solved.\nPhoenix:\nOf course.\nMaya:\nAnd now Regina isn't here!\nPhoenix:\nI'm not seeing how that's related...\nDecember 28Big TopRingmaster's Room\nMaya:\nIt looks the same as always... A great big mess. Considering how messy it is, I bet they wouldn't notice if another poster went missing.\nPhoenix:\nWill you just stop it, you poster pilferer!\nMaya:\nI'm just kidding! You know I already got one of these posters!!\nPhoenix:\nYou mean \"stole\" one of those posters!\nMaya:\nYeah... Uh... Let's focus on what Max told us. He said that he hid Trilo somewhere in this room.\nPhoenix:\n(Trilo... Ohh! The ventriloquist's puppet!)\nDetention Center\nDecember 28Big TopCafeteria\nMaya:\nOh! Hey Ben!\nBen:\nA... Umm... Uhh... H-H-Hello.\nMaya:\nHello to you too! It's awfully cold today don't you agree?\nBen:\nY-Ye-Ye... Uhh... I-I d-do indeed.\nMaya:\nDon't you think it's cold Nick?\nPhoenix:\n(I don't see how talking about the weather is helping our case.)\nMaya:\nAhh... Ben... This is yours, isn't it?\nBen:\nY-Y-Yes!! T-That's mine!\nMaya:\nHere ya go!\nTrilo Quist returned to Ben.\nPhoenix:\nAlright Maya... Let's get going!\nMaya:\nIt's that time isn't it? See ya around, Ben!\nBen:\nO-O-O-OK...\nMaya:\nSo Nick... Where are we going next?\nPhoenix:\nLet's see... Maybe we should go talk to the clown once again.\nHEY! WAIT!!\nMaya:\nWho said that?\nWHAT ARE YOU LOOKIN' AT? I'M RIGHT HERE YOU BLIND WENCH!\nTrilo:\nWhat's your problem anyways? Don't you know how to properly greet someone!?\nMaya:\nBen? Is that you Ben?\nBen:\nNO! NO! NO! NO! NO! NO! NO! I would never...\nTrilo:\nIt was me! Yeah me! Down here!!\nPhoenix:\nYou... You're... Trilo!?\nTrilo:\nThat is Mr. Quist to you sir! Learn some manners before you just blurt out my name! Now try speaking to me again, but this time with some proper respect!\nPhoenix:\n(Not again... *sigh*) Mr. Quist... Is that better?\nTrilo:\nNo! Look at me when I am talking to you, you 8-bit excuse for an attorney!\nBen:\nTrilo! We talked about insulting people! You promised!!\nTrilo:\nBut he was mocking me! Not being mean to bullies was not included in the deal! (Changed from [But he was mocking me! Being mean to bullies was not included in the deal!] in the original release)\nBen:\nI'm sorry, Trilo...\nMaya:\nNick! What just happened? Trilo is still a puppet right? A ventriloquist's puppet!\nTrilo:\nHey! Who do you think you are, calling me a puppet!?\nAfter clearing all Talk options:\nBen:\nUmm... Uhh... Thanks... Now that Trilo's here...\nPhoenix:\n\"Now that Trilo's here...\" Does that mean you can talk normally now?\nTrilo:\nHey! Buttface!\nMaya:\nAHHH!\nTrilo:\nYou must be looking forward to tomorrow, aren't you Mr. Ambulance Chaser!?\nPhoenix:\nUhh...\nTrilo:\nYou know... It's time to get rid of that pesky magician once and for all!!\nMaya:\nTri... Trilo?\nTrilo:\nEnough jibba jabba! Let's get to court already!\nPhoenix:\nAhh... Hey! Wait a second!\nMaya:\nNick... What's going on?\nPhoenix:\nHe's a witness for tomorrow's trial...\nMaya:\nAhhhhh...\nDecember 28Berry Big CircusBig Top\nMaya:\nHmm... What in the world happened with Ben and Trilo?\nPhoenix:\nQuite a pair, those two. What did that puppet see anyways?\n???:\nOooooh!\nPhoenix:\nOh no... Now what!?\n???:\nOooo-Ooooh!\nPhoenix:\nAhhhhh... Yeowwwwwwwww... Ahhhhhhhhhh...\nMaya:\nHey! Welcome back, Nick! (Changed from [What is it, Nick?] in the original release)\nPhoenix:\nT-T-That monkey... ... AHHHH! My badge!! That monkey stole it!!\nMaya:\nWHHHAAATTT!?\nRegina:\nHehehehehe! Mr. Attorney, that face was so cute. You looked so completely dumbfounded!\nMaya:\nRegina!!\nPhoenix:\nYou!! That monkey!!\nRegina:\nHey... No need to get angry... OK?\nPhoenix:\nB-B-But!! My attorney's badge!!\nRegina:\nDon't worry... I'll help you out.\nPhoenix:\nOK... If you say so... (If I don't get my badge back, how can I flash it?)\nRegina:\nBy the way... The monkey's name is Money. Money the monkey.\nMaya:\nHis name is Monke... Money?\nAfter presenting Trilo Quist, then clearing all Talk options in Big Top - Cafeteria:\nDecember 28Lodging HousePlaza\nMaya:\nHuh? Detective Gumshoe took off already.\nPhoenix:\nYeah... Probably because we ditched him earlier. (Changed from [Yep. Just leave him alone for a while, OK Maya?] in the original release) I bet he and the other cops got lonely and headed back to the precinct. (Changed from [I'm sure he just got lonely and headed back to the precinct.] in the original release)\nDecember 28Lodging Hall 1st FloorMoe's Room\nMoe:\nOh my! If it isn't \"Mr. Wright All The Time\"!!\nPhoenix:\n*ugh*\nMoe:\nIt's all Wright to be wrong every now and again, Wright?\nMaya:\nSee Nick! It just took awhile for the joke to find its audience!\nPhoenix:\n... *sigh*\nMoe:\nSo what can I do for you? Did you remember a good joke you wanted to tell me? Pull up a chair, or maybe just pull my finger, and let me have it.\nMaya:\nWe're going to get the same sound effect either way, aren't we?\nMoe:\nHow'd you know I put a whopee [sic] cushion on the chair!? You really know what it takes to be a clown, don't you? Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha!\nDecember 28Lodging Hall 3rd FloorAcro's Room\nPhoenix:\n*huff* *huff*\nMoe:\nThis is it... What's wrong, Mr. Wright?\nPhoenix:\nI... can't... breathe...\nMoe:\nDon't be such a wimp! You only had to climb two flights of stairs!!\nPhoenix:\n*pant* *pant*\nMoe:\nAnyways... This is the place. Acro's room.\nPhoenix:\nAcro?\nMoe:\nHe's an acrobat... It seems like he's not around today...\nMaya:\nEh... That's a big pile of junk over in the corner...\nMoe:\nI don't think it'd be wrong to assume that Phoenix's stuff is over there too... Just be careful to make sure you've got the Wright stuff.\nMaya:\nThanks Moe! See you later!\nMoney has been added to the Court Record.\nAcro's Room\nMaya:\nHoly cow! There's a fork... And a mirror... Everything's shiny!! There's even a really cheap looking knockoff wristwatch!\nPhoenix:\nLook at this! It's a trophy! And it's really heavy!!\nMaya:\nNick! I found it! Your badge! It's right here!!\nAttorney's Badge returned to its rightful spot on lapel. (Changed from [Phoenix's Attorney's Badge has been returned.] in the original release)\nPhoenix:\nThanks! You really saved me! ... Huh?\nMaya:\nWhat's the matter? Did you find something?\nPhoenix:\nYeah. Check this out.\nMaya:\nIt's a ring...\nPhoenix:\nThere's something engraved on it... \"From T to R\"...\nRing put in pocket.\nPhoenix:\nWell... I think it's about time we wrap up our investigation...\nMaya:\nDo you think we'll win in court tomorrow?\nPhoenix:\nWho knows... Even I can't imagine what kind of testimony will come out tomorrow. (I'm guessing Moe will be a witness in court tomorrow... Moe and maybe the puppet.)\nMaya:\nDon't worry Nick. No matter what, we've still got a magician on our side!!\nPhoenix:\nThat's good, because we might need some magic tomorrow...\nTo be continued.\nMoe's Room (before examining junk pile in Lodging Hall 3rd Floor - Acro's Room)\nMaya:\nHuh? Moe must have gone off somewhere...\nPhoenix:\nJust as long as he isn't off writing new jokes...\nMaya:\nOh, that reminds me Nick... You have to get your Attorney's Badge back by tomorrow, or we're in trouble.\nPhoenix:\nI know. I know. (I'm gonna have to try and find out where that monkey hid it...)\n\nDecember 29, 9:43 AMDistrict CourtDefendant Lobby No. 5\nMax:\n...\nPhoenix:\nGood morning Max.\nMax:\n...\nMaya:\nMax?\nMax:\nMil... Milk...\nMaya:\nWhat?\nMax:\nIf I don't have a glass of milk before I go on stage... I just can't function sweetie.\nMaya:\nSt-Stage? Don't worry... There won't be a stage. All you have to do is sit down.\nMax:\nI guess...\nMaya:\nNick. Max is really nervous.\nPhoenix:\nThat's understandable.\nMax:\nHey! My sweeties!!\nPhoenix:\nW-What!?\nMax:\nYou don't think I should fly, do you?\nPhoenix:\nHuh?\nMax:\nYou know... You've got to make a good first impression! When I enter the room, maybe I should fly in and warm up the crowd a little...\nPhoenix:\nNo no no no no... We can't be having you flying around the courtroom... It just wouldn't be right. Imagine if you hit someone!\nMaya:\nDon't worry Max... Just do what Nick says and everything will be OK.\nMax:\nOh sweetie!!\nPhoenix:\nWhat is it this time, Max?\nMax:\nWhy don't you try flying into the courtroom?\nPhoenix:\n...\nMax:\nI can see it now... The dashing young lawyer flying fabulously in from above! One glimpse of that, and everyone in the room will be on your side!\nMaya:\nMax... Really... No one needs to fly today. ... Nick? What's with that look in your eyes?\nPhoenix:\n(I like the sound of that... \"Dashing young lawyer flying fabulously...\")\nDecember 29, 10:00 AMDistrict CourtCourtroom No. 2\nJudge:\nAnd now the case of one... ............\nPhoenix:\n............\nvon Karma:\n............\nJudge:\n............ What!?\nvon Karma:\nYour Honor! Get on with it!\nJudge:\nOh... Sorry... I just realized that the defendant's name is Billy Bob Johns.\nPhoenix:\nSo...\nJudge:\nWell, isn't the defendant also known as Maximillion Galactica?\nPhoenix:\nYes, Your Honor, he does often go by that name.\nJudge:\nYou know, my grandchild is a huge fan of his. I think everyone here wouldn't mind if we call the defendant Maximillion Galactica... It sounds more... Friendly.\nPhoenix:\n(Hmm... I wonder if that is to our advantage?)\nJudge:\nMs. von Karma. Your opening statement if you please.\nvon Karma:\n...I hope you didn't bother thinking you'd win this one Mr. Phoenix Wright.\nPhoenix:\nEh?\nvon Karma:\nThat spirit channeling trial was a sham! I refuse to acknowledge its legitimacy! It did not count! Do you hear me!?\nPhoenix:\n(She must still be upset about what happened last time...)\nvon Karma:\nYou have no chance. Zero. Zilch. Nada. I'm not losing this case! Why, you ask? Because it is not in the nature of a Von Karma to lose at anything!!\nMaya:\nI guess being born with the name Von Karma is a free pass to be arrogant and annoying.\nvon Karma:\nWatch and learn, Mr. Phoenix Wright! I'll show you the textbook procedure for proving how absolutely guilty you are!!\nPhoenix:\nM-M-M-Me!? ... Guilty!? What are you talking about!?\nvon Karma:\n...It will be my ultimate revenge...\nMaya:\nBut it's not like it'll bring her dad back... (Changed from [Her dad is gone you know...] in the original release)\nvon Karma:\nThere. Opening statement complete. Now, let's hurry and wrap up this waste of time. (Chagned from [The prosecution is finished. Let's hurry and wrap up this waste of time.] in the original release)\nJudge:\nVery well. You may call your first witness Ms. von Karma. (Changed from [You may call your first witness Ms. von Karma.] in the original release)\nvon Karma:\nDetective Dick Gumshoe! Get up there! NOW!!\nvon Karma:\nSorry to keep you from work, as I'm sure you need every penny you can earn, Detective.\nGumshoe:\nDon't mention it! It's no trouble at all! I've been looking forward to this.\nvon Karma:\nVery well. I would like you to begin by shedding light on the events in question.\nGumshoe:\nAt your service, sir.\nJudge:\nAlright, Detective. You may proceed with your testimony.\nWitness Testimony\n-- Details of the Events --\nGumshoe:\nThe night of the crime, snow was falling until 9:40 PM, making it extremely cold out.\nAll of the circus performers gathered in the Big Top to practice their routines.\nThe practice session broke up around 10 PM.\nThe murder itself took place in the plaza in front of the lodging house at 10:15 PM.\nThe victim was found bent over a wooden box dead as a doornail.\nThe cause of death was blunt force trauma that snapped a vertebrae in his neck.\nJudge:\nI see... He was beaten to death.\nGumshoe:\nHere is the autopsy report for the victim.\nJudge:\nThe court accept [sic] this into evidence.\nAutopsy Report added to the Court Record.\nJudge:\nA blunt object... Hmm... Very well... Mr. Wright, you may begin your cross-examination.\nPhoenix:\nYes, Your Honor.\nCross Examination\n-- Details of the Events --\nGumshoe:\nThe night of the crime, snow was falling until 9:40 PM, making it extremely cold out.\nGumshoe:\nAll of the circus performers gathered in the Big Top to practice their routines.\nGumshoe:\nThe practice session broke up around 10 PM.\nGumshoe:\nThe murder itself took place in the plaza in front of the lodging house at 10:15 PM.\nGumshoe:\nThe victim was found bent over a wooden box dead as a doornail.\nGumshoe:\nThe cause of death was blunt force trauma that snapped a vertebrae in his neck.\nMaya:\nThere wasn't much that we could go after Gumshoe with this time...\nPhoenix:\nHe gave us the facts, as he saw them. But there's gotta be more to this.\nMaya:\nI didn't see anything... But that's why you're the lawyer and I'm the medium.\nAfter pressing first and sixth statements and selecting \"About the contents\" upon pressing fifth statement:\nJudge:\nWell, I think we have a good feel for the details of the event now.\nPhoenix:\n(I guess that's all we're gonna get out of Gumshoe in this case...)\nMaya:\nYou mean all we're gonna get out of him is that little bottle of pepper?\nvon Karma:\nNow that we have wrapped up with the Detective, I'd like to call my next witness.\nGumshoe:\nEh? I'm not even off the stand yet!\nvon Karma:\nObviously... But that's due to you being slow and unable to take a hint!\nGumshoe:\nI dunno, but \"wrapped up\" has such a mean sound to it... I'm a sensitive guy...\nJudge:\nThank you very much, Detective Gumshoe. You may step down. Ms. von Karma. Call your next witness.\nvon Karma:\nI would like to call Mr. Benjamin Woodman to the stand.\nPhoenix:\n(She must be talking about Ben the ventriloquist...)\nMaya:\nI wonder if Trilo will show up on the stand as well...?\nvon Karma:\nPlease state your name and occupation for the record.\nTrilo:\nMy full name is Trilo Quist. I am employed as an opera tenor.\nJudge:\nEx-Excuse me! The witness called to the stand was one Mr. Benjamin Woodman, Ventriloquist.\nTrilo:\nThat robe must be cutting off your circulation. I said that I was a singer!! Maybe you don't believe me. Fine. I'll grace you with a song. *Ahem*... Mi mi mi mi mi! The world of the law... Exciting and daring... Guilt or innocence... Decided by a judge dressed up like a woman!! ...Well, what do you think?\nvon Karma:\n...\nJudge:\n...\nMaya:\nIt had a good rhythm...\nPhoenix:\nIt's just the lyrics... They leave something to be desired, so to speak.\nBen:\nT-Trilo! You know better than to insult a judge!!\nTrilo:\nShuddup! Just look at your nose. You would think you'd have the sense to fix it!! It's so ugly I want to punch you in the face on the off change swelling would help. You know that your nose is the reason you'll never be an A-List star.\nMaya:\nCelebrities must really enjoy saying everything that flashes into their minds.\nJudge:\nWhat's going on here!? Order! Order! I demand to know who the witness is!!\nBen:\nDon't... Don't worry about me, sir. I'll let Trilo handle this.\nJudge:\nI'm not worried about you one bit... I'm worried about getting testimony in my court! OUCH!!\nvon Karma:\nYou won't get anywhere trying to figure out this witness! Now let's proceed!\nWitness Testimony\n-- What You Witnessed --\nTrilo:\nOnce practice was over, I left the tent with the stooge... I mean clown.\nOnce we got to the lodging house, I ditched him and went back to the plaza's entrance. (Changed from [Once we got to the lodging house, I ditched him and went over to the plaza.] in the original release)\nThat's when I saw Max, heading towards the scene of the crime.\nHe was the only one heading that way... How could that punk not be the killer!?\nThen the police showed up, and took magic boy away.\nvon Karma:\nYou saw Maximillion Galactica heading towards the scene? You're sure of that?\nTrilo:\nWithout a doubt. He had on his silk hat, cloak, and the dumb white roses on his chest. How can you mistake someone with that crazy get-up and his nose stuck up so high...\nJudge:\nTh-That's enough... I think we all get the picture. Just one thing... You said you \"ditched\" the clown.\nTrilo:\nThat's right, dress-boy.\nJudge:\nWell, since you weren't with him, couldn't that mean the clown committed the crime?\nPhoenix:\n(Hmm... He's got a point.)\nvon Karma:\nWhat a shame... It was a nice theory, but the clown can't be the criminal.\nJudge:\nWhy's that?\nvon Karma:\nHere's absolute proof.\nJudge:\nA... silk hat?\nvon Karma:\nThis was found at the scene of the crime. It belongs to the defendant.\nPhoenix:\nAh...\nvon Karma:\nWithout question, he was wearing his signature hat during practice. If the clown was the murderer, there would be no reason for this hat to be at the scene.\nJudge:\nHmm... Well done, Ms. von Karma. Your prosecutorial skills are unrivaled. Well done.\nvon Karma:\nThank you for stating the obvious... Mr. Phoenix Wright, what do you have to say?\nPhoenix:\nO-OK... (I guess she's the boss again today...)\nCross Examination\n-- What You Witnessed --\nTrilo:\nOnce practice was over, I left the tent with the stooge... I mean clown.\nTrilo:\nOnce we got to the lodging house, I ditched him and went back to the plaza's entrance. (Changed from [Once we got to the lodging house, I ditched him and went over to the plaza.] in the original release)\nTrilo:\nThat's when I saw Max, heading towards the scene of the crime.\nTrilo:\nHe was the only one heading that way... How could that punk not be the killer!?\nTrilo:\nThen the police showed up, and took magic boy away.\nMaya:\nHmm... Trilo wouldn't happen to have an ulterior motive for incriminating Max, would he?\nPhoenix:\nWell, Max is part of that bitter love triangle with Regina. Which is probably why Max conked him over the head.\nMaya:\nUmm Nick... Wasn't Ben the one who got knocked over the head?\nPhoenix:\nUh... Yeah... I think so... I dunno anymore!\nPhoenix:\nAlright! There is obviously a reason why this witness was there that night! He spent all that time waiting for Regina to arrive! Moreover... Even if someone else would've walked right in front of him, I doubt he would have paid them a second thought!\nTrilo:\nAHHHH!!\nJudge:\nThat makes perfect sense.\nvon Karma:\nvon Karma:\nWhat did you just say!? The witness saw the defendant at the scene of the crime!!\nPhoenix:\nPhoenix:\nHowever, he did not see the victim on the way to his eventual demise! If you accept that, then you must accept that there is a high likelihood that... He could have missed someone else other than Max heading to the scene! OWWW!!\nvon Karma:\nThere is absolutely no proof that the witness was waiting for the animal tamer!\nTrilo:\nUmm... Umm... I guess you got me... Alright! Alright! I'll spill the beans for real this time! It's true. I was waiting for Regina.\nBen:\nPAIN!!\nvon Karma:\nDon't volunteer things!!\nJudge:\nMr. Quist, tell us the truth this time... And I mean the whole truth! Were you or were you not waiting for Regina at the entrance to the lodging house?\nTrilo:\nI was! I was waiting to propose to her!!\nJudge:\nYou were what!? Waiting to... propose!?\nTrilo:\nWhat's the matter!? You think that humans have a monopoly on marriage!?\nJudge:\nThat... The matter of puppet marriage is not under review in this case!\nTrilo:\nYou're the judge! I mean, look at your horrible outfit!!\nBen:\nMORE PAIN!!\nvon Karma:\nHmph. Thanks to your bumbling, my perfect plan is not so perfect anymore! Now we have to waste time getting to the bottom of some silly proposal by a puppet!!\nWitness Testimony\n-- About the Proposal --\nTrilo:\nDon't be so surprised that I was going to propose to Regina!\nI even had something to give to her...\nI kept it in my pocket, waiting for the chance to propose and give it to her.\nOf course, I also had it in my pocket that night. It was a present for her.\nIn the end, I wasn't able to give it to her, so I've still got it in my pocket!\nJudge:\nYou were going to propose... You... A puppet...\nTrilo:\nDon't be so obtuse! Just because I'm a puppet doesn't mean I can't love!\nJudge:\nI guess you're right... Just because I'm old doesn't mean I couldn't propose to her too!\nTrilo:\nExactly!\nPhoenix:\n(His Honor is looking a little less than honorable right now...)\nJudge:\nOK, Mr. Wright... Please continue with your examination... *sigh*\nMaya:\nWhat was with that sigh at the end... (Changed from [Aww... Did you hear that? His sigh seemed a little wistful.] in the original release)\nCross Examination\n-- About the Proposal --\nTrilo:\nDon't be so surprised that I was going to propose to Regina!\nTrilo:\nI even had something to give to her...\nTrilo:\nI planned on giving an engagement ring to Regina...\nTrilo:\nI kept it in my pocket, waiting for the chance to propose and give it to her.\nTrilo:\nOf course, I also had it in my pocket that night. It was a present for her.\nTrilo:\nIn the end, I wasn't able to give it to her, so I've still got it in my pocket!\nMaya:\nHow about it Nick?\nPhoenix:\nI think it's time to unwrap this toy's testimony.\nMaya:\nThat's the spirit Nick! Give him heck!\nPhoenix:\n(The judge has that dazed and confused look again. Maybe he should get out more.) (Changed from [Uh oh, the judge has that dazed look again. Maybe he should get out more.] in the original release)\nPhoenix:\nTrilo, do you mind if I show you something?\nBen:\nWhat is it?\nTrilo:\nWhat are you talking about!?\nPhoenix:\n(Uh oh... Looks like they're going to double team me now...) Do you recognize this ring?\nTrilo:\nAh! That's... That's... That's mine!! Give it back! Thief! Thief!\nPhoenix:\nDidn't you just testify about this very object? I believe you said... \"In the end, I wasn't able to give it to her, so I've still got it in my pocket!\" Why then, do I have it right here...?\nTrilo:\nAAAAAAAAAARRRRRGHHHHH!!\nJudge:\nWhat is going on here!?\nTrilo:\nThat's... That's... Ben! Say something!!\nBen:\nEh? Don't put me on the spot like that Trilo!!\nPhoenix:\nI found this in Money's room...\nJudge:\nM-M-Money's room? You mean a room they put money, like a bank vault?\nTrilo:\nHah! That filthy monkey is gonna get what's coming to him!!\nJudge:\nMr. Quist, I would prefer if you avoided slandering innocent fiats in my court.\nPhoenix:\nWell, Your Honor... Money really is a monkey... In every sense of the word.\nJudge:\nAh. I see... Well then...\nPhoenix:\nMoney likes to go after the shiniest things that he can find and gather them up.\nJudge:\nShiny... Things?\nPhoenix:\nTrilo! When was this ring stolen from you?\nBen:\nWell... I suppose it was... That time... You know... That night... The night of the crime...\nvon Karma:\nWhat did you just say!?\nPhoenix:\nDetails... I need more details...\nBen:\nWell... It was stolen right after Max showed up in the plaza...\nPhoenix:\nRight about when you saw the defendant walk past, correct?\nBen:\nWell... Umm... I guess you... Might... Umm... Be able to say that... The ring might have... Well... It could have been... Taken around that time...\n???:\nOooo-Ooooh!\nBen:\nAhhhhh... Yeowwwwwwwww... Ohhhhhhhhhh...\nTrilo:\nBen! What's with you!? ... Oh, whatever... It has nothing to do with anything! Especially not who committed the murder!!\nPhoenix:\nIt's not for you to decide what has to do with what! Now, Trilo! Back to the topic at hand!\nTrilo:\nI haven't admitted a thing! Not I... Mr. Trilo Quist!\nPhoenix:\nWhat did you do when the ring was taken, Trilo?\nTrilo:\nYou know exactly what I did! I chased after that ring snatching monkey Money!!\nPhoenix:\nBut you weren't able to catch up with him, were you?\nTrilo:\nIt's all this slow loafy fool called Ben's fault! While he was fumbling his way through the snow, that dumb monkey was able to get away!\nJudge:\nThat is indeed an incredible shame.\nPhoenix:\nWell... This does indeed prove one very important point.\nvon Karma:\nProve an important point!? What point could that possibly be?\nPhoenix:\nThere is a huge contradiction in this witness's testimony!\nvon Karma:\nCo-Contradiction!?\nPhoenix:\nThe witness just testified to the following effect -- Up until the police arrived, he didn't move from the entrance to the plaza. HOWEVER! The witness just stated that he chased after Money the monkey. When the witness was off chasing Money, there was no one watching the plaza!\nvon Karma:\nWhat is the meaning of all this, Mr. Phoenix Wright!? Where are you going with this little theory of yours?\nPhoenix:\nI'm saying that there is no possible way that this witness saw the plaza the entire time! That's where I'm going with this little theory! Which leads me to my next point. It is entirely possible that someone other than the defendant was at the scene!\nJudge:\nInteresting, Mr. Wright.\nvon Karma:\nvon Karma:\nWell then tell me this, Mr. Phoenix Wright!! Do you have any proof that something slipped past this vigilant ventriloquist?\nPhoenix:\nPhoenix:\nWell, he obviously didn't see the victim, the Ringmaster, arrive on the scene!\nvon Karma:\nHowever, that doesn't change the fact that he saw the defendant arrive!\nPhoenix:\nThe witness is lying! He is blinded by his rivalry with Max!\nJudge:\nWell... The defense's argument does hold water. This witness does have a history of animosity towards the defendant.\nTrilo:\nWhat!? How dare you!? I wouldn't lie just to get that dorkface in trouble! He's not even worth it!! I saw him! No doubt about it! I saw that worthless liar!\nJudge:\nWell... Just for clarity's sake, let's flesh out exactly who you saw on that night.\nTrilo:\nHah! I've told you so many times, you'd think you'd know my story's not changing!\nPhoenix:\n(You've already changed your story, stick boy! And I'm sure it will change some more.)\nMaya:\nWhere there is one lie, there are usually many more behind it.\nPhoenix:\nExactly, Maya. That's why we have to keep after him!\nMaya:\nYeah!\nWitness Testimony\n-- Witnessing Max --\nTrilo:\nI'll give you that I was waiting that night for Regina.\nBut that doesn't change the fact that I saw Max in the plaza that night!\nHe showed up after I had been waiting there for about five minutes.\nI said \"good evening\" to him, but he didn't even acknowledge my presence!\nI'm absolutely sure it was him! I saw Maximillion Galactica at the scene!!\nThere's no way I could mistake someone wearing those three ridiculous symbols!\nJudge:\nHmm...\nvon Karma:\nSo that means that Money didn't show up until after you saw Max?\nTrilo:\nThat's right. Money ran up less than a minute after I saw Max.\nPhoenix:\nThen Money snatched the ring, and you went chasing after him?\nJudge:\nHow long was it until you came back to where you were waiting?\nTrilo:\nWell. Let's see... I'd say about...\nBen:\nI suppose five minutes. I think...\nvon Karma:\nSo the victim could have arrived on the scene in that five minute stretch.\nJudge:\nMr. Wright, please proceed with your cross-examination.\nCross Examination\n-- Witnessing Max --\nTrilo:\nI'll give you that I was waiting that night for Regina.\nTrilo:\nBut that doesn't change the fact that I saw Max in the plaza that night!\nTrilo:\nHe showed up after I had been waiting there for about five minutes.\nTrilo:\nI said \"good evening\" to him, but he didn't even acknowledge my presence!\nTrilo:\nI'm absolutely sure it was him! I saw Maximillion Galactica at the scene!!\nTrilo:\nThere's no way I could mistake someone wearing those three ridiculous symbols!\nMaya:\nThere has to be a hole in his testimony somewhere.\nPhoenix:\nI agree. But do we have the proof to make something stick?\nMaya:\nAll we can do is try, right Nick!? We've gotta have something that will prove useful.\nPhoenix:\nAll right, time to go to work.\nPhoenix:\nTrilo, is it not true that you had a fight with Max on the day of the murder?\nvon Karma:\nA fight?\nPhoenix:\nA fight over Regina to be exact.\nTrilo:\nIt wasn't that big of a deal! It was just an argument... A disagreement at most!\nPhoenix:\nA disagreement usually doesn't end with someone getting clonked over the head...\nTrilo:\nAHHHH!!\nPhoenix:\nThat morning, Ben got clobbered over the head by Max, didn't he?\nJudge:\nWh-What? Is that an admission of assault and battery? OUCH!!\nvon Karma:\nBefore we handle that, we should wrap up the defendant's murder charge first!\nPhoenix:\nThe truth is that on the day of the crime, the defendant and witness had a huge fight! There is absolutely no way they would have suddenly become cordial that evening! Moreover, just consider the personality of the witness on stand! There is no way a puppet this lewd would just up and say \"good evening\" to his rival!\nTrilo:\nGWWAAAAHHHH!!\nvon Karma:\nvon Karma:\nAre you saying this witness is lying!? That he is trying to frame the defendant by claiming to have seen him at the crime scene!?\nTrilo:\nI-I-I... I didn't tell a single lie! Honestly! I just...\nJudge:\nThat's enough from you Mr. Quist! Mr. Wright...\nPhoenix:\nYes, Your Honor.\nJudge:\nLet's clarify this testimony for the court... Could you explain your theory about who the witness actually saw that night?\nPhoenix:\nIt is my belief that the witness did indeed see someone that night... It was just someone else! That's who he said \"good evening\" to.\nvon Karma:\nWhat kind of theory is that!?\nPhoenix:\nThe correct one. Furthermore, I don't believe the person the witness saw was Max at all.\nvon Karma:\nWh-What!?\nPhoenix:\nIf he had truly met Max that night, there would have been no greeting at all. Which means there is only one proper answer. The person the witness saw that night was not Maximillion Galactica. That is why Trilo made the effort to greet whoever it was that he saw that evening. Or \"good evening\" as he put it.\nTrilo:\nUhh...\nvon Karma:\nWhat in the world... You...\nJudge:\nWould the defense kindly explain who it was Trilo saw that evening then?\nPhoenix:\nConsidering the ill temper of this witness, there is only one person he would greet!\nJudge:\nIt must be Regina! It's Regina right!? She's so cute!!\nPhoenix:\nNo, Your Honor, it is not Regina. If it was Regina, Trilo would have given her the engagement ring as a present.\nJudge:\nOh... Yeah... I suppose you've got a point there.\nvon Karma:\nIt was Russell Berry. The victim himself, was it not?\nPhoenix:\nYou are correct. It was indeed Russell Berry.\nTrilo:\n...!\nPhoenix:\nThe person you saw that evening was the victim, the Ringmaster, Russell Berry. That's why you greeted him Trilo. Isn't that correct?\nTrilo:\n... *gulp*\nPhoenix:\nAnswer the question, Mr. Quist!\nTrilo:\nWAAAAHHHH!! AH!\nJudge:\nORDER! ORDER! How do you respond to this!?\nTrilo:\nWa-Wait a second!! Well, at first I thought it was the old man! But! But! Once I got a better look at him, it was obviously Maximillion Galactica!\nJudge:\nI think it is high time that we clear the air about this question! Mr. Quist obviously witnessed a single person in the area of the plaza that evening. The problem is identifying exactly who that person was... Was it Maximillion Galactica? Or was it the Ringmaster, one Mr. Russell Berry?\nvon Karma:\nThe prosecution argues that it was the defendant that the witness saw that night! The witness has clearly stated that he saw the defendant's three symbols!\nPhoenix:\nThree symbols?\nTrilo:\nAlright... This is getting old. C'mon man! You've gotta remember them by now!! Here we go again! Everyone... All together now!! OWWWWW!!\nvon Karma:\nYes, yes... We know... The silk hat, cloak, and white roses...\nPhoenix:\nPhoenix:\nA silk hat and a cloak! Anyone could wear them! They'd even look good on me!\nvon Karma:\nWhat was that!?\nPhoenix:\nWell, the witness has endlessly repeated that he saw Max's three symbols... However, how do we really know it was Maximillion Galactica? It could have been someone else, dressed up as him. Possibly even Russell Berry!\nvon Karma:\nWHAT!?\nJudge:\nMs. von Karma.\nvon Karma:\n...\nJudge:\nDo you have clear evidence that the person the witness saw was the defendant?\nvon Karma:\nWell... I...\nJudge:\nIf that's the case, then it is impossible for me to make a judgment at this point.\nPhoenix:\n(Yes! I think we've finally won a point in this one!!)\nvon Karma:\n... That is very... Unfortunate.\nPhoenix:\nHuh?\nvon Karma:\nYou're just a little too excited for your own good, Mr. Phoenix Wright.\nPhoenix:\nWhat do you mean by that?\nvon Karma:\nYou merely established one thing from this witness. You established that this witness saw one person in the plaza that night. I applaud you on your effort, but...\nJudge:\nBut...?\nvon Karma:\nWho that person was can only be answered by the next witness!\nPhoenix:\nHUH!?\nvon Karma:\nYour Honor, the prosecution will provide, beyond a shadow of a doubt, an answer to that question, and evidence that clearly establishes one thing. That there is no one other than Maximillion Galactica responsible for this crime!\nJudge:\nVery well. The court will take a 10 minute recess. During that time, I request the prosecution prepare their next witness. Court is now in recess!\nTo be continued.\nDecember 29, 11:54 AMDistrict CourtDefendant Lobby No. 5\nMax:\nSw-Sweetie! You have to believe me! I didn't go anywhere near that crime scene!\nMaya:\nSo then, where were you when the murder took place?\nMax:\nWe talked about it yesterday, remember? I was in the Ringmaster's room!\nPhoenix:\nAnd while you were there, it was the Ringmaster who left the room, right?\nMax:\nExactly. He told me to wait in the room because he would \"be right back\".\nMaya:\nThat's when the Ringmaster headed to the scene of the crime... Right?\nPhoenix:\nThat's what it seems like.\nMaya:\nBut... The Ringmaster must've been wearing Max's costume. Right?\nMax:\nOh! Sweetie! I just remembered! I went straight to the Ringmaster's room still dressed in my stage clothes. But when I got there, I went ahead and took the costume off.\nMaya:\nWhich means?\nPhoenix:\nIt means that the Ringmaster could have taken his costume, and went out looking like Max!\nMax:\nFABULOUS! That's a fabulously possible possibility!\nMaya:\nHeh Heh... Well done, Nick.\nMax:\nHowever, sweetie... Why would the Ringmaster want to dress up like me? Isn't that a bit strange?\nPhoenix:\nHmm...\nMax:\nIf you think about it, all they found at the crime scene was my silk hat. What about my cloak? Where did that go?\nPhoenix:\nDouble hmm...\nMaya:\nWow Max. I never thought of that. You should be a detective or something!\nMax:\nWell, I was never quite sure what to be when I grew up... Magician or President? You have no idea how hard it was to make a decision!\nMaya:\nThat's really cool...\nPhoenix:\n(Fabulous... This mystery just keeps getting deeper...)\nDecember 29, 12:06 PMDistrict CourtCourtroom No. 2\nJudge:\nNow that everyone is back, let's get started. The court is now back in session. Ms. von Karma, please proceed with the prosecution's case.\nvon Karma:\nVery well... I will now call my next witness. A pitiful clown with the unfortunate distinction of having seen the entire thing. Will Mr. Lawrence Curls please take the stand!\nPhoenix:\n(Why did she just call him a \"pitiful\" clown?)\nvon Karma:\nThe witness will state his name and occupation for the court record.\nMoe:\n...\nvon Karma:\n...\nMoe:\n... In West Clownadelphia, born and raised, on the playground is where I spent my clowin...\nvon Karma:\n... Name and occupation.\nJudge:\nWill the witness please inform the court why he is speaking autobiographical gibberish?\nMoe:\nO-Oh... I-I'm sorry... I'm just not used to being in court. I've never been in a courtroom in my life. I wasn't quite sure what joke is best suited to this sort of occasion.\nJudge:\nWhat in the world are you talking about!? You're in a grand hall of justice, not some comedy club! Since it's easy to see your occupation, please state your name for the court.\nMoe:\n... Oh... Yeah... Maybe this joke is OK... \"Mom, do I have to wear pants?\" \"The sign only says no shirt, no shoes, no service.\" Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha!\n.....................\nMoe:\nOK! OK! How about this? \"Have you met my proctologist? Dr. Seymour Butts!!\" How was that one!? Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! ...But a couple of clowns who were up to no good... Started makin' trouble in... (Changed from [...But a couple of clowns, they were up to no good... Started makin' trouble in...] in the original release)\nvon Karma:\nYour name...\nMoe:\nLawrence Curls. Professional funnyman, also known as Moe the clown.\nvon Karma:\nYou witnessed the scene at around 10:15 PM the day of the murder. Correct?\nMoe:\nYes... Yes it is.\nJudge:\nVery well, Mr. Curls. Will you please testify to what you saw that evening?\nMoe:\nA rabbi, a priest, and a Rastafarian walked into this plaza...\nJudge:\nWithout the humor please.\nMoe:\nOK...\nMaya:\nAww... Poor Moe can't be his normal stoogey self in court.\nWitness Testimony\n-- What You Witnessed --\nMoe:\nI know... I know... I'm not the greatest comedian in the world...\nI haven't been able to make people laugh for 10 years!\nNo matter what I say, all I get in return is a vacant stare and polite applause.\nSince no one ever laughs at my jokes, I've taken to laughing at them myself.\nIt's a bad habit, but hey, at least I'm trying!!\nImagine my predicament! I'm a clown who can't make people laugh!! I'm almost useless!\nBut I keep trying... I even tried to come up with jokes just for today!!\nBut this atmosphere is very nerve-racking! I decided to try making everyone laugh!\nSeriously... Everyone... What do you think of me? How am I doing?\nJudge:\n...\nvon Karma:\n...\nPhoenix:\nUmm... Aren't we the ones supposed to be asking the questions here?\nvon Karma:\nWitness...\nMoe:\nHuh?\nvon Karma:\nWe will listen to your call for help after the court proceedings are over. Thus, please stick with the facts of this case.\nMoe:\nReally!? You'll really hear me out!?\nvon Karma:\nWell, I'll make sure that one of my staff will be your straight man later.\nMoe:\nThank you!! Thank you!! I can't wait!!\nPhoenix:\n(Poor Gumshoe...)\nJudge:\nNow that that's settled, shall we begin once again with the testimony!?\nMoe:\nOf course we can! I'll talk for as long as you want!!\nWitness Testimony\n-- What You Witnessed --\nMoe:\nThe night of the murder, after practice was over, I went straight back to my room.\nYou have no idea how tired I was that night. I was pooped.\nI thought I'd go straight to sleep, but before I did, I glanced out the window.\nThat's when I saw two silhouettes! They were a bit far away though!\nIt was the Ringmaster, and he was with Max, who was wearing his cloak!\nI kept watching them, and all of a sudden, Max clonked the Ringmaster over the head!\nJudge:\nThat's very interesting... If this eyewitness account is to be believed, I have enough to pass judgment right now...\nvon Karma:\nOf course you can! There is no way that this account can be criticized.\nJudge:\nHowever... The witness is a bit, how do you say, \"off-kilter\"... Almost like he has some sort of atmosphere of guilt surrounding him.\nMoe:\nAha! Aha! Aha! That must be because of my insincere smile...\nJudge:\nMr. Wright, please begin the defense's cross-examination.\nPhoenix:\nYes, Your Honor.\nMaya:\nNick! You've gotta find some kind of contradiction in his testimony!\nPhoenix:\nI know that!\nJudge:\nMr. Wright.\nPhoenix:\nYour Honor?\nJudge:\nI'm afraid that if you push this witness too far, it would bring disaster upon the court. Thus, I sincerely hope you are not going to engage in pointless saber-rattling.\nPhoenix:\nI understand, Your Honor.\nvon Karma:\nIf you cause this clown to stray from the facts, I'll hold you responsible!\nPhoenix:\n(Why am I responsible!? I'm not the one with the corny jokes.)\nCross Examination\n-- What You Witnessed --\nMoe:\nThe night of the murder, after practice was over, I went straight back to my room.\nMoe:\nYou have no idea how tired I was that night. I was pooped.\nMoe:\nI thought I'd go straight to sleep, but before I did, I glanced out the window.\nMoe:\nI heard a huge noise outside the window, and that's what made me take a look outside...\nMoe:\nThat's when I saw two silhouettes! They were a bit far away though!\nMoe:\nIt was the Ringmaster, and he was with Max, who was wearing his cloak!\nMoe:\nI kept watching them, and all of a sudden, Max clonked the Ringmaster over the head!\nMaya:\nYou know... Moe's testimony and what he told us yesterday are kinda different...\nPhoenix:\nYeah I noticed. We've just got to pinpoint what's changed.\nMaya:\nYou can do it, Nick!\nPhoenix:\nI've got a great reason to make my claim!\nvon Karma:\nAnd I suppose you will be telling us all that \"great\" reason?\nPhoenix:\nOf course I will... The reason is... The witness' very own testimony!\nJudge:\nWhat is the meaning of that Mr. Wright?\nPhoenix:\nMoe said that he heard a sound like a \"thump\" of someone getting hit.\nJudge:\nHmm... He did say that.\nPhoenix:\nHowever, Moe just stated the following under oath.\nMoe:\nI kept watching them, and all of a sudden, Max clonked the Ringmaster over the head!\nPhoenix:\nIf Moe is to be believed when he says he looked out the window upon hearing a sound, there is no way that he could have seen Max \"clonk\" anyone!\nMoe:\nIn 1972, a crack clown unit was sent to prison by a circus court for a crime...\nJudge:\nMr. Curls! How do you respond to Mr. Wright's assessment!!?\nMoe:\n...they didn't commit. These clowns promptly escaped from a maximum security clown car...\nJudge:\nMr. Curls, are you reciting the C-Team theme to anger this court?\nMoe:\nNo no no... I'm just stalling for time while I jog my memory...\nMaya:\nGreat job, Nick!\nPhoenix:\nThese types of witnesses always seem to have a selective memory... You just have to peel back the layers of the clown make-up to find the truth.\nMoe:\nWell... Umm...\nJudge:\nAhh, you're back from your jog?\nMoe:\nWell... It pretty much happened the way I said.\nPhoenix:\n\"Pretty much\"...?\nMoe:\nWhen I looked out my window that night, the Ringmaster was already face down in the snow. The prosecution helped me fill in the gaps of my statement.\nPhoenix:\n(Von... Von Karma!! Tampering with witnesses again!!)\nvon Karma:\n...\nJudge:\nSo now you are saying that you did not see the defendant \"clonk\" the Ringmaster?\nMoe:\nY-Yes... When I looked out my window, the Ringmaster had already checked out.\nJudge:\nChecked out?\nMoe:\nYep. He was on permanent vacation as they say. Aha! Aha! Aha! Aha! Aha!\nJudge:\nMr. Curls!!\nMoe:\nYour Honor?\nJudge:\nYou did not witness the actual crime; however, you still say you saw the criminal, correct?\nMoe:\nY-Y-YES!! Exactly! The Ringmaster was slumped over and I saw someone's silhouette next to him.\nJudge:\nVery well. Then please testify to this silhouette you saw... I expect the truth! And if I even catch a hint of a joke from you... I will put you in a holding cell until you learn court etiquette, got it!?\nMoe:\nGot it.\nWitness Testimony\n-- The Silhouette --\nMoe:\nI was a bit far away, but that shadow could only have belonged to Max.\nThere's no doubting it. Especially since I saw his uppity symbols.\nHis silk hat. That black cloak. They were all there!\nHis face was silhouetted, but there was no doubt that it was him.\nHis cloak was fluttering in the wind, so I couldn't really see what he was carrying.\nJudge:\nHmm... It does seem as if the defendant was at the scene of the crime.\nvon Karma:\nIt took the clown long enough to get his facts straight. (Changed from [You took your time realizing that, didn't you!?] in the original release) But whatever. This should finally be good enough, yes? (Changed from [Whatever. That should be enough, right!?] in the original release)\nJudge:\nIt is decisive testimony...\nMaya:\nWas Max really at the crime scene that night...?\nPhoenix:\nHe said he wasn't there. We have to believe in that. (Changed from [He said he wasn't there. We have to keep believing that.] in the original release)\nJudge:\nAlright, Mr. Wright. Commence your cross-examination.\nCross Examination\n-- The Silhouette --\nMoe:\nI was a bit far away, but that shadow could only have belonged to Max.\nMoe:\nThere's no doubting it. Especially since I saw his uppity symbols.\nMoe:\nHis silk hat. That black cloak. They were all there!\nMoe:\nHis face was silhouetted, but there was no doubt that it was him.\nMoe:\nHis cloak was fluttering in the wind, so I couldn't really see what he was carrying.\nPhoenix:\n(With Trilo's testimony, and now Moe's... It really seems like Max is the killer.)\nMaya:\nN-Nick... You've gotta find a contradiction in this.\nPhoenix:\nThat's not going to be enough...\nMaya:\nWhat?\nPhoenix:\nI have to prove that Moe saw someone other than Max that night! That's the only thing that will help! I've gotta do it!\nPhoenix:\nYou say you saw all of Max's \"uppity\" symbols?\nMoe:\nI suppose so... The silk hat and the cloak, right?\nPhoenix:\nMoe... Everyone knows that Maximillion Galactica has three uppity symbols!\nMoe:\nThree symbols?\nMaya:\nYay! Everyone get ready!! All... Together... Now...\n\"SILK HAT! CLOAK! WHITE ROSES!\"\nMoe:\nWhat the!?\nvon Karma:\nWho cares if he knew that there were three or not! He saw what he saw. And he saw the symbols. He just forgot to mention one.\nMoe:\n...\nvon Karma:\nIsn't that right, Moe?\nMoe:\n... Do you like Pi? I love Pi! 3.141592653589793238462643383279! Tasty!\nvon Karma:\nSilence fool! You are to respond with the whole truth! No fractions!\nJudge:\nOrder! Order!\nPhoenix:\nMoe! You didn't see the roses, did you!?\nMoe:\nTo be honest... There wasn't any roses on the person I saw...\nvon Karma:\nvon Karma:\nThe crime scene was dark! It's obvious it was too dark to see that kind of detail!\nPhoenix:\nPhoenix:\nBut the witness said he was able to see the silhouette of the criminal's face. Not to mention that the roses are white! There's no way he could have missed them!\nvon Karma:\nvon Karma:\nThen the roses must have fallen off when the defendant assaulted the victim!\nPhoenix:\nIf that was the case, then the police would have found them near the crime scene!\nJudge:\nMr. Wright! Are these white roses truly material to the facts of this case?\nvon Karma:\nClearly not! He is just toying with this court!\nPhoenix:\n... (I got her on the ropes now... These seemingly insignificant facts have never failed to lead me to the truth yet! (Changed from [Whenever there's a nugget of truth, it always seems to peek out at me... Then run away.] in the original release)) Someone is toying with the court, but it's not me! Your Honor! Do you recall Trilo's testimony?\nTrilo:\nThere's no way I could mistake someone wearing those three ridiculous symbols!\nTrilo:\nHow can you mistake someone with that crazy get-up and his nose stuck up so high...\nTrilo:\nHow could you mistake someone wearing such a snobby 3 piece get-up!\nPhoenix:\nTrilo saw them all! Trilo saw all three of Max's symbols! However, this witness claims there were no white roses on the person he saw! There is absolutely no doubt that this is a contradiction!\nJudge:\nHmm... Now what am I supposed to think? One is supposed to disregard the pointless, but this...\nvon Karma:\nJudge! Forget the roses! Think about his other testimony! The witness has stated without a doubt that he saw Maximillion Galactica! Nothing else matters! Let's wrap this case up now!\nPhoenix:\nYour Honor! It may be trivial, but it does cast doubt on the prosecution's case. (Changed from [Your Honor! It may be trivial, but there should still be doubt lingering in your mind!] in the original release)\nJudge:\n... Frankly, I have my doubts about this witness. It seems that, unlike wine, the witness has not grown more mature with age.\nMoe:\nI'm not... mature...\nJudge:\nI've come to a conclusion... I'm 99% certain that this witness saw the defendant. However! My remaining one percent of doubt is quite reasonable! Which means that for my peace of mind, I'm going to request a bit more testimony.\nvon Karma:\nW-What!?\nJudge:\nIf there are no contradictions in his next statement, I am prepared to issue a ruling.\nPhoenix:\n(A ruling...!!)\nMaya:\nNick! This is your last chance!\nWitness Testimony\n-- The Silhouette, Part 2 --\nMoe:\nThere's no doubt in my mind! There were no white roses that night!\nHowever, all of the other symbols were there... I'm equally sure of that.\nEspecially the silk hat! There is no way I could forget seeing the decorations on it!\nHe was wearing it the entire time that he was on the scene!\nJudge:\nMr. Wright... You've got one last chance at this.\nPhoenix:\nJust one chance?\nJudge:\nI will not allow even the slightest hint of badgering against this witness. If you are going to prove to me there's a contradiction with Mr. Curls' statement, you'd better have at least a shred of evidence to back up your accusations.\nPhoenix:\n(I've only got a single shot as [sic] this... I've got to be careful.) I understand, Your Honor. One chance is all I will need!\nCross Examination\n-- The Silhouette, Part 2 --\nMoe:\nThere's no doubt in my mind! There were no white roses that night!\nMoe:\nHowever, all of the other symbols were there... I'm equally sure of that.\nMoe:\nEspecially the silk hat! There is no way I could forget seeing the decorations on it!\nMoe:\nHe was wearing it the entire time that he was on the scene!\nMaya:\nWhaddya think, Nick?\nPhoenix:\nThere's no way I'm going to lose after coming this far. There's gotta be an answer. And it's probably in the Court Record!\nPhoenix:\nThis wouldn't happen to be the silk hat you saw that night, would it?\nMoe:\nYep! That's it! That's the hat he was wearing that night!\nPhoenix:\nNo question in your mind?\nMoe:\nExactly how would one mistake a thing like that!?\nPhoenix:\nI see...\nJudge:\nIs there some sort of problem, Mr. Wright?\nPhoenix:\nMs. von Karma. Where exactly was the silk hat found?\nvon Karma:\nMust you always ask these questions!? It was found at the crime scene!! ... The c-c-crime scene... That means...\nPhoenix:\nThe silk hat fell off at the crime scene! However the witness clearly testified to the contrary!! The witness stated that \"he was wearing it the entire time that he was on the scene!\"\nMoe:\nNoooooOOOOOooooo!! That's not trrrrrruuuuueeee!!\nJudge:\nORDER! ORDER!! OOORRRDER!! MR. CURLS!!\nMoe:\nY-Yes, Your Honor?\nJudge:\nWHAT IS THE MEANING OF ALL OF THIS!? You are old enough to know better than to behave like this in court!\nMoe:\nHey! That's just not right!! That's so harsh!\nJudge:\nWhat's not right here is your eyesight and your memory, amongst other things!!\nMoe:\n............... Wh... Why are you being so mean to me!! What did I do!? Lemme guess... You just didn't like my jokes or something, right? You didn't have to go and insult my eyesight or my memory!? They're both great! Seriously!! Why!? Just because you are sitting above me doesn't mean you belong there! And no matter how old I get, I'll always be younger than you!! WAAAAAHHHHHHHH!! *sob* (Changed from [And no matter how old I get, I'll always be younger you!! [sic] WAAAAAHHHHHHHH!! *sobs*] in the original release)\n...\nJudge:\n... Enough of these childish outbursts, Mr. Curls! Who do you think you are?\nMoe:\nI saw him! I swear I saw him!! It was Max!! Even if he didn't have his roses, he was still wearing his dumb silk hat!! I'm telling the truth!!\nMaya:\nHe's turned into a bratty little kid.\nPhoenix:\nIt's pitiful, isn't it?\nMoe:\nHe left the scene wearing that dumb silk hat! He was there!!\nPhoenix:\n(He... left the scene?)\nMaya:\nWhat's the matter, Nick?\nPhoenix:\nThere's something I've been mulling over for a while now. Moe?\nMoe:\nWhaddya want!?\nPhoenix:\nYou just said that he left the scene... Exactly how did the murderer leave the scene of the crime?\nMoe:\nWHAT!? He... Umm... He... Went... Whaddya mean \"how did he leave the scene\"? You can't ask me that!!\nvon Karma:\nvon Karma:\nMr. Phoenix Wright is badgering the witness, Your Honor!!\nPhoenix:\nPhoenix:\nThis witness's testimony is so full of holes, Ms. von Karma's protest is useless!\nvon Karma:\nGrrrr...\nJudge:\nYou've got a point. Let's hear what the witness has to say on this matter. Is that alright with you, little guy?\nMoe:\nDon't talk to me like I'm a little baby!! Besides, what kind of stupid question is \"how did he leave the crime scene!?\" The answer's obvious! He just turned around and walked away!!\nPhoenix:\nThat's what I expected you'd say... You sure that's how it happened?\nMoe:\nSay what!? (Changed from [Hmph!!] in the original release)\nJudge:\nHuh? I'm not sure I know exactly where you're going with this... Lawyers nowadays sure do love to harp on the smallest things. Do you have any proof to counter his story as to how the criminal left the scene?\nPhoenix:\nLook at this picture. The problem is the footprints in the snow...\nJudge:\nFootprints?\nPhoenix:\nIn this photo, we can clearly see the footprints of the victim! However, where are the criminal's footprints? They aren't there!!\nMoe:\nAi-yai-yai-yai-yai!!\nPhoenix:\nSo Moe, exactly how did the criminal escape the scene?\nMoe:\nUmm... He... Uh...\nPhoenix:\nYour Honor! This witness has already proven that his testimony is completely unreliable! I move to strike all of this witness's testimony from the court record!\nJudge:\nI agree... This clown's testimony is as rickety as the clown car he came to court in.\nMoe:\nWAIT JUST A SECOND!! You guys can't just ignore everything I've said!! Fine fine! I'll tell you the truth this time...\nvon Karma:\nYOU WAIT A SECOND! I think you've said more than enough for today!!\nMoe:\nThat didn't hurt!! I'm sick and tired of listening to you anyways!! I'll give you the real deal this time... I swear!!\nMaya:\nI dunno why, but I get the feeling things are gonna get worse before they get better.\nJudge:\nMr. Lawrence Curls.\nMoe:\nYes!?\nJudge:\nThe testimony you've provided up until now has been false?\nMoe:\nIt hasn't been false! I haven't lied! It's just...\nJudge:\nIt's just what?\nMoe:\nIt's just I was a bit confused on the bit about the criminal leaving the scene. Especially since Von Karma and her whip told me not to talk about what I really saw!\nJudge:\nORDER!! ORDER!! I WILL HAVE ORDER!! Franziska von Karma!! How could you!!\nvon Karma:\nYour Honor... If you had heard the truth from this witness... You would have exactly the same opinion as I have.\nJudge:\nWhat opinion is that?\nvon Karma:\nIt's not funny!\nJudge:\nThat's enough out of you! I'm going to listen to what he has to say. Now then, let's hear the truth about what you say you saw, Mr. Curls! (Changed from [Now then, let's hear the truth about what you say you saw!] in the original release)\nMoe:\nHah! You're not gonna believe this but it's all true I tell you!\nvon Karma:\nTry not to waste our time with your idiotic drivel.\nWitness Testimony\n-- The Truth --\nMoe:\nNow it's time for our next segment, \"Moe Knows...\"!!\nEverything that I've said up until now has been the truth!\nWhen I looked out the window, the Ringmaster was down and Max was standing above him!\nHe wasn't wearing his white roses, but he was wearing the silk hat!\nThat's when I saw... He...\nThis is the truth now, get ready for it!\nHe flew! He jumped up and flew through the air!!\nHe flew right off and disappeared into the darkness!\nThat's why there were no footprints! Flying people don't leave footprints!\nvon Karma:\nI told you it wasn't funny. Do you believe me now?\nPhoenix:\n...\nJudge:\n...\n.....................\nJudge:\nWell... That was... Umm... How do you put this into words...\nvon Karma:\nMaximillion Galactica is a world-class magician. But to leave the scene of a crime by flying -- there's no way that actually happened. (Changed from [But to leave the scene of a crime by flying. There's no way that actually happened.] in the original release)\nJudge:\nYou... You're right.\nMoe:\nWhy is she right!? You believed the other witnesses! Why won't you believe me!? Especially since it's the best part of the story!!\nJudge:\nHmm... To be honest, this is the first time I've heard of a flying criminal. What do you think about this witness' testimony, Mr. Wright?\nJudge:\nI suppose I will let you all in on my thinking regarding this matter... \"The criminal disappeared into the sky.\" I'd love to believe that... But I just can't wrap my head around how that could actually happen.\nvon Karma:\nYou imbecile!\nJudge:\nIf you disregard a need for proof, Ms. von Karma's case is sound. However... I've got the feeling that this case is in dire need of more investigation.\nvon Karma:\n...!\nJudge:\nThus I will conclude today's proceedings at this point! It's an undisputed fact that the criminal left no footprints at the scene. Tomorrow, I want us to find out the reason behind this mystery of mysteries.\nPhoenix:\nUmm, uhh...\nvon Karma:\nGrrr...\nJudge:\nI believe that's enough for today. Court is adjourned! (Changed from [I believe that's enough for today. Court is now in recess!] in the original release)\nDecember 29, 2:33 PMDistrict CourtDefendant Lobby No. 5\nMax:\nHey! Sweeties! What in the world is going on!?\nPhoenix:\nThat's what I want to know!\nMaya:\nThey say the criminal flew off into the air and disappeared!\nPhoenix:\nMax, I can't believe I'm asking this, but you didn't fly that night, did you?\nMax:\nI know you didn't mean to ask me such a fabulously stupid question! I can't fly whenever I please. It's not that easy!!\nMaya:\nBut it looks so effortless for you on stage...\nMax:\nIt's not that simple!! I'm not actually flying on stage! I use invisible wires and have them hoist me through the air!\nMaya:\nWow... You just told me the secret to your magic!!\nMax:\nNO!! I broke the first rule... The cardinal rule... The ONLY RULE!\nPhoenix:\nI'm sorry, Max. We made you break a magician's creed to never reveal the secret to their tricks. (Changed from [I'm sorry you had to break a magician's creed to keep the magic tricks secret...] in the original release)\nMaya:\nNick! What do we do now!?\nPhoenix:\nAll we can do now is hope we find the flying criminal in court tomorrow.\nMaya:\nGreat idea! Let's do our best and catch this sucker!\nTo be continued.\n\nDecember 29, 3:03 PMWright & Co. Law Offices\nMaya:\nUmm... Nick?\nPhoenix:\nWhat is it?\nMaya:\nI've got a confession to make... I'm terrible at figuring out magic tricks...\nPhoenix:\nMagic tricks?\nMaya:\nYep. Magic tricks are by their very definition tricks, right? But I can never figure out the tricks when I see them. (Changed from [But I can never figure out the tricks when I see them. I'm just not good at it...] in the original release)\nPhoenix:\nThat's because the tricks are performed by pros. They do it so you can't guess the trick.\nMaya:\nBut but... The trick Pearly showed me was incredible!\nPhoenix:\nPearls did a magic trick? Hmm... What kind of trick was it?\nMaya:\nLet's see. It looked like she pulled the end of her own thumb off!\nPhoenix:\nHeh...\nMaya:\nFirst she put her right thumb next to her left hand, and then it just separated! She could move it up and down and everything! It was incredible!\nPhoenix:\nReally? Was it kinda like this...?\nMaya:\nWHAT!? WOW! HOW'D YOU DO THAT!? Nick, you're like a real magician! See this is why I just can't figure out magic... I'm no good at it... Especially hard tricks like flying away from the scene of a murder...\nPhoenix:\nYou'll take all the fun out of magic if you keep trying to figure it out.\nDecember 29Detention CenterVisitor's Room\nMax:\nOh! My sweeties!! You mind hurrying up and getting me out of this place!?\nPhoenix:\nWe're doing our best, Max. Just hang in there.\nMax:\nA little while ago, some people from a local TV station came by... And since I'm a famed magician, they said, \"Let's make you your very own TV special!\" (Changed from [They said that, since I'm a famed magician, 'Let's make your very own TV special!'] in the original release)\nMaya:\nReally? What kind of TV special?\nMax:\n\"Maximillion Galactica: The Great Prison Escape\" It would be aired live.\nMaya:\nHey! That sounds like it would be an awesome special!\nMax:\nBut if I do the special before I'm acquitted, they'll never let me out of here for real.\nPhoenix:\nWell, it would surely be an unnecessary addition to your troubles with the law.\nMax:\nThat's what I was thinking... But the production staff is already working on the show! If you don't get me out quick, I'll have no choice but to stage a real prison break.\nPhoenix:\nYou seem awfully calm about that possibility...\nMax:\nI'd have no choice. It would be a contractual obligation... That's show business.\nDecember 29Berry Big CircusCircus Entrance\nMaya:\nYou hear that? It sounds like two people arguing...\nTrilo:\nAlright, let's do it. Are you ready?\nBen:\nY-Yes... A-Ah... Wait...\nTrilo:\nQuit your whining! Let's just give this a shot already! Alright! Let's go!\nBen:\nRow-row-row-your-boat!\nTrilo:\nRow-row-row-your-boat!\nBen:\n...\nTrilo:\nWhat are you doing!? Gently-down-the-stream! C'mon, you know that!!\nBen:\nI'm trying my best, but... Trilo, this just isn't going to work...\nTrilo:\nDo you enjoy saying dumb things? You're going to have to be on your own someday! If you can't handle something as simple as this, what are you going to do then!?\nMaya:\nHello Ben. Hello to you too, Trilo.\nTrilo:\nWhat are you doing here!? Can't you see we're on a secret crash training course!?\nMaya:\nI'm sorry...\nPhoenix:\nSecret crash training! Whoa.\nBen:\nYes. Trilo wouldn't give up until I said we'd try out his idea for a new routine. So... We were trying to sing in a round for our new ventriloquism act.\nMaya:\nIn a round!? You can really do that!? That's incredible!\nTrilo:\nSee! See! Even they are surprised by the idea!! I told you!!\nBen:\nThey're not the only ones!! You even surprised me with your idea!!\nTrilo:\nOnce we've got a grip on the basics, then it's just a matter of practice!\nBen:\nY-Y-You t-t-think so?\nMaya:\nOh, I almost forgot! I wanted to give this back to you.\nTrilo:\nAhh! There it is!! Now that I've got this ring back, it's time to take one more shot at Regina!\nDecember 29Berry Big CircusBig Top\nMaya:\nHuh? Where's Regina?\nPhoenix:\nI dunno... But if she's with that tiger, I don't want to find out!! Let's hurry up and get out of here!\nMaya:\nHehe... Nick. You're kinda a chicken, aren't you?\nPhoenix:\nNo no no no no... I'm just... Umm... Allergic to wild tigers!\nDecember 29Big TopRingmaster's Room\nMaya:\nMax and the Ringmaster had their talk in this room.\nPhoenix:\nThat could have been when the Ringmaster put on Max's costume and went outside.\nMaya:\nWhy'd he do that? Maybe it was cold or something?\nDecember 29Big TopCafeteria\nMaya:\nThey still haven't cleaned this place up yet. If Pearly got one look at the state of this place... She'd slap whoever was in charge across the face!!\nPhoenix:\n(Remind me to never invite her to my office.)\nDecember 29Lodging HousePlaza\nGumshoe:\nOh, it's you two.\nPhoenix:\nYou look like you just got hit by a truck. Shouldn't you get some rest?\nGumshoe:\n*sigh* I'm taking a rest right now, pal. (Changed from [Nah... I'm taking a rest right now, pal.] in the original release) I've been listening to some crazy clown's life story. Ms. von Karma told me to come down here and do this for her.\nPhoenix:\nYeah, I figured as much... (Changed from [Being bossed around by a woman... I know how you feel.] in the original release)\nGumshoe:\nLet me tell you something, pal. Listening to that old clown sucks all your energy. Every time he's done talkin' he looks at you like you should be doing something...\nPhoenix:\nUmm... I think he's waiting for you to laugh at his jokes.\nGumshoe:\nI know that, pal. Do you have any idea how much your face hurts if you fake laughing that much?\nMaya:\nFranziska really set you up bad this time, didn't she? If you ask me, she should be listening to Moe herself...\nGumshoe:\nNo way, pal. You're not gonna get me to backbite a woman with a whip. No way.\nMaya:\nWhy are you defending her?\nGumshoe:\nProsecutor von Karma's always got her eyes on us. And every time you definitely don't want her to show up... *poof* There she is!! Don't show up... Don't show up... Don't show up... Don't show up... Don't show up...\nPhoenix:\n(Looks like she's wound him pretty tight...)\nGumshoe:\nShe's directly above us as we speak.\nMaya:\nHuh? How's that possible?\nGumshoe:\nAccording to the clown, the criminal jumped from here and disappeared into the sky. If that's what happened, it means the killer passed right by this window, pal.\nMaya:\nOh, I see... Who lives in that room behind the window up there?\nGumshoe:\nThe acrobat's got his room up on the third floor, it seems. Pretty soon, Ms. von Karma's gonna start her investigation up there. So don't get any ideas of going up to the acrobat's room, got it pal?\nMaya:\n*shivers* F-Franziska von Karma... (Changed from [*shivers* V-Von Karma...] in the original release)\nPhoenix:\n(Once she's done with her investigation, I think I'll go up there and check it out.)\nDecember 29Lodging Hall 1st FloorMoe's Room\nPhoenix:\nMoe's not here...\nMaya:\nIf he was here, you would have been able to tell even before you stepped into his room. I'm sure you would've heard him laughing away... \"Aha! Aha! Aha! Aha! Aha!\"\nPhoenix:\nWhat do you think he is laughing at when he's all by himself?\nMaya:\nI always thought he was just thinking up new jokes.\nPhoenix:\n(Hmm... He must really love his work...)\nAfter visiting Moe's Room:\nDecember 29Big TopCafeteria\nMoe:\nAh! Wright!! Welcome to the wonderful, the fabulous, the cafeteria!\nPhoenix:\n(Yikes... He's in an awfully good mood...)\nMoe:\nAlright! You know what time it is!! Riddle time!! Why does everyone cry when they eat Mexican pizza?\nPhoenix:\nUmm...\nMoe:\nC'mon! You can answer this! It's easy!!\nPhoenix:\n...Because cafeteria Mexican pizza is possibly a weapon of bowel destruction?\nMoe:\n*BUZZ* Wrong! Try again! OK! What do you think, girlie?\nMaya:\nUmm... Ahh! I got it!!\nMoe:\nOK!! What is your answer?\nMaya:\nBecause they are in the Caf Teary Eye!\nMoe:\nExactly!! It's an incredibly sad place, that caf. Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha! Aha!\nMaya:\nI did it!!\nPhoenix:\n(What's going on? He's being too nice...)\nDetention Center\nBig Top - Ringmaster's Room (after presenting Note in Detention Center - Visitor's Room)\nAfter presenting Note in Detention Center - Visitor's Room, then examining tailcoat in Big Top - Ringmaster's Room:\nDecember 29Big TopCafeteria\nMaya:\nWha...? Moe's gone.\nPhoenix:\nThere's a message on the bulletin board. \"I'm hungry so I'm off to get some hamburgers! Love, Moe.\"\nMaya:\nMmmm... Hammburrgeerrrr... Just thinking about it is making me hungry! All of a sudden I need a burger bad!!\nPhoenix:\n(All of a sudden, I need a new partner... BAD!!)\nAfter presenting Note in Detention Center - Visitor's Room, then examining tailcoat in Big Top - Ringmaster's Room:\nDecember 29Lodging HousePlaza\nMaya:\nHey Detective Gumshoe! I'm sure you did a good job as usual.\nGumshoe:\nWell, I am done with the investigation of the acrobat. Finally. But with Ms. von Karma...\n...*beep* *beep*... ...*beep* *beep*... ...*beep* *beep*...\nMaya:\nNick, what is that? That beeping sound?\nPhoenix:\nHmm...\nGumshoe:\nIt's Ms. von Karma.\nMaya:\nHuh?\nGumshoe:\nEvery time I hear that sound, she's usually not very far behind!\nPhoenix:\nSome sort of pager or something?\nGumshoe:\nIf you don't mind pal, I'm gonna go ahead and get outta here... Quick. See ya, pal!!\nMaya:\nI didn't know that Gumshoe could run that fast! So much for being a flatfoot.\nPhoenix:\n(Never seen a grown man so afraid of a girl still in her teens!)\nMaya:\nWell, let's go inside... It's freezing out here! The wind's as biting as... (Changed from [Uh oh... The whi...] in the original release) OWWWW!! ...As biting as lashes from a whip!! (Changed from [That whip could cut right through me...!!] in the original release)\nPhoenix:\nVon... Von... Von... Karma!! (She really did appear!!)\nvon Karma:\nIt was a real battle today in court, wasn't it... Mr. Phoenix Wright!?\nPhoenix:\nDid you have to jump out and scare us like that? What can I do for you?\nvon Karma:\nTomorrow will be the day. The day my dream finally comes true!\nPhoenix:\nYou mean the story of my defeat at your hands making the national news?\nvon Karma:\nHa ha ha... National news? You possess such a small sense of scale... The global news, Mr. Phoenix Wright! Your miserable plight will be known internationally!\nPhoenix:\n(I think she might be overestimating the importance of a win by just a smudge...)\nAfter clearing all Talk options:\nMaya:\nN-N-Nick! Umm... About Mr. Edgeworth...! (Changed from [N-N-Nick! Umm... About Edgeworth?] in the original release)\nPhoenix:\nMaya, I already told you this once. Don't make me do it again. Don't bring up his name in front of me again, OK?\nMaya:\nN-Nick...?\nPhoenix:\nMs. von Karma? (Changed from [Von Karma?] in the original release)\nvon Karma:\nWhat?\nPhoenix:\nI don't know if you are god's gift to prosecutors or not, but I've had about enough of you!! Him, too!\nMaya:\nWha... What in the world happened...? (Changed from [Wha... What happened?] in the original release)\nvon Karma:\nHmph. This dog is all bark and no bite. He's already been defeated... Regardless, I have nothing to inform you two of today. Tomorrow will be the greatest courtroom battle this country has ever seen!!\nMaya:\nNick?\nPhoenix:\nLet's go. We need to talk with the performer on the third floor.\nMaya:\nI'm sorry I brought it up, Nick...\nDecember 29Lodging Hall 3rd FloorAcro's Room\n???:\nYou must be Phoenix Wright.\nPhoenix:\nY-Yes.\n???:\nPleased to meet you. I'm Ken Dingling.\nAcro:\nBut here at the circus, everyone just calls me Acro.\nMaya:\nMr... Acro.\nPhoenix:\nUmmm... How do you know my name?\nAcro:\nThe detective told me. He said you'd definitely show up here.\nMaya:\nAcro, you're a member of this circus as well?\nAcro:\nThat's right. I mainly performed on the tightrope or the flying trapeze. But nowadays... All I perform in is my wheelchair.\nWright & Co. Law Offices\nAfter clearing all Talk options in Lodging Hall 3rd Floor - Acro's Room:\nDecember 29Berry Big CircusBig Top\nGrrrrrrrrrrrrrr...\nPhoenix:\n(I've got a bad feeling about this...)\nGrrrrrrrrrrr... Grawwwwwww!!\nMaya:\nYAAAH!! NICK!!\nPhoenix:\n(Wonderful... Today's special must be Filet O'Phoenix!)\nRegina:\nSTAY! STAY! HEEL! Oh! Maya! Nick! It's you guys! I'm sorry... I guess I made a mistake.\nPhoenix:\nA m-m-mistake!?\nRegina:\nYeah. A little one. I was thinking of teaching whatever primate was out there a lesson... But I was expecting more of a monkey than a human...\nMaya:\nA monkey?\nAfter clearing all Talk options and presenting Note in Berry Big Circus - Big Top:\nDecember 29Big TopCafeteria\nMaya:\nSomething smells fantastic! So we know it can't be Moe... Wait! I know what it is!! It's burgers!!\nMoe:\nHello hello hello! Welcome to the Bistro du Cirque aka the cafeteria!\nMaya:\nMmm... It smells so good in here... And those burgers look great! (Changed from [Mmm... It smells so good in here... Those burgers look great!] in the original release)\nPhoenix:\n(She's drooling like she's some sort of crazed burger monster!)\nMoe:\nMy burgers are the best!! Juicy meat... Toasted buns... Special sauce... They are absolutely irresistible to anyone with a hankering for a burger! One bite will send you into hamburger heaven!\nMaya:\nI bet! I can tell by the smell.\nPhoenix:\n(Whoa... I'm getting hungry too! Those burgers must have some kind of special power!)\nAfter clearing all Talk options and presenting Note in Berry Big Circus - Big Top:\nDecember 29Detention CenterVisitor's Room\nMaya:\n... They must have taken Max in for questioning again.\nPhoenix:\nThere really isn't anything that we need to ask him right now anyway.\nMaya:\nYou're right, I guess... Alright, let's go then.\nAfter clearing all Talk options and presenting Note in Berry Big Circus - Big Top:\nDecember 29Lodging Hall 1st FloorMoe's Room\nMaya:\nHmm... Moe's not here.\nPhoenix:\nWhat's that!? I hear something...\nMaya:\nS-Stop it, Nick... You're scaring me!\nMoney:\nOooo-Ooooh!\nMaya:\nNick!! It's Money!!\nPhoenix:\nThat monkey's holding something... (Changed from [That monkey's gotten his hands on something again...] in the original release)\nMaya:\nThat's it! That's the thing \"that means a lot\" to Regina, remember?\nPhoenix:\n(Alright! Time to take on this monkey, attorney-style!)\nMaya:\nNick! You... You... (Changed from [Nick! What's that?] in the original release)\nPhoenix:\nI swiped it while Money was distracted...\nMaya:\nWow! You're really on the ball today, Nick! (Changed from [Really? You're really on the ball today, Nick!] in the original release) Lemme see it... Lemme see it!!\nPhoenix:\nHuh? You can see it fine from where you are.\nMaya:\nYou know what I mean! I really want to try on Regina's costume! (Exclamation marks were ellipses in the original release)\nPhoenix:\n(Maybe then they'll take you in at the circus and I can get some peace and quiet...)\nMaya:\nHmm...\nPhoenix:\nWhat's the matter now?\nMaya:\nIt doesn't fit me at all!\nPhoenix:\nOh well, guess it's time for you to lay off the burgers! Not to mention it doesn't look like something any girl I know would actually wear.\nStage Costume added to the Court Record.\nBig Top\nBig Top - Cafeteria\nAcro's Room (after clearing \"Acro's brother\" Talk option in Big Top - Cafeteria)\nAcro:\nAhh... Mr. Wright. Back again I see.\nMaya:\nWell, he did say, \"I'll be back.\" Wait... or was that someone else?\nPhoenix:\n(We're back because Acro's hiding why his legs were injured! He was hurt in the accident six months ago! It would seem that he knows that we know...)\nAcro:\nWell well... It seems you've got things you want to talk about, so fire away.\nPhoenix:\nBat and Regina...\nAcro:\nThey were such great friends. Oh yeah... I wanted you to take a look at this.\nPhoenix:\nWhat is it?\nAcro:\nThis is the scarf my brother was wearing when Lon attacked him.\nMaya:\nGross... It's covered in blood.\nAcro:\nThis scarf... It was a present from Regina to my brother on the day of the accident. (Changed from [Was a present from Regina to my brother on the day of the accident.] in the original release)\nPhoenix:\nHmm...\nAcro:\nWhen he did it, he looked like he was smiling...\nPhoenix:\nHe?\nAcro:\nLon, obviously.\nMaya:\nOh! (Changed from [What!?] in the original release)\nAcro:\nWhen he bit down on Bat's head... The expression on Lon's face looked like a grin.\nMaya:\nNick!\nPhoenix:\nI know!! Moe said the same thing...\nMaya:\nWhat do you think it all means?\n???:\nI'll be taking that scarf if you don't mind...\nPhoenix:\nMs. von Karma? (Changed from [Von Karma?] in the original release)\nvon Karma:\nI've already heard everything! So hand over the scarf.\nMaya:\nBut the scarf is evidence in the trial!\nvon Karma:\nThat is for me to decide. I think we should begin our preparations now, Acro.\nPhoenix:\nPreparations?\nvon Karma:\nI've served a summons on Acro to appear in court tomorrow as a witness. Acro, we'll talk more at the Prosecutor's Office. ([Prosecutor's Office] lowercase in the original release)\nMaya:\nAcro... A witness!?\nvon Karma:\nCome Acro. Let's go to the office.\nAcro:\nYes, ma'am.\nMaya:\nNow what do we do, Nick? How are we going to handle tomorrow?\nPhoenix:\nDon't worry about it. I'll figure something out...\nMaya:\nLook at you all full of confidence!! You must have found something you can use!\nPhoenix:\n(This is all beginning to come together now...)\nTo be continued.",
  "characters": [
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Maya Fey",
      "age": "18",
      "gender": "Female",
      "description1": "My assistant and a disciple in the Kurain tradition of spirit channeling."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Dick Gumshoe",
      "age": "31",
      "gender": "Male",
      "description1": "Detective at the local precinct. In charge of the initial investigation."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Franziska von Karma",
      "age": "18",
      "gender": "Female",
      "description1": "A prosecutor in Germany since age 13, she has come to America to defeat me in court."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Max",
      "age": "21",
      "gender": "Male",
      "description1": "A \"fabulous\" magician famed for his aerial illusions. Accused of murder."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Regina Berry",
      "age": "16",
      "gender": "Female",
      "description1": "The idol of the Berry Big Circus and daughter to Russel Berry, the Ringmaster."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Russell Berry",
      "age": "52",
      "gender": "Male",
      "description1": "The victim and Ringmaster of the Berry Big Circus. Regina Berry's father."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Ben",
      "age": "31",
      "gender": "Male",
      "description1": "Real Name: Benjamin Woodman. A ventriloquist. Conversing with him is really tiring.",
      "description2": "Real Name: Benjamin Woodman. Without his puppet Trilo, Ben won't say much."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Moe",
      "age": "46",
      "gender": "Male",
      "description1": "Real Name: Lawrence Curls. The Ringmaster's old friend, a pleasant stooge of a clown."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Acro",
      "age": "26",
      "gender": "Male",
      "description1": "Real Name: Ken Dingling. A star acrobat currently undergoing rehabilitation.",
      "description2": "Real Name: Ken Dingling. Seriously injured both legs while training six months ago."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Bat",
      "age": "22",
      "gender": "Male",
      "description1": "Real Name: Sean Dingling. Bit on the head six months ago by Léon. Still in a coma."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "It's my all-important badge. It shows that I am a defense attorney."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Maya's Magatama",
      "type": "Other",
      "obtained": "Received from Maya Fey.",
      "description1": "Slightly translucent. It radiates softly with a mysterious light."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Crime Photo",
      "type": "Photographs",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "A picture of the crime scene. A person is lying on a case in the snow. There victim’s footprints leading to where he is are visible."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Silk Hat",
      "type": "Evidence",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "Made-to-order fedora that is a symbol of Max's fabulousness. Found at the crime scene."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Max G. Promo Poster",
      "type": "Other",
      "obtained": "Received from the Big Top - Ringmaster's Room.",
      "description1": "Emblazoned with Max's three famous symbols. A silk hat, cloak and white roses."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Ringmaster's Papers",
      "type": "Documents",
      "obtained": "Received from the Big Top - Ringmaster's Room.",
      "description1": "Documents related to Max's salary negotiations. He got an enormous raise 1 week ago."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Circus Map",
      "type": "Maps",
      "obtained": "Received from Moe.",
      "description1": "A map of the Berry Big Circus. The circus is depicted on the left. The ring master’s room and cafeteria are on the northeast of the circus. To the right is the lodging house. Moe is on the first floor and Acro is on the third."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Broken Bottle",
      "type": "Evidence",
      "obtained": "Retrieved from the Big Top - Cafeteria.",
      "description1": "An orange juice bottle that was found broken on the cafeteria floor."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Trilo Quist",
      "type": "Other",
      "obtained": "Retrieved from the Big Top - Ringmaster's Room.",
      "description1": "A ventriloquist's puppet. An operatic tenor who doubles as Ben's sidekick."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Money the Monkey",
      "type": "Other",
      "obtained": "Retrieved from Acro's Room.",
      "description1": "A monkey who takes care of Acro. Habitually gathers all sorts of shiny objects."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Ring",
      "type": "Other",
      "obtained": "Retrieved from Acro's Room.",
      "description1": "A cheap ring with an eerie sparkle. \"From T to R\" is engraved on it."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Russell's Autopsy Report",
      "type": "Reports",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Time of death: 10:15 PM. Cause: Blunt force trauma to the back of the head."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Wooden Box",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "The victim was hunched over this 20 lb. box. It was locked by a small key."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Small Seasoning Bottle",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Found inside the Wooden Box the victim was hunched over. It contains pepper."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Grand Prix Photo",
      "type": "Photographs",
      "obtained": "Received from Max.",
      "description1": "Photo of Max's Award Ceremony. Max is standing at the center holding a trophy. Two girls stand to either side. The bust of max is right next to him."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Max G. Bust",
      "type": "Photographs",
      "obtained": "Retrieved from the Big Top - Cafeteria.",
      "description1": "Bronze statue taken from the cafeteria before the crime. It looks rather heavy."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Note",
      "type": "Evidence",
      "obtained": "Received from Moe.  → Retrieved from the Big Top - Ringmaster's Room.",
      "description1": "Posted in the Cafeteria on the day of the crime, then torn. States: \"To The Murderer!\"",
      "description2": "Torn by Ringmaster, found in his tailcoat pocket. Reads To The Murderer! You haven't forgotten what happened six months ago, have you? I have conclusive evidence of what took place. Meet at 10:00 PM tonight at the lodging house plaza.",
      "description3": "Found in Regina's pocket on the morning of crime. Reads To The Murderer! You haven't forgotten what happened six months ago, have you? I have conclusive evidence of what took place. Meet at 10:00 PM tonight at the lodging house plaza.",
      "description4": "Placed by Acro in Regina's pocket on morning of crime. Reads To The Murderer!\n\nYou haven't forgotten what\nhappened six months ago,\nhave you? I have conclusive\nevidence of what took place.\n\nMeet at 10:00 PM tonight\nat the lodging house plaza.\n"
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Stage Costume",
      "type": "Other",
      "obtained": "Retrieved from Money the Monkey.",
      "description1": "A shiny spangled vest. It's not Maya's size at all."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Léon",
      "type": "Other",
      "obtained": "Received from Regina.",
      "description1": "The animal show's lion. Shot by the Ringmaster six months ago for biting a performer."
    },
    {
      "currentChapter": "Turnabout Big Top",
      "name": "Scarf",
      "type": "Other",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "Bat's scarf. Stained with his blood and a small quantity of pepper."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "Turnabout Big Top\n\n\n\n\n\n\n\n\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 4December 30, 9:41 AMDistrict CourtDefendant Lobby No. 5Maya:\nGood morning, Max.Max:\nOh... Yeah... Good morning, sweeties...Phoenix:\nYou don't seem like your usual sparkling self today. (Changed from [You don't seem like you're [sic] usual sparkling self today.] in the original release)Max:\nI'm always like this before I go in front of an audience... I'm working up to it.???:\nTee hee...Regina:\nDon't get nervous, Maxy... Here, have a glass of milk.Maya:\nR-Regina!!Max:\nHow fabulous!! My sweetie pie!! My sweetie pie princess!! You came to watch my performance today?Regina:\nOf course I did! Moe told me that I should come and watch this.Phoenix:\n(Moe said that...?)Regina:\nSo, what kind of performance will you put on today? Lemme guess, you'll fly at the end?Max:\nUh... It's not kind of show... Isn't that right, my sweeties?Maya:\nHuh?Max:\nI think my sweetie pie princess doesn't...Phoenix:\nYeah. She doesn't seem to realize what's going on... Or even where she is...Max:\nHmm...Regina:\nWell, Max, it looks like it's time to raise the curtain. I'll see you later. Today I'm just a member of the audience!Max:\nF-Fabulous! Enjoy yourself out there!!Regina:\nGood luck, Max! You're the best!!Maya:\nRegina's different, don't you think, Nick?Moe:\nTop of the morning to ya! Everybody... Let's get ready to get stuck in legal limbo! How low can you go?Phoenix:\nM-Moe.Moe:\nTop of the morning to ya, guv'ner.Phoenix:\nUhh... Top of the morning.Moe:\nThat's the ticket! Attacking the day starts with energy in the morning! The early bird gets the worm. But then again, worms lack higher brain function. Aha! Aha! Aha! Aha! Here Max! I brought you a present! Have some milk.Max:\nOh, my! Th-Thanks... (Changed from [Oh my! Thank you!!] in the original release)Moe:\nSo how are you today, Wright?Phoenix:\nWell... I've got the feeling that today I'm going to face off against the real culprit. (Changed from [Well... I've got the feeling that today I'm going to face off against the real criminal.] in the original release)Moe:\nYou mean Acro?Maya:\nHuh!? You think he did it...?Moe:\nBe careful... He's used to putting his life on the line. Literally. He's got guts to spare.Phoenix:\nIf all I've got to worry about is how thin the tightrope is, I'm used to it already... It just means that I won't be able to press him like I can other witnesses...Maya:\nWhat are you going to do then, Nick!?Phoenix:\nI guess today we'll just have to do without our psychological warfare. Today we rely on evidence. It's the only way we'll get past Acro and to the truth.Maya:\nYou're right... But it's gonna be tough...Moe:\nAnyways... I want you to make sure that Regina see it all today. It's important. Then she'll finally have to deal with the reality of what happened to her father.Maya:\nYou want us to make sure Regina watches?Moe:\nYes. That's why I brought her here to court today.Max:\nWhat's that supposed to mean?Moe:\nShe need to know that when people die, they don't just become stars. I may be an old-fashioned clown, but I don't believe in people becoming stars.December 30, 10:00 AMDistrict CourtCourtroom No. 2Judge:\nCourt is now in session for the trial of Maximillion Galactica. (Changed from [The court is now in session in the trial of Maximillion Galactica.] in the original release)von Karma:\nThe prosecution is ready, Your Honor.Phoenix:\nThe defense is ready, Your Honor.Judge:\nVery well. Ms. von Karma, you may proceed with your case.von Karma:\nThe prosecution would like to revise its previous theory of events. (Changed from [The prosecution would like to revise it's [sic] previous theory of events.] in the original release)Judge:\nWhat's the meaning of this?von Karma:\nWe have discovered a new witness. Or shall I say, a new eyewitness. One that saw Maximillion Galactica fly off from the scene of the crime.Judge:\nOrder! Order! I had a feeling something like this would come up...von Karma:\nDue to this revision, we are now prepared to explain how the defendant flew that night. An explanation the prosecution will present if the need so [sic] arises... In fact, my detective stayed up all night creating a mockup of the scene, on my orders.Phoenix:\n(Poor Gumshoe...)Judge:\nVery well... Please call your witness to the stand!Phoenix:\n(Time to get to work! Or shall I say, time to walk the courtroom tightrope...)von Karma:\nName and occupation.Acro:\nKen Dingling, but everyone calls me Acro. I'm employed as an acrobat at the Berry Big Circus.von Karma:\nWhere were you the night of the crime?Acro:\nI was in my room that night.von Karma:\nIf you look at the map, you will see the witness' room is near the crime scene.Acro:\nMy room is on the third floor. The crime scene is below my window.Judge:\nHmm...von Karma:\nThe night of the crime, the witness saw something quite shocking. Would you tell us what you witnessed?Acro:\nOK...Witness Testimony-- What You Witnessed --Acro:\nIt was just after 10:00 PM, and I was resting in my bed.\nAround that time, I heard a large \"THUMP\" noise from outside the window.\nThen a few moments later, I saw someone... flying... Right by my window.\nIt was Max Galactica... I only saw him from behind, but that's who it looked like.\nTo be honest, when I saw that, I thought I was dreaming...Judge:\nHmm... This witness's testimony matches up exactly with that of the clown.von Karma:\nIf that's the case, there is very little the prosecution need add... All that's left is to explain how the defendant disappeared into the sky that night.Phoenix:Phoenix:\nBefore we get that far, I'd like to cross-examine the witness.von Karma:\nA foolish choice by a foolish fool who wishes to feel the foolish sadness of a sad fool. A man must know the proper timing for things, Mr. Phoenix Wright. Just like your old friend, Mr. Miles Edgeworth did.Phoenix:\n...Judge:\nMr. Wright. Do you have a problem with the witness' testimony?Phoenix:\nIn the words of Ms. von Karma, may I quote yesterday's proceedings... \"There's no way that actually happened!\"Judge:\nVery well... You may proceed with your cross-examination.Cross Examination",
      "testimonies": [
        {
          "testimony": "It was just after 10:00 PM, and I was resting in my bed.",
          "person": "Acro",
          "present": []
        },
        {
          "testimony": "Around that time, I heard a large \"THUMP\" noise from outside the window.",
          "person": "Acro",
          "present": []
        },
        {
          "testimony": "Then a few moments later, I saw someone... Flying... Right by my window.",
          "person": "Acro",
          "present": []
        },
        {
          "testimony": "It was Max Galactica... I only saw him from behind, but that's who it looked like.",
          "person": "Acro",
          "present": []
        },
        {
          "testimony": "To be honest, when I saw that, I thought I was dreaming...",
          "person": "Acro",
          "present": []
        }
      ],
      "noPresent": true,
      "difficulty": "n/a"
    },
    {
      "category": "cross_examination",
      "newContext": "-- What You Witnessed --Acro:\nIt was just after 10:00 PM, and I was resting in my bed.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou said that you were resting in bed. One would thus assume that you turned the lights off in your room, correct?\nAcro:\nThat's correct. But there are safety lights around the outside of the lodging house. It's so bright, sometimes it can make it hard to sleep...\nJudge:\nIf that's the case, wouldn't it be a good idea to close some curtains?\nAcro:\n... I never really thought of that. I guess that means I'm off to buy some curtains.\nJudge:\nHah hah... Sometimes I do make myself useful in these chambers. OWWW!!\nvon Karma:\nThe witness will proceed with his testimony!Acro:\nAround that time, I heard a large \"THUMP\" noise from outside the window.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYour room is on the third floor, right?\nAcro:\nYes.\nPhoenix:\nAnd you said that you were resting in bed.\nAcro:\nThat is correct.\nPhoenix:\nBut you were still able to hear a sound from outside?\nAcro:\nI was indeed.\nPhoenix:\n(Pressing Acro doesn't seem to get results... Hmm... Maybe something was contradictory with what he just said...)\n\n\n\nThere's nothing wrong.\n\n\n\n\n\n\n\nJudge:\nWhat's the matter, Mr. Wright?\nPhoenix:\nN-N-Nothing, Your Honor. (Until I can find a clear contradiction... I should tread lightly.)\nvon Karma:\n...\nLeads back to cross-examination\n\n\n\n\nThere is a contradiction.\n\n\n\n\n\n\n\nPhoenix:\nThere is a huge contradiction with the testimony that was just given!\nvon Karma:\n\nvon Karma:\nIf there's a contradiction, then prove it with evidence!\nJudge:\nHmm... She's right. Let's see some evidence. Do you have any evidence to support your claim of a contradiction?\n\n\n\nPresent anything\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\nT-This... What in the world is this? OWWW!!\nvon Karma:\nYou just don't get it, do you Mr. Phoenix Wright?\nPhoenix:\nW-What don't I get?\nvon Karma:\nYou're not going to be able to get through this one with your usual bluff routine! You're* ([sic]) client looks to be* ([sic]) ready to take off once again! Straight towards a guilty verdict...\nJudge:\nYou were... B-Bluffing? I will not forgive any more mockeries made of this court!\nPhoenix:\n(W-Whoops!)\nvon Karma:\nWitness... Would you mind repeating your testimony?\nAcro:\nCertainly...\nLeads back to cross-examinationAcro:\nThen a few moments later, I saw someone... Flying... Right by my window.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAre you sure it was a human being? It could've been a mannequin, or perhaps a large action figure...\nAcro:\nHmm... Well, setting aside the possibility of a mannequin, an action figure is plausible...\nvon Karma:\nYou have no need to mince words with Mr. Phoenix Wright. Testify the truth and only the truth. Just as if we were there with you that night...\nAcro:\nI believe it was a human.\nJudge:\nHmm...\nPhoenix:\n(Damn... I just strengthened his testimony... I wonder if Acro's statement jives with the facts...)\n\n\n\nThere's nothing wrong.\n\n\n\n\n\n\n\nJudge:\nWhat's the matter, Mr. Wright?\nPhoenix:\nN-N-Nothing, Your Honor. (Until I can find a clear contradiction... I should tread lightly.)\nvon Karma:\n...\nLeads back to cross-examination\n\n\n\n\nThere is a contradiction.\n\n\n\n\n\n\n\nPhoenix:\nThere is a huge contradiction with the testimony that was just given!\nvon Karma:\n\nvon Karma:\nIf there's a contradiction, then prove it with evidence!\nJudge:\nHmm... She's right. Let's see some evidence. Do you have any evidence to support your claim of a contradiction?\n\n\n\nPresent anything\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\nT-This... What in the world is this? OWWW!!\nvon Karma:\nYou just don't get it, do you Mr. Phoenix Wright?\nPhoenix:\nW-What don't I get?\nvon Karma:\nYou're not going to be able to get through this one with your usual bluff routine! You're* ([sic]) client looks to be* ([sic]) ready to take off once again! Straight towards a guilty verdict...\nJudge:\nYou were... B-Bluffing? I will not forgive any more mockeries made of this court!\nPhoenix:\n(W-Whoops!)\nvon Karma:\nWitness... Would you mind repeating your testimony?\nAcro:\nCertainly...\nLeads back to cross-examinationAcro:\nIt was Max Galactica... I only saw him from behind, but that's who it looked like.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThe light in your room was turned off then, right?\nAcro:\nThat's true. I was going to bed after all...\nPhoenix:\nSo with the lights off, you were still able to clearly see a human fly by your window?\nAcro:\nThe safety lights lit things up enough for me to see. But honestly, there was only enough light for me to see the silhouette outside my window. It was the person's back, so I couldn't see the white roses on the front.\nJudge:\nDid you see any of the other symbols?\nAcro:\nI clearly saw the silk hat, as well as the cloak wrapped around his body. I'm convinced that the person I saw was Max Galactica.\nJudge:\nHmm...\nPhoenix:\n(The more I press him, the less results I seem to get... But maybe there was something fishy with his latest bit of testimony?)\n\n\n\nThere's nothing wrong.\n\n\n\n\n\n\n\nJudge:\nWhat's the matter, Mr. Wright?\nPhoenix:\nN-N-Nothing, Your Honor. (Until I can find a clear contradiction... I should tread lightly.)\nvon Karma:\n...\nLeads back to cross-examination\n\n\n\n\nThere is a contradiction.\n\n\n\n\n\n\n\nPhoenix:\nThere is a huge contradiction with the testimony that was just given!\nvon Karma:\n\nvon Karma:\nIf there's a contradiction, then prove it with evidence!\nJudge:\nHmm... She's right. Let's see some evidence. Do you have any evidence to support your claim of a contradiction?\n\n\n\nPresent Silk Hat\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"You claim to have seen the exact same thing Moe saw that night. Do you stand by that?\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\nT-This... What in the world is this? OWWW!!\nvon Karma:\nYou just don't get it, do you Mr. Phoenix Wright?\nPhoenix:\nW-What don't I get?\nvon Karma:\nYou're not going to be able to get through this one with your usual bluff routine! You're* ([sic]) client looks to be* ([sic]) ready to take off once again! Straight towards a guilty verdict...\nJudge:\nYou were... B-Bluffing? I will not forgive any more mockeries made of this court!\nPhoenix:\n(W-Whoops!)\nvon Karma:\nWitness... Would you mind repeating your testimony?\nAcro:\nCertainly...\nLeads back to cross-examinationAcro:\nTo be honest, when I saw that, I thought I was dreaming...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhen did you start thinking that what you saw \"wasn't a dream\"?\nvon Karma:\n\nvon Karma:\nThat's not important...\nPhoenix:\n\nPhoenix:\nI believe that the prosecution has done a bit of maintenance on the witness's memory!\nJudge:\nHmm... Just to make sure, let's ask the witness. OWWW!!!\nvon Karma:\nObjection...\nJudge:\nS-Sustained...\nPhoenix:\n(Don't sustain that!!)Maya:\nAcro must be lying about what he saw, right? (Changed from [Acro must be lying about things, huh?] in the original release)Phoenix:\nOf course he is. Now the challenge will be to expose his lies in court.Maya:\nWell, put the pedal to the metal, Nick!Phoenix:\nYou claim to have seen the exact same thing Moe saw that night. Do you stand by that?Acro:\nWhat do you mean...?Phoenix:\nThe silk hat.Acro:\nWhat about the silk hat? I saw it on Max's head as he flew by my window.Phoenix:\nWell... You should have tried looking down out of your window that night.Acro:\nThat would have been quite difficult considering the state that I'm in. Just looking outside of the window was a tough enough challenge for me.Phoenix:\nThat's a shame, because you would have noticed the silk hat found on the scene.Acro:\nThat... That's the Ringmaster's hat... Right?Phoenix:\nAfraid not. No matter how you look at it, this is Max's silk hat.Judge:\nWhere are you going with this, Mr. Wright? Are you saying that Max has two silk hats!?Phoenix:\nNo. This is a handmade, one-of-a-kind model made only for Maximillion Galactica. Which means, Acro... That you've been fibbing on the stand!Judge:\nOrder! Order!von Karma:von Karma:\nAs always, it looks like someone just had to open their mouth before thinking... (Changed from [Like always, someone has to open their mouth before thinking...] in the original release)Maya:\nAre you OK, Nick?Phoenix:\nWell, I opened my big mouth, and now I have to back it up...Judge:\nHow about it, Mr. Wright? What would cause this witness to commit perjury in this court today?He has a grudge against Max.\n\n\n\n\n\n\n\nPhoenix:\nPerhaps it is because Acro has a grudge agains the defendant! Which is why he is trying to frame Max...\nJudge:\nOWWW!! Why me!? What'd I do!?\nvon Karma:\nNever get your fat head in the way of a whip bent on finding justice! Mr. Phoenix Wright... I have no interest in your silly little theories! He has a grudge against the defendant, huh? You wouldn't happen to have proof of that?\nPhoenix:\nWell... Umm... That's the thing...\nJudge:\nMr. Wright! Thanks to you, I got my head lashed by Ms. von Karma's whip! I don't like getting hit for nothing, so how about you answer with an explanation!\nLeads back to:\n\"Are you OK, Nick?\"Acro was dreaming.\n\n\n\n\n\n\n\nPhoenix:\nIt's obvious that what Acro saw, he didn't actually see at all, because it was a dream!\nvon Karma:\n\nvon Karma:\nSo you plan on writing off all the inconvenient facts as nothing but dreams? Maybe you should just pinch your cheeks and see if you are actually awake.\nPhoenix:\nOWWW!! (I think your whip proved this isn't a dream just fine...)\nJudge:\nMr. Wright! How about you provide an answer that actually explains things!\nLeads back to:\n\"Are you OK, Nick?\"Acro is the real culprit.\n\n\n\n\n\n\n\nLeads to:\n\"... Your Honor!\"Phoenix:\n... Your Honor! On this occasion, the defense accuses Acro himself!von Karma:\n\"On this occasion\"...?Judge:\n\"A-A-Accuses Acro\"!? What in the world are you accusing him of?Phoenix:\nObviously we accuse him of the murder of Mr. Russell Berry!Judge:\nMr. Wright, are you serious!?Phoenix:\nDeadly serious, Your Honor.von Karma:\nHa ha ha... I think your trips to the circus have served you well... You seem to have learned how to try and grab at an audience's hearts and minds. (Changed from [You seem to remember how to try and grab at an audience's hearts and minds.] in the original release)Phoenix:\n...!!von Karma:\nYour Honor. Don't allow yourself to be swayed by theatrics. Trying to wow the crowd with smoke and mirrors is the oldest bluff in the book.Judge:\nR-Really...?von Karma:\nIf you don't believe me, just look at the witness. He's calm enough for it to almost be scary...Phoenix:\n(Hmm... He is staying rather calm and collected...)Judge:\nMr. Dingling, do you have any response to the defense's accusation?Acro:\nI don't really need to say a thing, do I?Judge:\nWhat do you mean?Acro:\nEveryone, take a good look at me. I can't even stand up by myself, let alone leave the lodging house.Judge:\nT-That's true...Acro:\nI understand that Mr. Wright is just trying to help his client. But to do this by accusing me of a murder of all things...von Karma:\nSee! Even a sliver of common sense makes it clear the accusation is ludicrous! (Changed from [See! Even a silver [sic] of common sense makes it clear the accusation is ludicrous!] in the original release)She's right! Way to pick on the disabled you heartless, cruel man!Phoenix is a poopyhead!!von Karma:\nSee that, Mr. Phoenix Wright? If you're trying to drum up support from the peanut gallery, that's how you do it.Phoenix:\nUhh...von Karma:\nI think that's enough of this little game. I've got a doctor's note to confirm that Acro is unable to stand under his own power. Maybe the defense is planning on making a claim to counter this as well? I can hear the defense now... \"Acro had an accomplice!!\"Judge:\nWhat do you say about this, Mr. Wright? Did Acro have an accomplice?Of course he did.\n\n\n\n\n\n\n\nPhoenix:\nIt's impossible for Acro to be the murderer in this case. If that's the case, then it's natural for one to consider possible accomplices!\nJudge:\nHmm... You don't say...\nPhoenix:\n(Not good... Not good... This isn't going to end well.)\nvon Karma:\nDon't tell me you think you're gonna get off easy.\nPhoenix:\nW-WHAT!?\nvon Karma:\nYou must not have heard that sound just now... Maybe it wasn't clear enough... The sound of you falling into your own trap can be hard to notice sometimes!\nJudge:\nMr. Wright... It seems as if you won't be stopping at Acro, but will be making other accusations. If Acro did not have an accomplice, things are not looking good for you!\nPhoenix:\nI understand, Your Honor. *gulp*\nJudge:\nVery well... Let's continue. Who, perchance, would happen to be Acro's accomplice?\n\n\n\nPresent anything\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\nYou... You don't say!\nPhoenix:\n(Uh oh... This is suddenly looking very very bad...)\nvon Karma:\nDon't tell me you think you're gonna get off easy.\nPhoenix:\nW-W-W-WHAT!?\nvon Karma:\nOh... Did you hear that?\nPhoenix:\nHear what?\nvon Karma:\nThe sound of you getting caught in your own trap! What a splendid accomplice. I'm sure this accusation is built on a solid foundation.\nPhoenix:\nFoundation...\nJudge:\nYes, Mr. Wright... Do you have proof that this person you've accused was indeed an accomplice?\n\n\n\nPresent anything\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\n... Mr. Wright...\nPhoenix:\nY-Yes, Your Honor?\nJudge:\nThis piece of evidence is lacking in persuasive power.\nvon Karma:\nYou didn't miss that sound, did you Mr. Phoenix Wright? You know... The sound of you receiving a penalty!!\nPhoenix:\n(Arrrrghhhh!)\nMaya:\nWhat are you doing, Nick!?\nLeads back to:\n\"What do you say about this, Mr. Wright? Did Acro have an accomplice?\"Of course he didn't.\n\n\n\n\n\n\n\nLeads to:\n\"Now then, this must be when we get to hear the name of the mystery accomplice!\"von Karma:\nNow then, this must be when we get to hear the name of the mystery accomplice!Phoenix:\nNot this time, Von Karma.von Karma:\nWh... WHAT!?Phoenix:\nYou're not going to sucker me into this one.Judge:\nWhat are you blabbering about, Mr. Wright?Phoenix:\nThere was no accomplice! Acro planned and committed this murder all by himself!Judge:\nO-Order! Order! What the... What are you getting at!?Maya:\nWay to keep them on their toes, Nick!Phoenix:\nNow I'm going to have to prove how it all fits together... I have to show how Acro murdered Russell Berry.Maya:\nCan you do it Nick? Can you really do that!?Phoenix:\nI know what I can't do. I can't stop now... If I stop attacking, I'm doomed!Maya:\nAlright! Then let's do it!!von Karma:\nMr. Phoenix Wright... If this witness is the killer, then his eyewitness account is all lies, right?Judge:\nHmm... Mr. Wright, I'd like you to clear something up for me... When the crime was committed, exactly where was Mr. Dingling?Present Acro's room\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"He was obviously here the entire time.\"Present plaza\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThere is no way he was anywhere but exactly right here!\nJudge:\nIn the plaza? He was at the scene of the crime itself? You're right though... The murderer would have had to have met the victim...\nvon Karma:\n\nPhoenix:\nOWWW!!\nJudge:\nMs. von Karma! Stop it!! You will be quiet and refrain from striking people!\nvon Karma:\nThe witness could not have possibly left the lodging house on his own! Not to mention what Mr. Phoenix Wright just said! \"There was no accomplice!\" remember?\nPhoenix:\nYeah... Um... You're right. You think I could get another chance?\nJudge:\nWait just one minute. Don't forget about my proverbial whip as well.\nPhoenix:\n(Arrrrgh!)\nLeads back to:\n\"Hmm... Mr. Wright, I'd like you to clear something up for me...\"Present anywhere else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHe was right here!\nJudge:\nWhat!? That location is completely unrelated to the crime... But I suppose if you said he was in his room, he wouldn't have been able to commit...\nvon Karma:\n\nPhoenix:\nOWWW!!\nJudge:\nMs. von Karma! Stop it!! You will be quiet and refrain from striking people!\nvon Karma:\nThe witness could not have possibly left the lodging house on his own! Not to mention what Mr. Phoenix Wright just said! \"There was no accomplice!\" remember?\nPhoenix:\nYeah... Um... You're right. You think I could get another chance?\nJudge:\nWait just one minute. Don't forget about my proverbial whip as well.\nPhoenix:\n(Arrrrgh!)\nLeads back to:\n\"Hmm... Mr. Wright, I'd like you to clear something up for me...\"Phoenix:\nHe was obviously here the entire time.Judge:\nThat's... Acro's room?Phoenix:\nPretty simple, eh? Acro wasn't able to leave the lodging house by himself. In that case, there can be only one correct answer! (Changed from [There's only one answer to that...] in the original release) Acro didn't leave his room to kill the Ringmaster!von Karma:\nWhat!? Are you nuts!?Judge:\nWhat say you, Mr. Dingling!?Acro:\n... It's an interesting theory.Phoenix:\n... Umm... That's it?Acro:\nConsidering that what you proposed is impossible, yes, that's it.Judge:\nHmm... Mr. Wright.Phoenix:\nYes, Your Honor.Judge:\nAs the witness has stated... Your assertion is impossible. As he is in a wheelchair, there is no way he could go to the scene or be the killer.Phoenix:\nHmm... You've got a point.von Karma:\nIt seems you've forgotten once again, Mr. Phoenix Wright. The defendant was clearly spotted at the scene of the crime.Maya:\nThat's true! Moe said that he saw Max, didn't he?Phoenix:\nBut Maya, it's still impossible for humans to fly.Acro:\nDo you mind if I ask a question, Mr. Wright?Phoenix:\nWhat is it?Acro:\nI understand some of your logic... However, how do you think that I killed him? If I can't leave my room, I obviously couldn't wear Max's costume...Phoenix:\n(Hmm... How did he do it? That's the next course of this legal buffet...)Maya:\nBe careful, Nick. If you mess up here...Phoenix:\n(She's right. I can't mess up here. I've gotta give this one some serious thought! I'm sure that Acro killed the Ringmaster... And he did it while he was in his room... No doubt about it! (Changed from [And he killed the Ringmaster while he was in his room... No doubt about it!] in the original release))Judge:\nTime to enlighten us as to how Mr. Dingling committed the crime, Mr. Wright!Present evidence\n\n\n\n\n\n\n\nLeads to:\n\"I'm going to present some evidence!\"Can't present evidence now\n\n\n\n\n\n\n\nvon Karma:\nAhh... I think we will finally be graced with an explanation!\nPhoenix:\nDon't push it, Von Karma!\nvon Karma:\nWha... WHAT!?\nPhoenix:\nYou aren't gonna suck me in this time. I'm smart enough to know when I don't have the cards to play and my hand sucks right now.\nJudge:\n... Uhh... What do you mean, Mr. Wright?\nvon Karma:\nHe means that everything he's said up until now has all been nonsense.\nPhoenix:\nUh.\nvon Karma:\nIt's true, right? If you can't establish proof of your murder theory, then it's nonsense!\nPhoenix:\nUhhh...\nvon Karma:\nHe's trying to fool us by playing some misdirection game.\nPhoenix:\n(It looks like this isn't going to pass muster...)\nMaya:\nNick! You've gotta show them some evidence!\nPhoenix:\nEasier said than done...\nJudge:\nSo what will it be, Mr. Wright!?\nLeads to:\n\"I'm going to present some evidence!\"Phoenix:\nI'm going to present some evidence!Judge:\nSo what did Mr. Dingling use to commit the crime of murder against Russell Berry?Present Max G. Bust\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"What's that? A picture?\"Present anything else\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\n...\nvon Karma:\n...\nAcro:\n...\nMaya:\nI think you should try again, especially before someone gets the chance to say something.\nPhoenix:\nYeah, you're probably right. Umm... So as I was saying... This piece of evidence--\nJudge:\nStop! Stop! Wait, I say! Before you start over, you must be penalized!\nPhoenix:\n(Doh! He caught me...)\nJudge:\nAnd if you don't put an end to this funny business, I've got a few more ideas!\nLeads back to:\n\"I'm going to present some evidence!\"Judge:\nWhat's that? A picture?Phoenix:\nIt is indeed. The problem is with the item that's shown in the picture.Judge:\nThe bust?Phoenix:\nIt's quite a large bust. And because it is life sized, it is also very, very heavy.von Karma:\nHeavy...?Phoenix:\nHeavy enough to guarantee a certain death. Especially if it was dropped from a third story window.von Karma:\nAHHH!!Acro:\n...Phoenix:\nSee! This is how Acro was able to kill the Ringmaster! With the force of gravity and Maximillion Galactica's ample bust!Judge:\nOrder! Order! So you're saying the bust fell onto the Ringmaster!?Phoenix:\nA rather simple crime... Even if you were stuck in a wheelchair, it would be incredibly easy to commit...von Karma:von Karma:\nHow could you possibly wheel a wheelchair with something so heavy!? It's impossible!Phoenix:Phoenix:\nWell, Acro is an acrobat! He should have more than enough upper body strength to carry something like the bust!Judge:\nMr. Dingling, how do you respond to these charges!?Acro:\nWell...Maya:\nAcro's at a loss for words!Phoenix:\n(He should be... He knows that I'm getting close to the truth!) Well well well, Acro. You can't run away from things this time... OWWW!!von Karma:\nI'd watch what I say, if I were you, Mr. Phoenix Wright.Phoenix:\nWh-What!?von Karma:\nYour Honor! The physical health of the witness is material to this case! I demand that we get proper testimony from the witness himself!Judge:\nHmm... Testimony you say...Phoenix:\n(Von Karma... She's just using this \"testimony\" as a rouse [sic] to stall for time!)Phoenix:Phoenix:\nThere is absolutely no need for such testimony!von Karma:von Karma:\nThe defense has its version of the murder. The prosecution has the right to respond!Judge:\nThe defense's objection is overruled...Phoenix:\n(Why can't he see things my way once in a while!)Judge:\nMr. Dingling, I'm sorry, but we need you to testify about your physical condition. If you have any doubts about your ability to testify, we can request expert testimony.von Karma:\nThe witness will have no problems; however, let's all be respectful towards him.Acro:\nThank you...Phoenix:\n(Argh! That woman will sink to any low to win a case!)Witness Testimony-- Acro's Physical State --Acro:\nI suppose I could have lifted something the size of that bust.\nI have a strong upper body from working as an acrobat, and only my legs were injured.\nHowever, lifting the bust and looking out of the window would've been impossible.\nThere's no way I could have exerted that kind of force on my lower body.\nThat makes it impossible for me to have known the location of the Ringmaster's head.\nThus it would be unrealistic to drop the bust on him. Don't you think?Judge:\nHmm... I have no doubts in regards to this witness's testimony.von Karma:\nIt was impossible for him to lift the bust and stick himself out far enough to look. (Changed from [It was impossible for him to lift the bust and carry it over to the window.] in the original release) Not to mention that he could not have known the location of the Ringmaster's head. A single false step would have lead [sic] to even more severe injuries.Judge:\nThat's what I was thinking. What is your opinion on the matter, Mr. Wright?Phoenix:\n... I'd still like to proceed with my cross-examination.von Karma:\nHe's simply stalling. It's shameful, really.Phoenix:\n(Grr... I can't let her get to me... I've got to focus...)Cross Examination",
      "testimonies": [
        {
          "testimony": "I suppose I could have lifted something the size of that bust.",
          "person": "Acro",
          "present": []
        },
        {
          "testimony": "I have a strong upper body from working as an acrobat, and only my legs were injured.",
          "person": "Acro",
          "present": []
        },
        {
          "testimony": "However, lifting the bust and looking out of the window would've been impossible.",
          "person": "Acro",
          "present": []
        },
        {
          "testimony": "There's no way I could have exerted that kind of force on my lower body.",
          "person": "Acro",
          "present": []
        },
        {
          "testimony": "That makes it impossible for me to have known the location of the Ringmaster's head.",
          "person": "Acro",
          "present": [
            "Wooden Box",
            "Crime Photo"
          ],
          "source": {
            "evidence_span": "The victim was hunched over this 20 lb. box",
            "testimony_span": "That makes it impossible for me to have known the location of the Ringmaster's head",
            "explanation": "The point marked out by the wooden box would be exactly where the Ringmaster's head is, so it is possible to ascertain its location.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "difficult"
          }
        },
        {
          "testimony": "Thus it would be unrealistic to drop the bust on him. Don't you think?",
          "person": "Acro",
          "present": [
            "Wooden Box",
            "Crime Photo"
          ],
          "source": {
            "evidence_span": "The victim was hunched over this 20 lb. box",
            "testimony_span": "it would be unrealistic to drop the bust on him",
            "explanation": "The point marked out by the wooden box would be exactly where the Ringmaster's head is, so it is possible to ascertain its location.",
            "is_self_contained": "yes",
            "context_span": "none",
            "difficulty": "difficult"
          }
        }
      ],
      "noPresent": false,
      "difficulty": "difficult",
      "labels": [
        "spatial",
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims he could not have known the victim's head location.",
        "Fact 2: The evidence suggests the victim was hunched over the box.",
        "Fact 3: If someone hunches over a box, they are likely trying to pick it up.",
        "Fact 4: If someone is trying to pick up a box, their head would be directly above it."
      ]
    }
  ]
}