{
  "previousContext": "The Stolen TurnaboutTranscriptPart 1Part 2Part 3Part 4Episode 2The Stolen TurnaboutThe time is 1:00 AM.Beep... Beep... Beep... Beeeeeeep...Detective! We made it!Whew... What a relief. Glad the jewel is still safe.Ho ho! You said it, pal. It musta been our rock solid security that scared him off!Would you mind opening the safe just to double check?Aaaaaaaaaah! We've been had!O-Out front! Guards! Turn on the searchlights!Aha ha ha ha ha ha ha... Better luck next time, gentlemen! Aha ha ha ha ha ha ha... Excuse me, but I'm afraid I must be leaving now! We shall meet again... When the next moon is full! Aha ha ha ha ha ha ha... Ahaaaa ha ha ha ha ha ha...October 11, 3:24 PMWright & Co. Law OfficesMaya:Hey, Nick! Get a load of this! Hey, are you listening to me!? You can clean the toilet later! This is important!Phoenix:*sigh* What are you freaking out about now?Maya:Hey hee. Today will be the last time you talk to me that way!Phoenix:Huh?Maya:We're about to hit the big time!Phoenix:\"Big time\"? And what do you mean by \"we\"? You don't mean you and me are...?Maya:Ha! Don't be silly. I'm talking about me and Pearly, of course!Pearl:Hello. It's a pleasure to see you again, Mr. Nick!Phoenix:Pearls! You haven't changed a bit! Wait... What are you doing here anyway?Pearl:Hee hee. Haven't you heard, Mr. Nick? Here! Take a look at this!Phoenix:(What's this...? Some kind of poster?) Kurain Village... Isn't that...?Maya:That's right. It's our hometown... Pearly and mine, that is.Phoenix:What's this about \"treasures\" from the boonies?Maya:Ha ha ha. Very funny. You can laugh all you want... But you'll be singing another tune tonight!Phoenix:Tonight? What about tonight?Pearl:The \"Treasures of Kurain\" exhibit doesn't actually start until next week, but... ...the promoter sent us some special VIP entry passes!Maya:That's why I dressed up extra special today! What do you think, Nick?Phoenix:(Heh. Same Maya. Different day.) This young lady here is Maya Fey... The younger sister of Mia Fey... ...My friend and mentor. I first met her two years ago... I was working on the case surrounding Mia's death, and ever since then...Maya:I've been the one who's been keeping this law office afloat from behind the scenes.Phoenix:Actually that's just a cover for her true identity... In reality, she's a spirit medium, and a bit of a shady character.Maya:Hey! Who are you calling \"shady\"!?Phoenix:And this little girl is Pearl Fey, but I usually call her \"Pearls\". She's Maya's cousin and a spirit medium in training herself.Pearl:I know I'm a bit young, but I want to help in any way I can, Mr. Nick!Phoenix:Kurain Village is the home of the mysterious Kurain Channelling Technique. And Maya here is the daughter of the Kurain School of Channeling's Master. ...I know it sounds ridiculous, but it's no joke. I've seen her power with my own eyes... It's the real thing alright.Maya:Earth to Nick! How long are you going to make two gorgeous women like us wait!?Pearl:Yes, Mr. Nick! I can't wait any longer! I want to see the exhibit!Phoenix:(*sigh* Looks like I don't get a choice here. Might as well head on out...)Treasure Exhibit Poster added to the Court Record.October 11, 7:18 PMLordly TailorMain Exhibition HallPhoenix:(\"Lordly Tailor\"... The city's fanciest and most expensive department store. Treasure Exhibit, huh... I have to admit I'm pretty impressed.)Maya:Wow... This is awesome!Phoenix:Yeah... You can make even the cheapest junk look great... It all depends on how you display it.Pearl:Oh! They even have the dusty old hanging scroll that was in the Fey Manor storeroom!Maya:Oh yeah, I remember scribbling on it when I was a little girl!Phoenix:(On a family heirloom...!?)Maya:Say, Nick... The person in charge of this exhibition is waiting for us in the basement warehouse.Phoenix:Alright... (I guess we should go and say hello...)ExamineBlue boardPhoenix:A piece of cloth with a ton of finely-written characters jammed onto it. Probably esoteric knowledge only mediums would know. ...Hmm, let's see... Here's the title in English... \"108 Ways to Save Money.\" ... I'm pretty sure the number has gone up since the last time I saw it.Maya:Well, we're always looking for new ways you know!Phoenix:Being a medium sounds like a rough way of life...CushionPhoenix:What's with this big cushion? It's just lying around, with nothing on it.Maya:Hmm... Well it must be for the greatest treasure of all!Phoenix:\"Greatest treasure\"...? Is there something like that?Maya:Huh? Why... Of course there is! Right, Pearly?Pearl:Oh! Um, yeah! Of course!Maya:Yeah, I'll bet it would really take your breath away!Folding screenPhoenix:I think I remember this old folding screen here... I'm pretty sure it was an important piece of evidence... ...in that murder case that happened in Kurain Village.Pearl:This folding screen is the greatest of all the spirit channeling secrets... The Six Leaf Kurain Sacred Writings folding screen!Phoenix:(If it's so secret, why is it the most prominent thing in the exhibit?)UrnsPhoenix:They're just a bunch of old urns... Are these really \"treasures\", too?Maya:Of course they are! This is a \"Treasure Exhibit\", isn't it!?Phoenix:Well yeah, I guess so. ... (So all it takes to be a \"treasure\" is age? No wonder nobody like museums...)Kurain Village dioramaPearl:Oh! Mystic Maya, look! I can't believe it!Maya:Ah! It's so cute! It's a little diorama of Kurain Village!Phoenix:...Yeah, look at that. But somehow, it seems to reek of dreariness.Pearl:Oh! Mystic Maya, It's your house! It even says, \"Fey Manor\" on it!Maya:Yikes! You're right! I kinda want to add \"The Famous\" in front of it!Phoenix:Don't do it, Maya. ...They might get mad.October 11Lordly TailorBasement WarehousePhoenix:(Yup. This is a basement warehouse alright...)Pearl:Th-This place is scary... I feel like a monster could jump out at any time...Maya:Don't be scared, Pearly! I'll protect you!???:...Oh... ...Mr. Wright.Maya:Eeeeeeeek!! A monster! You were right!Phoenix:(Huh? A monster...?)???:Good evening. ...It's good to see you again.Phoenix:Y-You... I know you...???:Ha ha. Nice to see you again too, little miss.Pearl:Ah! H-Hello!Maya:Is she a friend of yours, Nick? ...And how do you know her, Pearly?Andrews:Nice to meet you. I'm Adrian Andrews. I'm in charge of the promotion and planning for this Treasure Exhibit. I'm also responsible for the security arrangements.Maya:Oh, um... N-Nice to meet you.Phoenix:(Adrian sure has changed since we last met...)Andrews:So this is the warehouse. The really valuable exhibit items are still stored away in here.ExamineSecurity cameraPhoenix:It's a security camera. It's trained on the warehouse door.Andrews:It's set up to take a picture of anyone that enters or exits the door. An ounce of prevention is worth a pound of cure, they say.ComputerPhoenix:This computer... It looks like it's hooked up to the security camera above.Maya:And that means what?Phoenix:The camera is set up to take a photo of anyone that goes in or out of the storeroom... Then the data from the camera gets uploaded to this computer here. That's what.Maya:I see... That's some pretty high-tech stuff.Big signboardPhoenix:It looks like a part of a big signboard. All I can read on it is the \"bur\".Maya:Aha! I've got it! Maybe it's supposed to say, \"Hamburger\"!Phoenix:Why would anyone write \"Hamburger\" that big?Maya:Like, maybe for the \"World Hamburger Festival\" or something?Phoenix:I kinda doubt it.Maya:Aha! I've got it! Maybe it said, \"Spaghetti\"!Phoenix:...Why are you talking about food? Oh, wait. That's normal for you. Anyway, it says, \"bur\". There's no way it could be \"Spaghetti\".Maya:Well, maybe it was a typo! It might have said, \"Spaghetti Festival\". What do you think?Phoenix:OK to me... Besides, Spaghetti is the only thing more tangled than your reasoning.(Step)ladderMaya:Look, a ladder!Phoenix:That's a \"step\"-ladder.Maya:So? What's the difference? You need to stop judging things based on narrow-minded cultural assumptions, Nick!Phoenix:R-Right... sorry. (Why do I feel like we've had this exact same conversation before somewhere...?)Door to the storeroomPearl:Mr. Nick, what's that big door over there?Phoenix:It looks like it's the door to the actual storeroom. I can see lots of big boxes and stuff back there.Maya:Really? Let's go in! I wanna take a look!Andrews:Oh... I'm sorry! Unauthorized personnel aren't allowed in there.Maya:...Did you hear that, Nick? We're unauthorized personnel.Phoenix:Why are you telling me that?Ami Fey statuePearl:Mystic Maya! Take a look next to the door! That... That's Mystic Ami, right?Andrews:Yes, that's a statue of the woman who invented the Kurain Channeling Technique, Ami Fey. This statue is on loan from one of the training halls of the Fey branch family. In fact, it just arrived this morning.Ami Fey's Golden Statue added to the Court Record.Phoenix:What's that creepy-looking thing she's holding?Maya:Don't ask me! How should I know...?Phoenix:...Well, you ARE the future Master, right?Maya:Maybe so, but this is the first time I've ever seen this statue.Andrews:That \"thing\" is the Kurain Shichishito. It's a ceremonial sword. It's not a real weapon, so the blade isn't sharp.Maya:...Aww, phooey. I wanted to cut something!Phoenix:Why are you eyeing me for!?Ami Fey statue (subsequent times)Pearl:Mystic Maya! Take a look next to the door! That... That's Mystic Ami, right?Andrews:Yes, that's a statue of the woman who invented the Kurain Channeling Technique, Ami Fey. This statue is on loan from one of the training halls of the Fey branch family. In fact, it just arrived this morning.\"ORGANI\" panelsPhoenix:It says \"ORGANI\".Maya:No it doesn't, Nick! It says, \"ORGANIZE\"! You just can't see the last two letters.Phoenix:Yeah, well I guess no one else could read it either, because this place is a mess.Maya:Yeah. You must feel right at home, huh?TalkAdrian AndrewsAndrews:It really has been a long time, hasn't it, Mr. Wright?Maya:Nick! What's going on!? Who is this woman!?Phoenix:Wh-Why are you freaking out on me!? (Changed from [Wh-Why are you spazzing out on me!?] in the original release)Maya:What? I just thought it'd be more dramatic if I got all worked up. That's all.Pearl:Mystic Maya! You shouldn't let him of the hook so easily!Phoenix:(Please, Maya, don't say anything that'll needle Pearls further...)Andrews:Mr. Wright was there for me when I really needed help. It... It was something that happened 7 months ago.Phoenix:You remember, don't you? The \"Nickel Samurai\" case.Maya:Not really... I was stuck in a dark wine cellar... Did that escape your memory, Nick?Andrews:After that, I quit being a manager and started this job.Phoenix:Wow, that's tough. I'm sorry, Ms. Andrews. If it wasn't for us...Andrews:No! Don't say that! I'm glad the whole thing happened. Thanks to you and everyone else that was involved, I was able to change my whole life. ...I really am grateful.Phoenix:(Whew, that's a relief...)Lordly TailorPhoenix:I'm really impressed, Ms. Andrews. Handling a huge exhibition like this must be very tiring.Andrews:Well, Lordly Tailor is celebrating their 200th anniversary this year. The works on display in the main exhibition hall are worthy of the finest museums.Maya:Woohoo! Did you hear that, Pearly!? The finest museums!Pearl:Yes, I did! That's really wonderful.Phoenix:So this basement warehouse is pretty well-protected, huh?Andrews:...Of course it is. After all, there are some priceless treasures here. The security guards are very highly trained as well...Phoenix:(That sounds good... So, what is with that face she's making...?)PresentAttorney's BadgeAndrews:I owe a great deal of thanks to that badge... ...It's the only reason that I'm still here today.Phoenix:Oh, come on now. That's not true...Maya:I think what Nick means to say is, \"It wasn't thanks to the badge, it was thanks to ME!\" Tell the truth, Nick! I know that's what you were thinking!Phoenix:N-No way, Maya!Treasure Exhibit PosterAndrews:I wanted to do something nice for you and your friends, Mr. Wright.Phoenix:So that's why you arranged this exhibit...?Andrews:I knew that Kurain Village was the hometown of your assistant, Maya. I thought it would be great to let the rest of the world know about it, too.Phoenix:Hmm... But that's not exactly thanking me, per se, is it?Maya:Maybe, but who'd wanna see an exhibit on the \"Treasures of Phoenix Wright\"?Phoenix:I guess I can't argue with that one.Phoenix Wright profileAndrews:You've certainly changed since I last saw you 7 months ago.Phoenix:R-Really?Andrews:Yes, you look like you're bulked up a little.Phoenix:(Well, now that she mentions it... I guess I have gotten a little stronger...)Maya:You're such a dork, Nick.Adrian Andrews profileAndrews:I've finally managed to put the events of 7 months ago behind me. I really love the work that I'm doing now... Honestly, I owe it all to you, Mr. Wright.Phoenix:Oh, it was nothing.Andrews:And to this little girl, too.Pearl:Th-Thank you for saying so!Maya:... ...I guess I wasn't much of a help, huh?Andrews:N-No, that's not true! You were ALL a big help to me!Phoenix:(She shouldn't take it so personally. It's not like she was exactly \"free\" to help...)Any other evidencePhoenix:Um... So what about this?Andrews:Sorry I can't be of more help, but I really don't have anything to say about that.Any other profileAndrews:I'm sorry, I don't know as many people as I used to. So there really isn't anything I can tell you about that person.After clearing all Talk options and examining Ami Fey statue:Andrews:Oh, look! It's already 8:00! Have you all eaten yet?Phoenix:Um, well actually...Andrews:I've already made a reservation at the restaurant on the 12th floor. Why don't we all dine together?Maya:Ooh! I like the sound of that! \"Dine\"... It sounds so fancy!Pearl:I'll have the \"Kid's Lunch\"!Maya:Ha ha ha. Pearly, it's dinner, not lunch. Why don't you go for it and really eat your fill with a \"Kid's Dinner\"?Pearl:OK! In that case, one \"Kid's Dinner\" for me!Andrews:Ha ha. Shall we head upstairs, then?Phoenix:After that pleasant evening, all that remained was to wait for the exhibition's opening. It was wonderful seeing Ms. Andrews looking so happy. None of us could have imagined... ...that the very next day, something terrible would happen...October 12, 10:09 AMWright & Co. Law OfficesMaya:N-Nick! This is terrible! ...What the--!? You're cleaning the toilet again!? I never knew you were such a toilet freak!Phoenix:Gimme a break, would you? My brain just hit the snooze button for the fifth time...Pearl:Um... I'm going to turn on the TV!Announcer:...We've got an update on the recent treasure heist! Based on clues found at the scene of the crime, authorities have announced... that they believe it was the work of the renowned phantom thief, Mask☆DeMasque!Phoenix:...M-Masque the Mask...?Announcer:According to a spokesperson, Lordly Tailor received a threat letter some days ago. This is the fifth heist by the phantom thief, who only targets rare treasures.Phoenix:L-Lordly Tailor...!?Maya:Well, Nick!? What are you going to do!? Don't you dare go back to scrubbing the toilet!Phoenix:Treasure...? Lordly Tailor...? You don't think...!?Maya:Yes! Now, get up, Nick! It was stolen! By Mask☆DeMasque! Our most valuable treasure... The Kurain Sacred Urn was STOLEN!!Phoenix:Whaaat!?ExamineWindowPhoenix:There is a giant building just outside the window. It's the Gatewater Hotel, a high-class, luxury hotel. The chain is getting so rich that they brought a whole chunk of the next town over... ...and started building a huge theme park. It's going to be called \"Gatewater Land\". ...And to think that two years ago, it was just a little hotel for businessmen.Movie posterPhoenix:An old movie poster. Apparently, this was the first movie that made Mia cry when she saw it, a long time ago. Maya watched it recently, and said she cried all night, too! ...Which, I guess, is why it's back up on the wall. I'll have to check it out one of these days.Charley the plantPhoenix:Charley. A quite decorative plant. When she was alive, Mia really loved it. She even went so far as to make it our mascot. It must be nice to be a plant, being able to just sit in the sun and photosynthesize...Maya:Hey! Nick! No time for daydreaming!Pearl:That's right, Mr. Nick! No time for daydreaming!Phoenix:(Oh man. Until I find that urn, they're not gonna give me a second of peace...)DeskPhoenix:It's my desk. I don't get to use it much, so the dust bunnies are starting to mount their assault. Maybe I should wipe them out with a few well-placed swipes of my cleaning rag...Maya:Hey! Nick! Are you trying to make me upset!?Pearl:Yeah, Mr. Nick! If you're worried about the cleaning, please leave it up to me!Phoenix:(At least Pearls is good at cleaning. *sigh* Guess I'd better go find that urn...)BookshelfPhoenix:Difficult-looking legal books stand in a formidable row. They mock me. ...Actually, I've neglected them for so long that they're covered in a layer of dust. I guess I should at least read them once in a while.Maya:Hey, Nick! This is no time for reading!Pearl:Yes, Mr. Nick! You can always read later!Phoenix:(I guess I won't be getting any peace and quiet to even read until I find that urn...)TalkSacred UrnPhoenix:Refresh my memory a little... What's this \"Sacred Urn\"...?Maya:It's only the most important treasure in Kurain Village! That's all! Look! It's right here on the poster! Don't you remember what's inside? The urn contains a very important soul! Namely, the soul of Mystic Ami Fey, the founder of the Kurain Channeling Technique! Right, Pearly?Pearl:Ah, yes! Th-That's right!Maya:... Hold up... I thought that urn had the name \"AMI\", written on it... Now it says \"I AM\"... Hm... Any idea how that happened, Pearly?Pearl:Huh!? Um, I... W-Well... Tee hee... There are some things left unsolved, wouldn't you say, Mr. Nick?Phoenix:(That's right! One year ago, there was a murder in Kurain Village, Maya's hometown. The Sacred Urn... It turned out to be an important clue in that case.)Sacred Urn added to the Court Record.Sacred Urn (subsequent times)Phoenix:Refresh my memory a little... What's this \"Sacred Urn\"...?Maya:It's only the most important treasure in Kurain Village! That's all! Look! It's right here on the poster! Don't you remember what's inside? The urn contains a very important soul! Namely, the soul of Mystic Ami Fey, the founder of the Kurain Channeling Technique! Right, Pearly?Pearl:Ah, yes! Th-That's right!Maya:... Hold up... I thought that urn had the name \"AMI\", written on it... Now it says \"I AM\"... Hm... Any idea how that happened, Pearly?Pearl:Huh!? Um, I... W-Well... Tee hee... There are some things left unsolved, wouldn't you say, Mr. Nick?Phoenix:(That's right! One year ago, there was a murder in Kurain Village, Maya's hometown. The Sacred Urn... It turned out to be an important clue in that case.)What to doPhoenix:OK, the toilet is shinier than the judge's head, so let's see what's next...Maya:What's wrong with you, Nick!?Phoenix:What do you mean?Maya:What do you mean what do I--Pearl:Mr. Nick! Your beloved Mystic Maya's treasure has been stolen! Doesn't that ever bother you!?Phoenix:But I thought the urn was the village's treasure, so I don't see how...Pearl:The village IS Mystic Maya! She's the future master of the Kurain School of Channeling! You know what I'm talking about, Mr. Nick! I won't let you say you don't!Phoenix:O-OK OK! I do! ...So what am I supposed to do about it?Pearl:Isn't it obvious? Go and find the bad guy who did this!Maya:Yeah! And get the Sacred Urn back!Phoenix:B-But... I'm not a detective... I'm a lawyer--Pearl:That has nothing to do with this! If you're a real gentlemen, you would find it for your beloved Mystic Maya!Phoenix:(Man, oh man... There's no winning against Pearls's fairy-tale image if love...) ...So what's the name of this bad guy again?Maya:Mask☆DeMasque, Nick! Make a note of it! Mask☆DeMasque!Last year's incident (appears after \"Sacred Urn\")Maya:Ah, it was terrible! I was arrested and everything!Phoenix:One year ago... The murder in Kurain Village. A man was killed during one of Maya's spirit channelings. And this urn wound up being the key piece of evidence that proved her innocence.Pearl:Um... Mr. Nick? Would you mind not telling Maya about that? You promised, remember? You said you wouldn't tell anyone I broke the urn...Phoenix:Oh yeah, that's right. (Now I remember. This urn used to say \"AMI\" on it... Until Pearls accidentally broke it into a million pieces. She tried to secretly fix it... Let's just say it didn't work out so well.)Pearl:Sorry... I'm not so good at arts and crafts... Spelling either...Phoenix:...Anyway, this is how her gluing project turned out. She put the pieces together wrong and now, instead of \"AMI\", it says, \"I AM\". ...I can't believe no one's noticed this until now, a whole year later.Pearl:I can't believe it myself...PresentMagatamaMaya:Oh, hey! It's my Magatama! So what do you think, Nick? Isn't it neat?Phoenix:It sure is. Being able to peek into people's minds is definitely a nice advantage.Maya:What? How do you do that!?Phoenix:What do you mean? You gave me this thing...Maya:Well, I knew Pearly put some sort of spiritual power into it... But I had no idea that it let you do something as cool as that!Phoenix:...Some future leader you are.Maya:Next time you use it, let me know, OK!? I want to see into people's minds, too!Treasure Exhibit Poster or Sacred UrnPhoenix:Is this thing really all that valuable? It looks kinda... well... junky, if you ask me.Maya:But it's got the soul of Mystic Ami, the founder of our channeling technique!Phoenix:So how much do you think you could get for it?Maya:What!? Sell the Sacred Urn!? You know, I never thought about that... Hey Pearly... Make a note of that. \"Ways to Save Money, Tip 109: Sell treasures whenever possible.\"Pearl:...Whenever possible, check!Phoenix:(Somehow, I think Maya's going to be searching for a buyer for a long time...)Ami Fey's Golden StatueMaya:You know, even I didn't know this statue existed until a little while ago.Phoenix:Didn't Adrian say it's from a Fey branch family's training hall or something?Maya:Yes, there are actually a lot of training halls scattered all over the country. Hidden away deep in desolate mountains...Phoenix:(Why does it always have to be \"desolate\" mountains...?)Phoenix Wright profileMaya:You're not very photogenic, are you?Phoenix:...!Pearl:I guess that's the end of that conversation!Mia Fey profileMaya:S-Sis... *sniffle* I really miss her...Pearl:Was Mystic Mia... Was she a really good lawyer?Maya:Yeah, she was awesome! She taught Nick everything he knows.Pearl:You should train hard and try to make her proud, Mr. Nick!Phoenix:Y-Yeah, I'll do my best.Pearl:You can join me on my next trip to a freezing waterfall!Phoenix:(I hate to break it to her, but I don't think being frozen to the bone helps in court...)Maya Fey profileMaya:I'm going to have to really buckle down and get serious.Phoenix:Well, you're the future Master of the Kurain Channeling Technique, after all.Maya:Yeah... That, and I have to play the part of big sister, too. For Pearly... and you, Nick!Phoenix:Wha-?? Do I look like I was born yesterday!?Pearl Fey profileMaya:Pearly is such a cutie, isn't she Nick?Phoenix:Yup.Maya:And she's smart too, just like yours truly! She's got quite a future ahead of her! I bet she could be President some day!Phoenix:(A President that can channel past Presidents... Hmm... That just might come in handy...)Adrian Andrews profileMaya:She certainly seems grateful to you, Nick.Phoenix:Well, she was in a pretty tight spot during that terrible ordeal. Actually, I'm grateful to her, too.Maya:Hmm... It sounds like you're not telling me something. I'm going to take a good look at the case file next chance I get...Any other evidencePhoenix:So, what do you think about this?Maya:Hmm... What about it, Pearly?Pearl:I'm not certain. What do you think, Mr. Nick?Phoenix:(Maybe three heads aren't better than one...)Any other profilePhoenix:So, what do you think about this person?Maya:Hmm... What do you think, Pearly?Pearl:I'm not certain. What do you think, Mr. Nick?Phoenix:(I think the saying I'm looking for is, \"never seen them before in my life\"...)October 12Lordly TailorMain Exhibition HallPearl:Right! Let's see if we can find some clues that might lead us to the bad guy!Phoenix:...But it doesn't look like anything has been disturbed.Maya:Yeah, it looks pretty much the same as it did last night.Pearl:Hmmm... Bad guy, huh.???:Hey! You can't poke around here, pal!Phoenix:Wait a minute... that voice. Oh no! Not him again!???:It's YOU!! And I'm the one who should be saying \"not again\"! Why is it that every time something bad happens, you always show up, pal?Phoenix:I should be asking you that. Aren't there any other detectives????:No, I should be asking YOU that. What are you doing hanging around here?Phoenix:Hey, I asked you first. Why are you here any--Maya:Alright, alright, we got it! Why don't you two kiss and make up already?Pearl:...Um, hello. It's been a long time, Mr. Scruffy Detective!???:Oh! It's you, little missy! ...Um, ahh...Gumshoe:Actually, my name is Gumshoe. \"Detective Dick Gumshoe\"! Now is a good chance for you to try to remember it right!Maya:And if it's too long for you, you can just call him \"Dick\".Pearl:Okay! It's good to see you again, Mr. Detective Dick!Gumshoe:Um... Yeah... Good to see you again, too, I guess.TalkWhat happenedPearl:Umm, Mr. Detective Dick! Can you tell us about what happened?Gumshoe:Oh, you're trying to remember my name! Atta girl! ...Um, just... It's \"Gumshoe\", OK? Anyway, the thief stole something called the \"Sacred Urn\"...Pearl:I know about that.Gumshoe:Oh. W-Well, the criminal's name is Mask☆DeMasque...Pearl:I know about that, too.Maya:Detective, can't you tell us something other than that?Gumshoe:W-Well... I guess I sorta kinda owe you guys... in a way... The crime occurred last night at around 1:30 in the morning.Phoenix:How exactly do you know that?Gumshoe:We got an emergency phone call from a guard at the scene of crime, pal. He said, \"The urn was just stolen!\"Maya:The scene of the crime... You mean here, right?Gumshoe:Wrong. That urn was being kept under careful guard in the basement warehouse.Phoenix:(Basement warehouse, huh...)Pearl:Umm, so who was guarding the basement warehouse...?Gumshoe:That guy! It's all his fault that the thief got away, pal! He solves one case and gets a swelled head, thinking that he's an Ace Detective!Maya:A-Ace Detective...?Mask☆DeMasquePhoenix:Hey, Detective Gumshoe, about this Mask☆DeMasque... Is he famous?Maya:Whaaaat!? You're joking, right Nick? Mask☆DeMasque is the hottest thing since sliced bread!Gumshoe:Sometimes he appears as a museum guard! Sometimes he appears as a big brown bear known to surprise unsuspecting victims. But underneath those disguises is... the true Mask☆DeMasque!Phoenix:...So he's some kind of master of disguise, huh.Gumshoe:And he only goes after the finest work of art, pal. Last night was his 5th heist! If Lordly Tailor had only cooperated, I could have caught him this time...Maya:What!? Then you knew he was planning on stealing the Sacred Urn!?Gumshoe:Of course I did! The guy always sends his calling card before he steals something.Phoenix:(Calling card, huh... They mentioned that on TV...)Ace Detective (appears after \"What happened\")Phoenix:So why do you call him an \"Ace Detective\" anyway?Gumshoe:That's what he calls himself, pal... I didn't make it up.Maya:So? What's he like?Gumshoe:Well, like I told you, Mask☆DeMasque has made five heists so far. On the 4th heist, Mr. Ace Detective managed to get the stolen treasure back.Pearl:Wow, that is impressive! All by himself!?Gumshoe:Yeah. I gotta admit it, pal. Maybe he really is as good as he says. Every time the thief sends one of his calling cards, we send our men on a stakeout... But none of us has ever gotten so much as a glimpse of the guy...Pearl:But Mr. Ace Detective was able to retrieve the stolen treasure from the thief...Gumshoe:Anyway, he's at the scene of crime right now, looking for clues.Phoenix:(So he's down in the basement warehouse, huh...?)Calling card (appears after \"Mask☆DeMasque\")Phoenix:So what's this \"calling card\"?Gumshoe:Here it is. But don't show it to anyone! It's top-secret, OK, pal?Phoenix:What's this mark on the front?Gumshoe:That's Mask☆DeMasque's signature emblem, pal. You could say it's his \"mark\". All of his calling cards have got it on them.Maya:They didn't mention THAT on the news flash.Gumshoe:We're withholding that detail from the public for \"operational reasons\"... The only way we can tell if a calling card is real or not is by this emblem.Calling Card added to the Court Record.Maya:...That makes sense. When you get famous, there are always imitators.Pearl:Mr. Nick, if you work a little harder, maybe you can have your own copycats someday!Phoenix:Um, uh, thanks... I guess.Calling card (subsequent times)Phoenix:So what's this \"calling card\"?Gumshoe:Here it is. But don't show it to anyone! It's top-secret, OK, pal?Phoenix:What's this mark on the front?Gumshoe:That's Mask☆DeMasque's signature emblem, pal. You could say it's his \"mark\". All of his calling cards have got it on them.Maya:They didn't mention THAT on the news flash.Gumshoe:We're withholding that detail from the public for \"operational reasons\"... The only way we can tell if a calling card is real or not is by this emblem.Maya:...That makes sense. When you get famous, there are always imitators.Pearl:Mr. Nick, if you work a little harder, maybe you can have your own copycats someday!Phoenix:Um, uh, thanks... I guess.PresentAttorney's BadgePhoenix:Here, take a look at my attorney's badge.Gumshoe:Are you still showing that cheap little thing off? A real man keeps his mouth shut... and carries a suave police badge, pal.Treasure Exhibit Poster or Sacred UrnGumshoe:...To be honest, pal, there's something that bugs me.Phoenix:What's that?Gumshoe:All the other items that were stolen by Mask☆DeMasque were ones even I had heard of. They were all world-famous treasures. The \"Tear of Emanon\" or the \"Crown of Bongora\"...Maya:The \"Sacred Urn of Kurain\" is famous, too! ...Right, Pearly!?Pearl:Of course! Everyone in Kurain Village knows about it!Phoenix:(Sounds like we've got an unpredictable thief on our hands...)DeMasque's Calling CardGumshoe:Remember! Don't tell anyone about that emblem. OK, pal?Phoenix:Does the thief ever send these to the police?Gumshoe:No, always to the victims. Up until now, the victims have always come to us looking for help though.Maya:...That's not what happened this time, you mean?Gumshoe:You got that right, pal. Listen up! If you guys ever get one of these calling cards... ...I want you to come to us right away! Got me?Phoenix:...Yeah, sure.Phoenix Wright profileGumshoe:Pretty goofy-looking face, if you ask me.Phoenix:Hey...!Maya:What are you doing carrying that around with you anyway? It's not like we ever need it.Phoenix:(She has got a point...)Mia Fey profileGumshoe:Oh! That's Ms. Mia Fey! She was a truly beautiful person, pal.Maya:Huh? You knew her? You knew my sis?Gumshoe:Sure. Everybody in the police force knew her. ...We all lost a great friend that day...Pearl:Mr. Scruffy Detective...Gumshoe:I-I just got something in my eye...! ...I'm not crying!Mask☆DeMasque profileGumshoe:I've been on this guy's tail ever since his first heist, pal!Maya:Yeah, you're doing a really great job. I can see.Gumshoe:...Oof! Listen pal, if you wanna jump high, first you gotta crouch down, right? I'm a little frustrated now, but it'll make it that much sweeter when I catch him! ...Anyway, that's what I keep telling myself every day.Pearl:Well good luck, Mr. Detective Dick! I believe in you!Gumshoe:Aww, ain't you sweet. You're the only one that's ever said that!Phoenix:(...The only one? That's kinda sad if you think about it.)Any other evidencePhoenix:Umm, what about this...?Gumshoe:...Sorry, pal. I didn't get much sleep last night and my brain's not really working right.Maya:Somehow I don't think sleep would really fix the problem.Phoenix:Hey, keep it down. He might have really good hearing for all you know, and might get mad if he heard.Gumshoe:Ummm... I can hear everything you are saying, pal.Any other profilePhoenix:Umm, what about this person...?Gumshoe:...Sorry, pal. I didn't get much sleep last night and my brain's not really working right.Maya:Somehow I don't think sleep would really fix the problem.Phoenix:Hey, keep it down. He might have really good hearing for all you know, and might get mad if he heard.Gumshoe:Ummm... I can hear everything you are saying, pal.After clearing \"What happened\" Talk option in Lordly Tailor - Main Exhibition Hall:October 12Lordly TailorBasement WarehouseMaya:No matter how many times we come here, this place always give me the chills.Phoenix:That's probably because it's air-conditioned... To protect the art pieces, you know.???:...Welcome! To my private little \"Banquet of Chaos\".Phoenix:(Huh? What the heck does THAT mean...?)???:I'm afraid I have very little to offer, but please... make yourself at home.Maya:Err, umm... Who are you anyway...????:SHHH! SILENCE! ... Hee hee hee hee hee hee... Now I see! It's all becoming clear!Maya:Wh-What do you see????:...Zvarri! The truth has once again been elegantly revealed to me! A lawyer, and... a spirit medium. Neither very advanced at their trade! ...Am I wrong?Maya:Yikes! Th-That's scary! H-How did you know that!????:\"How\" you say? The universal skeptic would say that how is nothing but a question of why. I am traveler of both time and space, and a swimmer of dreams.Maya:What is he talking about? I can't make heads or tails of it...???:Without further ado, let me fulfill what should be the first duty of any gentleman...Atmey:...and introduce myself. The name is Atmey... Luke Atmey! ...Ace Detective.Phoenix:Oh... Umm... Hi.Maya:Don't let him intimidate you, Nick! Stand up and show him what you're made of!Phoenix:Err, umm... The name's Wright. Phoenix Wright... ...Ace Attorney.Maya:I'm Maya Fey! Ace Spirit Medium!Pearl:And I'm, ummm... Pearl Fey. I'm Mystic Maya's cousin and umm... spirit medium Ace Apprentice.Atmey:Excellent! Well then, shall we begin our little game?Phoenix:(\"Game\"? Why does the phrase \"one short of a baker's dozen\" come to mind with this guy?)ExamineAnywhereAtmey:Tsk! Sir Lawyer! Please refrain from such crude behavior.Phoenix:Huh? Wh-What do you mean?Atmey:This criminal is an artist! The crime scene is the canvas upon which he paints! Only I, Ace Detective Atmey, have an eye which is educated enough to read the signs!Maya:...Could you translate that for me, Nick?Phoenix:I think he pretty much said, \"Don't touch anything amateurs!\"Atmey:If there's something you wish to know about, you have but to ask Atmey! ...I know everything there is to know about my rival, Mask☆DeMasque.Phoenix:(What do I do now...?)Maya:Does he have any top-secret information? Stuff that only a real crime buff would know?Phoenix:(I'll think about what to ask while I listen to what Mr. Ace Detective has to say...)TalkAce DetectivePhoenix:Umm... So are you really as famous as you say?Atmey:Of course! For a lawyer, you have a rather shocking lack of knowledge about the world. I had no idea anyone was left in this city that had not heard of me! Look at me! I am Mask☆DeMasque's arch-enemy, the Ace Detective Luke Atmey! At this moment, there are two mighty figures which loom large over this grand city! One embodies the nefarious forces of darkness. The other the angelic cherubs of light!Maya:...Boy, now I'm really lost. What is he saying, Nick?Atmey:I have been personally on the heels of this villain since his first crime. After learning this criminal's patterns, I thwarted his very latest loathsome larceny! I even returned the target of his tyranny, the \"Portrait of Mejeena\" to the crime scene! And I did it all by myself! I took it back from Mask☆DeMasque... With my brawny mind and my brilliant muscles!Maya:Yeah! They mentioned it on the news, in the \"Great People Around Town\" segment. (Changed from [Yeah! They mentioned it on the news, in the 'Great People of the Town' segment.] in the original release) They said that the museum gave you an incredible jewel as a reward!Atmey:...Well, compared to the treasure that I retrieved for them, it's not much.Phoenix:(So... in the end, the only thing that makes you great is your own self-praise...)Mask☆DeMasqueMaya:Oh! Tell us what you know about Mask☆DeMasque! ...And keep it simple, please!Atmey:Like about how I have devoted my life to thwarting his dastardly deeds? Last night, here in the bowels of this store, we were locked in a most glorious battle.Phoenix:I see... ...Huh!? Hang on a second! You were here last night? Here? In Lordly Tailor!?Atmey:Naturally! Wherever DeMasque goes, you will find Atmey laying his elegant traps.Phoenix:(Elegant traps? More like DeMasque out-eleganced you and made a beautiful getaway.)Atmey:But this time, I allowed him to escape with the illusion of victory.Phoenix:(I wonder if I should ask him about what happened last night in more detail...)The night of the crime (appears after \"Mask☆DeMasque\")Phoenix:Umm... Can you tell us exactly what happened here last night?Atmey:But of course. After all, I always say there should be no secrets between \"aces\".Phoenix:(Flattery will get you nowhere, Pinocchio...)Atmey:I first received the request for my services 20 days ago. And it was 10 days ago that we received Mask☆DeMasque's calling card...Maya:Huh? You were hired BEFORE the calling card even arrived?Atmey:Yes. You see, the person who hired me is quite rigorous and thorough.Phoenix:(That's Adrian for you...)Atmey:A mere 10 days after hiring me, her worst premonitions were realized!Maya:A calling card arrived, right?Atmey:Yes! So, Ace Detective that I am, I set a trap for the thief right in the warehouse. And waited for him... alone.Maya:Alone? ...But why? Why didn't you go to the police for help?Atmey:Ridiculous! Why would I seek help from such a singularly useless group of nincompoops?Phoenix:(You've got a lot of nerve. After all, it was you that let DeMasque get away.)Atmey:I always operate alone and concealed. Out of the sight of others.Pearl:...? \"Corn Sealed\"...?Atmey:Precisely! Even the guards on duty here were unaware of my presence. \"To fool your enemies, first you must fool your friends.\" It's my own original proverb!Maya:Anyway, back to what happened last night...Atmey:As I was saying, I hid here in the warehouse and waited for the thief to arrive. But I swear to you... Not a solitary soul came through that entrance! Nevertheless... The Sacred Urn disappeared!Phoenix:B-But that's impossible! How could it just disappear!?Atmey:\"How?\" you ask? Don't be ridiculous, Sir Lawyer. If I knew the answer to that question, I wouldn't be here!Phoenix:(For someone who seriously messed up his own stakeout, he's rather full of himself.)Pearl:So you're saying that even though on [sic] one came through those doors last night... ...our precious urn still somehow vanished from under your nose?Phoenix:(Th-That's just not possible!)PresentTreasure Exhibit Poster or Sacred UrnAtmey:Do not fear, young lady. I promise I shall retrieve your urn!Maya:Thank you, Detective Atmey! I'm counting on you!Atmey:The final round between Detective Luke Atmey and Mask☆DeMasque is set to begin.Phoenix:Still, there's something funny about this guy...Maya:Yeah, but don't forget he managed to retrieve the treasure from the last heist.Atmey:Yes, I even have a video that details my role in the whole affair. I recorded it directly from the news on TV. Can I interest you in a copy?Phoenix:...No thanks.DeMasque's Calling CardPhoenix:Mask☆DeMasque's calling card... It's got his emblem printed on it, right?Atmey:...Quite impressive! But I would expect nothing less from my arch-rival! I'm surprised to see you in possession of such a top-secret piece of information.Maya:Well, we've got an Ace Lawyer, an Ace Spirit Medium and an Ace Cousin-Apprentice here.Atmey:Yes, indeed... I think I could learn to like you, my fellow ace professionals!Phoenix:(I don't know if I really want this guy to like us... ever.)Phoenix Wright profilePhoenix:That's pretty amazing the way you were able to tell what I do for a living.Atmey:Oh, it's elementary, my dear Wright, elementary. If you're really interested, the first clue was the hair. ...It points backward. It shows you're prepared to take on an attack. Such as from a criminal, for example. From your clothes, I knew you weren't a policeman, so I deduced you were a lawyer. After a combination of cold logic and intuition... Zvarri! Only the truth remains.Phoenix:(Wow, impressive...)Maya:Or maybe he just took a look at the attorney's badge on your lapel, genius.Mia Fey profileAtmey:This woman... She is a true beauty.Phoenix:...You don't say.Atmey:I would be honored if you would introduce her to me.Phoenix:...Atmey:I assure you, Sir Lawyer, that my interest is strictly professional!Maya:Eww, this guy's even creepier than I thought.Atmey:I assure you, my dear, all Ace Detectives are perfect gentlemen!Maya Fey profileMaya:Umm... So how did you know I was a spirit medium?Atmey:Oh, that was child's play. First, your hair. It's not of the type one sees every day. Both rare and enchanting... Almost... otherworldly. I thought it likely that you were either a fortune teller or a spirit medium. But I didn't quite detect the wisdom one usually sees in a fortune teller... And so... Zvarri! That left only one possibility.Maya:Well, they also have a bio about me on the Treasure Exhibit Poster...Pearl Fey profileAtmey:As for this child... Zvarri! Elementary school student.Pearl:Wow! That's right!Atmey:I can also see that you will be a middle-school student within the next few years!Pearl:Th-That's incredible!Phoenix:(No doubt about it. This guy is good!)Atmey:Now you can see how I have earned my reputation as an Ace Detective.Adrian Andrews profileAtmey:Ah, the charming young lady responsible for security, Ms. Adrian Andrews.Maya:Huh? You know her?Atmey:Yes, well I should... She was the person who hired me for this job. A very intelligent woman. After all, she hired Detective Luke Atmey, did she not?Phoenix:(...I'm not entirely convinced that was an intelligent move on her part.)Dick Gumshoe profileAtmey:...Oh, him. Yes, well I saw him earlier. That wretched detective has let the thief slip through his fingers every single time.Maya:Wretched, huh...Atmey:...Now that I think about it, I wonder if they aren't working together.Phoenix:Huh...?Atmey:If you ask me, Luke Atmey, I believe the two of them are \"co-conspirators\".Maya:If Detective Gumshoe heard that, he'd probably cry.Phoenix:He is a surprisingly sensitive guy...Mask☆DeMasque profileAtmey:This will surely be Mask☆DeMasque's final heist! Last time I came close and managed to retrieve the stolen treasure! Mark my words, this criminal of humanity will be found guilty in due time! And then I, Luke Atmey, Ace Detective, will dance with joy!Phoenix:I have no clue what you're blabbering about... But I guess I'll find out soon.Luke Atmey profileAtmey:This person is... Zvarri! A great Ace Detective! Am I correct?Phoenix:Um, but I was the one asking you...Atmey:This photo simply isn't enough information. I'm afraid I can't be absolutely certain... But the intelligence in those eyes indicates a man of deep wisdom and insight.Maya:Stop messing around, Nick, and just ask him already!Phoenix:B-But this guy is scary.Anything elseAtmey:...I'm sorry I can't be more helpful. But I have no interest save that of finding evidence against my arch-rival!Maya:Nah, it's OK. Nick is just a bit of a piddling evidence hog. That's his defense style.Atmey:A \"piddling evidence hog\", you say? In that case, I'd simply be wasting my breath!Maya:Yeah, I guess you're right.Phoenix:Thanks, Maya. Why couldn't you have said I was a \"rival\", and not a \"piddling evidence hog\"?After clearing all Talk options and presenting DeMasque's Calling Card:Atmey:... ...Well, Sir Lawyer. I've been told that you too are pursuing the mysterious thief.Phoenix:...Well, I'm not sure would say that exact--Maya:That's right! We're going to find the Sacred Urn no matter what we have to do!Atmey:...Excellent. I will trust you. I permit you to take a look around while I investigate elsewhere. If, perchance, you should discover something of value, return then to my office... My office of Earthly Delights, the \"Atmey Detective Agency\"! (Changed from [To my office of Earthly Delights, the 'Atmey Detective Agency'!] in the original release)Maya:Of-Office of Earthly D-Delights...?Atmey:Well then Sir Lawyer, if you'll excuse me, I have much to do!Phoenix:W-Wait a minute...!Pearl:He's gone.Phoenix:I don't like the idea of doing this guy's work for him.Maya:Come on, Nick. Don't worry about it. It's no big deal. Let's hurry up and investigate before he changes his mind!Pearl:I wanna go to his office, too! Take me with you, OK?ExamineSecurity cameraPhoenix:It's a security camera. It's trained on the big door to the storeroom. It's set up to take a photo of anyone that goes in or out.Pearl:A \"se-kure-ity\" camera...?Maya:Yeah, go stand in front of that door and it'll snap your photo too, Pearly.Pearl:Umm... Mystic Maya... Do you think I should smile?Maya:Nah. It's for criminals, so I think you should make a really scary face!Pearl:L-Like this...?ComputerMaya:Hey, Pearly, do you know what this is? It's a computer!Pearl:A \"kom-pu-ter\"...? Oh! I've heard of those! It has such a cute name!Phoenix:It looks like this computer is for storing the data from the security camera. When someone comes in or out of the warehouse, the camera takes a photo of them.Pearl:It's probably the \"trap\" that the detective set up.Maya:Let's see if we can find last night's data on this thing. We might even find a photo of Mask☆DeMasque!Phoenix:Hmm, let see here... (Man, I really stink at working these things...) ...Pearl:What's wrong, Mr. Nick? You're sweating an awful lot.Phoenix:...I don't know how to pull up the photos...Maya:I had no idea you were so pathetic with high-tech stuff, Nick!Phoenix:...Yeah, well I managed to print out the camera data anyway.Maya:I guess you have to learn to crawl before you can walk, right, Nick?Phoenix:Yeah, sure... Anyway, it looks like the camera only went off once last night.Camera Data added to the Court Record.Computer (subsequent times)Maya:Hey, Pearly, do you know what this is? It's a computer!Pearl:A \"kom-pu-ter\"...? Oh! I've heard of those! It has such a cute name!Phoenix:It looks like this computer is for storing the data from the security camera. When someone comes in or out of the warehouse, the camera takes a photo of them.Pearl:It's probably the \"trap\" that the detective set up.Wooden boxPhoenix:That pathetic-looking wooden box...Maya:Ahh!! That's the box that had the Sacred Urn on it!Phoenix:Don't touch it! There may be clues to the thief's identity on there!Maya:Grr... I worked so hard to make that box!Phoenix:Huh!? You MADE that poor excuse for a box, Maya?Maya:What's that supposed to mean!?Pearl:That urn has always been on its stand in the Winding Way of Fey Manor. So there was no box suitable for it, Mr. Nick.Maya:And I-I was so proud of it... *sniffle sniffle*Phoenix:(Poor Maya. Maybe it'd have been better if Mask☆DeMasque had taken the box, too...)ShichishitoMaya:Wow, this is awesome. What did Ms. Andrews say it was called again?Phoenix:\"Shichishito\". It's literally \"7 Branch Sword\" in Japanese. Or so says Ms. Andrews. Whoa... It's pretty heavy.Maya:\"One hit, seven times the fun!\" Pretty catchy, huh? I bet it'd sell like hotcakes!Pearl:Um, there's something about it that bothers me...Maya:Wow! You're really firing on all cylinders today, Pearly!Pearl:This sword... Wasn't Mystic Ami holding it last night?Maya:Ah...Pearl:And another thing... The sword wasn't bent last night like it is now.Phoenix:Y-You're right...Maya:Awesome, Pearly! I wouldn't expect any less from my little Ace Apprentice!Phoenix:(The sword is bent, so that must mean... Last night, someone \"used it\" somehow...)Maya:Aha. I just thought of something! Maybe Detective Atmey smashed Mask☆DeMasque with it. Like this!Phoenix:YEOOOOOUCCCH!! WHAT THE HECK!Maya:What do you think, Pearly?Pearl:I think it's even more bent than it was before.Phoenix:(Oh man... My head... MY HAIR!)Shichishito added to the Court Record.Shichishito (subsequent times)Maya:Wow, this is awesome. What did Ms. Andrews say it was called again?Phoenix:\"Shichishito\". It's literally \"7 Branch Sword\" in Japanese. Or so says Ms. Andrews. Whoa... It's pretty heavy.Maya:\"One hit, seven times the fun!\" Pretty catchy, huh? I bet it'd sell like hotcakes!Pearl:Um, there's something about it that bothers me...Maya:Wow! You're really firing on all cylinders today, Pearly!Pearl:This sword... Wasn't Mystic Ami holding it last night?Maya:Ah...Pearl:And another thing... The sword wasn't bent last night like it is now.Phoenix:Y-You're right...Maya:Awesome, Pearly! I wouldn't expect any less from my little Ace Apprentice!Phoenix:(The sword is bent, so that must mean... Last night, someone \"used it\" somehow...)Maya:Aha. I just thought of something! Maybe Detective Atmey smashed Mask☆DeMasque with it. Like this!Phoenix:YEOOOOOUCCCH!! WHAT THE HECK!Maya:What do you think, Pearly?Pearl:I think it's even more bent than it was before.Phoenix:(Oh man... My head... MY HAIR!)Door to the storeroomPearl:Mr. Nick, what's that big door over there?Phoenix:It looks like it's the door to the actual storeroom. I can see lots of big boxes and stuff back there.Maya:I guess that's where they were keeping the Sacred Urn.Phoenix:Remember, Maya. Ms. Andrews said we're not allowed in there.Spilled paintMaya:Look what you did, Nick! You spilled paint over here!Phoenix:I didn't do that!Maya:Well it wasn't here last night. I would have noticed a color this outrageous.Pearl:But this paint has already dried up.Maya:Well then, you should have cleaned it up before it dried, Nick!Phoenix:Paint doesn't dry that fast! Besides, I told you it wasn't me! (It looks like it's been several days since it was spilt.) Hey, look at this!Pearl:What is it?Phoenix:There's some kind of shape left in the bottom left side of this stain.Maya:Huh? ...You're right. I wonder what it could be...?Ami Fey statueMaya:This statue of Mystic Ami is sooo cool. I want a gold statue of myself! We could put it in the office!Phoenix:Hey! It's WRIGHT & Co.! How about a gold statue of ME?Pearl:Um, Mr. Nick? I'm sorry, but I noticed something strange...Phoenix:Huh? What is it, Pearls?Pearl:The statue of Mystic Ami... Was this where it was last night?Maya:Ah...Pearl:I'm pretty sure it was closer to the door...Phoenix:Y-Yeah, I think you're right.Maya:Great job, Pearly! I wouldn't expect anything less from my Ace Cousin!Phoenix:(So the statue was moved on the night of the crime...)Ami Fey's Golden Statue updated in the Court Record.Ami Fey statue (subsequent times)Maya:This statue of Mystic Ami is sooo cool. I want a gold statue of myself! We could put it in the office!Phoenix:Hey! It's WRIGHT & Co.! How about a gold statue of ME?Pearl:Um, Mr. Nick? I'm sorry, but I noticed something strange...Phoenix:Huh? What is it, Pearls?Pearl:The statue of Mystic Ami... Was this where it was last night?Maya:Ah...Pearl:I'm pretty sure it was closer to the door...Phoenix:Y-Yeah, I think you're right.Maya:Great job, Pearly! I wouldn't expect anything less from my Ace Cousin!Phoenix:(So the statue was moved on the night of the crime...)Main Exhibition Hall (after clearing \"Sacred Urn\" and \"Last year's incident\" Talk options in Wright & Co. Law Offices, and examining computer, Shichishito, and Ami Fey statue in Lordly Tailor - Basement Warehouse)Phone:...Maya:Hey, Nick! Your cell phone's ringing! (Changed from [Oh, Nick! Your cell phone's ringing!] in the original release)Phone:...*beep*...Phoenix:Hello, Phoenix Wright here.Gumshoe:Oho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho! It's me. Gumshoe.Phoenix:Gumshoe! What is it? What's so funny!?Gumshoe:I'll tell you what's funny, pal! I finally beat him! I beat Mr. Ace Detective! Finally! This underdog is the alpha dog today! That stuck-up detective's met his match! Yup! I finally caught him! Lock, stock and barrel! There's no escape for him!Maya:You \"caught him\"? ...Are you saying...? You... You captured Mask☆DeMasque!?Gumshoe:Bingoooo! Well... Actually, he surrendered... ...But I still got him!Phoenix:(Mask☆DeMasque surrendered?)Pearl:That's great! So when can we come and pick up the Sacred Urn?Gumshoe:Um, ahh, well ya see... I was gonna tell you...Phoenix:What...? Something wrong?Gumshoe:Do you think you can swing by the detention center sometime?Phoenix:The detention center...? (Changed from [Detention center...?] in the original release)Gumshoe:He wants to talk to you... Mask☆DeMasque, that is.Maya:Whaaaat!? He wants to talk to Nick?Gumshoe:I'll be waiting for you, pal. So get over here soon.Phone:...*beep*...Phoenix:(The detention center, huh?)October 12Atmey Detective AgencyPhoenix:This is a detective agency? Looks like more like the set of some B-grade horror movie.Maya:H-Hello? Is anyone here...?...Phoenix:It looks like nobody's home.Maya:Hmph. What a waste of time. Hey! I know! Let's take that framed picture back with us as a memento!Phoenix:Don't you dare, Maya! (Guess we'll have to try back later...)ExamineGramophoneMaya:Hey, Nick. What's this thing here?Phoenix:It's called a \"gramophone\". In the old days, people used them to listen to music.Maya:You can't be serious! I think it's probably for purifying the air or something. I'll bet you 50 cents! Come on, what do you say?Phoenix:Forget it. You never pay up when you lose.Luke Atmey paintingPhoenix:What a creepy painting. It's like he's looking right at me.Maya:Maybe we should put up a big portrait of you in the office, Nick! I can even paint it for you. Maybe you can pose while cleaning the toilet?Phoenix:...I think I'd prefer something a bit more dignified.FireplaceMaya:Whoa! It's a huge hearth!Phoenix:That's a fireplace.Maya:So? What's the difference? You need to stop judging things based on narrow-minded cultural assumptions, Nick!Phoenix:R-Right... sorry.BookshelfPhoenix:That's one impressive bookshelf filled with some very impressive books!Maya:\"My Life as an Ace Detective: Unabridged Edition\" by Luke Atmey, Ace Detective.Phoenix:Hey, he's even got one of those ships in a bottle thingies.Maya:Ah! Would you look at that! There's a little Luke Atmey doll at the helm! How cute!Phoenix:There's a microscope here, too. I wonder if he was researching something. The glass slides have different names on them.Maya:This one says... \"Atmey Virus\", ...Hmm. This guy is just dying to make a name for himself, huh.Phoenix:It's getting kind of irritating, actually.DeskPhoenix:This desk is literally covered with all sorts of chemistry equipment.Maya:Oh, I just love chemistry! Say, Nick, I bet you didn't know this, but... Water is made up of carbon and hydrogen!Phoenix:No, no, no. Not carbon! Oxygen! Oxygen and hydrogen!Maya:Oh? Well, there are always alternative theories, I guess.Phoenix:(If by \"alternative theories\" you mean the ones you make up inside that head of yours.)October 12Detention CenterVisitor's RoomGumshoe:Hey, pal! Welcome to the detention center!Phoenix:You're sure in a happy mood, aren't you?Gumshoe:Yup. After all, we got Mask☆DeMasq--Maya:Right, but... Um... So where's the Sacred Urn?Gumshoe:Oh, Sorry about that, pal... I guess I didn't really think about it before... But you're the \"victim\" in this case.Maya:Huh?Gumshoe:Well, I guess I should let you guys hear the story straight from the horse's mouth.Maya:You know, he's right, Nick!Phoenix:He is?Maya:If you think about it reeeeal hard, we are the victims!Phoenix:Well... I guess so... In a way...???:Umm...Maya:I'm so used to thinking of the victim as a dead person 'cause we're always on murder cases.???:Ex-Excuse me...Maya:But anyway! I have to get the Sacred Urn back!???:Pleeeeease! Don't just ignore meeeeee! ...Err.Maya:...Um, who are you????:...I, err, umm. I-I-I... I-I'm Ma-Ma-Ma... Mask☆DeMasque...? ...O-OK?Maya:... Hey, Nick... Doesn't he look kind of... well, gangly?Ron:I'm Ron DeLite... Th-The famous Mask☆DeMasque.Phoenix:(...I don't think this guy could punch his way out of a wet paper bag.)ExamineSecurity cameraPhoenix:Smile, you're on candid camera.Security guardPhoenix:This guard monitors the visitor's room. He looks nervous being this close to an alleged thief.TalkMask☆DeMasquePhoenix:So, you're the Masque DeMask guy?Ron:Y-Yes! You bet! ... No... Err, that's wrong. You see... it's complicated. Sort of yes, and sort of no. If you know what I meanPearl:Hm? What's wrong?Ron:Well when I say \"wrong\", what I really mean to say is that it's \"not right\", per se. You see it's not spelled \"Masque DeMask\", it's actually \"Mask☆DeMasque\"...Maya:...What's with this guy?Phoenix:(Well, he's a timid little weakling, we know that much.)Ron:D-Don't do that... Don't look at me like that! I don't need your pityyyyy!Phoenix:(And a major crybaby, too.) So... Why did you give yourself up?Ron:Well, you see... It's because... Well...Maya:I know why! It's because you stole such a priceless treasure! And now you're overwhelmed with guilt. Am I right!?Phoenix:(\"Priceless treasure\"? That broken old urn...?)Ron:Umm... I have a little favor to ask...Phoenix:Y-Yes? What is it?Ron:Could you... go and talk to Dessie?Maya:...D-Dessie?Sacred UrnMaya:Look, we really want our urn back, so where is it?Ron:I'm sorry! I'll give it back! I really will! ...Err, maybe not. No, I can't... I can't make promises I can't keep... I'll just end up hurting peoplePearl:Um, Mr. Nick...? I couldn't hear what he just said... Especially the last part.Phoenix:Um, Mr. DeMasque? Do you think you could speak up a little?Ron:Y-Y-Y-Yes, sir! I will... I promise! ...Err, maybe not. You see, I'm already speaking in my normal voice, so I really can't do anythingMaya:Mr. DeMasque? About the urn...Ron:Oh! Yes! The urn! Right away! ...Err, actually no. I wouldn't mind telling you, but actually I'm afraid you wouldn't believe me anywayMaya:Enough already! Just tell it to us straight!Ron:Please... Please don't yell at meeee! *huff huff huff* I... I... I'm sorry... That urn... I... I-I lost it!Maya:Wh-Wha-What!?Lost it? (appears after \"Sacred Urn\")Phoenix:What did you just say? Did you say you \"lost it\"?Ron:Yes... Er, no. Umm... Maybe so. I mean, yes, I lost it!Maya:Wh-What do you mean...?Ron:Well, you know... I lost it, like I said... These things just happen... You're on the train and you get distracted and you forgot your bag. You know...Maya:What!? You forgot our Sacred Urn on a train!?Phoenix:Wait a minute! You went on the train dressed like that!?Ron:N-No! I... I... I was just speaking hypothetically, that's all. A-Anyway... I'm sooooorry! I just lost it somewhere! I don't know where!Phoenix:... (This guy's story is more surreal than a Dali painting.)Maya:Are you really sure this creep is Mask☆DeMasque?Phoenix:Maya, don't call him a \"creep\". (Although I do have to admit, I understand your doubts about this guy...)Dessie (appears after \"Mask☆DeMasque\")Phoenix:So who is this Dessie person?Ron:...! Pleeeease don't talk about my wife like that!Maya:...I-I guess she must be his wife...Ron:*huff huff huff* I'm sorry! The truth is... It was my wife that told me to have you all come here... Um... Do you think you could go and visit her at my hideout?Phoenix:H... Hideout?Pearl:Mr. Nick! What does he mean by \"hideout\"...?Ron:Oh, sorry. Naturally, I meant to say my \"secret base\".Phoenix:S-Secret base?Ron:Well, my apartment actually. Palazzo Pelpepe, 3rd floor...Maya:Let's go have a look, Nick! To Mask☆DeMasque's hideout!Phoenix:(Something tells me she just likes the sound of the word \"hideout\".)PresentTreasure Exhibit Poster or Sacred UrnRon:I'm really sorry I caused so much trouble.Maya:If you're so sorry, then you shouldn't have stolen it in the first place!Ron:B-But... The only thing I did wrong was lose it! ...Err, that's not right. I was wrong either way. I'm sure the owners of the other treasures fell the sameMaya:...He sure seems sorry.Pearl:Who would have imagined that such a famous thief would have such a pure heart...DeMasque's Calling CardRon:Oh! That's Mask☆DeMasque's calling card! Pretty nice-looking, huh!?Maya:He looks so happy...Ron:I'm not very good at writing, you see... So I bought a book called \"How to Write Business Letters\" and studied hard!Phoenix:(Well, I guess you could call thievery a type of business...)Mask☆DeMasque profileRon:Ever since I was a little boy, I've always been interested in mysterious masked men!Phoenix:So that's what you wanted to be when you grew up?Ron:Yes! ...Err, no. Sort of, but not exactly... I never imagined I'd feel as bad as I do now about the treasures being stolen...Phoenix:(...People sure can be complicated, can't they.)Luke Atmey profileRon:H-Him...!Phoenix:Do you know him? He claims to be your arch-enemy and rival.Ron:Th-That person... He... He's not my arch-enemy OR my rival! ...Well, actually, no. Now that I think about it, the terms arch-enemy and rival are the same thingMaya:They ARE rivals! Only people who have it out for each other would disagree like this!Anything elsePhoenix:What do you think about this?Ron:Hmm... I don't really think I can help you with that. Err, no, that's not it... Well... The thing is... I don't really know if I can say one way or the otherMaya:I didn't really catch that.Phoenix:Don't worry, you didn't miss anything.After clearing \"Dessie\" Talk option in Detention Center - Visitor's Room:October 12Mask☆DeMasque's HideoutPhoenix:... Wow, check this place out!Maya:No doubt about it, this is Mask☆DeMasque's hideout alright.???:Who is it? Is that you, Ronnie? Huh? Who are you people?Phoenix:Err, umm... Are you \"Dessie\" DeLite? (Changed from [Err, umm... Are you Desirée DeLite?] in the original release)Desirée:That's right. I'm Desirée. ... Ah! Oh! You must be the lawyer... and the victim!Phoenix:Y-Yeah, that's us. Your husband told us to stop by and speak with you. (Changed from [Y-Yeah, that's us. Your husband told us that you wanted us to stop by.] in the original release)Maya:I'm Maya Fey, and this is Phoenix Wright, attorney at law.Desirée:\"Nicky boy\" and Maya, huh? I can't tell you how grateful I am that you decided to help my Ronnie.Maya:Well, um... Aha ha... You're welcome.Phoenix:(Did she really call me \"Nicky boy\"?)ExamineHot air balloonMaya:Oh, that's so cute! It's called a hot air balloon, you know!Phoenix:...Wow! There's no fooling you!Maya:I want to make my own balloon now! I'll even let you ride in it, Nick!Phoenix:(That emblem on the balloon is supposed to be top-secret. That's proof enough that Ron DeLite really is Mask☆DeMasque. I'd better not tell Maya. She gets kinda... scary when it comes to \"celebrities\"...)Piled stuff on leftPhoenix:There's a whole bunch of stuff piled up over here.Maya:Duck and cover! It-It's a missile! Did you know there's d-dynamite in missiles!?Phoenix:But they're not heavy enough to be real... Oh wait. They're just really well-made toys.Maya:What are these rolls of paper stuck in the trash can? \"Theft of the Mazarin Stone: The Great Albatross Strategy\" \"Theft of the Immortal Goddess Statue: The Great Knucklebomber Strategy\"Phoenix:... (Did the police even investigate this place...?)Green envelopeMaya:Hey, Nick! Look on top of the chair!Phoenix:Looks like an envelope... And a letter.Maya:Well, don't just stand there! Come on, let's read it!Phoenix:Maya, you know we shouldn't do that!Maya:What are you talking about? That letter could be an important clue!Phoenix:No way. You can't just go reading a private letter because you feel like it.Maya:...Hmph! It's not just because I \"feel like it\". It really could be important!Phoenix:(If I was sure it was a clue, I guess I wouldn't mind...)Masks and beardPhoenix:It's a bunch of cheap costume pieces arranged inside a nice frame.Maya:L-Look, Nick! It's a fake beard!Phoenix:There's also a mask made out of cardboard...Maya:Hey, Nick! Try on this fake beard! Come on! Try it on!Phoenix:H-Hey! Cut it out...Maya:Now put on the mask! ... Aha ha ha ha ha ha! It's Phoenix☆DeMasque! Let's borrow it for a while.Phoenix:(No way! I'm not stealing from a thief! I have enough bad karma as is!)Helmet and transceiverPhoenix:(Hmmm... This thing looks vaguely familiar.)Maya:Oh, I know! It's a fishbowl! Well, an upside-down one, anyway...Phoenix:I think it's a helmet. ...An alien helmet.Maya:And that looks like a tape recorder or something next to it.Phoenix:I think it's a transceiver. ...An alien transceiver.Maya:Nick... Do you think maybe you could act like a grown-up for a little bit?Phoenix:(Getting lectured by Maya to be more of an adult. That's a new low...)Mask☆DeMasque modelMaya:It's Mask☆DeMasque!Phoenix:There's a tape recorder hanging from his neck.Maya:Let me see that!...click...DeMasque:Aha ha ha ha ha ha ha... I'll be taking this crown now! Better luck next time, gentlemen! Aha ha ha ha ha ha ha...Maya:... I don't get it... What's this supposed to be, Nick?TorpedoMaya:Nick! It-It's a torpedo!Phoenix:...It's hard to believe, but it sure looks real.Maya:Where could he have picked up something like this?Phoenix:Please don't say that torpedoes are things people just leave lying around.BooksPhoenix:There are a bunch of books lying here. They're all romantic-sounding novels about famous heists and fantastic thieves.Maya:Wow! Look at all the bookmarks and notes stuck into them!Phoenix:Let's see here... \"Note: Must remember this thief's way of laughing. Very useful.\" \"Note: A calling card is an important part of any good thief's modus operandi!\"Maya:...Phoenix:W-Wow, Ron really studied his stuff!TalkRon DeLitePhoenix:Umm, about your husband...Desirée:Hee hee, isn't he cutest? A bit weak sometimes though...Phoenix:...\"A bit\"?Desirée:By the way, did you know they mentioned Maya on TV?Maya:Huh? Really!?Desirée:They said you own the urn and that you're doing some shady training at a law office now.Phoenix:(Remind me not to watch that channel's news program.)Desirée:After I saw that, I thought it might be a good idea to meet the lawyer they mentioned.Phoenix:...I see.Desirée:My Ronnie... He has a powerful imagination and gets deluded easily. He kept insisting he was going to surrender to the police. I didn't know what to do! \"It was me! I stole that urn!\" he kept saying! As if it was even possible!Maya:Huh...? B-But... Are you saying he didn't?Desirée:Ha ha ha. Of course he didn't! Why would my Ronnie ever do something like that?Maya:W-Well, you know... It's a p-priceless treasure! And-And he's... You know...Phoenix:(...Is it possible his own wife doesn't know his secret identity?)Desirée DeLiteDesirée:Me? I'm the kind of woman that needs excitement in her life!Maya:Oh... Excitement, huh?Desirée:Yes. I'm at my happiest when I'm racing along with my bike going at full throttle. Riding a motorcycle is like putting your life on the line. You know what I mean?Phoenix:(Well, I think that depends on how you ride it...)Desirée:I'm the type that can't stand living a boring, dreary old life with no action.Maya:No offense, but your husband, Ron, doesn't exactly look like the risk-taking type himself.Desirée:You're right about that. He's definitely not one for thrills and danger. But I do have to say that he makes up for it in other ways.Phoenix:Other ways...?Desirée:Yes, money... Ronnie is incredibly rich... And super generous. He bought me a bike that's so fast it would make your head spin. And shopping? I like to shop so much it makes Ron's head spin. The other day, it actually happened. His head actually started to spin.Phoenix:(Man, talk about a high maintenance wife...)Maya:So where does Mr. DeLite get all this money from?Desirée:Ronnie is a security guard. They put their lives on the line, right? So they get paid tons of money in return. Tons of it.Phoenix:(He's a security guard...? I think it's my turn for my head to spin...)The night of the crime (appears after \"Desirée DeLite\")Phoenix:Can you tell us about what happened last night?Desirée:Hmm, what time did that incident take place again?Phoenix:What time was it again, Maya?Maya:Well, according to Detective Gumshoe, it was around 1:30 in the morning.Desirée:Ah, last night was horrible. I got pulled over!Maya:P-Pulled over?Desirée:Yes... I always do my best flying at night!Phoenix:\"Flying\"...? Um, you're talking about your motorcycle, right?Desirée:Yes. Anyway, last night I got pulled over. By a policeman. I can't believe he caught up to me! It was a great chase, let me tell you! When he finally caught me, the poor man was as white as a sheet. It was about three in the morning when I finally got home.Phoenix:(Sounds like she's got an airtight alibi...)Maya:Well, what about Mr. DeLite?Desirée:I don't really know... We weren't together at that time of the night. But when I got home, he was already fast asleep.Phoenix:(So basically he's got no alibi...)Delusions (appears after presenting Mask☆DeMasque profile)Phoenix:So... When did Ron first become Mask☆DeMasque?Desirée:What are you talking about? He's not Mask☆DeMasque!Phoenix:Huh? But... W-Wait a second! Look around at this room! This place is obviously Mask☆DeMasque's hideout...Desirée:No no, you're totally wrong. A real thief's hideout wouldn't look like this! It's because Ronnie is so timid himself that he looks up to heroic figures.Maya:Heroic figures? But Mask☆DeMasque is a bad guy.Phoenix:(So he's \"deluded\", huh... Could that really be true?)Desirée:Anyway, if he really had stolen the urn, wouldn't he still have it?Phoenix:W-Well, I suppose so...Desirée:Then why don't you ask him if he has the urn or not?Phoenix:(She has a point. Mr. DeLite isn't exactly the criminal type... But something about Ron's behavior bothers me.)Maya:Maybe it's true... Maybe Mr. DeLite isn't Mask☆DeMasque after all.PresentTreasure Exhibit Poster, Ami Fey's Golden Statue, Sacred Urn, or ShichishitoDesirée:Ooh! That's so mysterious looking... I love old stuff like this!Maya:Really!? That's one of our most treasured possessions! There's going to be a whole exhibit at Lordly Tailor with these types of things!Phoenix:(Maya looks so happy. She's lit up like a 1,000 watt bulb.)Desirée:Terrific! You can count on Ronnie and me to be there! Sounds like fun!Maya:Huh! ...Oh, err, yeah... Ha ha ha...Phoenix:(Oops, looks like that light bulb is starting to flicker.)DeMasque's Calling CardPhoenix:Umm, so what do you know about this...?Maya:No! You can't show her that, Nick! That emblem is top-secret! Don't you remember!?Phoenix:...Doh! Oops, sorry about that. (But the way she just said \"top-secret\" was a worse giveaway than what I did...)Desirée:Ooh! When I hear the word \"top-secret\", it just piques my interest like nothing else!Phoenix Wright profileDesirée:So, Nicky boy, you're a lawyer, huh?Phoenix:Well, yeah.Desirée:How do you like it? I bet it's SO exciting!Phoenix:...Yeah, sometimes. Actually, a little too exciting at times.Desirée:Oooh! I just love a good thrill. Hmm... Nicky boy... It sounds like you have it so nice...Phoenix:(Um... This is starting to get awkward.)Maya Fey profileDesirée:That's really amazing! A \"Master\" at your age!Maya:Oh no, you've got it wrong. It's my mother that's the current Master!Desirée:Oh, I see... So what exactly is she the master of anyway?Maya:Well, you see, it's li-Phoenix:Don't say it, Maya. If you say \"spirit channeling\", she'll laugh.Maya:Ouch... That hurt.Mask☆DeMasque profilePhoenix:...Um, Ms. DeLite. You must know, right? About your husband and Mask☆DeMasque...Desirée:Mask☆DeMasque? Of course. I know all about it. My husband is his biggest fan.Maya:Yup... Wha...? ...Huh?Phoenix:B-Biggest fan?Desirée:Yes, and Ronnie can be pretty delusional sometimes. That's how this whole misunderstanding happened.Phoenix:W-Wait a minute! Did you say \"delusional\"!?Desirée:Yes, that's right. I just don't know what I'm going to do with him... You see, Ronnie actually believes that HE is Mask☆DeMasque!Maya:WH-WHAAAAT!? What are you talking about!?Ron DeLite profileDesirée:I know he doesn't look it... But he can really get things done when he puts his mind to it.Maya:Really? So when exactly does he put his mind to it?Desirée:...Well. Not very often, I admit.Phoenix:(What exactly does Ms. DeLite see in her husband anyway?)Maya:Wow, you must've really seen skyrockets when you first met to love him so much!Phoenix:Skyrockets...? I didn't know people still used that word.Desirée DeLite profileDesirée:As long as I've got my motorcycle and my Ronnie, I'm happy.Maya:Oh! That's so sweet!Desirée:Oh, that plus a little excitement and a little shopping money! ...THEN I'm happy.Maya:Now she's starting to sound a bit greedy... Don't you think, Nick?Anything elsePhoenix:Excuse me, but would you take a look at this...?Desirée:Oh, I'm sorry... I haven't the faintest idea. I guess I just don't get out enough.After clearing all Talk options:Desirée:Say... Can I ask you something, Nicky boy?Phoenix:What is it?Desirée:I know I may seem like a \"bad girl\" on the outside... But the one thing I won't stand for is illegal activity.Maya:I had the feeling you wouldn't! You're tough... But I can tell you've got a good heart. (Changed from [I had the feeling you didn't! You're tough... But I can tell you've got a good heart.] in the original release)Desirée:Somebody framed my poor Ronnie, I just know it. Umm... Could you give this to Ronnie for me?Maya:A letter?Desirée:Yes, for Ronnie. I want him to fight back.Maya:Ms. DeLite... OK, you've got it! Just relax and leave it all to us!Desirée's Letter added to the Court Record.PresentDesirée's LetterDesirée:Could you please give that to my Ronnie? The contents are very important.Phoenix:(*sigh* Back to the detention center I go...)Detention CenterPresentDesirée DeLite profileRon:That's my lovely wife! Isn't she beautiful?Phoenix:Yeah, she sure is...Pearl:... *glare*Phoenix:(Whoo boy. The one topic I didn't want to get into in front of Pearls...)Ron:But... Dessie doesn't approve of my... \"interests\". So I'm afraid she doesn't like me anymore... What should I do? If I want to win her back, I'm really going to have to be super honest.Phoenix:(Oh boy. he's gone back into his own little world again...)Desirée's LetterPhoenix:...Oh, that's right! Here. This is from your wife.Ron:Oh? From Dessie!? Thank you!Letter given to Mask☆DeMasque. ... Actually, more like \"taken\".Ron:\"My dear Ronnie, how are you? I'm doing fine...\" ...Phoenix:(He's clutching onto that letter so hard, the ink is going to be squeezed out...)Maya:He looks so happy...Pearl:You should write a letter to Mystic Maya too, Mr. Nick!After clearing all Talk options and presenting Desirée's Letter:Ron:... Umm... Mr. Lawyer?Phoenix:Yes?Ron:In the letter that Dessie wrote, she said... \"Ask this guy to be your lawyer!\"Maya:Huh...?Ron:Err, umm... I know this would be asking a lot, but... Could you please take my case? My trial starts tomorrow...Maya:Hey, hang on a second! He can't be your lawyer!Phoenix:Why not?Maya:What do you mean, \"why not\"!? We're the victims in this case, right!? Victims of this DeMasque guy!Phoenix:Well, yeah... But according to Desirée, he didn't do it...Pearl:She said, \"Poor man, he's deluded himself into thinking he did it.\" Right, Mr. Nick?Maya:Come on! She could be lying to protect her husband!Phoenix:W-Well, that's true. ...Err, no actually not. Actually it's hard to say (...Oh no, it's spreading!)Ron:Oh, please! I'll give you the treasure of your choice in return...Phoenix:(Hmm... What should I do?)Take his casePhoenix:...Well, Mr. DeLite, I've decided to give it a try. I'll defend you.Ron:Really? You will?Maya:Hey! What're you doing, Nick!?Pearl:He... He's a thief! You can't trust him!Phoenix:Well, he may be a thief... But I think there's more to this case than meets the eye.Leads to:\"M-Mr. Nick...! I-I was wrong about you... I shouldn't have trusted you!\"Refuse his caseMaya:Don't do it, Nick! He's a thief!Pearl:Mr. Nick! I agree with Mystic Maya!Phoenix:(Well, I admit something about this guy stinks like last week's sushi. I guess I really should say no. But... If I do that, this poor guy will have nobody on his side!) ...Well, Mr. DeLite, I've decided to take your case.Ron:Really? You will?Leads to:\"M-Mr. Nick...! I-I was wrong about you... I shouldn't have trusted you!\"Pearl:M-Mr. Nick...! I-I was wrong about you... I shouldn't have trusted you!Phoenix:P-Pearls...?Pearl:I can't believe you'd defend this person after what he did to Mystic Maya...! I-I... I'll never forgive you... EVER! WAAAAAAAAAAAAAAAAHHH!Maya:P-! Pearly...! Wait!Phoenix:(This is going to be ugly...)Maya:I-I'll go after her!Ron:Umm... Sorry about that. I didn't mean to cause any trouble...Phoenix:Well... You couldn't have known she'd react like that. (I guess I might as well start investigating...) Oh, Maya... Where's Pearls?Maya:She said she's going back to the office. Go check in on her later, would you?Phoenix:And what about you...? Are you OK with me taking Mr. DeLite's case...?Maya:Y-Yeah... I'm fine, Nick. I believe in you.Phoenix:... *sniffle* (I think I'm going to cry.)Ron:Umm... I, err... I know you have a lot of work to do... I... I really appreciate it.Maya:OK, Nick! Let's get this show on the road!ExamineSecurity cameraPhoenix:Smile, you're on candid camera. The camera doesn't seem to have a lot to tape right now. The only thing it's watching now is that guard over there.Security guardPhoenix:This guard monitors the visitor's room. It looks like he doesn't have much to do right now. I can tell because he's looking at the camera and making funny faces.October 12Wright & Co. Law OfficesPearl:Ah... Mr. Nick! W-Welcome back!Phoenix:Oh, hey Pearls. You're back too, I see.Pearl:I, um... I went and bought us a strawberry cake! I'll go make some tea to go with it!Phoenix:Hey, uh Pearls... ...Maya:It looks like she feels really bad about what happened at the detention center...Pearl:M-Mr. Nick...! I-I was wrong about you... I shouldn't have trusted you!Pearl:I-I... I'll never forgive you... EVER!Pearl:Mystic Maya! The tea is ready!Maya:Oh... Thanks...Pearl:Come on, Mr. Nick! Please have some of this cake!Phoenix:Yeah... Thanks. Umm, Pearls?Pearl:Oh! Ex-Excuse me... I was in the middle of cleaning the toilet...!Phoenix:Hey, it's OK! I just cleaned it this morning...Maya:Too late...Phoenix:(...This might be a good time for me to ask about her.)ExamineCharley the plantPhoenix:Charley. A quite decorative plant. When she was alive, Mia really loved it. She even went so far as to make it our mascot. No matter how busy I get, I never forget to water this little fella.DeskPhoenix:It's my desk. I don't get to use it much, so the dust bunnies are starting to mount their assault. Hm? Today it's sparkly clean. I guess Pearls must've wiped them out for me.BookshelfPhoenix:Difficult-looking legal books stand in a formidable row. They mock me. These were all Mia's... Wow, I just realized I didn't buy a single one of these.TalkPearlPhoenix:(I first met Pearls a year ago... It was when that murder happened at Kurain Village. I still remember what she said to me when we first met...)Pearl:You... You're Mr. Nick, right? You're... You're Mystic Maya's... \"special someone\"...Phoenix:...Hey, Maya. I've always thought it was because she was young, but...Maya:But what...?Phoenix:Pearls... I think she's got the wrong idea. About... you and me. (Changed from [About... you and I.] in the original release)Maya:Huh!? Err, I... ...Umm...There's something you need to understand...Phoenix:Wh-What is it?Maya:Umm... It's kind of like a Kurain Village custom... Sort of.MayaPhoenix:Pearls seems to love you a lot.Maya:Well, it's because I'm her only cousin. And... well... Because of the murder case last year, Pearly's mother is...Phoenix:Oh yeah...Phoenix:(I remember now... Pearls's mother, Morgan Fey... She's serving a prison term in isolation right now...)Maya:So you see? I'm the only family Pearly has right now... But... It's the same for me, too.Phoenix:Maya...Maya:My mother's gone, too...Kurain Village Custom (appears after \"Pearl\")Maya:There are hardly any men in Kurain Village.Phoenix:Now that you mention it, I never actually saw any men there when I visited.Maya:I'm pretty sure I told you about it a long time ago... About how spiritual powers run very strong in the Fey family.Phoenix:Yeah, you did. And that's why you're undergoing training to be a spirit medium, right?Maya:Yeah... The thing is, only women can actually inherit the spiritual power. That's why the whole culture of Kurain Village kinda revolves around its women.Phoenix:Well, that's understandable... Nothing wrong with that.Maya:Yeah, but because of that... There tends to be a lot of unsuccessful marriages.Phoenix:Oh?Maya:Well, men start to feel left out after a while, and then they just start leaving. ...Especially if the man has a daughter.Phoenix:Are you saying that Pearls's father...?Maya:...He's gone. He left the village when she was very young.Phoenix:Boy, that's tough...Maya:Yeah, and she grew up seeing nothing but unhappy marriages all around her. That's why she's so sensitive to things like that.Maya's mother (appears after \"Maya\")Phoenix:So your mother's still missing...?Maya:Yeah... And no one has any idea where she is.Phoenix:(Maya's mother... Misty Fey. The current Master of the Kurain Channeling Technique. She disappeared 17 years ago after getting involved in a certain police case.)Phoenix:...But you're sure she's still alive, right?Maya:Yeah... I know she is... It's sort of a spirit medium thing...Phoenix:And if your mother doesn't come back, then what...?Maya:Then according to the laws of the village, I'll become the next Master.Phoenix:Mystic Maya... The Master of the Kurain Technique... Sounds like a heavy responsibility.Maya:Yeah, but there's no one else with the blood of the Fey main family who's a spirit medium.PresentAttorney's BadgeMaya:So you've still got that badge, I see.Phoenix:Huh? Well, I'm a lawyer, aren't I?Maya:Yeah, but I guess I just didn't think you'd keep on being one for this long. You have to admit, you've had some close brushes with death because of your job.Phoenix:(...I fail to see how being a lawyer is more dangerous than channeling dead people.)Treasure Exhibit Poster or Sacred UrnMaya:You know, I thought we'd finally found the urn.Phoenix:Yeah, if only Ron DeLite were Mask☆DeMasque, we'd have figured it all out.Maya:Huh? You mean he's NOT Mask☆DeMasque?Phoenix:Well, Desirée says he isn't and I believe her.Maya:Hmm... The mystery gets deeper and deeper.Phoenix:Yeah, and the trial starts tomorrow... as usual.DeMasque's Calling CardPhoenix:So this was made by the real Mask☆DeMasque, huh?Maya:Yup, Detective Gumshoe said it was the real thing. \"One look at this mark and you know it's the real deal, pal.\"Phoenix:Yeah, but you do realize whose deductive reasoning skills we're talking about, right...?ShichishitoMaya:This sword... It has a strange aura surrounding it. It's like it's infused with a spirit of both anger and tragedy.Phoenix:Well, I'd be mad too if somebody bent me the way they bent this sword.Maya:...Yeah, I guess that could be it.Phoenix Wright profileMaya:When did you first get that porcupine cut?Phoenix:...Um, it's been like this ever since I was a little kid.Maya:What!? You mean that's the way your hair is naturally? I thought you had some sort of special \"Phoenix Cut\" deal with the barber. I mean... You usually only see hair like that in a video game.Mia Fey profilePhoenix:If it wasn't for Mia, I wouldn't be the person I am today.Maya:Yeah, she told me you used to really be useless. Compared to how unreliable you were then, you actually seem responsible now. ...Actually, you haven't changed that much, I guess.Phoenix:(Maya praised me for a change! ...Hey, wait a second...)Pearl Fey profileMaya:I'm so sorry that Pearly said what she did.Phoenix:Oh, It's fine... It-It was nothing... (I'm going to have to smooth things over with Pearls later somehow...)Dick Gumshoe profileMaya:Detective Gumshoe's on this case too, huh.Phoenix:He seems to show up during all of our cases. It can't be a coincidence.Maya:Maybe it's a sign that our fates are destined to be woven together for all time!Phoenix:Yeah, that'd be a real Beauty and the Beast kind of fairy tale, wouldn't it.Mask☆DeMasque or Ron DeLite profileMaya:So the real identity of Mask☆DeMasque is... ...Ron DeLite, right?Phoenix:That's what Mr. DeLite claims. ...But I'm not too convinced about something he said.Maya:Huh? About what?Phoenix:About the Sacred Urn. Didn't he sound a little vague on the subject?Maya:Yeah, now that you mention it, he said that he simply \"lost it\", right?Phoenix:(I have this distinct feeling that he's hiding something. I just know it...)Luke Atmey profileMaya:That Detective Atmey guy really surprised me. There was this certain something about the way he said, \"Zvarri!\"Phoenix:Well he did manage to get back the treasure that the Mask guy stole last time, right? And he did it by himself, too.Maya:Yeah, I guess. ...That case has certainly made him famous.Phoenix:It looks like he does deserve to be called \"Ace Detective\" after all.Desirée DeLite profileMaya:That Desirée sure is cool! I love that whole motorcycle thing! The way she laughs in the face of death... I want to try it myself!Phoenix:I thought you only knew how to ride a bike...Maya:Hey! Don't forget, Nick, that it's an electric bike!Phoenix:...E-Electric? So young and already so lazy. Whatever happened to good old exercise?Anything elsePhoenix:What do you think about this?Maya:Hmmm... It seems like it has something to do with this case... But I'm not really sure...After clearing all Talk options:Maya:Well, Nick! Why don't we go out and start investigating? We're not going to learn anything just sitting around the office!Phoenix:Yeah, I know... But... First I want to talk to Pearls...Pearl:...Umm, Mr. Nick?Phoenix:Yeah...?Pearl:I... I acted like a baby.Phoenix:Pearls...Pearl:I doubted you... Even though Mystic Maya trusted you completely... I guess I still have a lot of training to do. Mr. Nick!Phoenix:Y-Yes?Pearl:I... From the bottom of my heart, I apologize for what I said!Phoenix:Aww, it's OK! I'm the one that should be apologizing!Pearl:Well, I'm going out now for a little bit.Phoenix:Huh!? Wh-Where are you going...?Pearl:I may be small, but I still have a lot of spirit channeling power! So I'm going to show you I can be useful too... By finding some evidence!Phoenix:Hey! W-Wait a...! (Ack! She sure runs fast...)Maya:Nick... Let's back off and give her some room, OK?Phoenix:...Yeah.October 12Lordly TailorMain Exhibition HallAndrews:M-Maya...!Maya:Oh, Ms. Andrews...Andrews:I'm so sorry! It's my fault! ...Your precious urn! Your... precious... UUUUURNNN!!!Phoenix:Please! C-Calm down! What's wrong?Andrews:*sniffle* It never ends! Everything I touch ends in failure! Maya, I'm sorry...! I'll do anything to make it up to you!Maya:N-No, it's okay, don--Andrews:I know I don't look it, but I'm good with my hands. I could make you another urn.Maya:Hold on, just wait, OK? Breathe, calm down and talk to us.Andrews:F-Forgive me! Forgive me!ExamineCushionPhoenix:That's probably where the Sacred Urn was going to be displayed.Maya:Yeah, I guess so...Phoenix:Should I put my attorney's badge there? You know, as a replacement?Maya:Hmm... I think it's a little too small for that. What about my Magatama?Phoenix:Now you're being silly... That's definitely too small.Folding screenMaya:It's the folding screen of Kurain Sacred Writings. But I can't read what it says on it.Phoenix:Really? But I thought it was some kind of important spell!Maya:Ahh, yeah. My mother read it and taught me to memorize it. I'll be in trouble if I ever forget it.Phoenix:(Looks like the Kurain Channeling School is teetering dangerously on the edge...)Kurain Village dioramaMaya:Wow, this is incredible! It's a tiny version of my Kurain Village! Hey! I've got a great idea! We can make a miniature of your office, Nick!Phoenix:I don't know about that. The whole place is overflowing with junk. You'd die before you finish painstakingly recreating that mess.Maya:Well, we could always clean it up first.Phoenix:*shrug* True.TalkDeMasque's calling cardPhoenix:Umm... So when did you get the calling card from Mask☆DeMasque?Andrews:Let's see... Exactly 10 days ago. I was going to show it to the police... But that detective stopped me.Maya:Um, so you asked Detective Atmey to help with security?Andrews:Yes. In fact, it was about 20 days ago that I hired him. He seemed to know much more about Mask☆DeMasque than the police.Phoenix:So you hired him for security even before the calling card arrived?Andrews:Well, yes. I had a premonition that something bad might happen... I've learned to trust my hunches!Phoenix:So that's why there are security cameras, even in the basement warehouse?Andrews:Yes. Lordly Tailor is very serious about their security measures. It was their way of saying, \"Bring it on!\" to any potential thieves...Phoenix:(Well, he sure \"brought it\" last night... And even left with a nice souvenir.)The securityMaya:Um, can you tell us a bit about the security for the Treasure Exhibit?Andrews:It was all my fault! I never should have called this paltry little collection a \"treasure exhibit\" anyway...Phoenix:Why do you say that? The urn that was stolen is a pretty important object...Andrews:Maybe, but it's actual value after appraisal was... well, practically zero.Maya:Zero!?Andrews:I polished it until it was just about glowing... I thought maybe I could make it look more valuable!Maya:B-But that urn contains the soul of Mystic Ami...Andrews:Anyway, I left all the security arrangements to Detective Atmey. But... Five days ago, I began receiving all sorts of other exhibit items from Kurain. Lots of people started going in and out of the warehouse down there.Maya:So maybe one of them was actually Mask☆DeMasque in disguise...!Andrews:No, I personally checked out everyone that came through here, so that's not possible.Phoenix:(Knowing Adrian, she probably even checked out what they ate for breakfast that morning.)PresentAnythingPhoenix:Umm... Ms. Andrews?Andrews:I know, I know! It's all my fault! But what's done is done... I'll make it up by making a new urn for you...Phoenix:(I'm just wasting my time. She's too far gone...)Basement WarehouseExamineSecurity cameraPhoenix:I wonder if that detective brought this camera in with him?Maya:Good question! Let's take a look at it. ...Huh? It says \"Property of Lordly Tailor\" on it.Phoenix:So it's borrowed...?Maya:Kind of strange for an \"Ace Detective\", don't you think?ComputerPhoenix:According to the computer data... ...someone did in fact go through those big doors last night, right?Maya:Yeah, I guess so. The shutter did go off once, you know.Wooden boxPhoenix:That pathetic-looking wooden box...Maya:Ahh!! That's the box that had the Sacred Urn on it!Phoenix:Don't touch it! There may be clues to the thief's identity on there!Maya:Grr... I worked so hard to make that box!Phoenix:Huh!? You MADE that poor excuse for a box, Maya?Maya:What's that supposed to mean!? And I-I was so proud of it... *sniffle sniffle*Phoenix:(Poor Maya. Maybe it'd have been better if Mask☆DeMasque had taken the box, too...)ShichishitoMaya:I'm really starting to like this thing. It's so cool-looking. I'd like to strap it to my waist and walk around town like a samurai.Phoenix:Careful. Gumshoe will lock you up and throw away the key if you're caught.Door to the storeroomMaya:Our precious urn was right there on the other side of these doors.Phoenix:Yeah. and according to the security computer data...Maya:Someone was in there last night. Grrr... What I'd like to do to him...!Spilled paintPhoenix:It looks to me like it's been dry for several days.Maya:There's something suspicious about this paint mark. The bottom left part of it is shaped oddly and it's shocking pink.Phoenix:...I don't see how the color of the paint is in any way important.Ami Fey statuePhoenix:When we were here with Ms. Andrews last night, the statue wasn't there it is now.Maya:Yeah, it was right next to the door, wasn't it?Phoenix:Well, if someone moved it, it was probably the criminal.Maya:Maybe he didn't like being watched by Mystic Ami while he stole the urn.Phoenix:...Hey! Cut it out! You're giving me the creeps with that kind of talk!After clearing all Talk options in Wright & Co. Law Offices and clearing \"The security\" Talk option in Lordly Tailor - Main Exhibition Hall:October 12Atmey Detective AgencyMaya:Hello?...Well, well. How lovely it is to see you again, my dear.Atmey:Welcome to my abode! Relax! and soak up the atmosphere...Phoenix:Err, umm... We're actually kind of...Atmey:SHHH! SILENCE! ... Hee hee hee hee hee... Precisely as I expected.Maya:Wh-What is?Atmey:...Zvarri! The truth has once again been elegantly revealed to me! A lawyer, and... a spirit medium. ...Am I correct?Maya:...Umm. I think we've already been through this.Atmey:Ha! So my estimation was correct! Zvarri! ...How truly elegant. Now then, what can I do for you?ExamineGramophoneMaya:Aaah! So the music in this room is coming from here!Atmey:\"Luke Atmey Elegy\" composed by Luke Atmey. This lovely device is called a \"gramophone\". In days of yore, people listened to music on them.Maya:Aha! That's just what I thought! I told you so, Nick!Phoenix:...Luke Atmey paintingMaya:That's quite a large portrait of yourself you have there...Atmey:Yes. I wanted it to say to everyone who saw it, \"Look at me, Luke Atmey!\" With a model so fine, I knew the portrait would also be aesthetically pleasing!Maya:...Um, that's nice.FireplaceMaya:Aaah! There's a cold breeze coming from this hearth!Atmey:Hee hee hee hee... It seems you've fallen for my little deception. You see, this fireplace conceals a rather unexpected device. ...Yes! A high-tech air conditioner!Maya:Wh-Why would you put an air conditioner in there?Atmey:In the summer it acts as an air conditioner and in the winter, it's a heater. Clever?TalkThe night of the crimePhoenix:You mentioned before that you were on guard all alone last night.Atmey:Precisely. This is my fifth encounter with my arch-enemy. I refuse to allow anyone to interfere with the rightful pursuit of my prey.Maya:I heard you've been after Mask☆DeMasque since his very first theft?Atmey:Yes, my dear. I see you've done your homework. In his very first heist, that vile thief pilfered the famous jewel, the \"Tear of Emanon\"! I first encountered him in the museum's sacred hall. The crime scene itself!Maya:So... that's why you were hired as security for the Treasure Exhibit?Phoenix:(I'm pretty sure he said that Adrian Andrews hired him...)Atmey:Yes, I borrowed some equipment from Lordly Tailor and set the perfect trap.Phoenix:You must mean the security camera...Maya:But I thought you were watching the area yourself, too. So how did Mask☆DeMasque manage to steal the urn?Phoenix:That's the million dollar question... What is DeMasque's modus operandi?Sacred UrnMaya:Umm... Mr. Atmey? Did you know about the Sacred Urn?Atmey:I'm interested in only one thing my dear, and that is Mask☆DeMasque! Sacred Urn...? Pfft! That has nothing to do with this case.Phoenix:But... wasn't that what Mask☆DeMasque stole this time?Atmey:I am a hunter, sir! That urn was nothing more than a lure to catch my prey. Do you yourselves remember the shape of the individual peanuts you throw to pigeons?Maya:...I don't think I like this guy's attitude, Nick.Phoenix:Well anyway, it looks like he doesn't know about the urn.DeMasque's M.O. (appears after \"The night of the crime\")Maya:Umm... There's something that's kind of bothering me.Atmey:Please, my dear, ask me anything you like. After all, we are all but seekers, wandering alone in the dark.Maya:Well, I was wondering how Mask☆DeMasque managed to steal the urn. I mean, isn't it strange that you don't seem to know?Atmey:...Phoenix:Yeah, now that you mention it, it is strange. After all, you were on guard that night at the scene of the crime. Unless you were sound asleep, you should have at least seen Mask☆DeMasque.Atmey:...1 PSYCHE-LOCKPhoenix:Wh-What the!? It's a Psyche-Lock...Maya:Ps-Psyche Lock...?DeMasque's M.O. (subsequent times)Phoenix:Mr. Atmey... You must know more than you're letting on. How did Mask☆DeMasque manage to steal the Sacred Urn...?1 PSYCHE-LOCKAtmey:In order for a secret to remain a secret, it must be kept secret.Phoenix:(Last night Luke Atmey must have encountered Mask☆DeMasque... But why would he be trying to hide it...?)Maya:Nick! Go for it! Let's break that Psyche-Lock of his!Phoenix:(...I don't really think she understands what she's talking about. Well, it's been a while, but let's give this a shot...)Psyche-Lock (appears after \"DeMasque's M.O.\", before breaking Psyche-Lock)Maya:Hey, Nick, what is this Psyche-Lock thing?Phoenix:Well, your magatama lets me see when people are keeping secrets. By breaking their mental \"locks\", I can find out what those secrets are.Maya:Whaaaaat!? This Magatama has THAT kind of power!?Phoenix:... Maya, you're the one who gave me this Magatama last year...Maya:...Well, it's true that this Magatama is a prized Fey family heirloom, but... Pearly was the one that actually imbued it with spiritual powers, right? That's why I don't really know much about what it can do.Phoenix:(This is the woman that's going to take over the Kurain Channeling School someday!?)Maya:So how do you do it? How do you break the Psyche-Lock thing?Phoenix:...Well, you present the Magatama to the person with the secret.Maya:...Cool! I can't wait to see it in action! Come on! Try it out!Phoenix:(Oh boy... I think the future Master still needs to learn how to be patient...)DeMasque's M.O. (after breaking Psyche-Lock)Atmey:I can't deny that there may be a small hint of \"truth\" in what you say.Maya:So, you were knocked out when the thief first clobbered you?Atmey:Clobber... What an ugly way of saying it. But I suppose you could put it that way. The coward struck at the precise moment that I turned to look at the computer.Maya:So you never noticed that the thief had entered the warehouse?Atmey:No, the coward must have wormed his way in through somewhere besides the door... Perhaps the air ducts or the sewer pipes... Then my arch-nemesis struck me on the head from behind with this gruesome item here!Maya:Ouch. Mr. Atmey should have his poor head examined. (Changed from [Ouch. He should have his poor head examined.] in the original release)Phoenix:You can say that again. How could he have underestimated the thief that badly?Shichishito updated in the Court Record.DeMasque's M.O. (subsequent times)Atmey:I can't deny that there may be a small hint of \"truth\" in what you say.Maya:So, you were knocked out when the thief first clobbered you?Atmey:Clobber... What an ugly way of saying it. But I suppose you could put it that way. The coward struck at the precise moment that I turned to look at the computer.Maya:So you never noticed that the thief had entered the warehouse?Atmey:No, the coward must have wormed his way in through somewhere besides the door... Perhaps the air ducts or the sewer pipes... Then my arch-nemesis struck me on the head from behind with this gruesome item here!Maya:Ouch. Mr. Atmey should have his poor head examined. (Changed from [Ouch. He should have his poor head examined.] in the original release)Phoenix:You can say that again. How could he have underestimated the thief that badly?PresentMagatama (after clearing \"DeMasque's M.O.\" Talk option)Phoenix:1 PSYCHE-LOCK-- Mask☆DeMasque's M. O.  --Phoenix:Detective Atmey, you were standing guard at the scene of the crime... There's no way you didn't see Mask☆DeMasque commit the crime.Atmey:Well now, I can hardly see why you're so positive about that. Yes, indeed I was guarding the warehouse. That much is true. But I can tell you for certain that not a single person passed through that door.Phoenix:(I'm not sure why... But this Atmey guy is lying through his teeth. ...I know. I'll show him some proof!) Detective Atmey, I have here proof that someone went through that door last night!Present Camera DataPhoenix:Leads to:\"There was a security camera set up at the scene of the crime.\"Present anything elsePhoenix:Atmey:How very interesting that you would present such a thing to me, Luke Atmey, Ace Detective. Unfortunately... It is meaningless. You need to go home, take a long, cold shower and get a good night's rest, Sir Lawyer.Phoenix:(I guess that's a miss...)Atmey:Well then...? Is there something else I can do for you?Phoenix:(Hmm... Maybe I don't have enough evidence yet. If that's true, it could be dangerous for me to push on. But I need to break him!)Leads back to:\"Detective Atmey, I have here proof that someone went through that door last night!\"Phoenix:There was a security camera set up at the scene of the crime. It should have automatically taken a photo of anyone that went through that door.Atmey:...Precisely.Phoenix:I hope you don't mind, but we've already gotten our hands on the camera data. As you can see, the camera went off exactly once last night.Atmey:Wha...! B-But my monocle didn't catch anyone in its flash! It must be some kind of computer malfunction... It-It must be...!Phoenix:Maybe it was your monocle that malfunctioned.Atmey:Wh-What!? Are you saying that I didn't do my duty properly?Phoenix:Detective Atmey. You must have seen the thief last night. The question is why are you trying to hide it! (If he's hiding it, there must be some reason! Some reason that he desperately wants to keep hidden... And I've got just the piece of evidence that should prove it!) OK, let's suppose you didn't manage to see Mask☆DeMasque. In that case, the reason you didn't at that time was because you were...fast asleep.Atmey:...I'm afraid that making a guess is not enough. Time to put your money where your mouth is. Show me your evidence!Present anythingPhoenix:Atmey:...May I give you a piece of good advice, Sir Lawyer?Phoenix:Wh-What is it?Atmey:...A guess is not the same as a theory. Not scientifically, anyway. You need to go home, take a long, cold shower and get a good night's rest, Sir Lawyer.Phoenix:(Argh! I guess I need to think this over again!)Leads back to:\"Detective Atmey. You must have seen the thief last night.\"using the bathroom.Atmey:...I'm afraid that making a guess is not enough. Time to put your money where your mouth is. Show me your evidence!Present anythingPhoenix:Atmey:...May I give you a piece of good advice, Sir Lawyer?Phoenix:Wh-What is it?Atmey:...A guess is not the same as a theory. Not scientifically, anyway. You need to go home, take a long, cold shower and get a good night's rest, Sir Lawyer.Phoenix:(Argh! I guess I need to think this over again!)Leads back to:\"Detective Atmey. You must have seen the thief last night.\"unconscious.Atmey:...I'm afraid that making a guess is not enough. Time to put your money where your mouth is. Show me your evidence!Present ShichishitoPhoenix:Leads to:\"Detective Atmey...\"Present anything elsePhoenix:Atmey:...May I give you a piece of good advice, Sir Lawyer?Phoenix:Wh-What is it?Atmey:...A guess is not the same as a theory. Not scientifically, anyway. You need to go home, take a long, cold shower and get a good night's rest, Sir Lawyer.Phoenix:(Argh! I guess I need to think this over again!)Leads back to:\"Detective Atmey. You must have seen the thief last night.\"Phoenix:Detective Atmey... You were knocked unconscious by the thief, weren't you!?Atmey:Ha ha ha! Surely you must be joking... You think that I, Luke Atmey, could be knocked unconscious so easily!?Phoenix:This sword proves it!Atmey:...! Th-That's...Phoenix:Before the theft, this sword was in the hand of the statue of Ami Fey. Furthermore... at that time, it was not bent.Atmey:Aaah... Err...Phoenix:...There's only one explanation. You were struck on the head and knocked unconscious by this sword! Well, Detective!? How about it!? (Changed from [Well, Detective!? What about it!?] in the original release)Atmey:...I'm impressed. You truly are an \"Ace Attorney\"...1 LOCK BROKENUnlock SuccessfulRon DeLite profileAtmey:This man surrendered to the police, admitting that he was Mask☆DeMasque.Phoenix:Maybe so... But I'm not convinced that he's really behind the thefts.Atmey:He is.Maya:...He sounds pretty sure.Atmey:Just look at his forehead. It's all in the shape of his mouth and eyes... This is the classic face of a thief. It is unmistakable!Maya:Is there anything that isn't \"unmistakable\" to you...Any other profilePhoenix:What about this person here, Detective Atmey?Atmey:...Maya:Is something wrong? Did the cat get your tongue or something?Atmey:That photo leaves me with a distinctly indistinct feeling.Phoenix:Ummm...Atmey:In this case, I'm afraid my perspicacity has been left wanting.Phoenix:(I think he's trying to say that he doesn't have any information...)After clearing all Talk options:Phoenix:Well it looks like we got one thing cleared up anyway.Maya:Huh? What? That Atmey is the greatest Ace Detective in the world?Phoenix:No, that he never actually saw the thief.Maya:Oh... that's right! So the thief may not even be Mask☆DeMasque...Atmey:Just one moment, Sir Lawyer! The thief was unquestionably Mask☆DeMasque!Maya:But you never actually saw him!Atmey:Perhaps so, but I installed a security camera for just such a contingency.Maya:Oh...Atmey:Last night, the camera went off exactly once. Behold! This is a photo of the dastardly thief, taken by the security camera!Phoenix:...Th-That's him!Maya:M-Mask☆DeMasque...!Security Camera Photo added to the Court Record.Atmey:The thief can be none other than the arch-criminal, Mask☆DeMasque. After all, he has a very good reason for committing such brazen crimes.Phoenix:Wh-What are you talking about?TalkDeMasque's reasonPhoenix:So... What did you mean by he had a \"very good reason\"?Atmey:Exactly that. Mr. DeLite had a very good reason to dress up and commit those crimes. There should be a green envelope somewhere in his room. ...You'll need to go and investigate.Maya:B-But how would you know about that...?Atmey:Hmph. Have you forgotten? You're speaking to the finest Ace Detective ever to walk on the face of the earth! The most brilliant mind since ...well, EVER! Luke Atmey!Phoenix:(*sigh* Well, I guess we'd better go take a look, just in case...)DeMasque's Hideout (after clearing \"DeMasque's reason\" Talk option in Atmey Detective Agency)ExamineGreen envelopeLeads to:\"Hey! Nick! Remember what Detective Atmey said!?\"Maya:Hey! Nick! Remember what Detective Atmey said!?Atmey:Exactly that. Mr. DeLite had a very good reason to dress up and commit those crimes. There should be a green envelope somewhere in his room. ...You'll need to go and investigate.Phoenix:A green envelope, huh... Looks like this is it.Maya:OK! Let's have a look! \"If you don't want your true identity revealed to the world... ...come to KB Security at 1:00 AM on October 12th and bring $50,000.\" F-F-F-Fifty thousand...!Phoenix:Th-Th... This is a... B-B-Blackmail letter... (It sure looks like a major clue alright!)Blackmail Letter added to the Court Record....*ding-dong*...Desirée:Oh! Someone's at the door! I'll be right back. Won't take but a second, I promise. (Oh, thank you for coming! That's so nice of you!)???:(When I see a damsel in distress, I just can't help myself!)Desirée:(Please, come on in! I'll make some coffee.)???:(Really? OK, I guess I'll make myself at home, pretty lady!)Phoenix:(...Wait a minute. I know that voice...)Desirée:Oh, Nicky boy, I'm so sorry, but I've got another guest!???:Aaaaaaaaaaaah!! You... You're... Nick, it's you! And Maya, too! What a fluke!Maya:Ah...! Larry! Long time no see!Desirée:What? You know each other?Butz:Ni... \"Nicky boy\"!? Nick, do you and this girl have... you know... something going on?Phoenix:\"S-Something\"? If you mean what I thin--Butz:I underestimated you, Nick! A gorgeous lady like this? ...And married, too? Way to go, dude!Phoenix:(I knew it. Just when things can't get any worse, it's time to cue in the Butz.) Larry Butz... Ever since grade school, he's been... Not exactly a close friend, but yeah, we know each other.Butz:Hey, man, that wasn't nice! I was your very first client!Phoenix:We've got quite the... storied history, he and I. (Changed from [It's been 25 years since I first met Larry.] in the original release) And what we used to say still rings true. When something smells, it's usually the Butz.Butz:Hey, come on now! You're embarrassing me! And in front of this pretty little thing here...Desirée:So you two are old childhood friends, I see. That's so sweet! You two go ahead and catch up on old times. I'm going to go check on my bike.Butz:Nice girl, that Dessie... So how have ya been, Nick?Phoenix:(Too busy if you really want to know...)ExamineGreen envelopePhoenix:So Ron received a blackmail letter, huh?Maya:Do you think Ms. DeLite knows about this?Phoenix:Well if she did, I don't think she would've been smiling like that.Maya:I wonder if we should tell her about it...Phoenix:I think it'd be smarter if we didn't.TalkLarry ButzPhoenix:So what have you been up to this whole time? It's been two years since I heard from you. And what's with these clothes? You look... well, weird.Butz:Hey man, that's uncalled for. This is my uniform, from a my part-time job! But I can't believe it's been two years. They say time flies when you're having fun. Ha ha ha ha... Ah ha... Ha... ...ha?Phoenix:Wh-What's wrong?Butz:Nick... I gotta tell you. Women. ...I don't trust'em anymore.Phoenix:You got dumped again?Butz:Well, you know Bennifer? I followed her all the way to Tibet 2 years ago. That's where I met the famous Katty Tom, and my whole life changed.Phoenix:\"Bennifer\"? \"Katty Tom\"? I never heard of either of them.Butz:Anyway... Dude! Katty Tom chose Hollywood over me! Can you believe it?Maya:Well, actually... Anyway sounds like you had quite the adventure.Butz:Women! They're so... so... Aaaah! Oh... B-But you're different, Maya. You're not like the rest.Phoenix:(...Looks like he's still the same old Larry.)Why are you here? (Changed from [Why you came here] in the original release)Phoenix:So what are you doing here anyway?Butz:Huh...? What do you mean by that? I'm just a natural-born nice guy, that's all. Well, actually... I picked this up last night while I was working.Phoenix:...A wallet? You say you found this last night?Butz:Yeah, it had a driver's license in it, so I figured I'd just return it myself.Ron's Wallet added to the Court Record.Phoenix:Hang on... Let me see that for a minute. ... I know it. Dessie's picture is in here.Butz:Yeah, I guess he really digs his wife, huh? ... Hey, Nick... It's not what you're thinking at all!Phoenix:No, I'm pretty sure it is. You haven't changed a bit.Butz:Aw, no way man! I mean, she's a married woman! That's just bad news!Phoenix:(He really IS here just to check out Ms. DeLite...)Maya:So you said you found it at your job, right?Butz:Yeah! I'm working for a private security company as a guard! Chicks just love a guy in uniform, you know!Phoenix:(A security guard, huh. So that's what that uniform is all about...)Why are you here? (Changed from [Why you came here] in the original release) (subsequent times)Phoenix:So what are you doing here anyway?Butz:Huh...? What do you mean by that? I'm just a natural-born nice guy, that's all. Well, actually... I picked this up last night while I was working.Phoenix:...A wallet? You say you found this last night?Butz:Yeah, it had a driver's license in it, so I figured I'd just return it myself.Wallet (appears after \"Why are you here?\")Phoenix:So what time was it when you found this last night?Butz:Huh? Why are you asking that!? Trying to see if I've got an \"alibi\"!?Phoenix:(Umm... You're not the one on the hook for a crime this time, buddy.)Butz:I guess it was around 1:00 in the morning on the first floor of our company building.Phoenix:(What was Mr. DeLite's wallet doing there...?)Butz:...Anyway, there's nothing weird about that. After all, he works there.Maya:He... works there? You mean... Mr. DeLite?Butz:Sure. Here, take a look at this. It's right there in his wallet.Maya:What's this card?Butz:It's a key card for the security company. See! It's got a serial number on it right there. There's no mistake about it. (Changed form [Hey! It's got a serial number on it right there. There's no mistake about it.] in the original release)Phoenix:You said you were working part-time at a \"security company\", right?Butz:That's right. ...Wh-Why are you making that scary face?Phoenix:(\"Security company\", huh... Something's not quite secure about Larry working there... I need to find out as much as I can about this key card...)Key Card added to the Court Record.Wallet (subsequent times)Phoenix:So what time was it when you found this last night?Butz:Huh? Why are you asking that!? Trying to see if I've got an \"alibi\"!?Phoenix:(Umm... You're not the one on the hook for a crime this time, buddy.)Butz:I guess it was around 1:00 in the morning on the first floor of our company building.Phoenix:(What was Mr. DeLite's wallet doing there...?)Butz:...Anyway, there's nothing weird about that. After all, he works there.Maya:He... works there? You mean... Mr. DeLite?Butz:Sure. Here, take a look at this. It's right there in his wallet.Maya:What's this card?Butz:It's a key card for the security company. See! It's got a serial number on it right there. There's no mistake about it. (Changed form [Hey! It's got a serial number on it right there. There's no mistake about it.] in the original release)Phoenix:You said you were working part-time at a \"security company\", right?Butz:That's right. ...Wh-Why are you making that scary face?Phoenix:(\"Security company\", huh... Something's not quite secure about Larry working there... I need to find out as much as I can about this key card...)Key Card added to the Court Record.KB Security (appears after presenting Blackmail Letter)Phoenix:KB Security, the company in the blackmail letter! You know about it!?Butz:That's where I work, yeah. In fact, I'm on the job right now.Maya:Huh...? So what are you doing here then?Butz:Well, the boss is away right now, and you know what mice do when the cat's away...Phoenix:...Yes, yes. *sigh* Anyway, how far away is this company?Butz:Lemme see... About 30 minutes by car, I guess... Well, if you fly down the road, anyway.Phoenix:Hmm. Well, this apartment building is pretty close to Lordly Tailor, right?Maya:And it would take roughly an hour to go from here to KB Security and back.Phoenix:If Ron DeLite was at KB Security when the robbery occurred, then...Maya:Whoa...! Then he couldn't have stolen Sacred Urn!PresentTreasure Exhibit Poster, Ami Fey's Golden Statue, Sacred Urn, or ShichishitoPhoenix:Larry, this is one of the treasures from Kurain Village...Butz:Be serious, Nick! I couldn't care less about mystic mumbo jumbo stuff!Maya:...Butz:Ah! Of course Maya is a different story!Phoenix:(Talk about your mixed messages...)Blackmail LetterPhoenix:Hey Larry, what about this?Butz:What? If you've got something to say, then say it already! ... Huh...? A blackmail letter!?Phoenix:Do you know anything about this?Butz:Wh-Wha-What? I don't know anything about Alexis! And that's the truth!Phoenix:... Huh? What?Butz:I-I can't believe you'd do this to me! I thought you were my friend! Fifty thousand dollars! I don't have that kind of money!Phoenix:No, no, you don't understand! This blackmail letter was sent to Ron DeLite!Butz:Wheeeew! Man, you scared me!! I almost had a heart attack, you idiot!Phoenix:Wait, I'm the idiot!?Butz:Man, I was totally confused because it says, \"KB Security\" right on the envelope.Maya:Um, yeah... So what?Butz:That's where I've got a part-time job! At KB Security!Maya:Wh... Whaaaat!Phoenix:(Sounds like I should really find out some more about this KB Security company!)Ron's WalletPhoenix:You didn't touch anything in the wallet, did you?Butz:Hey man, be serious! You know what I was interested in!Phoenix:(If Mask☆DeMasque doesn't look out, he's gonna be the victim of a robbery himself!)Key CardPhoenix:So you're sure about this key card?Butz:Yup. That's the key card we use at the building I work in. (Changed from [Yup. That's the key card they use at the building I work in.] in the original release) According to the serial number, this one is for the CEO's office. You need it to get into that room, and every time you use that card, it leaves a record.Maya:It leaves a record?Butz:Yeah, it tells you exactly who entered the room and when.Phoenix:Larry! I need that data...!Butz:Whoa! Slow down, man! Sorry, but that data is off limits to outsiders. If I lost this job, I'd never have a chance with Dessie...Phoenix:(It's times like these when I wish lawyers weren't so powerless...)Key Card updated in the Court Record.Key Card (subsequent times)Phoenix:So you're sure about this key card?Butz:Yup. That's the key card we use at the building I work in. (Changed from [Yup. That's the key card they use at the building I work in.] in the original release) According to the serial number, this one is for the CEO's office. You need it to get into that room, and every time you use that card, it leaves a record.Maya:It leaves a record?Butz:Yeah, it tells you exactly who entered the room and when.Phoenix:Larry! I need that data...!Butz:Whoa! Slow down, man! Sorry, but that data is off limits to outsiders. If I lost this job, I'd never have a chance with Dessie...Phoenix:(It's times like these when I wish lawyers weren't so powerless...)Phoenix Wright profileButz:You're 26 years old, right? Don't you think it's about time you took a long, hard look at your life?Phoenix:... Coming from a guy who can only brag about how many times he's been rejected... I find that kind of... ironic.Mia Fey profileButz:Hey, I remember her! That's Maya's big sister!Maya:Wow! You really do remember!Butz:Yeah, who could forget! A couple of gorgeous sisters! Hubba hubba!Maya:You hear that, Nick! Gorgeous!Phoenix:(Oh yeah... That's right. When I defended Larry... Mia was still alive...)Maya Fey profileButz:Wow! You've even cuter than the last time I saw you.Maya:Oh, really!?Butz:Yeah, you look totally different than two years ago. Don't you think Nick?Phoenix:(Maybe it's 'cause we're always together, but she looks pretty much the same to me.)Pearl Fey profileButz:Oh! What a cutie! Hey, Nick! So what's the deal between you and this girl?Maya:Hey! That's my cousin! Her name is Pearl Fey.Butz:Pearl, huh... Too bad. Never date two girls with the same name... That's one rule I can't break.Phoenix:(...I'd think the fact that she's only 9 years old would break some rule somewhere!)Adrian Andrews profileButz:WHOA! WHO is this! Come on, man, don't hold out on me!Phoenix:Forget about it. It's on a need to know basis and you don't need to kn--Butz:Hey now! I thought we were pals! I got a MAJOR thing for girls with black sleeveless shirts and glasses!Phoenix:How do you know that!?Butz:And if they have an orange-colored memo pad, I really lose my cool!Phoenix:(He has to be making that up... He can't really know Adrian... Can he...?)Mask☆DeMasque profileButz:I just thought of something! What if it's actually a hot chick under that costume!Phoenix:Forget about it. It's a guy, trust me.Butz:Man! You're killin' my buzz, dude!Maya:Boy, talk about someone who has a one track mind...Desirée DeLite profileButz:That Dessie is one awesome lady alright! It's been a long time since I've felt this way... I think I'm really in love this time!Maya:A long time, huh?Butz:Yeah! Well, err... Except for what I feel for you, Maya!Phoenix:(I don't think even HE knows what he's saying anymore.)Larry Butz profileButz:Even you could learn a few tricks from me, Nick!Phoenix:...Yeah? Like what?Butz:Look at my hair for example. It points up straight, right? But your hair, on the other hand, points backwards. That's no good at all, man! It's defeatist! You gotta aim high... for the stars!Phoenix:(I... I can't find a counter-argument to that...)Any other evidencePhoenix:...What about this? Does anything come to mind?Butz:Listen, I'm a security guard. I'm not here to sell you juicy bits of info and chew the fat, man.Phoenix:(Funny, you had no qualms about selling Samurai Dogs just 2 years ago.)Any other profilePhoenix:Larry, what about this person...?Butz:Beats me.Phoenix:(What the...? All of a sudden, he's got nothing to say...?)After clearing \"Wallet\" and \"KB Security\" Talk options and presenting Key Card:Phone:...Maya:Hey, Nick! Your phone! (Changed from [Oh, Nick! Your phone!] in the original release)Phone:...*beep*...Pearl:H-Hello? Is this the Wright residence?Phoenix:Ah! Pearls! Where are you!?Pearl:I-I thought I'd go to Lordly Tailor to try to find some more clues, but... ...I'm afraid I've gotten lost.Maya:Whaaaat!? Give me that phone, Nick! P-Pearly! Where are you right now!?Pearl:Um... I was walking along and I found myself in front of that person's office.Maya:\"That person\"...? Who!?Pearl:Um, the person who doesn't act his age and always says, \"Zvarri!\" when he's excited...Phoenix:(Luke Atmey, Ace Detective...) OK, stay right there! We're coming to get you!Pearl:A-Alright... I-I'm a little scared...Phone:...*beep*...Phoenix:Alright! Let's go, Maya!Butz:Wait a second, Nick!Phoenix:Wh-What?Butz:That phone call just now... Sounded like real cutie... Another one of your, ahem, ...\"special friends\"?Phoenix:.......... Say goodbye to Ms. DeLite for me, would you Larry?October 12Atmey Detective AgencyPearl:Ah! Mr. Nick! Mystic Maya!Maya:Pearly!Pearl:I never thought I'd see the two of you again!Phoenix:...So is Mr. Ace Detective out of the office?Pearl:Yes, when I arrived here... ...there wasn't a single soul in sight.Maya:Say, Nick... Doesn't look like something's changed since we were here last?Phoenix:(Now that you mention it...)ExamineBagLeads to:\"This bag... I'm sure it wasn't here before.\"Maya:This bag... I'm sure it wasn't here before.Pearl:It looks quite full... I wonder what could be in here?Maya:Hey, Nick! Come on! Open it up!Phoenix:Hey! Wait a minute! We can't just open his private property!Maya:Don't be such a fuddy-duddy! This is an important investigation!Phoenix:(That's true... And truth be told, I have to admit I am kind of curious...)Maya:Well? What's in there?Phoenix:H-Hang on a sec. I'm taking it out now... (Whatever it is, it feels... kinda hard... and smooth...)Atmey:...Well, hello there!!Maya:EEEEEEK! H-He's here!Atmey:...What are you doing, Sir Lawyer? I'm shocked to see a servant of the court ignoring the law so flagrantly!Phoenix:I-I'm really sorry! M-Maya made me do it!Maya:Nick! I can't believe you!Atmey:A gentlemen never uses a lady as an excuse for his own poor behavior... The real question is... Can you afford to waste time lollygagging about here?Phoenix:Wh-What do you mean by that?Atmey:Perhaps I should make myself more clear? Tomorrow's trial... Zvarri! Shall we say the figurative Sir William will be dropping his panties before lunchtime?Maya:Wow, Nick! Sounds like it's gonna be really exciting.ExamineBagMaya:So what's in there, Nick? What's in the bag?Phoenix:The way Atmey barged in like that, I never actually got the chance to look!Pearl:I know. I thought I was going to collapse of shock, too!Phoenix:(But from the feel of it, it was something hard...)TalkTomorrow's trialPhoenix:Umm... What's going to happen at the trial tomorrow that's so dramatic?Atmey:Do you know what your biggest mistake so far has been, Sir Lawyer? ...It was becoming a lawyer in the first place.Pearl:...That certainly does sound like a big mistake, Mr. Nick.Atmey:Tomorrow will be a day to remember. I, Luke Atmey, will take the stand! And then... Zvarri! My testimony will prove to be the undoing of the lot of you! Yes! All of you! I will unmask you as the thief's co-conspirators!Maya:C-C-Conspirators!?Atmey:Hee hee hee hee hee... You're quick on the defensive, I see! However! It is not I that is your greatest enemy! There is a far more dangerous threat that you will face during the trial.Maya:Wh-What are you talking about...?Atmey:Sir Lawyer... If you truly are who you say, I'm sure you've heard of him. ...His name is \"Godot\".Phoenix:G-Godot...?DeMasque's identityAtmey:You have taken a step down the path of foolishness. To try to defend a career criminal who deserves nothing less than the death penalt--Maya:Hey! Last time I checked, no one knows for sure that Mr. DeLite really is DeMasque!Atmey:Hee hee hee hee hee... My dear lady... Times may change, but people, sadly, do not... ...Well. You will understand this when you are more mature.Godot (appears after \"Tomorrow's trial\")Maya:Um... Who is this \"Godot\" person...?Atmey:...It's not surprising that a spirit medium has not heard the name. Godot. The prosecutor whose equal cannot be found in this country, but in heaven. Godot. A legend or myth... Men pin a lifetime of hopes on the chance to simply meet him.Pearl:Prosecutor Godot... (Changed from [Prosecutor...] in the original release)Maya:But the best prosecutor in the country isn't Godot, it's Mr. Edgeworth! Isn't that right, Nick!?Atmey:...It's no surprise that a spirit medium such as yourself would know nothing of this. But Ace Prosecutor Miles Edgeworth is currently traveling abroad.Maya:Huh...?Atmey:In fact, it was Mr. Edgeworth who acknowledged Godot as the best in this country.Pearl:And you agree with that?Atmey:Most certainly. In fact, you could call him the Luke Atmey of the Prosecutor's Office.Maya:Well, that's good to hear! The prosecution has a fighting chance tomorrow!Pearl:Mr. Nick, is this \"Godot\" really that strong?Phoenix:Hmm... I seem to remember hearing about something like that...Atmey:Not surprising... Some people spend their entire lives idly waiting for his appearance.PresentAnythingMaya:Ummm, Mr. Atmey...? Could you take a look at this?Atmey:Oh please. You can drop the pretense already.Maya:Huh...?Atmey:You and I are already fated to fight each other... And the only true weapon for warriors in a court of law is information! Surely you don't expect me to sharpen your sword for you!Maya:...Creep.After clearing all Talk options:Phoenix:(It looks like we're done investigating for the day.)Atmey:Hee hee hee hee hee... Sir Lawyer... The stage has been set and all the pieces are finally in place. All that remains now... is for the dance to begin!Phoenix:(A new prosecutor, an Ace Detective and a thief... This will be one tough trial.)To be continued.Nothing to examine during investigationPhoenix:No clues here.Exit Magatama sessionPhoenix:(I don't think I have enough evidence yet... I should investigate and gather some more clues before I try again...)Too many errors during Magatama session...Mr. Nick... ...If you push yourself any more, your soul will shatter... ...Please calm down, collect your thoughts, and try again...Phoenix:(Nnrgh! I've made too many mistakes!)The Stolen TurnaboutTranscriptPart 1Part 2Part 3Part 4October 13, 9:36 AMDistrict CourtDefendant Lobby No. 4Maya:Hey, Nick!Phoenix:What is it? Is something wrong...?Maya:Nah. But did you see all the people here? It's crazy! Oh! So, check out the Mask☆DeMasque glossy I bought! (Changed from [Oh! Look at this! I bought this Mask☆DeMasque publicity photo!] in the original release)Phoenix:You bought this... where? (Changed from [You bought that...? Where!?] in the original release)Pearl:From the little tents in front of the courthouse. They have all sorts of things for sale!Maya:You know I'm sucker for this kind of stuff!Mask☆DeMasque Publicity Photo stuck into the Court Record.Come on! I'm guilty! Throw the book at meeee!Pearl:...Who's screaming like that?Ron:...Oh! Mr. Wright! You made it!Phoenix:Yeah, I did. But it doesn't look like things are going to get any less ugly for you...Ron:Because I did it!! I'm the criminal! Me! Me! Meeeeeee!Maya:Ungh... He's at it again.Ron:I sent the calling card to Lordly Tailor! I admit iiiit!!Phoenix:But... You don't have the Sacred Urn, right?Ron:Well, that's true, but... That doesn't mean that I didn't commit the crime.Phoenix:(Normally, when I say \"Of course you didn't\" I'm being sarcastic, but you... Yikes!)Ron:Anyway, I admit that I'm guilty... So make sure they give me a guilty verdict! Pleeeeease!?Desirée:Oh, there you are Ronnie! Bonjour, sweetie!Ron:Oh! D-Dessie honey! B-Bonjour! ...Well, actually... I don't really know why I should be speaking French to you at a time like thisDesirée:Leave it all to me, Ronnie! I swear I'll protect you!Ron:Ummm, errr... Aaah... Well, ahh... You see... Actually the thief is err, meDesirée:Can I tell you something, Nicky boy? I can guarantee that my Ronnie is innocent! If he's declared guilty, I'll be ever so cross with you!Phoenix:(So why are you smiling when you say it?)Desirée:Well, if you'll excuse me! I've got some errands I need to take care of! I'm counting on you, Nicky boy! Good luck!Phoenix:(To be honest, I really don't know whether Ron is Mask☆DeMasque or not. But there's only one thing I AM sure of. He doesn't have the Sacred Urn right now...)Bailiff:Mr. DeLite! It's time for you to enter the courtroom!Phoenix:(For the time being, I guess I'll have to trust Desirée...)October 13, 10:00 AMDistrict CourtCourtroom No. 6Judge:Court is now in session for the trial of Mr. Ron DeLite.Phoenix:The defense is ready, Your honor.???:...Judge:What about the prosecution? Are you prepared to...???:...What a stupid question!Judge:Wh-What did you say!???:Fine. Let me ask you then, Your Honor. Are YOU ready? Are you ready to pass judgement?Judge:Wh...! N-No, I... I'm not! I will pass judgement after I hear arguments from both sides.???:Well, if you're not ready yourself, you shouldn't expect others to be. That's a rule to live by.Judge:...Um, wh-who are you?Godot:I am Godot. Legendary prosecutor. I've never lost a case.Maya:Ah! He's the one that Detective Atmey was talking about...Judge:Yes, your reputation precedes you. What kind of cases have you dealt with so far?Godot:Ha...! None.Judge:What did you say...?Godot:I've never prosecuted a case before.Judge:N-Never? But you said you've never lost before.Godot:...Exactly. I've never lost. I've never won before either.Judge:Quite arrogant for a beginner, aren't you?Godot:Even the mightiest of redwoods begin their lives as mere saplings.Judge:Yes, but... A mask? In a court of law?Godot:Ha...! Don't you know anything? No matter the man, we all wear masks... Either on our faces or ever our hearts.Judge:...!Maya:This guy is the real deal alright, Nick...Phoenix:(Why does it seem like all prosecutors are the \"real deal\"...?)Godot:So we finally meet... Mr. Phoenix Trite!Phoenix:...?Maya:N-Nick! Is he a friend of yours?Phoenix:No. I don't have any friends that call me \"Trite\". (Just who is this masked man...?)Godot:I've returned from the depths of Hell... To do battle with you.Judge:Well then, err, Prosecutor Gobo.Godot:It's not \"Gobo\". It's Godot... Your Honor.Judge:In any case, please give your opening statement.Godot:Opening statement? Those things are not fit for even dogs to consume. I have only one thing to say before we start. To you... Mr. Trite.Phoenix:Wh-What is it?Godot:Are you familiar with the saying, \"A chain is only as strong as its weakest link\"? I wonder... how much you can withstand before you and your case break in two...?Phoenix:...Judge:Hmm... Well then, let's hear from the first witness!Gumshoe:Um, my name is...Godot:No one asked for your name, witness.Gumshoe:...Urk.Godot:The important thing is what you know... That's all. Start talking. ...We're listening.Gumshoe:Y-Yes, sir.Judge:Alright, witness. First, let's hear about... What you know about the thief that stole the urn.Gumshoe:Yes, sir!Witness Testimony-- Mask☆DeMasque's Crimes --Gumshoe:Mask☆DeMasque is a master thief that first started his crime spree 6 months ago.He's so confident that he sends his calling card before he even commits the crime!This was his fifth heist, and as usual, he sent a card on to Lordly Tailor.His pattern is to always go after only the most precious art pieces.That's why we're sure it was Mask☆DeMasque, sir. It fits his M. O. to a T!Judge:Hmm... So then the actual identity of this Mask☆DeMasque is... M-Mr. Godot! W-What are you--!? (Changed from [M-Mr. Godot! Y-You!] in the original release) W-We're in the middle of a trial here, Mr. Godot!Godot:Blacker than a moonless night, hotter and more bitter than Hell itself... That is coffee. I'm sure you can grant me at least this much... Your Honor. Oh, please. Proceed.Judge:... Very well. It's only coffee, after all.Phoenix:(What!? You can't be letting him slide this early in the trial!)Judge:Proceed with your cross-examination, Mr. Wright.Maya:Well, Nick? What are you going to do?Phoenix:As long as they haven't brought up Mr. DeLite's identity... ...all we can do is show that it wasn't Mask☆DeMasque who stole the urn.Cross Examination-- Mask☆DeMasque's Crimes --Gumshoe:Mask☆DeMasque is a master thief that first started his crime spree 6 months ago.PressPhoenix:Phoenix:Have you been involved in the investigation from the beginning?Gumshoe:Yup! Nobody knows more about the thief than me, pal! It's true! I'm a... Zvarri...! \"Author on thieves\"!Phoenix:...Maya:An \"author\"...? He's written books about thieves?Phoenix:Um, I think he probably meant to say \"authority\".Gumshoe:The fact that this guy can slip through even my fingers shows how good he is, pal!Phoenix:(It's easy when those fingers happen to be \"butter fingers\"...)Press harderPhoenix:So nobody knows more about the thief than you, huh...?Gumshoe:You got it, pal! Except maybe for the thief's mom, that is!Phoenix:But isn't there someone who knows even more about him than the police?Gumshoe:You don't mean... \"Detective Zvarri\", do you?Judge:Hmm... Who is this person? Zvarri? He sounds German...Gumshoe:His name is Luke Atmey, sir. I guess I shouldn't have made up such a silly name for him.Phoenix:(What the heck? I guess he's not all that famous after all...)Gumshoe:Anyway, it's true that he did manage to retrieve the last item the thief stole.Judge:...Oh, I see. It seems you're not the expert you claim to be.Gumshoe:...Urk! I-It looks like the thief is playing with me, even now!Leads back to cross-examinationLeave itPhoenix:(The real \"authority\" on the thief is the other detective. I don't need to ask this one any more questions...)Leads back to cross-examinationGumshoe:He's so confident that he sends his calling card before he even commits the crime!PressPhoenix:Phoenix:Have you seen all of these so-called \"calling cards\"?Gumshoe:Of course I have. Except... The person in charge of the Treasure Exhibit never brought their card to the police... So I didn't see this one until after the crime occurred.Maya:That's because Detective Atmey stopped Ms. Andrews from taking it to the police.Judge:Was the calling card that Lordly Tailor received authentic?Gumshoe:Well, all the cards have one common, identifying feature. But we're not releasing that information to the general public...Judge:But you're absolutely certain that this card is real?Phoenix:(Gumshoe can't say it out loud but I bet he's talking about Mask☆DeMasque's emblem...)Gumshoe:This was his fifth heist, and as usual, he sent a card on to Lordly Tailor.PressPhoenix:Phoenix:His fifth heist... And your fifth screw up, huh?Gumshoe:Objection, pal! That ain't fair! Maybe you could say I screwed up four times! But this last time wasn't my fault! I didn't know about the calling card this time!Phoenix:(You of all people shouldn't be chuckling about this, Detective Gumshoe...)Gumshoe:I just want everyone here in the courtroom to know something! If you ever get a calling card from this guy, don't call some stupid private eye! Call your local police right away. Got me?Maya:Wow, it looks like he's really got it in for Detective Atmey.Gumshoe:His pattern is to always go after only the most precious art pieces.PressPhoenix:Phoenix:Art pieces? Like what, for example?Gumshoe:Well, his first target was the famous \"Tear of Emanon\".Judge:What's that? Some kind of especially salty teardrop?Gumshoe:N-No, sir. It's a blue diamond. A single, rare diamond. Next was the \"Crown of Bongora\"... You know, the thing you put on your head. After that was the \"Left Hand of Hades\" and then the \"Portrait of Mejeena\", sir. Detective Atmey retrieved the \"Portrait of Mejeena\" and returned it to the museum.Phoenix:And the target of his fifth and last robbery was the \"Sacred Urn\"... right?Judge:But isn't it difficult for him to dispose of such famous art pieces...?Gumshoe:Well, we assume he must have some underworld connections.Maya:Somehow, Mr. DeLite doesn't look the type...Phoenix:(Yeah, he's a little too sunny to be hanging out in the underworld...)Present Sacred UrnPhoenix:Leads to:\"...Can I ask you a little something, Detective Gumshoe?\"Gumshoe:That's why we're sure it was Mask☆DeMasque, sir. It fits his M. O. to a T!PressPhoenix:Phoenix:What do you mean when you say, \"it fits his M. O. to a T\"?Judge:I was thinking of asking the same thing myself.Gumshoe:Ugh... I wish you would listen a little more closely, pal. First of all, there's the calling card. We're 100% certain it's authentic. Then there's the fact that he seemed to know all about the security system. And finally, his target was an art piece. These are all part of the thief's modus operandi.Judge:And so, since this robbery seems to fit all those conditions...?Gumshoe:That's right! It means that Mask☆DeMasque is behind it!Present Sacred UrnPhoenix:Leads to:\"...Can I ask you a little something, Detective Gumshoe?\"Maya:Nick! It definitely looks like it was Mask☆DeMasque who stole the urn!Phoenix:But there's no real evidence either way as to whether Ron DeLite is Mask☆DeMasque.Maya:But... But...Phoenix:Also, the urn hasn't turned up yet, let alone in connection to Mr. DeLite himself.Maya:So even though we know it was Mask☆DeMasque that did it...Phoenix:(Maybe for the time being, I should try to show it wasn't Mask☆DeMasque that did it!)Phoenix:...Can I ask you a little something, Detective Gumshoe?Gumshoe:...Just hearing the \"little\" in that question is making me nervous.Phoenix:You said that he always \"goes after the most precious art pieces\", right?Gumshoe:That's right, pal.Phoenix:But there's one problem... That's not what he did in this case. The supposedly \"priceless\" urn doesn't exactly rise to the level of \"precious art\"!Gumshoe:Wh-What do you mean!?Maya:N-Nick! How can you say such a terrible thing!?Phoenix:No! I meant from a financial point of view! I mean, it wouldn't fetch a good price.Judge:Well, Prosecutor Godot? What is the value of that urn?Godot:The appraisers I spoke to said they couldn't attach a price to it. And I mean that in the worst sense.Phoenix:So in other words... It was not the kind of item that Mask☆DeMasque would normally go after!Gumshoe:Urk!Judge:Hmm... If I understand you correctly, Mr. Wright... ...you're saying that the theft of the Sacred Urn was not the work of Mask☆DeMasque...!Phoenix:Y-Yes... That's what I'm saying. (Actually all I did was point out the contradiction. The argument made itself, but...)Judge:Well... First of all, we need to get this issue cleared up. Was this last robbery the work of Mask☆DeMasque or not? What do you have to say about this, Mr. Godot?Godot:This coffee here... It's my own special blend. I call it Godot #107. I'm trying to decide whether to cut down on the acidity or the bitterness... That's the only thing I've got on my mind right now... ...Mr. Trite!Phoenix:Wh-What!?Godot:If you're really a man, you should clean up your own mess.Phoenix:Umm... Sorry, but I didn't get what you mean.Godot:If you're saying it wasn't Mask☆DeMasque that stole the urn... ...then it must be someone imitating Mask☆DeMasque's methods... A fake.Judge:A-A Fake☆DeMasque?Maya:Fake☆DeMasque? That sounds so ridiculous. ...But I like it.Godot:Now, before I decide on my coffee, I believe some proof is in order, Mr. Trite. Proof that the person who appeared at Lordly Tailor that night was actually a fake.Judge:Hmm... Though I don't approve of Mr. Godot's behavior, his point is valid. Mr. Wright. ...We're waiting.Phoenix:(It looks like I'm going to have to prove it... I need proof that the person at Lordly Tailor that night was in fact, Fake☆DeMasque!)Present Security Camera PhotoPhoenix:Leads to:\"The proof is right here.\"Present anything elsePhoenix:Judge:What is this evidence supposed to prove?Godot:Ha...! Well, it proves someone here is a fake alright. ...It proves that this lawyer is a fake.Phoenix:(These prosecutors sure know how to twist the knife...)Maya:This is no time to be impressed! Think it over again! When he stole the urn, his photo was taken, right? Who knows? Maybe there's something on there that shows he's a fake...Phoenix:(Hmm... Is she talking about that photo we got from Atmey?)Judge:Are you ready yet, Mr. Wright?Leads back to:\"It looks like I'm going to have to prove it...\"Phoenix:The proof is right here.Judge:This looks like... a photo taken by a security camera.Phoenix:But if you look closely... you'll notice something peculiar about it.Godot:Ha...! Well then, why don't you go ahead and show us what it is. Go on. Use this pointer and show us just what about this picture is so \"peculiar\".Present front of Mask☆DeMasque's neckPhoenix:Leads to:\"It's right here, of course!\"Present anywhere elsePhoenix:Phoenix:It's right here. ...I think.Judge:Is that what was so \"peculiar\"?Godot:Ha...! The place that you're pointing to is all wrong.Phoenix:Wh... What do you mean!Godot:The only thing \"peculiar\" in this courtroom... is on top of your head.Maya:Nick! Are you going to let him get away making fun of your hair!?Phoenix:(Yes... At least until I know he can't use his goggles to fry me or something...) W-Well anyway! There is a strange spot in this photo!Godot:Ha...! Still haven't given up? So what is it then?Leads back to:\"Go on. Use this pointer and show us just what about this picture is so \"peculiar\".\"Phoenix:It's right here, of course!Judge:You mean... Mask☆DeMasque?Phoenix:I have here a piece of reference I would like the court to take a look at.Maya:Isn't that the publicity photo I bought this morning...?Phoenix:The problem I have with the security camera photo is the broach on DeMasque's chest.Judge:A Breach? Here!? Bailiff! Get my steed! We need to retreat at once!Phoenix:...A broach, Your Honor. It's a sort of clasp for holding one's cape on.Judge:A clasp, eh... Ah! I see now!Gumshoe:But the Mask☆DeMasque in the security camera photo... Ahh!! He has no broach!!Phoenix:That broach is the same as the emblem on DeMasque's calling card and serves as his symbol. But the thief that broke into Lordly Tailor wasn't wearing a broach... In other words, this \"Mask☆DeMasque\" is a fake!Gumshoe:...! I-I've been fooled agaaaaaain!Judge:O-Order! It's true... Undeniably true... Detective Gumshoe! How... How could you have overlooked this!?Gumshoe:I-I'm sorry, sir! I don't know how I...Godot:Hey now... ...If you're gonna have a pity party, invite me, too!Judge:M-Mr. Godot! You deserve some blame in this, too! How could you have overlooked such a large broach...?Godot:Ha...! The broach you're talking about... Do you mean this?Gumshoe:Ah...!Phoenix:Th-That's...! Mask☆DeMasque's broach!Judge:Wh-Where did you find it!?Godot:Well I've always had a good nose for evidence... I got it at the crime scene. It was hidden in the shadow of a big female Buddha statue.Phoenix:(\"Buddha statue\"...? He must mean the Ami Fey statue.)Gumshoe:Wh-Why didn't you tell me about that, sir!?Godot:...I always put evidence away in my pocket. ...After all, it's the safest place for crucial evidence.Maya:Grrr... This guy is one cool customer.Godot:It's a little early to be shaken up, isn't it, little lady? ...That friend of yours left pretty little hickeys on there, too.Judge:H-Hickeys?Godot:Figuratively speaking, of course... I'm referring to Ron DeLite's fingerprints.Gumshoe:Whaaa...?Judge:What!? The defendant's fingerprints are on the broach!? Order! Order in the court! Mr. Godot! Let's see that broach!Godot:I've grown attached to my metallic girlfriend here. ...Take good care of her.Judge:Hmm... She-- I mean, it appears to have been torn off some clothing. There's a little bit of cloth left on the back.Godot:Obviously there must have been a big struggle that night at the crime scene.Phoenix:(Uh oh... Phoenix, we have a problem...)DeMasque's Broach added to the Court Record.Godot:Ha...! You mess with Godot... ...and you get burned.Phoenix:(Grr... He's been playing me like a violin...)Godot:Well Judge, I'm about ready to call my next witness.Gumshoe:Huh? You're done with me? But I haven't proved anything yet.Godot:You've proven your own incompetence. That's good enough.Gumshoe:...That doesn't sound good at all.Judge:Bailiff! Bring the next witness into the courtroom!Phoenix:(Finally time for the Ace Detective to make his appearance, huh...?)Godot:One second is one drip of the coffee pot. Let's hurry it up.Atmey:SHHH! SILENCE!... Hee hee hee hee hee... Now I see. It's all becoming clear.Judge:Wh-What's clear?Atmey:...Zvarri! The truth has once again been elegantly revealed to me! What we have here is... A judge and a prosecutor. ...A coffee maniac, at that! ...Am I correct?Judge:W-Well, yes. That's right.Godot:Ha...! Not bad. Not bad at all. You're the first person that's ever been able to penetrate my secret veil.Atmey:Well, Sir Prosecutor. Let me introduce myself. My name is Luke Atmey, Ace Detective and rising star illuminating the heavens.Maya:Boy, these two make a perfect pair...Phoenix:They'd either be best friends or they'd tear each other's heads off.Judge:I've heard that on the night of the crime, you were all alone on security detail.Atmey:...You have heard correctly. My specially-made monocle is worth more than a hundred Detective Gumshoes. ...If Detective Gumshoe was worth anything, that is.Judge:Hmm...Phoenix:(Why was this guy all by himself anyway...? There must be some reason. I'm sure of it!)Judge:Well then, tell us what this special monocle of yours witnessed!Witness Testimony-- What I Witnessed --Atmey:It was approximately 1 o'clock in the morning... just after the date changed.That's when my nemesis, the infamous Mask☆DeMasque, dancingly descended upon me!Just as I began to turn, the coward struck a fierce blow upon my noble head!Darkness swallowed me before I could land a single strike. When I awoke, he was gone.Thirty minutes later, I used an emergency phone to notify the police!Judge:So you didn't get a clear look at the criminal?Atmey:My specially-made monocle never misses a thing. However! That is limited to things that fall within my own visual range! But of course, that's only natural.Judge:...I fall to see why the witness seems so proud of his performance that evening.Atmey:Well, Sir Old-Timer, let me explain. We are not speaking of any ordinary thief... ...but of the kings of thieves! The great Mask☆DeMasque, my arch-enemy! That is what my instincts and my years of experience tell me!Judge:Hmm... Very well. Proceed with the cross-examination, Mr. Wright.Cross Examination-- What I Witnessed --Atmey:It was approximately 1 o'clock in the morning... just after the date changed.PressPhoenix:Phoenix:So that would be one o'clock on the morning of the 12th, correct?Atmey:That's an impressive deduction, Sir Lawyer.Phoenix:You were on security duty that night. Where exactly were you at the time?Atmey:A penetrating question! I was in the basement warehouse, near the computer.Phoenix:(Near the computer, huh...)Judge:So then you weren't trying to remain hidden, I take it?Atmey:Up to this point, I have tried to remain concealed while waiting for the thief...Phoenix:(Yeah, he said the same thing yesterday, too.)Maya:Gumshoe also said that he never saw him at the crime scene...Atmey:Precisely! That is precisely why I chose NOT to hide last night. I knew that by NOT concealing myself, I would be putting pressure on the thief.Phoenix:(Looks like the thief was the one applying pressure... On your pidgeony head, that is.)Atmey:In any case!Atmey:That's when my nemesis, the infamous Mask☆DeMasque, dancingly descended upon me!PressPhoenix:Phoenix:\"Dancingly descended\"...? From where exactly?Atmey:Well... From the entrance, I suppose. Where else?Phoenix:(So in actuality, he neither \"danced\" nor \"descended\"! ...Someone please save me.) Um... So how is it that you didn't notice the thief?Atmey:My eyes were looking for the thief's shadow while my ears listened for his footfalls. But even so, the dastardly criminal managed to sneak up on me... It can only be due to his subtly camouflaged cape and soft-soled shoes.Phoenix:(... I hereby dub you \"Ace Dunce\".)Atmey:Just as I began to turn, the coward struck a fierce blow upon my noble head!PressPhoenix:Phoenix:You didn't see the criminal's face when that happened?Atmey:...Well, that's difficult part. How should I put it... I saw his mask... That's all that I can recall.Judge:Hmm... That's not very solid as far as testimony goes.Atmey:However... Fortunately I had my third monocle, the security camera, at the ready. It captured his image perfectly... This should be sufficient, I believe?Judge:Hmm, well, as long as this photo is authentic, I don't see a problem here. Well, Mr. Godot? Do you have a problem with the photo? Good. Then let's continue with the testimony.Present DeMasque's BroachPhoenix:Leads to:\"...Mr. Atmey.\"Atmey:Darkness swallowed me before I could land a single strike. When I awoke, he was gone.PressPhoenix:Phoenix:Attacked and knocked unconscious? And you weren't able to do a thing? There's certainly some very impressive detective work.Atmey:Hmph! Well, Sir Lawyer! Have you ever been suddenly struck on the head?Phoenix:Huh!? W-Well.. Actually, yes. By a fire extinguisher.Atmey:And what happened?Phoenix:...I-I was knocked out.Maya:And you lost your memory, too!Atmey:You see? You have no right to look down on me then, do you? The only reason I didn't lose my memory was because I have more brains to begin with.Phoenix:(He may have brains, but the wiring to the self-reflection part seems to be served...)Atmey:In any case, that was how I was knocked senseless. And then...Present DeMasque's BroachPhoenix:Leads to:\"...Mr. Atmey.\"Atmey:Thirty minutes later, I used an emergency phone to notify the police!PressPhoenix:Phoenix:About this \"30 minutes\"...Atmey:My silver cord was loosened and my soul fled to the Golden Halls of Elysium...Maya:As usual, I have no idea what this guy is saying.Phoenix:I think he's saying that he was out cold.Judge:So... What happened during these 30 minutes?Atmey:No one can say, Your Honor... That span of time has truly vanished into the ether!Phoenix:(Just what is he going on about!?)Maya:There's something suspicious about Detective Atmey... How could he not have noticed when the thief came in?Phoenix:Also, he says he was knocked unconscious before he could fight back... But that can't be right. It contradicts the evidence.Maya:Huh? Which piece...?Phoenix:(The real question is... Why would he tell such an obvious lie?)Phoenix:...Mr. Atmey. Could you take a look at this with that special monocle of yours?Atmey:Aha! This belongs to the criminal mastermind, my arch-nemesis, Mask☆DeMasque! It is, in point of fact, Mask☆DeMasque's broach!Phoenix:It was found on the floor of the basement warehouse. I wonder how that happened?Atmey:Ha... Elementary, my dear lawyer. Obviously it wasn't glued on well enough.Phoenix:Not quite. It clearly shows signs of having been ripped off a piece of clothing.Judge:Ripped off...? Aha!Phoenix:...We can only deduce that the thief struggled with someone that night! That's the only thing I can think of. And there's only one person that was in a position to have a struggle with the thief. The only person that was on security duty that night...You, Detective Atmey!Atmey:...Urk!Phoenix:Detective Atmey! You must have fought with the thief that night! (Changed from [Detective Atmey! You must have fought with the thief last night!] in the original release) So, why did you lie in your testimony to the court?Judge:Witness! Giving false testimony is a serious crime!Atmey:Err, I... N-No! W-Wait just a moment, Sir Old-Timer!Judge:Don't talk to me like I'm living in a nursing home!Atmey:Hee hee hee he he he... I just remembered, Your Honor. I was just confused because I've been dealing with so many cases lately.Godot:The true measure of a man is in the amount of work he does. That's what I always say.Maya:Nick, you can only handle one case at a time... Isn't that right?Phoenix:You talk too much.Judge:Witness! So are you now saying that you and the thief fought?Godot:Hold on. That's quite enough... Your Honor.Judge:E-Excuse me...?Godot:Save the big questions for the testimony. That's one of my rules.Atmey:Indeed! I understand! I, Luke Atmey, agree completely!Witness Testimony-- Fight With The Thief --Atmey:Indeed, it's true that I looked away from the door for a brief moment.However... Luke Atmey cannot be so easily discombobulated!Unfortunately, the thief grabbed a weapon from the side and... rendered me senseless.A true gentleman fights only with his own fists... But they were not enough.His first blow struck true! Bam! ...And that's all she wrote.Judge:So in the end, you did catch a glimpse of Mask☆DeMasque?Atmey:Correct. It was during his third crime that he struck me from behind. It seems that my memory has become a tad jumbled, so to speak.Judge:Hmmm... Well, that's certainly understandable. I, myself, always get confused about which testimony goes with which case.Phoenix:(Th-That can't be good...)Cross Examination-- Fight With The Thief --Atmey:Indeed, it's true that I looked away from the door for a brief moment.PressPhoenix:Phoenix:So why did you look away from the door anyway?Atmey:In addition to the camera, I had prepared a variety of other sensors as well. The alarm on one of those had gone off, so I had to check the data. That's why I went to the computer! ...Elegantly, of course!Phoenix:So you were momentarily vulnerable when you were working on the computer? (What should I do? Should I ask some more questions...?)That's enoughPhoenix:(Well, we know for sure that Atmey looked away from the door. I think I should ask about something else now...) Alright. So you looked away from the door. ...And then?Leads back to cross-examinationAbout the sensorPhoenix:What kind of sensors are you talking about?Atmey:There are other places in the basement that someone could enter and exit from. There are air conditioner ducts, sewer pipes... And a cat door as well. I hooked up heat-detecting, infrared and ultra-violet sensors to each of them.Phoenix:That's a lot of hardware... Was it all yours?Atmey:Lordly Tailor Department Store was kind enough to provide the monitoring hardware. Naturally, the security camera that look the photo belongs to them as well.Phoenix:(In other words, he couldn't have rigged the equipment, huh...?)Atmey:Hee hee hee hee hee... Has that cleared up any doubts you had about me, Sir Lawyer?Leads back to cross-examinationAbout the computerPhoenix:So did that computer belong to Lordly Tailor as well?Atmey:Correct. Well, except for the program that manages the data. That was specially designed by me, Luke Atmey!Phoenix:(In that case, he could have easily manipulated the data.)Atmey:Hee hee hee hee hee... What's wrong, Sir Lawyer?Leads back to cross-examinationAtmey:However... Luke Atmey cannot be so easily discombobulated!PressPhoenix:Phoenix:Umm... What does that mean? \"Discombobulated\"?Judge:Hmm... Young people these days... They really irritate me. They allow perfectly good old words to die until everyone forgets what they mean.Phoenix:Sorry, but what exactly DOES it mean anyway?Judge:...Now I've forgotten. What was I saying?Phoenix:(Jeez. It's better than old people who forget what they were saying 5 seconds ago!)Godot:...Well, it looks like we've cleared that up. You can go on with your testimony.Atmey:Unfortunately, the thief grabbed a weapon from the side and... rendered me senseless.PressPhoenix:Phoenix:What do you mean by \"weapon from the side\"?Atmey:Naturally, that thief had no idea that I, Luke Atmey, was hiding in the area! He grabbed the sword from the statue that was standing by the door to the warehouse.Phoenix:Sword...? You mean the sword that was all twisted like a tree branch?Atmey:Correct. Fortunately for me, the blade was not sharp.Phoenix:(OK. so he IS talking about the Shichishito...)Judge:So the thief armed himself with a sword. And what about yourself, witness?Atmey:A true gentleman fights only with his own fists... But they were not enough.PressPhoenix:Phoenix:You had that much faith in your own fighting abilities?Atmey:But of course. In college, I was the 2nd in-charge of the boxing club.Judge:I'm sorry if I fail to find that appropriately impressive.Atmey:However! My opponent in the ring this time was my arch-nemesis, Mask☆DeMasque!Phoenix:(This guy is a real piece of work...)Atmey:His first blow struck true! Bam! ...And that's all she wrote.PressPhoenix:Phoenix:Can you tell us a little more about what happened?Atmey:My opponent was both powerful and vicious. You might say he was... \"powericious\".Phoenix:(\"P-Powericious\"?)Atmey:I assumed the \"Atmey Fighting Stance\", but a sudden flash of light blinded me! That of course was checkmate! My opponent had bested me.Phoenix:(What do I do now? Should I ask more about this...?)Leave itPhoenix:(Well, I guess it's true that Atmey was knocked senseless after all. I'd better ask him about something else instead...)Leads back to cross-examination\"You were blinded\"?Phoenix:So what was this flash of light that blinded you?Atmey:...I was bathed in a golden light that seemed to come from the statue of the woman.Phoenix:(The statue of Ami Fey, I'm guessing...)Maya:Well that wasn't very much help at all...Leads back to cross-examination\"Atmey Fighting Style\"?Phoenix:What is this \"Atmey Fighting Style\"?Atmey:I'm sorry but that's a trade secret... I really can't say any more. But, I suppose I can tell you if I absolutely must. The main thing is to put your back to the wall. That way no one can get behind you.Phoenix:(That's it...? That's the \"Atmey Fighting Style\"?)Judge:Hmmm... Well, Mr. Wright? What about that testimony...?It was a waste of time.Phoenix:(Well, I guess it's true that Atmey was knocked senseless after all. I'd better ask him about something else instead...)Leads back to cross-examinationIt was very important.Phoenix:Of course it's important! We've learned a detective's SECRET technique, after all.Judge:Yes, indeed... I'll remember to use it if I ever take a walk alone late at night.Phoenix:(Why the heck is he eye-balling me like that...? It's creeping me out...)Judge:...Now then, witness! We'll go ahead and add that secret information to your official testimony!Changes statement from \"His first blow struck true! Bam! ...And that's all she wrote.\" to \"I put my back to the wall to fight, but the thief's blow landed upon my third eye.\"Atmey:I put my back to the wall to fight, but the thief's blow landed upon my third eye.PressPhoenix:Phoenix:Umm... Where is this \"third eye\" you're talking about?Atmey:Oh... it's right between my right and left eye brows. ...It's quite invisible to the unenlightened. You may call it the forehead, if you like.Phoenix:(Why didn't you just say that in the first place!?)Atmey:Sir Lawyer! It looks like the creases in your own forehead are getting deeper!Maya:So Mr. Atmey got hit on the forehead then?Phoenix:That's what he says.Maya:Hmm... I've got a funny feeling about that.Phoenix:(Actually, so do I.)Present ShichishitoPhoenix:Leads to:\"Detective Atmey! Your testimony is crumbling like a house of cards.\"Maya:Well what do you think, Nick?Phoenix:Well, there's one thing that I'm absolutely sure of now.Maya:Yeah? What is it!?Phoenix:The Luke Atmey guy... He's definitely hiding something!Maya:B-But why?Phoenix:I think I'm starting to figure out what really happened that night. (...And about the true nature of this \"detective\".)Phoenix:Detective Atmey! Your testimony is crumbling like a house of cards.Atmey:What fun this is, Sir Lawyer! It is truly a pleasure to cross swords with you! And now, once again, you have thrown down the gauntlet at my armored feet...Phoenix:I believe this is what you said yesterday.Atmey:No, the coward must have wormed his way in through somewhere besides the door... Then my arch-nemesis struck me on the head from behind with this gruesome item here!Judge:From behind, huh?Phoenix:But just now you testified that he struck you on the forehead... I hardly think you could forget where you were hit on the head!Atmey:...Urk! It seems... I-I've made another mistake.Phoenix:...Detective Atmey. That's not the only strange part of your testimony.Judge:Wh-What do you mean by that?Phoenix:For example... The very fact that you hid the calling card from the police itself is strange! It's almost as if... You were afraid they were going to help with security!Atmey:U-Urk...! Geniuses such as myself have always been misunderstood! How sad...Phoenix:That's wrong!Godot:Godot:...To err is human, to forgive divine. Humans aren't machines... They have souls, feelings. They live, they die, they love, they hate... And yes, they even make mistakes...Phoenix:Phoenix:Hey, hold on! It-It's not as pretty as that!Godot:Really? What is it like then!?Phoenix:...!Godot:Always chase a riddle down to the end. That's one of my rules.Phoenix:(This is it... This might just be my chance to turn things around!)Judge:...Mr. Wright. What exactly is it that you're asserting?Phoenix:Very well, Your Honor. The defense asserts that...Mr. Atmey is no Ace Detective!Phoenix:The truth is... this witness is no Ace Detective at all!Atmey:...So then what exactly are you saying that I am?Phoenix:Uh, umm... Well, an average detective...?Judge:I hardly see the relevance of that.Maya:Wh-What are you doing, Nick!? Weren't you going to go on the attack?Phoenix:I was planning on it, but it looks I'm the one who got attacked instead.Judge:Think harder next time!Leads back to:\"...Mr. Wright. What exactly is it that you're asserting?\"this Mr. Atmey is a fake!Phoenix:This witness isn't Luke Atmey... He's a fake!Atmey:...So now it's not just Mask☆DeMasque. You're saying I'm a fake, too?Phoenix:An Ace Detective could never be as forgetful as this guy!Godot:Imposters like you are often suspicious of others as well.Judge:Really, this is too much. Next you'll be calling me a fake, too!Leads back to:\"...Mr. Wright. What exactly is it that you're asserting?\"Mr. Atmey is Mask☆DeMasque!Leads to:\"The answer is simple! It's all clear to me now!\"Phoenix:The answer is simple! It's all clear to me now! Detective Luke Atmey's true identity is actually... Mask☆DeMasque!Atmey:Yeeeeaaargggh!Judge:Order! Order in the court! Mr. Wright! What is the meaning of this!?Phoenix:There are too many unnatural parts to Mr. Atmey's story. He says he was \"hiding\" at the crime scenes, which is why no one ever saw him there. And then, in his last case, he manages to outperform Detective Gumshoe and... ...the entire police force to \"miraculously\" retrieve the stolen treasure.Atmey:Th-That's because... I analyzed the crime scene data and made an exquisitely elegant deduction. I picked up clues that the police overlooked in order to arrive at a...Phoenix:Oh, please! The explanation is far simpler than that, \"Detective Atmey\"! The truth is that you are, in fact, Mask☆DeMasque.Atmey:Gurk...!Judge:B-But Mr. Wright! Th-This photo! It clearly shows Mask☆DeMasque! This security camera belongs to Lordly Tailor Department Store! He shouldn't have been able to manipulate it...Phoenix:He didn't need to manipulate it! He gained access to the warehouse under the pretense of providing \"security\"... Then he simply dressed as the \"thief\" and stole the urn.Judge:So... the Ace Detective is actually an Ace Thief! Is this true, witness!?Atmey:... Aha... Hee hee hee ha ha ha Aha ha ha ha ha ha ha! Ho ho ho hee hee hee! DeMasque's M. O. is pure genius! And so am I, Luke Atmey, Ace Detective!! You're very clever to have come to such a conclusion! I am impressed, Sir Lawyer!Judge:Wh-Whaaaaat!? Witness! You... You're admitting it!?Maya:N-Nick! Now's your chance!Phoenix:Yes! Time to put the last nail in this guy's coffin! Detective Atmey! When you assumed the thief's identity--Godot:Godot:Godot Blend #102... ...My personal favorite.Judge:M-Mr. Godot!Godot:\"The Ace Detective is actually an Ace Thief!\" I smell a best-selling novel! There's only one problem... It simply isn't true.Judge:B-But Mr. Godot! Mr. Wright has made some very strong points and I...Godot:I will admit my opponent has woven a compelling narrative out of whole cloth. But it is, in fact, nothing more than a patchwork quilt. Mr. Trite... If this detective really is the thief, then show us the proof of your claim. But it had better be as hot... and as perfect as the coffee dripping down your face!Judge:Well, Mr. Wright!? Don't just stand there! This court would like to see this decisive proof you have! Quickly!Phoenix:Huh!? Oh! Y-Yes, of course! (Wh-What's the big rush...?)Maya:Are you alright, Nick?Phoenix:(Atmey looks pretty rattled right now... I'd like to finish this right now if I can. But can I really do it?) The decisive evidence that proves Mr. Luke Atmey is in fact Mask☆DeMasque...is right here!Phoenix:As usual, the defense comes prepared, Your Honor!Judge:Very well then... Let's see what you've got. Please present proof that Mask☆DeMasque is actually Mr. Luke Atmey!Present anythingPhoenix:Phoenix:Here's your proof!Judge:What do you think, Mr. Godot?Godot:It looks to me like Mr. Trite is still a mite sleepy. Perhaps he'd like a big mug of my special Godot blend? Well?Phoenix:N-No thanks, I'm fine! Really! (What do I do now? Another mistake like that and I'm through! Without some decisive evidence, I could be risking everything...)I've got all I need.Leads back to:\"As usual, the defense comes prepared, Your Honor!\"I don't have a thing.Leads to:\"Proof? Of course I... I... ...I've got nothing.\"has yet to be found!Leads to:\"Proof? Of course I... I... ...I've got nothing.\"Phoenix:Proof? Of course I... I... ...I've got nothing.Godot:Ha...! Just what I thought. A man has to told his head up high no matter how bad things get, after all.Phoenix:Uuugh...Judge:I see... I thought perhaps you had some evidence to back up your assertion...Phoenix:(This is no good! I've got to stay on the attack! I'll never get another chance to prove that this guy is the thief!)Maya:Don't give up, Nick! Think harder and try again!Phoenix:It's no good... I'm just not ready yet...Maya:B-But... Are you going to just give up and let us lose this?Atmey:So, you've come to your senses, have you, Sir Lawyer?Phoenix:I... Unnngh... (Argh! I can't think of a counter-attack at all...)Judge:It seems the cloud of suspicion surrounding this witness has lifted. Mr. Godot. If you have anything further to add, then--???:Judge:Wh... Wh-Who... ...Who are you?Desirée:That doesn't really matter right now, does it?Phoenix:Ms. DeLite! What are you doing here?Desirée:Nicky boy! The thing you've been looking for... I think I found it!Judge:You mean... that bag!?Desirée:No, not the bag! What's in the bag! ...Well?Judge:Th-That's...Maya:The Sacred Urn!! Nick! It's the urn!Judge:Order! Order! Order! ...You! Madame...! That urn... Where did you find it!?Desirée:You'll never believe it... It was in the office of Mr. Fancy Pants Ace Detective! ...Luke Atmey!Ron:Oh, Dessie! You're the best!Sacred Urn updated in the Court Record.Phoenix:Well? How do you explain that one, Mr. Atmey!?Atmey:...Phoenix:Even you are going to have a hard time weaseling out of this one!Godot:Godot:Ha...! Pathetic...Judge:Mr. Godot...? Do you have something you wish to say?Godot:Yes, Your Honor... It simply amazes me how quickly times change... In the old days, a man was to be taken at his word. It's truly sad...Judge:You're still denying that Mr. Atmey was involved!?Godot:Before casting aspersions at Detective Atmey, consider the young lady here. Your name is Desirée... Desirée DeLite. Is that correct?Desirée:Y-Yes! What about it?Godot:Ha...! How charming... The lengths that a woman is willing to go to save her husband is truly inspiring.Desirée:Wh-What are you insinuating!?Godot:As the wife of the criminal, you could have \"discovered\" that stolen urn anywhere. Including the office of the good detective here. So you found the urn. What does that prove? It certainly doesn't prove where the urn was before you \"found\" it.Desirée:What...? I just brought it here from the detective's office!Godot:Please Madame... This town is already filled to the brim with lies. Any more could only compound the tragedy we have been witness to.Desirée:You're wrong! I would never...! I would never do such a thing!Phoenix:Ms. DeLite...Desirée:Please, Nicky boy! You've got to help me talk some sense into these people!Phoenix:(There must be some way! I've got to prove that urn was actually in the Atmey Detective Agency...)Testify about what I sawPhoenix:...Godot:What's wrong? Isn't it your job to come up with something to say...?Maya:Nick! Come on! It should be easy to prove! After all, we checked out that bag, didn't we?Phoenix:You're right. I remember doing that. Whatever was in there, it was hard and round... And smooth, too.Maya:Yes! It must have been the urn! It must have!Phoenix:But... I never actually saw it with my own eyes.Maya:...?Phoenix:Atmey walked in just when I was about to have a look at it... So even if it was the urn in there, I can't testify that it was.Maya:Ack! You're right!!Godot:Ha...! It looks like I was wrong about you, Mr. Trite. In this town overflowing with lies, there's still a single flickering candle of truth.Desirée:Nicky boy...!Phoenix:(Well, it's true that I never actually saw the urn... But maybe I can still testify about it from another angle!)Judge:What about it, Mr. Wright? Have you given up yet...?Leads back to:\"There must be some way!\"Show fingerprints on the urnPhoenix:I can prove where the urn was... ...by the fingerprints on it!Judge:Fingerprints, eh...Atmey:Oh come now! Now you're really making me laugh, Sir Lawyer! Fingerprints indeed!Phoenix:...Atmey:May I go on? Good. Now it would be perfectly understandable if my fingerprints were on the urn. After all, it was I who was guarding the urn in the first place! In any case, I am always in the habit of wearing gloves as you can see. So unfortunately, my fingerprints wouldn't be evidence of anything.Judge:What about it, Mr. Wright? This witness's fingerprints would mean nothing anyway.Maya:N-Nick, what are you going to do now?Phoenix:(I've come too far to turn back now! Atmey must have brought the urn back to his office yesterday... And there, I'm sure someone must have left their fingerprints on it...!) The defense proposes that the fingerprints of this person should be on the urn!Present Phoenix Wright profilePhoenix:Leads to:\"So what is all this fuss about fingerprints anyway...?\"Present anything elsePhoenix:Godot:Let me give you an important piece of advice. The one who keeps a cool head all the way until the game's end is the winner.Judge:Let me give you an even more important piece of advice, Mr. Wright... You are not going to win this game with that answer.Maya:Wow... Even the judge is making cool, snappy remarks now...Phoenix:(D-Does that mean I was wrong again? Hmm... The urn was put in that bag and carried to the detective's office yesterday. That means the person I should be fingering is... the person who left their prints on the urn yesterday at the Atmey Detective Agency!)Maya:Do you really think there's someone that could fit the bill?Name another personJudge:Well, Mr. Wright? What have you decided?Phoenix:Your Honor! Please give me just one more chance!Leads back to:\"The defense proposes that the fingerprints of this person should be on the urn!\"Think it over againJudge:Well, Mr. Wright? What have you decided to do?Phoenix:Forgive me, Your Honor. I've decided to think the whole thing over again.Leads back to:\"There must be some way!\"I can't prove anything yetPhoenix:I can't prove anything yet.Maya:But Nick!Judge:Very well... It looks like that's all then.Godot:Exactly... And this urn is all the proof I need to make my case...Phoenix:What?Godot:You still don't get it, huh? Listen closely, Mr. Trite. This is the urn that Mask☆DeMasque stole, right? Now the wife of the accused comes strolling in here with the very same urn, correct? Now, who would you think is the thief?Phoenix:Ah...!Desirée:No! That's wrong! That's not why I've got it...Maya:N-Nick! Y-You can't let him do this...Phoenix:(Hmm, this isn't good... There has to be another way around this...) Your Honor! Please let me think it over one more time!Judge:Mr. Wright. It's high time that you learn your lesson. The courtroom is no place for poorly thought-out or rash declarations!Phoenix:(I have to be careful... He won't be so nice next time...)Leads back to:\"There must be some way!\"Atmey:So what is all this fuss about fingerprints anyway...?Phoenix:Mr. Atmey... Do you recall the events of yesterday?Maya:Hey, Nick! Come on! Open it up!Phoenix:Hey! Wait a minute! We can't just open his private property!Maya:Don't be such a fuddy-duddy! This is an important investigation! Well? What's in there?Phoenix:H-Hang on a sec. I'm taking it out now... (Whatever it is, it feels... kinda hard... and smooth...)Atmey:...Well, hello there!!Phoenix:It's true that I didn't get a chance to look in the bag at that time. But! I did touch what was inside.Atmey:Wh-What!? Y-You touched it...?Phoenix:And I remember it very well. It was \"smooth and hard\".Atmey:W-Well, err... Th-That was just...Phoenix:Your Honor! I'd like the court to examine the fingerprints on that urn. If my fingerprints are on there... Then it proves that the urn was in Detective Atmey's office!Godot:Godot:Well, even if your fingerprints are on the urn... ...it still doesn't prove when they were put there, does it?Phoenix:Of course it does.Godot:Wh-What did you just say!?Phoenix:It's not what I say, it's what Adrian Andrews, the person in charge of the exhibition said. (Changed from [Not what I said, it's what Adrian Andrews, the person in charge of the exhibition said.] in the original release)Andrews:I polished it until it was just about glowing... I thought maybe I could make it looks more valuable!Phoenix:If she polished it that much, she must have removed any and all fingerprints on it. And the only chance I had to get my fingerprints on it after that was... Yesterday! At the Atmey Detective Agency!Godot:Ha...! This blend... Godot Blend #107... I've decided... It's a little too bitter after all!Judge:Order! Order! Order! I accept the defense's request! Bailiff! Take this urn and...Atmey:Wait! Wait a moment, Your Honor! ...There's no need for that.Judge:N-No need you say...?Atmey:Precisely... I already know Mr. Wright's fingerprints are on the urn...Judge:Wh-What are you saying!Phoenix:(Yes! I've finally broken him down!)Atmey:Hee hee hee ha ha ha Aha ha ha ha ha ha ha! Ho ho ho hee hee! Take a good look, everyone! Unable to find a rival worthy of my genius, I was forced to create one by myself! Here I am! The tragic clown...Maya:This guy is nuttier than a fruitcake...Atmey:You see! It was me all along! I am the one and only Mask☆DeMasque! Ha ha! I hope you all enjoyed my little performance! Hee hee hee ha ha ha Aha ha ha ha ha ha ha! Ho ho ho hee hee hee!Judge:Well, Mr. Godot... What's Mr. Atmey's condition?Godot:He's still in the lobby, laughing insanely, Your Honor. I wish I could enjoy the joke as much as he seems to be.Judge:Well, it looks like the matter has been settled. I came perilously close to besmirching the record of an innocent young man. Besmirching him with the title of \"thief\"!Maya:Nick, you were right after all!Phoenix:(Yeah! I guess Mr. DeLite really wasn't the thief!)Judge:The court finds the defendant, Mr. Ron DeLite...???:Ron:You're wrong! Wrong I tell you! Err, umm, I mean... Not exactly wrong so much, but actually not right is what I really trying to sayPhoenix:(Oh no... He's not... This can't be happening...)Ron:The thief... The sneaky, odious thief who's been stealing all the treasures... It's me! I'm him! I'm the one you want! I'm the thief I tell you! So do it...! Pronounce me guilty! Pleeeease!!Phoenix:...Godot:...............Judge:I don't know what kind of a kangaroo court you all think this is, but...Phoenix:Phoenix:The true identity of the thief has already been proven! Please hurry and pass judg--Ron:What are you talking about!? I already confessed! I'm the thief I tell you!Judge:...Mr. Godot! Don't just stand there drinking coffee!Godot:Ha...! Hey there, Mr. Thief...Ron:Y-Yes! Yes, sir!?Godot:If you're really a man, then clean up your own mess.Ron:I-I'm sorry... I'm afraid I just don't have any idea what do you mean.Godot:If you are Mask☆DeMasque... then prove it. That's what it means.Ron:Y-Yes, sir! I'll be happy to!Maya:He says he'll be happy to, Nick...Phoenix:It's kinda cute... He's 100% committed to his fantasy.Godot:Good boy! Just remember one thing. A boy only gets one chance in his life to become a man!Ron:I-I know that! I-I won't fail! I swear!Godot:OK, then... Talk! ...We're all listening.Judge:Oh well... Let's all have a listen to this \"confession\"...Witness Testimony-- Mask☆DeMasque's Identity --Ron:The truth is, I've been Mask☆DeMasque all along!I mean, you can't prove that I'm not actually Mask☆DeMasque, can you?I don't have an alibi for the night the urn was stolen, after all!I donned my costume that night and dancingly descended upon the scene of the crime!Look! You can see right there in the photo! That's me!As for my broach, I snagged it on the door handle and it got torn off, that's all!Judge:Hmm... I don't like the direction this trial has taken...Phoenix:(But this is how every trial goes... At least with me, anyway...)Godot:Ha...! You're doing great!Ron:Hee hee hee... Stop it, Mr. Godot... You're embarrassing me.Godot:Like I said, you're only going to get one chance to testify, alright? But if you make it through this with flying colors, I'll keep my promise, too. I'll make sure you stay locked up in prison as the one and only true Mask☆DeMasque!Ron:Thanks so much, Mr. Godot! I... I'll do my best!Judge:Alright, Mr. Wright. I'm afraid it's time for the cross-examination.Phoenix:*sigh*Cross Examination-- Mask☆DeMasque's Identity --Ron:The truth is, I've been Mask☆DeMasque all along!PressPhoenix:Phoenix:You may think you're real Mask☆DeMasque... but your wife thinks you're delusional.Ron:I haven't told Dessie yet... About my true identity, I mean... Believe me, I've got my reasons.Phoenix:(With the way your room is decked out, how could she NOT know about it...?)Judge:Hmm... Even thieves have complicated family situations, I suppose.Phoenix:(What should I do? It sounds like we're about to get sidetracked... again.)Press harderPhoenix:So why are you withholding the truth from your wife?Ron:Well... first of all, I don't think she'd believe me anyway... And second... If there's one thing that Dessie absolutely detests... ...it's criminals.Judge:If that's the case, then why did you ever start thieving to begin with?Ron:Well, Dessie is crazy about shopping. She's a real shopaholic... But she's the love of my life, Your Honor. I guess you could say I'm a \"Dessie-aholic\"...Judge:Hmm... So you do have a complicated family situation after all.Phoenix:...Alright, that's enough. Please continue with your testimony. I beg of you.Leads back to cross-examinationLeave itPhoenix:(There's no point in digging through any more of their dirty laundry...) Well, why don't you continue with your testimony for now.Leads back to cross-examinationRon:I mean, you can't prove that I'm not actually Mask☆DeMasque, can you?PressPhoenix:Phoenix:Umm... I thought you were going to be the one to show US the proof. You know, that you're the real Mask☆DeMasque and not just some kind of obsessed fanboy.Ron:Hey now, that's not fair. Why do I have to do all the hard work anywaaaaay!?Phoenix:(Maybe because you're the one making the outrageous claim... for a change.)Maya:Come on, Nick! You know that Mr. DeLite couldn't have committed the crime! You're the one with the fancy law degree! It's time to put it to work already!Phoenix:I need some kind of proof that Ron couldn't possibly be Mask☆DeMasque...Maya:Well, I guess if you had that kind of proof, we wouldn't still be here, would we...?Phoenix:(For the time being, maybe I need to shift strategy... I should try to show that Mr. DeLite couldn't have stolen the urn.)Ron:Anyway, I...Present Ron's Wallet or Key CardPhoenix:Leads to:\"Mr. DeLite. This wallet belongs to you, correct?\"Ron:I don't have an alibi for the night the urn was stolen, after all!PressPhoenix:Phoenix:You've got no alibi...?Judge:I've been a judge for a long time... And this is the first time I've ever heard a defendant brag about having no alibi.Ron:But I tell you I was in Lordly Tailor that night! ...Errr, no. That's too vague, even for me. To be more precise, I was down in the basement warehouse.Phoenix:(Hold on...)Maya:What is it, Nick?Phoenix:Where was Ron DeLite when the crime happened anyway...? If we can prove he had an alibi after all, this case will be a piece of cake.Maya:W-Well, you're right, but...Godot:Ha...! You think you can prove that? Wake up and smell the coffee!Phoenix:W-Well, I think maybe I can...Judge:Mr. Wright, do you have any evidence that shows the defendant has an alibi?No, I have no evidence.Phoenix:Of course not! Don't be ridiculous!Judge:I-I'm sorry! ...Say! What am I apologizing for!? You! Witness! Hurry up with your testimony already!Ron:I-I'm sorry! ...Why is it that I'm always the one that has to apologize to everyone in the end.Leads back to cross-examinationYes, I have evidence.Phoenix:I have the evidence! Or do you think I'm still some sort of third-rate rookie!?Judge:Oh...! I-I've never seen you this angry before!Godot:...I'm not surprised. Anger is the last refuge of the pathetic.Phoenix:(I thought I was more confident than angry...)Judge:Well then, let's see this evidence already. Show to this court evidence that proves where your client was on the night of the crime!Present Ron's Wallet or Key CardPhoenix:Leads to:\"Mr. DeLite. This wallet belongs to you, correct?\"Present anything elsePhoenix:Phoenix:Here's the evidence!Godot:Ha...! It looks like I was right. ...Mr. Trite. The more pathetic a man is, the more likely he is to start pointing fingers!Phoenix:For some reason, the good Prosecutor really wants to prove that I'm \"pathetic\"...Judge:That's because you are pathetic! And so is your \"evidence\"!Phoenix:(Oops. I guess I was wrong... Again.)Ron:Aha! I told you I didn't have an alibi!Leads back to cross-examinationPresent Ron's Wallet or Key CardPhoenix:Leads to:\"Mr. DeLite. This wallet belongs to you, correct?\"Ron:I donned my costume that night and dancingly descended upon the scene of the crime!PressPhoenix:Phoenix:\"Dancingly descended\"...? From where exactly?Ron:Well... From the entrance, I suppose. Where else?Phoenix:(So in actuality, he neither \"danced\" nor \"descended\"! ...Someone save me. Again.)Maya:I guess he thinks \"descended\" sounds more heroic or thief-like or something.Ron:A-Anyway! I was there at the crime scene! Just like I said!Ron:Look! You can see right there in the photo! That's me!PressPhoenix:Phoenix:This is the photo that was taken by the security camera at the crime scene...Judge:No doubt about it. That's Mask☆DeMasque.Phoenix:Yes, but don't forget there's something important missing. The real Mask☆DeMasque has a big broach on his chest!Ron:As for my broach, I snagged it on the door handle and it got torn off, that's all!PressPhoenix:Phoenix:You didn't notice it when your broach was torn off?Ron:Huh!? W-Well... I'm always a little nervous when I'm working.Phoenix:(There's a bit of clothing left on the back side of the broach. I don't think it could have been torn off that easily...)Maya:Yes, but... I don't see what that has to do with anything. Right now we're trying to prove that Mr. DeLite isn't the thief, right?Phoenix:Yeah, I guess so. (Let me hear that testimony one more time.)Maya:Why does Mr. DeLite want to be Mask☆DeMasque so badly anyway? It's kinda disturbing. He doesn't seem like your typical attention whore to me. Unlike, say... you, Nick.Phoenix:I am nothing of the sort, thank you very much. (But I gotta admit it is kinda scary the way Ron acts...)Maya:Anyway... Time to poke some holes in that testimony of his!Phoenix:Mr. DeLite. This wallet belongs to you, correct?Ron:Ah! Y-Yes. It-It does. I-I had lost it somewhere!Judge:Mr. Wright! When you find a wallet, you should report it to the police right away!Phoenix:Ah! No! You don't understand. This is an important piece of evidence.Judge:\"Evidence\"...?Phoenix:Mr. DeLite... When did you first notice that you'd lost your wallet?Ron:Err, let's see... I think it was on the night of the crime... But I know I still had it when Dessie and I went out for dinner.Phoenix:This wallet was found at approximately 1:00 AM at KB Security headquarters.Judge:What...!? Surely you're not serious!?Phoenix:Yes... I am serious. This proves that Mr. DeLite was, in fact, at KB Security that night!Ron:Noooooo!Phoenix:So if the defendant was at KB Security at 1 o'clock in the morning... ...then that proves that he has a watertight alibi!Ron:Noooooo!Phoenix:Furthermore, considering the distance between Lordly Tailor and KB Security... ...it would have taken 30 minutes to get there by car! (According to Larry anyway...)Judge:Well, Mr. Godot!? Do you have anything to say? And stop drinking that coffee!Godot:...Come on, Mr. Thief. Don't let this guy beat you! Tell him why he's wrong!Ron:You're the only one who calls me \"thief\", Mr. Godot... ...Alright, I'll try! I-I'll do it! I will!Maya:...He's really got Mr. DeLite all worked up...Phoenix:Yeah, he's like a kid at his first day of school...Ron:Look, it's just ridiculous! Why would I have dropped my wallet at KB Security!? Someone must have planted it there to make it LOOK like I was there and not at the heist.Maya:\"Planted it there\"? He's really reaching now...Phoenix:Mr. DeLite. You probably dropped your wallet when you took it out to use this, didn't you? The key card to KB Security's CEO's office.Ron:Noooo!Godot:Ha...! That was a pretty good try, Mr. Trite... Unfortunately, you've overlooked one small thing.Phoenix:Wh-What...?Godot:\"Motive\" of course! Why would this thief go to KB Security in the middle of the night anyway!?Judge:Hmm... Well, Mr. Wright? It looks like you need some more evidence after all.Phoenix:(Grrr! This stupid kid...!)Judge:Now then. Let's see your evidence. The evidence that shows why Mr. DeLite went to KB Security at 1 AM that night!Present Blackmail LetterPhoenix:Leads to:\"Mr. DeLite... I believe you've seen this before, correct?\"Present anything elsePhoenix:Phoenix:Here is your evidence!Ron:...What is this supposed to mean, Mr. Wright?Phoenix:Huh!? Well, um... Don't you know?Ron:Mr. Wright... If you're a real man, you should clean up your own mess.Phoenix:Doh...! (For some reason, it bothers me more when HE says it!)Leads back to:\"Now then. Let's see your evidence.\"Phoenix:Mr. DeLite... I believe you've seen this before, correct?Ron:Ah...! Th-That's...!Judge:What is it?Phoenix:A blackmail letter. That's what it looks like from the contents.Godot:B-Blackmail...?Phoenix:Yes, basically it says, \"bring $50,000 dollars\". [sic]Judge:Hmm... That certainly sounds like blackmail alright...Phoenix:At the time of the theft, Mr. DeLite was dealing with the blackmailer himself... ...in KB Security's CEO office, a full half an hour away from the scene of the crime!Godot:...Ungh... Urk... No No No No No NOOOOOOOOOOOOOOOOOOOOO!Judge:Order! Order! OOOOORDER!! So when the theft of the urn occurred, the defendant was at KB Security... It looks like a perfect case for the defense!Godot:Godot:...You may see it as a perfect case, Judge, but to me... Well, let's just say that my Godot Blend #107 impresses me a lot more.Phoenix:Wh-What are you trying to say?Godot:You say the thief was being blackmailed by the CEO of a security company... But... Did you actually investigate this CEO at all?Phoenix:Huh!? Well, umm... No... I guess not.Godot:Accusing a man of blackmail with no proof? I'm not sure what I think of that...Phoenix:(\"Not sure what I think of that\"...? At least I know what I think of you...)Judge:Hmm... Good point. I'm not sure what I think of it myself... You claim that the defendant entered the CEO's office... ...but you will need at least one witness to corroborate your claim, Mr. Wright.Maya:Nick! I think we're going to have to track down the CEO guy...Phoenix:No, we don't have to track down the CEO at all.Godot:What do you mean by that, Mr. Trite?Phoenix:There is someone else who can testify. This is the person who can testify that the key card was used at 1 AM that night!Present Larry Butz profilePhoenix:Leads to:\"Wh-Who is this useless-looking young man?\"Present anything elsePhoenix:Godot:Ha...! That's the first time one of your jokes actually made me truly laugh.Phoenix:(Umm, I haven't actually made any jokes... Not intentionally anyway...)Judge:Well, perhaps you find it funny, but I fail to see any humor in it!Phoenix:(The problem is the key card that was in Ron's wallet... Somehow I need to prove that the card was used at 1 o'clock in the morning.)Leads back to:\"There is someone else who can testify.\"Judge:Wh-Who is this useless-looking young man?Phoenix:You don't remember him, Your Honor?Judge:Hmmmm... Not exactly... But just looking at his picture makes the bile start to rise in my throat.Maya:It looks like he doesn't remember the case from 2 years ago...Phoenix:He probably blocked out that memory on purpose. Anyway, this man was working as a guard at KB Security that night.Godot:Oh...?Phoenix:The question at hand is this key card.Butz:Yup. That's the key card they use at the building I work in. According to the serial number, this one is for the CEO's office. You need it to get into that room, and every time you use that card, it leaves a record.Judge:Hmm...Phoenix:As you can see, there's no need to investigate the CEO of KB Security! We should be able to discover the truth simply by analyzing this key card's data!Godot:Bwaaaah...!Judge:Well, Mr. Godot?Godot:The name of the CEO of KB Security is Kane Bullard. I was unable to contact him directly, but... I got the key card data. ...Here.Judge:S-So what does it show!?Godot:Each key card has its own serial number and they leave detailed records of their use. According to this data... this card was used at 1 AM on the morning of the crime.Key Card updated in the Court Record.Judge:But that means... it can't be Mr. DeLite dressed as Mask☆DeMasque in this photo!Godot:Ha...! It looks like you're right. Two minutes isn't even enough time to brew a good cup o' Joe...Phoenix:So... So then...!Godot:Ron DeLite was clearly in the office of KB Security's CEO at the time of the crime. ...The prosecutor's office is ready to admit that fact. Therefore, it's impossible for the defendant to be Mask☆DeMasque.Maya:Good job! You did it, Nick!Judge:...That's enough! I came perilously close to besmirching the record of an innocent young man. Besmirching him with the title of \"thief\"! ...Phoenix:Wh-What's wrong, Your Honor?Judge:I'm ready to pass judgement... But before I do that, do you have any further objections?Phoenix:No, Your Honor!Godot:Hrpmh...!Ron:Unnnggh...Judge:...Very well. The court finds the defendant, Mr. Ron DeLite...Not GuiltyJudge:Court is now adjourned! (Changed from [This court is adjourned!] in the original release)October 13, 2:24 PMDistrict CourtDefendant Lobby No. 4Maya:Nick! You did it! You were right after all! Actually... I'm a little bit ashamed of myself.Desirée:Nicky boy!Phoenix:Oh! Ms. DeLite...!Desirée:I knew you could do it! I believed in you all along, Nicky boy! ...I don't know how I can ever repay you.Phoenix:Aww... Shucks... Thanks, Ms. DeLite. (I just know I'm blushing...)Pearl:Congratulations, Mr. Nick!Phoenix:Oh! P-Pearls...! (I've got a bad feeling about this...)Pearl:*gasp!* Wh-Who is this woman!Phoenix:Oh, she... She's nobody... She's just ahh...Pearl:You're blushing! How dare you do this in front of Mystic Maya! You should be ashamed of yourself!Phoenix:(Yeowch! She slapped me...)Maya:Umm, Pearly... This woman is Ms. Desirée DeLite. She's our client's wife.Pearl:*gasp!* Mr. Nick!Phoenix:Y-Yes!?Pearl:You're even worse than I thought! Going behind the back of your own client...!Phoenix:N-N-No! You've got it all wrong!Pearl:I'll never forgive you!Phoenix:(Owww... A double slap...)Maya:Well, anyway, All's well that ends well, right? We got the Sacred Urn back and the thief has been caught!Desirée:You're so right! And it's all thanks to Nicky boy here!Maya:But actually it was you, Ms. DeLite, that brought us our urn back! Thank you from the bottom of my heart!Desirée:Oh, please... You're embarrassing me!Phoenix:(If we won the case... ...then why does this guy still look so glum...?)Ron:Ugggh... But I am the thief... Actually, what's the point nowDesirée:...What is it, honey? I did my best for you, Ronnie!Ron:I-I know that and I appreciate it, Dessie... But the thing is...Godot:Come on... Give the kid some time. He's just got a little touch of the blues. You know about feeling blue, right, amigo?Phoenix:M-Mr. Godot! What are you doing here!?Godot:Oh come on! I just came here to say thanks to my newest buddy... ...You, Mr. Trite.Phoenix:(Maybe you should learn my name before you call me \"buddy\"...)Godot:Well, playtime is over.Phoenix:Huh...?Godot:Early this morning... the body of Kane Bullard was discovered.Maya:Kane Bullard...? Where have I heard that name before?Desirée:Isn't that... the name of the CEO of KB Security?Maya:Wait. B-Body...!? (Changed from [B-Body...?] in the original release)Godot:The estimated time of death was 1 AM on October 12th.Phoenix:1 AM on October 12th...? Y-You don't mean!?Godot:...That's right, amigo. At the same time that a cheap little urn was being stolen... ...the CEO of KB Security was being murdered.Phoenix:S-So then... What are you doing here?Godot:Oh come on. You've figured it out already, haven't you amigo? Or... Have you already forgotten about that piece of info I helped you out with today?Phoenix:(\"Helped me out\"? What!?)Godot:On October 12th, at 1 o'clock in the morning... Ron DeLite was in the CEO's office... ...The scene of the murder. After getting that blackmail letter, he must have been imbrued with utter rage.Maya:Wh-What are you saying!? Imbrued with rage...?Godot:Come on! Don't tell me you didn't know! (Changed from [Come on! Don't tell me you didn't know it!] in the original release) Ron DeLite was once an employee of KB Security... He was a professional security guard.Phoenix:(An employee of KB Security!?)Godot:It looks like the alibi that saved him from being convicted as a thief... ...is going to be the noose that gets him hanged. Kind of an \"anti-alibi\".Maya:No way...Godot:He can't be the thief because he was at the murder scene when the murder occurred!Desirée:N-No! Th-That's a lie! It can't be true!Ron:Oh! Ohhhh! B-But I... I am a thief I tell you!Godot:Ron DeLite. You're going back to prison again. This time the charge is much more serious. This time you'll be tried for murder.Phoenix:Wh-What!? This can't... This is impossible!Godot:I'm looking forward to another exciting showdown, Mr. Trite!Phoenix:...!Godot:You and I aren't through with each other yet. Surely you won't back down from a challenge! You've never been a coward!Pearl:Mr. Nick! Is there something personal between you two...?Godot:I've returned from the depths of Hell to do battle with you. ...At least let me have some fun while I'm here!Phoenix:(This guy... Who the heck is he!? He may be quiet... But he's the most dangerous enemy I've ever faced...)Godot:Well then... Time to say goodbye to Mr. DeLite.Phoenix:...Maya:N-Nick...! How could this be happening?Phoenix:Right in front of our every eyes, our client has been arrested for murder. And the one who established his presence at the scene... was me.Desirée:EEEEEYYYAAAAHHH! R-RONNNIEEEEEEEE!Phoenix:(Arrested for murder on the very same day he's declared innocent of larceny... What the heck's going to happen next!?)To be continued.Presenting wrong evidence during testimonyPhoenix:Phoenix:Your Honor! What do you think about the witness's statement?Judge:Uh... I'm not sure I follow you.Phoenix:It clearly, er, contradicts the... um... I thought...Judge:You don't sound very sure, Mr. Wright. Objection overruled.Phoenix:(I don't think that won me any points with the judge...)Presenting wrong evidence during testimonyPhoenix:Phoenix:Your Honor! That statement contradicts this evidence!Judge:...? It does? I don't see anything contradictory...Phoenix:Huh? Really?Judge:Objection overruled. Try to think before you make accusations, Mr. Wright!Phoenix:(Whoops! That didn't go so well.)Presenting wrong evidence during testimonyPhoenix:Phoenix:This evidence clearly reveals the contradiction in that statement, Your Honor!Judge:How exactly are the evidence and the statement just now related?Phoenix:They aren't, are they...Judge:Not at all. Mr. Wright, please think the facts over before making accusations.Phoenix:(I don't think that won me any points with the judge...)Presenting wrong evidence during testimonyPhoenix:Phoenix:The witness's statement is clearly faulty, Your Honor!Judge:... I'm sorry, but I can see nothing faulty. Unfortunately, I will have to penalize you, Mr. Wright.Phoenix:(Ugh, I must be on the wrong track...?)Too many penaltiesJudge:That's enough! This court sees no reason to further prolong the trial. Nor is there any need for more time to decide the case against the defendant. This case is extremely clear. I see no room for mis-interpretation of the facts. This court finds the defendant, Ron DeLite...GuiltyJudge:The accused will surrender to the court immediately... ...to be held pending trial at a higher court within a month from today's date. That is all. This court is adjourned!",
  "characters": [
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Phoenix Wright",
      "age": "26",
      "gender": "Male",
      "description1": "Me. What more can I say? This is my third year as a young (but skilled!) lawyer."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Mia Fey",
      "age": "deceased",
      "gender": "Female",
      "description1": "Maya's older sister and my eternal mentor in life and law. Passed away 2 years ago."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Maya Fey",
      "age": "19",
      "gender": "Female",
      "description1": "My assistant and a disciple in the Kurain Tradition of spirit channeling."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Pearl Fey",
      "age": "9",
      "gender": "Female",
      "description1": "Maya's cousin, and channeling prodigy. She has amazingly powerful spiritual abilities."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Adrian Andrews",
      "age": "24",
      "gender": "Female",
      "description1": "Head of planning, promotion, and security of the Treasures of Kurain Exhibit."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Dick Gumshoe",
      "age": "32",
      "gender": "Male",
      "description1": "Homicide detective at the local precinct. In charge of the initial investigation."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Mask☆DeMasque",
      "age": "???",
      "gender": "?",
      "description1": "A flashy thief who steals valuable works of art. Sends a calling card before a heist."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Luke Atmey",
      "age": "34",
      "gender": "Male",
      "description1": "An Ace Detective. Has great powers of deduction, yet rarely makes sense.",
      "description2": "An Ace Detective. Has acknowledged that he is in fact Mask☆DeMasque."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Ron DeLite",
      "age": "23",
      "gender": "Male",
      "description1": "A young man who turned himself in as Mask☆DeMasque. A bit of a pitiful guy.",
      "description2": "Claims he is Mask☆DeMasque. Used to work as a guard for KB Security."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Desirée DeLite",
      "age": "23",
      "gender": "Female",
      "description1": "Ron DeLite's wife. Seems to be a very friendly and out-going lady.",
      "description2": "Ron DeLite's wife. Hates criminals and cowards more than anything."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Larry Butz",
      "age": "25",
      "gender": "Male",
      "description1": "My friend. I've known this trouble magnet ever since grade school.",
      "description2": "My friend. Picked up Ron DeLite's wallet while working on the night of the crime."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Godot",
      "age": "???",
      "gender": "Male",
      "description1": "A prosecutor who is shrouded in mystery. He seems to know me somehow."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Kane Bullard",
      "age": "48",
      "gender": "Male",
      "description1": "CEO of KB Security. His body was found inside his safe."
    }
  ],
  "evidences": [
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "It's my all-important badge. It shows that I am a defense attorney."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Maya's Magatama",
      "type": "Other",
      "obtained": "Received from Maya Fey.",
      "description1": "A present from Maya. It reacts to people who have secrets in their hearts."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Treasure Exhibit Poster",
      "type": "Other",
      "obtained": "Received from Maya Fey.",
      "description1": "A poster for the Treasures of Kurain exhibit. Click here for details."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Ami Fey's Golden Statue",
      "type": "Other",
      "obtained": "Obtained in Lordly Tailor's Basement Warehouse.",
      "description1": "A statue of the founder of the Kurain Channeling Technique. Is holding the Shichishito.",
      "description2": "A statue of the founder of the Kurain Channeling Technique. Moved the night of the crime.",
      "description3": "Carried into the basement warehouse the day of the crime. Moved again that night."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Sacred Urn",
      "type": "Other → Evidence",
      "obtained": "Received from Maya Fey.  → Submitted as evidence by Desirée DeLite.",
      "description1": "One of the treasures of Kurain Village. Supposedly priceless, it looks like a plain old pot.",
      "description2": "One of the treasures of Kurain Village. Supposedly priceless, but has no monetary value.",
      "description3": "Found in the office of Luke Atmey. Has pink splotches all over it.",
      "description4": "Found in Atmey's Office. Covered in pink splotches, but it's the genuine article.",
      "description5": "Broken and repaired by Adrian 2 weeks ago, then replaced in its box. Kept out of sight."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "DeMasque's Calling Card",
      "type": "Documents",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "Sent before a heist, the emblem is top-secret. Click here for details."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Shichishito",
      "type": "Other",
      "obtained": "Obtained in Lordly Tailor's Basement Warehouse.",
      "description1": "A ceremonial sword held in the hand of Ami Fey's statue. Wasn't bent before the crime.",
      "description2": "DeMasque knocked Atmey out during the crime w/ a blow to the back of the head."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Camera Data",
      "type": "Documents",
      "obtained": "Obtained in Lordly Tailor's Basement Warehouse.",
      "description1": "The warehouse camera went off at around 1 AM on the night of the crime."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Desirée's Letter",
      "type": "Documents",
      "obtained": "Received from Desirée DeLite.",
      "description1": "Addressed to her husband Ron DeLite. Apparently contains something important."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Security Camera Photo",
      "type": "Photographs",
      "obtained": "Received from Luke Atmey.",
      "description1": "Photo of storeroom entrance taken by the camera. Click here for details."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Blackmail Letter",
      "type": "Documents",
      "obtained": "Found in DeMasque's Hideout.",
      "description1": "Written with a fountain pen. Found in Ron's room. Click here to read.",
      "description2": "Found in Ron DeLite's room. Written by Bullard. Click here to read."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Ron's Wallet",
      "type": "Other",
      "obtained": "Received from Larry Butz.",
      "description1": "Found by Larry at his part-time security job's company building (night of the crime)."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Key Card → CEO Office Key Card",
      "type": "Other → Evidence",
      "obtained": "Received from Larry Butz.",
      "description1": "Found inside Ron's wallet. Apparently used for the building of his part-time job.",
      "description2": "Found in Ron's wallet. Opens the KB Security CEO's office. Leaves a record when used.",
      "description3": "Found in Ron's wallet. Used on October 12th, the night of the crime, at 1 AM."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Publicity Photo",
      "type": "Other",
      "obtained": "Received from Maya Fey.",
      "description1": "A shot of Mask☆DeMasque striking a pose. Click here for details."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "DeMasque's Broach",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Godot.",
      "description1": "Found in the shadow of Ami Fey's statue. Looks like it was torn off of some clothing."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Kane's Autopsy Report",
      "type": "Reports",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "Time of death: 10/12 at 1 AM. Cause: Cerebral hemorrhaging from blunt trauma to the head."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Newspaper Clipping",
      "type": "Other",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "An article on Mask☆DeMasque's first heist. Click here for details.",
      "description2": "About first heist. Guard in photo is Ron DeLite. Click here for details."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "CEO Office Buzzer",
      "type": "Other",
      "obtained": "Found in the KB Security CEO's Office.",
      "description1": "Connected to the basement Security Guard Office. There are no fingerprints on it."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Kane's List",
      "type": "Documents",
      "obtained": "Found in the KB Security CEO's Office.",
      "description1": "Found on a table at the crime scene. Click here for details."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Buzzer Record",
      "type": "Documents",
      "obtained": "Received from Larry Butz.",
      "description1": "The buzzer went off once at 1:02 AM on October 12 in the CEO's office."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Ron's Testimony",
      "type": "Documents",
      "obtained": "Received from Ron DeLite.",
      "description1": "From DeMasque's 2nd heist on, he was stealing as directed by blackmail letters."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Urn Box",
      "type": "Other",
      "obtained": "Obtained in Lordly Tailor's Basement Warehouse.",
      "description1": "A wooden box that had the Sacred Urn in it. Has pink paint stains on it."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Paint Marks",
      "type": "Other",
      "obtained": "Obtained in Lordly Tailor's Basement Warehouse.",
      "description1": "Completely dry. The box of the Sacred Urn fits in the gap perfectly.",
      "description2": "When Adrian dropped the urn's box 2 weeks ago she also knocked over some paint."
    }
  ],
  "turns": []
}