{
  "previousContext": "Episode 2The Stolen Turnabout\nThe time is 1:00 AM.\nBeep... Beep... Beep... Beeeeeeep...\nDetective! We made it!\nWhew... What a relief. Glad the jewel is still safe.\nHo ho! You said it, pal. It musta been our rock solid security that scared him off!\nWould you mind opening the safe just to double check?\nAaaaaaaaaah! We've been had!\nO-Out front! Guards! Turn on the searchlights!\nAha ha ha ha ha ha ha... Better luck next time, gentlemen! Aha ha ha ha ha ha ha... Excuse me, but I'm afraid I must be leaving now! We shall meet again... When the next moon is full! Aha ha ha ha ha ha ha... Ahaaaa ha ha ha ha ha ha...\nOctober 11, 3:24 PMWright & Co. Law Offices\nMaya:\nHey, Nick! Get a load of this! Hey, are you listening to me!? You can clean the toilet later! This is important!\nPhoenix:\n*sigh* What are you freaking out about now?\nMaya:\nHey hee. Today will be the last time you talk to me that way!\nPhoenix:\nHuh?\nMaya:\nWe're about to hit the big time!\nPhoenix:\n\"Big time\"? And what do you mean by \"we\"? You don't mean you and me are...?\nMaya:\nHa! Don't be silly. I'm talking about me and Pearly, of course!\nPearl:\nHello. It's a pleasure to see you again, Mr. Nick!\nPhoenix:\nPearls! You haven't changed a bit! Wait... What are you doing here anyway?\nPearl:\nHee hee. Haven't you heard, Mr. Nick? Here! Take a look at this!\nPhoenix:\n(What's this...? Some kind of poster?) Kurain Village... Isn't that...?\nMaya:\nThat's right. It's our hometown... Pearly and mine, that is.\nPhoenix:\nWhat's this about \"treasures\" from the boonies?\nMaya:\nHa ha ha. Very funny. You can laugh all you want... But you'll be singing another tune tonight!\nPhoenix:\nTonight? What about tonight?\nPearl:\nThe \"Treasures of Kurain\" exhibit doesn't actually start until next week, but... ...the promoter sent us some special VIP entry passes!\nMaya:\nThat's why I dressed up extra special today! What do you think, Nick?\nPhoenix:\n(Heh. Same Maya. Different day.) This young lady here is Maya Fey... The younger sister of Mia Fey... ...My friend and mentor. I first met her two years ago... I was working on the case surrounding Mia's death, and ever since then...\nMaya:\nI've been the one who's been keeping this law office afloat from behind the scenes.\nPhoenix:\nActually that's just a cover for her true identity... In reality, she's a spirit medium, and a bit of a shady character.\nMaya:\nHey! Who are you calling \"shady\"!?\nPhoenix:\nAnd this little girl is Pearl Fey, but I usually call her \"Pearls\". She's Maya's cousin and a spirit medium in training herself.\nPearl:\nI know I'm a bit young, but I want to help in any way I can, Mr. Nick!\nPhoenix:\nKurain Village is the home of the mysterious Kurain Channelling Technique. And Maya here is the daughter of the Kurain School of Channeling's Master. ...I know it sounds ridiculous, but it's no joke. I've seen her power with my own eyes... It's the real thing alright.\nMaya:\nEarth to Nick! How long are you going to make two gorgeous women like us wait!?\nPearl:\nYes, Mr. Nick! I can't wait any longer! I want to see the exhibit!\nPhoenix:\n(*sigh* Looks like I don't get a choice here. Might as well head on out...)\nTreasure Exhibit Poster added to the Court Record.\nOctober 11, 7:18 PMLordly TailorMain Exhibition Hall\nPhoenix:\n(\"Lordly Tailor\"... The city's fanciest and most expensive department store. Treasure Exhibit, huh... I have to admit I'm pretty impressed.)\nMaya: \nWow... This is awesome!\nPhoenix: \nYeah... You can make even the cheapest junk look great... It all depends on how you display it.\nPearl: \nOh! They even have the dusty old hanging scroll that was in the Fey Manor storeroom!\nMaya:  \nOh yeah, I remember scribbling on it when I was a little girl!\nPhoenix:\n(On a family heirloom...!?)\nMaya:  \nSay, Nick... The person in charge of this exhibition is waiting for us in the basement warehouse.\nPhoenix:  \nAlright... (I guess we should go and say hello...)\nOctober 11Lordly TailorBasement Warehouse\nPhoenix:\n(Yup. This is a basement warehouse alright...)\nPearl:\nTh-This place is scary... I feel like a monster could jump out at any time...\nMaya:\nDon't be scared, Pearly! I'll protect you!\n???:\n...Oh... ...Mr. Wright.\nMaya:\nEeeeeeeek!! A monster! You were right!\nPhoenix: \n(Huh? A monster...?)\n???: \nGood evening. ...It's good to see you again.\nPhoenix: \nY-You... I know you...\n???: \nHa ha. Nice to see you again too, little miss.\nPearl: \nAh! H-Hello!\nMaya: \nIs she a friend of yours, Nick? ...And how do you know her, Pearly?\nAndrews: \nNice to meet you. I'm Adrian Andrews. I'm in charge of the promotion and planning for this Treasure Exhibit. I'm also responsible for the security arrangements.\nMaya: \nOh, um... N-Nice to meet you.\nPhoenix: \n(Adrian sure has changed since we last met...)\nAndrews: \nSo this is the warehouse. The really valuable exhibit items are still stored away in here.\nAfter clearing all Talk options and examining Ami Fey statue:\nAndrews:\nOh, look! It's already 8:00! Have you all eaten yet?\nPhoenix: \nUm, well actually...\nAndrews: \nI've already made a reservation at the restaurant on the 12th floor. Why don't we all dine together?\nMaya: \nOoh! I like the sound of that! \"Dine\"... It sounds so fancy!\nPearl: \nI'll have the \"Kid's Lunch\"!\nMaya: \nHa ha ha. Pearly, it's dinner, not lunch. Why don't you go for it and really eat your fill with a \"Kid's Dinner\"?\nPearl: \nOK! In that case, one \"Kid's Dinner\" for me!\nAndrews: \nHa ha. Shall we head upstairs, then?\nPhoenix: \nAfter that pleasant evening, all that remained was to wait for the exhibition's opening. It was wonderful seeing Ms. Andrews looking so happy. None of us could have imagined... ...that the very next day, something terrible would happen...\nOctober 12, 10:09 AMWright & Co. Law Offices\nMaya: \nN-Nick! This is terrible! ...What the--!? You're cleaning the toilet again!? I never knew you were such a toilet freak!\nPhoenix:  \nGimme a break, would you? My brain just hit the snooze button for the fifth time...\nPearl: \nUm... I'm going to turn on the TV!\nAnnouncer:  \n...We've got an update on the recent treasure heist! Based on clues found at the scene of the crime, authorities have announced... that they believe it was the work of the renowned phantom thief, Mask☆DeMasque!\nPhoenix:  \n...M-Masque the Mask...?\nAnnouncer:  \nAccording to a spokesperson, Lordly Tailor received a threat letter some days ago. This is the fifth heist by the phantom thief, who only targets rare treasures.\nPhoenix:  \nL-Lordly Tailor...!?\nMaya:  \nWell, Nick!? What are you going to do!? Don't you dare go back to scrubbing the toilet!\nPhoenix:  \nTreasure...? Lordly Tailor...? You don't think...!?\nMaya:  \nYes! Now, get up, Nick! It was stolen! By Mask☆DeMasque! Our most valuable treasure... The Kurain Sacred Urn was STOLEN!!\nPhoenix:  \nWhaaat!?\nOctober 12Lordly TailorMain Exhibition Hall\nPearl: \nRight! Let's see if we can find some clues that might lead us to the bad guy!\nPhoenix: \n...But it doesn't look like anything has been disturbed.\nMaya: \nYeah, it looks pretty much the same as it did last night.\nPearl: \nHmmm... Bad guy, huh.\n???: \nHey! You can't poke around here, pal!\nPhoenix: \nWait a minute... that voice. Oh no! Not him again!\n???: \nIt's YOU!! And I'm the one who should be saying \"not again\"! Why is it that every time something bad happens, you always show up, pal?\nPhoenix: \nI should be asking you that. Aren't there any other detectives?\n???: \nNo, I should be asking YOU that. What are you doing hanging around here?\nPhoenix: \nHey, I asked you first. Why are you here any--\nMaya: \nAlright, alright, we got it! Why don't you two kiss and make up already?\nPearl: \n...Um, hello. It's been a long time, Mr. Scruffy Detective!\n???: \nOh! It's you, little missy! ...Um, ahh...\nGumshoe:\nActually, my name is Gumshoe. \"Detective Dick Gumshoe\"! Now is a good chance for you to try to remember it right!\nMaya: \nAnd if it's too long for you, you can just call him \"Dick\".\nPearl: \nOkay! It's good to see you again, Mr. Detective Dick!\nGumshoe: \nUm... Yeah... Good to see you again, too, I guess.\nAfter clearing \"What happened\" Talk option in Lordly Tailor - Main Exhibition Hall:\nOctober 12Lordly TailorBasement Warehouse\nMaya: \nNo matter how many times we come here, this place always give me the chills.\nPhoenix: \nThat's probably because it's air-conditioned... To protect the art pieces, you know.\n???: \n...Welcome! To my private little \"Banquet of Chaos\".\nPhoenix:\n(Huh? What the heck does THAT mean...?)\n???: \nI'm afraid I have very little to offer, but please... make yourself at home.\nMaya: \nErr, umm... Who are you anyway...?\n???: \nSHHH! SILENCE! ... Hee hee hee hee hee hee... Now I see! It's all becoming clear!\nMaya: \nWh-What do you see?\n???: \n...Zvarri! The truth has once again been elegantly revealed to me! A lawyer, and... a spirit medium. Neither very advanced at their trade! ...Am I wrong?\nMaya: \nYikes! Th-That's scary! H-How did you know that!?\n???: \n\"How\" you say? The universal skeptic would say that how is nothing but a question of why. I am traveler of both time and space, and a swimmer of dreams.\nMaya: \nWhat is he talking about? I can't make heads or tails of it...\n???: \nWithout further ado, let me fulfill what should be the first duty of any gentleman...\nAtmey:\n...and introduce myself. The name is Atmey... Luke Atmey! ...Ace Detective.\nPhoenix: \nOh... Umm... Hi.\nMaya: \nDon't let him intimidate you, Nick! Stand up and show him what you're made of!\nPhoenix: \nErr, umm... The name's Wright. Phoenix Wright... ...Ace Attorney.\nMaya: \nI'm Maya Fey! Ace Spirit Medium!\nPearl: \nAnd I'm, ummm... Pearl Fey. I'm Mystic Maya's cousin and umm... spirit medium Ace Apprentice.\nAtmey: \nExcellent! Well then, shall we begin our little game?\nPhoenix:\n(\"Game\"? Why does the phrase \"one short of a baker's dozen\" come to mind with this guy?)\nAfter clearing all Talk options and presenting DeMasque's Calling Card:\nAtmey:\n... ...Well, Sir Lawyer. I've been told that you too are pursuing the mysterious thief.\nPhoenix:\n...Well, I'm not sure would say that exact--\nMaya:\nThat's right! We're going to find the Sacred Urn no matter what we have to do!\nAtmey:\n...Excellent. I will trust you. I permit you to take a look around while I investigate elsewhere. If, perchance, you should discover something of value, return then to my office... My office of Earthly Delights, the \"Atmey Detective Agency\"! (Changed from [To my office of Earthly Delights, the 'Atmey Detective Agency'!] in the original release)\nMaya:\nOf-Office of Earthly D-Delights...?\nAtmey:\nWell then Sir Lawyer, if you'll excuse me, I have much to do!\nPhoenix:\nW-Wait a minute...!\nPearl:\nHe's gone.\nPhoenix:\nI don't like the idea of doing this guy's work for him.\nMaya:\nCome on, Nick. Don't worry about it. It's no big deal. Let's hurry up and investigate before he changes his mind!\nPearl:\nI wanna go to his office, too! Take me with you, OK?\nMain Exhibition Hall (after clearing \"Sacred Urn\" and \"Last year's incident\" Talk options in Wright & Co. Law Offices, and examining computer, Shichishito, and Ami Fey statue in Lordly Tailor - Basement Warehouse)\nPhone:\n...\nMaya:\nHey, Nick! Your cell phone's ringing! (Changed from [Oh, Nick! Your cell phone's ringing!] in the original release)\nPhone:\n...*beep*...\nPhoenix:\nHello, Phoenix Wright here.\nGumshoe:\nOho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho ho! It's me. Gumshoe.\nPhoenix:\nGumshoe! What is it? What's so funny!?\nGumshoe:\nI'll tell you what's funny, pal! I finally beat him! I beat Mr. Ace Detective! Finally! This underdog is the alpha dog today! That stuck-up detective's met his match! Yup! I finally caught him! Lock, stock and barrel! There's no escape for him!\nMaya:\nYou \"caught him\"? ...Are you saying...? You... You captured Mask☆DeMasque!?\nGumshoe:\nBingoooo! Well... Actually, he surrendered... ...But I still got him!\nPhoenix:\n(Mask☆DeMasque surrendered?)\nPearl:\nThat's great! So when can we come and pick up the Sacred Urn?\nGumshoe:\nUm, ahh, well ya see... I was gonna tell you...\nPhoenix:\nWhat...? Something wrong?\nGumshoe:\nDo you think you can swing by the detention center sometime?\nPhoenix:\nThe detention center...? (Changed from [Detention center...?] in the original release)\nGumshoe:\nHe wants to talk to you... Mask☆DeMasque, that is.\nMaya:\nWhaaaat!? He wants to talk to Nick?\nGumshoe:\nI'll be waiting for you, pal. So get over here soon.\nPhone:\n...*beep*...\nPhoenix:\n(The detention center, huh?)\nOctober 12Atmey Detective Agency\nPhoenix:\nThis is a detective agency? Looks like more like the set of some B-grade horror movie.\nMaya:\nH-Hello? Is anyone here...?\n...\nPhoenix:\nIt looks like nobody's home.\nMaya:\nHmph. What a waste of time. Hey! I know! Let's take that framed picture back with us as a memento!\nPhoenix:\nDon't you dare, Maya! (Guess we'll have to try back later...)\nOctober 12\nDetention CenterVisitor's Room\nGumshoe:\nHey, pal! Welcome to the detention center!\nPhoenix:\nYou're sure in a happy mood, aren't you?\nGumshoe:\nYup. After all, we got Mask☆DeMasq--\nMaya:\nRight, but... Um... So where's the Sacred Urn?\nGumshoe:\nOh, Sorry about that, pal... I guess I didn't really think about it before... But you're the \"victim\" in this case.\nMaya:\nHuh?\nGumshoe:\nWell, I guess I should let you guys hear the story straight from the horse's mouth.\nMaya:\nYou know, he's right, Nick!\nPhoenix:\nHe is?\nMaya:\nIf you think about it reeeeal hard, we are the victims!\nPhoenix:\nWell... I guess so... In a way...\n???:\nUmm...\nMaya:\nI'm so used to thinking of the victim as a dead person 'cause we're always on murder cases.\n???:\nEx-Excuse me...\nMaya:\nBut anyway! I have to get the Sacred Urn back!\n???:\nPleeeeease! Don't just ignore meeeeee! ...Err.\nMaya:\n...Um, who are you?\n???:\n...I, err, umm. I-I-I... I-I'm Ma-Ma-Ma... Mask☆DeMasque...? ...O-OK?\nMaya:\n... Hey, Nick... Doesn't he look kind of... well, gangly?\nRon:\nI'm Ron DeLite... Th-The famous Mask☆DeMasque.\nPhoenix:\n(...I don't think this guy could punch his way out of a wet paper bag.)\nAfter clearing \"Dessie\" Talk option in Detention Center - Visitor's Room:\nOctober 12\nMask☆DeMasque's Hideout\nPhoenix:\n... Wow, check this place out!\nMaya:\nNo doubt about it, this is Mask☆DeMasque's hideout alright.\n???:\nWho is it? Is that you, Ronnie? Huh? Who are you people?\nPhoenix:\nErr, umm... Are you \"Dessie\" DeLite? (Changed from [Err, umm... Are you Desirée DeLite?] in the original release)\nDesirée:\nThat's right. I'm Desirée. ... Ah! Oh! You must be the lawyer... and the victim!\nPhoenix:\nY-Yeah, that's us. Your husband told us to stop by and speak with you. (Changed from [Y-Yeah, that's us. Your husband told us that you wanted us to stop by.] in the original release)\nMaya:\nI'm Maya Fey, and this is Phoenix Wright, attorney at law.\nDesirée:\n\"Nicky boy\" and Maya, huh? I can't tell you how grateful I am that you decided to help my Ronnie.\nMaya:\nWell, um... Aha ha... You're welcome.\nPhoenix:\n(Did she really call me \"Nicky boy\"?)\nAfter clearing all Talk options:\nDesirée:\nSay... Can I ask you something, Nicky boy?\nPhoenix:\nWhat is it?\nDesirée:\nI know I may seem like a \"bad girl\" on the outside... But the one thing I won't stand for is illegal activity.\nMaya:\nI had the feeling you wouldn't! You're tough... But I can tell you've got a good heart. (Changed from [I had the feeling you didn't! You're tough... But I can tell you've got a good heart.] in the original release)\nDesirée:\nSomebody framed my poor Ronnie, I just know it. Umm... Could you give this to Ronnie for me?\nMaya:\nA letter?\nDesirée:\nYes, for Ronnie. I want him to fight back.\nMaya:\nMs. DeLite... OK, you've got it! Just relax and leave it all to us!\nDesirée's Letter added to the Court Record.\nDetention Center\nAfter clearing all Talk options and presenting Desirée's Letter:\nRon:\n... Umm... Mr. Lawyer?\nPhoenix:\nYes?\nRon:\nIn the letter that Dessie wrote, she said... \"Ask this guy to be your lawyer!\"\nMaya:\nHuh...?\nRon:\nErr, umm... I know this would be asking a lot, but... Could you please take my case? My trial starts tomorrow...\nMaya:\nHey, hang on a second! He can't be your lawyer!\nPhoenix:\nWhy not?\nMaya:\nWhat do you mean, \"why not\"!? We're the victims in this case, right!? Victims of this DeMasque guy!\nPhoenix:\nWell, yeah... But according to Desirée, he didn't do it...\nPearl:\nShe said, \"Poor man, he's deluded himself into thinking he did it.\" Right, Mr. Nick?\nMaya:\nCome on! She could be lying to protect her husband!\nPhoenix:\nW-Well, that's true. ...Err, no actually not. Actually it's hard to say (...Oh no, it's spreading!)\nRon:\nOh, please! I'll give you the treasure of your choice in return...\nPhoenix:\n(Hmm... What should I do?)\nPearl:\nM-Mr. Nick...! I-I was wrong about you... I shouldn't have trusted you!\nPhoenix:\nP-Pearls...?\nPearl:\nI can't believe you'd defend this person after what he did to Mystic Maya...! I-I... I'll never forgive you... EVER! WAAAAAAAAAAAAAAAAHHH!\nMaya:\nP-! Pearly...! Wait!\nPhoenix:\n(This is going to be ugly...)\nMaya:\nI-I'll go after her!\nRon:\nUmm... Sorry about that. I didn't mean to cause any trouble...\nPhoenix:\nWell... You couldn't have known she'd react like that. (I guess I might as well start investigating...) Oh, Maya... Where's Pearls?\nMaya:\nShe said she's going back to the office. Go check in on her later, would you?\nPhoenix:\nAnd what about you...? Are you OK with me taking Mr. DeLite's case...?\nMaya:\nY-Yeah... I'm fine, Nick. I believe in you.\nPhoenix:\n... *sniffle* (I think I'm going to cry.)\nRon:\nUmm... I, err... I know you have a lot of work to do... I... I really appreciate it.\nMaya:\nOK, Nick! Let's get this show on the road!\nOctober 12Wright & Co. Law Offices\nPearl:\nAh... Mr. Nick! W-Welcome back!\nPhoenix:\nOh, hey Pearls. You're back too, I see.\nPearl:\nI, um... I went and bought us a strawberry cake! I'll go make some tea to go with it!\nPhoenix:\nHey, uh Pearls... ...\nMaya:\nIt looks like she feels really bad about what happened at the detention center...\nPearl:\nM-Mr. Nick...! I-I was wrong about you... I shouldn't have trusted you!\nPearl:\nI-I... I'll never forgive you... EVER!\nPearl:\nMystic Maya! The tea is ready!\nMaya:\nOh... Thanks...\nPearl:\nCome on, Mr. Nick! Please have some of this cake!\nPhoenix:\nYeah... Thanks. Umm, Pearls?\nPearl:\nOh! Ex-Excuse me... I was in the middle of cleaning the toilet...!\nPhoenix:\nHey, it's OK! I just cleaned it this morning...\nMaya:\nToo late...\nPhoenix:\n(...This might be a good time for me to ask about her.)\nAfter clearing all Talk options:\nMaya:\nWell, Nick! Why don't we go out and start investigating? We're not going to learn anything just sitting around the office!\nPhoenix:\nYeah, I know... But... First I want to talk to Pearls...\nPearl:\n...Umm, Mr. Nick?\nPhoenix:\nYeah...?\nPearl:\nI... I acted like a baby.\nPhoenix:\nPearls...\nPearl:\nI doubted you... Even though Mystic Maya trusted you completely... I guess I still have a lot of training to do. Mr. Nick!\nPhoenix:\nY-Yes?\nPearl:\nI... From the bottom of my heart, I apologize for what I said!\nPhoenix:\nAww, it's OK! I'm the one that should be apologizing!\nPearl:\nWell, I'm going out now for a little bit.\nPhoenix:\nHuh!? Wh-Where are you going...?\nPearl:\nI may be small, but I still have a lot of spirit channeling power! So I'm going to show you I can be useful too... By finding some evidence!\nPhoenix:\nHey! W-Wait a...! (Ack! She sure runs fast...)\nMaya:\nNick... Let's back off and give her some room, OK?\nPhoenix:\n...Yeah.\nOctober 12Lordly TailorMain Exhibition Hall\nAndrews:\nM-Maya...!\nMaya:\nOh, Ms. Andrews...\nAndrews:\nI'm so sorry! It's my fault! ...Your precious urn! Your... precious... UUUUURNNN!!!\nPhoenix:\nPlease! C-Calm down! What's wrong?\nAndrews:\n*sniffle* It never ends! Everything I touch ends in failure! Maya, I'm sorry...! I'll do anything to make it up to you!\nMaya:\nN-No, it's okay, don--\nAndrews:\nI know I don't look it, but I'm good with my hands. I could make you another urn.\nMaya:\nHold on, just wait, OK? Breathe, calm down and talk to us.\nAndrews:\nF-Forgive me! Forgive me!\nBasement Warehouse\nAfter clearing all Talk options in Wright & Co. Law Offices and clearing \"The security\" Talk option in Lordly Tailor - Main Exhibition Hall:\nOctober 12Atmey Detective Agency\nMaya:\nHello?\n...Well, well. How lovely it is to see you again, my dear.\nAtmey:\nWelcome to my abode! Relax! and soak up the atmosphere...\nPhoenix:\nErr, umm... We're actually kind of...\nAtmey:\nSHHH! SILENCE! ... Hee hee hee hee hee... Precisely as I expected.\nMaya:\nWh-What is?\nAtmey:\n...Zvarri! The truth has once again been elegantly revealed to me! A lawyer, and... a spirit medium. ...Am I correct?\nMaya:\n...Umm. I think we've already been through this.\nAtmey:\nHa! So my estimation was correct! Zvarri! ...How truly elegant. Now then, what can I do for you?\nAfter clearing all Talk options:\nPhoenix:\nWell it looks like we got one thing cleared up anyway.\nMaya:\nHuh? What? That Atmey is the greatest Ace Detective in the world?\nPhoenix:\nNo, that he never actually saw the thief.\nMaya:\nOh... that's right! So the thief may not even be Mask☆DeMasque...\nAtmey:\nJust one moment, Sir Lawyer! The thief was unquestionably Mask☆DeMasque!\nMaya:\nBut you never actually saw him!\nAtmey:\nPerhaps so, but I installed a security camera for just such a contingency.\nMaya:\nOh...\nAtmey:\nLast night, the camera went off exactly once. Behold! This is a photo of the dastardly thief, taken by the security camera!\nPhoenix:\n...Th-That's him!\nMaya:\nM-Mask☆DeMasque...!\nSecurity Camera Photo added to the Court Record.\nAtmey:\nThe thief can be none other than the arch-criminal, Mask☆DeMasque. After all, he has a very good reason for committing such brazen crimes.\nPhoenix:\nWh-What are you talking about?\nDeMasque's Hideout (after clearing \"DeMasque's reason\" Talk option in Atmey Detective Agency)\nMaya:\nHey! Nick! Remember what Detective Atmey said!?\nAtmey:\nExactly that. Mr. DeLite had a very good reason to dress up and commit those crimes. There should be a green envelope somewhere in his room. ...You'll need to go and investigate.\nPhoenix:\nA green envelope, huh... Looks like this is it.\nMaya:\nOK! Let's have a look! \"If you don't want your true identity revealed to the world... ...come to KB Security at 1:00 AM on October 12th and bring $50,000.\" F-F-F-Fifty thousand...!\nPhoenix:\nTh-Th... This is a... B-B-Blackmail letter... (It sure looks like a major clue alright!)\nBlackmail Letter added to the Court Record.\n...*ding-dong*...\nDesirée:\nOh! Someone's at the door! I'll be right back. Won't take but a second, I promise. (Oh, thank you for coming! That's so nice of you!)\n???:\n(When I see a damsel in distress, I just can't help myself!)\nDesirée:\n(Please, come on in! I'll make some coffee.)\n???:\n(Really? OK, I guess I'll make myself at home, pretty lady!)\nPhoenix:\n(...Wait a minute. I know that voice...)\nDesirée:\nOh, Nicky boy, I'm so sorry, but I've got another guest!\n???:\nAaaaaaaaaaaah!! You... You're... Nick, it's you! And Maya, too! What a fluke!\nMaya:\nAh...! Larry! Long time no see!\nDesirée:\nWhat? You know each other?\nButz:\nNi... \"Nicky boy\"!? Nick, do you and this girl have... you know... something going on?\nPhoenix:\n\"S-Something\"? If you mean what I thin--\nButz:\nI underestimated you, Nick! A gorgeous lady like this? ...And married, too? Way to go, dude!\nPhoenix:\n(I knew it. Just when things can't get any worse, it's time to cue in the Butz.) Larry Butz... Ever since grade school, he's been... Not exactly a close friend, but yeah, we know each other.\nButz:\nHey, man, that wasn't nice! I was your very first client!\nPhoenix:\nWe've got quite the... storied history, he and I. (Changed from [It's been 25 years since I first met Larry.] in the original release) And what we used to say still rings true. When something smells, it's usually the Butz.\nButz:\nHey, come on now! You're embarrassing me! And in front of this pretty little thing here...\nDesirée:\nSo you two are old childhood friends, I see. That's so sweet! You two go ahead and catch up on old times. I'm going to go check on my bike.\nButz:\nNice girl, that Dessie... So how have ya been, Nick?\nPhoenix:\n(Too busy if you really want to know...)\nAfter clearing \"Wallet\" and \"KB Security\" Talk options and presenting Key Card:\nPhone:\n...\nMaya:\nHey, Nick! Your phone! (Changed from [Oh, Nick! Your phone!] in the original release)\nPhone:\n...*beep*...\nPearl:\nH-Hello? Is this the Wright residence?\nPhoenix:\nAh! Pearls! Where are you!?\nPearl:\nI-I thought I'd go to Lordly Tailor to try to find some more clues, but... ...I'm afraid I've gotten lost.\nMaya:\nWhaaaat!? Give me that phone, Nick! P-Pearly! Where are you right now!?\nPearl:\nUm... I was walking along and I found myself in front of that person's office.\nMaya:\n\"That person\"...? Who!?\nPearl:\nUm, the person who doesn't act his age and always says, \"Zvarri!\" when he's excited...\nPhoenix:\n(Luke Atmey, Ace Detective...) OK, stay right there! We're coming to get you!\nPearl:\nA-Alright... I-I'm a little scared...\nPhone:\n...*beep*...\nPhoenix:\nAlright! Let's go, Maya!\nButz:\nWait a second, Nick!\nPhoenix:\nWh-What?\nButz:\nThat phone call just now... Sounded like real cutie... Another one of your, ahem, ...\"special friends\"?\nPhoenix:\n.......... Say goodbye to Ms. DeLite for me, would you Larry?\nOctober 12Atmey Detective Agency\nPearl:\nAh! Mr. Nick! Mystic Maya!\nMaya:\nPearly!\nPearl:\nI never thought I'd see the two of you again!\nPhoenix:\n...So is Mr. Ace Detective out of the office?\nPearl:\nYes, when I arrived here... ...there wasn't a single soul in sight.\nMaya:\nSay, Nick... Doesn't look like something's changed since we were here last?\nPhoenix:\n(Now that you mention it...)\nMaya:\nThis bag... I'm sure it wasn't here before.\nPearl:\nIt looks quite full... I wonder what could be in here?\nMaya:\nHey, Nick! Come on! Open it up!\nPhoenix:\nHey! Wait a minute! We can't just open his private property!\nMaya:\nDon't be such a fuddy-duddy! This is an important investigation!\nPhoenix:\n(That's true... And truth be told, I have to admit I am kind of curious...)\nMaya:\nWell? What's in there?\nPhoenix:\nH-Hang on a sec. I'm taking it out now... (Whatever it is, it feels... kinda hard... and smooth...)\nAtmey:\n...Well, hello there!!\nMaya:\nEEEEEEK! H-He's here!\nAtmey:\n...What are you doing, Sir Lawyer? I'm shocked to see a servant of the court ignoring the law so flagrantly!\nPhoenix:\nI-I'm really sorry! M-Maya made me do it!\nMaya:\nNick! I can't believe you!\nAtmey:\nA gentlemen never uses a lady as an excuse for his own poor behavior... The real question is... Can you afford to waste time lollygagging about here?\nPhoenix:\nWh-What do you mean by that?\nAtmey:\nPerhaps I should make myself more clear? Tomorrow's trial... Zvarri! Shall we say the figurative Sir William will be dropping his panties before lunchtime?\nMaya:\nWow, Nick! Sounds like it's gonna be really exciting.\nAfter clearing all Talk options:\nPhoenix:\n(It looks like we're done investigating for the day.)\nAtmey:\nHee hee hee hee hee... Sir Lawyer... The stage has been set and all the pieces are finally in place. All that remains now... is for the dance to begin!\nPhoenix:\n(A new prosecutor, an Ace Detective and a thief... This will be one tough trial.)\nTo be continued.",
  "characters": [
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Phoenix Wright",
      "age": "26",
      "gender": "Male",
      "description1": "Me. What more can I say? This is my third year as a young (but skilled!) lawyer."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Mia Fey",
      "age": "deceased",
      "gender": "Female",
      "description1": "Maya's older sister and my eternal mentor in life and law. Passed away 2 years ago."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Maya Fey",
      "age": "19",
      "gender": "Female",
      "description1": "My assistant and a disciple in the Kurain Tradition of spirit channeling."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Pearl Fey",
      "age": "9",
      "gender": "Female",
      "description1": "Maya's cousin, and channeling prodigy. She has amazingly powerful spiritual abilities."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Adrian Andrews",
      "age": "24",
      "gender": "Female",
      "description1": "Head of planning, promotion, and security of the Treasures of Kurain Exhibit."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Dick Gumshoe",
      "age": "32",
      "gender": "Male",
      "description1": "Homicide detective at the local precinct. In charge of the initial investigation."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Mask☆DeMasque",
      "age": "???",
      "gender": "?",
      "description1": "A flashy thief who steals valuable works of art. Sends a calling card before a heist."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Luke Atmey",
      "age": "34",
      "gender": "Male",
      "description1": "An Ace Detective. Has great powers of deduction, yet rarely makes sense.",
      "description2": "An Ace Detective. Has acknowledged that he is in fact Mask☆DeMasque."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Ron DeLite",
      "age": "23",
      "gender": "Male",
      "description1": "A young man who turned himself in as Mask☆DeMasque. A bit of a pitiful guy.",
      "description2": "Claims he is Mask☆DeMasque. Used to work as a guard for KB Security."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Desirée DeLite",
      "age": "23",
      "gender": "Female",
      "description1": "Ron DeLite's wife. Seems to be a very friendly and out-going lady.",
      "description2": "Ron DeLite's wife. Hates criminals and cowards more than anything."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Larry Butz",
      "age": "25",
      "gender": "Male",
      "description1": "My friend. I've known this trouble magnet ever since grade school.",
      "description2": "My friend. Picked up Ron DeLite's wallet while working on the night of the crime."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Godot",
      "age": "???",
      "gender": "Male",
      "description1": "A prosecutor who is shrouded in mystery. He seems to know me somehow."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Kane Bullard",
      "age": "48",
      "gender": "Male",
      "description1": "CEO of KB Security. His body was found inside his safe."
    }
  ],
  "evidences": [
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "It's my all-important badge. It shows that I am a defense attorney."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Maya's Magatama",
      "type": "Other",
      "obtained": "Received from Maya Fey.",
      "description1": "A present from Maya. It reacts to people who have secrets in their hearts."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Treasure Exhibit Poster",
      "type": "Other",
      "obtained": "Received from Maya Fey.",
      "description1": "A poster for the Treasures of Kurain exhibit. The Sacred Urn of Kurain Village will be displayed in Lordly Tailor."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Ami Fey's Golden Statue",
      "type": "Other",
      "obtained": "Obtained in Lordly Tailor's Basement Warehouse.",
      "description1": "A statue of the founder of the Kurain Channeling Technique. Is holding the Shichishito.",
      "description2": "A statue of the founder of the Kurain Channeling Technique. Moved the night of the crime.",
      "description3": "Carried into the basement warehouse the day of the crime. Moved again that night."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Sacred Urn",
      "type": "Other → Evidence",
      "obtained": "Received from Maya Fey.  → Submitted as evidence by Desirée DeLite.",
      "description1": "One of the treasures of Kurain Village. Supposedly priceless, it looks like a plain old pot.",
      "description2": "One of the treasures of Kurain Village. Supposedly priceless, but has no monetary value.",
      "description3": "Found in the office of Luke Atmey. Has pink splotches all over it.",
      "description4": "Found in Atmey's Office. Covered in pink splotches, but it's the genuine article.",
      "description5": "Broken and repaired by Adrian 2 weeks ago, then replaced in its box. Kept out of sight."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "DeMasque's Calling Card",
      "type": "Documents",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "Sent before a heist, the emblem is top-secret. Click here for details."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Shichishito",
      "type": "Other",
      "obtained": "Obtained in Lordly Tailor's Basement Warehouse.",
      "description1": "A ceremonial sword held in the hand of Ami Fey's statue. Wasn't bent before the crime.",
      "description2": "DeMasque knocked Atmey out during the crime w/ a blow to the back of the head."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Camera Data",
      "type": "Documents",
      "obtained": "Obtained in Lordly Tailor's Basement Warehouse.",
      "description1": "The warehouse camera went off at around 1 AM on the night of the crime."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Desirée's Letter",
      "type": "Documents",
      "obtained": "Received from Desirée DeLite.",
      "description1": "Addressed to her husband Ron DeLite. Apparently contains something important."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Security Camera Photo",
      "type": "Photographs",
      "obtained": "Received from Luke Atmey.",
      "description1": "Photo of storeroom entrance taken by the camera. Click here for details."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Blackmail Letter",
      "type": "Documents",
      "obtained": "Found in DeMasque's Hideout.",
      "description1": "Written with a fountain pen. Found in Ron's room. Click here to read.",
      "description2": "Found in Ron DeLite's room. Written by Bullard. Click here to read."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Ron's Wallet",
      "type": "Other",
      "obtained": "Received from Larry Butz.",
      "description1": "Found by Larry at his part-time security job's company building (night of the crime)."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Key Card",
      "type": "Other → Evidence",
      "obtained": "Received from Larry Butz.",
      "description1": "Found inside Ron's wallet. Apparently used for the building of his part-time job.",
      "description2": "Found in Ron's wallet. Opens the KB Security CEO's office. Leaves a record when used.",
      "description3": "Found in Ron's wallet. Used on October 12th, the night of the crime, at 1 AM."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Publicity Photo",
      "type": "Other",
      "obtained": "Received from Maya Fey.",
      "description1": "A shot of Mask☆DeMasque striking a pose. Click here for details."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "DeMasque's Broach",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Godot.",
      "description1": "Found in the shadow of Ami Fey's statue. Looks like it was torn off of some clothing."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Kane's Autopsy Report",
      "type": "Reports",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "Time of death: 10/12 at 1 AM. Cause: Cerebral hemorrhaging from blunt trauma to the head."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Newspaper Clipping",
      "type": "Other",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "An article on Mask☆DeMasque's first heist. Click here for details.",
      "description2": "About first heist. Guard in photo is Ron DeLite. Click here for details."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "CEO Office Buzzer",
      "type": "Other",
      "obtained": "Found in the KB Security CEO's Office.",
      "description1": "Connected to the basement Security Guard Office. There are no fingerprints on it."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Kane's List",
      "type": "Documents",
      "obtained": "Found in the KB Security CEO's Office.",
      "description1": "Found on a table at the crime scene. Click here for details."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Buzzer Record",
      "type": "Documents",
      "obtained": "Received from Larry Butz.",
      "description1": "The buzzer went off once at 1:02 AM on October 12 in the CEO's office."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Ron's Testimony",
      "type": "Documents",
      "obtained": "Received from Ron DeLite.",
      "description1": "From DeMasque's 2nd heist on, he was stealing as directed by blackmail letters."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Urn Box",
      "type": "Other",
      "obtained": "Obtained in Lordly Tailor's Basement Warehouse.",
      "description1": "A wooden box that had the Sacred Urn in it. Has pink paint stains on it."
    },
    {
      "currentChapter": "The Stolen Turnabout",
      "name": "Paint Marks",
      "type": "Other",
      "obtained": "Obtained in Lordly Tailor's Basement Warehouse.",
      "description1": "Completely dry. The box of the Sacred Urn fits in the gap perfectly.",
      "description2": "When Adrian dropped the urn's box 2 weeks ago she also knocked over some paint."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "The Stolen Turnabout\n\n\n\n\n\n\n\n\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 4October 13, 9:36 AMDistrict CourtDefendant Lobby No. 4Maya:\nHey, Nick!Phoenix:\nWhat is it? Is something wrong...?Maya:\nNah. But did you see all the people here? It's crazy! Oh! So, check out the Mask☆DeMasque glossy I bought! (Changed from [Oh! Look at this! I bought this Mask☆DeMasque publicity photo!] in the original release)Phoenix:\nYou bought this... where? (Changed from [You bought that...? Where!?] in the original release)Pearl:\nFrom the little tents in front of the courthouse. They have all sorts of things for sale!Maya:\nYou know I'm sucker for this kind of stuff!Mask☆DeMasque Publicity Photo stuck into the Court Record.Come on! I'm guilty! Throw the book at meeee!Pearl:\n...Who's screaming like that?Ron:\n...Oh! Mr. Wright! You made it!Phoenix:\nYeah, I did. But it doesn't look like things are going to get any less ugly for you...Ron:\nBecause I did it!! I'm the criminal! Me! Me! Meeeeeee!Maya:\nUngh... He's at it again.Ron:\nI sent the calling card to Lordly Tailor! I admit iiiit!!Phoenix:\nBut... You don't have the Sacred Urn, right?Ron:\nWell, that's true, but... That doesn't mean that I didn't commit the crime.Phoenix:\n(Normally, when I say \"Of course you didn't\" I'm being sarcastic, but you... Yikes!)Ron:\nAnyway, I admit that I'm guilty... So make sure they give me a guilty verdict! Pleeeeease!?Desirée:\nOh, there you are Ronnie! Bonjour, sweetie!Ron:\nOh! D-Dessie honey! B-Bonjour! ...Well, actually... I don't really know why I should be speaking French to you at a time like thisDesirée:\nLeave it all to me, Ronnie! I swear I'll protect you!Ron:\nUmmm, errr... Aaah... Well, ahh... You see... Actually the thief is err, meDesirée:\nCan I tell you something, Nicky boy? I can guarantee that my Ronnie is innocent! If he's declared guilty, I'll be ever so cross with you!Phoenix:\n(So why are you smiling when you say it?)Desirée:\nWell, if you'll excuse me! I've got some errands I need to take care of! I'm counting on you, Nicky boy! Good luck!Phoenix:\n(To be honest, I really don't know whether Ron is Mask☆DeMasque or not. But there's only one thing I AM sure of. He doesn't have the Sacred Urn right now...)Bailiff:\nMr. DeLite! It's time for you to enter the courtroom!Phoenix:\n(For the time being, I guess I'll have to trust Desirée...)October 13, 10:00 AMDistrict CourtCourtroom No. 6Judge:\nCourt is now in session for the trial of Mr. Ron DeLite.Phoenix:\nThe defense is ready, Your honor.???:\n...Judge:\nWhat about the prosecution? Are you prepared to...???:\n...What a stupid question!Judge:\nWh-What did you say!???:\nFine. Let me ask you then, Your Honor. Are YOU ready? Are you ready to pass judgement?Judge:\nWh...! N-No, I... I'm not! I will pass judgement after I hear arguments from both sides.???:\nWell, if you're not ready yourself, you shouldn't expect others to be. That's a rule to live by.Judge:\n...Um, wh-who are you?Godot:\nI am Godot. Legendary prosecutor. I've never lost a case.Maya:\nAh! He's the one that Detective Atmey was talking about...Judge:\nYes, your reputation precedes you. What kind of cases have you dealt with so far?Godot:\nHa...! None.Judge:\nWhat did you say...?Godot:\nI've never prosecuted a case before.Judge:\nN-Never? But you said you've never lost before.Godot:\n...Exactly. I've never lost. I've never won before either.Judge:\nQuite arrogant for a beginner, aren't you?Godot:\nEven the mightiest of redwoods begin their lives as mere saplings.Judge:\nYes, but... A mask? In a court of law?Godot:\nHa...! Don't you know anything? No matter the man, we all wear masks... Either on our faces or ever our hearts.Judge:\n...!Maya:\nThis guy is the real deal alright, Nick...Phoenix:\n(Why does it seem like all prosecutors are the \"real deal\"...?)Godot:\nSo we finally meet... Mr. Phoenix Trite!Phoenix:\n...?Maya:\nN-Nick! Is he a friend of yours?Phoenix:\nNo. I don't have any friends that call me \"Trite\". (Just who is this masked man...?)Godot:\nI've returned from the depths of Hell... To do battle with you.Judge:\nWell then, err, Prosecutor Gobo.Godot:\nIt's not \"Gobo\". It's Godot... Your Honor.Judge:\nIn any case, please give your opening statement.Godot:\nOpening statement? Those things are not fit for even dogs to consume. I have only one thing to say before we start. To you... Mr. Trite.Phoenix:\nWh-What is it?Godot:\nAre you familiar with the saying, \"A chain is only as strong as its weakest link\"? I wonder... how much you can withstand before you and your case break in two...?Phoenix:\n...Judge:\nHmm... Well then, let's hear from the first witness!Gumshoe:\nUm, my name is...Godot:\nNo one asked for your name, witness.Gumshoe:\n...Urk.Godot:\nThe important thing is what you know... That's all. Start talking. ...We're listening.Gumshoe:\nY-Yes, sir.Judge:\nAlright, witness. First, let's hear about... What you know about the thief that stole the urn.Gumshoe:\nYes, sir!Witness Testimony-- Mask☆DeMasque's Crimes --Gumshoe:\nMask☆DeMasque is a master thief that first started his crime spree 6 months ago.\nHe's so confident that he sends his calling card before he even commits the crime!\nThis was his fifth heist, and as usual, he sent a card on to Lordly Tailor.\nHis pattern is to always go after only the most precious art pieces.\nThat's why we're sure it was Mask☆DeMasque, sir. It fits his M. O. to a T!Judge:\nHmm... So then the actual identity of this Mask☆DeMasque is... M-Mr. Godot! W-What are you--!? (Changed from [M-Mr. Godot! Y-You!] in the original release) W-We're in the middle of a trial here, Mr. Godot!Godot:\nBlacker than a moonless night, hotter and more bitter than Hell itself... That is coffee. I'm sure you can grant me at least this much... Your Honor. Oh, please. Proceed.Judge:\n... Very well. It's only coffee, after all.Phoenix:\n(What!? You can't be letting him slide this early in the trial!)Judge:\nProceed with your cross-examination, Mr. Wright.Maya:\nWell, Nick? What are you going to do?Phoenix:\nAs long as they haven't brought up Mr. DeLite's identity... ...all we can do is show that it wasn't Mask☆DeMasque who stole the urn.Cross Examination",
      "testimonies": [
        {
          "testimony": "Mask☆DeMasque is a master thief that first started his crime spree 6 months ago.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "He's so confident that he sends his calling card before he even commits the crime!",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "This was his fifth heist, and as usual, he sent a card on to Lordly Tailor.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "His pattern is to always go after only the most precious art pieces.",
          "person": "Gumshoe",
          "present": [
            "Sacred Urn"
          ],
          "source": {
            "evidence_span": "Supposedly priceless, but has no monetary value.",
            "testimony_span": "always go after only the most precious art pieces",
            "explanation": "The urn has no monetary value so it was not the kind of item that Mask☆DeMasque would normally go after.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "That's why we're sure it was Mask☆DeMasque, sir. It fits his M. O. to a T!",
          "person": "Gumshoe",
          "present": [
            "Sacred Urn"
          ],
          "source": {
            "evidence_span": "Supposedly priceless, but has no monetary value.",
            "testimony_span": "That's why we're sure it was Mask☆DeMasque",
            "explanation": "The urn has no monetary value so it was not the kind of item that Mask☆DeMasque would normally go after.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        }
      ],
      "noPresent": false,
      "labels": [
        "object property",
        "behavior"
      ],
      "reasoning": [
        "Fact 1: The witness claims the defendant always goes after only the most precious art pieces.",
        "Fact 2: The evidence suggests the lost item has no monetary value.",
        "Fact 3: If an item has no monetary value, it is not considered precious art."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- Mask☆DeMasque's Crimes --Gumshoe:\nMask☆DeMasque is a master thief that first started his crime spree 6 months ago.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHave you been involved in the investigation from the beginning?\nGumshoe:\nYup! Nobody knows more about the thief than me, pal! It's true! I'm a... Zvarri...! \"Author on thieves\"!\nPhoenix:\n...\nMaya:\nAn \"author\"...? He's written books about thieves?\nPhoenix:\nUm, I think he probably meant to say \"authority\".\nGumshoe:\nThe fact that this guy can slip through even my fingers shows how good he is, pal!\nPhoenix:\n(It's easy when those fingers happen to be \"butter fingers\"...)\n\n\n\nPress harder\n\n\n\n\n\n\n\nPhoenix:\nSo nobody knows more about the thief than you, huh...?\nGumshoe:\nYou got it, pal! Except maybe for the thief's mom, that is!\nPhoenix:\nBut isn't there someone who knows even more about him than the police?\nGumshoe:\nYou don't mean... \"Detective Zvarri\", do you?\nJudge:\nHmm... Who is this person? Zvarri? He sounds German...\nGumshoe:\nHis name is Luke Atmey, sir. I guess I shouldn't have made up such a silly name for him.\nPhoenix:\n(What the heck? I guess he's not all that famous after all...)\nGumshoe:\nAnyway, it's true that he did manage to retrieve the last item the thief stole.\nJudge:\n...Oh, I see. It seems you're not the expert you claim to be.\nGumshoe:\n...Urk! I-It looks like the thief is playing with me, even now!\nLeads back to cross-examination\n\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(The real \"authority\" on the thief is the other detective. I don't need to ask this one any more questions...)\nLeads back to cross-examinationGumshoe:\nHe's so confident that he sends his calling card before he even commits the crime!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHave you seen all of these so-called \"calling cards\"?\nGumshoe:\nOf course I have. Except... The person in charge of the Treasure Exhibit never brought their card to the police... So I didn't see this one until after the crime occurred.\nMaya:\nThat's because Detective Atmey stopped Ms. Andrews from taking it to the police.\nJudge:\nWas the calling card that Lordly Tailor received authentic?\nGumshoe:\nWell, all the cards have one common, identifying feature. But we're not releasing that information to the general public...\nJudge:\nBut you're absolutely certain that this card is real?\nPhoenix:\n(Gumshoe can't say it out loud but I bet he's talking about Mask☆DeMasque's emblem...)Gumshoe:\nThis was his fifth heist, and as usual, he sent a card on to Lordly Tailor.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHis fifth heist... And your fifth screw up, huh?\nGumshoe:\nObjection, pal! That ain't fair! Maybe you could say I screwed up four times! But this last time wasn't my fault! I didn't know about the calling card this time!\nPhoenix:\n(You of all people shouldn't be chuckling about this, Detective Gumshoe...)\nGumshoe:\nI just want everyone here in the courtroom to know something! If you ever get a calling card from this guy, don't call some stupid private eye! Call your local police right away. Got me?\nMaya:\nWow, it looks like he's really got it in for Detective Atmey.Gumshoe:\nHis pattern is to always go after only the most precious art pieces.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nArt pieces? Like what, for example?\nGumshoe:\nWell, his first target was the famous \"Tear of Emanon\".\nJudge:\nWhat's that? Some kind of especially salty teardrop?\nGumshoe:\nN-No, sir. It's a blue diamond. A single, rare diamond. Next was the \"Crown of Bongora\"... You know, the thing you put on your head. After that was the \"Left Hand of Hades\" and then the \"Portrait of Mejeena\", sir. Detective Atmey retrieved the \"Portrait of Mejeena\" and returned it to the museum.\nPhoenix:\nAnd the target of his fifth and last robbery was the \"Sacred Urn\"... right?\nJudge:\nBut isn't it difficult for him to dispose of such famous art pieces...?\nGumshoe:\nWell, we assume he must have some underworld connections.\nMaya:\nSomehow, Mr. DeLite doesn't look the type...\nPhoenix:\n(Yeah, he's a little too sunny to be hanging out in the underworld...)Present Sacred Urn\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"...Can I ask you a little something, Detective Gumshoe?\"Gumshoe:\nThat's why we're sure it was Mask☆DeMasque, sir. It fits his M. O. to a T!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat do you mean when you say, \"it fits his M. O. to a T\"?\nJudge:\nI was thinking of asking the same thing myself.\nGumshoe:\nUgh... I wish you would listen a little more closely, pal. First of all, there's the calling card. We're 100% certain it's authentic. Then there's the fact that he seemed to know all about the security system. And finally, his target was an art piece. These are all part of the thief's modus operandi.\nJudge:\nAnd so, since this robbery seems to fit all those conditions...?\nGumshoe:\nThat's right! It means that Mask☆DeMasque is behind it!Present Sacred Urn\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"...Can I ask you a little something, Detective Gumshoe?\"Maya:\nNick! It definitely looks like it was Mask☆DeMasque who stole the urn!Phoenix:\nBut there's no real evidence either way as to whether Ron DeLite is Mask☆DeMasque.Maya:\nBut... But...Phoenix:\nAlso, the urn hasn't turned up yet, let alone in connection to Mr. DeLite himself.Maya:\nSo even though we know it was Mask☆DeMasque that did it...Phoenix:\n(Maybe for the time being, I should try to show it wasn't Mask☆DeMasque that did it!)Phoenix:\n...Can I ask you a little something, Detective Gumshoe?Gumshoe:\n...Just hearing the \"little\" in that question is making me nervous.Phoenix:\nYou said that he always \"goes after the most precious art pieces\", right?Gumshoe:\nThat's right, pal.Phoenix:\nBut there's one problem... That's not what he did in this case. The supposedly \"priceless\" urn doesn't exactly rise to the level of \"precious art\"!Gumshoe:\nWh-What do you mean!?Maya:\nN-Nick! How can you say such a terrible thing!?Phoenix:\nNo! I meant from a financial point of view! I mean, it wouldn't fetch a good price.Judge:\nWell, Prosecutor Godot? What is the value of that urn?Godot:\nThe appraisers I spoke to said they couldn't attach a price to it. And I mean that in the worst sense.Phoenix:\nSo in other words... It was not the kind of item that Mask☆DeMasque would normally go after!Gumshoe:\nUrk!Judge:\nHmm... If I understand you correctly, Mr. Wright... ...you're saying that the theft of the Sacred Urn was not the work of Mask☆DeMasque...!Phoenix:\nY-Yes... That's what I'm saying. (Actually all I did was point out the contradiction. The argument made itself, but...)Judge:\nWell... First of all, we need to get this issue cleared up. Was this last robbery the work of Mask☆DeMasque or not? What do you have to say about this, Mr. Godot?Godot:\nThis coffee here... It's my own special blend. I call it Godot #107. I'm trying to decide whether to cut down on the acidity or the bitterness... That's the only thing I've got on my mind right now... ...Mr. Trite!Phoenix:\nWh-What!?Godot:\nIf you're really a man, you should clean up your own mess.Phoenix:\nUmm... Sorry, but I didn't get what you mean.Godot:\nIf you're saying it wasn't Mask☆DeMasque that stole the urn... ...then it must be someone imitating Mask☆DeMasque's methods... A fake.Judge:\nA-A Fake☆DeMasque?Maya:\nFake☆DeMasque? That sounds so ridiculous. ...But I like it.Godot:\nNow, before I decide on my coffee, I believe some proof is in order, Mr. Trite. Proof that the person who appeared at Lordly Tailor that night was actually a fake.Judge:\nHmm... Though I don't approve of Mr. Godot's behavior, his point is valid. Mr. Wright. ...We're waiting.Phoenix:\n(It looks like I'm going to have to prove it... I need proof that the person at Lordly Tailor that night was in fact, Fake☆DeMasque!)Present Security Camera Photo\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"The proof is right here.\"Present anything else\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\nWhat is this evidence supposed to prove?\nGodot:\nHa...! Well, it proves someone here is a fake alright. ...It proves that this lawyer is a fake.\nPhoenix:\n(These prosecutors sure know how to twist the knife...)\nMaya:\nThis is no time to be impressed! Think it over again! When he stole the urn, his photo was taken, right? Who knows? Maybe there's something on there that shows he's a fake...\nPhoenix:\n(Hmm... Is she talking about that photo we got from Atmey?)\nJudge:\nAre you ready yet, Mr. Wright? \nLeads back to:\n\"It looks like I'm going to have to prove it...\"Phoenix:\nThe proof is right here.Judge:\nThis looks like... a photo taken by a security camera.Phoenix:\nBut if you look closely... you'll notice something peculiar about it.Godot:\nHa...! Well then, why don't you go ahead and show us what it is. Go on. Use this pointer and show us just what about this picture is so \"peculiar\".Present front of DeMasque's neck\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"It's right here, of course!\"Present anywhere else\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nIt's right here. ...I think.\nJudge:\nIs that what was so \"peculiar\"?\nGodot:\nHa...! The place that you're pointing to is all wrong.\nPhoenix:\nWh... What do you mean!\nGodot:\nThe only thing \"peculiar\" in this courtroom... is on top of your head.\nMaya:\nNick! Are you going to let him get away making fun of your hair!?\nPhoenix:\n(Yes... At least until I know he can't use his goggles to fry me or something...) W-Well anyway! There is a strange spot in this photo!\nGodot:\nHa...! Still haven't given up? So what is it then?\nLeads back to:\n\"Go on. Use this pointer and show us just what about this picture is so \"peculiar\".\"Phoenix:\nIt's right here, of course!Judge:\nYou mean... Mask☆DeMasque?Phoenix:\nI have here a piece of reference I would like the court to take a look at.Maya:\nIsn't that the publicity photo I bought this morning...?Phoenix:\nThe problem I have with the security camera photo is the broach on DeMasque's chest.Judge:\nA Breach? Here!? Bailiff! Get my steed! We need to retreat at once!Phoenix:\n...A broach, Your Honor. It's a sort of clasp for holding one's cape on.Judge:\nA clasp, eh... Ah! I see now!Gumshoe:\nBut the Mask☆DeMasque in the security camera photo... Ahh!! He has no broach!!Phoenix:\nThat broach is the same as the emblem on DeMasque's calling card and serves as his symbol. But the thief that broke into Lordly Tailor wasn't wearing a broach... In other words, this \"Mask☆DeMasque\" is a fake!Gumshoe:\n...! I-I've been fooled agaaaaaain!Judge:\nO-Order! It's true... Undeniably true... Detective Gumshoe! How... How could you have overlooked this!?Gumshoe:\nI-I'm sorry, sir! I don't know how I...Godot:\nHey now... ...If you're gonna have a pity party, invite me, too!Judge:\nM-Mr. Godot! You deserve some blame in this, too! How could you have overlooked such a large broach...?Godot:\nHa...! The broach you're talking about... Do you mean this?Gumshoe:\nAh...!Phoenix:\nTh-That's...! Mask☆DeMasque's broach!Judge:\nWh-Where did you find it!?Godot:\nWell I've always had a good nose for evidence... I got it at the crime scene. It was hidden in the shadow of a big female Buddha statue.Phoenix:\n(\"Buddha statue\"...? He must mean the Ami Fey statue.)Gumshoe:\nWh-Why didn't you tell me about that, sir!?Godot:\n...I always put evidence away in my pocket. ...After all, it's the safest place for crucial evidence.Maya:\nGrrr... This guy is one cool customer.Godot:\nIt's a little early to be shaken up, isn't it, little lady? ...That friend of yours left pretty little hickeys on there, too.Judge:\nH-Hickeys?Godot:\nFiguratively speaking, of course... I'm referring to Ron DeLite's fingerprints.Gumshoe:\nWhaaa...?Judge:\nWhat!? The defendant's fingerprints are on the broach!? Order! Order in the court! Mr. Godot! Let's see that broach!Godot:\nI've grown attached to my metallic girlfriend here. ...Take good care of her.Judge:\nHmm... She-- I mean, it appears to have been torn off some clothing. There's a little bit of cloth left on the back.Godot:\nObviously there must have been a big struggle that night at the crime scene.Phoenix:\n(Uh oh... Phoenix, we have a problem...)DeMasque's Broach added to the Court Record.Godot:\nHa...! You mess with Godot... ...and you get burned.Phoenix:\n(Grr... He's been playing me like a violin...)Godot:\nWell Judge, I'm about ready to call my next witness.Gumshoe:\nHuh? You're done with me? But I haven't proved anything yet.Godot:\nYou've proven your own incompetence. That's good enough.Gumshoe:\n...That doesn't sound good at all.Judge:\nBailiff! Bring the next witness into the courtroom!Phoenix:\n(Finally time for the Ace Detective to make his appearance, huh...?)Godot:\nOne second is one drip of the coffee pot. Let's hurry it up.Atmey:\nSHHH! SILENCE!... Hee hee hee hee hee... Now I see. It's all becoming clear.Judge:\nWh-What's clear?Atmey:\n...Zvarri! The truth has once again been elegantly revealed to me! What we have here is... A judge and a prosecutor. ...A coffee maniac, at that! ...Am I correct?Judge:\nW-Well, yes. That's right.Godot:\nHa...! Not bad. Not bad at all. You're the first person that's ever been able to penetrate my secret veil.Atmey:\nWell, Sir Prosecutor. Let me introduce myself. My name is Luke Atmey, Ace Detective and rising star illuminating the heavens.Maya:\nBoy, these two make a perfect pair...Phoenix:\nThey'd either be best friends or they'd tear each other's heads off.Judge:\nI've heard that on the night of the crime, you were all alone on security detail.Atmey:\n...You have heard correctly. My specially-made monocle is worth more than a hundred Detective Gumshoes. ...If Detective Gumshoe was worth anything, that is.Judge:\nHmm...Phoenix:\n(Why was this guy all by himself anyway...? There must be some reason. I'm sure of it!)Judge:\nWell then, tell us what this special monocle of yours witnessed!Witness Testimony-- What I Witnessed --Atmey:\nIt was approximately 1 o'clock in the morning... just after the date changed.\nThat's when my nemesis, the infamous Mask☆DeMasque, dancingly descended upon me!\nJust as I began to turn, the coward struck a fierce blow upon my noble head!\nDarkness swallowed me before I could land a single strike. When I awoke, he was gone.\nThirty minutes later, I used an emergency phone to notify the police!Judge:\nSo you didn't get a clear look at the criminal?Atmey:\nMy specially-made monocle never misses a thing. However! That is limited to things that fall within my own visual range! But of course, that's only natural.Judge:\n...I fall to see why the witness seems so proud of his performance that evening.Atmey:\nWell, Sir Old-Timer, let me explain. We are not speaking of any ordinary thief... ...but of the kings of thieves! The great Mask☆DeMasque, my arch-enemy! That is what my instincts and my years of experience tell me!Judge:\nHmm... Very well. Proceed with the cross-examination, Mr. Wright.Cross Examination",
      "testimonies": [
        {
          "testimony": "It was approximately 1 o'clock in the morning... just after the date changed.",
          "person": "Atmey",
          "present": []
        },
        {
          "testimony": "That's when my nemesis, the infamous Mask☆DeMasque, dancingly descended upon me!",
          "person": "Atmey",
          "present": []
        },
        {
          "testimony": "Just as I began to turn, the coward struck a fierce blow upon my noble head!",
          "person": "Atmey",
          "present": [
            "DeMasque's Broach"
          ],
          "source": {
            "evidence_span": "Looks like it was torn off of some clothing.",
            "testimony_span": "N/A",
            "explanation": "The torn clothing shows that the thief struggled with someone, so Detective Atmey must have fought with the thief that night. Thus, he could not have passed out after a surprise blow.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "Darkness swallowed me before I could land a single strike. When I awoke, he was gone.",
          "person": "Atmey",
          "present": [
            "DeMasque's Broach"
          ],
          "source": {
            "evidence_span": "Looks like it was torn off of some clothing.",
            "testimony_span": "Darkness swallowed me before I could land a single strike.",
            "explanation": "The torn clothing shows that the thief struggled with someone, so Detective Atmey must have fought with the thief that night. Thus, he could not have passed out after a surprise blow.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "Thirty minutes later, I used an emergency phone to notify the police!",
          "person": "Atmey",
          "present": []
        }
      ],
      "noPresent": false,
      "labels": [
        "object property",
        "behavior",
        "temporal"
      ],
      "reasoning": [
        "Fact 1: The witness claims he passed out after being surprise attacked.",
        "Fact 2: The evidence suggests the assailant's clothing was torn.",
        "Fact 3: If someone's clothing was torn, there is likely a struggle.",
        "Fact 4: After someone passes out, they cannot struggle."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- What I Witnessed --Atmey:\nIt was approximately 1 o'clock in the morning... just after the date changed.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo that would be one o'clock on the morning of the 12th, correct?\nAtmey:\nThat's an impressive deduction, Sir Lawyer.\nPhoenix:\nYou were on security duty that night. Where exactly were you at the time?\nAtmey:\nA penetrating question! I was in the basement warehouse, near the computer.\nPhoenix:\n(Near the computer, huh...)\nJudge:\nSo then you weren't trying to remain hidden, I take it?\nAtmey:\nUp to this point, I have tried to remain concealed while waiting for the thief...\nPhoenix:\n(Yeah, he said the same thing yesterday, too.)\nMaya:\nGumshoe also said that he never saw him at the crime scene...\nAtmey:\nPrecisely! That is precisely why I chose NOT to hide last night. I knew that by NOT concealing myself, I would be putting pressure on the thief.\nPhoenix:\n(Looks like the thief was the one applying pressure... On your pidgeony head, that is.)\nAtmey:\nIn any case!Atmey:\nThat's when my nemesis, the infamous Mask☆DeMasque, dancingly descended upon me!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n\"Dancingly descended\"...? From where exactly?\nAtmey:\nWell... From the entrance, I suppose. Where else?\nPhoenix:\n(So in actuality, he neither \"danced\" nor \"descended\"! ...Someone please save me.) Um... So how is it that you didn't notice the thief?\nAtmey:\nMy eyes were looking for the thief's shadow while my ears listened for his footfalls. But even so, the dastardly criminal managed to sneak up on me... It can only be due to his subtly camouflaged cape and soft-soled shoes.\nPhoenix:\n(... I hereby dub you \"Ace Dunce\".)Atmey:\nJust as I began to turn, the coward struck a fierce blow upon my noble head!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou didn't see the criminal's face when that happened?\nAtmey:\n...Well, that's difficult part. How should I put it... I saw his mask... That's all that I can recall.\nJudge:\nHmm... That's not very solid as far as testimony goes.\nAtmey:\nHowever... Fortunately I had my third monocle, the security camera, at the ready. It captured his image perfectly... This should be sufficient, I believe?\nJudge:\nHmm, well, as long as this photo is authentic, I don't see a problem here. Well, Mr. Godot? Do you have a problem with the photo? Good. Then let's continue with the testimony.Present DeMasque's Broach\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"...Mr. Atmey.\"Atmey:\nDarkness swallowed me before I could land a single strike. When I awoke, he was gone.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAttacked and knocked unconscious? And you weren't able to do a thing? There's certainly some very impressive detective work.\nAtmey:\nHmph! Well, Sir Lawyer! Have you ever been suddenly struck on the head?\nPhoenix:\nHuh!? W-Well.. Actually, yes. By a fire extinguisher.\nAtmey:\nAnd what happened?\nPhoenix:\n...I-I was knocked out.\nMaya:\nAnd you lost your memory, too!\nAtmey:\nYou see? You have no right to look down on me then, do you? The only reason I didn't lose my memory was because I have more brains to begin with.\nPhoenix:\n(He may have brains, but the wiring to the self-reflection part seems to be served...)\nAtmey:\nIn any case, that was how I was knocked senseless. And then...Present DeMasque's Broach\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"...Mr. Atmey.\"Atmey:\nThirty minutes later, I used an emergency phone to notify the police!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAbout this \"30 minutes\"...\nAtmey:\nMy silver cord was loosened and my soul fled to the Golden Halls of Elysium...\nMaya:\nAs usual, I have no idea what this guy is saying.\nPhoenix:\nI think he's saying that he was out cold.\nJudge:\nSo... What happened during these 30 minutes?\nAtmey:\nNo one can say, Your Honor... That span of time has truly vanished into the ether!\nPhoenix:\n(Just what is he going on about!?)Maya:\nThere's something suspicious about Detective Atmey... How could he not have noticed when the thief came in?Phoenix:\nAlso, he says he was knocked unconscious before he could fight back... But that can't be right. It contradicts the evidence.Maya:\nHuh? Which piece...?Phoenix:\n(The real question is... Why would he tell such an obvious lie?)Phoenix:\n...Mr. Atmey. Could you take a look at this with that special monocle of yours?Atmey:\nAha! This belongs to the criminal mastermind, my arch-nemesis, Mask☆DeMasque! It is, in point of fact, Mask☆DeMasque's broach!Phoenix:\nIt was found on the floor of the basement warehouse. I wonder how that happened?Atmey:\nHa... Elementary, my dear lawyer. Obviously it wasn't glued on well enough.Phoenix:\nNot quite. It clearly shows signs of having been ripped off a piece of clothing.Judge:\nRipped off...? Aha!Phoenix:\n...We can only deduce that the thief struggled with someone that night! That's the only thing I can think of. And there's only one person that was in a position to have a struggle with the thief. The only person that was on security duty that night...You, Detective Atmey!Atmey:\n...Urk!Phoenix:\nDetective Atmey! You must have fought with the thief that night! (Changed from [Detective Atmey! You must have fought with the thief last night!] in the original release) So, why did you lie in your testimony to the court?Judge:\nWitness! Giving false testimony is a serious crime!Atmey:\nErr, I... N-No! W-Wait just a moment, Sir Old-Timer!Judge:\nDon't talk to me like I'm living in a nursing home!Atmey:\nHee hee hee he he he... I just remembered, Your Honor. I was just confused because I've been dealing with so many cases lately.Godot:\nThe true measure of a man is in the amount of work he does. That's what I always say.Maya:\nNick, you can only handle one case at a time... Isn't that right?Phoenix:\nYou talk too much.Judge:\nWitness! So are you now saying that you and the thief fought?Godot:\nHold on. That's quite enough... Your Honor.Judge:\nE-Excuse me...?Godot:\nSave the big questions for the testimony. That's one of my rules.Atmey:\nIndeed! I understand! I, Luke Atmey, agree completely!Witness Testimony-- Fight With The Thief --Atmey:\nIndeed, it's true that I looked away from the door for a brief moment.\nHowever... Luke Atmey cannot be so easily discombobulated!\nUnfortunately, the thief grabbed a weapon from the side and... rendered me senseless.\nA true gentleman fights only with his own fists... But they were not enough.\nHis first blow struck true! Bam! ...And that's all she wrote.Judge:\nSo in the end, you did catch a glimpse of Mask☆DeMasque?Atmey:\nCorrect. It was during his third crime that he struck me from behind. It seems that my memory has become a tad jumbled, so to speak.Judge:\nHmmm... Well, that's certainly understandable. I, myself, always get confused about which testimony goes with which case.Phoenix:\n(Th-That can't be good...)Cross Examination",
      "testimonies": [
        {
          "testimony": "Indeed, it's true that I looked away from the door for a brief moment.",
          "person": "Atmey",
          "present": []
        },
        {
          "testimony": "However... Luke Atmey cannot be so easily discombobulated!",
          "person": "Atmey",
          "present": []
        },
        {
          "testimony": "Unfortunately, the thief grabbed a weapon from the side and... rendered me senseless.",
          "person": "Atmey",
          "present": []
        },
        {
          "testimony": "A true gentleman fights only with his own fists... But they were not enough.",
          "person": "Atmey",
          "present": []
        },
        {
          "testimony": "His first blow struck true! Bam! ...And that's all she wrote.",
          "person": "Atmey",
          "present": []
        },
        {
          "testimony": "I put my back to the wall to fight, but the thief's blow landed upon my third eye.",
          "person": "Atmey",
          "present": [
            "Shichishito"
          ],
          "source": {
            "evidence_span": "DeMasque knocked Atmey out during the crime w/ a blow to the back of the head.",
            "testimony_span": "the thief's blow landed upon my third eye",
            "explanation": "The witness is hit from behind, not on the forehead.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        }
      ],
      "noPresent": false,
      "labels": [
        "spatial"
      ],
      "reasoning": [
        "Fact 1: The witness claims he was hit on the forehead.",
        "Fact 2: The evidence suggests the witness was hit on the back of the head."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- Fight With The Thief --Atmey:\nIndeed, it's true that I looked away from the door for a brief moment.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo why did you look away from the door anyway?\nAtmey:\nIn addition to the camera, I had prepared a variety of other sensors as well. The alarm on one of those had gone off, so I had to check the data. That's why I went to the computer! ...Elegantly, of course!\nPhoenix:\nSo you were momentarily vulnerable when you were working on the computer? (What should I do? Should I ask some more questions...?)\n\n\n\nThat's enough\n\n\n\n\n\n\n\nPhoenix:\n(Well, we know for sure that Atmey looked away from the door. I think I should ask about something else now...) Alright. So you looked away from the door. ...And then?\nLeads back to cross-examination\n\n\n\n\nAbout the sensor\n\n\n\n\n\n\n\nPhoenix:\nWhat kind of sensors are you talking about?\nAtmey:\nThere are other places in the basement that someone could enter and exit from. There are air conditioner ducts, sewer pipes... And a cat door as well. I hooked up heat-detecting, infrared and ultra-violet sensors to each of them.\nPhoenix:\nThat's a lot of hardware... Was it all yours?\nAtmey:\nLordly Tailor Department Store was kind enough to provide the monitoring hardware. Naturally, the security camera that look the photo belongs to them as well.\nPhoenix:\n(In other words, he couldn't have rigged the equipment, huh...?)\nAtmey:\nHee hee hee hee hee... Has that cleared up any doubts you had about me, Sir Lawyer?\nLeads back to cross-examination\n\n\n\n\nAbout the computer\n\n\n\n\n\n\n\nPhoenix:\nSo did that computer belong to Lordly Tailor as well?\nAtmey:\nCorrect. Well, except for the program that manages the data. That was specially designed by me, Luke Atmey!\nPhoenix:\n(In that case, he could have easily manipulated the data.)\nAtmey:\nHee hee hee hee hee... What's wrong, Sir Lawyer?\nLeads back to cross-examinationAtmey:\nHowever... Luke Atmey cannot be so easily discombobulated!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nUmm... What does that mean? \"Discombobulated\"?\nJudge:\nHmm... Young people these days... They really irritate me. They allow perfectly good old words to die until everyone forgets what they mean.\nPhoenix:\nSorry, but what exactly DOES it mean anyway?\nJudge:\n...Now I've forgotten. What was I saying?\nPhoenix:\n(Jeez. It's better than old people who forget what they were saying 5 seconds ago!)\nGodot:\n...Well, it looks like we've cleared that up. You can go on with your testimony.Atmey:\nUnfortunately, the thief grabbed a weapon from the side and... rendered me senseless.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhat do you mean by \"weapon from the side\"?\nAtmey:\nNaturally, that thief had no idea that I, Luke Atmey, was hiding in the area! He grabbed the sword from the statue that was standing by the door to the warehouse.\nPhoenix:\nSword...? You mean the sword that was all twisted like a tree branch?\nAtmey:\nCorrect. Fortunately for me, the blade was not sharp.\nPhoenix:\n(OK. so he IS talking about the Shichishito...)\nJudge:\nSo the thief armed himself with a sword. And what about yourself, witness?Atmey:\nA true gentleman fights only with his own fists... But they were not enough.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou had that much faith in your own fighting abilities?\nAtmey:\nBut of course. In college, I was the 2nd in-charge of the boxing club.\nJudge:\nI'm sorry if I fail to find that appropriately impressive.\nAtmey:\nHowever! My opponent in the ring this time was my arch-nemesis, Mask☆DeMasque!\nPhoenix:\n(This guy is a real piece of work...)Atmey:\nHis first blow struck true! Bam! ...And that's all she wrote.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nCan you tell us a little more about what happened?\nAtmey:\nMy opponent was both powerful and vicious. You might say he was... \"powericious\".\nPhoenix:\n(\"P-Powericious\"?)\nAtmey:\nI assumed the \"Atmey Fighting Stance\", but a sudden flash of light blinded me! That of course was checkmate! My opponent had bested me.\nPhoenix:\n(What do I do now? Should I ask more about this...?)\n\n\n\nLeave it\n\n\n\n\n\n\n\nPhoenix:\n(Well, I guess it's true that Atmey was knocked senseless after all. I'd better ask him about something else instead...)\nLeads back to cross-examination\n\n\n\n\n\"You were blinded\"?\n\n\n\n\n\n\n\nPhoenix:\nSo what was this flash of light that blinded you?\nAtmey:\n...I was bathed in a golden light that seemed to come from the statue of the woman.\nPhoenix:\n(The statue of Ami Fey, I'm guessing...)\nMaya:\nWell that wasn't very much help at all...\nLeads back to cross-examination\n\n\n\n\n\"Atmey Fighting Style\"?\n\n\n\n\n\n\n\nPhoenix:\nWhat is this \"Atmey Fighting Style\"?\nAtmey:\nI'm sorry but that's a trade secret... I really can't say any more. But, I suppose I can tell you if I absolutely must. The main thing is to put your back to the wall. That way no one can get behind you.\nPhoenix:\n(That's it...? That's the \"Atmey Fighting Style\"?)\nJudge:\nHmmm... Well, Mr. Wright? What about that testimony...?\n\n\n\nIt was a waste of time.\n\n\n\n\n\n\n\nPhoenix:\n(Well, I guess it's true that Atmey was knocked senseless after all. I'd better ask him about something else instead...)\nLeads back to cross-examination\n\n\n\n\nIt was very important.\n\n\n\n\n\n\n\nPhoenix:\nOf course it's important! We've learned a detective's SECRET technique, after all.\nJudge:\nYes, indeed... I'll remember to use it if I ever take a walk alone late at night.\nPhoenix:\n(Why the heck is he eye-balling me like that...? It's creeping me out...)\nJudge:\n...Now then, witness! We'll go ahead and add that secret information to your official testimony!\nChanges statement from \"His first blow struck true! Bam! ...And that's all she wrote.\" to \"I put my back to the wall to fight, but the thief's blow landed upon my third eye.\"Atmey:\nI put my back to the wall to fight, but the thief's blow landed upon my third eye.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nUmm... Where is this \"third eye\" you're talking about?\nAtmey:\nOh... it's right between my right and left eye brows. ...It's quite invisible to the unenlightened. You may call it the forehead, if you like.\nPhoenix:\n(Why didn't you just say that in the first place!?)\nAtmey:\nSir Lawyer! It looks like the creases in your own forehead are getting deeper!\nMaya:\nSo Mr. Atmey got hit on the forehead then?\nPhoenix:\nThat's what he says.\nMaya:\nHmm... I've got a funny feeling about that.\nPhoenix:\n(Actually, so do I.)Present Shichishito\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"Detective Atmey! Your testimony is crumbling like a house of cards.\"Maya:\nWell what do you think, Nick?Phoenix:\nWell, there's one thing that I'm absolutely sure of now.Maya:\nYeah? What is it!?Phoenix:\nThe Luke Atmey guy... He's definitely hiding something!Maya:\nB-But why?Phoenix:\nI think I'm starting to figure out what really happened that night. (...And about the true nature of this \"detective\".)Phoenix:\nDetective Atmey! Your testimony is crumbling like a house of cards.Atmey:\nWhat fun this is, Sir Lawyer! It is truly a pleasure to cross swords with you! And now, once again, you have thrown down the gauntlet at my armored feet...Phoenix:\nI believe this is what you said yesterday.Atmey:\nNo, the coward must have wormed his way in through somewhere besides the door... Then my arch-nemesis struck me on the head from behind with this gruesome item here!Judge:\nFrom behind, huh?Phoenix:\nBut just now you testified that he struck you on the forehead... I hardly think you could forget where you were hit on the head!Atmey:\n...Urk! It seems... I-I've made another mistake.Phoenix:\n...Detective Atmey. That's not the only strange part of your testimony.Judge:\nWh-What do you mean by that?Phoenix:\nFor example... The very fact that you hid the calling card from the police itself is strange! It's almost as if... You were afraid they were going to help with security!Atmey:\nU-Urk...! Geniuses such as myself have always been misunderstood! How sad...Phoenix:\nThat's wrong!Godot:Godot:\n...To err is human, to forgive divine. Humans aren't machines... They have souls, feelings. They live, they die, they love, they hate... And yes, they even make mistakes...Phoenix:Phoenix:\nHey, hold on! It-It's not as pretty as that!Godot:\nReally? What is it like then!?Phoenix:\n...!Godot:\nAlways chase a riddle down to the end. That's one of my rules.Phoenix:\n(This is it... This might just be my chance to turn things around!)Judge:\n...Mr. Wright. What exactly is it that you're asserting?Phoenix:\nVery well, Your Honor. The defense asserts that...Mr. Atmey is no Ace Detective!\n\n\n\n\n\n\n\nPhoenix:\nThe truth is... this witness is no Ace Detective at all!\nAtmey:\n...So then what exactly are you saying that I am?\nPhoenix:\nUh, umm... Well, an average detective...?\nJudge:\nI hardly see the relevance of that.\nMaya:\nWh-What are you doing, Nick!? Weren't you going to go on the attack?\nPhoenix:\nI was planning on it, but it looks I'm the one who got attacked instead.\nJudge:\nThink harder next time!\nLeads back to:\n\"...Mr. Wright. What exactly is it that you're asserting?\"this Mr. Atmey is a fake!\n\n\n\n\n\n\n\nPhoenix:\nThis witness isn't Luke Atmey... He's a fake!\nAtmey:\n...So now it's not just Mask☆DeMasque. You're saying I'm a fake, too?\nPhoenix:\nAn Ace Detective could never be as forgetful as this guy!\nGodot:\nImposters like you are often suspicious of others as well.\nJudge:\nReally, this is too much. Next you'll be calling me a fake, too!\nLeads back to:\n\"...Mr. Wright. What exactly is it that you're asserting?\"Mr. Atmey is Mask☆DeMasque!\n\n\n\n\n\n\n\nLeads to:\n\"The answer is simple! It's all clear to me now!\"Phoenix:\nThe answer is simple! It's all clear to me now! Detective Luke Atmey's true identity is actually... Mask☆DeMasque!Atmey:\nYeeeeaaargggh!Judge:\nOrder! Order in the court! Mr. Wright! What is the meaning of this!?Phoenix:\nThere are too many unnatural parts to Mr. Atmey's story. He says he was \"hiding\" at the crime scenes, which is why no one ever saw him there. And then, in his last case, he manages to outperform Detective Gumshoe and... ...the entire police force to \"miraculously\" retrieve the stolen treasure.Atmey:\nTh-That's because... I analyzed the crime scene data and made an exquisitely elegant deduction. I picked up clues that the police overlooked in order to arrive at a...Phoenix:\nOh, please! The explanation is far simpler than that, \"Detective Atmey\"! The truth is that you are, in fact, Mask☆DeMasque.Atmey:\nGurk...!Judge:\nB-But Mr. Wright! Th-This photo! It clearly shows Mask☆DeMasque! This security camera belongs to Lordly Tailor Department Store! He shouldn't have been able to manipulate it...Phoenix:\nHe didn't need to manipulate it! He gained access to the warehouse under the pretense of providing \"security\"... Then he simply dressed as the \"thief\" and stole the urn.Judge:\nSo... the Ace Detective is actually an Ace Thief! Is this true, witness!?Atmey:\n... Aha... Hee hee hee ha ha ha Aha ha ha ha ha ha ha! Ho ho ho hee hee hee! DeMasque's M. O. is pure genius! And so am I, Luke Atmey, Ace Detective!! You're very clever to have come to such a conclusion! I am impressed, Sir Lawyer!Judge:\nWh-Whaaaaat!? Witness! You... You're admitting it!?Maya:\nN-Nick! Now's your chance!Phoenix:\nYes! Time to put the last nail in this guy's coffin! Detective Atmey! When you assumed the thief's identity--Godot:Godot:\nGodot Blend #102... ...My personal favorite.Judge:\nM-Mr. Godot!Godot:\n\"The Ace Detective is actually an Ace Thief!\" I smell a best-selling novel! There's only one problem... It simply isn't true.Judge:\nB-But Mr. Godot! Mr. Wright has made some very strong points and I...Godot:\nI will admit my opponent has woven a compelling narrative out of whole cloth. But it is, in fact, nothing more than a patchwork quilt. Mr. Trite... If this detective really is the thief, then show us the proof of your claim. But it had better be as hot... and as perfect as the coffee dripping down your face!Judge:\nWell, Mr. Wright!? Don't just stand there! This court would like to see this decisive proof you have! Quickly!Phoenix:\nHuh!? Oh! Y-Yes, of course! (Wh-What's the big rush...?)Maya:\nAre you alright, Nick?Phoenix:\n(Atmey looks pretty rattled right now... I'd like to finish this right now if I can. But can I really do it?) The decisive evidence that proves Mr. Luke Atmey is in fact Mask☆DeMasque...is right here!\n\n\n\n\n\n\n\nPhoenix:\nAs usual, the defense comes prepared, Your Honor!\nJudge:\nVery well then... Let's see what you've got. Please present proof that Mask☆DeMasque is actually Mr. Luke Atmey!\n\n\n\nPresent anything\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHere's your proof!\nJudge:\nWhat do you think, Mr. Godot?\nGodot:\nIt looks to me like Mr. Trite is still a mite sleepy. Perhaps he'd like a big mug of my special Godot blend? Well?\nPhoenix:\nN-No thanks, I'm fine! Really! (What do I do now? Another mistake like that and I'm through! Without some decisive evidence, I could be risking everything...)\n\n\n\nI've got all I need.\n\n\n\n\n\n\n\nLeads back to:\n\"As usual, the defense comes prepared, Your Honor!\"\n\n\n\n\nI don't have a thing.\n\n\n\n\n\n\n\nLeads to:\n\"Proof? Of course I... I... ...I've got nothing.\"has yet to be found!\n\n\n\n\n\n\n\nLeads to:\n\"Proof? Of course I... I... ...I've got nothing.\"Phoenix:\nProof? Of course I... I... ...I've got nothing.Godot:\nHa...! Just what I thought. A man has to told his head up high no matter how bad things get, after all.Phoenix:\nUuugh...Judge:\nI see... I thought perhaps you had some evidence to back up your assertion...Phoenix:\n(This is no good! I've got to stay on the attack! I'll never get another chance to prove that this guy is the thief!)Maya:\nDon't give up, Nick! Think harder and try again!Phoenix:\nIt's no good... I'm just not ready yet...Maya:\nB-But... Are you going to just give up and let us lose this?Atmey:\nSo, you've come to your senses, have you, Sir Lawyer?Phoenix:\nI... Unnngh... (Argh! I can't think of a counter-attack at all...)Judge:\nIt seems the cloud of suspicion surrounding this witness has lifted. Mr. Godot. If you have anything further to add, then--???:Judge:\nWh... Wh-Who... ...Who are you?Desirée:\nThat doesn't really matter right now, does it?Phoenix:\nMs. DeLite! What are you doing here?Desirée:\nNicky boy! The thing you've been looking for... I think I found it!Judge:\nYou mean... that bag!?Desirée:\nNo, not the bag! What's in the bag! ...Well?Judge:\nTh-That's...Maya:\nThe Sacred Urn!! Nick! It's the urn!Judge:\nOrder! Order! Order! ...You! Madame...! That urn... Where did you find it!?Desirée:\nYou'll never believe it... It was in the office of Mr. Fancy Pants Ace Detective! ...Luke Atmey!Ron:\nOh, Dessie! You're the best!Sacred Urn updated in the Court Record.Phoenix:\nWell? How do you explain that one, Mr. Atmey!?Atmey:\n...Phoenix:\nEven you are going to have a hard time weaseling out of this one!Godot:Godot:\nHa...! Pathetic...Judge:\nMr. Godot...? Do you have something you wish to say?Godot:\nYes, Your Honor... It simply amazes me how quickly times change... In the old days, a man was to be taken at his word. It's truly sad...Judge:\nYou're still denying that Mr. Atmey was involved!?Godot:\nBefore casting aspersions at Detective Atmey, consider the young lady here. Your name is Desirée... Desirée DeLite. Is that correct?Desirée:\nY-Yes! What about it?Godot:\nHa...! How charming... The lengths that a woman is willing to go to save her husband is truly inspiring.Desirée:\nWh-What are you insinuating!?Godot:\nAs the wife of the criminal, you could have \"discovered\" that stolen urn anywhere. Including the office of the good detective here. So you found the urn. What does that prove? It certainly doesn't prove where the urn was before you \"found\" it.Desirée:\nWhat...? I just brought it here from the detective's office!Godot:\nPlease Madame... This town is already filled to the brim with lies. Any more could only compound the tragedy we have been witness to.Desirée:\nYou're wrong! I would never...! I would never do such a thing!Phoenix:\nMs. DeLite...Desirée:\nPlease, Nicky boy! You've got to help me talk some sense into these people!Phoenix:\n(There must be some way! I've got to prove that urn was actually in the Atmey Detective Agency...)Testify about what I saw\n\n\n\n\n\n\n\nPhoenix:\n...\nGodot:\nWhat's wrong? Isn't it your job to come up with something to say...?\nMaya:\nNick! Come on! It should be easy to prove! After all, we checked out that bag, didn't we?\nPhoenix:\nYou're right. I remember doing that. Whatever was in there, it was hard and round... And smooth, too.\nMaya:\nYes! It must have been the urn! It must have!\nPhoenix:\nBut... I never actually saw it with my own eyes.\nMaya:\n...?\nPhoenix:\nAtmey walked in just when I was about to have a look at it... So even if it was the urn in there, I can't testify that it was.\nMaya:\nAck! You're right!!\nGodot:\nHa...! It looks like I was wrong about you, Mr. Trite. In this town overflowing with lies, there's still a single flickering candle of truth.\nDesirée:\nNicky boy...!\nPhoenix:\n(Well, it's true that I never actually saw the urn... But maybe I can still testify about it from another angle!)\nJudge:\nWhat about it, Mr. Wright? Have you given up yet...?\nLeads back to:\n\"There must be some way!\"Show fingerprints on the urn\n\n\n\n\n\n\n\nPhoenix:\nI can prove where the urn was... ...by the fingerprints on it!\nJudge:\nFingerprints, eh...\nAtmey:\nOh come now! Now you're really making me laugh, Sir Lawyer! Fingerprints indeed!\nPhoenix:\n...\nAtmey:\nMay I go on? Good. Now it would be perfectly understandable if my fingerprints were on the urn. After all, it was I who was guarding the urn in the first place! In any case, I am always in the habit of wearing gloves as you can see. So unfortunately, my fingerprints wouldn't be evidence of anything.\nJudge:\nWhat about it, Mr. Wright? This witness's fingerprints would mean nothing anyway.\nMaya:\nN-Nick, what are you going to do now?\nPhoenix:\n(I've come too far to turn back now! Atmey must have brought the urn back to his office yesterday... And there, I'm sure someone must have left their fingerprints on it...!) The defense proposes that the fingerprints of this person should be on the urn!\n\n\n\nPresent Phoenix Wright profile\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"So what is all this fuss about fingerprints anyway...?\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nPhoenix:\n\nGodot:\nLet me give you an important piece of advice. The one who keeps a cool head all the way until the game's end is the winner.\nJudge:\nLet me give you an even more important piece of advice, Mr. Wright... You are not going to win this game with that answer.\nMaya:\nWow... Even the judge is making cool, snappy remarks now...\nPhoenix:\n(D-Does that mean I was wrong again? Hmm... The urn was put in that bag and carried to the detective's office yesterday. That means the person I should be fingering is... the person who left their prints on the urn yesterday at the Atmey Detective Agency!)\nMaya:\nDo you really think there's someone that could fit the bill?\n\n\n\nName another person\n\n\n\n\n\n\n\nJudge:\nWell, Mr. Wright? What have you decided?\nPhoenix:\nYour Honor! Please give me just one more chance!\nLeads back to:\n\"The defense proposes that the fingerprints of this person should be on the urn!\"\n\n\n\n\nThink it over again\n\n\n\n\n\n\n\nJudge:\nWell, Mr. Wright? What have you decided to do?\nPhoenix:\nForgive me, Your Honor. I've decided to think the whole thing over again.\nLeads back to:\n\"There must be some way!\"I can't prove anything yet\n\n\n\n\n\n\n\nPhoenix:\nI can't prove anything yet.\nMaya:\nBut Nick!\nJudge:\nVery well... It looks like that's all then.\nGodot:\nExactly... And this urn is all the proof I need to make my case...\nPhoenix:\nWhat?\nGodot:\nYou still don't get it, huh? Listen closely, Mr. Trite. This is the urn that Mask☆DeMasque stole, right? Now the wife of the accused comes strolling in here with the very same urn, correct? Now, who would you think is the thief?\nPhoenix:\nAh...!\nDesirée:\nNo! That's wrong! That's not why I've got it...\nMaya:\nN-Nick! Y-You can't let him do this...\nPhoenix:\n(Hmm, this isn't good... There has to be another way around this...) Your Honor! Please let me think it over one more time!\nJudge:\nMr. Wright. It's high time that you learn your lesson. The courtroom is no place for poorly thought-out or rash declarations!\nPhoenix:\n(I have to be careful... He won't be so nice next time...)\nLeads back to:\n\"There must be some way!\"Atmey:\nSo what is all this fuss about fingerprints anyway...?Phoenix:\nMr. Atmey... Do you recall the events of yesterday?Maya:\nHey, Nick! Come on! Open it up!Phoenix:\nHey! Wait a minute! We can't just open his private property!Maya:\nDon't be such a fuddy-duddy! This is an important investigation! Well? What's in there?Phoenix:\nH-Hang on a sec. I'm taking it out now... (Whatever it is, it feels... kinda hard... and smooth...)Atmey:\n...Well, hello there!!Phoenix:\nIt's true that I didn't get a chance to look in the bag at that time. But! I did touch what was inside.Atmey:\nWh-What!? Y-You touched it...?Phoenix:\nAnd I remember it very well. It was \"smooth and hard\".Atmey:\nW-Well, err... Th-That was just...Phoenix:\nYour Honor! I'd like the court to examine the fingerprints on that urn. If my fingerprints are on there... Then it proves that the urn was in Detective Atmey's office!Godot:Godot:\nWell, even if your fingerprints are on the urn... ...it still doesn't prove when they were put there, does it?Phoenix:\nOf course it does.Godot:\nWh-What did you just say!?Phoenix:\nIt's not what I say, it's what Adrian Andrews, the person in charge of the exhibition said. (Changed from [Not what I said, it's what Adrian Andrews, the person in charge of the exhibition said.] in the original release)Andrews:\nI polished it until it was just about glowing... I thought maybe I could make it looks more valuable!Phoenix:\nIf she polished it that much, she must have removed any and all fingerprints on it. And the only chance I had to get my fingerprints on it after that was... Yesterday! At the Atmey Detective Agency!Godot:\nHa...! This blend... Godot Blend #107... I've decided... It's a little too bitter after all!Judge:\nOrder! Order! Order! I accept the defense's request! Bailiff! Take this urn and...Atmey:\nWait! Wait a moment, Your Honor! ...There's no need for that.Judge:\nN-No need you say...?Atmey:\nPrecisely... I already know Mr. Wright's fingerprints are on the urn...Judge:\nWh-What are you saying!Phoenix:\n(Yes! I've finally broken him down!)Atmey:\nHee hee hee ha ha ha Aha ha ha ha ha ha ha! Ho ho ho hee hee! Take a good look, everyone! Unable to find a rival worthy of my genius, I was forced to create one by myself! Here I am! The tragic clown...Maya:\nThis guy is nuttier than a fruitcake...Atmey:\nYou see! It was me all along! I am the one and only Mask☆DeMasque! Ha ha! I hope you all enjoyed my little performance! Hee hee hee ha ha ha Aha ha ha ha ha ha ha! Ho ho ho hee hee hee!Judge:\nWell, Mr. Godot... What's Mr. Atmey's condition?Godot:\nHe's still in the lobby, laughing insanely, Your Honor. I wish I could enjoy the joke as much as he seems to be.Judge:\nWell, it looks like the matter has been settled. I came perilously close to besmirching the record of an innocent young man. Besmirching him with the title of \"thief\"!Maya:\nNick, you were right after all!Phoenix:\n(Yeah! I guess Mr. DeLite really wasn't the thief!)Judge:\nThe court finds the defendant, Mr. Ron DeLite...???:Ron:\nYou're wrong! Wrong I tell you! Err, umm, I mean... Not exactly wrong so much, but actually not right is what I really trying to sayPhoenix:\n(Oh no... He's not... This can't be happening...)Ron:\nThe thief... The sneaky, odious thief who's been stealing all the treasures... It's me! I'm him! I'm the one you want! I'm the thief I tell you! So do it...! Pronounce me guilty! Pleeeease!!Phoenix:\n...Godot:\n...............Judge:\nI don't know what kind of a kangaroo court you all think this is, but...Phoenix:Phoenix:\nThe true identity of the thief has already been proven! Please hurry and pass judg--Ron:\nWhat are you talking about!? I already confessed! I'm the thief I tell you!Judge:\n...Mr. Godot! Don't just stand there drinking coffee!Godot:\nHa...! Hey there, Mr. Thief...Ron:\nY-Yes! Yes, sir!?Godot:\nIf you're really a man, then clean up your own mess.Ron:\nI-I'm sorry... I'm afraid I just don't have any idea what do you mean.Godot:\nIf you are Mask☆DeMasque... then prove it. That's what it means.Ron:\nY-Yes, sir! I'll be happy to!Maya:\nHe says he'll be happy to, Nick...Phoenix:\nIt's kinda cute... He's 100% committed to his fantasy.Godot:\nGood boy! Just remember one thing. A boy only gets one chance in his life to become a man!Ron:\nI-I know that! I-I won't fail! I swear!Godot:\nOK, then... Talk! ...We're all listening.Judge:\nOh well... Let's all have a listen to this \"confession\"...Witness Testimony-- Mask☆DeMasque's Identity --Ron:\nThe truth is, I've been Mask☆DeMasque all along!\nI mean, you can't prove that I'm not actually Mask☆DeMasque, can you?\nI don't have an alibi for the night the urn was stolen, after all!\nI donned my costume that night and dancingly descended upon the scene of the crime!\nLook! You can see right there in the photo! That's me!\nAs for my broach, I snagged it on the door handle and it got torn off, that's all!Judge:\nHmm... I don't like the direction this trial has taken...Phoenix:\n(But this is how every trial goes... At least with me, anyway...)Godot:\nHa...! You're doing great!Ron:\nHee hee hee... Stop it, Mr. Godot... You're embarrassing me.Godot:\nLike I said, you're only going to get one chance to testify, alright? But if you make it through this with flying colors, I'll keep my promise, too. I'll make sure you stay locked up in prison as the one and only true Mask☆DeMasque!Ron:\nThanks so much, Mr. Godot! I... I'll do my best!Judge:\nAlright, Mr. Wright. I'm afraid it's time for the cross-examination.Phoenix:\n*sigh*Cross Examination",
      "testimonies": [
        {
          "testimony": "The truth is, I've been Mask☆DeMasque all along!",
          "person": "Ron",
          "present": []
        },
        {
          "testimony": "I mean, you can't prove that I'm not actually Mask☆DeMasque, can you?",
          "person": "Ron",
          "present": [
            "Ron's Wallet",
            "Key Card"
          ]
        },
        {
          "testimony": "I don't have an alibi for the night the urn was stolen, after all!",
          "person": "Ron",
          "present": [
            "Ron's Wallet",
            "Key Card"
          ],
          "source": {
            "evidence_span": "Found by Larry at his part-time security job's company building (night of the crime).",
            "testimony_span": "I don't have an alibi for the night the urn was stolen",
            "explanation": "The time that the wallet was found proves that Mr. DeLite was, in fact, at KB Security that night, which that proves that he has a watertight alibi.",
            "is_self_contained": "no",
            "context_span": "The Sacred Urn of Kurain Village will be displayed in Lordly Tailor."
          }
        },
        {
          "testimony": "I donned my costume that night and dancingly descended upon the scene of the crime!",
          "person": "Ron",
          "present": []
        },
        {
          "testimony": "Look! You can see right there in the photo! That's me!",
          "person": "Ron",
          "present": []
        },
        {
          "testimony": "As for my broach, I snagged it on the door handle and it got torn off, that's all!",
          "person": "Ron",
          "present": []
        }
      ],
      "noPresent": false,
      "labels": [
        "spatial"
      ],
      "reasoning": [
        "Fact 1: The witness claims he did not have an alibi the night the urn was stolen.",
        "Fact 2: The evidence suggests the witness' belongings were found at KB Security that night.",
        "Fact 3: The context suggests that the urn was displayed in Lordly Tailor.",
        "Fact 4: The someone's belongings were found at a place, they were at that place.",
        "Fact 5: If someone is not at the place where a crime happens, they have an alibi."
      ]
    }
  ]
}