{
  "previousContext": "Episode 5Bridge to the Turnabout\n\"Shichishito\". The treasured Kurain Village heirloom whose name means \"7 Branched Sword\". It is said that this sacred sword represents life itself. Though the branches may appear to be infinite, the choices limitless... ...like our destinies, the sword comes to but one end. One merciless point. And when the silver cord, the fragile thread that binds us to this world, is severed... ...the illusion is revealed and the implacability of fate is finally laid bare...\nFebruary 6, 9:48 AMWright & Co. Law Offices\nMaya:\nHey, Nick.\nPhoenix:\nYeah? What is it?\nMaya:\nYou know how I've got spiritual powers, unlike you?\nPhoenix:\nUm, sure... You are a spirit medium, after all.\nMaya:\nBut just like you, if I don't keep my powers sharp, they get dull, right?\nPhoenix:\nUm... I guess so, yeah.\nMaya:\nGlad you agree! OK, Pearly! You're up!\nPhoenix:\n(Pearls...?)\nPearl:\nSo! That's why we need to go on a special \"Spiritual Hot Spot Tour\", Mr. Nick!\nPhoenix:\n...Huh? I'm lost. What's this magazine you're shoving in my face?\nPearl:\nIt's the New Year's issue of \"Oh! Cult!\", Winter Spiritual Locations Special!\nPhoenix:\n...Oh. (Pearls looks so happy.)\nMaya:\n\"Maximize your spiritual powers with just one night of intensive training!\" ...Oh! It sounds too good to be true!\nPhoenix:\nI'll say. It sounds more like a scam to me.\nMaya:\nIt's at a spiritual retreat called \"Hazakura Temple\". It's way up in the mountains, and I bet it's nice and cold. ...Just perfect for training!\nPhoenix:\n(Now I definitely don't want to go...)\nMaya:\nYou know, I think I've heard of this temple before. It's a famous channeling dojo. It's hard for even real spirit mediums like us to make reservations up there!\nPhoenix:\nReservations...? For a temple? Are you serious?\nPearl:\nDon't worry! I've already made special reservations, just for us!\nMaya:\nYeah! And I signed up for the \"Special Course\"!\nPhoenix:\nTh-That's nice. And the timing couldn't be better. ...Since we don't have a case right now anyway.\nMaya:\nAlrighty then! It's settled! Well, come on! Don't just stand there! Start packing your stuff!\nPearl:\nYes, Mr. Nick! You'd better start packing your stuff!\nPhoenix:\nHuh...? M-ME!? Why do I have to go!?\nMaya:\nWell, we have to be accompanied by someone over 20 years old.\nPhoenix:\nHey! I don't have anything to do with spirit power. The only thing I can channel is a TV. ... So, um, is there a heated pool at this \"Hazakura Temple\"?\nPearl:\nNo, but you can stand under a freezing waterfall!\nPhoenix:\n... Sorry, but I think I'll pass. I hate cold places.\nMaya:\nWhaaat!? No way! How can you be so selfish!?\nPearl:\nCome on, Mr. Nick! Look at this place! Doesn't it look beautiful!?\nPhoenix:\nNope. Not going. I'm gonna be nice and toasty at home....... .................What the...!?\nPearl:\nWh-What is it, Mr. Nick?\nPhoenix:\nLet me see that magazine! Th-This nun...\nMaya:\nIs she a friend of yours or something, Nick?\nPhoenix:\n(Th-This girl... I-It's...!)\nDahlia:\nMy name is Dahlia Hawthorne. I just want to say... It's an honor for me to be here in your noble presence.\nDahlia:\nHonestly, how can any woman ever count on you for anything? ...You disgust me!\nPhoenix:\nBut... It can't be! (She was found guilty and should still be in prison...)\nPearl:\n...Mr. Nick?\nPhoenix:\n... I'll go.\nMaya:\nHuh...?\nPhoenix:\nHazakura Temple... I said I'll go.\nMaya:\nYay! Isn't that great, Pearly!?\nPearl:\nYes! Oh, thank you! Thank you, Mr. Nick! You'd do anything for Mystic Maya, right? Even walk over burning coals, right!?\n\"Oh! Cult!\" New Year's Issue received from Pearls.\nPhoenix:\n(Dahlia Hawthorne... I knew there was no way she could possibly be at that temple... But, I just had to be see for myself... ...who this \"nun\" really was.)\nFebruary 7, 3:24 PMHazakura TempleMain Gate\nMaya:\nBrrrrr... It-It-It's so c-c-cold here, Nick!\nPhoenix:\nMaybe you should put on something warmer for a change!\nMaya:\nW-W-Well, it's supposed to be c-c-cold... It's t-t-training. ...Ah-Achoo!\nPhoenix:\n(Her teeth are chattering so loudly, it's all I can do to make out what she's saying...)\nPearl:\nWow, Mystic Maya! So this is the famous Hazakura Temple!\nMaya:\nP-P-P-Pearly... I-I-I-I... Ah-Achoo!\n???:\nWell, well, well... How nice to see you here. Welcome to our temple!\nMaya:\nOh...! Th-Th-Thank you... Ah-Achoo!\n???:\nOh my, my, my... Thank you for coming all this way. Come now, come now. You must have been cold.\nPhoenix:\nWhat's with the past tense...? We're freezing into human popsicles as we spea--!\n???:\nHo ho ho. Well, we are high up in the mountains after all. In any case, we shouldn't speak here. ...Please follow me inside.\nMaya:\nTh-Thank you. I was starting to think I would pass--\n???:\nOh! Yes, yes! I almost forgot to introduce myself.\nBikini:\nI'm the head nun here at the temple. My name is Bikini.\nMaya:\nB-B-B-Bikini...!?\nBikini:\nThat's riiight! Actually, that's my \"temple\" name. What do you think? It's a tradition to have one, and I wanted something that has a nice image to it. So I thought, \"Why not choose a bikini?\" Besides, it makes me seem younger. Wa ha ha ha! Ho ho ho!\nMaya:\nIt certainly does! Oh, I signed up for your \"Special Course\"!\nBikini:\nWell, my, my, my. Quite brave of you considering how cold it is! Young people can be so reckless with their health! Don't blame me if you become one with those you channel. Wa ha ha! Ho ho ho!\nPearl:\nR-Reckless...?\nMaya:\n\"Wa ha ha\"...?\nPearl:\nMaybe you should take it easy tonight, Mystic Maya... We can come back another day.\nMaya:\nBut you went through all that trouble to get reservations for m--\nBikini:\nYes, yes, yes, that's right! You've come all this way, so please, enjoy yourselves! There's still time before supper, so why don't you have a look around?\nFebruary 7Hazakura TempleMain Hall\nMaya:\nBrr... It's fr-freezing in here, too! Achoo!\nPearl:\nHee hee. It reminds me of the Meditation Room in Fey Manor!\nPhoenix:\n...Pearls, you've been in an unusually good mood since we got here.\nPearl:\nWell, kids are made of energy, you know!\nPhoenix:\nAs for you, Maya, you look like you're about to catch a bad cold.\nMaya:\nW-W-Well, I'm not exactly a little kid anymore, I guess. Ah-Achoo!\nPhoenix:\n(Nngh... Is she going to make it...?)\nFebruary 7Suspension Bridge\nMaya:\nWow! Look at this broken down old bridge, Nick!\nPhoenix:\nY-Yeah, and look at that big canyon below us.\nMaya:\nHey! There's a river down there! It looks like it's flowing real fast! ...What's wrong, Nick? You look like you've seen a ghost!\nPhoenix:\nI-I'm just not very good with heights...\nMaya:\nOh... Hey! I've got it! Maybe you should face your fear and try hurling yourself off the edge? You know! One... Two... Three... Jump! It might be just what you need to get over your fear of heights!\nPhoenix:\n...Yeah, death is a real good way to overcome phobias alright. Anyway, it sure looks like a rickety bridge.\nMaya:\nCan't argue there. That's probably why it's called, \"Dusty Bridge\".\nPhoenix:\nRead it again, Maya. It says, \"Dusky Bridge\".\nMaya:\nWell, it's practically the same thing.\nAfter clearing all Talk options in Hazakura Temple - Main Gate:\nFebruary 7Hazakura TempleMain Hall\nMaya:\nTh-Th-The Main Hall... I th-think it's even c-c-c-colder in here! Achoo!\nPearl:\nAh! Mr. Nick! Do you smell that? It smells like meat and gravy!\nMaya:\nYeah, you're right! I guess it's pot roast for tonight! Yum!\nPhoenix:\n...Weird. I thought they would serve something a little more... well, traditional.\nMaya:\nWhat are you talking about, Nick!? You think monks and nuns just sit around eating rice gruel all the time!?\nPearl:\nMystic Maya is right! Ooh! I hope there's mashed potatoes, too! I love mashed potatoes!\n???:\nHa ha ha... What a cute little acolyte! Greetings to all of you.\nPhoenix:\nOh... Um, hello. (Wow, this lady makes Maya look like a 6.8/10 on the weirdness scale.)\nMaya:\nYour outfit... Did you come here for the Special Course, too...?\n???:\nHa, ha, ha... Unfortunately, no. Actually, I'm...\nPearl:\nAaaaaaaaaah! Y-You're...! Y-You're...! You're Ms. Elise Deauxnim!\nElise:\nYes, that's right... You know of me?\nPearl:\nM-M-My name... My name is Pearl Fey! I-I'm your biggest fan!\nMaya:\nWho is she, Nick?\nPhoenix:\nHmm... I see it now... Zvarri! A fortune-teller...?\nPearl:\nI-I've got all your books, Ms. Deauxnim!\nElise:\nHa, ha, ha... What a sweet thing to say. And please, call me Elise.\nPhoenix:\nUm, \"books\"...?\nPearl:\nMr. Nick, don't you know anything!? Don't you even know who this is?\nPhoenix:\nWell, um... ...An author, maybe?\nElise:\nYes, and an illustrator. ...Of picture books.\nMaya:\nPicture books, huh? Oh, now I get it...\nAfter clearing all Talk options:\nElise:\nWell, you'll have to excuse me now... I have to go help with the dinner preparations.\nPearl:\nWow! You mean you're cooking dinner tonight?\nElise:\nThat's right. Would you like to help too, Pearl?\nPearl:\nYes, yes! I want to help with whatever I can!\nPhoenix:\n(Pearls looks like she just won the lottery...)\nMaya:\nOh, I'll help too, then...\nElise:\n...No, it's fine. Please don't worry about it. Feel free to relax and explore the area with your friend.\nMaya:\nHuh!? But...\nElise:\n...Oh, yes! Please take this. I think it will be of help to you. It's a map of the area. We wouldn't want you to get lost now, would we?\nPhoenix:\n(The \"Inner Temple\"... There it is, on the other side of the bridge...) Well, if you insist, I guess we'll take this chance to go check out the other temple.\nHazakura Temple Map added to the Court Record.\nPearl:\nOK! I'll see you two later then! Remember! You're not allowed to fight!\nMaya:\nCome on, Nick! Let's go! At least we'll stay warm if we keep moving!\nFebruary 7Hazakura TempleMain Gate\nMaya:\nHuh? Where did Sister Bikini go?\nPhoenix:\nI guess she went to the Inner Temple... To go help that other nun out.\nMaya:\nOh, right... I think her name is... Iris?\nPhoenix:\nY-Yeah... That was it. (I want to find out who Iris really is, but I'm scared of what I'll find...)\nMaya:\n...?\nFebruary 7Inner Temple Gate\nMaya:\nWhoa, that bridge was shaking like jello in an earthquake.\nPhoenix:\n...\nMaya:\nAnd at least half of the wood on that rickety bridge was rotting, I bet. (Changed from [And at least half of the wood on that rickety bridge was rotting, I'd bet.] in the original release)\nPhoenix:\n...\nMaya:\nNot to mention the last part only had like one board left on it!\nPhoenix:\n...\nMaya:\nWhat's wrong with you? Your face is all green.\nPhoenix:\nC-Can you not pick on me for a second? I'm still trying to get over the shock that we made it safely across that death trap.\nMaya:\nYeah, I guess I'm a bit surprised, too... Yikes! That \"temple\" is in bad shape. It looks like it could collapse at any time... (Changed from [Yikes! That 'temple' is in bad shape. It looks like it could collapse anytime...] in the original release)\nPhoenix:\nI guess people don't use it too often. Is this really where you're going to train tonight?\nMaya:\nThat has to be it. It's kinda creepy around here... Like a ghost might jump out at you or something!\nPhoenix:\n(A spirit medium afraid of ghosts...? Isn't it ironic, don't you think?)\nFebruary 7Inner TempleTraining Hall\nPhoenix:\nMan, look at this place... It's just a tiny, freezing-cold room. So this is where you'll both be training, huh...\nMaya:\nHuh? What do you mean, \"both\"? I'm the only one.\nPhoenix:\nReally? But I thought...\nMaya:\nPearly's just a little kid. She couldn't handle this kind of intense training.\nPhoenix:\n(So says the girl who I can barely hear over her teeth chattering...) (Changed from [So says the girl who I can barely hear over her bones chattering...] in the original release)\nMaya:\nAnyway... The real training room must be behind that door over there. Hmm... Yup, definitely getting the feeling it's back there. (Changed from [Yeah, I get the feeling it's back there, definitely.] in the original release)\nPhoenix:\n(Even I can sense that there's something supernatural about the cavern behind that door...) (Changed from [If only because the cavern behind that door is giving off a real supernatural feel...] in the original release)\n???:\nUm... Excuse me, but... Who are you...? ...Ah! ...\nPhoenix:\nY-You're...\nMaya:\nHi there! We're just looking around since we're going to be staying here tonight...\n???:\n...\nMaya:\n...? Is something wrong?\n???:\nUh, er, no! It-It's nothing...\nMaya:\nI wonder why she spaced out like that. Don't you, Nick?\nPhoenix:\nUh... D-Did you say something, M-Maya?\nMaya:\n... Not you too, Nick...\nIris:\nI... M-My name is Iris. I'm one of the nuns here at this temple.\nMaya:\nI'm Maya Fey. It's a pleasure to meet you!\nIris:\nThe pleasure is mine... ... Oh, er, please excuse me! I have some... um, chores to attend to.\nMaya:\nShe sure is beautiful... and a bit spacey, I guess... I guess she's just not used to talking with urban sophisticates like us.\nPhoenix:\n...\nMaya:\nNick?\nPhoenix:\n(That girl... It-It can't be, but...)\nMaya:\n...?\nAfter examining hanging scroll in Inner Temple - Training Hall:\nFebruary 7Dusky Bridge\nMaya:\nWhew, we managed to make it across Dusty Bridge.\nPhoenix:\n...\nMaya:\nNick, you look green. Are you feeling alright?\nPhoenix:\n...\nMaya:\nHey! What's wrong with you? Ever since we met Sister Iris at the Training Hall, you've been really quiet.\nPhoenix:\nHuh!? Oh, um. Sorry...\n???:\nHey, you! ...Wait up!\nMaya:\n...? You think he's yelling at us?\nPhoenix:\nHe must be. There's no one else around...\n???:\nWould you mind moving? You're standing right in my way. ... Ah!\nMaya:\nHey! I know you! You're...\n???:\nWhoa! Sorry! Gotta run! ...See ya!\nPhoenix:\nH-Hey! Wait a minute!\n???:\nOh, uh, nice to meet you. ...I'm Laurice Deauxnim.\nPhoenix:\nLiar! You're Larry! Your clothes may change, but you're still the Butz.\nButz:\nShaddup! I'm... I'm... Lauriiiiice! And I'm just here to do a sketch of Dusky Bridge!\nMaya:\nSo... it really is our Larry. ...Not that I get why he's pretending to be someone else.\nAfter clearing all Talk options and presenting Iris profile:\nPearl:\nEveryone!\nMaya:\nHey! Pearly!\nPearl:\nDinner preparations are complete! Please come quickly to the Main Hall!\nMaya:\nAlright! I can't wait to dig in, Pearly!\nPearl:\nI'm going to go to the Inner Temple and call Sister Iris! I also want to have a look at where Mystic Maya is going to be training...\nFebruary 7, 7:46 PMHazakura TempleMain Hall\nMaya:\nBoy am I stuffed...\nPhoenix:\nAre you sure it's alright to eat that much before your training?\nMaya:\nWell, this kind of training is a battle of endurance.\nPearl:\nMystic Maya... Please don't do anything that might put your health at risk.\nMaya:\nHa ha ha. No pain, no gain, I guess.\nPearl:\nNngh... I'm still worried about you...\nBikini:\nWell, well, well. Let's not dilly-dally shilly-shally. You must get ready for tonight.\nElise:\nGood luck. ...Maya.\nMaya:\nAlright! Here I go! I'll see you all tomorrow, I guess!\nBikini:\nIris, please ring the bell at 10:00 for lights out, alright?\nIris:\nYes, Sister Bikini.\nBikini:\nAnd then, after you ring the bell, I want you to come join us at the Training Hall.\nIris:\nI understand, Sister Bikini.\nPhoenix:\n(Maya and Bikini really seem excited about this training thing tonight...)\nElise:\n...Well, Pearl? What are you going to do tonight?\nPearl:\nWell, umm...\nElise:\nIf you'd like, you can come to my room. Perhaps we can read some books together.\nPearl:\nR-Really!? I'd love to! I, umm... I'm not very good at reading.\nElise:\nHa ha ha. Well then, would you like to practice reading with me?\nPearl:\nAh! I'd love to!\nPhoenix:\n(Pearls is absolutely smitten with Ms. Deauxnim...) So Larry, what are you going to do?\nButz:\nHuh... Me? Um, well... I'm just gonna hang out in my room. I can't stand the cold at all.\nPhoenix:\n(I totally hear you there.)\nPearl:\nUm, Ms. Elise? So, for example, how do you read this?\nElise:\nIt says, \"gravely\"... That's kind of a tough word.\nPearl:\nOh! OK! And what about this word?\nElise:\nThat's another tough one. It says, \"roast\".\nPhoenix:\n(What kind of a book is she reading anyway...?)\nPearl:\nWell, I'm going to go wash the dishes and help clean up. I'll go visit you when I'm done, Ms. Elise!\nPhoenix:\n(Well, not much to do except head to my room and huddle under the covers, I guess...)\nFebruary 7, 9:12 PMHazakura TempleMain Hall\nPhoenix:\n(Ugh... It's a whole different type of cold up here in the mountains! Argh... Why couldn't the nearest bathroom be just a little closer to my room...?)\n???:\n...Mr. Wright?\nPhoenix:\nYaaaaaaah! Oh! Ah, Ms. Deauxnim! Are you going to use the bathroom, too?\nElise:\nUm, no. But... Have you seen Pearl?\nPhoenix:\nNo... Not since after dinner. I thought she said she was going to go to your room...\nElise:\nI know... But she never showed up. I-I'm going to go look for her. ...Excuse me.\nPhoenix:\n(Ms. Elise Deauxnim... A woman as mysterious in origin as her last name... But... The really mysterious one is...)\nIris:\nOh...\nPhoenix:\nAh...! S-Sister Iris...!\nIris:\nG... G-Good evening...\nPhoenix:\n(The real mysterious one is this girl...!)\nIris:\nUm, are you on your way to the bathroom too, Mr. Wright?\nPhoenix:\n(...I can't let this chance pass me by! I should try to talk with her... And maybe get some answers.)\nAfter clearing all Talk options:\nIris:\nAh...\nPhoenix:\nIs something wrong?\nIris:\nI-I didn't realize it was so late. I have to go and ring the bell for lights out...\nPhoenix:\n(I guess it's almost 10:00 now, huh?)\nIris:\n... Um... Mr. Wright?\nPhoenix:\n...Yes?\nIris:\nIf it's alright with you... I would like you to have this.\nPhoenix:\nBut this is your hood...\nIris:\nIt has the power to protect you from evil spirits.\nPhoenix:\n(Come to think of it, Sister Bikini was wearing one of these, too...)\nIris:\nI pray for your safety on this dark, cold night.\nIris's Hood received from Iris.\nIris:\nI'm sorry, but I must bid you goodnight.\nPhoenix:\nWait a minute, Sister Iris...\nIris:\nY-Yes...?\nPhoenix:\nJust now, you called me by my name... You said, \"Mr. Wright\". How did you know my name? I never introduced myself to you.\nIris:\nTh-That's...\nPhoenix:\n...Sister Iris. Please, tell me the truth. You and I... Have we ever met before?\nIris:\n...\n5 PSYCHE-LOCKS\nPhoenix:\nI-Iris...\nIris:\nO-Oh! It-It's almost 10:00... Perhaps we can speak again... tomorrow.\n*gong* *gong* *gong*\nPhoenix:\n(So my hunch was correct... She does know me... I'll have to try to talk with her again tomorrow... ......... ...... ...)\nAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAH! (Changed from [YAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAH!] in the original release)\nPhoenix:\n(Wh-What the...!? That blood-curdling scream came from the courtyard!)\nFebruary 7, 11:06 PMHazakura TempleCourtyard\nPhoenix:\n(That scream... I'm sure it came from around here...) ...Aaaah! (S-Someone's there... On the ground...!) M-Ms. Deauxniiiiiim!\n...*squish*\nPhoenix:\n(...I just stepped on something soft.)\nBikini:\nHey! Don't step on my tummy like that!\nPhoenix:\nWh-What are you doing lying there in the snow!?\nBikini:\nI was passed out! What do you think!?\nPhoenix:\nSo that blood-curdling scream was you...?\nBikini:\nF-Forget about that! H-Hurry up and call the police!\nPhoenix:\nIs there even a phone in the Main Hall?\nBikini:\nNo, but we still get reception up here in the mountains! You must have a cell phone on you, right!?\nPhoenix:\nI, um... I didn't bring it with me--\nBikini:\nOh, you're useless! I mean, even Iris has a cell phone... We've got no choice! You'll have to use the public phone by Dusky Bridge! Hurry! Hurry! Hurry! Run as fast as you can!\nPhoenix:\nY-Yes, ma'am...\nBikini:\nIf you don't hurry, Iris will... Iris will...!\nFebruary 7, 11:18 PMDusky Bridge\nPhoenix:\n...*huff*...*huff*... (It's farther than I thought. The bridge is just up ahead. I have to go tell Maya what happened, too!) ............ ...Aaaaaaaaaah! Dusky Bridge...! It's burning down! (What the heck happened!?)\nButz:\nWhat are you doing here?\nPhoenix:\nAaaaaaaaah!\nButz:\nHuh? What is it? Is it me?\nPhoenix:\nD-Don't scare me like that, Larry! I almost had a heart attack!\nButz:\nMy name isn't Larry! It's Laurice!\nPhoenix:\nLarry, hurry up and call the police! I'm going to the Inner Temple!\nButz:\nD-Don't be stupid! The bridge is nothing but a burning wreck right now!\nPhoenix:\nListen to me! There's been a murder! Here! At Hazakura Temple!\nButz:\nWha-Whaaaaat!?\nPhoenix:\nThe murderer might have fled across the bridge! I have to make sure Maya is safe!\nButz:\nB-B-But...\nPhoenix:\nPlease! Call the police! I've got to go! ...Get outta my way, Larry!\nButz:\nIt-It's too dangerous! Nick, w-wait!\nPhoenix:\n(I must have been crazy... I knew how dangerous it was, but I still went for it...)\n...*crack!*...\nPhoenix:\nAAAAAAAAAAHHHH!\nButz:\nNiiiiiick----!\nPhoenix:\n(Weakened even more by the fire, the rickety old bridge's planks snapped and gave way. And as I was swallowed by the eternal darkness that surrounded me... ...a final, terrified scream rose up to pierce the frozen air of that harrowing night.)\nTo be continued.\nDate: ??? Time: ???Location: ???\nPhone:\n*RIIING*... *RIIING*...\n???:\n(Who could that be at this time of night...?)\nPhone:\n...*beep*...\nEdgeworth:\n...Yes? Edgeworth speaking...\nButz:\nEdgey! Get up! It's an emergency!\nEdgeworth:\n...Huh? Larry...? Do you know what time it is?\nButz:\nIt's not \"Larry\"! It's \"Laurice\"! Laurice Deauxnim!\nEdgeworth:\n(... This is nothing more than a terrible nightmare... I'll just roll over and...)\nButz:\nW-Wait! Don't hang up! ...It's an emergency! It's Nick! H-He... He took a really nasty spill!\nEdgeworth:\nWell, it wouldn't be the first time, so...\nButz:\nI'm not joking! His life is in danger!\nEdgeworth:\nWh-What...!? What happened!? Tell me!\nButz:\nTalk about a guy with bad luck! He may already be dead! Anyway, you've got to come back! You're the only one that can help! My Iris... My beautiful Iris! She needs help...!\nEdgeworth:\nAlright. I don't know what's going on, but... I'll be there as soon as I can.\nButz:\nI-I'm at the detention center! Please! Hurryyyyyy!\nPhone:\n...*beep*...\nEdgeworth:\n(It's been one year since I left that country... I thought I wouldn't have to see him again for a while... Sounds like it won't be a pretty reunion... As if I expected anything to change.)\nFebruary 8, 2:19 PMDetention CenterVisitor's Room\nButz:\nYou're late, Edgey! What took you so long!?\nEdgeworth:\nI don't want to hear it! I chartered a private jet to come as quickly as I could!\nButz:\nWell, you should've chartered a faster one! Anyway, just listen! Something happened to Ms. Elise... and Nick is... Maya... and Iris's Bikini... ...Huh? Say something, Edgey!\nEdgeworth:\n...Before I came here, I stopped in at the hospital where Wright is. I believe I have a better understanding of the situation than you, at this point. The murder victim was the picture book author, Ms. Elise Deauxnim. She was found by Wright and the head nun. The suspect is the temple's younger nun. Then later, while Wright was crossing the bridge, it broke and he fell into the river. The hospital says that he'll need at least 2 days of bed rest.\nButz:\nY-Yes! Th-That's right! You got it! B-But they arrested her... My sweet little Iris!\nEdgeworth:\n(And here I was, convinced HE was the one the police had arrested...) However... I still don't understand what these two items are for.\nButz:\nWhat are you talking about?\nEdgeworth:\nThey're things Wright gave to me when I was leaving his room. (This is the first... He said some nonsense about being able to see into people's hearts with this... And the other... He couldn't possibly be asking what I think he is... could he?)\nButz:\nI'm begging you! Iris's trial starts tomorrow! With Nick out of the picture, you're all I've got left! You're the only one that can represent her!\nEdgeworth:\n... What did you just say?\nButz:\nYou know! REPRESENT! DEFEND! What were you expecting!? Why do you think I called you anyway!?\nEdgeworth:\n...I'm a prosecutor, Larry. A prosecutor. Do YOU understand what I'm saying? A prosecutor is a lawyer who...\nButz:\nDon't talk to me like a kid! I graduated from junior high, you know! Don't worry about it! I promise I won't tell!\nEdgeworth:\nBut I...\nButz:\nI mean, I heard a paper badge had no problem fooling an entire court before!\nEdgeworth:\n(...How could this country's judicial system have fallen into such decay!?)\nButz:\nPlease, Edgey! At least listen to her... Listen to Iris's side of the story!\nEdgeworth:\n(So Wright wasn't joking when he gave me this badge after all...)\nIris:\nThank you for coming. ...My name is Iris.\nEdgeworth:\n...Edgeworth. Miles Edgeworth. I don't know if I can be of any help, but... ...I will at least hear what you have to say. ...About the murder.\nIris:\nUm...\nEdgeworth:\n...?\nIris:\nM-Mr. Wright! H-H-How is he? Mr. Laurice said that he... That he might even die...\nEdgeworth:\n... Fortunately, he will be fine. (Larry, you moron! How could you say something like that!?) He was badly bruised when he hit the water, but otherwise he is unharmed.\nIris:\n... Thank goodness...\nEdgeworth:\nBut, he's caught some kind of nasty cold.\nIris:\nA cold...?\nEdgeworth:\nHe's running a high fever and is drifting in and out of consciousness.\nIris:\n...\nEdgeworth:\n(I must be imagining things. This woman... I feel like I've met her before...)\nAfter clearing all Talk options:\nEdgeworth:\nHmm... It appears that's about all that you can tell me.\nIris:\nThank you very much for listening to my story.\nEdgeworth:\n...I visited Wright at the hospital before coming here. He asked me to take care of you...\nIris:\n...M-Me?\nEdgeworth:\nYes, at the trial tomorrow... He asked me to defend you.\nIris:\n... If Mr. Wright has that much faith in you, Mr. Edgeworth... ...Then I will gladly entrust my fate in your capable hands.\nEdgeworth:\nBut before that, I have one question.\nIris:\nYes?\nEdgeworth:\nDo you know Wright?\nIris:\nEr... Wh-Why would you ask that?\nEdgeworth:\nWhenever you came up in our conversation, he would begin to act a little... strange.\nIris:\n... Mr. Edgeworth... What is Mr. Wright to you? (Changed from [Mr. Edgeworth... Are you his friend?] in the original release)\nEdgeworth:\n...He is a very dear and indispensable friend. (Changed from [Friend? Well... In a sense, yes.] in the original release)\nIris:\n... It was 5 years ago... That's when I... That's when I... deceived him.\nEdgeworth:\nYou \"deceived\" him...?\nIris:\nI heard that he was... in a lot of pain after what happened. I know what a weak person I am. That's why... That's why I thought it was best if he never saw me again. I wanted him to just forget about me, without learning the truth.\nEdgeworth:\n... Well, if you ask me, Wright is still suffering... And until he learns the truth, I don't think he will ever be able to truly recover. ...Iris. It's not too late. You should go to him. ...Tell him the truth.\nIris:\n...\nEdgeworth:\nI'll defend you, but only if you agree to that one condition.\nIris:\n... Alright, Mr. Edgeworth... I promise.\nEdgeworth:\n...Very well. I'll do everything in my power to get you an acquittal. (That's enough information gathering for now. I should head to the crime scene...)\nFebruary 8Dusky Bridge\nEdgeworth:\n(It sure is cold alright... So this is it... Dusky Bridge...)\n???:\nOh, wow! It's you, Mr. Edgeworth! (Changed from [Ahem! M-Mr. Edgeworth!] in the original release)\nEdgeworth:\nNngh... Detective Gumshoe. (Changed from [Urk... Detective Gumshoe.] in the original release)\nGumshoe:\nLong time no see! It's been about a year? ...Or has it been longer?\nEdgeworth:\nIt doesn't matter, Detective. What does matter is why you're shuffling around up here.\nGumshoe:\nOh, ouch! ...And there's that sharp left jab! (Changed from [Oh, ouch! ...And there was a sharp left jab!] in the original release) Well, I'm happy to see you anyway, Mr. Edgeworth!\nEdgeworth:\nLet me guess... You were transferred by HR to the local precinct? (Changed from [Let me guess... You were transferred into another section at work.] in the original release) A wise decision. The vast amount of nothing up here should be quite easy to guard. (Changed from [A good choice. The vast amount of nothing up here must be quite easy to guard.] in the original release)\nGumshoe:\nI heard you were back in the country and arranged to come all the way out here! Everybody was real nice. They even let me take charge of the investigation, sir.\nEdgeworth:\n(...Gumshoe indeed! Like gum on your shoe, he's impossible to get rid of!)\nGumshoe:\nI'm supposed to report on the details of the crime scene, sir! Anyway! Here I am! Detective Dick Gumshoe! Reporting for duty!\nEdgeworth:\n...Great. Um, thank you, Detective.\nGumshoe:\nI thought Prosecutor Godot was gonna get here before me. That guy's a real mystery, I tell you!\nEdgeworth:\n(...Prosecutor Godot?)\nFebruary 8Detention CenterVisitor's Room\nEdgeworth:\n(It looks like Iris is being interrogated right now.) ...This place certainly brings back memories.\nGumshoe:\nOh yeah. Come to think of it, you got thrown in here once too, didn't you, sir? But you know what? I've never been in jail a single time!\nEdgeworth:\n(I should think it's hard to land in jail when you're so harmless...) Yes, well... If you're in jail, you don't have to pay for your own meals, you know.\nGumshoe:\n...*gasp!* ...\nEdgeworth:\nDon't get any funny ideas, Detective...!\nGumshoe:\n...Too late, I already did.\nEdgeworth:\n(In any case... I guess I'll have to come back here later...)\nFebruary 8Hazakura TempleMain Gate\nButz:\nYo! Edgey! What took you so long!? I'm so cold, my brain's turned to sherbet.\nEdgeworth:\n...I knew it was a mistake to race back to this country.\nButz:\nWh-What do you mean...?\nEdgeworth:\nWright is going to be fine, and the case itself isn't anything unusual... And I find myself taking a request to defend a woman accused of murder!\nGumshoe:\n...H-Hey! Wait a sec! Hold it! Objection! What's going on here, Mr. Edgeworth!?\nEdgeworth:\nUm, it's hard to explain, but one thing led to another and...\nButz:\nWhat kind of lame excuse is that!? And you call yourself a defense attorney!?\nGumshoe:\nProsecutor Edgeworth is a prosecutor, and that's why he's Prosecutor Edgeworth! \"Prosecutor Edgeworth, Defense Attorney\" just sounds plain old weird, pal! ...Right, Prosecutor Edgeworth!?\nEdgeworth:\n(...I'm not sure what role I'm supposed to be playing anymore.)\nButz:\nHmph! Dude, Edgey... (Changed from [Hmph! Dude, Edgey... I don't see you for a couple of years...] in the original release) I don't see you for a couple of years, and your heart turns to sherbet! (Changed from [...and your heart turns to sherbet!] in the original release)\nEdgeworth:\n...I'd say more like sorbet. It is rather cold here.\nButz:\nIris didn't murder her! Someone else did it! I just know it, OK!? So trust me on this one!\nEdgeworth:\nEver the romantic, aren't you, Larry? Nevertheless, I'll do whatever I can to prove her innocence. (At least until I pass the baton on to Wright, that is.)\nFebruary 8Hazakura TempleMain Hall\nBikini:\n*sigh*\nGumshoe:\nHey! Hello there! Um, so how are you feeling?\nBikini:\nAlright, I suppose. ...Huh? Who is this?\nEdgeworth:\nI... My name is... Miles Edgeworth.\nBikini:\nMy my my. A handsome boy such as yourself is always welcome! *sigh* If circumstances weren't so tragic, I might just...\nEdgeworth:\n(Please don't call me \"boy\".) I'm sorry to trouble you... But I'm looking for a woman in a bikini.\nBikini:\nWell, you have found her. Now, what can I do for you?\nEdgeworth:\n... I'm sorry, but I don't see any bikinis...\nBikini:\nHa ha ha! If you ask nicely, I might give you a peek, big boy. Wa ha ha ho ho ho!\nGumshoe:\nUmm... Mr. Edgeworth? This is the head nun, Sister Bikini... She's the witness.\nEdgeworth:\n... Why didn't you tell me that earlier!? This is exactly why your salary keeps on getting cut!\nGumshoe:\nNngh... My stomach is already growling in protest...\nBikini:\nSo... Um... What's the latest about my beloved Iris!?\nEdgeworth:\nWell, first... I want to hear what you know.\nMain Gate (before clearing all Talk options in Hazakura Temple - Main Gate)\nAfter clearing all Talk options in Hazakura Temple  - Main Gate:\nFebruary 8Hazakura TempleMain Gate\nEdgeworth:\n...Hmm. I don't see Larry anywhere.\nGumshoe:\nMaybe we scared the poor kid away!\nEdgeworth:\n(His heart was shut tight with a number of Psycholocks. (Changed from [His heart was shut tight with a Psycholock.] in the original release) I guess I'll have to look for him now... What a thorn in my side.)\nFebruary 8Hazakura TempleCourtyard\nGumshoe:\nAnd this is where the murder took place, sir! Other than removing the body, we left everything else untouched!\nEdgeworth:\nThanks, Detective. I'll just have a look around. (It looks like the police are still investigating...)\nGumshoe:\nOh yeah, by the way... I thought I'd better ask, just to be sure... Are you really gonna defend that nun, Iris, at the trial tomorrow?\nEdgeworth:\nYes, I will... I gave her my word and now I must follow through with my commitment. (Changed from [Yes, I will... I gave her my word and now I must follow through with my commitments.] in the original release)\nGumshoe:\nWell, in that case... I've gotta be careful... Gotta make sure I don't leak the prosecution's whole investigation...\nEdgeworth:\nDon't worry about it, Detective. Just keep your mouth closed and I think most of it will flow out on its own.\nGumshoe:\n... You got it, sir! I'll make sure it flows out like water from a tap! (Changed from [Roger, sir! I know exactly what you're saying!] in the original release)\nEdgeworth:\nY-Yes, you do that, Detective. (Just how much has your runny spout leaked over the years?) (Changed from [Very well, Detective... (Thankfully his diarrhea of the mouth is permanent...)] in the original release)\nAfter clearing all Talk options in Dusky Bridge, clearing all Talk options in Hazakura Temple - Main Gate, clearing all Talk options and examining left corner near altar in Hazakura Temple - Main Hall, and clearing all Talk options and examining staff and Ami Fey statue in Hazakura Temple - Courtyard:\nFebruary 8Detention CenterVisitor's Room\nIris:\nAh... Mr. Edgeworth...\nEdgeworth:\n...I came back because I need to ask you a few more questions, if you don't mind.\nIris:\nBut I... I've already told you everything that I...\nEdgeworth:\n...Iris. Please remember. I'm on your side. You can tell me anything.\nIris:\nY-Yes... Th-Thank you.\nFebruary 8Heavenly Hall\nGumshoe:\nWhoa! Not much of a view down here, huh? It's still better than the view from my apartment, though.\nEdgeworth:\nTsk! Someone's here! Hide yourself, Detective!\n???:\nOh! Why why why!? Why does this always happen!?\nButz:\nWhenever I find a girl I like, they always run away! I even chased one of them to Japan... Next it's going to be prison, I guess. (Changed from [I even chased one of them to Tibet... Next it's going to be prison, I guess.] in the original release) ...I'll steal that detective's wallet. That'll get me locked up for sure. ...Nah. I can't do that to someone who looks like he's down on his luck.\nGumshoe:\n...He's just talking to himself.\nEdgeworth:\nShh! Be quiet and listen!\nButz:\nI knew it... I shouldn't have done that! I blew it again...\nEdgeworth:\n(\"Done that\"? What did he do, I wonder...)\nGumshoe:\nHey! You! About what you just said... I got an objection!\nButz:\nWh-Wh-Wh-What the...!? Ed-Edgey! You dirty rat!\nEdgeworth:\n*glare* (Gumshoe... You oaf...!)\nGumshoe:\nI-I'm sorry, sir! Before I knew it, I was shouting out, \"Objection!\". And in a loud, commanding voice, too! I even pointed with my pointer finger!\nEdgeworth:\n...You've watched too many trials.\nGumshoe:\nI'm sorry!\nEdgeworth:\nOK, Larry, the jig is up. What have you got to say for yourself?\nButz:\nUngh...\nButz:\nI... I already told you, didn't I? I saw lightning strike Dusky Bridge!\nEdgeworth:\nYes, and I believe it was the incredible sight you saw. But now that I think about it, something doesn't quite ring true.\nButz:\nWh-What doesn't?\nEdgeworth:\nIf that's all there is to your story, your heart wouldn't have had all those locks! Therefore, Larry... (Changed from [Yes, Larry...] in the original release) I do believe you saw something last night. Something more incredible than lightning. (Changed from [I believe you saw something last night. Something more incredible than lightning.] in the original release)\nButz:\n... Wh-What!? Wh-When!? Wh-Where!? Wh-Why!? H-How!?\nGumshoe:\nHey! What do you think you're doing!? If you hide anything from Mr. Edgeworth, I'll arrest you on the spot, pal!\nButz:\nAh... Aaaaaaaaaaaah!\n5 PSYCHE-LOCKS\nEdgeworth:\n...Nooooooooooooooooooo!\nGumshoe:\nWh-What's wrong, sir?\nEdgeworth:\nD-Does this mean I have to do it all over again?\nButz:\nWh-Why are you glaring at me like I'm next to be hit by a bolt of lightning!?\nEdgeworth:\n(I've just about had it with this harlequin... If I really want to drag the truth out of him... ...I'll just have to drag him to the witness stand!)\nTo be continued.",
  "characters": [
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Maya Fey",
      "age": "19",
      "gender": "Female",
      "description1": "My assistant and a disciple in the Kurain Tradition of spirit channeling.",
      "description2": "Went to the Inner Temple for spiritual training and is now trapped there.",
      "description3": "Went to the Inner Temple on the night of the incident and is now missing.",
      "description4": "My assistant and a disciple in the Kurain Tradition of spirit channeling."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Mia Fey",
      "age": "deceased",
      "gender": "Female",
      "description1": "Maya's older sister and my eternal mentor in life and law. Passed away 2 years ago."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Godot",
      "age": "??",
      "gender": "Male",
      "description1": "A prosecutor who is shrouded in mystery. He seems to know me somehow.",
      "description2": "The prosecutor for this case. He apparently holds some sort of grudge against Wright.* (when play switches to Edgeworth)",
      "description3": "A prosecutor who is shrouded in mystery. He seems to know me somehow.* (when play returns to Wright)"
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Pearl Fey",
      "age": "9",
      "gender": "Female",
      "description1": "Maya's cousin, and channeling prodigy. She has amazingly powerful spiritual abilities.",
      "description2": "Maya's cousin. Was apparently with the victim at the time of the crime. Currently missing.* (when play switches to Edgeworth)",
      "description3": "Maya's cousin, and channeling prodigy. She has amazingly powerful spiritual abilities.* (when play returns to Wright)",
      "description4": "Maya's cousin and channeling prodigy. She was found at the Inner Temple."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Bikini",
      "age": "48",
      "gender": "Female",
      "description1": "A hearty, motherly nun at Hazakura Temple, a channeling dojo deep in the mountains.",
      "description2": "A nun at Hazakura Temple, a channeling dojo. She discovered the murder.",
      "description3": "A nun from Hazakura Temple. Discovered the murder. Her bad back really bothers her."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Elise Deauxnim",
      "age": "?? → 49",
      "gender": "Female",
      "description1": "Kind-eyed author and illustrator of picture books. Pearls is huge fan of hers.",
      "description2": "The victim of this incident. A picture book author of unknown age. Larry's teacher.",
      "description3": "Real name: Misty Fey. Maya's mother and Master of the Kurain Channeling Technique."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Iris",
      "age": "25",
      "gender": "Female",
      "description1": "A nun at Hazakura Temple. She reminds me so much of \"her\"...",
      "description2": "The defendant. A nun from Hazakura Temple. I know I've seen her somewhere before.",
      "description3": "The defendant. A nun from Hazakura Temple. Doesn't seem to have any spiritual power."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Laurice Deauxnim* (when playing as Wright) → Larry Butz* (when playing as Edgeworth)",
      "age": "25",
      "gender": "Male",
      "description1": "Better known as Larry Butz. Current in training as Elise Deauxnim's pupil.",
      "description2": "My friend since grade school. I don't remember how we became friends, though.* (when play switches to Edgeworth)",
      "description3": "Better known as Larry Butz. Current in training as Elise Deauxnim's pupil.* (when play returns to Wright)",
      "description4": "AKA Larry Butz. Saw an unbelievable sight at Heavenly Hall the night of the crime."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Phoenix Wright",
      "age": "26",
      "gender": "Male",
      "description1": "My friend since grade school. Fell from Dusky Bridge and is currently hospitalized."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Dick Gumshoe",
      "age": "32",
      "gender": "Male",
      "description1": "Homicide detective at the local precinct. In charge of the initial investigation."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Franziska von Karma",
      "age": "19",
      "gender": "Female",
      "description1": "My mentor, Manfred von Karma's, daughter. Born/raised in Germany. Prosecutor at 13.",
      "description2": "Legendary prosecutor Manfred von Karma's daughter. Became a prosecutor in Germany at 13.* (when play returns to Wright)"
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Miles Edgeworth",
      "age": "26",
      "gender": "Male",
      "description1": "An old friend. Said to be #1 at the D.A.'s office. Studies foreign judicial systems now."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Morgan Fey",
      "age": "??",
      "gender": "Female",
      "description1": "Older sister of Misty Fey and mother of Pearl and Iris. Is in solitary confinement."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "?????? → Dahlia Hawthorne",
      "age": "?? → deceased",
      "gender": "?  → Female",
      "description1": "Morgan Fey's daughter and Iris's twin sister. Her father deals in jewelry apparently.",
      "description2": "Morgan Fey's daughter and Iris's twin sister. She was executed last month."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.* (when playing as Wright)  → Received from Phoenix Wright.* (when playing as Edgeworth)",
      "description1": "It's my all-important badge. It shows that I am a defense attorney.* (when playing as Wright)",
      "description2": "Received from Wright. He wasn't serious when he gave this to me... was he?* (when playing as Edgeworth)"
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Magatama",
      "type": "Other",
      "obtained": "Received from Maya Fey.* (when playing as Wright)  → Received from Phoenix Wright.* (when playing as Edgeworth)",
      "description1": "A present from Maya. It reacts to people who have secrets in their hearts.* (when playing as Wright)",
      "description2": "Received from Wright. Something about reading people's hearts... What utter nonsense.* (when playing as Edgeworth)"
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Oh! Cult! New Year's Issue",
      "type": "Other",
      "obtained": "Received from Pearl Fey.",
      "description1": "An occult magazine featuring Hazakura Temple. Click here for details."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Hazakura Temple Map",
      "type": "Maps",
      "obtained": "Received from Elise Deauxnim.",
      "description1": "Shows Hazakura Temple and the surrounding area. Click here for details."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Hanging Scroll",
      "type": "Other",
      "obtained": "Found at the Inner Temple Training Hall.",
      "description1": "Shows Misty Fey, Master of the Kurain Technique. Click here for details.",
      "description2": "Misty Fey's image is obscured by gravy. Click here for details."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Photo of Elise",
      "type": "Photographs",
      "obtained": "Received from Laurice Deauxnim.",
      "description1": "Taken by her only pupil, Laurice Deauxnim. She is wearing a white robe and a hood. She was holding a book and a staff. The staff has a crystal sphere attached to it."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Iris's Hood",
      "type": "Other",
      "obtained": "Received from Iris.",
      "description1": "A magical hood said to offer protection from evil spirits.",
      "description2": "Received before the lights out bell the night of the crime. Protects from evil spirits."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Weather Data",
      "type": "Documents",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "A regional weather report for the night of the crime.\nEagle Mountain Weather Data for Feb. 07\nSnow, with occasional lightning strikes.\n\nSnow: 7 to approx. 10:50 PM\nLightning: 10 to approx. 11 PM\n\nLightning struck Dusky Bridge at 10:45.\nAround 30 minutes passed between\nthe fire starting and going out."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Note to Iris",
      "type": "Documents",
      "obtained": "Found in the Hazakura Temple Main Hall.",
      "description1": "Found in the Main Hall. Maybe she dropped it? Click here for details."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Victim's Staff",
      "type": "Other → Weapons",
      "obtained": "Found in the Hazakura Temple Courtyard.",
      "description1": "Carried by Elise Deauxnim when she was alive. Has her fingerprints on it. There is no crystal sphere attached.",
      "description2": "Has a sword hidden inside. No one knows this except Detective Gumshoe and I.",
      "description3": "Has a sword hidden inside. The actual weapon used to murder the victim."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Shichishito",
      "type": "Weapons → Evidence",
      "obtained": "Found in the Hazakura Temple Courtyard.",
      "description1": "The apparent murder weapon. A seven-branched, jagged sword. Had the victim's blood and the suspect's fingerprints on it.",
      "description2": "Had the victim's blood and the suspect's fingerprints on it, but is not the murder weapon."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Elise's Autopsy Report",
      "type": "Reports",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "Time: 10 - 11 PM. Cause: loss of blood from stab in back. Body fell 10 ft. after death."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Iris's Testimony",
      "type": "Documents",
      "obtained": "Received from Iris.",
      "description1": "Rang lights out bell at 10 PM and was then in her room until the murder was discovered."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Crime Photo",
      "type": "Photographs",
      "obtained": "Submitted as evidence by Franziska von Karma.",
      "description1": "The courtyard where Elise Deauxnim was murdered. Click here for details."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Tracks Photo",
      "type": "Photographs",
      "obtained": "Submitted as evidence by Franziska von Karma.",
      "description1": "Taken that night. One track is shown leading from Main Gate to Dusky Bridge."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Larry's Sketch",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Larry Butz.",
      "description1": "Horrible sketch of what he saw the night of the crime. Click here for details."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Crystal Sphere",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Larry Butz.",
      "description1": "Found half-covered in snow near Dusky Bridge the night of the crime. Has blood on it.",
      "description2": "Found on outcropping near Dusky Bridge. Has blood on it. Came from the victim's staff."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Kurain Master's Talisman",
      "type": "Other",
      "obtained": "Found in the Inner Temple Garden.",
      "description1": "Worn by Elise Deauxnim. Found in the garden of the Inner Temple."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Burnt Letter",
      "type": "Other",
      "obtained": "Received from Detective Gumshoe.",
      "description1": "Found by Gumshoe in the Inner Temple incinerator. Click here for details.",
      "description2": "Orders from Morgan Fey. Opened once before. Click here for details."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Dagger",
      "type": "Weapons",
      "obtained": "Submitted as evidence by Godot.",
      "description1": "Found behind a tree in the Inner Temple garden. The blood is being analyzed now.",
      "description2": "Found stuck in a pine tree in Inner Temple Garden. The blood doesn't match the victim's."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Stone Lantern",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Godot.",
      "description1": "A lantern from the Inner Temple garden. Was not lit the night of the crime."
    },
    {
      "currentChapter": "Bridge to the Turnabout",
      "name": "Dusky Bridge Photo",
      "type": "Photographs",
      "obtained": "Submitted as evidence by Godot.",
      "description1": "Taken the morning after the crime. Click here for details."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "Bridge to the Turnabout\n\n\n\n\n\n\n\n\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 4February 9, 9:47 AMDistrict CourtDefendant Lobby No. 1Iris:\nOh my... Mr. Laurice feels that way about... me...?Edgeworth:\nApparently... he isn't aware of your real secret at all.Iris:\n... ......Edgeworth:\nThis is no time to be embarrassed!Iris:\nI-I'm sorry! I'm just... hardly accustomed to that sort of thing.Edgeworth:\nWorry not... And in any case, whatever it was that he saw on the night of the incident... Mark my words, I will drag it out him!Iris:\nDoes that mean... Mr. Laurice is the witness today...?Edgeworth:\n...No. I believe that nun... will be the first to take the stand.Iris:\nSister Bikini...Edgeworth:\nShe claims to have seen the very instant in which you carried out the crime.Iris:\n...Edgeworth:\nI just want to ask you one last time. It really wasn't you who killed Ms. Elise Deauxnim, correct?Iris:\n... That is correct. It wasn't me.Edgeworth:\n...Very well, then.Iris:\nUm... Mr. Edgeworth?Edgeworth:\n...Yes?Iris:\nYou are a prosecutor... aren't you? Are you sure about this? If your true identity is revealed...Edgeworth:\nDon't worry. I've made the necessary arrangements. (Changed from [Don't worry. ...I've taken the necessary steps.] in the original release)Iris:\nI-I see... (Changed from [Y-You have...?] in the original release)Edgeworth:\n...Iris. It is a prosecutor's job to doubt people.Iris:\n...Edgeworth:\nBut right now... I am a defense attorney. A defense attorney's job is to believe in people, and to believe until the bitter end. That's what my friend told me once. (Changed from [That's what a friend of mine told me once.] in the original release)Iris:\nMr. Edgeworth...Edgeworth:\nI simply ask that you watch and decide for yourself... (Changed from [You may pass judgment on me from the defendant's chair. You are the one to decide...] in the original release) ...whether or not I am fit to do the task I have been entrusted. (Changed from [...whether or not I am able to do the task I have been entrusted.] in the original release)Iris:\n... ...Very well, sir. I leave my defense in your capable hands.February 9, 10:00 AMDistrict CourtCourtroom No. 7Judge:\nCourt is now in session for the trial of Sister Iris of Hazakura Temple.Edgeworth:\nThe defense is ready, Your Honor.Judge:\n...The defense does indeed appear to be ready... However, the same cannot be said for the prosecution in this case.Edgeworth:\n...Indeed.Judge:\nI'm not sure I like such blatant waste of this court's time. An empty prosecutor's chair can only mean... ...that the prosecutor has no confidence in their ability to prove their case. It would seem this case is already over before it had a chance to begin. I am ready to announce my verdict at this time. This court finds the defendant...???:???:\nThe prosecution... stands ready.Judge:\nA-And you are...?von Karma:\nFranziska von Karma... Prosecuting prodigy.Judge:\nV-Von Karma, you say...? Perchance, you wouldn't be of any relation to the legendary prosecutor Manfred von Karma?von Karma:\n... Legends are a thing of the past. I am a Von Karma. That is all. Upon a special request, I flew in today for the purposes of prosecuting this case.Judge:\nY-You did!? Then... you must be quite a big shot, eh! By the way, Mr. Edgeworth...Edgeworth:\nYes, Your Honor?Judge:\nI'm almost certain that I've seen you somewhere before. Or am I just imagining things? You look very much like a prosecutor I met once...Edgeworth:\n...I believe you are imagining things, Your Honor.Judge:\nMs. von Karma? Do you have anything to say?von Karma:\n... There is no such weakling as this man among those of the Prosecutor's Office.Judge:\nThere... there isn't...? But I'm sure... once before, in this courtroom... Ack!von Karma:\n...I told you, there is no such weakling!Judge:\nWh-What is that!? A whip!? I'm not sure I care for such a thing in my courtroom! B-Bailiff! Remove that whip, at...Edgeworth:Edgeworth:\n...I have no objection to the whip.Judge:\nY-You don't...?Edgeworth:\nThe prosecution can wield a whip or drink seventeen cups of coffee... But there is still only one truth. That is what I stand here to prove today!von Karma:\nThis promises to be interesting... Miles Edgeworth. ...I had expected to face Phoenix Wright here today. But looking at you now... ...maybe this is what I have been waiting for all this time. Miles Edgeworth! I will not allow this chance to crush you slip through my fingers!Edgeworth:\n...I see you brought your flair for the histrionic.Judge:\nAllow me to add to the things I'm not sure about... People acting bizarrely in my court! Uwa-hah!von Karma:\n...The stage is set. Now continue with the proceedings, Your Honor.Judge:\nVery well. Ms. von Karma, please give an outline of this case. With as little whipping as possible!von Karma:\nThe murder victim is the famed picture book author, Ms. Elise Deauxnim. Her body was found in the Hazakura Temple courtyard. She had been stabbed through the torso by a ceremonial sword from a golden statue.Judge:\nThe sword in this picture... is the weapon in question, correct...? ...Very well. The court accepts this photo of the crime scene.Crime Photo added to the Court Record.von Karma:\nThere is no mistake. This was the doing of Sister Iris. After all... there is a witness to her crime.Judge:\n...Very well. Please bring this witness to the stand!Edgeworth:\n(And so it begins... My first and my last trial... as a defense attorney!)von Karma:\n...Witness. State your name and occupation. Please.Judge:\nH-Hold on here! I'm not sure about being not sure if I care for this at all! Witness! Please stand up nice and straight!Edgeworth:\nIf I recall correctly... ...there are a few milk crates in the Defendant's Lobby for our back pain-plagued witness. (Changed from [...there are a few milk crates in the defendant's lobby for witnesses with bad backs.] in the original release)Judge:\nBailiff! Fetch a crate for this poor lady, please!von Karma:\n...Once again. Your name and occupation, please.Bikini:\nLittle old me? Well, I'm the head nun of Hazakura Temple on Eagle Mountain. My name is Bikini. You got it? Bikini. Nice to meet everyone.Judge:\n... But you don't appear to be wearing a bikini right now... Uwah!von Karma:\n...The courtroom is the garden of holy judgment. Those with lechery in their hearts should leave this sanctuary at once!Judge:\nY-You want me to leave!?Bikini:\nNo need to get your bikinis in a twist! Let me tell you, I'm a sight to behold in summer! Wha ha ha! Ha ha ha! Ha ha!Edgeworth:\nIn any case... Witness. I hear that you saw the crime take place on the night in question.Bikini:\nThat's right! I can still hardly believe it myself, to be honest. There's no way dear little Iris could do anything like that...Judge:\nLet us hear what you have to say then. First, tell us aboot your own movements that night, eh!Witness Testimony-- The Night of the Murder --Bikini:\nThat night I was helping an acolyte with her training in the Inner Temple. But...\nWell, as you can see, my back likes to act up. Violently.\nSo, I left Iris to help the acolyte, and returned to Hazakura Temple.\nThere's no bath at the Inner Temple, you see, and I needed a long, hot soak.\nIt was after I had finished, just as I was heading back... that's when I saw it!Judge:\nHmm... So it was simply coincidence that you found yourself returning to Hazakura Temple?Bikini:\n...Yes, you could say that. If my back hadn't been in so much pain, I would have stayed at the Inner Temple.Edgeworth:\n(That sounds like a pretty important statement she just made...)von Karma:\nThere is only one problem with this testimony that I can see... And you're not about to fall at the first hurdle, now are you, Miles Edgeworth?Edgeworth:\n...Judge:\nMr. Edgeworth. ...Please begin your cross-examination.Cross Examination",
      "testimonies": [
        {
          "testimony": "That night I was helping an acolyte with her training in the Inner Temple. But...",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "Well, as you can see, my back likes to act up. Violently.",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "So, I left Iris to help the acolyte, and returned to Hazakura Temple.",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "Iris came to the Inner Temple. She was dressed exactly as she had been at dinner.",
          "person": "Bikini",
          "present": [
            "Iris's Hood"
          ],
          "source": {
            "evidence_span": "Received before the lights out bell the night of the crime.",
            "testimony_span": "She was dressed exactly as she had been at dinner.",
            "explanation": "Iris was wearing a hood at dinner, but she could not have been wearing the hood after the lights out bell rang because she had given the hood away.",
            "is_self_contained": "no",
            "context_span": "Iris:\nIf it's alright with you... I would like you to have this.\n\nPhoenix:\nBut this is your hood..."
          }
        },
        {
          "testimony": "There's no bath at the Inner Temple, you see, and I needed a long, hot soak.",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "It was after I had finished, just as I was heading back... that's when I saw it!",
          "person": "Bikini",
          "present": []
        }
      ],
      "noPresent": false
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Night of the Murder --Bikini:\nThat night I was helping an acolyte with her training in the Inner Temple. But...Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nWhat is this Inner Temple...?\nBikini:\nWell, see, conversing with the spirits is what we train people to do, right?\nJudge:\nWe'll be the ones asking you the questions, madam.\nBikini:\n...In order to do that, a place strong in spiritual power is required. There's a small temple across Dusky Bridge, called the Inner Temple.  Acolytes must spend an entire night there to undergo intense training.\nEdgeworth:\nAnd how exactly do you help with this process...?\nBikini:\nIt is all quite exacting. It can't be performed without a nun supervising.\nvon Karma:\nLike a tutor, watching to make sure a spoiled child studies.\nEdgeworth:\n(A tutor with a whip, in your case.) If that is the case... ...then why did you return to Hazakura Temple, where the murder took place?Bikini:\nWell, as you can see, my back likes to act up. Violently.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nViolently...?\nBikini:\nThat's right. It's no laughing matter, especially in winter! I can't hold anything heavier than a knife and fork during the cold months! Just being alive is like strict training! Wah ha ha! Wha ha! Wah ha ha!\nEdgeworth:\nOn the night of the murder, was this fabulous back of yours hurting again...?\nBikini:\nThat's right. Raging like a bull in a pigpen. I almost fainted once or twice! I just knew that unless I warmed it up, it was going to finally finish me off!Bikini:\nSo, I left Iris to help the acolyte, and returned to Hazakura Temple.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou \"left Iris to help\"... With what?\nBikini:\nWhat do you think? The acolyte's training, of course. It was just past 10 PM, so we were starting to enter into the training exercises proper.\nJudge:\nWasn't it your place to remain with the disciple?\nBikini:\nWell, the job is simply to watch over the acolyte so that they don't pass away.\nEdgeworth:\nJust to confirm this point again, that night... ...you met Iris in the Inner Temple, correct?\nBikini:\nYes, yes. She's a gentle, honest girl. She's never once failed to follow my directions.Present Iris's Testimony\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\n...Witnesses have to undergo their own trials, I'm afraid. The defendant's fate rests on their powers of observation and memory, after all.\nBikini:\nWell, well, well. Don't worry! I'm more than up to the task! I'm a woman of faith, after all. The head honcho of Hazakura Temple.\nEdgeworth:\nIn that case, Ms. Honcho... I'd like you to explain something for me. The discrepancy between your testimony and that of the defendant, Iris. She claims that after ringing the lights out bell, she went back and stayed in her room. ...Which means! She did not go to the Inner Temple at all!\nBikini:\nN... No...! She said that...?\nvon Karma:\n\nvon Karma:\nA defendant or a witness... Who is more likely to lie, do you suppose? The defendant is simply lying to cover her back!\nEdgeworth:\n\nEdgeworth:\nBut that is completely illogical. The murder was committed in the courtyard of Hazakura Temple. Claiming that she \"went to the Inner Temple\" would make for a much better alibi.\nvon Karma:\n...!\nBikini:\nBut that is odd... Whatever the reason... I can't believe that she would lie...!\nJudge:\nHmm... she does indeed have honest eyes! Uwaaaah!\nvon Karma:\n...All people lie. That is my belief.\nJudge:\nWhy am I the only one being whipped in here...!? Anyway! Neither the witness nor the defendant have any reason to lie! Which means... We must call your memory into question...\nBikini:\nDear, dear, dear. You're older than me and yet you want to play that game, do you?\nJudge:\nA-Ah, well, that isn't exactly what I...\nBikini:\nMy memory is perfect! Crystal clear! Especially in winter!\nJudge:\nThen... I suppose it's too early to end this cross-examination, eh. Mr. Edgeworth. If you are going to question the memory of this witness... ...you will need to show me a more decisive piece of evidence.\nEdgeworth:\n...Understood, Your Honor. (I was naïve to think that alone would do the trick.)\nJudge:\nThen please add your comments aboot Iris to the testimony... And let us return to the cross-examination.\nChanges statement from \"So, I left Iris to help the acolyte, and returned to Hazakura Temple.\" to \"Iris came to the Inner Temple. She was dressed exactly as she had been at dinner.\"Bikini:\nIris came to the Inner Temple. She was dressed exactly as she had been at dinner.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nAre you sure that you're not making a mistake...?\nBikini:\n...You, young man, need to get your estimation of me up from the floor!\nEdgeworth:\nNngh...!\nBikini:\nIris always wears the same clothes. The smallest thing out of place would have stood out like a sore thumb to me! You're making a mistake, thinking I made a mistake!\nJudge:\n...An excellent finish there, witness.\nEdgeworth:\n(Still, I have to wonder...)Present Iris's Hood\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"...Witness. Let's get one thing straight.\"Bikini:\nThere's no bath at the Inner Temple, you see, and I needed a long, hot soak.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\n...So you returned to the Hazakura Temple in order to take a bath?\nBikini:\nMy back is to blame for everything. It's a \"do or be done in\" kind of world, after all.\nEdgeworth:\nHow long were you in the bath for, if you don't mind me asking?\nBikini:\n... My my my, what a filthy little rogue you are! I know what's on your mind!\nEdgeworth:\n...?\nBikini:\nI bet your next question is going to be, \"Where exactly did you wash?\" Ah, THIS is why you have to watch the young ones...\nEdgeworth:\nW-What are you going on about!? I was... Gwah!\nvon Karma:\n...Pathetic, Miles Edgeworth.\nJudge:\nThe lowest of the low.\nEdgeworth:\n(Is there some sort of \"Kick Me\" sign stuck to the defense's bench!?)\nBikini:\nAnyway, I couldn't afford to be away from my post for too long, you understand, so...Bikini:\nIt was after I had finished, just as I was heading back... that's when I saw it!Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThe crime took place in the courtyard, correct...?\nBikini:\nWhen you go from my room to the Main Hall... ...you have to take a winding hallway from which you can see the courtyard.\nvon Karma:\nThat's right. In other words... ...it was pure coincidence that the witness saw the crime taking place before her eyes. There was no complicated set-up in this case!\nJudge:\nHmm... That certainly seems to be true.Edgeworth:\n(There is indeed only one problem with this testimony. If I can clearly point out what it is, then I can begin to quantify... ...just how good this witness's memory and observation skills are.)Edgeworth:\n...Witness. Let's get one thing straight. The defendant whom you claim to have met... ...she was wearing this \"Demon-Warding Hood\", correct?Bikini:\nOf course! That is a very important piece of clothing, I'll have you know! Wha ha ha! Wha ha ha! Ha ha... Wait a minute...von Karma:von Karma:\nH-Hold it right there! Why do you have that...!?Edgeworth:\nThat's the question of the day, now isn't it... Ms. von Karma? I'll have you know that this hood was given to someone as a gift that night. Before the lights out bell was rung.von Karma:\nW... What!?Edgeworth:\n...You know where I'm going with this, don't you? If the witness had seen the defendant as she claims... ...then the Iris she saw should have been missing this very hood! (Changed from [...the defendant couldn't have been wearing this very hood!] in the original release)Bikini:\nWell well well!Edgeworth:\n(It's not a bad feeling at all, exposing contradictions like this... Now I understand that happy look on Wright's face every time he does it...)Judge:\nOrder! Order in the court! Witness, your response... Wuahaaa!von Karma:\n...Sister. This hood... You have spare ones around the temple, don't you?Bikini:\nSpares... Well... I do tend to make too many of them.Judge:\nI see... A stockpile. A surplus of hoods, eh?Bikini:\nEach nun is only given one hood. This should be the only hood that Iris owned...Judge:\nHmm... Then this is quite strange! Waaaah!von Karma:\nIf there was a surplus of hoods, then she could have worn one of those! ...There is no contradiction here!Judge:\nHmm...Edgeworth:\n(I'm sorry to break this to you, Ms. von Karma... but you won't get away that easily. Discrepancies such as this will sow seeds in any human heart. The seeds of doubt.)Judge:\n...Witness. While I don't wish to call your testimony into doubt... ...you must give every detail with precision.Bikini:\nI-I'm not sure I'm comfortable going along with this...von Karma:\nSister. You shall continue with your testimony. Tell us what you saw after finishing your bath, on your way back to the Inner Temple!Edgeworth:\n(Those seeds of doubt are sprouting in the judge's heart. They just need a little more stimulation to bear fruit... Contradictory stimulation.)Witness Testimony-- After My Bath --Bikini:\nI finished my bath around 11, and I thought I should return to the Inner Temple.\nAnd as I was walking back... I heard a noise from the courtyard. I took a look and...\nIris was...! Oh, Mystic Elise! And with that sword, of all things!\nMystic Elise was staying in the corner room, which faces out onto the courtyard.\nThe stabbing I saw must have occurred after she was pushed out of her window.Judge:\nYou saw a truly terrible sight, didn't you...? If I was in your place... ...then it would be much like Ms. von Karma whipping Mr. Edgeworth in two in court! And me, seeing it all from this very chair! ...Er, well, something like that.Edgeworth:\n(This judge... His imagination is about as vivid and creative as Detective Gumshoe...)von Karma:\nI would look the fool if I commented on such foolishness. Anyway, this case is mine... Miles Edgeworth!Edgeworth:\nCalling everyone by their full name... Can't you do something about that habit of yours?Cross Examination",
      "testimonies": [
        {
          "testimony": "I finished my bath around 11, and I thought I should return to the Inner Temple.",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "And as I was walking back... I heard a noise from the courtyard. I took a look and...",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "Iris was...! Oh, Mystic Elise! And with that sword, of all things!",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "Now that you mention it... Iris didn't have her hood on.",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "Mystic Elise was staying in the corner room, which faces out onto the courtyard.",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "The stabbing I saw must have occurred after she was pushed out of her window.",
          "person": "Bikini",
          "present": [
            "Elise's Autopsy Report"
          ],
          "source": {
            "evidence_span": "Body fell 10 ft. after death.",
            "testimony_span": "The stabbing I saw must have occurred after she was pushed out of her window.",
            "explanation": "The autopsy report indicates that the fall happened after the victim was killed, so the stabbing could not have occured after the victim fell.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        }
      ],
      "noPresent": false
    },
    {
      "category": "cross_examination",
      "newContext": "-- After My Bath --Bikini:\nI finished my bath around 11, and I thought I should return to the Inner Temple.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\n...How far is it from your room to the Inner Temple?\nBikini:\nLet me think a moment... About twenty minutes, on these stumps of mine. It's about 15 minutes to Dusky Bridge from Hazakura Temple. The Inner Temple is just beyond the bridge.\nvon Karma:\nStill, you never made it back there that night, did you?\nBikini:\nT-That's right... I was heading along the walkway toward the Main Hall...Bikini:\nAnd as I was walking back... I heard a noise from the courtyard. I took a look and...Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou say you heard a noise...?\nBikini:\n\"Thump\"... Just like that.\nvon Karma:\n...That could only be the sound of the victim falling.\nBikini:\nIt's very quiet in the temple, you know. You can even hear the snow falling from the branches. \"Thump\"... Just like that.\nJudge:\nBut then, couldn't this noise you heard have been snow falling to the ground?\nBikini:\n... I never thought of that. Wah ha ha. Wha ha ha. Ha ha...\nJudge:\nHoh hoh. Hoh hoh. Hoh hoh... Uaaaaaah!\nvon Karma:\nThe next one to laugh gets a whipping!\nBikini:\nWell. Whatever the source of the sound, I looked over at the courtyard and...Bikini:\nIris was...! Oh, Mystic Elise! And with that sword, of all things!Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\n...This is the second time that the witness has testified to seeing the defendant. But... some doubt remains in these claims.\nBikini:\nHey, just what does that mean!? Just because you're a good-looking young man doesn't give you the right to...\nEdgeworth:\nThe murderer who stabbed the victim with the sword... Sister Bikini, try to recall exactly who it was you saw! As clearly as you can!\nBikini:\nHmm... Well. You're a handsome young man, so I'll forgive you. ... Oh! Now that you mention it... There was something awfully strange about her... Something that has been bugging me all this time!\nEdgeworth:\n...Please, don't keep us in suspense.\nBikini:\nHer hood!\nvon Karma:\nHer hood...?\nBikini:\nThat's right! ...It's coming back to me... Iris... She wasn't wearing her hood! I thought something was out of place, but... It all makes sense now, doesn't it? After all, she'd given that hood away to someone, right?\nEdgeworth:\n...Urk!\nvon Karma:\nHah... You've dug your own grave, Miles Edgeworth!\nJudge:\nWhat do you say, Mr. Edgeworth? Is this testimony important?\n\n\n\nIt's not important\n\n\n\n\n\n\n\nEdgeworth:\n(...This line of questioning is only going to tear the  wound open further.) These statements are as useless as the investigations of a certain detective. ...There is no need to record them.\nJudge:\nHmm...\nJudge:\nVery well. ...Please, continue with your testimony.\nvon Karma:\nHmph...\nLeads back to cross-examination\n\n\n\n\nIt's important\n\n\n\n\n\n\n\nEdgeworth:\n(This may initially appear to put me at a disadvantage... But, I can't see any other leads at the moment...) ...Your Honor. I would like these new statements to be added to the testimony.\nvon Karma:\nHeh... Miles Edgeworth.\nvon Karma:\nIf you want to hang yourself, you need only to ask. I'll gladly lend you my whip!\nJudge:\nWitness. Add that statement to your testimony.\nBikini:\n...No problem.\nAdds statement \"Now that you mention it... Iris didn't have her hood on.\"Bikini:\nNow that you mention it... Iris didn't have her hood on.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou are sure about that...?\nBikini:\nYes. After all, we always wear the same clothes. Ah! I don't mean because we're poor, you understand? It's our style. Yes, that's it!\nEdgeworth:\n...There's absolutely no need to explain yourself.\nBikini:\nAnyway! She looked different from normal, so that really stuck out.\nvon Karma:\nLike me holding a whippet puppy instead of my whip.\nEdgeworth:\n(At least then it might bite you and not someone else...)\nBikini:\nIris didn't have her hood on. I'm sure of it!\nJudge:\n...Very well. Now, please tell us aboot the victim, eh.Bikini:\nMystic Elise was staying in the corner room, which faces out onto the courtyard.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThe room the victim was staying in overlooked the courtyard, correct?\nJudge:\nWhich means... the victim's room was on the second floor?\nBikini:\nNo, no. Hazakura Temple is a single story building. But the mountain itself slopes downward... ...which elevates the Main Gate side of the temple and the guest rooms in the back... ...to about the height of a two story building.\nJudge:\nI see... And the victim was staying in one of these elevated rooms, correct?\nBikini:\nYes... I should know. I'm the one who carried her things to her room, after all...Bikini:\nThe stabbing I saw must have occurred after she was pushed out of her window.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nWhat makes you so sure of all this...?\nBikini:\nIt's just like I told you earlier... \"I heard a noise from the courtyard.\" OK? \"Thump\"... Just like that.\nvon Karma:\nYou're one smart sister, I'll give you that. The autopsy report states that... ...the victim's body was covered in bruises... ...indicating a fall from around 10 feet in height.\nJudge:\nHmm... It appears that the witness was not mistaken then.\nBikini:\nYep. Yep. I'm more than just a pretty face. Especially in winter! I'm a woman of faith, after all. The head honcho of Hazakura Temple.\nEdgeworth:\n(There's only two of them working there...!)\nvon Karma:\nWhat's wrong, Miles Edgeworth? No snappy comeback remark?\nEdgeworth:\n...Present Elise's Autopsy Report\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"...Impressive logic. That's what I'd like to say, anyway.\"Edgeworth:\n(...It doesn't feel like she is lying. This is very powerful testimony, too. She claims to have seen the instant in which the defendant stabbed the victim... There are only two things I can believe in right now... My client, Iris, and my own abilities as a defense attorney.)Edgeworth:\n...Impressive logic. That's what I'd like to say, anyway.Bikini:\nOh please, do! My brain is something else... especially in winter!Edgeworth:\nHowever... I think you are overlooking one thing. ...Ms. von Karma. Would you be so kind as to take another look at the autopsy report?von Karma:\nT-The autopsy report...?Edgeworth:\nThe victim did fall from a height of 10 feet. ...However. This fall... was after she was killed.von Karma:\nAh...!Judge:\nT-That's right! It says \"after death\" right here!Edgeworth:\nThe scene the witness claims to have seen is contradictory! If the defendant stabbed and killed the victim there in the courtyard... ...how did the victim then go on to take a ten foot fall!?von Karma:\nAaah!Judge:\nO-Order! Order! The victim was killed and then fell! If that is the case... ...then the victim must have been killed in her room... Don't you agree?von Karma:\nTh-That is the logical conclusion... Yes, that's right! The victim must have been stabbed by the defendant in her own room! And she was then thrown out of her window down into the courtyard below!Edgeworth:Edgeworth:\nWere there any signs of a struggle in Ms. Deauxnim's room...?von Karma:\n...!Edgeworth:\nShe was stabbed with a sword! That would leave a blood stain, wouldn't you agree?Judge:\nW-Well, Ms. von Karma? Was there any blood...? Waaaaaah!von Karma:\n...No traces of blood were found in the victim's room.Judge:\n...Your whip has just caused traces of blood to be found on my glorious playoff beard. However! If there was no blood in the room, then your claim that... Waaaaah!von Karma:\nI'm sure there's no need for me to go over this... ...as I'm sure Your Honor is well aware... ...of when a stab wound produces the most blood.Judge:\nWhen it produces the most blood...?von Karma:\nVery little blood is actually lost at the moment of a blade's insertion. If you want to talk about when the most blood would be lost from a body... ...that would be when the blade is removed.Edgeworth:\nIndeed. With the weapon still in place... ...it acts like a lid on the wound.Judge:\nThat's true... With the weapon still in the body, there wouldn't be much bleeding... A perfectly reasonable line of thinking!von Karma:\nWe have come to a conclusion then! The victim was thrown out of the window with the sword still in place... This removes all of the contradictions!Judge:\nOrder! Order! Order! I must admit that this is a probable version of events!Edgeworth:\n(I'd expect no less from Franziska von Karma... She locates and takes control of every vital point!)von Karma:\n...Hmph...Judge:\nIt seems... ...that we need a clearer testimony from the witness. Remove all supposition on your part and tell us only the truth, please! Witness! Please! Remain standing on the crate!Bikini:\nDon't go selling me short now! The weight of winter snow has bent me out of shape! ...Especially my back and my mood!von Karma:\nSister. Please, give us your testimony. I will give you a vigorous massage once we are finished here.Edgeworth:\n(...With the whip?)Bikini:\n...Oh, boy. Alright, alright...Witness Testimony-- Further Details --Bikini:\nWhen I looked across at the scene, the sword was already in place.\nThinking about it now, I didn't actually see her stab Mystic Elise.\nI've never seen so much blood before...\nThat's when I fainted. You can't blame me, can you?\nAnd when I awoke... Mystic Ami was... stabbing Mystic Elise through the back!Judge:\nHmm... This all confirms Ms. von Karma's theory...von Karma:\nVon Karmas strive for nothing but perfection. Putting together such facts is nothing for me! You should know that, Miles Edgeworth!Edgeworth:\n(\"Perfection\" is an impossibility, Franziska von Karma... And I'm here to teach you just that...)Cross Examination",
      "testimonies": [
        {
          "testimony": "When I looked across at the scene, the sword was already in place.",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "Thinking about it now, I didn't actually see her stab Mystic Elise.",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "I saw the instant in which the blade, plunged in to the hilt, was smoothly drawn out.",
          "person": "Bikini",
          "present": [
            "Shichishito"
          ],
          "source": {
            "evidence_span": "A seven-branched, jagged sword.",
            "testimony_span": "the blade, plunged in to the hilt, was smoothly drawn out",
            "explanation": "A branched and jagged sword stabbed into the body up to the hilt would not have been smoothly drawn out.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "I've never seen so much blood before...",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "That's when I fainted. You can't blame me, can you?",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "And when I awoke... Mystic Ami was... stabbing Mystic Elise through the back!",
          "person": "Bikini",
          "present": []
        }
      ],
      "noPresent": false
    },
    {
      "category": "cross_examination",
      "newContext": "-- Further Details --Bikini:\nWhen I looked across at the scene, the sword was already in place.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nAt that time... was the victim bleeding?\nBikini:\nWell... I was very shocked to be seeing all this, of course... So I'm not entirely sure... But I don't think I saw any blood. Not then.\nvon Karma:\n...I'm sure that you didn't. The weapon was acting as a plug in the wound.\nEdgeworth:\nIn any case... Let's be clear on one very important point. Did you actually see the instant in which the victim was stabbed!?Bikini:\nThinking about it now, I didn't actually see her stab Mystic Elise.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\n...Think carefully. This is very important.\nBikini:\nIt's Iris we are talking about here! I'm thinking for all I'm worth! ... No, when I looked over, the sword was already in Mystic Elise's body.\nJudge:\nHmmmmmm...\nEdgeworth:\n(It might not be  conclusive, but... ...this testimony supports her theory.)\nvon Karma:\nThe victim was stabbed in her room and then dropped into the courtyard... ...I think this proves it rather well, Miles Edgeworth.Bikini:\nI saw the instant in which the blade, plunged in to the hilt, was smoothly drawn out.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\n\"Smoothly\", you say... You're saying you saw the sword smoothly slide out?\nBikini:\nThat's right...\nBikini:\nThe whole thing happened right next to the gold statue of Mystic Ami. Mystic Elise was on the ground, and Iris was stooped over her. The sword was buried up to the hilt. When Iris stood up, the sword in her hand just slid out of Mystic Elise's body. It slid out from that gaping wound...! Aaaah...\nJudge:\nIt goes without saying... that if the sword was removed there would be bleeding.\nvon Karma:\n...Nothing out of place here.\nEdgeworth:\n(Is that really the case...? I can't help but feel that something about this testimony is very out of place... That something which couldn't possibly have happened... appears to have happened.)Present Shichishito\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Sister Bikini. You are a reliable witness...\"Bikini:\nI've never seen so much blood before...Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\n...So you're saying that you saw the victim's blood?\nBikini:\nT-That's right! Some of it had splattered onto Iris, too...\nvon Karma:\nWhen the defendant was arrested, she was meditating in her room. And her blood-flecked clothing was neatly folded in the corner.\nEdgeworth:\nWh-What!? (Her clothes were blood-flecked as well...?)\nJudge:\nHmmm... That seems quite conclusive to me...\nEdgeworth:\n(What should I do...? Press this point further?)\n\n\n\nStop here\n\n\n\n\n\n\n\nEdgeworth:\n(I can't afford to make things look any worse for the defendant. I'll bide my time for now.)\nJudge:\n...Witness. Please continue your testimony. From after you witnessed the victim bleeding!\nLeads back to cross-examination\n\n\n\n\nPress further\n\n\n\n\n\n\n\nEdgeworth:\nGoing back to your previous statement... ...you said that you saw little bleeding when the victim was stabbed. But now... you say you saw the victim bleeding...?\nBikini:\nWell, well. I say that what I saw is what I saw.\nJudge:\nW-What did you see?\nBikini:\nMaybe I didn't see the poor woman get stabbed... But I saw the girl pull the sword out of her, plain as day.\nEdgeworth:\nPulling the sword out...?\nBikini:\nWell, it wasn't exactly pulling... It was more like it \"came out\".\nJudge:\nWitness! You will add this statement to your testimony!\nBikini:\nOh... Was that important...!?\nEdgeworth:\n(More important than you can imagine...)\nAdds statement \"I saw the instant in which the blade, plunged in to the hilt, was smoothly drawn out.\"Press (after adding statement)\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nWas the bleeding caused by the killer removing the sword...?\nBikini:\nNo mistaking it! I remember it all, clear as day!\nEdgeworth:\n...Don't you think that's a bit odd?\nvon Karma:\nWhat do you mean, Miles Edgeworth?\nEdgeworth:\nWhy would the killer pull out the sword?\nvon Karma:\nWhat...?\nEdgeworth:\nIf all she wanted to do was place the weapon in the hand of the gold statue... ...then there was no reason to remove it from the body. All that would've accomplished is causing the victim to bleed unnecessarily. ...Your thoughts, Ms. von Karma?\nvon Karma:\nT-That's...\nJudge:\nIndeed... It is strange, now that you mention it.\nEdgeworth:\n(I'm going to need to find an answer to this mystery, too...)\nvon Karma:\nA-Anyway! The witness saw something terrible! ...So what did you do after that, witness?Bikini:\nThat's when I fainted. You can't blame me, can you?Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nNow, on to what the killer did next... You saw none of it? Correct?\nBikini:\nWell... I was unconscious...\nvon Karma:\nHow long were you out for?\nBikini:\nI don't know... 10, maybe 20 minutes...? A young man with a very prickly looking head woke me up. ...By stepping on me, actually.\nJudge:\nHmm... I'm not sure I like that method of resuscitation!\nBikini:\nWell, I wasn't asking for mouth-to-mouth, or anything of the sort... ...but I would've welcomed a more gentle awakening right about then, let me tell you.\nEdgeworth:\n...I shall have words with the offender personally. What did you see upon awakening...?Bikini:\nAnd when I awoke... Mystic Ami was... stabbing Mystic Elise through the back!Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nBy \"Mystic Ami\", you are referring to the golden statue, correct?\nBikini:\nJust stabbing someone with the Shichishito, a sacred treasure, is terrible enough.\nBikini:\nBut to then make Mystic Ami hold the blade...!\nvon Karma:\nTruly, a heinous, despicable crime.\nEdgeworth:\nIt is easy to despise something. Anyone can do it. However, there is something that cannot be done so easily...\nvon Karma:\nWhatever it is, I'm sure it's doubly hard for you. Anyway, what is the problem?\nEdgeworth:\nExactly why would the killer set up this gruesome scene? Can anyone explain the reasoning behind that?\nvon Karma:\n...!\nJudge:\nHmmmmm... No, I don't think I can.\nvon Karma:\n... There isn't always a logical reason behind why someone acts!\nBikini:\nThat's true, so true. In early spring, for example, I often find myself...\nEdgeworth:\n(\"There isn't always\"... That phrase might come in handy someday.)Edgeworth:\n(There are too many unnatural elements in this case... Why was it necessary to use the Shichishito from the Ami statue as a weapon? Why was the weapon finally placed back in the hand of the statue? If I can expose the flaws in this testimony, perhaps then I will begin to find the truth.)Edgeworth:\nSister Bikini. You are a reliable witness... At least, I'd like to think so. But there are too many contradictions here.Bikini:\nW-What do you mean? You make it sound as though I'm a liar! But... You're a handsome young man, so I'll forgive you.von Karma:\nWhat contradictions are you talking about?Edgeworth:\nIn the scene that the witness claims to have seen... ...the weapon was thrust up to its hilt into the victim. Furthermore... the killer withdrew the weapon smoothly from the body. ...However! Both of these are complete impossibilities!Judge:\nWhat do you mean...? Please, explain you... Uwaaaaah!von Karma:\nExplain yourself!Edgeworth:\nTo start with... Do you think it would be possible to stab someone to the hilt with this? No matter how I look at the defendant, she doesn't appear strong enough for that.von Karma:von Karma:\n\"Doesn't appear\"...? What meaningless dribble! I, too, may appear to be weak and frail... But I can crush men under my heel and make them weep, should I so choose!Judge:\nThe objection stands! I wept a little back there, I must admit.Edgeworth:Edgeworth:\n...That isn't the only issue here. If this sword was truly stabbed into the body up to the hilt... Well, just look at all the branches on it. It certainly wouldn't come out smoothly.von Karma:\nT-That's...Edgeworth:\nWe also have the problem of the amount of bleeding. It's true that when a blade is left in a body, it acts as a \"plug\" of sorts. However! When the weapon is shaped like this, it's an entirely different story. The wound would be too large for the blade to completely stop from bleeding!von Karma:von Karma:\nT-That's nothing more than conjecture! In reality, the victim was stabbed with the Shichishito. Even a weapon of this nature... ...may still sometimes slide out smoothly, and may still sometimes stop the blood loss!Edgeworth:Edgeworth:\nI'm not finished. There is still one more... conclusive contradiction.Judge:\nY-You've still got more!?Edgeworth:\n...This one is simple. If this sword really was thrust in all the way to the hilt... ...why is there only blood on the tip of it?von Karma:\nAh...!Edgeworth:\nIf this witness is telling the truth... Then there should be blood along the entire length of the sword!von Karma:\nNoooooo!Judge:\nOrder! Order! Ord-- Whaaaaaaaa!von Karma:\nBravo... Miles Edgeworth. Raising this many contradictions from a single piece of evidence! All the other attorneys I know could maybe manage one, if that!Judge:\nBut what does this all mean!? You have proven contradictions regarding the murder weapon, but...Edgeworth:\n...Having come this far, there can only be one answer.von Karma:\nAnd that is...?Edgeworth:\nThe weapon used to kill the victim... ...was not the Shichishito!Judge:\nW-Whaaaaaaaaat!?von Karma:\nA foolishly foolish idea born from the foolish mind of a foolhardy foolish fool.Edgeworth:\nLet's examine this again. What was it that made us think this sword was the murder weapon?Bikini:\nW-Well... It's because Mystic Ami was holding it...Edgeworth:\n...Exactly. However! If you reflect on this, that is the only basis we have to assume such a thing. The impression left by the scene was just too strong. That is what influenced us. It influenced us to believe that the Shichishito was the murder weapon!Judge:\nOrder! Order! Order! Waaaaaaaaah!von Karma:\nSo maybe the Shichishito was not the murder weapon. Even if that is the case... it changes nothing, Miles Edgeworth! The Sister here saw everything! She saw the defendant stab the victim with a sword-like object.Judge:\nHmmmmmm... That's true! Your response, Mr. Edgeworth?Edgeworth:\n... If that is so... I would like the prosecution to answer the obvious question it raises.Judge:\nThe obvious... question?Edgeworth:\n...Yes. Namely... Where did the real murder weapon disappear to?von Karma:\n...!Edgeworth:\nIt goes without saying that the police searched the Main Hall and the surrounding area. ...Perhaps the prosecution can enlighten us as to if a \"sword-like object\" was found.von Karma:\nT-That's...Judge:\nAnswer the question, Ms. von Karma!von Karma:\n... No evidence of that kind was found.Judge:\nHmmmmm... Another mystery to throw onto the pile! A trial without a murder weapon is a tricky beast!Bikini:\nExcuse me... Could I say something...? I just remembered something, actually...von Karma:\n...What is it, Sister?Bikini:\nI was just thinking... It's possible... ...that just maybe... what actually happened was... it was just over there...Judge:\n... What exactly are you going on aboot here?Bikini:\nThe murder weapon, I mean! Maybe... I think I might know where the sword was disposed of!Edgeworth:\nYou what!?von Karma:\nWell then... I think we need to hear testimony from you one more time, Sister.Edgeworth:\n(Impossible...! What else... What else could this old woman have seen!?)Witness Testimony-- Location of the Weapon --Bikini:\nI saw the murder at around 11 PM...\nAnd after asking that it be reported, I went out to the Main Gate.\nAnd there... I saw tracks! Tracks that indicated the snowmobile had been used!\nIt takes 15 minutes to walk to Dusky Bridge, but less than 5 using one of those!\nMaybe they threw the weapon into Eagle River and came back while I was knocked out?\n...Iris could have done that. She can drive a snowmobile after all...Judge:\nHmmmmmm... Witness. Please, tell us everything you know right away next time.Bikini:\nWell. I'm not in the best of shape. What with my back and my age, you know.von Karma:\nQuite... There were indeed snowmobile tracks in front of the Main Gate. Here is a photograph.Judge:\nA snowmobile, eh... I see. Well, it certainly is an interesting theory...von Karma:\nThe tracks begin in front of Hazakura Temple... ...and run all the way to Dusky Bridge!Tracks Photo added to the Court Record.von Karma:\n...That solves your pesky little problem, yes? The Eagle River's current is quite swift, meaning that it doesn't freeze over in winter. Making it the perfect place to dispose of the murder weapon!Edgeworth:\n(Did she really go to the river to dispose of the murder weapon...?)Judge:\nMr. Edgeworth! ...Your cross-examination, please.Cross Examination",
      "testimonies": [
        {
          "testimony": "I saw the murder at around 11 PM...",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "And after asking that it be reported, I went out to the Main Gate.",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "And there... I saw tracks! Tracks that indicated the snowmobile had been used!",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "It takes 15 minutes to walk to Dusky Bridge, but less than 5 using one of those!",
          "person": "Bikini",
          "present": []
        },
        {
          "testimony": "Maybe they threw the weapon into Eagle River and came back while I was knocked out?",
          "person": "Bikini",
          "present": [
            "Tracks Photo"
          ],
          "source": {
            "evidence_span": "One track is shown leading from Main Gate to Dusky Bridge.",
            "testimony_span": "they threw the weapon into Eagle River and came back",
            "explanation": "If Iris left Hazakura Temple, threw the weapon into the river, and then returned, then naturally there should be two sets of tracks in the snow, contradicting the only one track shown in the photo.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "...Iris could have done that. She can drive a snowmobile after all...",
          "person": "Bikini",
          "present": [
            "Tracks Photo"
          ],
          "source": {
            "evidence_span": "One track is shown leading from Main Gate to Dusky Bridge.",
            "testimony_span": "Iris could have done that",
            "explanation": "If Iris left Hazakura Temple, threw the weapon into the river, and then returned, then naturally there should be two sets of tracks in the snow, contradicting the only one track shown in the photo.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        }
      ],
      "noPresent": false
    },
    {
      "category": "cross_examination",
      "newContext": "-- Location of the Weapon --Bikini:\nI saw the murder at around 11 PM...Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\n...You are sure about the time?\nBikini:\nYes... I was worried about it, after all.\nJudge:\nWhy was that?\nBikini:\nBecause I have a strong sense of responsibility. Especially at this time of year. The acolyte was being doused in freezing water at the time... I couldn't very well take it easy in the bath all night now, could I? So at 11, I decided to leave Hazakura Temple.\nEdgeworth:\n(Her estimation of the time seems reliable, at least.)\nvon Karma:\nPlease continue, Sister.Bikini:\nAnd after asking that it be reported, I went out to the Main Gate.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou asked Phoenix Wright to report the crime, correct?\nBikini:\nRight, right, the one who trampled me.\nEdgeworth:\n(It seems she is the type to hold a grudge...)\nBikini:\nThere isn't a phone in the Main Hall, so I sent him to the bridge.\nvon Karma:\nPhoenix Wright... He didn't even have his cell phone on him?\nEdgeworth:\nHe had forgotten it at home, apparently.\nvon Karma:\nWhat a naïve boy, as always! Not only do I always carry my phone, but I always have my whip in hand, too!\nBikini:\nAnyway, I was really scared... And it was taking him a while to get back... So I thought I'd go out by the Main Gate for a spell.Bikini:\nAnd there... I saw tracks! Tracks that indicated the snowmobile had been used!Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nAs I recall, there was a snowmobile outside the Main Gate when I visited.\nBikini:\nThat's it. That's the only one we have. It'll run no matter how much snow falls!\nEdgeworth:\nNow, you're certain the snowmobile was there at the Main Gate when you arrived?\nBikini:\nYes, of course. It was parked in front of the gate.\nvon Karma:\nSo... she had already gone, discarded the murder weapon, and returned by that time.\nEdgeworth:\n(...I'm not sure if this is really relevant... What should I do...?)\n\n\n\nPress further\n\n\n\n\n\n\n\nEdgeworth:\n(...I need answers to every possible doubt.) The snowmobile in question... Was it still warm at that time?\nBikini:\nHuh? Huh? Huh? Huh? What do you mean? What do you mean?\nJudge:\nWhat do you mean, eh?\nvon Karma:\nWhat do you mean, Miles Edgeworth!?\nEdgeworth:\n(...I'm playing to a slow crowd here.) It goes without saying that using a snowmobile will heat its engine. If it was still warm, then it means it was recently used.\nBikini:\nAh! I see! I never thought of that!\nJudge:\nHmmm, that's right! I overlooked that, too!\nvon Karma:\n...Of course you did.\nEdgeworth:\nThen answer the question please, witness.\nBikini:\n... I don't often go around touching hot engines...\nEdgeworth:\n...Hmm.\nBikini:\nHowever... Now that you mention it... There wasn't any snow on it.\nJudge:\nSnow...?\nBikini:\nYes. For some reason, only the snowmobile wasn't covered in snow...\nEdgeworth:\n(There wasn't any snow on it!? Curses!)\nJudge:\nIt seems highly likely that the killer did use the snowmobile then, eh!\nvon Karma:\nHow long does it take to get to Dusky Bridge by snowmobile?\nLeads back to cross-examination\n\n\n\n\nStop here\n\n\n\n\n\n\n\nEdgeworth:\n(It looks very likely that the snowmobile is related to this case. I can't help but think that Iris used it... But for what...? I'd better hold off on this... for now.)\nJudge:\n...Well then, witness.\nJudge:\nHow long does it take to reach the bridge by snowmobile?\nLeads back to cross-examinationBikini:\nIt takes 15 minutes to walk to Dusky Bridge, but less than 5 using one of those!Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nIn that case... why didn't you use it yourself? You could've spared yourself some walking.\nBikini:\nAh! There's a reason for that! Have we got a moment for me to explain?\nJudge:\nI think that's why the question was asked in the first place...\nBikini:\n...It was about a month ago. I was driving my beloved little snowmobile, happy as can be. I'd fetched some water and was heading back when I went and crashed into a tree! The tree and my back both went crunch. Just like that. Crunch.\nJudge:\nHmm... Crunch.\nBikini:\n...I haven't been able to find the courage to ride anything since then...\nBikini:\nAnyway, the killer must have used it!Bikini:\nMaybe they threw the weapon into Eagle River and came back while I was knocked out?Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nRefresh our memory. How long were you knocked out for...?\nBikini:\nLike I said, somewhere between 10 to 20 minutes.\nvon Karma:\nIt's possible to get to the bridge and back in 10 minutes using the snowmobile...\nEdgeworth:\n...I have to concede that is more than enough time.\nvon Karma:\nIs that all you wish to concede, Miles Edgeworth?\nEdgeworth:\n...Present Tracks Photo\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"I admit this photograph proves something.\"Bikini:\n...Iris could have done that. She can drive a snowmobile after all...Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nWhile it would have been possible, time-wise... ...one element remains out of place here.\nJudge:\nOh? And what would this mystery element be?\nEdgeworth:\nThe killer's reasoning, Your Honor. \"Why did the killer do all of this?\" Why go to the Eagle River to dispose of the murder weapon when there are other methods?\nJudge:\nHmm... Too many unanswered questions! Your response, Ms. von Karma? Waaaaaaaah!\nvon Karma:\nTurning to me for help over the slightest thing! Why don't you think for yourself once in a while? ...Your Honor.\nJudge:\nWhaaaaat!?\nEdgeworth:\n(She's as over the top as always...)\nvon Karma:\nA-Anyway... Whatever the reason, the fact remains that the defendant could have done this! The murder weapon was disposed of in the river! Another point to me, Miles Edgeworth!Present Tracks Photo\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"I admit this photograph proves something.\"Edgeworth:\n(Another mystery to feed the fire... \"Was there any reason to go and throw away the murder weapon\"...? Luckily, there is surely a problem with this testimony. Now all I have to do is start poking holes in this flawed account...)Edgeworth:\nI admit this photograph proves something. It proves that the snowmobile was used on the night of the murder.von Karma:\nYou've finally accepted the inevitable, it seems... Miles Edgeworth.Edgeworth:\nHowever... If what the witness says is true, why is there only one set of tracks?von Karma:\nWhat do you mean...?Edgeworth:\nIris left Hazakura Temple, threw the weapon into the river, and then returned. If this was the case, then naturally there should be two sets of tracks in the snow! Those from heading out to the bridge, and those from coming back.Bikini:\n... Ah...! You're right!von Karma:\nHmph... You are forgetting one thing, Miles Edgeworth.Edgeworth:\n...?von Karma:\nOn the night of the murder, it was snowing. The tracks leading to the bridge were erased by the snowfall. This removes your precious contradiction, now doesn't it!Judge:\nI see! While she was at the river, the snow stopped... ...leaving just the return tracks in the snow.von Karma:\nWhat do you have to say now, Miles Edgeworth!Edgeworth:\n(Is there a flaw in her theory...? This idea that the snowfall covered one set of tracks...?)It's flawless.\n\n\n\n\n\n\n\nEdgeworth:\n...The tracks leading to the bridge were covered by the snow.\nEdgeworth:\nI do not have any evidence that can dispute this claim.\nvon Karma:\n...In which case, the rest is simple. Sister. Who was the only person who could have driven the snowmobile that night?\nBikini:\nWell... that would be...!\nvon Karma:\n...You can't hide it. I already know the answer.\nBikini:\n......... It could only be Iris.\nJudge:\nA-And the reason being...!?\nBikini:\nThere is only one key for the snowmobile.\nvon Karma:\nA key... that the defendant is responsible for!\nEdgeworth:\nWhaaaaat!?\nJudge:\nOrder! Order! Now I don't feel like a clueless Puck Bunny! I understand everything! If the defendant did indeed use the snowmobile... ...which means that Iris is most definitely the murder--\nEdgeworth:\n\nEdgeworth:\n...Your Honor! Please, wait a moment.\nJudge:\nWhat is it, Mr. Edgeworth?\nEdgeworth:\nThere is one gaping hole in Ms. von Karma's claim!\nJudge:\n... I'm not sure if I care for your response, Mr. Edgeworth. Next time, bring up whatever issues you have earlier. Do you understand!?\nEdgeworth:\nNngh... (I should have noticed it sooner...!)\nLeads to:\n\"The tracks to the river were covered by snow... What a nice theory.\"There is a contradiction.\n\n\n\n\n\n\n\nLeads to:\n\"The tracks to the river were covered by snow... What a nice theory.\"Edgeworth:\nThe tracks to the river were covered by snow... What a nice theory. However, Ms. von Karma... That is impossible.von Karma:\n... Would you care to explain... ...why there is a rude index finger currently pointed in my general direction?Edgeworth:\n...No need. The evidence will do all of the talking for me.Judge:\nOn the night of the murder the killer went to, and returned from, Dusky Bridge... ...in order to dispose of the murder weapon. The outgoing tracks were erased by snow. ...Or so claims Ms. von Karma. Mr. Edgeworth! Present your evidence to the contrary, eh! Evidence that the outgoing tracks were not covered by snow!Present Weather Data\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nWitness! Please tell us again what time it was when you witnessed the crime.\nBikini:\nLike I said! It was around 11.\nEdgeworth:\n...Of course, this means that the weapon was thrown away after that time, correct? On that note... Please take a look at this data. It is the weather report for Eagle Mountain on the night of the murder.\nJudge:\nThe... weather report...?\nEdgeworth:\nSnow started to fall at 7 PM... But it stopped at around 10:50.\nvon Karma:\n...!\nEdgeworth:\nTherefore! When the Sister witnessed the crime at 11 PM... ...the snow had already stopped falling! It is impossible for any tracks made after that time to have been covered up!\nvon Karma:\nAaah!\nJudge:\nO-Order! Order!\nJudge:\nVery well then... It looks like Ms. von Karma's claim has been... snowed in. Waaaaaah!\nvon Karma:\n...It's too soon to be closing this trial due to snow! Miles Edgeworth! How pathetic of you to rely on the weather of all things!\nEdgeworth:\n...\nvon Karma:\nAnswer me this, then! When is a weather report ever correct!?\nJudge:\nAh, no, no no... You've got it all wrong. This isn't a forecast... This is... actual data... Gyaaaaah!\nvon Karma:\nForecast, data, all weather reports have some inaccuracies! It may have still been snowing in the vicinity well past 11 PM!\nJudge:\nHmmmm... It's true. We cannot be totally sure, eh!\nEdgeworth:\nW-What!? (How did she pull that off!?)\nJudge:\n\"It had stopped snowing at Hazakura Temple when the murder took place.\" ...You need to provide conclusive evidence of this.\nEdgeworth:\n(I've come this far... There's no turning back now.) ...Very well. I, too, cannot allow any doubt to remain concerning this testimony.\nvon Karma:\nHah... You can't back down, can you? Such a perfectionist, Miles Edgeworth!\nJudge:\nVery well then... Mr. Edgeworth! Where is your evidence that it had already stopped snowing when the victim was killed!?\n\n\n\nPresent Crime Photo\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Ultimately, it all comes down to one point.\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nJudge:\n... Your response, Ms. von Karma?\nvon Karma:\nIt looks like... It is still snowing in your heart, too. Shivering in the cold, you are closing your eyes to the truth...\nEdgeworth:\n...!\nJudge:\nAnd to think you just arrived after a long, tiring flight from Germany. That was poetry. Pure poetry.\nEdgeworth:\n(This evidence is only going to freeze my case solid.)\nvon Karma:\nRespond! Miles Edgeworth.\nEdgeworth:\nEven if it is snowing in my heart... At the time of the murder... it had already stopped snowing at Hazakura Temple!\nLeads back to:\n\"Very well then... Mr. Edgeworth!\"Present Crime Photo\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Ultimately, it all comes down to one point.\"Present anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nHere is the evidence! What do you have to say, Your Honor...?\nJudge:\n... ...This reminds me of when I was a little hockey goon in training... When I was a child, I hoped for school to be canceled due to heavy snowfall. Perhaps, Mr. Edgeworth, it would've been better for you had court been snowed in. ...That's all this evidence says to me, in any case.\nEdgeworth:\n... Nothing else...?\nJudge:\nNothing else.\nvon Karma:\nOh dear... You seem to have missed, Miles Edgeworth.\nEdgeworth:\nNngh...!\nEdgeworth:\n(According to the witness's testimony, the incident occurred after 11 PM... In which case... ...there has to be evidence that can undeniably prove something doesn't match up!)\nLeads back to:\n\"On the night of the murder the killer went to, and returned from, Dusky Bridge...\"Edgeworth:\nUltimately, it all comes down to one point. That being... Whether or not it was snowing in that courtyard when the victim was stabbed...von Karma:\nThat's right. But proving that is...Edgeworth:\nIncredibly easy.von Karma:\n...!Edgeworth:\nIf we want to know whether it was snowing or not, this photo will tell us everything. Of course, I am referring to the photo of the crime scene. As you can see... everything is covered with snow. ...With just one exception.von Karma:\nAnd that is...?Edgeworth:\nThe victim herself, Ms. Elise Deauxnim! Why is there no snow on top of her...? The answer is simple! It had stopped snowing when she was killed, that's why!von Karma:\nGnnngh!Edgeworth:\nIn other words! If the killer really did go to the Eagle River to dispose of the murder weapon... ...then in this photograph, there should be two sets of tracks!von Karma:\nAaaaah!Judge:\nOrder! Order! Just what are you... Gyahaah!von Karma:\nJ-Just what are you suggesting, Miles Edgeworth!?Edgeworth:\n(To be honest... I am not entirely sure myself. But...) This is simply what all of the facts point to. That night... someone used the snowmobile to leave Hazakura Temple. From the tracks left, it can be understood that they were heading for Dusky Bridge. At that time... it was still snowing.von Karma:\nOf course it was. Because those tracks were erased by the snow. (Changed from [Of course it was. Because those tracks were gone.] in the original release)Edgeworth:\nThen when this person returned to Hazakura Temple... ...the snow had stopped. Thus, the return tracks remained.Judge:\nHmmmmm...Bikini:\nCan I say something? This all sounds a bit fishy to me...von Karma:\n...What does, Sister?Bikini:\nThere is only one key for the snowmobile.Edgeworth:\n...!von Karma:\nFurthermore, on the night in question, we know that the defendant had it! The key was found in her room after the murder!Bikini:\n...Which can only mean, that night... Iris used the snowmobile to go to the Inner Temple...Edgeworth:\n(But... Iris said that she never went there... I should probably press on this point some more when I get the chance...)Bikini:\nThe snowmobile can't cross the suspension bridge... So, she must have left it on the Hazakura side of the bridge and crossed on foot.Judge:\n...That sounds right.Bikini:\nBut... What's odd is, when I left Iris and returned to Hazakura Temple... I didn't see anything near Dusky Bridge.von Karma:\nY-You must have just failed to see it, Sister.Bikini:\nMaybe... But when I made it back to Hazakura Temple... ...it was there, by the Main Gate... The snowmobile, I mean. I know what I saw. It was covered in snow, too...Edgeworth:\nB-But that... isn't possible!Judge:\nOrder! Order! Order in the court! ...What does this all mean?von Karma:\n...Nngh...Edgeworth:\nSo then what was the snowmobile used for...? It wasn't taken by the defendant when she went to the Inner Temple. If it had been, then the witness couldn't possibly have seen it by the gate. Furthermore... it wasn't used by the killer to dispose of the murder weapon. If that was the case, there should be two sets of tracks in this photo. All we know is this... After it stopped snowing... someone used the snowmobile to return to Hazakura Temple!Judge:\nHmmmmmm...Edgeworth:\n(I never thought a simple snowmobile could cause so much trouble...)Judge:\n... I think we've learned all we can from this witness... (Changed from [I think we've arrived at this point due to the witness...] in the original release)Bikini:\nYes, yes. I've nothing more to add. I've told you everything -- everything that I know.Judge:\nBut then... that still leaves us with the same problem. (Changed from [Well then... That still leaves us with the same problem.] in the original release) If only there was someone... A witness who could testify to having seen the snowmobile!Edgeworth:\n(A witness, huh...)Judge:\nWas there no one out, walking perhaps, near Dusky Bridge on that night?Bikini:\n... I don't think that's likely. It was cold enough to freeze your ears off. Only an idiot would go out wandering in that. ...Unless they had something really important to do.Judge:\nHmmmm... That's a shame.Edgeworth:\n(Hold on... Something is coming to me... An idiot may well have gone wandering out on that sub-arctic night!) ...Your Honor! Actually... there just might be one individual who may be of help to us. (Changed from [I actually have an idea... There may be one individual able to help us.] in the original release)Judge:\nR-Really!?von Karma:\n...You know of someone who might have seen the snowmobile on the night of the murder...?Edgeworth:\nI don't know for sure if he saw it or not... But there are two things about him that do come to mind.Judge:\nWhich are...?Edgeworth:\nFirst... that he saw \"something incredible\" on the night of the murder.von Karma:\n...And the second being?Edgeworth:\nThis individual that I am thinking of went wandering outside on that cold night... In other words, he is our kind of idiot.Judge:\nMr. Edgeworth! Who is this idiot you're talking aboot!?Present Larry Butz profile\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"This guy must be a product of \"Jean-Luc de Laduc's Guide To Obnoxious French Painting\"...\"Present anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nJudge:\nJust what is the meaning of this, Mr. Edgeworth...? Are you saying that... this is the person who was near Dusky Bridge that night?\nEdgeworth:\nI-I did think so, however... Aaah!\nvon Karma:\nYou're the wandering idiot, Miles Edgeworth!\nEdgeworth:\nCool off before you try to take me on again! Ungh...! (What was I thinking!? This is the perfect chance to drag him onto the stand!)\nJudge:\nHmmmm... Mr. Edgeworth. This individual... Did they really see the snowmobile that night?\nLeads back to:\n\"I don't know for sure if he saw it or not...\"Judge:\nThis guy must be a product of \"Jean-Luc de Laduc's Guide To Obnoxious French Painting\"...Edgeworth:\nThis is Larry Butz... The student of the victim, Elise Deauxnim.Judge:\nHer student...? Interesting. Why was he wandering on the night of the murder?Edgeworth:\nT-That's... (I could tell them all about his designs for Iris... But it may cost us his credibility as a witness... Before I even call him.) He is, after all, an artist. He was, perhaps, searching for something in the snowy scenery that would move him. ...Although I cannot guarantee that this is the reason.von Karma:\nAnd so...? This unfortunate, unreliable-looking man... What exactly was it that he saw?Edgeworth:\nI intend to extract that from him, right here in this courtroom.Judge:\nSummon this youth as a witness immediately!von Karma:\n... I have no choice, do I?Edgeworth:\nI believe he is in the gallery for this trial. It will not take long to summon him.Judge:\n...Very well.Edgeworth:\n(Larry... You may have escaped me yesterday... But today I'm going to get everything out of you!)Judge:\n...The court will now adjourn for a 20 minute break. Ms. von Karma, please see to preparing the next witness.von Karma:\n...Understood, Your Honor.Judge:\nGood... Well then! Court is now in recess!To be continued.February 9, 11:15 AMDistrict CourtDefendant Lobby No. 1Iris:\nExcuse me... Mr. Edgeworth? I'm not really sure what to say...Edgeworth:\nIris. We only have 20 minutes. There are two things which I need to ask you before we reconvene.Iris:\n...Alright. I'll help you any way I can.Edgeworth:\nFirst, about that night. You really didn't go to the Inner Temple, correct? The last witness claims to have met and talked with you in the Training Hall. Either you or Sister Bikini... ...is lying.Iris:\n... Mr. Edgeworth. It is just as I said yesterday. Until the incident occurred... I was in my own room, in Hazakura Temple.Edgeworth:\n...Very well. The second thing, then. That night, the temple snowmobile was used in between the time Sister Bikini... ...returned to the Main Hall and when she bore witness to the murder. Sometime between 10:30 and 11 PM that night. Were you the one who used the snowmobile?Iris:\n... There is only one key for the snowmobile. The only person who could have used it... was me.Edgeworth:\nSo it was you...! But... why? ...What made you go out to Dusky Bridge?Iris:\n... I'm sorry, Mr. Edgeworth.5 PSYCHE-LOCKSEdgeworth:\nIris...Iris:\nI can't... tell you about that... yet.Edgeworth:\n\"Yet\"...?Iris:\nNot until her safety is confirmed...Edgeworth:\nHer?Iris:\nThe safety of the acolyte...Edgeworth:\n(The \"acolyte\", huh... She's must be talking about Maya...) ... Iris. Look me in the eye and tell me the truth. Did you kill Elise Deauxnim?Iris:\n... No matter who or what may come... I could never take a life.Edgeworth:\n... (As I thought... no Psycholocks...) ...Very well. It is my job to get to the truth. You'll discover this for yourself soon enough.February 9, 11:36 AMDistrict CourtCourtroom No. 7Judge:\n...Court will now reconvene. Ms. von Karma. Where is the witness...?von Karma:\nDuring the break, a man was detained for suspicious behavior in the gallery.Edgeworth:\nSuspicious behavior...?von Karma:\nHe was sketching something... Very intensely.Judge:\nDare I ask what the witness was sketching when he was detained?von Karma:\nHe drew a terrifying woman, armed with a demonic face and a vicious whip.Judge:\n... I can only presume that his intention was to capture you-- ...Aaaah!von Karma:\nAnyway, it's time to drag this pathetic excuse for an artist before the court! Laurice Deauxnim! I hope you're ready... Get in here!Edgeworth:\n(It would seem that whip is going to see plenty more use today...)Butz:\nOuch!von Karma:\n...Your sketch is in contempt of this court!Butz:\nH-Hey! I was just artistically rendering... Ou-Ouch!von Karma:\nYou tried to run away from the bailiff who was trying to hand you your subpoena, correct?Butz:\nL-Look! I'm nothing but a fledgling artist, training out in the mountains! I'm only down here in the city because I ran out of green paint. Well, to use the technical term for the color, \"viridian\".Edgeworth:\n...Larry... This isn't an art store, now is it...?Butz:\nI know! I graduated junior high, OK!? Look. Art is all about working in the fields, isn't it?Judge:\nWorking in the fields...?Edgeworth:\nI presume he wanted to say \"field work\"... I hope.Butz:\nTh-That's it! Thanks, buddy!Edgeworth:\n(It's kind of sad that I was able to understand his mangled train wreck of a sentence...)Butz:\nI just happened to stop in here and found a wonderful new model!von Karma:\n...Butz:\nSo see!? I've got nothing to do with this trial! At all! I expect all of your faces to be red when you realize this mistake! Bright red! Or, to use the technical term, \"crimson lake\". ...Ou-Ou-Ouch! Ou-Ou-Ou-Ouch! Ouch!Judge:\nOu-Ou-Ou-Ouch! Ouch! Ou-Ouch!von Karma:\nStop your pathetic blabbing and testify like a man!Judge:\nRefrain from whipping me, Ms. von Karma! Cross-whipping is as bad as cross-checking. Witness! That was all your fault! Testify, now!Butz:\nWaaaah... This is almost too much for me...!Witness Testimony-- What I Saw --Butz:\nI was at that lodge out in the mountains, looking up at the stars that night.\nI walked to the bridge a number of times, but...\nI didn't see a s-snowmobile!\nI didn't see anyone at the bridge that night either! (Changed from [I didn't meet anyone at the bridge that night!] in the original release)\nThe girl I was waiting for didn't show up... My teacher died on me...\nI'm all alone now. Aren't I, Edgeyyyyy...!?Judge:\nWitness! Please refrain from talking directly to the lawyers during your testimony!Butz:\nI-I'm just a nobody! Nothing but a small, worthless man, aren't I!? And why wasn't I asked for my name and occupation... or anything else...!?Judge:\n... Mr. Edgeworth. This man seems to have quite a severe inferiority complex.Edgeworth:\n...He's recently been the cause of numerous incidents. I think he's finally realized for himself... ...just how much of a nuisance he has been to other people!Butz:\nYeah, that's right! I'm behind everything, every case! Watch out, OK! Just touching me will make you eternally unhappy!Judge:\n...Well then, let us proceed with the cross-examination. With no touching, thank you. We can delve into other details at a later time.Cross Examination",
      "testimonies": [
        {
          "testimony": "I was at that lodge out in the mountains, looking up at the stars that night.",
          "person": "Butz",
          "present": []
        },
        {
          "testimony": "I walked to the bridge a number of times, but...",
          "person": "Butz",
          "present": []
        },
        {
          "testimony": "I didn't see a s-snowmobile!",
          "person": "Butz",
          "present": []
        },
        {
          "testimony": "I didn't see anyone at the bridge that night either!",
          "person": "Butz",
          "present": [
            "Phoenix Wright"
          ],
          "source": {
            "evidence_span": "N/A",
            "testimony_span": "I didn't see anyone at the bridge that night",
            "explanation": "The witness Larry Butz has seen Phoenix Wright that night.",
            "is_self_contained": "no",
            "context_span": "Phoenix:\nD-Don't scare me like that, Larry! I almost had a heart attack!\n\nButz:\nMy name isn't Larry! It's Laurice!\n\nPhoenix:\nLarry, hurry up and call the police! I'm going to the Inner Temple!\n\nButz:\nD-Don't be stupid! The bridge is nothing but a burning wreck right now!"
          }
        }
      ],
      "noPresent": false
    },
    {
      "category": "cross_examination",
      "newContext": "-- What I Saw --Butz:\nI was at that lodge out in the mountains, looking up at the stars that night.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\n...\nJudge:\nWhat ever is the matter, Mr. Edgeworth?\nEdgeworth:\nThis one single statement is so full of contradictions... For a moment there, I thought I was going to collapse.\nJudge:\nHmm...\nvon Karma:\nSo, witness? Any idea as to where these contradictions in your testimony lie? Depending on your answer... I may let my whip have its way.\nButz:\nOK, give me a minute... Well, it was snowing that night so I couldn't possibly have seen the stars. That run-down shack is hardly a \"lodge\", is it...? And even if the stars could be seen, it isn't like I was there to look at them, right?\nEdgeworth:\n...\nvon Karma:\nSee? You can do it if you try.\nButz:\nHeh heh heh... Ou-Ou-Ou-Ouch!\nvon Karma:\n...There is only one issue here. What you saw at Dusky Bridge.Butz:\nI walked to the bridge a number of times, but...Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\n\"A number of times\"...? How many?\nButz:\nMaybe... five times? I went once every twenty minutes.\nEdgeworth:\nWhich means... ...you spent almost two hours at Heavenly Hall that night?\nButz:\nYou bet! Real love is about waiting with your heart in your hands!\nJudge:\nLove, you say...?\nEdgeworth:\nIt was this man's intention to summon the defendant to the small shack. ...Using this blackmail letter.\nJudge:\nB-Blackmail...!?\nButz:\nNo, no! That was simply a product of overflowing love... A-Agh!\nvon Karma:\nYou huffy, puffy, loosey-goosey excuse for a whimpering whining wuss of a witness!\nJudge:\nSo... what did you see? I hope for your sake you saw a snowmobile... You huffy, puffy, loosey-goosey excuse for a whimpering whining wuss of a witness, eh!\nButz:\nUm... well... You see...\nEdgeworth:\n(Being called those names doesn't seem to bother him at all...)Butz:\nI didn't see a s-snowmobile!Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\n...Larry! You really didn't see it?\nButz:\nH-H-Hey! No need to hit your desk! I can hear you! ...I didn't see it! I didn't see a s-s-snowmobile!\nEdgeworth:\n... Larry. Say \"snowmobile\" for me, please?\nButz:\nS-S-S-Snowmobile.\nEdgeworth:\nIf you truly have nothing to hide... ...then why are you stammering like you just flew over a cuckoo's nest!?\nButz:\nSh-Shut up! W-W-What is this!? I don't know! Don't ask me!\nEdgeworth:\n(It seems that I'll need to start from a more obvious contradiction. I'm going to strike the blow that will finally get him to spill the beans!)Butz:\nI didn't see anyone at the bridge that night either! (Changed from [I didn't meet anyone at the bridge that night!] in the original release)Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou didn't meet anyone?\nButz:\nThat's right. Because I've got nothing to do with this! And I'm just here to buy some viridian paint, OK!? Come on, I expect to see those crimson lake faces! Now!\nJudge:\n... It would appear that simply pressing him isn't going to be enough, Mr. Edgeworth.\nEdgeworth:\n...Indeed.Present Phoenix Wright profile\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Larry Butz...\"Edgeworth:\n(It seems that he's going to claim to have nothing to do with this to the end. I don't want this guy to cost us any more time... I need to slice through his obvious contradictions and keep things moving along...)Edgeworth:\nLarry Butz... I can understand why you might want to throw your old life away. You're pretty pathetic, and you cause all sorts of trouble...Butz:\nI'm sorry...!Edgeworth:\nBut... Having realized just how much of a nuisance you have been... ...that could be considered a step in the right direction.Butz:\nEdgey! Are you... trying to console me?Judge:\nIt certainly doesn't sound that way to me.Edgeworth:\nHowever... I cannot forgive you for simply turning away from the incidents you create!Butz:\nWaaah... You're totally pinning this on me...Edgeworth:\n...Now then. Let us talk about the night of the murder. Sister Bikini, after seeing the murder take place, asked Phoenix Wright to report it. Thus, he headed for the public phone by the bridge... There, he happened across a certain nefarious individual! You, Larry Butz!Butz:\n... That's right. Me, in the flesh.Judge:\nHmm... Listen carefully, witness. It doesn't matter if you change your name. So long as you remain pretty pathetic, you will continue to cause these incidents! That reality will not change!Butz:\nB-But...! What do you want me to do, then!?Edgeworth:\nLarry. What you need to change is your inner self. But for now... (Changed from [Larry. What you need to change is your inner self.] in the original release) \"What you saw that night\"... Testifying truthfully about this one issue is all I need from you. (Changed from [Testify truthfully! That is all you can do for now.] in the original release)Butz:\n... Edgey... I... I think... I've finally woken up! ... Well. I guess I could still be sleeping... But anyway! I'll do it! I'll testify! ... Well. I'm not sure this'll go especially well...Judge:\nI'll ask again, then, witness. What did you see on the night of the murder?Witness Testimony-- What I Saw, Pt. 2 --Butz:\nI went to the shack at around 9, so it would have been about 10:30 PM...\nI was lying under my bedding when a white flash almost blinded me!\nI looked out the window... and Dusky Bridge was on fire!\nThere was still some thunder, but I went right away to check it out.\nThat's when I ran into Nick.Judge:\nHmmmm... You certainly saw quite a lot, didn't you?von Karma:\nSo... what happened to the bridge after it caught on fire?Butz:\nIt was like me after a three-day stint chasing a girl... It totally burnt out. Like, almost totally gone. ...I mean, trying to cross the burning remains was what caused Nick to fall.von Karma:\nW-What did you say!?Edgeworth:\nOh, don't worry... It's nothing life-threatening. He just caught a cold. (Changed from [Oh, don't worry... nothing life-threatening. He just caught a cold.] in the original release)von Karma:\n...I never know with that man if he should be called lucky or unlucky... (Changed from [As always, hard to know if he should be called lucky or unlucky...] in the original release)Judge:\nNow, Mr. Edgeworth! Please commence your cross-examination.Cross Examination",
      "testimonies": [
        {
          "testimony": "I went to the shack at around 9, so it would have been about 10:30 PM...",
          "person": "Butz",
          "present": []
        },
        {
          "testimony": "I was lying under my bedding when a white flash almost blinded me!",
          "person": "Butz",
          "present": []
        },
        {
          "testimony": "I looked out the window... and Dusky Bridge was on fire!",
          "person": "Butz",
          "present": []
        },
        {
          "testimony": "There was still some thunder, but I went right away to check it out.",
          "person": "Butz",
          "present": []
        },
        {
          "testimony": "That's when I ran into Nick.",
          "person": "Butz",
          "present": []
        },
        {
          "testimony": "I arrived at the bridge, and Nick showed up less than a minute later.",
          "person": "Butz",
          "present": [
            "Weather Data"
          ],
          "source": {
            "evidence_span": "Lightning struck Dusky Bridge at 10:45.",
            "testimony_span": "I arrived at the bridge, and Nick showed up less than a minute later.",
            "explanation": "According to the weather report, the lightning fell at 10:45 PM. It takes less than five minutes from the shack to Dusky Bridge, meaning the witness got to the bridge before 11 PM, which was when the murder happened. Around that time, Phoenix Wright was in the courtyard, so the witness could not have met him.",
            "is_self_contained": "no",
            "context_span": [
              "Bikini:\nI saw the murder at around 11 PM...",
              "von Karma:\nHow far is this small shack you were in from the bridge?\n\nButz:\nHold on... Well, it had pretty much stopped snowing... I guess about a five-minute walk?",
              "February 7, 11:06 PM\nHazakura Temple\nCourtyard\n\nPhoenix:\n(That scream... I'm sure it came from around here...) ...Aaaah! (S-Someone's there... On the ground...!) M-Ms. Deauxniiiiiim!"
            ]
          }
        },
        {
          "testimony": "I thought I'd never get another chance to see something so big burning!",
          "person": "Butz",
          "present": []
        }
      ],
      "noPresent": false
    },
    {
      "category": "cross_examination",
      "newContext": "-- What I Saw, Pt. 2 --Butz:\nI went to the shack at around 9, so it would have been about 10:30 PM...Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nWhat did you do out there in the cold for an hour and a half?\nButz:\nWell, if you really must know... I was busy being excited. I guess.\nJudge:\nHmmmmm... \"Excited\"? Dare I even ask...?\nButz:\nI set the meeting time as 10:00 PM, right? But I couldn't wait. And I thought she might come early, too.\nEdgeworth:\n...Well, it appears she didn't come at all, in the end.\nvon Karma:\nBecause they never arranged to meet in the first place, did they?\nButz:\nShut up! Don't go picking my fond memories apart! Anyway, I was getting a little worried. I thought maybe Iris had lost her way. So every twenty minutes or so, I went out to the bridge. But I didn't see anything particularly suspicious... I didn't have anything else to do, so I went back to the shack to wait for her.Butz:\nI was lying under my bedding when a white flash almost blinded me!Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThis \"light\" was, of course...\nButz:\nLightning. Like... KERPOW! Like a slap from Naomi, honestly! A big bada-boom! Hagaaaaah!\nvon Karma:\n...Or a little like that?\nButz:\nWaaah! That's more like a punch from Miranda!\nJudge:\nWitness, did you actually see the lightning hit the bridge?\nButz:\nWell, I was a bit startled by the flash of light, so...Butz:\nI looked out the window... and Dusky Bridge was on fire!Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nSeeing that, what did you do?\nButz:\nWhat do you think!? I was burning up as well! From the fire in my heart!\nvon Karma:\nAnd that's why you went to take a look at the bridge?\nButz:\nWell. To be honest... It was freezing cold, so at first I thought, \"Forget it. I'm not leaving my covers.\" But it had pretty much stopped snowing... So, I dunno, I changed my mind.\nJudge:\nHmmmmmm. I'm not sure I care for the \"forget it\" attitude you had at first, witness.Butz:\nThere was still some thunder, but I went right away to check it out.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou said \"right away\"... But exactly how long after the strike was that?\nButz:\nHmm... The lightning fell, and then the bridge caught on fire... Maybe around five minutes? I mean. I suddenly thought, \"Gotta go check this out!\"\nvon Karma:\nHow far is this small shack you were in from the bridge?\nButz:\nHold on... Well, it had pretty much stopped snowing... I guess about a five-minute walk?\nEdgeworth:\nAnd how did Dusky Bridge look when you got there?\nButz:\nLike I had recovered a piece of my childhood. I mean, not even the bonfires kids make during school camping trips can compare!\nEdgeworth:\n(...Well? Should I press him for a little more info?)\n\n\n\nNot right now.\n\n\n\n\n\n\n\nEdgeworth:\n(I don't think we can expect any more relevant information... Probably best to turn to other leads.)\nJudge:\n...Witness. Please continue your testimony.\nLeads back to cross-examination\n\n\n\n\nWhy didn't you call anyone?\n\n\n\n\n\n\n\nEdgeworth:\n...Larry. Let me ask you one thing.\nButz:\nWhat is it, Edgey? What's with the serious face?\nEdgeworth:\nWhy didn't you call anyone?\nButz:\nHuh? What do you mean? (Changed from [Eh? What do you mean?] in the original release)\nEdgeworth:\nNormally... when faced with a \"towering inferno\", one would try and tell someone. There is a public phone right by Dusky Bridge, correct?\nButz:\n... Well, of course I thought of doing that.\nJudge:\nSo then... let's hear why you didn't!\nButz:\nH-Huh? Yeah, OK. A reason... My reason... It isn't that I didn't try to tell anyone... I just didn't have time to, OK?\nChanges statement from \"That's when I ran into Nick.\" or \"I thought I'd never get another chance to see something so big burning!\" to \"I arrived at the bridge, and Nick showed up less than a minute later.\"\n\n\n\n\nWhy did you go to the bridge?\n\n\n\n\n\n\n\nEdgeworth:\nSo you suddenly thought to \"check out\" the bridge...? Does this mean that you initially had no intention of doing so?\nButz:\nW-Well... Yeah, I guess it does... It was really cold... I didn't really want to go out there.\nEdgeworth:\nIf that's the case... Why did you change your mind? I would like to hear your reasoning.\nJudge:\nIn which case... please give testimony to that effect, witness!\nButz:\nM-My reasoning... OK... Reasoning, is it...?\nChanges statement from \"That's when I ran into Nick.\" or \"I arrived at the bridge, and Nick showed up less than a minute later.\" to \"I thought I'd never get another chance to see something so big burning!\"Butz:\nThat's when I ran into Nick.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nHow did Phoenix Wright look when you met him?\nButz:\nHmm... He looked like a beaten up mule. He was dead tired. I mean, he had run all the way from Hazakura Temple. He simply stood, staring at me, breathing hard for a moment.\nvon Karma:\nHow far is it to Hazakura Temple from the bridge?\nButz:\nOn his legs... a 15 minute run, I'd say.\nJudge:\n...And that's when the murder was reported?\nButz:\nThat's right! And then he took a fall from the bridge!Butz:\nI arrived at the bridge, and Nick showed up less than a minute later.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou claim to have arrived at the bridge at the same time as Wright?\nButz:\nY-Yeah! I thought, \"I'd better tell someone about this.\" But then Nick came up yelling about murder! It totally made me forget about the bridge. The fire was pretty much out by then, anyway.\nEdgeworth:\n(What's this feeling...? I suddenly have a terrible case of unease...!)\nvon Karma:\nIt was after contacting the police that Phoenix Wright fell from the bridge, correct?\nButz:\nYeah. That's pretty much it. More or less.Present Weather Data\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Your very existence being a contradiction, I'm not sure if you can grasp this or not...\"Butz:\nI thought I'd never get another chance to see something so big burning!Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\n...So you decided to go and see what was happening?\nButz:\nThat's right! We're talking about a massive suspension bridge burning to high heaven! That's not something you see every day. A real spec... specule... ... Like, really special?\nEdgeworth:\n(Can we really trust a witness who is unable to pronounce \"spectacle\"?)\nJudge:\nLife seems to love hitting this poor witness below the belt...\nButz:\nWell, my motto is to \"hit life back as hard as I can.\" A-Agah!\nvon Karma:\n...I'll give you a few hits too, if you'd like. With my whip.Edgeworth:\n(...He told me about the burning bridge yesterday. But there's still something that doesn't quite fit... It looks like... ...despite his change of heart, Larry still isn't telling us the whole truth.)Edgeworth:\nYour very existence being a contradiction, I'm not sure if you can grasp this or not...Butz:\nWhat the hey, Edgey!? You make me sound like some sort of alien!Edgeworth:\nBut your testimony is conclusively contradictory. The problem here... is time.Butz:\nI've never been the best timekeeper, you know. \"Three minutes after Billy leaves on foot, you follow him on your bicycle. How long does it take for you to catch up with him?\" Terrible at those.Edgeworth:\n...This is much more simple. You saw the lightning strike Dusky Bridge... ...and immediately went to see what had happened. ...Is this correct?Butz:\nYeah... Well, I wasted about five minutes first, but more or less.Edgeworth:\n...I have the weather data from the night of the murder here. According to this, the lightning fell at 10:45 PM. You say it takes less than five minutes from the shack to Dusky Bridge. Meaning you probably got there at around 11 PM.Butz:\n...That all sounds about right, I guess. And then Nick showed up and did his falling act.Edgeworth:\nThat is impossible.von Karma:\n...What do you mean?Edgeworth:\n11 PM is when the murder occurred in Hazakura Temple. Thus... Wright was still there, in the courtyard. There is no way that Larry could have encountered him at Dusky Bridge at that time!von Karma:\n...!Butz:\nAh! Excuse me! I-I have an objection!Judge:\nYou do?Butz:\nEdgey! How many times do I have to say this!? I'm not Larry! I'm Laurice Deauxnim! Gyaaah!von Karma:\n...It has not been proven that the murder occurred at 11 PM. The Sister only said, \"around 11\". ...In which case! It could have been earlier than that!Edgeworth:\n...Watch your footing there, Ms. Franziska von Karma. The slope ahead is slippery! For there is still no way that Wright could have been at Dusky Bridge at 11 PM!von Karma:\nAnd why not!?Edgeworth:\nIt is clearly written here in the weather data report. It took around 30 minutes for the bridge to burn out. Therefore! The bridge must have been burning until at least 11:15 PM!Judge:\nWhich means... what, exactly?Edgeworth:\nWright did not see the bridge as it was burning that night. In fact, he did not arrive on the scene until after the flames had died down! (Changed from [He did not arrive there until after the flames had died down!] in the original release; extra space between [had] and [died] in the Trilogy release) ...Larry! You arrived at the bridge at 11 PM. But Wright did not make it there until at least 11:15... (Changed from [Wright did not make it there until at least 11:15...] in the original release) I suggest you to stop hiding things and just tell us the whole truth. Now, then... (Changed from [Are you still trying to hide something from us!?] in the original release) What happened during these missing 15 minutes!?Butz:\nUrk... I... I feel like I just got brutally woken up by toilet splashback... (Changed from [I... I feel like I just woke up...] in the original release) I guess I was still sleeping after all! Ha ha ha! Pinch me!Judge:\nOrder! Order! Order! Ordaaaaaaaaagh!von Karma:\n...So there was a missing 15 minutes prior to meeting Phoenix Wright. I hardly see that as much of a problem!Butz:\nYeah! Not much of a problem at all!Edgeworth:\nReally...? The bridge is burning before your eyes, and there is a phone right next to it. Why, then, did you not report the accident?Judge:\nYes, witness! Why didn't you!? Were you there simply to watch the bridge burn? (Changed from [Did you simply... watch the bridge burn?] in the original release)Edgeworth:\nAnd therein lies the problem. (Changed from [That is the problem here...] in the original release) For even after the bridge had burnt out, he was still there! (Changed from [Even after the bridge burnt out, he was still there!] in the original release) Staring into space, this witness didn't even attempt to fulfill his civic duty! (Changed from [He simply stood there and didn't report anything.] in the original release)von Karma:\nTh-That's what it sounds like...Edgeworth:\nAh, but this is Larry we are talking about, and even he is incapable of being so stupid. (Changed from [This might be Larry we are talking about, but even he is incapable of being so stupid.] in the original release) Which means there has to be a reason for his inaction! (Changed from [There has to be a reason for his inaction!] in the original release)Butz:\n... Edgey... I think it's about time I got serious with you, dude.Edgeworth:\n...Just as I thought, you've been playing with us all this time.Butz:\nListen... I'm... I'm going to tell you everything! Are you sure you want to hear it all!?Edgeworth:\nY-Yes...Butz:\nI may reeeeally say it this time! Everything! Kahaah!von Karma:\n...Then say it!Judge:\nVery well... I have a terribly bad feeling aboot this; however... ...let's have the witness finally give us the whole truth. Now... for this 15 minute gap, what where you doing, witness!?Witness Testimony-- The Missing 15 Minutes --Butz:\nI'm a Deauxnim. I'm an artist! What do you think I was doing?\nSketching! In front of the bridge! I was whipped up into a frenzy of art!\nThe shock and awe that I was feeling... I transferred it all directly onto the page!\n...Before I realized it, the flames had gone out and then he came running up.Judge:\nHmmmmm... I suppose artists can be strange folk...Butz:\nThat's right! I'm willing to sacrifice everything in order to draw the perfect sketch!Edgeworth:\n(...Including the truth, from the sound of it!)Judge:\nMr. Edgeworth. Has this removed the last of your doubts?Edgeworth:\nNot at all, Your Honor. One very large doubt still remains.Judge:\nAnd what would that be?Edgeworth:\nThis is a surprisingly believable story, especially considering the source... So why did he think he needed to hide it from us until now? I intend to drag the reason out of him!Butz:\nHah ha ha! You'll regret this, Edgey!Cross Examination",
      "testimonies": [
        {
          "testimony": "I'm a Deauxnim. I'm an artist! What do you think I was doing?",
          "person": "Butz",
          "present": []
        },
        {
          "testimony": "Sketching! In front of the bridge! I was whipped up into a frenzy of art!",
          "person": "Butz",
          "present": []
        },
        {
          "testimony": "I saw Iris flying! Her white hood fluttering!",
          "person": "Butz",
          "present": [
            "Iris's Hood"
          ],
          "source": {
            "evidence_span": "Received before the lights out bell the night of the crime.",
            "testimony_span": "Her white hood fluttering!",
            "explanation": "Iris could not have been wearing her hood because she had given it to Wright as a gift.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "The shock and awe that I was feeling... I transferred it all directly onto the page!",
          "person": "Butz",
          "present": []
        },
        {
          "testimony": "...Before I realized it, the flames had gone out and then he came running up.",
          "person": "Butz",
          "present": []
        }
      ],
      "noPresent": false
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Missing 15 Minutes --Butz:\nI'm a Deauxnim. I'm an artist! What do you think I was doing?Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nTell us, Larry...\nButz:\nMy name is Laurice! Get it right! Mistakes like that are what keep you from being popular with the ladies like I am!\nJudge:\n... Just who exactly are you!?\nButz:\nI'm Laurice Deauxnim! Apprentice extraordinaire!\nEdgeworth:\nThat's what he calls himself, in any case.\nJudge:\n...Then you are... an artist?\nButz:\nOf course! I'm an artist, the real thing!\nEdgeworth:\nYet again, that's what he calls himself.\nvon Karma:\n...Names mean nothing. There is only one issue I care to discuss. What were you doing?\nEdgeworth:\n(That is a very big issue, indeed.)Butz:\nSketching! In front of the bridge! I was whipped up into a frenzy of art!Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nS-Sketching!? The burning bridge?\nButz:\nThe burning bridge and everything that came with it!\nEdgeworth:\n... What? \"Came with it\"...?\nButz:\nYou want to hear this from my lips, do you, Edgey!? Y-You'll regret this! That sketch of mine is... Gaaah!\nvon Karma:\n...Enough. Just take that ridiculous sketch of yours out already, witness!\nButz:\n... W-W-W-What are you talking about? I don't know what you mean!\nJudge:\nThat does indeed appear to be the fastest solution. ...I'll leave it to you, Mr. Edgeworth.\nEdgeworth:\n(What should I do...? I've got a terrible feeling that the instant this sketch is revealed... ...the entire world may be changed by what is depicted there...!)\n\n\n\nLeave it alone\n\n\n\n\n\n\n\nEdgeworth:\n...I cannot recommend looking at the sketch. His \"works of art\" are a force of nature best measured on the Richter scale.\nButz:\nThat's right! They'll shake your heart to pieces!\nJudge:\nHmmmm... This courtroom has yet to meet earthquake standards! I think we'd better pass! ...In which case, let us turn to other leads.\nLeads back to cross-examination\n\n\n\n\nLook at the sketch\n\n\n\n\n\n\n\nEdgeworth:\n...Larry. I wonder if you could show us your sketch. Please?\nButz:\n... Well, well... Even I couldn't have imagined it'd turn out like this.\nEdgeworth:\n...Imagined what?\nButz:\nThat Laurice Deauxnim's debut would take place here, today, like this! Ou-Ou-Ou-Ou-Ouch!\nvon Karma:\nShow it! Now!\nButz:\nOK... But steel yourselves! This... is the world of Laurice Deauxnim!\nJudge:\n... Ah. Um... Well... So this... this is Dusky Bridge, correct? Q-Quite a large bridge, isn't it? Your response, Ms. von Karma?\nvon Karma:\nY-Yes, well... I-It's a better drawing than I expected.\nButz:\nIsn't it? Isn't it? I struggled to reproduce those flames. I really did!\nJudge:\n...Yes, I'm sure you did. ...\nvon Karma:\n......\nButz:\n......\nEdgeworth:\n(Nngh... This is going to get ugly... No one has the bravery to bring it up, it seems... This... mysterious flying object...) ...Larry.\nButz:\nWhat?\nEdgeworth:\nThe burning bridge is fine. But... What is that unfortunate looking figure...?\nButz:\nAh. You spotted that? I thought you might.\nEdgeworth:\nHowever much I might want to ignore it... I can't.\nButz:\nIt's Iris, of course! Iris! I wish she'd take better care of herself. We have to plan for our future, you know! What would've happened to her if she had injured herself flying like that...?\nEdgeworth:\n... Larry, please. Answer this next question honestly.\nButz:\nOK.\nEdgeworth:\nAre you REALLY claiming to have seen this? Are you claiming to have seen the silhouette of the defendant... ...flying over a bridge that was engulfed in flames...?\nButz:\nYep. That's what I saw. That's why I drew it! I'm an artist! A real artist!\nEdgeworth:\nAre...!\nvon Karma:\nYou...!\nJudge:\nHigh! The girl... She's really high up in this picture!\n\n\nJudge:\nUwaaah! What was that for!?\nvon Karma:\n...This is all a bad dream. I was hitting you on the cheek to test that theory!\nJudge:\nPlease whip your own cheek from now on if you wish to test your wild theories! A-Anyway! No court of law will ever acknowledge... ...that p-p-people can f-f-fly!\nvon Karma:\n...Actually, there is some precedent for this.\nButz:\nShe was flying pretty high, my sweet Iris. She was about 30 feet above the bridge, at least! It was really something to see!\nJudge:\nTh-This has to be some kind of m-m-mistake! ...Mr. Edgeworth, please bring the witness back down to earth!\nEdgeworth:\nWhat? Me...!?\nJudge:\nThis witness is your friend, is he not?\nvon Karma:\n\"Accessory to foolishness...\" ...Miles Edgeworth.\nJudge:\nLet us get back to the cross-examination! By force, if necessary! Mr. Edgeworth, I expect you to expose the obvious contradiction here!\nEdgeworth:\nY-Yes, Your Honor... (Looks like I've got another reason to remember this moron...)\nButz:\n...Well, what did you think of my debut piece?\nJudge:\nGet that thing away from me!\nLarry's Sketch added to the Court Record.\nJudge:\nNow, hurry up and cross-examine him!\nAdds statement \"I saw Iris flying! Her white hood fluttering!\"Press (after adding statement)\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\n...Could the reason you were so excited be...?\nButz:\nWhat do you think!? My girlfriend was flying through the sky! Almost 30 feet above the bridge! I felt like I might start flying myself.\nEdgeworth:\n(If only you'd be so kind as to fly out of all of our lives...!)\nButz:\nAnyway! I completely lost myself when I was drawing this scene!Butz:\nI saw Iris flying! Her white hood fluttering!Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nJust where did you see this sight from!?\nButz:\nHey! No need to shout... When I was lying in bed in that run-down shack... The crack of the lightning bolt made me realize that the bridge was burning. I just watched it for a while from there, thinking how nicely it was burning! Then after about five minutes, I saw it.\nvon Karma:\nThe defendant \"flying\"...?\nButz:\nThat's right! That's when I decided to go to the bridge!\nJudge:\n...I see. That all makes sense. Aside from the sketch itself...\nEdgeworth:\n(Yes... This sketch doesn't make any sense... I just need to convince the artist that his work is ludicrous.)Present Iris's Hood\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Larry. What did you really see that night...?\"Butz:\nThe shock and awe that I was feeling... I transferred it all directly onto the page!Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThe burning bridge moved you that much, did it? ...I find that hard to believe.\nButz:\nYou moron, Edgey! You don't understand me at all! If I see an abandoned cat, I find myself passing by it with tears in my eyes! I am a man overflowing with irresponsible kindness! And I use my irresponsible kindness to fill the pages of my notebook!\nvon Karma:\nAn artist, using a notebook... It's so pathetic, it makes me want to cry myself. I command you to go buy at least a proper sketch pad!\nButz:\nW-W-What has that got to do with anything!?\nJudge:\nI'm not sure if I care for an artist using a notebook for sketching. Proceed, witness.Press (after adding statement)\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou transfered everything \"directly onto the page\"...? And that is this sketch here?\nButz:\nYep! Sensational, isn't it? Or should that be scandalous? ...It put my mind at ease, anyway.\nvon Karma:\nIt did?\nButz:\nThat's right! The reason she didn't come to me, even though I waited for her... ...Was because she was trapped on the other side of the bridge!\nJudge:\n...\nButz:\nCould it be that Iris... ...undertook that dangerous, despereate flight in order to reach me...!? That's gotta be it! Alright! Go, me! Nice ooooooouch!\nvon Karma:\n...Continue. Please.Butz:\n...Before I realized it, the flames had gone out and then he came running up.Press\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou forgot the passage of time to that extent, did you?\nButz:\nWell... Once I get caught up in something, I tend to forget everything else...\nEdgeworth:\n(That's true... He's always  been that way. I guess he's not lying about that, at least.)\nvon Karma:\nPhoenix Wright appeared on the scene after 11:15... If he was drawing until then, that dispels all doubts.\nJudge:\nAside from doubts of his humanity, eh...Edgeworth:\n(There is a big clue waiting for me in this cross-examination... This testimony does nothing less than mock the court... But I am sure that there is a vital kernel of truth hidden in it somewhere!)Edgeworth:\nLarry. What did you really see that night...? Not that I particularly care.Butz:\nIn your position, that's just being irresponsible! I... I drew exactly what I saw! I'll give you a whole dollar that it's the truth!Edgeworth:\nIf that is truly the case... Then there is one thing that we can say for certain.Judge:\nWhat might that be...?Edgeworth:\nThat the person who flew over the bridge... ...could not have been the defendant, Iris!Butz:\nW-W-What!? What do you mean? I don't understand!? Uwaaagh!von Karma:\nA foolhardy folly of a foolish statement by an equally foolishly foolhardy fool. How, exactly, can you make this claim?Edgeworth:\n...Tell us, Larry. According to this picture... ...the individual whom you say you saw was wearing a hood. Correct?Butz:\nOf course she was! That run-down shack is quite a way from the bridge... The hood is what told me that this floating angel was my Iris! The hood is my darling Iris! And Iris is my darling hood! Waaah!von Karma:\nIt seems there are bigger fools in this world than the one at the defense's bench.Edgeworth:\n...Larry, there's something you need to be made aware of. On the night of the murder... Iris wasn't wearing her hood. She had given it to Wright as a gift! Are you going to change your story now? Perhaps suggest it was Wright who took flight!?Butz:\nW-What are you talking about!?Edgeworth:\n...I think you understand what I mean just fine.Butz:\nWhy...? Why did Nick have Iris's hood!?Edgeworth:\nWhat...? (Changed from [Eh...?] in the original release)Butz:\nEdgey! What's going on with Iris and Nick!? Why you, Niiiiiick! You dooooooog!Judge:\nI do believe... ...that this unbelievably mysterious sketch... ...is destined to disappear, discredited and discarded. Straight into the garbage.Butz:\n...Hah... Hah ha ha ha ha ha ha ha! Hah ha ha ha ha ha ha ha! Hagaaah!von Karma:\n...What is it now, witness?Butz:\nIt feels like... I've been waiting 25 years for this very day to come! Edgey! Today is the day I get to completely stupefy you!Edgeworth:\nW-What...!?Judge:\nWhat is the meaning of your outburst, witness!?Butz:\n...I hate to have to do this, but I have some definitive evidence.Edgeworth:\n\"Definitive\"...?von Karma:\n\"Evidence\"...?Butz:\nIris did indeed come flying over the burning bridge! And I, Laurice Deauxnim... ...shall prove it!Judge:\nI didn't expect to ask this again... But we shall be needing your testimony once again. Tell us anything you know concerning the defendant as depicted in this sketch... And show us your evidence that this nightmare was actually a reality!Butz:\n...OK. I hope you're ready, Edgey! Because I'm going to feed you a whopping serving of pain!Edgeworth:\n(...You've been serving us a whopping serving of pain this whole time. Trust me.)Witness Testimony-- Proof That Iris Flew! --Butz:\nWhen I reached Dusky Bridge she was already gone...\nI was so worried! So I frantically searched all over for her!\nThat led to me finding a beautiful crystal sphere, half-buried in the snow!\nI'm sure that Iris was simply wearing a spare hood.\nAfter all, no one else could have lost a crystal sphere that night.Judge:\nA c-crystal sphere...!?Butz:\nThis one. Pretty, isn't it? But finders keepers!von Karma:\nThat sphere... Where did you find it?Butz:\nLet me see... Around here, somewhere? Looks about right.Edgeworth:\nAnd it was half-buried in the snow...?Butz:\nIt had pretty much stopped snowing by then... But there was still some falling as I walked to the bridge.Judge:\nHmmmm... The court accepts this crystal sphere!Butz:\n...That's mine, OK!? I want it back afterward!Judge:\nHmm... There's something on it... (Changed from [There's something on it, isn't there...] in the original release)von Karma:\n...?Judge:\nOh my... It's blood! (Changed from [Oh my... It's a blood stain!] in the original release)Edgeworth:\n(What!? Blood...!?) (Changed from [What!? A blood stain...!?] in the original release)Crystal Sphere added to the Court Record.Butz:\nYou ready, Edgey!? By tomorrow morning, you'll be calling me \"Master Larry\"! Yeah, I like the sound of that! No one's going to push me around anymore!Edgeworth:\n(...Didn't you want to be called \"Laurice Deauxnim\" only a few minutes ago!?)Cross Examination",
      "testimonies": [
        {
          "testimony": "When I reached Dusky Bridge she was already gone...",
          "person": "Butz",
          "present": []
        },
        {
          "testimony": "I was so worried! So I frantically searched all over for her!",
          "person": "Butz",
          "present": []
        },
        {
          "testimony": "That led to me finding a beautiful crystal sphere, half-buried in the snow!",
          "person": "Butz",
          "present": [
            "Victim's Staff",
            "Photo of Elise",
            "Elise Deauxnim"
          ],
          "source": {
            "evidence_span": [
              "There is no crystal sphere attached.",
              "The staff has a crystal sphere attached to it.",
              "N/A"
            ],
            "testimony_span": "finding a beautiful crystal sphere, half-buried in the snow",
            "explanation": "A crystal sphere is missing from the staff of the victim Elise Deauxnim.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "I'm sure that Iris was simply wearing a spare hood.",
          "person": "Butz",
          "present": [
            "Victim's Staff",
            "Photo of Elise",
            "Elise Deauxnim"
          ],
          "source": {
            "evidence_span": [
              "There is no crystal sphere attached.",
              "The staff has a crystal sphere attached to it.",
              "N/A"
            ],
            "testimony_span": "N/A",
            "explanation": "A crystal sphere is missing from the staff of the victim Elise Deauxnim.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        },
        {
          "testimony": "After all, no one else could have lost a crystal sphere that night.",
          "person": "Butz",
          "present": [
            "Victim's Staff",
            "Photo of Elise",
            "Elise Deauxnim"
          ],
          "source": {
            "evidence_span": [
              "There is no crystal sphere attached.",
              "The staff has a crystal sphere attached to it.",
              "N/A"
            ],
            "testimony_span": "no one else could have lost a crystal sphere that night",
            "explanation": "A crystal sphere is missing from the staff of the victim Elise Deauxnim.",
            "is_self_contained": "yes",
            "context_span": "none"
          }
        }
      ],
      "noPresent": false
    }
  ]
}