{
  "previousContext": "",
  "characters": [
    {
      "currentChapter": "Turnabout Trump",
      "name": "Kristoph Gavin",
      "age": "32",
      "gender": "Male",
      "description1": "Boss at Gavin Law Offices. A first-rate defense attorney, and my trusted mentor."
    },
    {
      "currentChapter": "Turnabout Trump",
      "name": "??? → Phoenix Wright",
      "age": "?? → 33",
      "gender": "Male",
      "description1": "My first client. Just standing in front of this guy makes me nervous...",
      "description2": "Pianist at the Borscht Bowl Club. Formerly an ace defense attorney of some renown."
    },
    {
      "currentChapter": "Turnabout Trump",
      "name": "Shadi Smith",
      "age": "??",
      "gender": "Male",
      "description1": "The victim in this case. A traveler, only recently back in-country."
    },
    {
      "currentChapter": "Turnabout Trump",
      "name": "Winston Payne",
      "age": "61",
      "gender": "Male",
      "description1": "The prosecuting attorney. For all his experience, he lacks a certain presence..."
    },
    {
      "currentChapter": "Turnabout Trump",
      "name": "Olga Orly",
      "age": "21",
      "gender": "Female",
      "description1": "The witness in this case. A Russian waitress at the Borscht Bowl Club.",
      "description2": "A professional swindler. Hired by the victim to destroy Phoenix Wright's reputation."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Trump",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "How long did I yearn for one of these? Just putting it on makes me feel... ready."
    },
    {
      "currentChapter": "Turnabout Trump",
      "name": "Smith's Autopsy Report",
      "type": "Reports",
      "obtained": "Received during the preliminary hearing.",
      "description1": "The time of death was around 2 AM, April 17. Death caused by a single blow to the forehead."
    },
    {
      "currentChapter": "Turnabout Trump",
      "name": "Crime Photo 1",
      "type": "Photographs",
      "obtained": "Received during the preliminary hearing.",
      "description1": "The sub-basement at the Borscht Bowl Club. [caption] A man is found dead, slumped in a chair and leaning back. He is wearing a hat which covers his eyes and forehead. The table is set for a game of poker. Cards and chipped scartter around the table. There are some cards lying on the floor too. A bottle of grape juice is on the table. The room is dimly lit, with light coming in from a small window. The walls are partially peeled."
    },
    {
      "currentChapter": "Turnabout Trump",
      "name": "Deadly Bottle",
      "type": "Weapons",
      "obtained": "Submitted as evidence by Prosecutor Payne.",
      "description1": "Grape juice bottle used as the murder weapon. Bears the defendant Mr. Wright's prints. [caption] The bottle is empty.",
      "description2": "Grape juice bottle used as the murder weapon. Mr. Wright's prints on it are upside-down."
    },
    {
      "currentChapter": "Turnabout Trump",
      "name": "Wright's Cell Phone",
      "type": "Other",
      "obtained": "Submitted as evidence during the trial.",
      "description1": "Used by the defendant to notify the police from the restaurant's first floor."
    },
    {
      "currentChapter": "Turnabout Trump",
      "name": "Olga's Photo",
      "type": "Photographs",
      "obtained": "Submitted as evidence by Olga Orly.",
      "description1": "The defendant & Mr. Smith at the Borscht Bowl Club. Click here for details."
    },
    {
      "currentChapter": "Turnabout Trump",
      "name": "Chip Photo",
      "type": "Photographs",
      "obtained": "Submitted as evidence by Prosecutor Payne.",
      "description1": "Defendant & victim's chips when crime took place. [caption] On the near side, there are 4 red, small chips and 1 gray, big chip. On the far side, there are 2 red, small chips and 9 gray, big chips. On the near side, the cards are 7 heart, 7 diamond, 7 club, Ace spade, and Ace diamond. On the far side, the cards are King heart, King diamond, King spade, Ace club, and Ace heart."
    },
    {
      "currentChapter": "Turnabout Trump",
      "name": "Crime Photo 2",
      "type": "Photographs",
      "obtained": "Submitted as evidence by Prosecutor Payne.",
      "description1": "Photo of forehead. Hat removed during investigation. Click here for details."
    },
    {
      "currentChapter": "Turnabout Trump",
      "name": "Wright's Hand * (Wright's hand and Victim's hand are in fact two different pieces of evidence, with Wright's hand being entirely optional. )",
      "type": "Evidence",
      "obtained": "Submitted as evidence during the trial.",
      "description1": "Defendant Wright's hand. Was left at the scene. A full house."
    },
    {
      "currentChapter": "Turnabout Trump",
      "name": "Victim's Hand",
      "type": "Evidence",
      "obtained": "Submitted as evidence during the trial.",
      "description1": "Victim Smith's hand. Was left at the scene. A full house."
    },
    {
      "currentChapter": "Turnabout Trump",
      "name": "Bloody Ace",
      "type": "Evidence",
      "obtained": "Received from a mysterious girl.",
      "description1": "Received from a mysterious girl. Could this be the missing \"fifth ace\"?"
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "Turnabout Trump\n\n\n\n\n\n\n\n\n\nTranscriptEpisode 1Turnabout TrumpShowdown time....You lose.Auuuuuuuugh!Eeeeeeeeeek!...I seem to be in a bit of trouble.Something like that....Dead. Someone hit him. Hard.Me? Please. The cops should be here any minute.I'm in your hands... Should it come to that.April 20, 9:37 AMDistrict CourtDefendant Lobby No. 3Examine evidence\n\n\n\n\n\n\n\n\n\nAttorney's Badge\n\n\n\n\n\n\n\n\n\nBack side\n\n\n\n\n\n\n\nApollo:\nThere's a number inscribed on the back of the badge. There are many numbers like it, but this one is mine. Proof that I'm an attorney. To tell the truth, I get a happy feeling inside just looking at it.Apollo:\n(Panicked... Palms sweaty... I can admit it. I'm nervous.)???:\nAh, good morning!Apollo:\nG-Good morning, sir!Kristoph:\nYou look tense, Justice. Wound up tight.Apollo:\nW-Wound up, sir? No! I'm loose! I'm fine!Kristoph:\nThat screeching noise... Is that your voice? I suppose it's to be expected... Your first trial, and it's a homicide. I guess \"Justice\" doesn't start small, eh?Apollo:\nI-I'm fine! I got up at 5 AM to do my \"Chords of Steel\" voice workout! I'm fine!Kristoph:\nAh, that explains it. I did detect a certain rasping quality to your screech.Apollo:\n...*cough* (I overdid it again...)Kristoph:\nAs you know, your client today is a good friend of mine. I wouldn't want to let him down... if you get my drift.Apollo:\nDrift gotten, sir! I-I'm all over that drift!Kristoph:\nAs it happens, I dined with him the night of the murder. We can't let this case fall through.Apollo:\nYes. Yes! I'm fine, sir!Kristoph:\nOne more thing. Don't say you're fine quite so much. People might take you the wrong way.Apollo:\n*gulp*Kristoph:\nI'll be preparing our case. You might want to introduce yourself to the client.Apollo:\nMy name is Apollo Justice. If it isn't clear already, I'm a new attorney. And today is my first trial. N-Not that I'm worried or anything! The defendant has been accused of... murder. My boss wants to help him out, of course... and so do I! I mean, there's no way he did it. Not him! No way!???:\n...Apollo:\nWhoa!???:\n...Apollo:\nGood uh, morning!???:\n... Morning. It's all up to you today.Apollo:\n(First trial: nervous. Meeting him: cardiac arrest.)???:\n...Apollo:\n... (I think I'm supposed to say something... Uh... help?)???:\nSo, you're...Apollo:\nFine! I-I'm fine!???:\nAh... Mr. Fine, is it?Apollo:\nUh.???:\nI did remember you having an odd name.Apollo:\n(Well, we're off to a great start.) Um... Are you sure you're OK, I mean, with me????:\n...Apollo:\nMr. Gavin is a top-notch defense attorney. And he's your friend! So why...???:\n... You'll see.Apollo:\nUh????:\nYou can do it. Be confident.Apollo:\nUm, I... I'm really sorry this happened to you. I mean... I mean, I...???:\nIt's time. Shall we?Apollo:\nY-Yes, sir! (...OK. I need to focus. First trial, here comes Justice!)April 20, 10:00 AMDistrict CourtCourtroom No. 2Judge:\nThe court is now in session.Payne:\nThe prosecution is ready, Your Honor.Apollo:\nUh, the defense is, uh, fine! I mean ready, Your Honor! (Mind going blank... Don't panic... Ack, too late!)Judge:\nYour name was... Mr. Justice? And this is your first trial?Apollo:\nY-Yes, Your Honor! But I'm fine! Really!Judge:\nAre you quite sure? Your voice sounds a bit strained.Apollo:\n...*cough*Judge:\nAhem. Mr. Gavin?Kristoph:\n...Yes, Your Honor?Judge:\nI was under the impression that you would be heading up this case...?Kristoph:\nThat was my intention, yes. However... A defense attorney must always cede to his client's wishes. And my client specifically requested Mr. Justice.Judge:\nWell, of course he wants justice! But to entrust his case to this greenhorn... Why? I do not exaggerate when I say that you're the best defense attorney in town, Mr. Gavin.Apollo:\n(OK, so Gavin's got trial experience, fine. But does he have Chords of Steel!?)Judge:\nThen let's begin. The defendant may enter the courtroom.???:\n...Judge:\nThis is truly an unfortunate turn of events. I'm sorry we had to meet again under these circumstances. Long time no see, Mr. Wright.Phoenix:\nLet's put the past behind us, shall we? These days, I'm merely Phoenix Wright, piano player.Apollo:\n(Mr. Wright... How could this have happened?)Judge:\nI won't speak of it further then. If the prosecution would be so kind as to explain the charges. Mr. Payne?Payne:\nTo think, I saw you enter this room a fresh attorney, and now I'll see you leave in chains.Phoenix:\nAh, Winston Payne. Subtle as ever, I see.Payne:\nAhem. The crime occurred at the Borscht Bowl Club... a Russian restaurant. The defendant, Phoenix Wright, took the victim, a customer... ...and he hit him! Wham! On the head! Smack! Killed him cold!Judge:\nHmm... A customer at the restaurant, you say? And the defendant, you say he was...?Payne:\nThe pianist for the club, it seems.Judge:\nPhoenix Wright... A pianist?Payne:\nThis is the weapon that took the victim's life. A bottle of grape juice. Grape juice is apparently our defendant's drink of choice.Judge:\nThe court accepts the deadly bottle as evidence.Deadly Bottle added to the Court Record.Examine evidence\n\n\n\n\n\n\n\n\n\nDeadly Bottle\n\n\n\n\n\n\n\n\n\nLabel\n\n\n\n\n\n\n\nApollo:\nGrape juice... How long has it been since I drank grape juice? Apparently, it's Mr. Wright's favorite drink. I wonder how well it goes with borscht?\n\n\n\n\nBottom of bottle\n\n\n\n\n\n\n\nApollo:\nThe bottle is completely empty.Kristoph:\nSomething to note, Justice. All evidence is filed in the Court Record. Make a practice of checking it frequently.Apollo:\nThe Court Record... Right! I've heard of that!Kristoph:\nUse [R / RB / E] to look at the evidence so far. (Changed from [Use the Court Record Button to look at the evidence so far.] in the original release) I'm confident in your ability to handle this.Apollo:\n(Right, just use [R / RB / E]. Sounds like it's time for some hands-on action!) (Changed from [Right, the Court Record Button. Sounds like it's time for some hands-on action!] in the original release)Judge:\nSo, the victim was a customer at this restaurant. But just who was this, erm, \"Shadi Smith\" fellow?Payne:\nWe believe he was a traveler, Your Honor.Judge:\nA... traveler?Payne:\nAccording to his passport, he had been out of the country for a number of years. He had only returned to this country recently, though his place of residence is unclear.Judge:\nAnd he had some sort of connection with the defendant?Payne:\n...That, too, is unclear at present, Your Honor. We believe they first met at the Borscht Bowl Club on the night of the crime.Judge:\nIf they had only just met, then why murder? Perhaps the victim slighted the defendant's piano playing?Payne:\nThat doesn't appear to have been the case. No, the motive had nothing to do with the defendant's lack of playing skill. At least not piano playing. I'll let this photo explain what I mean. As we can see, a game of poker was in progress at the scene of the crime.Judge:\nWait a second! Isn't poker gambling? That's a crime in and of itself!Payne:\nIndeed. It appears our defendant... ...has fallen to become the basest sort of criminal!Kristoph:Kristoph:\nIt is true that the defendant was engaged in a game of poker with the victim. Yet it was only that: a game, in the purest sense. A competition, Your Honor.Payne:\nA... competition?Kristoph:\nYes, a test of wits, a silent clash of passions... Only the cards, their backs wreathed in blue flame, know its final outcome.Judge:\n... Er, come again?Payne:\nThe cards on the table had blue backs, Your Honor. I believe the defense was waxing poetic in an attempt to mystify those present... ...and impress women.Judge:\nThat will be our first order of business here then: To find out more about this fatal game of cards.Phoenix:\n...Judge:\nVery well, Defendant. You will testify to the court about the poker competition held the night of the crime.Phoenix:\n...My pleasure.Apollo:\n(This is it, my first trial! Here goes nothing!)Witness Testimony-- The Competition --Phoenix:\nI am a pianist by trade... yet I can hardly play at all.\nMy real job is to take on interested customers over at the poker table.\nThe room where we play and the competition in there are the club's main attractions.\nThe rules are simple: we play a game of poker using two decks of cards.\nThat's all it is... a game. And our customers are happy.Judge:\n...Hmm. A pianist who can't play piano?Payne:\nBetter than a defense attorney who can't defend.Judge:\n... Very well. The defense may begin the cross-examination.Apollo:\nR-Right, Your Honor! (My first cross-examination! Don't blow it!)Kristoph:\nAre you alright? You're sweating bullets.Apollo:\nBullets...!? Where!?Kristoph:\nIt's a figure of speech, Justice. Your voice sounds strained and raspy, too.Apollo:\nMy brain feels strained and raspy, sir.Kristoph:\nYou've watched me perform cross-examinations many times. Though you've never done one yourself, have you? Care for a refresher?Apollo:\n(What to do? Should I ask Mr. Gavin for a refresher course in cross-examination?)Refresher course, please!\n\n\n\n\n\n\n\nApollo:\n(Better safe than sorry, especially this early in the game!) Yes, teach me! I know nothing!\nKristoph:\nIndeed. Your job, Justice, is to be mindful of the Court Record and the testimony. Look for inconsistencies in the testimony with what the Court Record tells you. When you've found an inconsistency... That's when you present the conflicting evidence from the Court Record with [R / RB / E]! (Changed from [That's when you present the conflicting evidence from the Court Record!] in the original release)\nApollo:\nBut I didn't hear anything strange at all in the testimony just now...\nKristoph:\nA good sign that you need to press the witness with [L / LB / Q] for more information. (Changed from [A good sign that you need to press the witness for more information.] in the original release)\nApollo:\nPress... him?\nKristoph:\nDon't let the fact that he's a remarkable man hold you back. Get more information!\nApollo:\n(Uh... But isn't Mr. Wright my client?)\nKristoph:\nWell? Think you can do it?\nApollo:\nYes! Thank you, sir! I think I can do it!\nKristoph:\nI think you'd better, or we're going to have a problem. Just remember...\nLeads to:\n\"Find any inconsistencies, any lies in the testimony, and reveal them to the court.\"No thanks\n\n\n\n\n\n\n\nApollo:\nNo need for help here, sir! I think I've got this one covered!\nKristoph:\nI think you'd better do more than think. You know it, or you do not.\nApollo:\n(I'm fine! The Chords of Steel are ready for battle! My weapons: press and present...)\nLeads to:\n\"Find any inconsistencies, any lies in the testimony, and reveal them to the court.\"Kristoph:\nFind any inconsistencies, any lies in the testimony, and reveal them to the court. That is cross-examination. Learn it. Know it. Do it.Apollo:\n(\"Inconsistencies\"? \"Lies\"? Phoenix Wright...? As if! Phoenix Wright would never lie, and it's up to me to prove it.)Judge:\nThe defense may begin the cross-examination.Cross ExaminationCross Examination-- The Competition --Phoenix:\nI am a pianist by trade... yet I can hardly play at all.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou can hardly play...?\nPhoenix:\nOh, I play sometimes. When customers demand it. So I play them one song. That's usually all they want.\nApollo:\n(Was that supposed to be a boast just now...)\nPhoenix:\nThe title of \"pianist\" is a mask -- a respectable face I wear for the world at large.\nJudge:\nThen why are you really at the Borscht Bowl Club?Phoenix:\nMy real job is to take on interested customers over at the poker table.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThey pay you just to play poker?\nPhoenix:\nThat would seem to be the case. I am a professional, after all.\nPayne:\nBah! Do I detect pride in that statement? It's just hard for an honest, hard-working member of society like me to imagine...\nPhoenix:\nYes. Your imagination was always a bit limited, Winston.\nPayne:\nWh-What!?\nPhoenix:\nI've played poker for seven years in that little room. And I've never. Lost. Once.\nApollo:\nWha--?\nPhoenix:\nYou see why the customers come now? \"Defeat the undefeated poker champion\"... It's quite a draw. That is, I'm quite a draw.\nApollo:\nWait, you've never lost once? Not even one time!?\nPhoenix:\nAs I said, I'm a professional.\nApollo:\n(He's played poker for seven years and not lost once... Is that even possible!?)Press (after pressing third and fourth statements, before adding statement)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThey pay you just to play poker?\nPhoenix:\nThat would seem to be the case. I am a professional, after all.\nPayne:\nBah! Do I detect pride in that statement? It's just hard for an honest, hard-working member of society like me to imagine...\nPhoenix:\nYes. Your imagination was always a bit limited, Winston.\nPayne:\nWh-What!?\nPhoenix:\nI've played poker for seven years in that little room. And I've never. Lost. Once.\nApollo:\nWha--?\nPhoenix:\nYou see why the customers come now? \"Defeat the undefeated poker champion\"... It's quite a draw. That is, I'm quite a draw.\nApollo:\nWait, you've never lost once? Not even one time!?\nPhoenix:\nAs I said, I'm a professional.\nApollo:\n(He's played poker for seven years and not lost once... Is that even possible!?)\n\n\nJudge:\nThis competition you're talking about... I believe the court understands the nature of the game sufficiently.\nApollo:\nTh-That's right! It was a simple game, after all!\nJudge:\nAre you sure?\nApollo:\nHuh?\nJudge:\nPeople are not murdered over \"simple games\", Mr. Justice. Defendant. You were in the room the very moment that the crime occurred... Yet you claim no connection to the crime?\nPhoenix:\n... Now that's strange.\nJudge:\nWhat's strange?\nPhoenix:\nI was testifying about the competition that night. Asking me about the crime at this point is against the rules, Your Honor. Of course, I expected to hear a cry of \"Objection!\" from the defense...\nApollo:\nAck! (Argh! I completely let that one slip by!)\nKristoph:\nDon't despair yet, Justice.\nApollo:\nS-Sir?\nKristoph:\nWright. There's something I'd like made clear. Namely, your connection to the case at hand. And I'd like to hear it from you.\nPhoenix:\n... Sure, why not?\nJudge:\nVery well. The defendant will amend his testimony.\nApollo:\n(Just one little press... ...and I've got myself a whole new testimony!)\nAdds statement \"I plead silence regarding the murder. But I will say I never touched the murder weapon.\"Phoenix:\nThe room where we play and the competition in there are the club's main attractions.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThe room in the crime scene photo... is an attraction?\nPhoenix:\nIt has quite a history, actually. The Borscht Bowl Club used to be a gathering spot for black market types back in the day.\nApollo:\nB-Black market?\nPhoenix:\nAll in the past. Things like the black market are only on the silver screen nowadays. Suffice it to say that there were a lot of deals being made under the table. Right there in that room.\nJudge:\nA smoky room, gambling hoods. You know... Just looking at this picture makes me feel \"bad\"!\nPhoenix:\nThe bosses gather around the table, cutting deals, safe from the eyes of the law... Meanwhile, a goon keeps watch through the small window... I can practically picture it now.\nApollo:\n(That window does look like it would be good for keeping a look-out but little else.)\nPhoenix:\nThe room had a few other tricks to it... Though it was common knowledge to our regulars. At any rate, they come to play poker in a room steeped in history. Despite the dark past, it was all just good, clean fun.Press (after pressing second and fourth statements, before adding statement)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThe room in the crime scene photo... is an attraction?\nPhoenix:\nIt has quite a history, actually. The Borscht Bowl Club used to be a gathering spot for black market types back in the day.\nApollo:\nB-Black market?\nPhoenix:\nAll in the past. Things like the black market are only on the silver screen nowadays. Suffice it to say that there were a lot of deals being made under the table. Right there in that room.\nJudge:\nA smoky room, gambling hoods. You know... Just looking at this picture makes me feel \"bad\"!\nPhoenix:\nThe bosses gather around the table, cutting deals, safe from the eyes of the law... Meanwhile, a goon keeps watch through the small window... I can practically picture it now.\nApollo:\n(That window does look like it would be good for keeping a look-out but little else.)\nPhoenix:\nThe room had a few other tricks to it... Though it was common knowledge to our regulars. At any rate, they come to play poker in a room steeped in history. Despite the dark past, it was all just good, clean fun.\n\n\nJudge:\nThis competition you're talking about... I believe the court understands the nature of the game sufficiently.\nApollo:\nTh-That's right! It was a simple game, after all!\nJudge:\nAre you sure?\nApollo:\nHuh?\nJudge:\nPeople are not murdered over \"simple games\", Mr. Justice. Defendant. You were in the room the very moment that the crime occurred... Yet you claim no connection to the crime?\nPhoenix:\n... Now that's strange.\nJudge:\nWhat's strange?\nPhoenix:\nI was testifying about the competition that night. Asking me about the crime at this point is against the rules, Your Honor. Of course, I expected to hear a cry of \"Objection!\" from the defense...\nApollo:\nAck! (Argh! I completely let that one slip by!)\nKristoph:\nDon't despair yet, Justice.\nApollo:\nS-Sir?\nKristoph:\nWright. There's something I'd like made clear. Namely, your connection to the case at hand. And I'd like to hear it from you.\nPhoenix:\n... Sure, why not?\nJudge:\nVery well. The defendant will amend his testimony.\nApollo:\n(Just one little press... ...and I've got myself a whole new testimony!)\nAdds statement \"I plead silence regarding the murder. But I will say I never touched the murder weapon.\"Phoenix:\nThe rules are simple: we play a game of poker using two decks of cards.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nTwo decks of cards?\nPhoenix:\nA simple measure to prevent cheating. If you alternate two decks, no one can slip in cards.\nJudge:\nThere's something else I noticed... In addition to the cards on the table, there are some lying scattered on the floor.\nKristoph:\nPrecisely. Cards on the table, cards upon the floor... Each one forming a complete deck. A crime scene painted blue by a sad sweep of cards... It's poetic, really.\nPhoenix:\nIncidentally, we used two types of cards at the club. One deck of cards was red. The other blue.\nJudge:\nHmm... As I recall, in poker you make five-card \"hands\". I can see how it would be easy to cheat.\nPhoenix:\nHeh... Yes. A game of \"hands\".\nApollo:\n...?Press (after pressing second and third statements, before adding statement)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nTwo decks of cards?\nPhoenix:\nA simple measure to prevent cheating. If you alternate two decks, no one can slip in cards.\nJudge:\nThere's something else I noticed... In addition to the cards on the table, there are some lying scattered on the floor.\nKristoph:\nPrecisely. Cards on the table, cards upon the floor... Each one forming a complete deck. A crime scene painted blue by a sad sweep of cards... It's poetic, really.\nPhoenix:\nIncidentally, we used two types of cards at the club. One deck of cards was red. The other blue.\nJudge:\nHmm... As I recall, in poker you make five-card \"hands\". I can see how it would be easy to cheat.\nPhoenix:\nHeh... Yes. A game of \"hands\".\nApollo:\n...?\n\n\nJudge:\nThis competition you're talking about... I believe the court understands the nature of the game sufficiently.\nApollo:\nTh-That's right! It was a simple game, after all!\nJudge:\nAre you sure?\nApollo:\nHuh?\nJudge:\nPeople are not murdered over \"simple games\", Mr. Justice. Defendant. You were in the room the very moment that the crime occurred... Yet you claim no connection to the crime?\nPhoenix:\n... Now that's strange.\nJudge:\nWhat's strange?\nPhoenix:\nI was testifying about the competition that night. Asking me about the crime at this point is against the rules, Your Honor. Of course, I expected to hear a cry of \"Objection!\" from the defense...\nApollo:\nAck! (Argh! I completely let that one slip by!)\nKristoph:\nDon't despair yet, Justice.\nApollo:\nS-Sir?\nKristoph:\nWright. There's something I'd like made clear. Namely, your connection to the case at hand. And I'd like to hear it from you.\nPhoenix:\n... Sure, why not?\nJudge:\nVery well. The defendant will amend his testimony.\nApollo:\n(Just one little press... ...and I've got myself a whole new testimony!)\nAdds statement \"I plead silence regarding the murder. But I will say I never touched the murder weapon.\"Phoenix:\nThat's all it is... a game. And our customers are happy.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo, you claim you weren't gambling?\nPhoenix:\nThat's right. It was simply a game.\nApollo:\nYou didn't bet any money? Not even a little?\nPhoenix:\nThe only thing at stake in our game... was pride itself.\nJudge:\nHo ho! Well put, Mr. Wright. I've got a mind to play a hand of poker myself... The stakes: your fate!\nApollo:\n(Um... Can we get back to the trial now?)Phoenix:\nI plead silence regarding the murder. But I will say I never touched the murder weapon.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nS-Silence?\nPhoenix:\nThe defendant has the right to refuse to testify. ...I haven't forgotten everything about the law.\nApollo:\nBut why? That clearly puts you at a disadvantage...\nPhoenix:\nAnd it's your job to turn that around in our favor, yes?\nApollo:\n(Great. Like I didn't have enough to do already...)\nKristoph:\nJustice. Didn't you detect anything odd about that testimony?\nApollo:\nHuh...? (Wait... Something he said did ring a little strangely. Just one thing... Now what was it!?)\nKristoph:\nWhen you figure it out, I'd suggest presenting evidence. Evidence that contradicts the testimony.\nApollo:\n(A contradiction in Mr. Wright's testimony? But why!? I'd better check the Court Record.)Present Deadly Bottle\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"So you say you didn't touch the murder weapon... this grape juice bottle?\"Apollo:\n(I can't imagine Mr. Wright lying in a testimony...)Kristoph:\nIsn't it a little early to be jumping to conclusions? This is your first cross-examination. Take it slow. If you need more information, don't forget to press.Apollo:\nR-Right! I got it! I'm fine! (Time to listen to that testimony again.)",
      "testimonies": [
        {
          "testimony": "I am a pianist by trade... yet I can hardly play at all.",
          "person": "Phoenix",
          "present": []
        },
        {
          "testimony": "My real job is to take on interested customers over at the poker table.",
          "person": "Phoenix",
          "present": []
        },
        {
          "testimony": "The room where we play and the competition in there are the club's main attractions.",
          "person": "Phoenix",
          "present": []
        },
        {
          "testimony": "The rules are simple: we play a game of poker using two decks of cards.",
          "person": "Phoenix",
          "present": []
        },
        {
          "testimony": "That's all it is... a game. And our customers are happy.",
          "person": "Phoenix",
          "present": []
        },
        {
          "testimony": "I plead silence regarding the murder. But I will say I never touched the murder weapon.",
          "person": "Phoenix",
          "present": [
            "Deadly Bottle"
          ],
          "source": {
            "evidence_span": "Grape juice bottle used as the murder weapon. Bears the defendant Mr. Wright's prints.",
            "testimony_span": "I never touched the murder weapon.",
            "explanation": "The witness' fingerprints on the bottle which is the murder weapon suggests that the witness had touched it.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        }
      ],
      "noPresent": false,
      "summarized_context": "The defendant Phoenix answers to his allegation of the murder in a casino bar.",
      "labels": [
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims he never touched the murder weapon.",
        "Fact 2: The evidence suggests the grape juice bottle was the murder weapon.",
        "Fact 3: The evidence also suggests there are witness' fingerprints on the bottle.",
        "Prop 1: If someone's fingerprints are left on an object, they must have touched that object.",
        "Prop 2: If a person touched object A, and if object A is in fact object B, then they touched object B."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Competition --Phoenix:\nI am a pianist by trade... yet I can hardly play at all.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou can hardly play...?\nPhoenix:\nOh, I play sometimes. When customers demand it. So I play them one song. That's usually all they want.\nApollo:\n(Was that supposed to be a boast just now...)\nPhoenix:\nThe title of \"pianist\" is a mask -- a respectable face I wear for the world at large.\nJudge:\nThen why are you really at the Borscht Bowl Club?Phoenix:\nMy real job is to take on interested customers over at the poker table.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThey pay you just to play poker?\nPhoenix:\nThat would seem to be the case. I am a professional, after all.\nPayne:\nBah! Do I detect pride in that statement? It's just hard for an honest, hard-working member of society like me to imagine...\nPhoenix:\nYes. Your imagination was always a bit limited, Winston.\nPayne:\nWh-What!?\nPhoenix:\nI've played poker for seven years in that little room. And I've never. Lost. Once.\nApollo:\nWha--?\nPhoenix:\nYou see why the customers come now? \"Defeat the undefeated poker champion\"... It's quite a draw. That is, I'm quite a draw.\nApollo:\nWait, you've never lost once? Not even one time!?\nPhoenix:\nAs I said, I'm a professional.\nApollo:\n(He's played poker for seven years and not lost once... Is that even possible!?)Press (after pressing third and fourth statements, before adding statement)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThey pay you just to play poker?\nPhoenix:\nThat would seem to be the case. I am a professional, after all.\nPayne:\nBah! Do I detect pride in that statement? It's just hard for an honest, hard-working member of society like me to imagine...\nPhoenix:\nYes. Your imagination was always a bit limited, Winston.\nPayne:\nWh-What!?\nPhoenix:\nI've played poker for seven years in that little room. And I've never. Lost. Once.\nApollo:\nWha--?\nPhoenix:\nYou see why the customers come now? \"Defeat the undefeated poker champion\"... It's quite a draw. That is, I'm quite a draw.\nApollo:\nWait, you've never lost once? Not even one time!?\nPhoenix:\nAs I said, I'm a professional.\nApollo:\n(He's played poker for seven years and not lost once... Is that even possible!?)\n\n\nJudge:\nThis competition you're talking about... I believe the court understands the nature of the game sufficiently.\nApollo:\nTh-That's right! It was a simple game, after all!\nJudge:\nAre you sure?\nApollo:\nHuh?\nJudge:\nPeople are not murdered over \"simple games\", Mr. Justice. Defendant. You were in the room the very moment that the crime occurred... Yet you claim no connection to the crime?\nPhoenix:\n... Now that's strange.\nJudge:\nWhat's strange?\nPhoenix:\nI was testifying about the competition that night. Asking me about the crime at this point is against the rules, Your Honor. Of course, I expected to hear a cry of \"Objection!\" from the defense...\nApollo:\nAck! (Argh! I completely let that one slip by!)\nKristoph:\nDon't despair yet, Justice.\nApollo:\nS-Sir?\nKristoph:\nWright. There's something I'd like made clear. Namely, your connection to the case at hand. And I'd like to hear it from you.\nPhoenix:\n... Sure, why not?\nJudge:\nVery well. The defendant will amend his testimony.\nApollo:\n(Just one little press... ...and I've got myself a whole new testimony!)\nAdds statement \"I plead silence regarding the murder. But I will say I never touched the murder weapon.\"Phoenix:\nThe room where we play and the competition in there are the club's main attractions.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThe room in the crime scene photo... is an attraction?\nPhoenix:\nIt has quite a history, actually. The Borscht Bowl Club used to be a gathering spot for black market types back in the day.\nApollo:\nB-Black market?\nPhoenix:\nAll in the past. Things like the black market are only on the silver screen nowadays. Suffice it to say that there were a lot of deals being made under the table. Right there in that room.\nJudge:\nA smoky room, gambling hoods. You know... Just looking at this picture makes me feel \"bad\"!\nPhoenix:\nThe bosses gather around the table, cutting deals, safe from the eyes of the law... Meanwhile, a goon keeps watch through the small window... I can practically picture it now.\nApollo:\n(That window does look like it would be good for keeping a look-out but little else.)\nPhoenix:\nThe room had a few other tricks to it... Though it was common knowledge to our regulars. At any rate, they come to play poker in a room steeped in history. Despite the dark past, it was all just good, clean fun.Press (after pressing second and fourth statements, before adding statement)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThe room in the crime scene photo... is an attraction?\nPhoenix:\nIt has quite a history, actually. The Borscht Bowl Club used to be a gathering spot for black market types back in the day.\nApollo:\nB-Black market?\nPhoenix:\nAll in the past. Things like the black market are only on the silver screen nowadays. Suffice it to say that there were a lot of deals being made under the table. Right there in that room.\nJudge:\nA smoky room, gambling hoods. You know... Just looking at this picture makes me feel \"bad\"!\nPhoenix:\nThe bosses gather around the table, cutting deals, safe from the eyes of the law... Meanwhile, a goon keeps watch through the small window... I can practically picture it now.\nApollo:\n(That window does look like it would be good for keeping a look-out but little else.)\nPhoenix:\nThe room had a few other tricks to it... Though it was common knowledge to our regulars. At any rate, they come to play poker in a room steeped in history. Despite the dark past, it was all just good, clean fun.\n\n\nJudge:\nThis competition you're talking about... I believe the court understands the nature of the game sufficiently.\nApollo:\nTh-That's right! It was a simple game, after all!\nJudge:\nAre you sure?\nApollo:\nHuh?\nJudge:\nPeople are not murdered over \"simple games\", Mr. Justice. Defendant. You were in the room the very moment that the crime occurred... Yet you claim no connection to the crime?\nPhoenix:\n... Now that's strange.\nJudge:\nWhat's strange?\nPhoenix:\nI was testifying about the competition that night. Asking me about the crime at this point is against the rules, Your Honor. Of course, I expected to hear a cry of \"Objection!\" from the defense...\nApollo:\nAck! (Argh! I completely let that one slip by!)\nKristoph:\nDon't despair yet, Justice.\nApollo:\nS-Sir?\nKristoph:\nWright. There's something I'd like made clear. Namely, your connection to the case at hand. And I'd like to hear it from you.\nPhoenix:\n... Sure, why not?\nJudge:\nVery well. The defendant will amend his testimony.\nApollo:\n(Just one little press... ...and I've got myself a whole new testimony!)\nAdds statement \"I plead silence regarding the murder. But I will say I never touched the murder weapon.\"Phoenix:\nThe rules are simple: we play a game of poker using two decks of cards.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nTwo decks of cards?\nPhoenix:\nA simple measure to prevent cheating. If you alternate two decks, no one can slip in cards.\nJudge:\nThere's something else I noticed... In addition to the cards on the table, there are some lying scattered on the floor.\nKristoph:\nPrecisely. Cards on the table, cards upon the floor... Each one forming a complete deck. A crime scene painted blue by a sad sweep of cards... It's poetic, really.\nPhoenix:\nIncidentally, we used two types of cards at the club. One deck of cards was red. The other blue.\nJudge:\nHmm... As I recall, in poker you make five-card \"hands\". I can see how it would be easy to cheat.\nPhoenix:\nHeh... Yes. A game of \"hands\".\nApollo:\n...?Press (after pressing second and third statements, before adding statement)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nTwo decks of cards?\nPhoenix:\nA simple measure to prevent cheating. If you alternate two decks, no one can slip in cards.\nJudge:\nThere's something else I noticed... In addition to the cards on the table, there are some lying scattered on the floor.\nKristoph:\nPrecisely. Cards on the table, cards upon the floor... Each one forming a complete deck. A crime scene painted blue by a sad sweep of cards... It's poetic, really.\nPhoenix:\nIncidentally, we used two types of cards at the club. One deck of cards was red. The other blue.\nJudge:\nHmm... As I recall, in poker you make five-card \"hands\". I can see how it would be easy to cheat.\nPhoenix:\nHeh... Yes. A game of \"hands\".\nApollo:\n...?\n\n\nJudge:\nThis competition you're talking about... I believe the court understands the nature of the game sufficiently.\nApollo:\nTh-That's right! It was a simple game, after all!\nJudge:\nAre you sure?\nApollo:\nHuh?\nJudge:\nPeople are not murdered over \"simple games\", Mr. Justice. Defendant. You were in the room the very moment that the crime occurred... Yet you claim no connection to the crime?\nPhoenix:\n... Now that's strange.\nJudge:\nWhat's strange?\nPhoenix:\nI was testifying about the competition that night. Asking me about the crime at this point is against the rules, Your Honor. Of course, I expected to hear a cry of \"Objection!\" from the defense...\nApollo:\nAck! (Argh! I completely let that one slip by!)\nKristoph:\nDon't despair yet, Justice.\nApollo:\nS-Sir?\nKristoph:\nWright. There's something I'd like made clear. Namely, your connection to the case at hand. And I'd like to hear it from you.\nPhoenix:\n... Sure, why not?\nJudge:\nVery well. The defendant will amend his testimony.\nApollo:\n(Just one little press... ...and I've got myself a whole new testimony!)\nAdds statement \"I plead silence regarding the murder. But I will say I never touched the murder weapon.\"Phoenix:\nThat's all it is... a game. And our customers are happy.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo, you claim you weren't gambling?\nPhoenix:\nThat's right. It was simply a game.\nApollo:\nYou didn't bet any money? Not even a little?\nPhoenix:\nThe only thing at stake in our game... was pride itself.\nJudge:\nHo ho! Well put, Mr. Wright. I've got a mind to play a hand of poker myself... The stakes: your fate!\nApollo:\n(Um... Can we get back to the trial now?)Phoenix:\nI plead silence regarding the murder. But I will say I never touched the murder weapon.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nS-Silence?\nPhoenix:\nThe defendant has the right to refuse to testify. ...I haven't forgotten everything about the law.\nApollo:\nBut why? That clearly puts you at a disadvantage...\nPhoenix:\nAnd it's your job to turn that around in our favor, yes?\nApollo:\n(Great. Like I didn't have enough to do already...)\nKristoph:\nJustice. Didn't you detect anything odd about that testimony?\nApollo:\nHuh...? (Wait... Something he said did ring a little strangely. Just one thing... Now what was it!?)\nKristoph:\nWhen you figure it out, I'd suggest presenting evidence. Evidence that contradicts the testimony.\nApollo:\n(A contradiction in Mr. Wright's testimony? But why!? I'd better check the Court Record.)Present Deadly Bottle\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"So you say you didn't touch the murder weapon... this grape juice bottle?\"Apollo:\n(I can't imagine Mr. Wright lying in a testimony...)Kristoph:\nIsn't it a little early to be jumping to conclusions? This is your first cross-examination. Take it slow. If you need more information, don't forget to press.Apollo:\nR-Right! I got it! I'm fine! (Time to listen to that testimony again.)Apollo:\nSo you say you didn't touch the murder weapon... this grape juice bottle? ...Right?Phoenix:\nSo I said.Apollo:\n...Judge:\nSomething the matter, Mr. Justice?Payne:\nHee hee hee... Too bad our new defense attorney never learned how to play dumb!Judge: \nWhat's this, Mr. Payne?Payne:\nI examined the bottle in question, you see. And it was covered with the defendant's fingerprints!Apollo:\nObjection!Judge:\nNo need to shout, Mr. Justice! I can hear you just fine!Apollo:\nAha ha ha...Kristoph:\nExcess yelling can damage the judge's ears... and our case.Apollo:\n(B-But what about my Chords of Steel...?) Any... Anyway! What's so strange about fingerprints on a bottle in a restaurant?Judge:\nWell, that's true. The prints alone don't prove he did it--Payne:Payne:\nOh, they wouldn't prove a thing... if they were normal fingerprints!Apollo:\n...Huh!?Payne:\nBut the fingerprints on the murder weapon were upside-down!Judge:\n\"Upside-down\"? What does that mean?Payne:\nIt means he was holding the bottle inverted! And there can be only one reason for that! ...Yes. To brain someone with the bottle!Apollo:\nAuuuuuuuuuuuuuugh! M-Mr. Gavin! I think things just took a turn for the worse!Kristoph:\n...Oh? I see no problem, Justice.Apollo:\nHuh?Kristoph:\nThe only thing that matters is the truth. There's a good reason for everything. You'll see.Judge:\nDefendant! Can you explain your fingerprints on this bottle to the court!?Phoenix:\n... I stand by my plea of silence regarding the murder. ...For now.Judge:\nHmm... Not very cooperative, are you? This could hurt your case.Payne:\nI'm sure he's uncooperative because he's hiding something! There must be some reason...Kristoph:Kristoph:\n...Your Honor. You seem to have forgotten something.Judge:\nAnd what might that be, Mr. Gavin?Kristoph:\nOn the night of the crime, who was it who reported the murder to the police?Judge:\nReported...?Payne:\nWell, that was the defendant, Mr. Wright. But still, that...Judge:\nR-Really!?Payne:\nErm, yes, well. According to the case file... The murder was reported from near the scene, by a call from the defendant's cell phone.Apollo:\n\"Near\" the scene...?Payne:\nLet's take a look at a diagram of the murder scene, shall we? The victim was murdered in a small room in a basement two floors down from ground level. Of course, cell phones can't get reception so far down. The defendant used the stairs in this hallway to go above ground... The call came from the first floor of the restaurant.Judge:\nI see... And this is the phone that made the call?Wright's Cell Phone added to the Court Record.Examine evidence\n\n\n\n\n\n\n\n\n\nWright's Cell Phone\n\n\n\n\n\n\n\n\n\nTape on battery case\n\n\n\n\n\n\n\nApollo:\nWow. The batteries are held in with a piece of tape... He should just buy a new one. Maybe he can't afford it... or he just doesn't care.Kristoph:\nThe defendant could have just fled the scene of the crime if he so chose. Yet, he fulfilled his duty as a citizen and reported it to the authorities. And you claim he is being \"uncooperative\"...?Payne:\nUrk.Apollo:\n(Nice save, Mr. Gavin! I'd better not waste this!)Kristoph:\n...I think the prosecution has toyed with our client enough for the time being.Payne:\nT-Toyed? I assure you, no one is more serious about...Kristoph:\nWhat was it you said? The defendant was \"in the room the very moment that the crime occurred\". How can you possibly know this?Judge:\nThat's a good question! How indeed!Kristoph:\nThe answer is simple, Your Honor. The prosecution has a decisive witness.Payne:\nHee hee hee. You're as good as they say you are.Apollo:\n(So someone else was in the room the night of the crime! That must mean they witnessed the crime...)Kristoph:\nEverything up till now has been a warm-up, Justice. Are you ready?Judge:\nVery well. The prosecution may call its first witness to the stand!Payne:\nThe witness will state her name and profession.Judge:\nH-Hold on just a moment! Where's the witness?Payne:\nI surmise that she has been frightened by the defense's demonic-looking horns.Apollo:\n(So I used a little hair gel! Relax, people!)Judge:\nHave no fear! If any horns point in your direction this court will cut them off.???:\n... You... are sure?Judge:\nI swear it on my gavel! Please, come out.Apollo:\nIsn't violence against hair a crime, Your Honor????:\nWell, if you are sure it is OK...Judge:\nAhem. Now, the prosecution... W-W-Wait a minute! Would the prosecution care to explain the witness's... erm... paraphernalia?Payne:\nEr... yes. She is a professional, Your Honor. Those are merely the tools of her trade.Judge:\nAnd that would be...?Olga:\nMy name... is Olga Orly. I am employed as waitress in Borscht Bowl Club restaurant.Judge:\nThen... why the camera?Olga:\nOf course, it is my pride to serve borscht that is naming restaurant. But I also perform -- how it is said? Other service.Judge:\nI take it one of these other services is taking the customers' pictures?Olga:\nDah, dah. Like, for example... this one.Judge:\nTh-That's... the defendant!?Payne:\nIndeed. On the night of the murder.Olga:\nMan in white hat... is one who has gone kaput.Judge:\nIndeed... That is the victim. Order! Order! This is quite a piece of evidence to casually drop into our laps!Olga:\nIt is same way as I drop cold bowls of borscht on laps of customers... casually.Judge:\nHmm... Then the court will casually accept this new evidence.Olga's Photo added to the Court Record.Payne:\nNow, witness. Where were you at the time of the murder?Olga:\nI was in room. The Hydeout, we call it.Apollo:\nExcuse me? The Hydeout?Olga:\nIt is room where famous gangster \"Badgai\" was arrested. Is room where murder took place.Apollo:\nWhaaaaat!?Olga:\nYour look of utter surprise... It is lovely. I will post by courtroom door later for you! Dah, dah, photos will be numbered, and you will write which ones you want copy of.Apollo:\n(So there were three people in the room at the time of the crime... The victim, Shadi Smith, Mr. Wright, and... ...Olga Orly, our witness! ...And if Mr. Wright isn't the killer, that means...!)Judge:\nVery well. Witness! You will testify to the court about that night's events!Witness Testimony-- That Fateful Night --Olga:\nThat night, customer asked me to deal cards for game.\nIt was cold... Both players played with hats on, dah.\nThe victim, he plays whole time with his hand on locket at his neck.\nThen, last hand is done! But something terrible has happened, dah!\nThat man flew at victim, and is strangling him to death!Judge:\nHmm... Incidentally, who won the game?Payne:\nIsn't it obvious? The winner was the victim... Mr. Smith!Apollo:Apollo:\nThat's ridiculous! Um, because... Because Mr. Wright can't lose!Kristoph:\nAhem. Justice? Maybe you can come up with a more legitimate objection?Apollo:\nBut! He hadn't lost in seven years!Payne:\nTake it from me kid. It happens. I didn't lose a case my first seven years as prosecutor, either. Incidentally. I have some evidence here. These are the poker chips as they lay the very moment of the crime. The hand and chips on this side belong to the defendant, Mr. Wright. Those on the far side belonged to the victim, Mr. Smith.Judge:\nChips... you say?Payne:\nDah. I mean yes! Imagine that poker is war... Your hand is your army, and the chips are the spoils.Judge:\nI-I know that. After all, in my youth I was known as... ...the \"Poker Head of Courtroom No. 3\"!Apollo:\n(I think he means \"poker face\"...)Judge:\nHmm... Looking at this picture... ...it does seem that most of the chips are on the victim's side of the table.Chips Photo added to the Court Record. (Changed from [Chip Photo added to the Court Record.] in the original release)Judge:\nVery well. The defense may cross-examine the witness.Cross ExaminationCross Examination-- That Fateful Night --Olga:\nThat night, customer asked me to deal cards for game.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou were dealing cards... Do you do this often?\nOlga:\nDah, I am doing this. If customer wishes it, I serve anything. Borscht, cards, more borscht... It is my work.\nJudge:\nIt's good to hear of a place that hasn't forgotten the meaning of service!\nOlga:\nWelcome you to Borscht Bowl Club, where borscht is as warm as the waitresses!\nApollo:\nThank you for NOT handing out flyers during the cross-examination.Olga:\nIt was cold... Both players played with hats on, dah.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nIt's already April. How could it be cold?\nOlga:\nAt Borscht Bowl Club we have pride on authentic rustic Russian restaurant theme. Outside it is city in Spring, but inside it is always as cold as Mother Russia!\nApollo:\n(No way am I going there.)\nOlga:\nWhen it comes to hot borscht, cold is best seasoning, dah?Olga:\nThe victim, he plays whole time with his hand on locket at his neck.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHis \"locket\"...?\nOlga:\nI believe it was good-luck charm, dah? He gripped it many times as he played that night.\nJudge:\nYes, he must have felt as though it might carry him to the moon and the stars! Though if it were small enough to fit around his neck, it wouldn't have much lift...\nApollo:\nUm... The defense would like a clarification: this is a locket we're talking about? I mean, a pendant with a picture in it, right? Not a \"rocket\"?\nJudge:\nOf course! I knew that! It was probably a pendant shaped like a rocket. That's why she called it that.\nApollo:\nNo, a locket's a locket! It doesn't matter what shape it is.\nKristoph:\nIt's considered bad form to poke fun at the hard-of-hearing in our society.\nApollo:\n(Hard of hearing, or hard of understanding?)\nPayne:\nSo, what happened next?Present Crime Photo 2\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"You know, there was one curious part in her testimony just like Mr. Gavin said.\"Olga:\nThen, last hand is done! But something terrible has happened, dah!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSomething terrible!?!?\nOlga:\nEeeeeeeeeeeek!\nJudge:\nThe defense will refrain from needless shouting!\nApollo:\nEr, sorry. (I need to seriously reconsider this vocal training thing...)\nPayne:\nNow, Ms. Orly, can you tell us what happened?\nOlga:\nOh, I was so frightened! Dah, I trembled with fear!Olga:\nThat man flew at victim, and is strangling him to death!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nBut the defendant would never do such a thing!\nOlga:\nEeeeeeeek!\nJudge:\nWell now, I can't say I've ever heard the defense try this tactic.\nKristoph:\nIf possible... Please... Refrain from embarrassing me.\nJudge:\nStill... Why would anyone do something like this over a game of poker?\nOlga:\nPerhaps it is because defendant has lost game?\nPayne:\nYes! A crushing defeat for a man undefeated! So it always is with men like him. Winners make sore losers. Oh, how the mighty fall!Present Smith's Autopsy Report\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nOh really? \"Strangled\", you say? That's odd.\nOlga:\nDah, normal customers only choke on borscht.\nApollo:\nNo, I mean this report shows that the victim died of a blow to the head!\nOlga:\nAaack!\nApollo:\nMs. Orly! Really now... Did you witness the crime!?\nOlga:\nEeeeeeeeeeeeeeeeeeeek!\nJudge:\nHmm... Looking at the picture, it doesn't seem like he was hit. He's still wearing his hat and everything.\nPayne:\nYet, it is a fact that he was hit, Your Honor. Here's a photo we took of the victim with his hat off during our investigation.\nJudge:\nWell, that's quite shocking, isn't it? This head certainly was hit.\nCrime Photo 2 added to the Court Record.\nOlga:\nB-But...! I have seen it happen! The defendant, he lunge at victim, his neck...\nApollo:\n(Oh really, Ms. Orly? I think I've caught you in your own lie this time!)\nKristoph:\n...Justice. I admire your enthusiasm, but perhaps you should think this through once more.\nApollo:\nWh- What do you mean? I found a contradiction!\nKristoph:\nThere's one thing in her testimony that... troubles me.\nJudge:\nVery well. It seems we should continue the cross-examination.\nApollo:\n(There's such a thing as thinking too much... This horse is dead, let's stop beating it!)\nKristoph:\nThere's such a thing as thinking aloud too much, too.\nChanges statement from \"That man flew at victim, and is strangling him to death!\" to \"After defendant tried to strangle victim, he hit him with bottle.\"Olga:\nAfter defendant tried to strangle victim, he hit him with bottle.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou didn't say anything about hitting before!\nOlga:\nS-S-S-S-So sorry! I must be forgetting this, dah!\nJudge:\nWitness! You will take greater care with your testimony.\nOlga:\nOh dah, dah. I'm sorry, Your Honor.\nPayne:\nAnd that clears up the discrepancy with the autopsy report, I believe. The defendant made to strangle his victim, then changed his mind... ...and chose a simpler, blunter means to do the job. Yes, that sums it up nicely.\nApollo:\n(So he strangled him, then hit him...? Something's fishy about all this...)Kristoph:\nGo ahead. I believe you know what it is you need to do.Apollo:\nRight, sir! Leave it to me! (There were only three people in the room at the time of the murder. The victim, Shadi Smith, Mr. Wright, and... And if Mr. Wright isn't the killer... I've got you now, Orly!)",
      "testimonies": [
        {
          "testimony": "That night, customer asked me to deal cards for game.",
          "person": "Olga",
          "present": []
        },
        {
          "testimony": "It was cold... Both players played with hats on, dah.",
          "person": "Olga",
          "present": []
        },
        {
          "testimony": "The victim, he plays whole time with his hand on locket at his neck.",
          "person": "Olga",
          "present": []
        },
        {
          "testimony": "Then, last hand is done! But something terrible has happened, dah!",
          "person": "Olga",
          "present": []
        },
        {
          "testimony": "That man flew at victim, and is strangling him to death!",
          "person": "Olga",
          "present": [
            "Smith's Autopsy Report"
          ],
          "source": {
            "evidence_span": "Death caused by a single blow to the forehead.",
            "testimony_span": "is strangling him to death",
            "explanation": "If a person is strangled to death, they wouldn't have a single blow to the forehead.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "After defendant tried to strangle victim, he hit him with bottle.",
          "person": "Olga",
          "present": []
        }
      ],
      "noPresent": false,
      "summarized_context": "The witness Olga, a waitress of the club, describes the moment of the crime.",
      "labels": [
        "behavioral"
      ],
      "reasoning": [
        "Fact 1: The witness claims the witness was strangled to death.",
        "Fact 2: The evidence suggests the witness was killed by a single blow to the forehead.",
        "Prop 1: If a person is strangled to death, they wouldn't have been killed by a single blow to the forehead."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- That Fateful Night --Olga:\nThat night, customer asked me to deal cards for game.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou were dealing cards... Do you do this often?\nOlga:\nDah, I am doing this. If customer wishes it, I serve anything. Borscht, cards, more borscht... It is my work.\nJudge:\nIt's good to hear of a place that hasn't forgotten the meaning of service!\nOlga:\nWelcome you to Borscht Bowl Club, where borscht is as warm as the waitresses!\nApollo:\nThank you for NOT handing out flyers during the cross-examination.Olga:\nIt was cold... Both players played with hats on, dah.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nIt's already April. How could it be cold?\nOlga:\nAt Borscht Bowl Club we have pride on authentic rustic Russian restaurant theme. Outside it is city in Spring, but inside it is always as cold as Mother Russia!\nApollo:\n(No way am I going there.)\nOlga:\nWhen it comes to hot borscht, cold is best seasoning, dah?Olga:\nThe victim, he plays whole time with his hand on locket at his neck.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHis \"locket\"...?\nOlga:\nI believe it was good-luck charm, dah? He gripped it many times as he played that night.\nJudge:\nYes, he must have felt as though it might carry him to the moon and the stars! Though if it were small enough to fit around his neck, it wouldn't have much lift...\nApollo:\nUm... The defense would like a clarification: this is a locket we're talking about? I mean, a pendant with a picture in it, right? Not a \"rocket\"?\nJudge:\nOf course! I knew that! It was probably a pendant shaped like a rocket. That's why she called it that.\nApollo:\nNo, a locket's a locket! It doesn't matter what shape it is.\nKristoph:\nIt's considered bad form to poke fun at the hard-of-hearing in our society.\nApollo:\n(Hard of hearing, or hard of understanding?)\nPayne:\nSo, what happened next?Present Crime Photo 2\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"You know, there was one curious part in her testimony just like Mr. Gavin said.\"Olga:\nThen, last hand is done! But something terrible has happened, dah!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSomething terrible!?!?\nOlga:\nEeeeeeeeeeeek!\nJudge:\nThe defense will refrain from needless shouting!\nApollo:\nEr, sorry. (I need to seriously reconsider this vocal training thing...)\nPayne:\nNow, Ms. Orly, can you tell us what happened?\nOlga:\nOh, I was so frightened! Dah, I trembled with fear!Olga:\nThat man flew at victim, and is strangling him to death!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nBut the defendant would never do such a thing!\nOlga:\nEeeeeeeek!\nJudge:\nWell now, I can't say I've ever heard the defense try this tactic.\nKristoph:\nIf possible... Please... Refrain from embarrassing me.\nJudge:\nStill... Why would anyone do something like this over a game of poker?\nOlga:\nPerhaps it is because defendant has lost game?\nPayne:\nYes! A crushing defeat for a man undefeated! So it always is with men like him. Winners make sore losers. Oh, how the mighty fall!Present Smith's Autopsy Report\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nOh really? \"Strangled\", you say? That's odd.\nOlga:\nDah, normal customers only choke on borscht.\nApollo:\nNo, I mean this report shows that the victim died of a blow to the head!\nOlga:\nAaack!\nApollo:\nMs. Orly! Really now... Did you witness the crime!?\nOlga:\nEeeeeeeeeeeeeeeeeeeek!\nJudge:\nHmm... Looking at the picture, it doesn't seem like he was hit. He's still wearing his hat and everything.\nPayne:\nYet, it is a fact that he was hit, Your Honor. Here's a photo we took of the victim with his hat off during our investigation.\nJudge:\nWell, that's quite shocking, isn't it? This head certainly was hit.\nCrime Photo 2 added to the Court Record.\nOlga:\nB-But...! I have seen it happen! The defendant, he lunge at victim, his neck...\nApollo:\n(Oh really, Ms. Orly? I think I've caught you in your own lie this time!)\nKristoph:\n...Justice. I admire your enthusiasm, but perhaps you should think this through once more.\nApollo:\nWh- What do you mean? I found a contradiction!\nKristoph:\nThere's one thing in her testimony that... troubles me.\nJudge:\nVery well. It seems we should continue the cross-examination.\nApollo:\n(There's such a thing as thinking too much... This horse is dead, let's stop beating it!)\nKristoph:\nThere's such a thing as thinking aloud too much, too.\nChanges statement from \"That man flew at victim, and is strangling him to death!\" to \"After defendant tried to strangle victim, he hit him with bottle.\"Olga:\nAfter defendant tried to strangle victim, he hit him with bottle.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou didn't say anything about hitting before!\nOlga:\nS-S-S-S-So sorry! I must be forgetting this, dah!\nJudge:\nWitness! You will take greater care with your testimony.\nOlga:\nOh dah, dah. I'm sorry, Your Honor.\nPayne:\nAnd that clears up the discrepancy with the autopsy report, I believe. The defendant made to strangle his victim, then changed his mind... ...and chose a simpler, blunter means to do the job. Yes, that sums it up nicely.\nApollo:\n(So he strangled him, then hit him...? Something's fishy about all this...)Kristoph:\nGo ahead. I believe you know what it is you need to do.Apollo:\nRight, sir! Leave it to me! (There were only three people in the room at the time of the murder. The victim, Shadi Smith, Mr. Wright, and... And if Mr. Wright isn't the killer... I've got you now, Orly!)Apollo:\n(You know, there was one curious part in her testimony just like Mr. Gavin said. But what does it mean?)Judge:\nMr. Justice, would you care to explain what it is you're thinking so intensely about?Apollo:\nRecall the testimony, Your Honor... The victim played with \"his hand on locket at his neck\", I believe she said?Payne:\nI hope you aren't about to raise an objection to the witness's grammar!Apollo:\nNo, but look at this photograph. Do you see a locket on the victim's neck?Kristoph:\nWell done, Justice. I'm impressed. I knew you'd be able to handle this.Apollo:\nB-But what does it mean?Judge:\nIf we are to believe this witness's testimony as-is... Then the locket \"disappeared\" following the victim's death.Apollo:\nLockets don't just \"disappear\", Your Honor!Kristoph:\nIt's quite simple when you think about it. If the locket is gone, someone must have taken it off, no?Apollo:\nTaken it off... Wait, you don't mean...!Kristoph:\nThe defendant wasn't strangling the victim at all. He was taking off his locket! ...Wouldn't that explain it?Judge:\nAh...!Payne:\nUrk...?Judge:\nD-Defendant! What do you have to say to this?Phoenix:\n...Judge:\n... Say.Phoenix:\nYes?Judge:\nI just noticed this, but... You have something hanging around your neck, don't you.Phoenix:\nOh? You mean this? Yes, it's a locket... with a photograph inside. A photo... of my daughter.Apollo:\nC-Come again?Judge:\nMr. Wright! You have a daughter!?Payne:\nWe confirmed it at the time of the arrest. The picture in the locket is indeed Mr. Wright's daughter.Phoenix:\n...Apollo:\n(So Mr. Wright has a locket, too...? Why don't I buy that this is just a coincidence...?)Judge:\nWell now, if the results of this poker game led to the murder... Perhaps we should hear a bit more about the outcome of the game?Payne:\nFurther testimony won't really be necessary. It's clear the defendant lost. Badly.Olga:\n...Judge:\nMs. Orly! You will testify to the court about the game played between the victim and defendant!Olga:\nD-Dah...Witness Testimony-- Serious Competition --Olga:\nThe game began with 3,500 point in chips for each man.\nHouse chips come in two size: small and large.\nThe one who was winning... dah, it was victim!\nFor last hand, defendant play with all chips on table and lose.\nThe moment loss was decided, defendant grabs bottle from table and...Judge:\nIndeed... Looking at this picture... It does seem to be a one-sided game.Payne:\nAs the court knows, poker was the defendant's life! Failure must have been a bitter pill to swallow!Judge:\nAh, how many times have I heard these words: \"I done it in a fit of anger, Yer Honor, and now I regret what I done\". ...A common tale, but true.Apollo:\n(Methinks the judge watches too many old court movies. Mr. Wright said he hasn't lost in seven years, so this testimony must be wrong!)Cross ExaminationCross Examination-- Serious Competition --Olga:\nThe game began with 3,500 point in chips for each man.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nAre those the usual starting points? Were any special rules used...?\nOlga:\nNo, not special. Usual game, usual rules.\nJudge:\nIf each man began with 3,500 points, then the total would be... Um... Exactly six, no, 7,000 points!\nApollo:\n(Please, this isn't calculus. It's not even long division!)\nKristoph:\n...Present Chip Photo (after changing second statement)\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"You're sure it was the victim who won?\"Olga:\nHouse chips come in two size: small and large.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nAre the chips in this photo all the chips that were used?\nOlga:\nDa... Dah! Of course.\nApollo:\n...? (Something's fishy with these chips. Should I press harder?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nApollo:\nMaybe you could explain a bit about these \"chips\"?\nOlga:\nE-Explain? What is there to be explained?\nPayne:\n\nPayne:\nPoker chips are poker chips. They're not fish and chips, not a chip off the old block, not a motorcycle cop, not a...\nApollo:\n...Thanks. (Now that I've pressed her I'd better ask something...) What are these chips worth? Are they in dollars? Or rubles, even?\nOlga:\n...Nyet. As I have been saying before, it was game, not gambling. Hard perhaps for capitalist to understand. Two types of chip: 100 points chip and 1,000 points chip. It is not money, dah.\nKristoph:\n...Justice.\nApollo:\nSir!\nKristoph:\nDon't you find her comment... interesting?\nApollo:\nIn more ways than one, sir.\nKristoph:\nI'd have it added to her testimony, myself.\nJudge:\nWell? Does the defense want the witness to add to her testimony?\n\n\n\nAdd to testimony\n\n\n\n\n\n\n\nApollo:\nYes, I do think this deserves further scrutiny. Add it to the testimony! (I wish I knew where I was going with this...)\nJudge:\nVery well. Witness, if you would be so kind?\nOlga:\nD-Dah, Your Honor.\nChanges statement from \"House chips come in two size: small and large.\" to \"One kind of chip is worth 100 points, other kind is worth 1,000. Two kinds in all.\"\n\n\n\n\nNo need\n\n\n\n\n\n\n\nKristoph:\nVery well... It's your trial, after all.\nApollo:\n(Way to fill me with confidence...)\nJudge:\nVery well. The witness will resume her testimony!\nOlga:\nDah, Your Honor.\nLeads back to cross-examination\n\n\n\n\n\nNo need\n\n\n\n\n\n\n\nApollo:\n(...Nah. ...It's her nature to be jumpy and suspicious-looking.)\nLeads back to cross-examinationOlga:\nOne kind of chip is worth 100 points, other kind is worth 1,000. Two kinds in all.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\n(Mr. Gavin said this testimony is important! ...To be honest, I have no idea why.)\nJudge:\n...Mr. Justice? Do the court a favor and think of what you want to say before raising your hand. We are not in kindergarten.\nApollo:\nAck! Sorry! I'm fine! (I'd better think of something to ask... and quick!) Um... The two types of chips...\nOlga:\nDah...?\nApollo:\nUm. The small ones are 100, and the big ones 1,000... Uh? Right? Right. Of course.\nPayne:\nHah! Don't waste our time!\nApollo:\n*sigh* ...\nJudge:\nIs that all?\nApollo:\nUm... Yeah. *gulp* (Great. Mr. Gavin made me stop her, and now I'm the one who looks dumb.)\nKristoph:\nOh, Justice? Please try not to embarrass me like that.\nApollo:\nHuh? Who? Me!?\nKristoph:\nThere's a clear contradiction in the information you have in your hands.\nApollo:\n(What...!?)\nKristoph:\nIt's a simple matter of calculation. Go on, try it. We're not in kindergarten, after all.\nApollo:\n(\"Calculation\"...?)Present Chip Photo\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"You're sure it was the victim who won?\"Olga:\nThe one who was winning... dah, it was victim!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou're telling me that Mr. Wright, undefeated for seven whole years, was losing?\nOlga:\nDah. It must have been most unlucky day for him. I am glad I did not take other picture of him. It would break camera, certainly. The chips, they went always to victim's side of table.\nPayne:\nSo you're telling us it was a one-sided game?\nOlga:\nDah. One-sided, and...Present Chip Photo (after changing second statement)\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"You're sure it was the victim who won?\"Olga:\nFor last hand, defendant play with all chips on table and lose.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\n\"Last hand\"?\nOlga:\nIt was largest points of any hand. The defendant's hand, it was excellent. He try to use it to take victory from behind.\nJudge:\nIt appears that both the defendant and the victim's hands are in this picture. That is truly an excellent hand. However, so is the victim's...\nOlga:\nOne with highest number wins, so defendant loses.\nPayne:\nThe victim, Mr. Smith, had a stronger hand than the defendant and crushed him. I believe that explains what occurred next.\nOlga:\nOnce cards laid down on table, it happened...Olga:\nThe moment loss was decided, defendant grabs bottle from table and...Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nAnd...? What happened next!?\nOlga:\n...Even to think of it now, I shake and tremble, dah! I did not believe such thing would happen!\nApollo:\nWhat \"such thing\"!?\nOlga:\nPlease, you must believe! I had no idea... How could such thing occur!?\nApollo:\nWhat \"such thing\"!?\nOlga:\n...Ny-Nyet! ...Nyet, nyet, nyet! The defendant had been hitting v-victim!!! Dah, I saw it all happen, right before me... I saw bottle coming down on victim's head!\nPayne:\nDecisive, isn't it, Your Honor? My witness saw the very moment of the crime!\nJudge:\nHmm...Kristoph:\nRemember, your first goal is to gather information!Apollo:\nYes, sir! (Look out contradiction, here comes Justice!)",
      "testimonies": [
        {
          "testimony": "The game began with 3,500 point in chips for each man.",
          "person": "Olga",
          "present": [
            "Chip Photo"
          ],
          "source": {
            "evidence_span": "On the near side, there are 4 red, small chips and 1 gray, big chip. On the far side, there are 2 red, small chips and 9 gray, big chips.",
            "testimony_span": "The game began with 3,500 point in chips for each man.",
            "explanation": "There are 6 red chips and 10 gray chips in total. If the red chip is worth 100 points and the gray chip is worth 1,000 points, then the total points would be 6 * 100 + 10 * 1,000 = 10,600 points, which is not equal to 7,000 points in total. So, the red chip is worth 1,000 points and the gray chip is worth 100 points. The total points would be 6 * 1000 + 10 * 100 = 7,000 points, which is equal to 7,000 points in total. Therefore, the defendant's or the near side has 4 * 1,000 + 1 * 100 = 4,100 points and the victim's or the far side has 2 * 1,000 + 9 * 100 = 2,900 points. So, the defendant is actually winning.",
            "is_self_contained": "no",
            "context_span": "The hand and chips on this side belong to the defendant, Mr. Wright. Those on the far side belonged to the victim, Mr. Smith.",
            "isMultimodal": true
          }
        },
        {
          "testimony": "House chips come in two size: small and large.",
          "person": "Olga",
          "present": []
        },
        {
          "testimony": "One kind of chip is worth 100 points, other kind is worth 1,000. Two kinds in all.",
          "person": "Olga",
          "present": [
            "Chip Photo"
          ],
          "source": {
            "evidence_span": "On the near side, there are 4 red, small chips and 1 gray, big chip. On the far side, there are 2 red, small chips and 9 gray, big chips.",
            "testimony_span": "One kind of chip is worth 100 points, other kind is worth 1,000. Two kinds in all.",
            "explanation": "There are 6 red chips and 10 gray chips in total. If the red chip is worth 100 points and the gray chip is worth 1,000 points, then the total points would be 6 * 100 + 10 * 1,000 = 10,600 points, which is not equal to 7,000 points in total. So, the red chip is worth 1,000 points and the gray chip is worth 100 points. The total points would be 6 * 1000 + 10 * 100 = 7,000 points, which is equal to 7,000 points in total. Therefore, the defendant's or the near side has 4 * 1,000 + 1 * 100 = 4,100 points and the victim's or the far side has 2 * 1,000 + 9 * 100 = 2,900 points. So, the defendant is actually winning.",
            "is_self_contained": "no",
            "context_span": "The hand and chips on this side belong to the defendant, Mr. Wright. Those on the far side belonged to the victim, Mr. Smith.",
            "isMultimodal": true
          }
        },
        {
          "testimony": "The one who was winning... dah, it was victim!",
          "person": "Olga",
          "present": [
            "Chip Photo"
          ],
          "source": {
            "evidence_span": "On the near side, there are 4 red, small chips and 1 gray, big chip. On the far side, there are 2 red, small chips and 9 gray, big chips.",
            "testimony_span": "The one who was winning... dah, it was victim!",
            "explanation": "There are 6 red chips and 10 gray chips in total. If the red chip is worth 100 points and the gray chip is worth 1,000 points, then the total points would be 6 * 100 + 10 * 1,000 = 10,600 points, which is not equal to 7,000 points in total. So, the red chip is worth 1,000 points and the gray chip is worth 100 points. The total points would be 6 * 1000 + 10 * 100 = 7,000 points, which is equal to 7,000 points in total. Therefore, the defendant's or the near side has 4 * 1,000 + 1 * 100 = 4,100 points and the victim's or the far side has 2 * 1,000 + 9 * 100 = 2,900 points. So, the defendant is actually winning.",
            "is_self_contained": "no",
            "context_span": "The hand and chips on this side belong to the defendant, Mr. Wright. Those on the far side belonged to the victim, Mr. Smith.",
            "isMultimodal": true
          }
        },
        {
          "testimony": "For last hand, defendant play with all chips on table and lose.",
          "person": "Olga",
          "present": []
        },
        {
          "testimony": "The moment loss was decided, defendant grabs bottle from table and...",
          "person": "Olga",
          "present": []
        }
      ],
      "noPresent": false,
      "summarized_context": "The witness Olga, a waitress of the club, describes final poker game between the defendant and the victim.",
      "labels": [
        "numerical",
        "spatial"
      ],
      "reasoning": [
        "Fact 1: The witness claims there are only two types of chips: 100 points and 1,000 points.",
        "Fact 2: The evidence suggests that on the near side, there are 4 red, small chips and 1 gray, big chip.",
        "Fact 3: The evidence also suggests that on the far side, there are 2 red, small chips and 9 gray, big chips.",
        "Fact 4: The context suggests that the defendant is on the near side and the victim is on the far side.",
        "Prop 1: If one side has 4 red, small chips and 1 gray, big chip, and the other side has 2 red, small chips and 9 gray, big chips, there are 6 red chips and 10 gray chips in total.",
        "Prop 2: If the red chip is worth 100 points and the gray chip is worth 1,000 points, then the total points would be 6 * 100 + 10 * 1,000 = 10,600 points, which is not equal to 7,000 points in total.",
        "Prop 3: If it is not the case that the red chip is worth 100 points and the gray chip is worth 1,000 points, then the red chip must be worth 1,000 points and the gray chip must be worth 100 points.",
        "Prop 4: If the red chip is worth 1,000 points and the gray chip is worth 100 points, then the near side has 4 * 1,000 + 1 * 100 = 4,100 points which is more than the far side that has 2 * 1,000 + 9 * 100 = 2,900 points.",
        "Prop 5: If one side has more points than the other, then that side is winning.",
        "Prop 6: If the defendant is on the near side and the near side is winning, then the defendant is winning."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- Serious Competition --Olga:\nThe game began with 3,500 point in chips for each man.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nAre those the usual starting points? Were any special rules used...?\nOlga:\nNo, not special. Usual game, usual rules.\nJudge:\nIf each man began with 3,500 points, then the total would be... Um... Exactly six, no, 7,000 points!\nApollo:\n(Please, this isn't calculus. It's not even long division!)\nKristoph:\n...Present Chip Photo (after changing second statement)\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"You're sure it was the victim who won?\"Olga:\nHouse chips come in two size: small and large.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nAre the chips in this photo all the chips that were used?\nOlga:\nDa... Dah! Of course.\nApollo:\n...? (Something's fishy with these chips. Should I press harder?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nApollo:\nMaybe you could explain a bit about these \"chips\"?\nOlga:\nE-Explain? What is there to be explained?\nPayne:\n\nPayne:\nPoker chips are poker chips. They're not fish and chips, not a chip off the old block, not a motorcycle cop, not a...\nApollo:\n...Thanks. (Now that I've pressed her I'd better ask something...) What are these chips worth? Are they in dollars? Or rubles, even?\nOlga:\n...Nyet. As I have been saying before, it was game, not gambling. Hard perhaps for capitalist to understand. Two types of chip: 100 points chip and 1,000 points chip. It is not money, dah.\nKristoph:\n...Justice.\nApollo:\nSir!\nKristoph:\nDon't you find her comment... interesting?\nApollo:\nIn more ways than one, sir.\nKristoph:\nI'd have it added to her testimony, myself.\nJudge:\nWell? Does the defense want the witness to add to her testimony?\n\n\n\nAdd to testimony\n\n\n\n\n\n\n\nApollo:\nYes, I do think this deserves further scrutiny. Add it to the testimony! (I wish I knew where I was going with this...)\nJudge:\nVery well. Witness, if you would be so kind?\nOlga:\nD-Dah, Your Honor.\nChanges statement from \"House chips come in two size: small and large.\" to \"One kind of chip is worth 100 points, other kind is worth 1,000. Two kinds in all.\"\n\n\n\n\nNo need\n\n\n\n\n\n\n\nKristoph:\nVery well... It's your trial, after all.\nApollo:\n(Way to fill me with confidence...)\nJudge:\nVery well. The witness will resume her testimony!\nOlga:\nDah, Your Honor.\nLeads back to cross-examination\n\n\n\n\n\nNo need\n\n\n\n\n\n\n\nApollo:\n(...Nah. ...It's her nature to be jumpy and suspicious-looking.)\nLeads back to cross-examinationOlga:\nOne kind of chip is worth 100 points, other kind is worth 1,000. Two kinds in all.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\n(Mr. Gavin said this testimony is important! ...To be honest, I have no idea why.)\nJudge:\n...Mr. Justice? Do the court a favor and think of what you want to say before raising your hand. We are not in kindergarten.\nApollo:\nAck! Sorry! I'm fine! (I'd better think of something to ask... and quick!) Um... The two types of chips...\nOlga:\nDah...?\nApollo:\nUm. The small ones are 100, and the big ones 1,000... Uh? Right? Right. Of course.\nPayne:\nHah! Don't waste our time!\nApollo:\n*sigh* ...\nJudge:\nIs that all?\nApollo:\nUm... Yeah. *gulp* (Great. Mr. Gavin made me stop her, and now I'm the one who looks dumb.)\nKristoph:\nOh, Justice? Please try not to embarrass me like that.\nApollo:\nHuh? Who? Me!?\nKristoph:\nThere's a clear contradiction in the information you have in your hands.\nApollo:\n(What...!?)\nKristoph:\nIt's a simple matter of calculation. Go on, try it. We're not in kindergarten, after all.\nApollo:\n(\"Calculation\"...?)Present Chip Photo\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"You're sure it was the victim who won?\"Olga:\nThe one who was winning... dah, it was victim!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou're telling me that Mr. Wright, undefeated for seven whole years, was losing?\nOlga:\nDah. It must have been most unlucky day for him. I am glad I did not take other picture of him. It would break camera, certainly. The chips, they went always to victim's side of table.\nPayne:\nSo you're telling us it was a one-sided game?\nOlga:\nDah. One-sided, and...Present Chip Photo (after changing second statement)\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"You're sure it was the victim who won?\"Olga:\nFor last hand, defendant play with all chips on table and lose.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\n\"Last hand\"?\nOlga:\nIt was largest points of any hand. The defendant's hand, it was excellent. He try to use it to take victory from behind.\nJudge:\nIt appears that both the defendant and the victim's hands are in this picture. That is truly an excellent hand. However, so is the victim's...\nOlga:\nOne with highest number wins, so defendant loses.\nPayne:\nThe victim, Mr. Smith, had a stronger hand than the defendant and crushed him. I believe that explains what occurred next.\nOlga:\nOnce cards laid down on table, it happened...Olga:\nThe moment loss was decided, defendant grabs bottle from table and...Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nAnd...? What happened next!?\nOlga:\n...Even to think of it now, I shake and tremble, dah! I did not believe such thing would happen!\nApollo:\nWhat \"such thing\"!?\nOlga:\nPlease, you must believe! I had no idea... How could such thing occur!?\nApollo:\nWhat \"such thing\"!?\nOlga:\n...Ny-Nyet! ...Nyet, nyet, nyet! The defendant had been hitting v-victim!!! Dah, I saw it all happen, right before me... I saw bottle coming down on victim's head!\nPayne:\nDecisive, isn't it, Your Honor? My witness saw the very moment of the crime!\nJudge:\nHmm...Kristoph:\nRemember, your first goal is to gather information!Apollo:\nYes, sir! (Look out contradiction, here comes Justice!)Apollo:\nYou're sure it was the victim who won? Absolutely sure?Olga:\n...!Payne:Payne:\nIt seems our new attorney is a bit confused... A glance at the picture is enough to tell you who won! If you're not in kindergarten.Judge:\nUm... Just for safety's sake, could you explain the problem to the court?Apollo:\nOf course, Your Honor. In this photo I see small chips and I see large chips. Tell me.. which were worth 1,000 points?Payne:\nWhy, the big ones of course! Duh!Apollo:\nOh, I thought so too... but then the totals don't add up.Payne:\nTh-The totals...?Apollo:\nLet's review what the witness told us: Each man started with 3,500 points in chips. And the combined total value of the chips was 7,000 points.Judge:\nYes... if my calculations are correct! Let's see, three plus one, carry the five...Apollo:\nUm, they are, Your Honor. Now! Look at this photo that allegedly shows all the chips. If the big chips are worth 1,000 points, and the small chips are worth 100... And you add them up...Payne:\nHow much is it!?Apollo:\n(Do it yourself... You aren't in kindergarten, are you?) ...10,600 points. The chips don't add up! This clearly contradicts the witness's testimony!Payne:\nB-But why!? How could this be!?Kristoph:\nExactly... Justice. Now that you know the \"what\", you must determine the \"why\".Apollo:\n(Right... There's only one possible way to explain this contradiction!)Starting points were wrong\n\n\n\n\n\n\n\nApollo:\nThis calculation makes the answer clear! If the total combined points at the table was 10,600... Then each man started the night with 5,300 points!\nJudge:\nFive thousand three hundred... That's a rather half-baked score at which to start a game.\nKristoph:\nJustice... Would different starting points really change anything?\nApollo:\nEh?\nJudge:\nIt seems the defense's objection was even more half-baked than the score!\nApollo:\n(Uh oh... Time to head back into the kitchen!)\nLeads back to:\n\"Right... There's only one possible way to explain this contradiction!)\"Chip count was wrong\n\n\n\n\n\n\n\nApollo:\nThe odd thing here is the number of chips... Right, Mr. Gavin?\nKristoph:\n...Why are you asking me?\nApollo:\nUh... Just in case?\nKristoph:\nJustice... It's your case I'm concerned about. If you're wondering about the chips, just look at the photograph. It's all there. Even our judge with his failing eyesight could count them.\nApollo:\n(That's not the only thing failing the judge.)\nJudge:\n...Let me ask you again.\nLeads back to:\n\"Right... There's only one possible way to explain this contradiction!)\"Both were right\n\n\n\n\n\n\n\nLeads to:\n\"Each man began the game with 3,500 points.\"Apollo:\nEach man began the game with 3,500 points. If all the chips are indeed shown in this photograph... Then there can be only one answer.Judge: \nWell, what is it?Apollo:\nThe value of the chips... was the other way around!Payne:\nWh-What!?Apollo:\nWant to know what I think? The small chips were worth 1,000 points, not the big ones!Payne:\nMadness! Utter madness!Judge:\nShow me that photograph of the chips again! ...There are six small chips, and ten large chips... Why, that does make 7,000 points when you add them up!Kristoph:\nExcellent work, Justice. It's almost as though you figured it out by yourself.Apollo:\nWell... I'm just glad I was the one who said it.Payne:Payne:\nB-But wait! The value of the chips may be different, but that changes nothing!!!Judge:\nIndeed.. The victim did have the larger number of chips still. ... Ah!Apollo:\n...Exactly. If the small chips are 1,000 points, and the large chips are 100... Let's do a little math. Add up the points for each side of the table!Payne:\nAh... Auuuuuuuuuuuuugh!Judge:\nThe victim, Mr. Smith, had 2,900 points, and the defendant had... 4,100 points!Apollo:\nWell now... It seems that Mr. Wright was winning that night after all!Payne:\nThat's... impossible!Apollo:\nMy client had even less reason to kill the victim! After all... he was winning!Payne:\nYeeeaaaargh!Apollo:\nNow... Ms. Orly. You must have known the true value of the chips. Since you were there at the scene of the crime... weren't you?Olga:\nAh... Eeeeeeeeeek!Judge:\nOrder! Order!!! It appears our defendant has lost his \"motive\". And Mr. Wright's supposed defeat... never happened.Payne:\nNnn... nunngk!Judge:\nWe must now ask ourselves whether we can trust the witness's testimony at--???:Judge:\nE-Excuse me? What is it, Ms. Orly?Olga:\nI... I did not want to be saying this, but... Actually, you see, erm...Payne:\nSee what, Ms. Orly!? What do we see!?Olga:\nIn the last hand, there was cheat!Payne:\nA ch-cheat? You... You don't mean... ...a trick!?Judge:\nWait, or do you mean... ..a scam!?Apollo:\n(They're all the same thing!)Olga:\nYes, there was cheat in last hand... That is why game ends with chips as they are!Apollo:\n(Great... Just great... First we have lying... now cheating...)Kristoph:\nWell, this case certainly has taken a turn... ...for the interesting!Judge:\nWitness! You will please testify to the court! Tell us about this cheating in the final hand!Witness Testimony-- The Final Hand --Olga:\nThe last hand... both men had \"full house\".\nThere is four of each card in deck, from ace to king.\nIf you look at both men's hands, cheat is more obvious!\nThe next moment, game becomes argument, dah! The defendant's trick was exposed!\nHe took bottle in his hand... Poor Mr. Smith!Apollo:\nMs. Orly! Why did you not tell the court about this from the very beginning!?Olga:\n...Apollo:\n(I thought I smelled a cover-up here... Well folks, it's time to throw back the covers!)Judge:\nHmm... A full house is a very high-scoring hand. Not easy to make, in my experience.Payne:\nThat alone is enough to suspect less-than-scrupulous tactics.Apollo:\nUm... Mr. Gavin? What's a full house?Payne:\nLawyers these days... You don't know your poker?Judge:\nI can't say this bodes well for your case... or career.Apollo:\n(What is this, some kind of secret court poker ring!?)Kristoph:\n...Justice. You know the terms \"one pair\", \"two pair\", and \"three of a kind\", yes?Apollo:\nUh, yeah! No problem! Two cards with the same number makes a pair, and three makes a three of a kind!Kristoph:\nGood. Now picture a hand with one pair, and one three of a kind. That's a full house.Apollo:\n(Hmm... That doesn't sound very easy to make, does it.)Payne:\nYou can see each player's hand in this photo.Apollo:\n(Wow... They both have full houses!)Payne:\nWe forget, there's an easy way to make a full house... and go undefeated for seven years. You cheat.Judge:\nAhem. The defense may cross-examine the witness.Apollo:\n(If he did cheat in the last hand, that still leaves one important question... Mr. Wright lost that hand. Who's ever heard of a professional con man losing when they cheat!?)Cross ExaminationCross Examination-- The Final Hand --Olga:\nThe last hand... both men had \"full house\".Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nJust how hard is it to make a full house, anyway?\nOlga:\nIt is quite hard, dah. It is making a pair and a three of kind at same time!\nApollo:\n... I guess that's right.\nJudge:\nVery difficult, to be sure. You can take my word as the \"Poker Head of Courtroom No. 3\"!\nOlga:\nVery difficult, dah. But is not impossible.\nApollo:\n(OK. Full house: Hard. This line of questioning: A waste of time.)Olga:\nThere is four of each card in deck, from ace to king.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nFour of each card, you say?\nOlga:\nDah. There is one spade, one diamond, one heart, and one club for each card. It is interesting fact that this number \"four\" comes from number of seasons!\nApollo:\nHuh, you don't say.\nJudge:\nAh, and did you know that the cards are numbered 1-13? Add all the cards in a deck and you get 364... a year!\nApollo:\nHuh, you don't say. (Isn't that one day short?)\nPayne:\nThat's why each deck has two jokers. They say the second joker stands for the leap year. Thus you have a perfect representation of the year... all in a deck of cards!\nApollo:\nHuh, you don't say. (We're going to be in this courtroom for a year if it keeps going like this!)Olga:\nIf you look at both men's hands, cheat is more obvious!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHow was it \"clear\"?\nOlga:\nDah, well... the defendant... ...he played a fifth ace!\nApollo:\nA f-fifth ace!?\nOlga:\nI still remember both hands very well. Mr. Smith's hand has three aces... ...and Mr. Wright's two.\nPayne:\nObviously, cheating was afoot! Or perhaps I should say... a hand!\nKristoph:\nYour Honor... perhaps this can be added to the testimony? Without Mr. Payne's joke.\nJudge:\nVery well. The witness will add this detail to her testimony, please.\nChanges statement from \"If you look at both men's hands, cheat is more obvious!\" to \"Mr. Smith's hand has three aces, and Mr. Wright's two. ...It is five aces in all.\"Olga:\nMr. Smith's hand has three aces, and Mr. Wright's two. ...It is five aces in all.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nA fifth ace...?\nOlga:\nDah! It should not exist, no? I still remember both hands very well. Mr. Smith's hand has three aces... ...and Mr. Wright's two.\nJudge:\nWell, where did this card come from then?\nPayne:\n...Perhaps we should ask the defendant that very question! Adding cards to a deck is no less serious a taboo than... Than forging evidence in a court of law!\nApollo:\nNnnk...!\nKristoph:\nNow... Perhaps it's time for you to say something, Justice?\nApollo:\nYou bet! I've no intention of staying quiet! Not me! No sir! (...I'd better find some contradicting evidence fast!)Present Chip Photo\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"It appears the witness is mistaken...\"Olga:\nThe next moment, game becomes argument, dah! The defendant's trick was exposed!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nDo you recall what the men were arguing about?\nOlga:\nDah, I believe so... The victim, he shouts, \"you are cheater!\" and then... ...the defendant shouts something like, \"I have objection!\"\nPayne:\nShouting objection, eh? Old habits are hard to break! First he bluffed his way through the courtroom, now he bluffs his way through life!\nApollo:\n\nApollo:\nHowever! Mr. Wright lost the hand! That seems to cast the shadow of doubt on Mr. Smith!\nOlga:\nHumiliation from losing even when cheating... That is what set fire to defendant's heart!\nJudge:\nSo what did the flaming defendant do next?Olga:\nHe took bottle in his hand... Poor Mr. Smith!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nBy bottle, are you referring to... this?\nOlga:\n...Dah. The defendant uses this bottle to... to... *sob*\nPayne:\nThis behavior is an admission of cheating by the defendant.\nJudge:\nHmm... But why use a grape juice bottle?\nPayne:\nYou'd be surprised at what can be used as a weapon.\nOlga:\nThis juice is recommended drink of Borscht Bowl Club, dah. This year's vintage is remarkable for its hefty flavor.\nApollo:\n(Hefty enough to brain a grown man, apparently.)Apollo:\n(First she says it was a serious competition, now she says there was cheating...)Kristoph:\nJustice... Notice anything odd? Her testimony keeps changing. Now she says the defendant cheated.Apollo:\nActually, yes! I had noticed that!Kristoph:\nLet's get the truth about this \"cheating\" first, shall we?Apollo:\nRight! Leave it to me!",
      "testimonies": [
        {
          "testimony": "The last hand... both men had \"full house\".",
          "person": "Olga",
          "present": []
        },
        {
          "testimony": "There is four of each card in deck, from ace to king.",
          "person": "Olga",
          "present": []
        },
        {
          "testimony": "If you look at both men's hands, cheat is more obvious!",
          "person": "Olga",
          "present": []
        },
        {
          "testimony": "Mr. Smith's hand has three aces, and Mr. Wright's two. ...It is five aces in all.",
          "person": "Olga",
          "present": [
            "Chip Photo"
          ],
          "source": {
            "evidence_span": "On the near side, the cards are 7 heart, 7 diamond, 7 club, Ace spade, and Ace diamond. On the far side, the cards are King heart, King diamond, King spade, Ace club, and Ace heart.",
            "testimony_span": "Mr. Smith's hand has three aces",
            "explanation": "The defendant's hand has two aces, not three, according to the photo.",
            "is_self_contained": "no",
            "context_span": "The hand and chips on this side belong to the defendant, Mr. Wright. Those on the far side belonged to the victim, Mr. Smith."
          }
        },
        {
          "testimony": "The next moment, game becomes argument, dah! The defendant's trick was exposed!",
          "person": "Olga",
          "present": []
        },
        {
          "testimony": "He took bottle in his hand... Poor Mr. Smith!",
          "person": "Olga",
          "present": []
        }
      ],
      "noPresent": false,
      "summarized_context": "The witness Olga, a waitress of the club, describes final poker game between the defendant and the victim, arguing that the defendant cheated.",
      "labels": [
        "numerical",
        "spatial"
      ],
      "reasoning": [
        "Fact 1: The witness claims Mr. Smith's hand had three aces.",
        "Fact 2: The evidence suggests on the far side there were two aces.",
        "Fact 3: The context suggests Mr. Smith was on the far side.",
        "Prop 1: If a person is sitting on a side where there are two aces, that person does not have three aces."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Final Hand --Olga:\nThe last hand... both men had \"full house\".Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nJust how hard is it to make a full house, anyway?\nOlga:\nIt is quite hard, dah. It is making a pair and a three of kind at same time!\nApollo:\n... I guess that's right.\nJudge:\nVery difficult, to be sure. You can take my word as the \"Poker Head of Courtroom No. 3\"!\nOlga:\nVery difficult, dah. But is not impossible.\nApollo:\n(OK. Full house: Hard. This line of questioning: A waste of time.)Olga:\nThere is four of each card in deck, from ace to king.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nFour of each card, you say?\nOlga:\nDah. There is one spade, one diamond, one heart, and one club for each card. It is interesting fact that this number \"four\" comes from number of seasons!\nApollo:\nHuh, you don't say.\nJudge:\nAh, and did you know that the cards are numbered 1-13? Add all the cards in a deck and you get 364... a year!\nApollo:\nHuh, you don't say. (Isn't that one day short?)\nPayne:\nThat's why each deck has two jokers. They say the second joker stands for the leap year. Thus you have a perfect representation of the year... all in a deck of cards!\nApollo:\nHuh, you don't say. (We're going to be in this courtroom for a year if it keeps going like this!)Olga:\nIf you look at both men's hands, cheat is more obvious!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHow was it \"clear\"?\nOlga:\nDah, well... the defendant... ...he played a fifth ace!\nApollo:\nA f-fifth ace!?\nOlga:\nI still remember both hands very well. Mr. Smith's hand has three aces... ...and Mr. Wright's two.\nPayne:\nObviously, cheating was afoot! Or perhaps I should say... a hand!\nKristoph:\nYour Honor... perhaps this can be added to the testimony? Without Mr. Payne's joke.\nJudge:\nVery well. The witness will add this detail to her testimony, please.\nChanges statement from \"If you look at both men's hands, cheat is more obvious!\" to \"Mr. Smith's hand has three aces, and Mr. Wright's two. ...It is five aces in all.\"Olga:\nMr. Smith's hand has three aces, and Mr. Wright's two. ...It is five aces in all.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nA fifth ace...?\nOlga:\nDah! It should not exist, no? I still remember both hands very well. Mr. Smith's hand has three aces... ...and Mr. Wright's two.\nJudge:\nWell, where did this card come from then?\nPayne:\n...Perhaps we should ask the defendant that very question! Adding cards to a deck is no less serious a taboo than... Than forging evidence in a court of law!\nApollo:\nNnnk...!\nKristoph:\nNow... Perhaps it's time for you to say something, Justice?\nApollo:\nYou bet! I've no intention of staying quiet! Not me! No sir! (...I'd better find some contradicting evidence fast!)Present Chip Photo\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"It appears the witness is mistaken...\"Olga:\nThe next moment, game becomes argument, dah! The defendant's trick was exposed!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nDo you recall what the men were arguing about?\nOlga:\nDah, I believe so... The victim, he shouts, \"you are cheater!\" and then... ...the defendant shouts something like, \"I have objection!\"\nPayne:\nShouting objection, eh? Old habits are hard to break! First he bluffed his way through the courtroom, now he bluffs his way through life!\nApollo:\n\nApollo:\nHowever! Mr. Wright lost the hand! That seems to cast the shadow of doubt on Mr. Smith!\nOlga:\nHumiliation from losing even when cheating... That is what set fire to defendant's heart!\nJudge:\nSo what did the flaming defendant do next?Olga:\nHe took bottle in his hand... Poor Mr. Smith!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nBy bottle, are you referring to... this?\nOlga:\n...Dah. The defendant uses this bottle to... to... *sob*\nPayne:\nThis behavior is an admission of cheating by the defendant.\nJudge:\nHmm... But why use a grape juice bottle?\nPayne:\nYou'd be surprised at what can be used as a weapon.\nOlga:\nThis juice is recommended drink of Borscht Bowl Club, dah. This year's vintage is remarkable for its hefty flavor.\nApollo:\n(Hefty enough to brain a grown man, apparently.)Apollo:\n(First she says it was a serious competition, now she says there was cheating...)Kristoph:\nJustice... Notice anything odd? Her testimony keeps changing. Now she says the defendant cheated.Apollo:\nActually, yes! I had noticed that!Kristoph:\nLet's get the truth about this \"cheating\" first, shall we?Apollo:\nRight! Leave it to me!Apollo:\nIt appears the witness is mistaken...Olga:\nMiss... Taken? But my name...Apollo:\nLook, this piece of evidence clearly contradicts what you said in your testimony!Judge:\nThat's... the photo of the chips, is it not?Kristoph:\nJustice. Perhaps you ought to explain your point in a way that the judge can comprehend... In other words, use your finger to \"point\" out your point!Judge:\nYes... Please point out the contradiction in this photo. What particular \"point\" contradicts the witness's testimony?Present victim's aces\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Ms. Orly, in your testimony, you made the following claim:\"Present anywhere else\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhy, it's here, of course!\nJudge:\nIt's... where?\nKristoph:\nWhere is that you're pointing?\nApollo:\nWhere... Uhm... Good question!\nJudge:\nWe've already heard today on the dangers of bluffing.\nApollo:\nEr, sorry, Your Honor. (I'd better rethink this.)\nJudge:\nI think you'd best point out your point again.\nLeads back to:\n\"What particular \"point\" contradicts the witness's testimony?\"Apollo:\nMs. Orly, in your testimony, you made the following claim: \"Mr. Smith's hand has three aces\"... But as you can clearly see, the victim's hand only held two aces!Olga:\nEeeeeeeek!Payne:Payne:\nWell... Well maybe the witness was simply confused! Perhaps it was the defendant's hand that held the third ace in question...Apollo:Apollo:\nTake another look at the evidence! As you can see, the defendant also had two aces in his hand. Where's this fifth ace? I see cheating alright, and it's going on right here in this courtroom!Judge:\nTwo aces in each player's hand does make four aces total. Hardly proof of cheating...Olga:\nWait! Please! It is true... I have seen it! The fifth ace! There was cheating, I swear to you.Apollo:\n(That's odd... She must be lying, yet she's the most sincere I've seen her all day.)Kristoph:\nYou're right to trust your instincts...Apollo:\nMr. Gavin?Kristoph:\nWho knows what lies in store for us in the trial ahead... Your Honor, if I may. I have a suggestion...Judge:\nWhat might that be, Mr. Gavin?Kristoph:\nIf you don't mind... ...perhaps we might examine the actual cards?Judge:\nThe cards...?Kristoph:\nMr. Payne.Payne:\nUrk. Yes?Kristoph:\nThe players' hands that night were set aside as evidence, were they not? The defense would like to request that the cards be shown to the court.Judge:\nVery well, the prosecution will submit this evidence! Which will you examine? The victim's cards... or the defendant's cards?Apollo:\n(If these cards don't prove cheating was going on, nothing will! Now... which of these hands is more suspicious?)View victim's hand\n\n\n\n\n\n\n\nApollo:\n(It was the victim's hand that \"changed\" over the course of the witness's testimony...) The defense requests time to examine Mr. Smith's cards.\nJudge:\nVery well. Mr. Payne, if you would...\nPayne:\n...Very well.\nReceived evidence: Victim's Hand.\nKristoph:\nWell, time's a wasting. Get to it, Justice.\nApollo:\nY-Yes, sir!\nKristoph:\nWhen examining evidence, be sure to view it from all sides and angles. Try using [right analog stick / arrow keys] to turn it every which way, and [X / B] and [Y / M] to zoom in and out. (Changed from [Try using the dials on the evidence viewer.] in the original release) That should give you a better perspective on the case.\nApollo:\n(OK... Let's do this!)\n\n\n\nExamine cards with red back\n\n\n\n\n\n\n\nApollo:\nThe card backs are red... For some reason I thought that they were using blue cards in that final hand... Didn't you, Mr. Gavin?\nKristoph:\nHuh? Oh, hmm. Which was it now...\n\n\n\n\nExamine card with blue back\n\n\n\n\n\n\n\nLeads to:\n\"Wh-What...!?\"\n\n\n\n\nGo back\n\n\n\n\n\n\n\nJudge:\nWell, has the defense found anything of relevance?\nApollo:\n(Uh... I think I found out that I found nothing out.)\nKristoph:\nPerhaps you'd best examine the defendant's cards... before leaping to any conclusions. Or maybe you'd rather examine these cards one more time?\nApollo:\n(Well? Do I examine the other hand of cards?)\n\n\n\nExamine the other hand\n\n\n\n\n\n\n\nApollo:\n(Guess I'll examine Mr. Wright's cards.) Your Honor! The defense requests time to examine Mr. Wright's hand!\nJudge:\nGranted, but make it quick, Mr. Justice.\nReceived evidence: Wright's Hand.\nApollo:\n(Don't worry, Justice is always swift!)\nLeads to Wright's Hand examination\n\n\n\n\nExamine this hand again\n\n\n\n\n\n\n\nApollo:\n(No... According to the testimony, it was the victim's hand that changed. Better take a closer look!)\nLeads back to Victim's Hand examinationView defendant's hand\n\n\n\n\n\n\n\nApollo:\n(Let's start with Mr. Wright's hand.) The defense would like to view the defendant's hand.\nJudge:\nVery well. Mr. Payne! Your evidence.\nPayne:\nY-Yes, Your Honor!\nReceived evidence: Wright's Hand.\nKristoph:\nWell now... Let's see what we have here.\nApollo:\nRight... Right, sir!\nKristoph:\nWhen examining evidence, be sure to view it from all sides and angles. Try using [right analog stick / arrow keys] to turn it every which way, and [X / B] and [Y / M] to zoom in and out. (Changed from [Try using the dials on the evidence viewer.] in the original release) That should give you a better perspective on the case.\nApollo:\n(OK... Let's do this!)\n\n\n\nExamine cards with red back\n\n\n\n\n\n\n\nApollo:\nThe card backs are red... For some reason I thought that they were using blue cards in that final hand... Didn't you, Mr. Gavin?\nKristoph:\nHuh? Oh, hmm. Which was it now...\n\n\n\n\nGo back\n\n\n\n\n\n\n\nJudge:\nWell, has the defense found anything they would like to share with the court?\nApollo:\n(Uh... Not unless you count utter confusion.)\nKristoph:\nPerhaps you'd best examine the victim's cards next? Of course, you can always give these cards another look.\nApollo:\n(Well? Do I examine the other hand of cards?)\n\n\n\nExamine the other hand\n\n\n\n\n\n\n\nApollo:\n(Guess I'll examine the victim's cards...) Your Honor! The defense requests time to examine Mr. Smith's hand!\nJudge:\nGranted, but make it quick, Mr. Justice.\nReceived evidence: Victim's Hand.\nApollo:\n(Don't worry, Justice is always swift!)\nLeads to Victim's Hand examination\n\n\n\n\nExamine this hand again\n\n\n\n\n\n\n\nApollo:\n(Maybe I missed something the first time... Better check them again.)\nLeads back to Wright's Hand examinationApollo:\n(Wh-What...!?) Your Honor! Look at this! One of the victim's cards... The back is a different color!Examine evidence\n\n\n\n\n\n\n\n\n\nVictim's Hand\n\n\n\n\n\n\n\n\n\nCards with red back\n\n\n\n\n\n\n\nApollo:\nThe card backs are red... For some reason I thought they were using blue-backed cards in the final hand...\n\n\n\n\nCard with blue back\n\n\n\n\n\n\n\nApollo:\nOnly one of cards has a blue back... I'm much more of a red guy myself. Blue is so... not red, you know?Payne:\nEh...? Ehhhhhh!?Olga:\nTh-That's impossible! But I put that card in Wright's hand... Ack!Kristoph:\n...What was that, Ms. Orly?Olga:\nNo... Ny-Nyet! Er, I merely said, eh... Dah, I have, eek!Kristoph:\nYour Honor?Judge:\nM-Mr. Gavin, yes?Kristoph:\nTell me, what is the easiest way to cheat at poker?Judge:\nTo... cheat?Kristoph:\nI'll tell you. One merely needs a friend, a \"comrade\", shall we say... The dealer!Judge:\nAh... Ah!Apollo:\nWait, so you mean... This witness... Ms. Orly...Kristoph:\nShe's the cheater. A professional, I'd wager.Olga:\nNyeeeeeeaaaaargh!Judge:\nOrder! Order!!!Apollo:\n(Focus, Justice! Time to take advantage of her! ...I mean, of her mistake!) Your Honor! Please recall the testimony we just heard!Olga:\nTh-That's impossible! But I put that card in Wright's hand...Apollo:\n...Ergo! Ms. Olga Orly conspired to cheat, not with my client... ...but with the victim, Mr. Shadi Smith!Olga:\nOoooooogh!Apollo:\nNot only did she cheat, she cheated poorly! Therefore! It's not hard to imagine an altercation between her and the victim...Payne:\nWhaaaaaaaaaaaat!?Judge:\nWait, you don't mean... The defense isn't accusing the witness, Ms. Olga Orly... are you?Apollo:\n(Time for Justice! There were three people in the room at the time of the incident. And if Mr. Wright isn't guilty, that means...) ...I am! The defense accuses the witness, Ms. Olga Orly, of murder!Olga:\nEeeeeeeeeeeeeeeeek!Judge:\n...Mr. Payne. Where is your witness, Ms. Olga Orly?Payne:\nErm, it appears she has lost, eh, consciousness, Your Honor.Judge:\nHmm... Mr. Justice?Apollo:\nYour Honor!Judge:\nIt seems you've presented a new possibility to the court. One suggesting a connection between the witness and the victim, Mr. Smith.Apollo:\nAnd that means...!?Judge:\nThe court cannot pronounce a verdict for the defendant at this time!Payne:\nNnk...! What!?Apollo:\n(I did it! I held out!)Judge:\nI see no point in prolonging the trial this day. The prosecution will need to make further inquiries...Phoenix:Apollo:\nM-Mr. Wright...?Phoenix:\n...You can't end the trial here, Your Honor. Not yet.Payne:\nWhat nonsense is the defendant spewing now!?Phoenix:\nThink. One of the cards had a different colored back. Don't you wonder what it means?Payne:Payne:\nWh-What are you doing, Mr. Wright!? Raising objections right when you're about to get off the hook!? Ridiculous!Judge:\nMr. Payne, you of all people should know... Mr. Wright has a talent... ...for the ridiculous! Perhaps we should get to the bottom of things. Let's clear up the facts about the game that fateful night.Phoenix:\nAs was said before... We alternated between two decks of cards that night.Payne:\nThat was said before!Phoenix:\nThe two decks at the club have different colored backs: Blue... and red. One color per deck.Apollo:\nWhy use different-colored backs?Phoenix:\nIf we used the same color, the two decks might get mixed.Apollo:\n(Um, you used different colors and they STILL got mixed up.)Phoenix:\nWe used the red deck for the last game.Judge:\nHmm... I see. But... that's odd. For some reason... I have this impression that you were using the blue cards!Apollo:\n(Yeah, me too... I'm sure someone said something about blue cards...)Payne:\nWhatever. In the end one card of the wrong color got into the mix... Which means there was cheating.Phoenix:\nYes, a card slipped into the deck would seem to indicate cheating... Yet... this card raises two serious questions. ...Apollo?Apollo:\nY-Yes?Phoenix:\nLet's consider the first question, shall we? Think. In the last game... when was the card swapped?Apollo:\n(\"When\"...?)Phoenix:\nThere are three broad possibilities here. It could have been swapped before the murder, during the murder... or after the murder.Payne:\nWell, yeah! Thanks for the news bulletin, Mr. Wright! Of course it was swapp--Phoenix:\nOh? It might be as simple as you think, Mr. Payne. Or it might not be.Payne:\nNnnk!Phoenix:\nI'd like to hear what Apollo thinks first... When do you think the cards were swapped?Apollo:\n(When was the card swapped into the deck?)Before the murder\n\n\n\n\n\n\n\nApollo:\nWell, it must have happened before the murder.\nJudge:\nYou mean, during the game?\nPhoenix:\nI wonder...\nApollo:\nHuh? Why?\nPhoenix:\nThink. When you're playing poker... ...which side of the cards face your opponent?\nApollo:\nAck! The back...\nJudge:\nNot something the \"Poker Head of Courtroom No. 3\" would be likely to miss!\nApollo:\nSorry, let me think about this some more...\nLeads back to:\n\"When was the card swapped into the deck?\"During the murder\n\n\n\n\n\n\n\nApollo:\nWell... weren't they swapped during the murder?\nJudge:\n\"During\" the murder? Tell me, exactly when is that?\nApollo:\nHuh? Well, the very moment of the act, I guess...\nPhoenix:\nWould that be the moment the cards were shown?\nKristoph:\nOr perhaps the moment when the cheater was revealed?\nJudge:\nOr maybe the very moment the bottle came down on Mr. Smith's head?\nApollo:\n... Uh... could I have a moment?\nJudge:\nThat \"moment\" could cost you this case!\nApollo:\nSorry... Let me rethink this.\nLeads back to:\n\"When was the card swapped into the deck?\"After the murder\n\n\n\n\n\n\n\nLeads to:\n\"Perhaps it happened... after the murder?\"Apollo:\nPerhaps it happened... after the murder?Payne:Payne:\nWh-What's that? Ridiculous! What's the point of cheating after the hands have been shown? That's silly!Apollo:Apollo:\nYes! But tell me... How do you swap cards during the game!? I'll take \"silly\" over \"impossible\".Payne:Payne:\nTake it from me, son. There's a lot of silly in this world, but very little impossible.Apollo:\nOh? Even when the backs of the cards are a different color!? If you pulled that during the game, you'd be caught in no time!Judge:\nAh...Phoenix:\nQuite true. That would mean that the blue card in question... ...was swapped after the hands were shown, after the murder!Payne:Payne:\nOK, this is going past silly and straight on to crazy. I ask again: what's the point of cheating after the game's over!? Who would do that!?Phoenix:\nWho indeed. That's one of the mysteries before us.Judge:\nTh-There's another?Phoenix:\nYes. A simple, yet decisive question must be asked: Who swapped the red card for a blue card?Apollo:\nWh-Who?Kristoph:\nThe game, and murder, is done. The victim is dead. Only two remain in the room. Alive, that is. The defendant, Phoenix Wright, and our witness, Olga Orly.Apollo:\n(OK, so who was it that swapped the red card for a blue?)Phoenix Wright\n\n\n\n\n\n\n\nApollo:\nThe one who swapped the cards was... Mr. Wright! It was you, wasn't it?\nPhoenix:\nAnd why would I do such a thing?\nApollo:\nAck! Uh, well, because, uh... ...maybe you were trying to hide the fact that you'd cheated?\nJudge:\nThat would make sense... but the swapped card was in the victim's hand!\nApollo:\nOh.\nPhoenix:\nSorry... I'm a nice guy, but I'm not that nice.\nApollo:\n(Come to think of it, he would lack a motive for helping his opponent to win...)\nLeads back to:\n\"OK, so who was it that swapped the red card for a blue?\"Olga Orly\n\n\n\n\n\n\n\nApollo:\nWhy, it must have been Olga Orly who swapped the cards! She was trying to cover up evidence of the cheating.\nJudge:\nThat.. does make some sense.\nPhoenix:\n\nPhoenix:\nSorry... But there's a problem with that explanation.\nApollo:\nHuh?\nPhoenix:\nThe swapped card was from the wrong deck.\nJudge:\nYes, a blue card was stuck into a red hand.\nPhoenix:\nMixing a card from the wrong deck... when the backs are different colors? Remember that you're talking about Olga Orly... She was the dealer. Do you really think she would make such a novice mistake?\nApollo:\n(Actually, I have trouble imagining even the judge making that mistake.)\nPhoenix:\nGive it a little more thought, Apollo.\nApollo:\nR-Right!\nLeads back to:\n\"OK, so who was it that swapped the red card for a blue?\"Someone else\n\n\n\n\n\n\n\nLeads to:\n\"The one who swapped the cards wasn't Mr. Wright, of course.\"Apollo:\nThe one who swapped the cards wasn't Mr. Wright, of course. And, well, it doesn't seem like it could have been Olga Orly, either...Judge:\nWh-What are you suggesting!?Kristoph:\nThat's hardly a logical conclusion, I'll admit. As the defense, I think it only makes sense for you to name Ms. Orly at this point.Apollo:\nYes, yes, I know! But... But she was the one who dealt the cards, right? I... I just can't believe she would make the mistake of swapping the wrong-color card!Judge:\nAnd if the card was swapped during the game, it'd be obvious...Phoenix:\nHeh. Heh heh heh heh.Judge:\nSomething you'd like to share with the court, Mr. Wright?Phoenix:\nOh, my apologies, Your Honor. I was just thinking how much fun all this is.Payne:Payne:\nFun!? How about confusing!? I've no idea what the defense is claiming, Your Honor. If the one who swapped the card wasn't the defendant, and it wasn't Ms. Orly... Then who was it!?Apollo:\nEr, yeah, well, that is the question, isn't it?Phoenix:\nPrecisely.Apollo:\nHuh?Phoenix:\nI believe we're about to see this case take... a new direction.Judge:\nA new direction?Phoenix:\nWe'll find that, indeed, after the murder... ...someone swapped one of the cards in the victim's hand. And that someone made two critical mistakes.Kristoph:\nI'm sure you're going to tell us that the first was swapping the wrong-color card.Phoenix:\nBecause the one who did the swap didn't know two colors of cards were being used. The other mistake... was the number on the card.Apollo:\nRight... The person replaced the fifth ace with a king.Phoenix:\nI'm sure whoever swapped it wasn't expecting there to be a fifth ace, after all. All they knew was that the game had been won with a full house. So they picked up a king from the table, and swapped it in.Payne:Payne:\nB-But! There's one problem... According to our case record this person doesn't exist!!!Phoenix:\nTrue, not until now. But you have to admit the possibility of a fourth person. Though it's more than a possibility. There was someone else there that night at the scene of the crime.Payne:\nWh-Whaaaaaaaaaat!?Kristoph:\nI believe the judge spoke truthfully earlier. You do make trials... ridiculous, Mr. Wright.Judge:\nThis trial has proceeded on one central assumption: Namely, that, at the time of the incident, there were only three people in that room.Phoenix:\nI believe this new evidence, shall we say... overturns that assumption?Judge:\nThe problem is that you chose to conceal this information from the court!Phoenix:\n...I suppose that is a problem, yes.Judge:\nCourt is adjourned for a brief recess! Mr. Gavin, I'll see you in my chambers during this recess.Kristoph:\n...Certainly, Your Honor.Judge:\nVery well! The trial will resume in twenty minutes!April 20, 11:52 AMDistrict CourtDefendant Lobby No. 3Kristoph:\nThat was quite... unexpected, Mr. Wright. To suddenly claim there was another person at the scene of the crime like that... I must ask... is it the truth?Phoenix:\nWell now... I'd think you would know the answer to that?Kristoph:\nAh, being mysterious, are we? Sadly, I've no time for mysteries. I'd only ask that you leave the defending to your defense, in the future. Otherwise... I cannot guarantee the outcome.Phoenix:\nI see you haven't mellowed out one bit, Kristoph.Kristoph:\nJustice.Apollo:\nY-Yes, sir!Kristoph:\nThe judge has summoned me to his chambers, so carry on without me.Phoenix:\nYou did well, Apollo.Apollo:\nUm.. Can I ask you something?Phoenix:\nSure.Apollo:\nThat locket you wear... Is that really yours, Mr. Wright?Phoenix:\nAh, you're wondering about the victim's disappearing locket? Here, you can take a look at it. That's a picture of my daughter in there.Apollo:\nI'm... just surprised to hear you had a daughter.Phoenix:\nMost people are. Perhaps you'll meet her one of these days.Apollo:\nOne more question. The one who cheated that night... Was it you?Phoenix:\n... What do you think?Apollo:\nHuh?Phoenix:\nYou know what happened seven years ago... What I did. It's not unreasonable for you to think I might cheat.Apollo:\nI-I never! Honest! But... (It IS odd that he managed to go undefeated for seven whole years...)Phoenix:\nWant to know something? There's only one game where you can be dealt bad cards all night and still win. Poker.Apollo:\nEh...?Phoenix:\nYou see, poker is all about reading your opponent. In that way, it's a lot like a court case.Apollo:\nPoker... is like trial law!?Phoenix:\nFigure out what your opponent is thinking, and you win.Apollo:\nWell, yeah, but that's harder than it sounds.Phoenix:\nI think not.Apollo:\n...!Phoenix:\nTry as they might to conceal it, everyone reveals their true thoughts in the end. Their body language can become a valuable source of information.Apollo:\nYou're kidding!Phoenix:\nThat witness, for instance, Ms. Orly. She would touch the back of her neck during certain parts of her testimony. Did you notice?Apollo:\nUh... No. (C'mon, who'd notice that!?)Phoenix:\nWords, habits, twitches... It's all information for the reading. That's the secret to winning, Apollo. Someone taught me, and now, I pass the secret on to you.Apollo:\nB-But, I'm not worthy! I mean, there's no way I'll pick up on these \"signals\".Phoenix:\nNo. You can do it.Apollo:\nHuh?Phoenix:\nYou just don't know it yet.Apollo:\n(What's he talking about...?)Phoenix:\nBut you will. Soon. Ah, almost forgot. One more thing. About this case... You should know, I haven't told the truth to anyone yet.Apollo:\nWhaaaaaaaa--!? (I knew it!)Phoenix:\nI have my reasons, of course. All shall be revealed. And Apollo... I need you to be there, defending me. I need your power.Apollo:\nMy, um, power? (I had no idea my Chords of Steel were that special...)Phoenix:\n...It's time. The real trial begins now. Do your best.To be continued.April 20, 12:14 PMDistrict CourtCourtroom No. 2Judge:\nCourt will now reconvene. Has our witness, Ms. Olga Orly, recovered?Payne:\nY-Yes, Your Honor! Er, well, she's regained consciousness.Kristoph:\nPerhaps we can hear her version of the events again?Payne:\nThat's the thing... You see, she's quite fatigued.Judge:\nYou're looking a bit fatigued yourself, Mr. Payne.Kristoph:\nSadly, fatigue is insufficient grounds for refusing to testify... or prosecute. The defense would like to request that Ms. Orly take the stand.Judge:\nVery well. The witness will take the stand!Kristoph:\nPerhaps you could repeat your name and profession?Olga:\n...Kristoph:\nOr perhaps you'd rather admit that you're a poor liar, and a poorer loser.Olga:\nNy-Ny-Nye-! ... Not. Name's Olga Orly. That's the truth. I'm a pro dealer. People call me... Olga \"Quick-Fingers\" Orly!Judge:\nOh... Oh really?Olga:\nWant to know something else? I'm not really Russian! And my last name sounds like \"Oh really\"! There, that's the truth! I hope you're satisfied.Apollo:\nWitness! You will tell the court what you were really up to that night!Olga:\nFine, I'll talk. We had a plan, see.Judge:\nLet me remind you that you are currently under oath. Any further fabrications will have serious consequences.Olga:\n... Fine.Olga:\nLike I said, I'm a pro. That guy, Smith, hired me to do what I do best. I was planted at the Borscht Bowl Club several days prior to the night of the game. As a waitress.Apollo:\nSo you were in cahoots with the victim!Olga:\nNot that he needed my help. Smith is a well-known poker player in some circles. But winning wasn't the main purpose of this game. It was about destroying a legend: the unbeatable Phoenix Wright! The plan was simple. Elegant, really. You see, we set up a trap of sorts... I was to plant a card in Wright's pocket beforehand... ...and then deal five aces during one of their games. When their hands were revealed, Smith would call him out and search Wright. He would then pull out the planted card and the trap would snap shut!You swapped the cards!Olga:\nExposed as a cheater and losing on top of it! It would have made a great double play. Just like that, the legend would be dashed to pieces.Judge:\nIndeed... Getting caught red-handed at cheating would cast doubt on all his prior wins...Olga:\nA seven-year legend, destroyed by one little card... That was the plan!Kristoph:\n\"Oh really, Orly\"? How droll. But... it appears you made quite the mistake.Judge:\nA mistake?Kristoph:\nI agree, the trap was elegant. Yet, what happened to that planted card?Apollo:\nHey, that's right!Olga:\nHe's lucky, I'll give him that. You'd have to be to slip free from a trap laid by Olga \"Quick-Fingers\" Orly!Judge:\nOh really? The witness would be much cuter if she dispensed with the evil mastermind shtick.Olga:\nCute...? Who wants to be cute? I'm not cute! I'm bad! You hear me? Bad!!!Judge:\nWhen you're through being bad, perhaps you could testify to the court? Tell us about this \"trap\"... and how it was sprung.Witness Testimony-- The Best Laid Traps --Olga:\nThat night, I planted the card like I was supposed to.\nAnd Wright lost the last hand, just like he was supposed to. Then Smith searched him!\nBut the planted card was gone! The trap failed.\nThe next moment, Wright picked up a bottle and swung it!\nIt wasn't me who hit Smith! It was that no-good, cheating defendant!Judge:\nHmm... A surprisingly frank testimony that still leaves us mostly in the dark.Olga:\nThe trap was perfect I tell you, perfect! If that rotten cheater hadn't messed it up.Apollo:\nLook who's talking!Judge:\nWell, the testimony, for what it's worth, is all yours, Mr. Justice.Apollo:\n(With witnesses like her, who needs criminals? ...And with defendants like Mr. Wright, who needs prosecutors?)Cross ExaminationCross Examination-- The Best Laid Traps --Olga:\nThat night, I planted the card like I was supposed to.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThis planted card... which card was it, exactly?\nOlga:\nThe trump card... the Five of Hearts.\nJudge:\nLet me guess. Mr. Wright was to have switched the Five with the Ace to make a full house. At least, that's what you were going to accuse him of doing, thereby ruining his legend.\nOlga:\nI slid it into Wright's pocket.\nApollo:\nWhen was this...?\nOlga:\nWhy, before the match, of course. While he was eating. At the Borscht Bowl Club, we serve borscht... and suckers.\nJudge:\nRemind me never to go there.\nOlga:\nOf course, the card was to make its grand debut during the game... Like a good borscht, a good plot must be cooked up early and allowed to thicken.Olga:\nAnd Wright lost the last hand, just like he was supposed to. Then Smith searched him!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo, everything went according to plan...\nOlga:\nExactly. The fifth ace came up, so it's obvious the switch went off without a hitch. Once the extra card was found in his pocket... ...Wright would be forever known as a cheat and a fraud.\nJudge:\nThere are worse things to be known as I suppose.\nApollo:\nTell us what happened with the search.Olga:\nBut the planted card was gone! The trap failed.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThe card... disappeared?\nOlga:\nYeah! My trump card, the Five of Hearts! Gone! Without a trace! Poof! Zippo! We searched every nook and cranny... Even inside his cute little hat!\nApollo:\nBut the card was nowhere to be found, is this correct?\nOlga:\nNever in my long, storied career... Never has \"Quick-Fingers\" Orly been so readily duped!\nJudge:\nOh really. So, what did happen to that Five of Hearts?\nOlga:\nDon't look at me. Why don't you ask that cheating, lying, two-faced defendant?\nApollo:\n(So the Five of Hearts is still missing in action...)Olga:\nThe next moment, Wright picked up a bottle and swung it!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWait... Isn't that a little odd?\nOlga:\nWh-What's odd!?\nApollo:\nYou searched Mr. Wright, er, thoroughly, and found nothing? Which means he didn't cheat... Which means he had no reason to strike the victim!\nOlga:\nW-Well...\n\nBRACELET THUMPS\n\nApollo:\n(Wh-What was that just now!? I... sensed something...)\nJudge:\nSomething wrong, Mr. Justice?\nApollo:\nNo... nothing, Your Honor. (What to do? Should I press her a little harder?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nApollo:\nMs. Orly...! You're hiding something!\nOlga:\nWh-What are you talking about!? Y-Y-You! M-M-M-Me? \"Quick-Fingers\" Orly, hi-hi-hide something?\nPayne:\n\nPayne:\nThe defense will refrain from baseless accusations!\nApollo:\nI have one question for the witness then. You say you saw the moment the defendant hit the victim. ...Is this true?\nOlga:\nO-Of course it's true! I d-did see it, honest! I saw it when Wright hit him. \n\nBRACELET THUMPS\n\nOlga:\nWith my own eyes, I saw it!\nApollo:\n(What's this weird vibe I'm getting!?)\n\n\nPhoenix:\nThat witness, for instance, Ms. Orly. She would touch the back of her neck during certain parts of her testimony. Did you notice?\n\n\nApollo:\n(Touching her neck, was it? Whoa! What's going on? This sensation... It's coming into focus! There! That twitch! It's so clear! It's like I could perceive her habit like I couldn't before!)\n\n\n\nPerceive\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Ms. Orly... Perhaps you are unaware of this yourself...\"\n\n\nApollo:\nMs. Orly... Perhaps you are unaware of this yourself...\nOlga:\nUn-Unaware of what?\nApollo:\nWhenever you get to a certain part of your testimony... ...you touch the back of your neck with your left hand!\nOlga:\n...! My... My neck? So... So what!?\nKristoph:\nWhat indeed, Justice? I hadn't noticed anything of the sort...\nApollo:\nWhen she says that part of the testimony... She's subconsciously recalling something... Her body reacts to the memory, and she touches her neck! I'm sure of it!\nPayne:\nA memory? Would someone care to explain what he's babbling about?\nJudge:\nThis is highly unusual... but let's ask the defense. You claim the witness is remembering something. Maybe you have evidence of this \"memory\" to show us?\nApollo:\n(Her habit is scratching her neck whenever she talks about the moment of the crime... So, what would remind her most of the moment of the crime!?) Ms. Orly. Whenever you recall the crime that night, you scratch your neck. I've noticed it happens when you think about the moment of the crime. There must be some reason behind this \"habit\" of yours. I believe the weapon that left an inerasable \"impression\" on your neck is this!\n\n\n\nPresent Deadly Bottle\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Whenever she talks about the moment of the crime, she touches her neck...\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nApollo:\n\nOlga:\n... Sorry to disappoint, but I don't have any particular memories of that!\nApollo:\n(Uh oh... That must not have been it!)\nPayne:\nHmph! Of course not! You want a habit, Mr. Justice? I'll show you a habit!!! Ah ha ha hah!\nApollo:\n(I'd better get this sorted out before I develop a habit of my own...)\nLeads back to:\n\"Her habit is scratching her neck whenever she talks about the moment of the crime...\"\n\n\nApollo:\nWhenever she talks about the moment of the crime, she touches her neck... And what reminds us more of that moment than this bottle, the murder weapon!\nOlga:\n...!\nApollo:\nBut... something doesn't fit. If you were only the witness to the crime... ...why would that make you touch your neck like you're in pain?\nPayne:\nWhat's he talking about now!?\nApollo:\nIt was Mr. Smith, the victim who was hit... not you!\nOlga:\nUh... Uhmmm...\nPayne:\n\nPayne:\nThis is a cross-examination, not a cross-wild-conjecture! Th-The witness's... \"habits\"!? They're completely irrelevant!\nKristoph:\nJustice... I'll admit, I'm a bit confused myself. This is certainly a... unique cross-examination.\nApollo:\nI'll explain later! Just, trust me. Now's our only chance to break her! Ms. Orly! Please testify, in detail, about the moment of the crime. The very moment!\nOlga:\nNy-Nyet. I am knowing nothing.\nPayne:\n...\nJudge:\n...\nApollo:\n... Um, we know you're not Russian.\nJudge:\nThe witness will testify, please. Now.\nOlga:\nBah. Fine!\nChanges statement from \"It wasn't me who hit Smith! It was that no-good, cheating defendant!\" to \"He's the one who did it! I didn't let him out of my sight until the cops got there!\"\n\n\n\n\nNo need\n\n\n\n\n\n\n\nApollo:\n(Nah... I'm just seeing things.) Sorry, it's nothing. Please continue the testimony. (What was that? A dizzy spell? I gotta relax...)\nLeads back to cross-examinationPress (after changing fifth statement)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou're hiding something, and that habit of yours proves it!\nOlga:\nHah! Ludicrous! I'm not h-hiding anything!\nApollo:\nYou touched your neck again.\nOlga:\nAck!\nApollo:\nIt's no use trying to hide it. I can see right through you.\nOlga:\n...Olga:\nIt wasn't me who hit Smith! It was that no-good, cheating defendant!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nLet me ask, how's your eyesight?\nOlga:\nJust who do you think you're talking to? They don't call me \"Quick-Fingers\" for nothing. I'm a pro. Which means my dealing's pro, and my eyesight... is pro!\nPayne:\nHonestly, she'd have to be blind as a bat to miss something in that small room.\nApollo:\n(Yeah, but Mr. Wright didn't have a motive to hit the victim! Hmm...)Olga:\nHe's the one who did it! I didn't let him out of my sight until the cops got there!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou seem... uneasy.\nOlga:\nYou try standing up here! (Changed from [You try sitting up here!] in the original release)\nApollo:\n(Her eyes are darting all over the place... I must be getting warm!) Tell me... After the crime, what was the defendant like?\nOlga:\nUh. Well... He must have been stunned by the weight of his crime! He sat in a daze at that table ...until the cops came.\nKristoph:\nIntriguing... I believe you've gotten all the testimony you're going to get out of this witness. So, what do you think about her testimony?\nApollo:\nI'll tell you what I think! Her testimony is..\n\n\n\nFlawed\n\n\n\n\n\n\n\nApollo:\n...is basically bogus. It contradicts the evidence!\nPayne:\nWh-What's that!?\nJudge:\nWell... Show us this evidence, Mr. Justice! This evidence that you claim contradicts the testimony!\nApollo:\n(She didn't let him out of her sight until the cops got there... I know there's some evidence that contradicts that!)\n\n\n\nPresent Wright's Cell Phone\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Ms. Orly! We have a record here that clearly contradicts what you said!\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThis, Your Honor, is the evidence that contradicts her testimony!\nJudge:\n... Well, Mr. Payne?\nPayne:\nTsk. Who would have thought that Justice could be so wrong! He's the guilty one!\nApollo:\n(Gah! Me!?)\nJudge:\n...Mr. Justice. You might want to think about your future before doing that again.\nApollo:\n(Ouch. That one hurt...)\nLeads back to cross-examination\n\n\n\n\n\nFine\n\n\n\n\n\n\n\nApollo:\n...pretty good, really. I'd be upset too at the scene of a crime like that. Yeah, I can picture my mind going blank, staring listlessly...\nKristoph:\nYes, I am picturing you doing that right now. As for our defendant, he is an experienced trial lawyer... He's seen a lot in his day.\nLeads back to cross-examinationPresent Wright's Cell Phone\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Ms. Orly! We have a record here that clearly contradicts what you said!\"Apollo:\n(Different personality... but the same testimony.)Kristoph:\nI believe you have her where you want her, Justice. The circumstances have changed yet her testimony has not. That means...Apollo:\nThere's got to be a contradiction in there!Kristoph:\nQuite.",
      "testimonies": [
        {
          "testimony": "That night, I planted the card like I was supposed to.",
          "person": "Olga",
          "present": []
        },
        {
          "testimony": "And Wright lost the last hand, just like he was supposed to. Then Smith searched him!",
          "person": "Olga",
          "present": []
        },
        {
          "testimony": "But the planted card was gone! The trap failed.",
          "person": "Olga",
          "present": []
        },
        {
          "testimony": "The next moment, Wright picked up a bottle and swung it!",
          "person": "Olga",
          "present": []
        },
        {
          "testimony": "It wasn't me who hit Smith! It was that no-good, cheating defendant!",
          "person": "Olga",
          "present": []
        },
        {
          "testimony": "He's the one who did it! I didn't let him out of my sight until the cops got there!",
          "person": "Olga",
          "present": [
            "Wright's Cell Phone"
          ],
          "source": {
            "evidence_span": "Used by the defendant to notify the police from the restaurant's first floor.",
            "testimony_span": "I didn't let him out of my sight until the cops got there!",
            "explanation": "Since the defendant left the basement to call the police, the witness who claimed to have witness the muder in the basement must have left the defendant out of her sight.",
            "is_self_contained": "no",
            "context_span": "The victim was murdered in a small room in a basement two floors down from ground level. Of course, cell phones can't get reception so far down. The defendant used the stairs in this hallway to go above ground... The call came from the first floor of the restaurant."
          }
        }
      ],
      "noPresent": false,
      "summarized_context": "The witness Olga, a waitress of the club, describes the moment of the crime. The crime happened in the basement two floors down from ground level. The witness was in the basement the whole time.",
      "labels": [
        "spatial"
      ],
      "reasoning": [
        "Fact 1: The witness claims she didn't let the defendant out of her sight since the murder.",
        "Fact 2: The evidence suggests the defendant went to the first floor to make the call.",
        "Fact 3: the context suggests the murder happened in the basement.",
        "Prop 1: If a person goes to the first floor, they must not be in the basement.",
        "Prop 2: If a person is not in the location of the murder, another person who witnessed the murder must have let them out of their sight."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Best Laid Traps --Olga:\nThat night, I planted the card like I was supposed to.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThis planted card... which card was it, exactly?\nOlga:\nThe trump card... the Five of Hearts.\nJudge:\nLet me guess. Mr. Wright was to have switched the Five with the Ace to make a full house. At least, that's what you were going to accuse him of doing, thereby ruining his legend.\nOlga:\nI slid it into Wright's pocket.\nApollo:\nWhen was this...?\nOlga:\nWhy, before the match, of course. While he was eating. At the Borscht Bowl Club, we serve borscht... and suckers.\nJudge:\nRemind me never to go there.\nOlga:\nOf course, the card was to make its grand debut during the game... Like a good borscht, a good plot must be cooked up early and allowed to thicken.Olga:\nAnd Wright lost the last hand, just like he was supposed to. Then Smith searched him!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo, everything went according to plan...\nOlga:\nExactly. The fifth ace came up, so it's obvious the switch went off without a hitch. Once the extra card was found in his pocket... ...Wright would be forever known as a cheat and a fraud.\nJudge:\nThere are worse things to be known as I suppose.\nApollo:\nTell us what happened with the search.Olga:\nBut the planted card was gone! The trap failed.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThe card... disappeared?\nOlga:\nYeah! My trump card, the Five of Hearts! Gone! Without a trace! Poof! Zippo! We searched every nook and cranny... Even inside his cute little hat!\nApollo:\nBut the card was nowhere to be found, is this correct?\nOlga:\nNever in my long, storied career... Never has \"Quick-Fingers\" Orly been so readily duped!\nJudge:\nOh really. So, what did happen to that Five of Hearts?\nOlga:\nDon't look at me. Why don't you ask that cheating, lying, two-faced defendant?\nApollo:\n(So the Five of Hearts is still missing in action...)Olga:\nThe next moment, Wright picked up a bottle and swung it!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWait... Isn't that a little odd?\nOlga:\nWh-What's odd!?\nApollo:\nYou searched Mr. Wright, er, thoroughly, and found nothing? Which means he didn't cheat... Which means he had no reason to strike the victim!\nOlga:\nW-Well...\n\nBRACELET THUMPS\n\nApollo:\n(Wh-What was that just now!? I... sensed something...)\nJudge:\nSomething wrong, Mr. Justice?\nApollo:\nNo... nothing, Your Honor. (What to do? Should I press her a little harder?)\n\n\n\nPress harder\n\n\n\n\n\n\n\nApollo:\nMs. Orly...! You're hiding something!\nOlga:\nWh-What are you talking about!? Y-Y-You! M-M-M-Me? \"Quick-Fingers\" Orly, hi-hi-hide something?\nPayne:\n\nPayne:\nThe defense will refrain from baseless accusations!\nApollo:\nI have one question for the witness then. You say you saw the moment the defendant hit the victim. ...Is this true?\nOlga:\nO-Of course it's true! I d-did see it, honest! I saw it when Wright hit him. \n\nBRACELET THUMPS\n\nOlga:\nWith my own eyes, I saw it!\nApollo:\n(What's this weird vibe I'm getting!?)\n\n\nPhoenix:\nThat witness, for instance, Ms. Orly. She would touch the back of her neck during certain parts of her testimony. Did you notice?\n\n\nApollo:\n(Touching her neck, was it? Whoa! What's going on? This sensation... It's coming into focus! There! That twitch! It's so clear! It's like I could perceive her habit like I couldn't before!)\n\n\n\nPerceive\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Ms. Orly... Perhaps you are unaware of this yourself...\"\n\n\nApollo:\nMs. Orly... Perhaps you are unaware of this yourself...\nOlga:\nUn-Unaware of what?\nApollo:\nWhenever you get to a certain part of your testimony... ...you touch the back of your neck with your left hand!\nOlga:\n...! My... My neck? So... So what!?\nKristoph:\nWhat indeed, Justice? I hadn't noticed anything of the sort...\nApollo:\nWhen she says that part of the testimony... She's subconsciously recalling something... Her body reacts to the memory, and she touches her neck! I'm sure of it!\nPayne:\nA memory? Would someone care to explain what he's babbling about?\nJudge:\nThis is highly unusual... but let's ask the defense. You claim the witness is remembering something. Maybe you have evidence of this \"memory\" to show us?\nApollo:\n(Her habit is scratching her neck whenever she talks about the moment of the crime... So, what would remind her most of the moment of the crime!?) Ms. Orly. Whenever you recall the crime that night, you scratch your neck. I've noticed it happens when you think about the moment of the crime. There must be some reason behind this \"habit\" of yours. I believe the weapon that left an inerasable \"impression\" on your neck is this!\n\n\n\nPresent Deadly Bottle\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Whenever she talks about the moment of the crime, she touches her neck...\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nApollo:\n\nOlga:\n... Sorry to disappoint, but I don't have any particular memories of that!\nApollo:\n(Uh oh... That must not have been it!)\nPayne:\nHmph! Of course not! You want a habit, Mr. Justice? I'll show you a habit!!! Ah ha ha hah!\nApollo:\n(I'd better get this sorted out before I develop a habit of my own...)\nLeads back to:\n\"Her habit is scratching her neck whenever she talks about the moment of the crime...\"\n\n\nApollo:\nWhenever she talks about the moment of the crime, she touches her neck... And what reminds us more of that moment than this bottle, the murder weapon!\nOlga:\n...!\nApollo:\nBut... something doesn't fit. If you were only the witness to the crime... ...why would that make you touch your neck like you're in pain?\nPayne:\nWhat's he talking about now!?\nApollo:\nIt was Mr. Smith, the victim who was hit... not you!\nOlga:\nUh... Uhmmm...\nPayne:\n\nPayne:\nThis is a cross-examination, not a cross-wild-conjecture! Th-The witness's... \"habits\"!? They're completely irrelevant!\nKristoph:\nJustice... I'll admit, I'm a bit confused myself. This is certainly a... unique cross-examination.\nApollo:\nI'll explain later! Just, trust me. Now's our only chance to break her! Ms. Orly! Please testify, in detail, about the moment of the crime. The very moment!\nOlga:\nNy-Nyet. I am knowing nothing.\nPayne:\n...\nJudge:\n...\nApollo:\n... Um, we know you're not Russian.\nJudge:\nThe witness will testify, please. Now.\nOlga:\nBah. Fine!\nChanges statement from \"It wasn't me who hit Smith! It was that no-good, cheating defendant!\" to \"He's the one who did it! I didn't let him out of my sight until the cops got there!\"\n\n\n\n\nNo need\n\n\n\n\n\n\n\nApollo:\n(Nah... I'm just seeing things.) Sorry, it's nothing. Please continue the testimony. (What was that? A dizzy spell? I gotta relax...)\nLeads back to cross-examinationPress (after changing fifth statement)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou're hiding something, and that habit of yours proves it!\nOlga:\nHah! Ludicrous! I'm not h-hiding anything!\nApollo:\nYou touched your neck again.\nOlga:\nAck!\nApollo:\nIt's no use trying to hide it. I can see right through you.\nOlga:\n...Olga:\nIt wasn't me who hit Smith! It was that no-good, cheating defendant!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nLet me ask, how's your eyesight?\nOlga:\nJust who do you think you're talking to? They don't call me \"Quick-Fingers\" for nothing. I'm a pro. Which means my dealing's pro, and my eyesight... is pro!\nPayne:\nHonestly, she'd have to be blind as a bat to miss something in that small room.\nApollo:\n(Yeah, but Mr. Wright didn't have a motive to hit the victim! Hmm...)Olga:\nHe's the one who did it! I didn't let him out of my sight until the cops got there!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou seem... uneasy.\nOlga:\nYou try standing up here! (Changed from [You try sitting up here!] in the original release)\nApollo:\n(Her eyes are darting all over the place... I must be getting warm!) Tell me... After the crime, what was the defendant like?\nOlga:\nUh. Well... He must have been stunned by the weight of his crime! He sat in a daze at that table ...until the cops came.\nKristoph:\nIntriguing... I believe you've gotten all the testimony you're going to get out of this witness. So, what do you think about her testimony?\nApollo:\nI'll tell you what I think! Her testimony is..\n\n\n\nFlawed\n\n\n\n\n\n\n\nApollo:\n...is basically bogus. It contradicts the evidence!\nPayne:\nWh-What's that!?\nJudge:\nWell... Show us this evidence, Mr. Justice! This evidence that you claim contradicts the testimony!\nApollo:\n(She didn't let him out of her sight until the cops got there... I know there's some evidence that contradicts that!)\n\n\n\nPresent Wright's Cell Phone\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Ms. Orly! We have a record here that clearly contradicts what you said!\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThis, Your Honor, is the evidence that contradicts her testimony!\nJudge:\n... Well, Mr. Payne?\nPayne:\nTsk. Who would have thought that Justice could be so wrong! He's the guilty one!\nApollo:\n(Gah! Me!?)\nJudge:\n...Mr. Justice. You might want to think about your future before doing that again.\nApollo:\n(Ouch. That one hurt...)\nLeads back to cross-examination\n\n\n\n\n\nFine\n\n\n\n\n\n\n\nApollo:\n...pretty good, really. I'd be upset too at the scene of a crime like that. Yeah, I can picture my mind going blank, staring listlessly...\nKristoph:\nYes, I am picturing you doing that right now. As for our defendant, he is an experienced trial lawyer... He's seen a lot in his day.\nLeads back to cross-examinationPresent Wright's Cell Phone\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Ms. Orly! We have a record here that clearly contradicts what you said!\"Apollo:\n(Different personality... but the same testimony.)Kristoph:\nI believe you have her where you want her, Justice. The circumstances have changed yet her testimony has not. That means...Apollo:\nThere's got to be a contradiction in there!Kristoph:\nQuite.Apollo:\nMs. Orly! We have a record here that clearly contradicts what you said! It states that the police were alerted by a report from the defendant!Olga:\nEh...Apollo:\nAnd we know that the defendant left the room, climbed the stairs... ...and made that phone call from the first floor of the Borscht Bowl Club!Olga:\nAck!Apollo:\nSo, explain how you kept your eyes on the defendant... ...when he left the room entirely!Olga:\nEeeeeeeeek! ...The man who picked up a bottle and swung it that night... wasn't the defendant.Showdown time....You dirty cheat!Check his pockets, now!I-It's gone! The card's gone!...You lose.Auuuuuuuuuugh!Olga:\nJust then, Smith grabbed the bottle from next to Wright... ...and he hit me!Y-You--! Some master of cheating you turned out to be!!!Eeeeeeeeeeeek!Olga:\nWhen I came to...Judge:\nThe victim was already dead... Is that it?Olga:\nThat's why I couldn't reveal who I really was. If it came out that I was in league with Smith, I'd be a suspect for sure!Judge:\n...Apollo:\n...Payne:\n...Judge:\nWell. Where does this leave us?Payne:\nM-Madness. Th-This is madness! I'm dreaming! It must have been me who was hit with a bottle and I'm imagining all of this!Judge:\nIt appears our prosecution is at his wit's end, and frankly, I can't blame him. Mr. Gavin, what do you think about this turn of events?Kristoph:\n...Apollo:\nM-Mr. Gavin? Sir?Kristoph:\nI believe that, as the defense in this case... ...we are compelled to call Ms. Orly a \"big, fat liar\".Olga:\nWh-Whaaaaat!?Kristoph:\nThree were in that room the night of the murder: the defendant, victim, and her. ...And she has a motive.Apollo:\nA motive?Kristoph:\nHer plot foiled, the witness got into an argument with her client, Mr. Smith. And the denouement of that argument... was murder!Olga:\nWhat!? I didn't... I'm no killer! It's a trap! Someone's trying to frame me!Phoenix:\nHeh heh heh... What tangled webs we weave when we practice to deceive. So tangled, we catch ourselves in the process.Judge:\nM-Mr. Wright?Phoenix:\nSuch a hasty conclusion... It's not like you, Kristoph Gavin.Kristoph:\nWhat are you saying?Phoenix:\nWhy not consider the other possibility? ...That there was another person in the room at the time of the murder?Apollo:\n(Right, like Mr. Wright was saying before recess!)Phoenix:\nA single card was swapped into the victim's hand after the murder. And the one who swapped the card didn't know two colors of cards were being used. ...A fourth person.Payne:Payne:\nHah, this theory again! Your \"fourth person\" doesn't exist!Phoenix:\nIndeed. That's why I decided to bring this case to court. Here, where there's no escape, and no chance for deception... The perfect place to catch the real criminal.Judge:\nThe r-real criminal?Phoenix:\nAnd, we're in luck. A clue to the real criminal's identity was kindly provided for us. And right at the beginning of the trial, no less.Payne:\nWh-Whaaaat!?Phoenix:\nApollo... perhaps you know what I'm talking about?Apollo:\nUm... sorry.Phoenix:\nRemember what I said. The fourth person who swapped the cards made one critical error.Apollo:\nHe or she wasn't considering the color on the backs of the cards...Phoenix:\nRight. But how could such an obvious mistake occur? The cards used for the last game were red. Yet, there is one person, here, in our court... ...who thought those cards were blue.Apollo:\n(Yeah, I had that impression, too... But why?)Phoenix:\nWell, Apollo? Think you can figure out who it was?Payne:\nI-It's not me, I swear!Judge:\nWho is this fourth person!?Apollo:\n(Why do I always get put on the spot like this!?)Phoenix:\nLet's hear what the defense has to say. Who was it? Who thought the cards used in the final game were blue?Present Kristoph Gavin profile\n\n\n\n\n\n\n\nApollo:\n\nPhoenix:\n... As I expected. Your eyes and ears are as sharp as your hair.\nApollo:\nI-I was right?\nLeads to:\n\"Kristoph Gavin. You were the fourth person that night.\"Present anyone else\n\n\n\n\n\n\n\nApollo:\n\nPhoenix:\n... Apollo, do you seriously think that?\nJudge:\nI think I'm seriously confused.\nApollo:\nI... I'm seriously sorry. (*gulp* That didn't go well.)\nPhoenix:\nWell, it can't be helped. I almost missed it myself... But it doesn't do anyone any good to turn their eyes away from the truth. Does it... Kristoph?\nKristoph:\n...\nJudge:\nEh? Mr. Gavin?\nApollo:\nYou... You don't mean...\nLeads to:\n\"Kristoph Gavin. You were the fourth person that night.\"Phoenix:\nKristoph Gavin. You were the fourth person that night.Apollo:\nB-But of course Mr. Gavin knows the color of the cards!Phoenix:\n...How would he? As you can see, the photo of the crime scene is black and white. You can't tell which of the cards are blue: the ones on the floor, or the table.Apollo:\nB-But look! You can see the colors in this photo!Phoenix:\nYes, but when he said the cards were \"blue\"... ...it was well before this evidence came to light!Kristoph:\nIt is true that the defendant was engaged in a game of poker with the victim. Yet it was only that: a game, in the purest sense. A competition, Your Honor.Payne:\nA... competition?Kristoph:\nYes, a test of wits, a silent clash of passions... Only the cards, their backs wreathed in blue flame, know its final outcome.Phoenix:\nWell, Kristoph?Kristoph:\n...Apollo:\nMr.... Gavin?Judge:\nMr. Gavin! I-Is something the matter?Kristoph:\nHmm? N-No, nothing. Excuse me, it was just so... sudden. Wright. You aren't seriously accusing me... are you?Phoenix:\nOh, Kristoph? You know even I'd never take a joke this far.Payne:Payne:\nThis has gone beyond ridiculous, beyond dumb... This is insanity! The defendant accusing his own defense attorney of murder?Phoenix:\nI assure you, I'm quite sane.Payne:\nBut what possible connection could Mr. Gavin have to the victim!?Phoenix:\nI wasn't aware that I had a connection to Mr. Smith, either.Payne:\nYes, but Mr. Gavin and the victim have never even met!Phoenix:\nWell... What if they have?Payne:\nHuh...?Phoenix:\nThere is a possibility, after all. They may have met that night, before the game started.Judge:\nWhat are you suggesting!?Apollo:\n(Is this the truth Mr. Wright was staying silent about!? Well, only one thing to do!) Mr. Wright! The defense would like to request that you testify to the court!Kristoph:Kristoph:\nThe defense would like to request no such thing.Apollo:\nMr. Gavin...?Kristoph:\nTestimonies must relate to the case. How could anything happening before that game of poker be related?Judge:\nI'm not sure I follow, Mr. Gavin.Kristoph:\nAs I explained before, the defense believes that Ms. Orly...Judge:\n...Am I to assume you speak for Mr. Justice in this? He is the defense, not you.Kristoph:\n...!Judge:\nMr. Justice. The matter of Mr. Wright's testimony is up to you.Apollo:\nOh... OK. *gulp*Judge:\nDoes the court, in your opinion, need to hear Mr. Wright's testimony?Hear the testimony\n\n\n\n\n\n\n\nApollo:\n(This was Mr. Wright's strategy! He was planning this all along! And I intend to see it through.) ...The defense would like to request that Mr. Wright testify to the court!\nKristoph:\nEt tu, Justice? You would betray me, your teacher?\nApollo:\nI'm sorry, Mr. Gavin. This isn't about loyalty... This is about the truth!\nKristoph:\n...\nJudge:\nVery well. The defendant... Mr. Wright will take the stand, please.\nLeads to Witness TestimonyNo need\n\n\n\n\n\n\n\nApollo:\n(As much as I'd like it to, I guess the testimony isn't related to the case, per se.)\nPhoenix:\nYou heard what the judge said, Apollo?\nApollo:\n...!\nPhoenix:\nIt's your decision. Yours.\nKristoph:\nJustice! You aren't seriously considering...\nApollo:\nI'm sorry, Mr. Gavin... (But now that we've gone this far, we might as well go all the way!) The defense would like to request that Mr. Wright testify to the court!\nJudge:\nVery well. The defendant, er, Mr. Wright will take the stand, please.\nLeads to Witness TestimonyWitness Testimony-- Appetite Before Murder --Phoenix:\nThat evening, Kristoph and I had dinner. We sat at the table in the photograph.\nShadi Smith walked in five minutes after Kristoph left.\nWhen the \"trap\" failed, Smith hit the waitress.\nThe girl was knocked out cold, and Smith was uncontrollable. I left to call the police.\nWhen I returned, he was dead, blood streaming from a cut on his forehead.\nThat's when I made another phone call... To Defense Attorney Gavin.Judge:\nMr. Gavin! You were at the Borscht Bowl Club the night of the murder!?Phoenix:\nI dine with him rather frequently.Payne:\nA-And he talked to the defendant on the phone directly after the murder!?Phoenix:\nQuite against my will, I had become involved in a murder. I thought I might be in need of a lawyer, so I called him.Kristoph:\nYou were planning this all along, weren't you, Wright? Just because you wanted to drag me into your little murder trial...Phoenix:\nThe only thing I want... is the truth. As I did back then... and now.Kristoph:\nI thought my office was doing you a favor when we took on your defense. It appears that I was wrong.Judge:\n...Very well. The defense may cross-examine the witness.Kristoph:\nJustice.Apollo:\nS-Sir!Kristoph:\nHe's lying, and you're going to expose him.Apollo:\nUh... Understood, sir. (Mr. Gavin vs. Mr. Wright... This can't end well. Why can't I have a normal trial!?)Cross ExaminationCross Examination-- Appetite Before Murder --Phoenix:\nThat evening, Kristoph and I had dinner. We sat at the table in the photograph.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou had dinner with Mr. Gavin?\nPhoenix:\nYes, he dines with me at the Borscht Bowl Club quite frequently. We were enjoying a usual dinner at our usual spot... as usual.\nApollo:\n\"Usual\"...?\nPhoenix:\nI always eat at the table closest to the piano.\nJudge:\nI see... Where Mr. Smith was sitting!\nPayne:\nSo, the plates and such on the table were from your dinner?\nPhoenix:\n...Indeed. The remnants of my meal with Kristoph. We dined for two hours, then Kristoph left. After that...Phoenix:\nShadi Smith walked in five minutes after Kristoph left.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nFive minutes? So, the two of them could have passed in the restaurant during that time?\nPhoenix:\nThat would have been a \"fateful encounter\" to be sure.\nPayne:\n\nPayne:\nHee hee hee... Oh, Mr. Wright... What was it you said? Kristoph Gavin and Shadi Smith \"may have met\"...?\nPhoenix:\nI believe I did say that.\nPayne:\nHere I was all nervous about this \"meeting\"...And now we hear they just passed in the hall?\nJudge:\nHmm... That does seem a little weak as a pretense for murder.\nPhoenix:\nOh it would be. If that was all that really happened.\nApollo:\n(C'mon, Mr. Wright... What are you hiding this time!?)Phoenix:\nWhen the \"trap\" failed, Smith hit the waitress.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nAbout this failed \"trap\"... This is the same \"trap\" that Ms. Olga Orly mentioned?\n\n\nOlga:\nThe plan was simple. Elegant, really. You see, we set up a trap of sorts... I was to plant a card in Wright's pocket beforehand... ...and then deal five aces during one of their games. When their hands were revealed, Smith would call him out and search Wright. He would then pull out the planted card and the trap would snap shut!\n\n\nYou swapped the cards!\n\nOlga:\nJust like that, the legend would be dashed to pieces.\n\n\nPhoenix:\nYes... A harmless prank, in essence. It was by a quirk of fate that I happened to discover it...\nPayne:\nA \"quirk\"...?\nPhoenix:\nI happened to put a hand in my pocket... and found a card.\nApollo:\nThe card she planted!\nPhoenix:\nYes, I snuck a peek at it and found it was the Five of Hearts. I had a feeling something might happen so I disposed of the card... before the game.\nJudge:\nDisposed... Where!?\nPhoenix:\nThere was an empty bottle of grape juice I had been drinking right beside me. I threw the card inside the bottle.\nPayne:\nAn empty bottle of grape juice...\nApollo:\nThe murder weapon!?\nPhoenix:\nYes. I rolled it up and shoved it in. The colored glass makes it hard to see.\nJudge:\nHmm... A battle of wits between the deceiver and the would-be deceived! That sounds like terrific drama...\nApollo:\n(A card inside the murder weapon? That's strange... Did the police miss it in their investigation? Maybe I'll take a look...)\nJudge:\nMr. Wright! The \"Poker Head of Courtroom No. 3\" approves of this battle of wits! Please revise your testimony with this new information.\nChanges statement from \"When the \"trap\" failed, Smith hit the waitress.\" to \"I discovered the \"trap\" during the game, and disposed of the card in the bottle.\"Phoenix:\nI discovered the \"trap\" during the game, and disposed of the card in the bottle.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhy in the bottle?\nPhoenix:\nI perceived my opponent's intent immediately. I'm used to entrapment, you see. I knew what was coming.\nJudge:\nHoh hoh... So you struck first! I like that.\nPhoenix:\nI know every trick in the book. They don't work on me.\nApollo:\n(At least, when you get lucky and stick your hand in your pocket they don't.)Present Deadly Bottle (after examining bottom of bottle; before correctly presenting Crime Photo 1)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nUm, Mr. Wright, if I may?\nPhoenix:\nYes?\nApollo:\nI've examined the bottle, and I don't see any card in here.\nPhoenix:\nHmm? No? ...\nJudge:\nWhat, Mr. Wright? Surely \"...\" isn't all you have to say for yourself!?\nPhoenix:\nI can't say that I know what happened to the card. I did put it in that bottle, however.\nApollo:\nHuh...?\nKristoph:\nPerhaps a fifth person came and took it out? Oh, and a sixth person could've helped!\nJudge:\nMr. Gavin... Mr. Wright is your client!\nKristoph:\n...My apologies, Your Honor.\nPayne:\nI won't have you disparaging our investigation, either! We looked inside that bottle. There was nothing!\nApollo:\n(...So what's going on? Is Mr. Wright hoodwinking us again? Or did the card just... disappear?)\nJudge:\nIn any case, please continue the cross-examination. I'm afraid decisive contradictions call for decisive evidence.\nApollo:\nOh.\nKristoph:\nPush him harder, Justice. Break him! It's just you and the witness in the ring. Go for the KO!\nApollo:\n(Ugh. Why do I get the feeling we're not on our client's side anymore?)Present Deadly Bottle (after examining bottom of bottle; after correctly presenting Crime Photo 1)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nUm, Mr. Wright, if I may?\nPhoenix:\nYes?\nApollo:\nI've examined the bottle, and I don't see any card in here.\nPhoenix:\nHmm? No? ...\nJudge:\nWhat, Mr. Wright? Surely \"...\" isn't all you have to say for yourself!?\nPhoenix:\nI can't say that I know what happened to the card. I did put it in that bottle, however.\nApollo:\nHuh...?\nKristoph:\nPerhaps a fifth person came and took it out? Oh, and a sixth person could've helped!\nJudge:\nMr. Gavin... Mr. Wright is your client!\nKristoph:\n...My apologies, Your Honor.\nPayne:\nI won't have you disparaging our investigation, either! We looked inside that bottle. There was nothing!\nApollo:\n(...So what's going on? Is Mr. Wright hoodwinking us again? Or did the card just... disappear?)\nLeads to:\n\"I believe that's enough of that.\"Phoenix:\nThe girl was knocked out cold, and Smith was uncontrollable. I left to call the police.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou made the call to the police from the first floor of the restaurant, correct?\nPhoenix:\nExactly. Cell phones don't get a signal down in the Hydeout.\nApollo:\nWas anyone else on the first floor at that time?\nPhoenix:\nNot a soul. It was the middle of the night, after all. So there, in the darkened restaurant, I called the cops. After making the call, I returned to the Hydeout. It didn't seem right to leave the injured waitress alone.Phoenix:\nWhen I returned, he was dead, blood streaming from a cut on his forehead.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nAnd when you returned, the victim was already...\nPhoenix:\nDead, yes. I'll admit, I was a little startled when I walked in.\nJudge:\nA... \"little\"?\nPhoenix:\nHe was bleeding from his forehead, after all.\nApollo:\n(I guess I'd be startled, too, if I walked in on a scene like that.)Present Crime Photo 1 (before correctly presenting Deadly Bottle)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nMr. Wright, if I may.\nPhoenix:\nYes?\nApollo:\nTake a look at this photograph of the crime scene. See the victim here? He's wearing a hat. ...I wouldn't think you could see blood on his forehead.\nPhoenix:\n... Good point.\nKristoph:\nJustice! Next time you point out an inconsistency, put a little more \"oomph\" into it.\nJudge:\nMr. Wright. Can you explain this to the court?\nPhoenix:\nAh... I forgot to mention something. I was the one who put that hat on his head.\nApollo:\nEh...?\nPayne:\nYou...?\nJudge:\nYou put the hat on the dead man's head?\nPhoenix:\nHe wore it through our entire poker game. After calling the police, when I returned to the scene, his head was in full view. Shining bright... Just like in this photograph.\nJudge:\nAnd...?\nPhoenix:\nI picked his hat up off the floor and put it on his head.\nPayne:\nWh-Wh-Why'd you do a thing like that!?\nPhoenix:\nAll I can say is... I'm sorry. But that's the only thing I touched at the crime scene.\nApollo:\nSo... Ms. Orly didn't see it? \"It\" being the victim's... er, his head.\nPhoenix:\nI'd think not. She was out cold. I believe I was the only one who witnessed his head.\nKristoph:\nAh, here we go again...\nApollo:\nMr. Gavin?\nKristoph:\nAhem. Pardon. It just seems that our client is determined to lie his way through this case.\nJudge:\nHmm...\nApollo:\n(H-Hey, he's still our client! ...Isn't he?)\nJudge:\nIn any case, please continue the cross-examination. I'm afraid decisive contradictions call for decisive evidence.\nApollo:\nOh.\nKristoph:\nPush him harder, Justice. Break him! It's just you and the witness in the ring. Go for the KO!\nApollo:\n(Ugh. Why do I get the feeling we're not on our client's side anymore?)\nLeads back to cross-examinationPresent Crime Photo 1 (after correctly presenting Deadly Bottle)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nMr. Wright, if I may.\nPhoenix:\nYes?\nApollo:\nTake a look at this photograph of the crime scene. See the victim here? He's wearing a hat. ...I wouldn't think you could see blood on his forehead.\nPhoenix:\n... Good point.\nKristoph:\nJustice! Next time you point out an inconsistency, put a little more \"oomph\" into it.\nJudge:\nMr. Wright. Can you explain this to the court?\nPhoenix:\nAh... I forgot to mention something. I was the one who put that hat on his head.\nApollo:\nEh...?\nPayne:\nYou...?\nJudge:\nYou put the hat on the dead man's head?\nPhoenix:\nHe wore it through our entire poker game. After calling the police, when I returned to the scene, his head was in full view. Shining bright... Just like in this photograph.\nJudge:\nAnd...?\nPhoenix:\nI picked his hat up off the floor and put it on his head.\nPayne:\nWh-Wh-Why'd you do a thing like that!?\nPhoenix:\nAll I can say is... I'm sorry. But that's the only thing I touched at the crime scene.\nApollo:\nSo... Ms. Orly didn't see it? \"It\" being the victim's... er, his head.\nPhoenix:\nI'd think not. She was out cold. I believe I was the only one who witnessed his head.\nKristoph:\nAh, here we go again...\nApollo:\nMr. Gavin?\nKristoph:\nAhem. Pardon. It just seems that our client is determined to lie his way through this case.\nJudge:\nHmm...\nApollo:\n(H-Hey, he's still our client! ...Isn't he?)\nLeads to:\n\"I believe that's enough of that.\"Phoenix:\nThat's when I made another phone call... To Defense Attorney Gavin.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nCould you explain why you called Mr. Gavin...?\nPhoenix:\nI'd obviously gotten involved in a rather... sticky affair. And I figured Kristoph's law offices would give me a friend rate for my defense fees...\nKristoph:\nAh, glad to hear you intend to pay.\nPhoenix:\nOh, I'll pay in full, Kristoph. It was I who got you involved, after all.\nKristoph:\n...You may find the price of your defense quite high, my good friend. Quite high.Apollo:\n(Is this the \"truth\" that Mr. Wright was talking about?)Kristoph:\nJustice, you know what you have to do.Kristoph:\nHe's lying. Expose him. Now.Apollo:\nY-Yes, sir... (I have to think! What's Mr. Wright trying to tell me with this testimony? The truth has to be in there somewhere!)",
      "testimonies": [
        {
          "testimony": "That evening, Kristoph and I had dinner. We sat at the table in the photograph.",
          "person": "Phoenix",
          "present": []
        },
        {
          "testimony": "Shadi Smith walked in five minutes after Kristoph left.",
          "person": "Phoenix",
          "present": []
        },
        {
          "testimony": "When the \"trap\" failed, Smith hit the waitress.",
          "person": "Phoenix",
          "present": []
        },
        {
          "testimony": "I discovered the \"trap\" during the game, and disposed of the card in the bottle.",
          "person": "Phoenix",
          "present": [
            "Deadly Bottle"
          ],
          "source": {
            "evidence_span": "The bottle is empty.",
            "testimony_span": "disposed of the card in the bottle",
            "explanation": "If the witness did dispose the card in the bottle, it would be inside the bottle. However, the bottle is empty.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "The girl was knocked out cold, and Smith was uncontrollable. I left to call the police.",
          "person": "Phoenix",
          "present": []
        },
        {
          "testimony": "When I returned, he was dead, blood streaming from a cut on his forehead.",
          "person": "Phoenix",
          "present": [
            "Crime Photo 1"
          ],
          "source": {
            "evidence_span": "He is wearing a hat which covers his eyes and forehead.",
            "testimony_span": "blood streaming from a cut on his forehead",
            "explanation": "Since the hat covers the victim's forehead, it is impossible to see if there is a cut on his forehead.",
            "is_self_contained": "yes",
            "context_span": "",
            "isMultimodal": true
          }
        },
        {
          "testimony": "That's when I made another phone call... To Defense Attorney Gavin.",
          "person": "Phoenix",
          "present": []
        }
      ],
      "noPresent": false,
      "summarized_context": "The defendant Phoenix describes what he saw after he returned from calling the police.",
      "labels": [
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims he saw a cut on the victim's forehead.",
        "Fact 2: The evidence suggests the victim's forehead is covered by his hat.",
        "Prop 1: If a body part is covered by an object, it is impossible to see any injuries on that body part."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- Appetite Before Murder --Phoenix:\nThat evening, Kristoph and I had dinner. We sat at the table in the photograph.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou had dinner with Mr. Gavin?\nPhoenix:\nYes, he dines with me at the Borscht Bowl Club quite frequently. We were enjoying a usual dinner at our usual spot... as usual.\nApollo:\n\"Usual\"...?\nPhoenix:\nI always eat at the table closest to the piano.\nJudge:\nI see... Where Mr. Smith was sitting!\nPayne:\nSo, the plates and such on the table were from your dinner?\nPhoenix:\n...Indeed. The remnants of my meal with Kristoph. We dined for two hours, then Kristoph left. After that...Phoenix:\nShadi Smith walked in five minutes after Kristoph left.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nFive minutes? So, the two of them could have passed in the restaurant during that time?\nPhoenix:\nThat would have been a \"fateful encounter\" to be sure.\nPayne:\n\nPayne:\nHee hee hee... Oh, Mr. Wright... What was it you said? Kristoph Gavin and Shadi Smith \"may have met\"...?\nPhoenix:\nI believe I did say that.\nPayne:\nHere I was all nervous about this \"meeting\"...And now we hear they just passed in the hall?\nJudge:\nHmm... That does seem a little weak as a pretense for murder.\nPhoenix:\nOh it would be. If that was all that really happened.\nApollo:\n(C'mon, Mr. Wright... What are you hiding this time!?)Phoenix:\nWhen the \"trap\" failed, Smith hit the waitress.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nAbout this failed \"trap\"... This is the same \"trap\" that Ms. Olga Orly mentioned?\n\n\nOlga:\nThe plan was simple. Elegant, really. You see, we set up a trap of sorts... I was to plant a card in Wright's pocket beforehand... ...and then deal five aces during one of their games. When their hands were revealed, Smith would call him out and search Wright. He would then pull out the planted card and the trap would snap shut!\n\n\nYou swapped the cards!\n\nOlga:\nJust like that, the legend would be dashed to pieces.\n\n\nPhoenix:\nYes... A harmless prank, in essence. It was by a quirk of fate that I happened to discover it...\nPayne:\nA \"quirk\"...?\nPhoenix:\nI happened to put a hand in my pocket... and found a card.\nApollo:\nThe card she planted!\nPhoenix:\nYes, I snuck a peek at it and found it was the Five of Hearts. I had a feeling something might happen so I disposed of the card... before the game.\nJudge:\nDisposed... Where!?\nPhoenix:\nThere was an empty bottle of grape juice I had been drinking right beside me. I threw the card inside the bottle.\nPayne:\nAn empty bottle of grape juice...\nApollo:\nThe murder weapon!?\nPhoenix:\nYes. I rolled it up and shoved it in. The colored glass makes it hard to see.\nJudge:\nHmm... A battle of wits between the deceiver and the would-be deceived! That sounds like terrific drama...\nApollo:\n(A card inside the murder weapon? That's strange... Did the police miss it in their investigation? Maybe I'll take a look...)\nJudge:\nMr. Wright! The \"Poker Head of Courtroom No. 3\" approves of this battle of wits! Please revise your testimony with this new information.\nChanges statement from \"When the \"trap\" failed, Smith hit the waitress.\" to \"I discovered the \"trap\" during the game, and disposed of the card in the bottle.\"Phoenix:\nI discovered the \"trap\" during the game, and disposed of the card in the bottle.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhy in the bottle?\nPhoenix:\nI perceived my opponent's intent immediately. I'm used to entrapment, you see. I knew what was coming.\nJudge:\nHoh hoh... So you struck first! I like that.\nPhoenix:\nI know every trick in the book. They don't work on me.\nApollo:\n(At least, when you get lucky and stick your hand in your pocket they don't.)Present Deadly Bottle (after examining bottom of bottle; before correctly presenting Crime Photo 1)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nUm, Mr. Wright, if I may?\nPhoenix:\nYes?\nApollo:\nI've examined the bottle, and I don't see any card in here.\nPhoenix:\nHmm? No? ...\nJudge:\nWhat, Mr. Wright? Surely \"...\" isn't all you have to say for yourself!?\nPhoenix:\nI can't say that I know what happened to the card. I did put it in that bottle, however.\nApollo:\nHuh...?\nKristoph:\nPerhaps a fifth person came and took it out? Oh, and a sixth person could've helped!\nJudge:\nMr. Gavin... Mr. Wright is your client!\nKristoph:\n...My apologies, Your Honor.\nPayne:\nI won't have you disparaging our investigation, either! We looked inside that bottle. There was nothing!\nApollo:\n(...So what's going on? Is Mr. Wright hoodwinking us again? Or did the card just... disappear?)\nJudge:\nIn any case, please continue the cross-examination. I'm afraid decisive contradictions call for decisive evidence.\nApollo:\nOh.\nKristoph:\nPush him harder, Justice. Break him! It's just you and the witness in the ring. Go for the KO!\nApollo:\n(Ugh. Why do I get the feeling we're not on our client's side anymore?)Present Deadly Bottle (after examining bottom of bottle; after correctly presenting Crime Photo 1)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nUm, Mr. Wright, if I may?\nPhoenix:\nYes?\nApollo:\nI've examined the bottle, and I don't see any card in here.\nPhoenix:\nHmm? No? ...\nJudge:\nWhat, Mr. Wright? Surely \"...\" isn't all you have to say for yourself!?\nPhoenix:\nI can't say that I know what happened to the card. I did put it in that bottle, however.\nApollo:\nHuh...?\nKristoph:\nPerhaps a fifth person came and took it out? Oh, and a sixth person could've helped!\nJudge:\nMr. Gavin... Mr. Wright is your client!\nKristoph:\n...My apologies, Your Honor.\nPayne:\nI won't have you disparaging our investigation, either! We looked inside that bottle. There was nothing!\nApollo:\n(...So what's going on? Is Mr. Wright hoodwinking us again? Or did the card just... disappear?)\nLeads to:\n\"I believe that's enough of that.\"Phoenix:\nThe girl was knocked out cold, and Smith was uncontrollable. I left to call the police.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou made the call to the police from the first floor of the restaurant, correct?\nPhoenix:\nExactly. Cell phones don't get a signal down in the Hydeout.\nApollo:\nWas anyone else on the first floor at that time?\nPhoenix:\nNot a soul. It was the middle of the night, after all. So there, in the darkened restaurant, I called the cops. After making the call, I returned to the Hydeout. It didn't seem right to leave the injured waitress alone.Phoenix:\nWhen I returned, he was dead, blood streaming from a cut on his forehead.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nAnd when you returned, the victim was already...\nPhoenix:\nDead, yes. I'll admit, I was a little startled when I walked in.\nJudge:\nA... \"little\"?\nPhoenix:\nHe was bleeding from his forehead, after all.\nApollo:\n(I guess I'd be startled, too, if I walked in on a scene like that.)Present Crime Photo 1 (before correctly presenting Deadly Bottle)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nMr. Wright, if I may.\nPhoenix:\nYes?\nApollo:\nTake a look at this photograph of the crime scene. See the victim here? He's wearing a hat. ...I wouldn't think you could see blood on his forehead.\nPhoenix:\n... Good point.\nKristoph:\nJustice! Next time you point out an inconsistency, put a little more \"oomph\" into it.\nJudge:\nMr. Wright. Can you explain this to the court?\nPhoenix:\nAh... I forgot to mention something. I was the one who put that hat on his head.\nApollo:\nEh...?\nPayne:\nYou...?\nJudge:\nYou put the hat on the dead man's head?\nPhoenix:\nHe wore it through our entire poker game. After calling the police, when I returned to the scene, his head was in full view. Shining bright... Just like in this photograph.\nJudge:\nAnd...?\nPhoenix:\nI picked his hat up off the floor and put it on his head.\nPayne:\nWh-Wh-Why'd you do a thing like that!?\nPhoenix:\nAll I can say is... I'm sorry. But that's the only thing I touched at the crime scene.\nApollo:\nSo... Ms. Orly didn't see it? \"It\" being the victim's... er, his head.\nPhoenix:\nI'd think not. She was out cold. I believe I was the only one who witnessed his head.\nKristoph:\nAh, here we go again...\nApollo:\nMr. Gavin?\nKristoph:\nAhem. Pardon. It just seems that our client is determined to lie his way through this case.\nJudge:\nHmm...\nApollo:\n(H-Hey, he's still our client! ...Isn't he?)\nJudge:\nIn any case, please continue the cross-examination. I'm afraid decisive contradictions call for decisive evidence.\nApollo:\nOh.\nKristoph:\nPush him harder, Justice. Break him! It's just you and the witness in the ring. Go for the KO!\nApollo:\n(Ugh. Why do I get the feeling we're not on our client's side anymore?)\nLeads back to cross-examinationPresent Crime Photo 1 (after correctly presenting Deadly Bottle)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nMr. Wright, if I may.\nPhoenix:\nYes?\nApollo:\nTake a look at this photograph of the crime scene. See the victim here? He's wearing a hat. ...I wouldn't think you could see blood on his forehead.\nPhoenix:\n... Good point.\nKristoph:\nJustice! Next time you point out an inconsistency, put a little more \"oomph\" into it.\nJudge:\nMr. Wright. Can you explain this to the court?\nPhoenix:\nAh... I forgot to mention something. I was the one who put that hat on his head.\nApollo:\nEh...?\nPayne:\nYou...?\nJudge:\nYou put the hat on the dead man's head?\nPhoenix:\nHe wore it through our entire poker game. After calling the police, when I returned to the scene, his head was in full view. Shining bright... Just like in this photograph.\nJudge:\nAnd...?\nPhoenix:\nI picked his hat up off the floor and put it on his head.\nPayne:\nWh-Wh-Why'd you do a thing like that!?\nPhoenix:\nAll I can say is... I'm sorry. But that's the only thing I touched at the crime scene.\nApollo:\nSo... Ms. Orly didn't see it? \"It\" being the victim's... er, his head.\nPhoenix:\nI'd think not. She was out cold. I believe I was the only one who witnessed his head.\nKristoph:\nAh, here we go again...\nApollo:\nMr. Gavin?\nKristoph:\nAhem. Pardon. It just seems that our client is determined to lie his way through this case.\nJudge:\nHmm...\nApollo:\n(H-Hey, he's still our client! ...Isn't he?)\nLeads to:\n\"I believe that's enough of that.\"Phoenix:\nThat's when I made another phone call... To Defense Attorney Gavin.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nCould you explain why you called Mr. Gavin...?\nPhoenix:\nI'd obviously gotten involved in a rather... sticky affair. And I figured Kristoph's law offices would give me a friend rate for my defense fees...\nKristoph:\nAh, glad to hear you intend to pay.\nPhoenix:\nOh, I'll pay in full, Kristoph. It was I who got you involved, after all.\nKristoph:\n...You may find the price of your defense quite high, my good friend. Quite high.Apollo:\n(Is this the \"truth\" that Mr. Wright was talking about?)Kristoph:\nJustice, you know what you have to do.Kristoph:\nHe's lying. Expose him. Now.Apollo:\nY-Yes, sir... (I have to think! What's Mr. Wright trying to tell me with this testimony? The truth has to be in there somewhere!)Kristoph:\nI believe that's enough of that.Apollo:\nUh, Mr. Gavin?Kristoph:\nThis witness's \"testimony\" is more like a \"travesty\". It's riddled with lies. I'm beginning to see how you came to lose your attorney's badge seven years ago...Phoenix:\nWell. You certainly have a unique way of treating your clients, Kristoph. I never knew.Kristoph:\nI believe it was you who threw the first stone...?Apollo:\nMr. Wright! If you intend to ever tell the truth about this case... It's now or never!Phoenix:\nDon't be misled... I haven't told a single lie here.Apollo:\nEh...?Phoenix:\nWhen I noticed the \"trap\"... I put the card in the bottle to dispose of it. And when I put the hat on the victim's head... Let's just say I had a reason for doing that as well.Judge:\nA... reason?Phoenix:\nThat reason... is right here.Apollo:\nYour... cell phone?Phoenix:\nThat night... Recall that I spoke with Defense Attorney Gavin after calling the police. Just in case, I recorded our conversation.Kristoph:\nWhat's this...?Phoenix:\nNow that we're all here, I see no reason why I shouldn't play it back for the court.Phoenix:\nKristoph. I seem to be in a bit of trouble.Kristoph:\nWhat's this? Game not going well?Phoenix:\nSomething like that.Kristoph:\nThat gentleman who challenged you... He turn out to be good?Phoenix:\nHe turned out to be dead. Someone hit him. Hard.Kristoph:\nYou mean someone cracked that flawless bone china pate? It... wasn't you, was it?Phoenix:\nMe? Please. The cops should be here any minute. I'm in your hands... Should it come to that.Apollo:\n\"Bone china plate\"...?Phoenix:\nA kind of porcelain, very smooth and shiny. And not \"plate\", but \"pate\". I believe he was referring to a certain gentleman's balding forehead.Judge:\nHmm... The court appreciates the defendant's discretion in not indicating my forehead.Apollo:\n(Wait a second... Something's not right about that phone call!) So, after Mr. Gavin ate dinner with you... ...he left the Borscht Bowl Club?Phoenix:\nMost certainly.Apollo:\nThen... Then how did he know? When did he see this \"bone china pate\"?Judge:\nOh... That's right!Phoenix:\nYes... That was when I began to see my good friend in a different light.Kristoph:\n...Phoenix:\nTroubled, I returned to the crime scene. And when I spotted Mr. Smith's head again, I realized exactly what was wrong. Well, Mr. Gavin. The stage has been set. Perhaps you would like to explain this to the court? Exactly how did you come by your privileged knowledge of the victim's head?Kristoph:\n... So, this is your \"reason\". The reason why you put the victim's hat back on.Phoenix:\nYour point, Mr. Gavin?Kristoph:\n...It's come down to this, has it... Phoenix Wright.Judge:\nOrder! I will have order!!! Mr. Payne!Payne:\nY-Yes, Your Honor!Judge:\nI believe this court has been left with no other choice... Are you prepared to hear Defense Attorney Gavin's testimony?Payne:\nEh? Ah... Urk? Ahem! Well, as the prosecutor, I...Judge:\n...Very well! We'll break for ten minutes. After which Mr. Gavin will take the stand for a cross-examination! ...Are we all clear on that?Kristoph:\nCrystal clear, Your Honor.Judge:\nVery well! This will be the final recess for the day.April 20, 2:32 PMDistrict CourtDefendant Lobby No. 3Apollo:\n(Mr. Gavin and Mr. Wright are both in the judge's chamber! Who'd have thought today would turn out like this!?)???:\n...May I?Apollo:\nHuh? What????:\nHello, sir. Please, pick a card.Apollo:\n(Wh-What's all this about?) Uh... Is this one OK????:\n...Excellent. I have a message for you. \"The last hand is about to be played. You'll need a trump card to make it.\"Apollo:\nA trump card...????:\n\"The card you have chosen is magical. Use it wisely, and the game is yours.\" That's all.Apollo:\n(An ace... Where do I remember that card from?)Olga:\nMr. Smith's hand has three aces, and Mr. Wright's two. ...It is five aces in all.Olga:\nIt is true... I have seen it! The fifth ace! There was cheating, I swear to you.Apollo:\n(The missing fifth ace! Wait... This blotch of red... Is this blood?)???:\nYou have your trump card. Now it's up to you to cut the deck and draw... the truth. My father's fate is in your hands. I know you can do it!Apollo:\nThis blood-stained card... is my trump card for finding the truth?Apollo:\n(I fell deep into thought as my mind raced to understand what this all meant. That girl... I'd seen her recently... But where? That's when I made the connection...)Bloody Ace added to the Court Record.Examine evidence\n\n\n\n\n\n\n\n\n\nBloody Ace\n\n\n\n\n\n\n\n\n\nBloodstain\n\n\n\n\n\n\n\nApollo:\nA single drop of blood marks the front of the card.April 20, 2:45 PMDistrict CourtCourtroom No. 2Judge:\nCourt will now reconvene. Defense Attorney Kristoph Gavin, will you please take the stand.Judge:\nNow then, if you would, Mr. Payne.Payne:\nY-Y-Yes, Your Honor! Erm, will Mr.... er, the witness state his name and occupation?Kristoph:\nIs this farce necessary, Your Honor?Judge:\nBelieve me, far stranger things have gone on in this courtroom.Kristoph:\n...Fine, I'll play along.Judge:\nFirst, there's one thing we need to have made clear. How did you know about the \"secret\" beneath the victim's hat?Apollo:\n(By \"secret\", I'm guessing he means the fact that Mr. Smith was bald.)Kristoph:\nForgive my curiosity, but what is it about this fellow's head? Your Honor seems to have an inordinate interest in it.Phoenix:Phoenix:\nI wouldn't call it inordinate, Mr. Gavin.Apollo:\nM-Mr. Wright!Kristoph:\nWhat do you think you're doing, Wright?Phoenix:\nWow, things sure look different from the other side. You know what I mean, Apollo? Speaking of \"looking from the other side\", let's consider something for a second. The victim wore that hat all night, never once taking it off, except for that one time.Apollo:\nThat one time... being the instant he was hit!Judge:\nOh...!Apollo:\nWhen Mr. Wright returned from reporting the crime, the hat was lying on the floor. Mr. Wright picked it up, and placed it on the victim's head... In other words, in order to have seen Mr. Smith's bald head... ...you would've had to have been there in the Hydeout... at the time of the crime! (Changed from [...you would have had to be at the scene of the crime... at the time of the crime!] in the original release)Kristoph:\nIn other words, I must be the real killer... is what you're trying to say. (Changed from [In other words, you'd have to be the real killer... is what you're trying to say.] in the original release)Phoenix:\n... Not bad, Apollo.Kristoph:\nEh heh heh...Judge:\nMr. Gavin...?Kristoph:\n...I'm afraid that I haven't been entirely honest with the court.Payne:\nWh-What!?Kristoph:\n...Oh, I assure you, I had the noblest of intentions. I did it all... to protect my client, Mr. Wright.Apollo:\n...!Kristoph:\nYet, I'm afraid in the current situation I see little reason to hide anything. ...Very well. Allow me to tell you the truth of what happened that night.Judge:\nFinally! You may begin your testimony. Tell us... How were you involved in the events of that fateful night?Witness Testimony-- That Fateful Night --Kristoph:\nThe rage I sensed in that man that night troubled me... So I returned to the club.\nI went down to the basement and peeked in through the little window to the Hydeout.\nIt must have been right after the murder took place.\nThe victim was dead, as he appears in the photo.\nA bald head, an unconscious girl... and Wright, holding a bottle in his hand.\nI sensed that was not the best place for me to be at the time and so I left.\nThat's when the call came from Wright.Payne:\nSo... you witnessed the murder!?Kristoph:\nFor better or worse, I missed the actual moment of the deed.Judge:\nMr. Gavin, may I remind you that you are on Mr. Wright's defense team... Your testimony is clearly disadvantageous to your client!Kristoph:\nWhat else could I say? I'm standing on the witness stand, after all.Phoenix:\n...So you are, Mr. Gavin.Kristoph:\n...?Phoenix:\nAnd you had to testify as you just did... You had to tell them you saw the scene of the crime through that little window...Apollo:\nUh, Mr. Wright?Phoenix:\nYou had to say that... ...because that was the only probable window of opportunity. Right, Apollo?Apollo:\nOh...Judge:\nMr. Wright, the defense should do the cross-examination, not the defendant! Mr. Justice, are you prepared?Apollo:\nYes, Your Honor... (I can't believe I'm going up against Mr. Gavin... This trial is getting weirder and weirder!)Cross ExaminationCross Examination-- That Fateful Night --Kristoph:\nThe rage I sensed in that man that night troubled me... So I returned to the club.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\n\"That man\"... You mean Mr. Smith?\nKristoph:\nHe was different from the other customers... His aura, shall we say. I knew he was a serious poker player... but it was more than that.\nPayne:\nSo then, you knew the true nature of your client's job!?\nKristoph:\nOf course. But I also knew he wasn't engaged in gambling, which would be illegal.\nApollo:\n(Well, it makes sense that he'd know. They were friends, after all.)\nKristoph:\nWorried for my friend, I returned to the club. You see, I feared this Mr. Smith might be someone coming to settle an old score.\nJudge:\nI see. What happened then?Kristoph:\nI went down to the basement and peeked in through the little window to the Hydeout.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThe little window... You mean the one used to keep watch up the stairs?\nKristoph:\nYes, a relic of the ancient past. The black marketeers used it, I believe.\nApollo:\nWhy did you go through the trouble of peeking in through the window? Wouldn't it have been easier to just open the door and go into the room?\nKristoph:\n... I didn't want to upset Wright, you see.\nApollo:\nUpset Mr. Wright?\nKristoph:\nYes. What if my fears had been unfounded? I'd be walking in on their match! Bad form, to say the least.\nApollo:\n(Hmm... So far, everything he's saying makes sense.)Kristoph:\nIt must have been right after the murder took place.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHow do you know it was \"right after\" the murder!?\nKristoph:\nReally, no need to shout, Justice.\nApollo:\nUrk...\nKristoph:\nI was just getting to that part in my testimony.\nPhoenix:\nAh, there he is! The \"Coolest Defense in the West\" we know and love. Even when you're standing up there on the witness stand... Some things never change.\nKristoph:\nI was afraid you'd changed, too, Wright, but you haven't. You and that overbearing personality of yours...\nApollo:\n(With friends like these, who needs enemies...)Kristoph:\nThe victim was dead, as he appears in the photo.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nBy \"photo\" you mean the second photograph of the crime scene?\nKristoph:\nPrecisely. You see, he wasn't wearing his hat then. I saw his head... when he was dead.\nApollo:\n(And then Mr. Wright came along and replaced his hat.)\nPayne:\nCan you describe the scene of the crime for us?Kristoph:\nA bald head, an unconscious girl... and Wright, holding a bottle in his hand.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThose were the only three at the scene of the crime?\nKristoph:\nYes... As far as I saw, at least.\nPayne:\n...Then we're back where we started. The killer was the defendant, Phoenix Wright! Who else could it have been? But... why didn't you talk to the police?\nKristoph:\nTwo reasons. First, I didn't actually witness the very moment of the crime... Second... My office was asked to defend Wright. Even after seeing what I had seen... I couldn't abandon my friend.\nJudge:\nHmm...\nApollo:\n\nApollo:\nThere must have been someone else there at the moment of the crime!\nKristoph:\nJustice... I just said I saw no one. Not a soul.\nApollo:\nB-But, that goes against what Mr. Wright said!\nKristoph:\nAh yes, this mysterious \"fourth person\"... ...who would conveniently be the \"real killer\", I suppose.\nPhoenix:\nGlad to see we agree, Mr. Gavin.\nKristoph:\nLet me pose a question, then. Tell me. What possible reason did the \"real killer\" have to swap cards in the victim's hand?\nApollo:\n...!\nKristoph:\nHmm? Perhaps you can show us a reason why such a thing would be necessary?\nApollo:\n(How can I show something I can't find myself!?)\nPhoenix:\nRemember, Apollo. The card that was swapped out was the fifth ace...\nApollo:\nThe fifth ace... right.\nJudge:\nWell, Mr. Justice? The question of why the killer would swap out a card has been raised. Can you point to a reason?\n\n\n\nShow evidence\n\n\n\n\n\n\n\nApollo:\n(...It's now or never!) The defense would like to present evidence to the court... Evidence showing the reason why a card was swapped out!\nKristoph:\n...\nJudge:\nThen go ahead and point out your reason, Mr. Justice. Why did the killer take the fifth ace!?\n\n\n\nPresent Bloody Ace\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"My reason is... uh... This!\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThe reason is made clear by... this piece of evidence!\nJudge:\n...I'm not sure how that piece of evidence makes anything clear, Mr. Justice.\nKristoph:\nI see now it was wrong of me to field you in a trial so soon, Justice. Wild bluffing, and even wilder accusations... You're almost as bad as another defense attorney I know...\nPhoenix:\n...\nKristoph:\nOh, I'm sure my office's reputation will recover, given time. Once you learn you can't bluff your way through life. Or court.\nApollo:\nUnnngh...\nJudge:\nWould you... like to continue, Mr. Justice?\nApollo:\nYes, Your Honor! (I sure can't let my first trial end like this!)\nLeads back to cross-examination\n\n\n\n\n\nNot yet\n\n\n\n\n\n\n\nApollo:\n...No. Not yet, Your Honor.\nPayne:\n\"Not yet\"!? Hah! Pathetic! Not yet? Try not ever!\nJudge:\nHmm... Well, Mr. Gavin?\nKristoph:\nOh, I'm willing to wait for as long as it takes.\nApollo:\n(Great! I don't even know what the heck I'm looking for...)\nPhoenix:\n...Apollo.\nApollo:\nY-Yes, sir!\nPhoenix:\nDon't forget... You already know the answer. You just don't realize it yet.\nApollo:\nI... already know the answer?\nPhoenix:\nTake a moment to think it over again... OK?\nLeads back to cross-examinationKristoph:\nI sensed that was not the best place for me to be at the time and so I left.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWouldn't it have been better to wait for the police to arrive?\nKristoph:\nRemember though. By that time, I was already Wright's defense attorney. It wouldn't do for me to become part of the investigation.\nApollo:\n(That makes sense... or does it? ...I'm confused.)\nPayne:\nWell, what happened next?Kristoph:\nThat's when the call came from Wright.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhere were you when the phone call came?\nKristoph:\nI had already left the Borscht Bowl Club by that time. On the phone he asked me to defend him. Naturally, I was surprised. I accepted, however. I couldn't abandon him.\nPhoenix:\nSo kind of you.\nApollo:\n(Hmm... So far, everything jives with Mr. Wright's testimony... I think.)Phoenix:\nIs it going to be a problem for you to cross-examine your own boss?Apollo:\nI... I'm fine! (Who was it that taught me never to pull punches in cross-examination? It was you, Mr. Gavin! I learned it from watching you!)",
      "testimonies": [
        {
          "testimony": "The rage I sensed in that man that night troubled me... So I returned to the club.",
          "person": "Kristoph",
          "present": []
        },
        {
          "testimony": "I went down to the basement and peeked in through the little window to the Hydeout.",
          "person": "Kristoph",
          "present": []
        },
        {
          "testimony": "It must have been right after the murder took place.",
          "person": "Kristoph",
          "present": []
        },
        {
          "testimony": "The victim was dead, as he appears in the photo.",
          "person": "Kristoph",
          "present": []
        },
        {
          "testimony": "A bald head, an unconscious girl... and Wright, holding a bottle in his hand.",
          "person": "Kristoph",
          "present": []
        },
        {
          "testimony": "I sensed that was not the best place for me to be at the time and so I left.",
          "person": "Kristoph",
          "present": []
        },
        {
          "testimony": "That's when the call came from Wright.",
          "person": "Kristoph",
          "present": []
        }
      ],
      "noPresent": true
    }
  ]
}