{
  "previousContext": "Episode 4\nTurnabout Succession\n...And that is the whole truth of this case. In order to understand it myself... ...I had to know the story of these last seven long years. Nothing happens by chance... All is connected. And now... ..you stand ready to begin the final chapter of this story. Will the defendant be found guilty, or innocent? The decision is yours.\nOctober 7, 10:37 AMWright Anything Agency\nTrucy:\nHey, Apollo! Look, on TV! Look! Look!\nApollo:\nYeah... uh, I'm kinda busy.\nTrucy:\nWhoa! Look at that! He's the last Gramarye, alright! Amazing!\nApollo:\n......\nTrucy:\nApollo, you should be watching this!\nApollo:\nOw ow ow! What? What!? ...I was writing about our last case in my journal.\nTrucy:\nLawyers are supposed to write things in \"records\", Apollo, not journals. And why now? That case was three months ago.\nApollo:\nHey, it's a long story. ...I did a lot, you know. I want to vacuum pack the feel of the moment for later. Right now I'm wowing the crowd by figuring out how Lamiroir disappeared.\nTrucy:\nThat's right! Uncle Valant did that illusion, too! But you're missing him on TV right now!\nApollo:\n*sigh*... I was just getting to the good part. (I suppose I should watch a little TV with her. After all, her father's expecting me to look after her while he's away...)\nAnnouncer:\nWhat you're now seeing is a rehearsal for the greatest magic show on Earth... ...happening right here at our very own Sunshine Coliseum!\nApollo:\nThe Sunshine Coliseum? Hey, that's where the Gavinners concert was!\nAnnouncer:\n...Only three more days until miracles happen here, right before your unbelieving eyes! The legendary Troupe Gramarye is performing for the first time in seven years!\nTrucy:\nThat's going to be great! I'm so there! You and Daddy are coming, too!\nApollo:\n(The legendary Gramaryes... ...If Trucy's real father were still alive... ...he'd be on that stage performing miracles.)\nTrucy:\nI've got the tickets and everything! Here's yours, Apollo.\nMagic Show ticket received.\n...*squeak*...\n???:\nAh, you are here. Working hard or hardly working?\nPhoenix:\nHey! How have you been?\nTrucy:\nHi there, stranger!\nApollo:\n(Not exactly the kind of greeting I'd want to hear from my own kid. Though he has been gone a long time.)\nPhoenix:\nAh ha ha, how goes it, Trucy? Here, I got a present for you.\nTrucy:\nYay! Pudding! I love pudding! Ooh, it's farm-fresh! And not just one pudding, but three whole cups! I'll have to pace myself.\nPhoenix:\nWell, I'm beat.\nTrucy:\nThat's right, Daddy. You're on a top secret mission! You've got to take it easy with the secrets, you know.\nPhoenix:\nAh ha ha. How right you are.\nApollo:\nSo, you still can't tell us what your \"mission\" is?\nPhoenix:\n...... Maybe it is time. It has something to do with you, anyway.\nApollo:\nHuh? With... me?\nTrucy:\nOoh! Maybe you're getting a top secret mission, too! Maybe you can be one of those guys! A spy!\nApollo:\n(Can't I just be a defense attorney...?)\nPhoenix:\nAh ha ha! To be honest... ...telling you about the mission was my whole reason for coming here today.\nApollo:\nWhat...?\nPhoenix:\nTell me... ...you've heard of the Jurist System, yes?\nTrucy:\nThe Jurist System...?\nPhoenix:\nThat's right. The new legal system everyone's talking about.\nTrucy:\nHave you heard of it, Apollo?\nApollo:\nHuh? Uh... Maybe?\nPhoenix:\n...... Maybe not as many people are talking about it as I thought.\nApollo:\n(The \"Jurist System\", huh?)\nAfter clearing \"The Jurist System\" and \"The secret mission\" Talk options:\nApollo:\nSo... what kind of case is the trial simulation about?\nPhoenix:\nWell, since it is the first run through of a new system, I wanted something simple.\nTrucy:\nGood thinking! No sense wearing yourself out on something too serious!\nPhoenix:\nTrue. The case is a murder.\nApollo:\nThat's not simple at all!!\nTrucy:\nBy \"simple\", did you mean that the defendant is...\nPhoenix:\n...Guilty. Yes. Most likely. ...So, good luck, Apollo.\nApollo:\nUm... with what?\nPhoenix:\nWith the trial tomorrow. You're defending, of course. Recall that I said it had something to do with you.\nTrucy:\nGo for it, Apollo! It's just a test case, anyway. No sweat!\nApollo:\nYeah, but there's still a verdict to be decided.\nPhoenix:\n...And a potentially serious sentence. The most serious, in a worst-case scenario.\nApollo:\nAck! You mean... the verdict's for real!? That's not a \"test\" trial! That's a... real trial!\nPhoenix:\nAll the forms have been filed. There's no turning back now. The trial begins tomorrow at 10 AM. Hope you can make room in your schedule.\nApollo:\nWh-Why am I only hearing about this now!?\nPhoenix:\n...Ah, yes. There was a change this morning. ...I picked a new case.\nApollo:\nEh...?\nPhoenix:\n...Something that happened last night.\nAfter clearing \"The trial simulation\" Talk option in Wright Anything Agency:\nOctober 7Detention CenterVisitor's Room\nApollo:\n......\nTrucy:\n......\nApollo:\nThat's 20 minutes we've been waiting here! 20 minutes!\nTrucy:\nMaybe I should complain? I'm sure that guard has better things to do than stand there pretending he doesn't see us.\nApollo:\nYou know the minute we get angry, the client will show. It always works that way.\nTrucy:\nLike shouting, \"Oh, waiter!\" and they're standing right behind you? Oh, guaaaaard! Is our client going to be much longer?\nGuard:\nWhat are you talking about!? Haven't you already started the meeting, yet!?\nTrucy:\n...Huh? Eeeeeeeeeeeeeeek!\nApollo:\nWh-Wh-Where'd you come from!?\n???:\n......\nApollo:\nW-W-W-Well... ...Anyway! Please have a seat!\n???:\n......\nTrucy:\n...... I'm nervous, Apollo.\nApollo:\nIt's the silence. It builds suspense. Why don't you do something, Trucy? You're a magician, aren't you?\nTrucy:\nTh-That's right. OK...\nMr. Hat:\nI'm the Amazing Mr. Hat!\n???:\n......\n...*thud*...\nTrucy:\nEeeeeeeeek! She passed out!\nApollo:\nHmm. Ms. Magic Underwear might have been a better bet.\nTrucy:\nThat's \"Magic Panties\", Apollo!\nAfter clearing all Talk options:\nApollo:\n(Well, that was fruitless. Though I think I understand despair a little better now.)\nTrucy:\nYou did good, Apollo!\n???:\n......\nTrucy:\nL-Look! She's doing her nails!\nApollo:\nWhat? Are nails more important than defense? Is that it!? ...Let's go, Trucy.\n???:\n...Excuse me...\nApollo:\n...!\n???:\nC-Could you... Could you read this?\nApollo:\nUm, sure. (I feel like a teenager on a first date! And this is the love letter we passed from desk to desk at school...)\nTrucy:\nStop looking so wistful and read it, Apollo!\nApollo:\nIt... It's a business card. With a name and an address. The name is... Vera Misham? The address is for \"Drew Studio\".\nVera's Card added to the Court Record.\nApollo:\nAnd you're giving me this card because...?\nVera:\n......\nApollo:\n...... Well, looks like we're finished here.\nTrucy:\nI wonder if Drew Studio is the scene of the crime?\nApollo:\nLet's go find out.\nOctober 7Drew Studio\nApollo:\nWow, this looks like... it looks like a studio.\nTrucy:\nIt's like life imitating art... Or, maybe, it's the other way around... Hmm. But the tape on the ground there... It's a bit jarring...\nApollo:\nYeah... Looks like we found our crime scene...\nTrucy:\nApollo! Look at all those paintings!\nApollo:\nHey, don't touch those.\nTrucy:\nIt's OK, I'm just looking. Huh? Apollo... Look at this one.\nApollo:\n...Looks half finished. (You can still see the rough sketch underneath.)\nTrucy:\nBut, that's odd. The rough part doesn't look like the rest of the painting at all.\nApollo:\nYeah, good point. (That is odd...)\nDrew Misham's Paintings added to the Court Record.\nTrucy:\n...All the paintings have a really different style, too.\n???:\nAh! I thought I might find you two here.\nTrucy:\nEma! Long time no see!\nEma:\nOh? Seems like I run into you far too often. I'll bet I know why you're here, too.\nApollo:\nYou know about the trial simulation tomorrow?\nEma:\nI've heard about it, sure. So Mr. Wright chose you, huh?\nApollo:\nWe don't even know what the case is about.\nEma:\nWell, he was killed. The artist who owns this studio, that is. Mr. Drew Misham.\nTrucy:\nMisham...\nEma:\nAnd his daughter was put under arrest.\nApollo:\nYeah... We just saw her at the detention center.\nTrucy:\nIt was funny, though. She seemed more like a victim than the kind of person who could commit murder.\nEma:\nYou don't say. Not even by poisoning? That's how it was done, you know. Poisoning's a common way to get the job done, when the murderer is a woman.\nTrucy:\nP-Poisoning...?\nEma:\nAnyway, Mr. Wright told me you'd be coming. Feel free to take a look around. I'll just be over here. With my Snackoos.\nApollo:\n(We can't talk to anyone related to the case this time around... ...Which means we'd better find out as much as we can here at the scene. ...Or else.)\nTrucy:\nI thought so.\nEma:\nI'll never forget that face, but what was his name...? Oh, right. Brushel.\nTrucy:\nBrushel...\nEma:\nHe's after a scoop to sell to the papers.\nApollo:\nSo a reporter comes for an interview with a painter. His first interview ever, and that night, he's killed. Seem strange to you?\nTrucy:\nReally strange.\nEma:\nIt does raise a few questions.\nApollo:\nI'd like to speak with this reporter if I could.\nEma:\nWell, I hear he's on the beat today, too. ...He said something about covering a magician.\nApollo:\nMagician...? (Well, if it's not Trucy, that leaves only one other person.)\nTrucy:\nIt wasn't Valant Gramarye, by any chance, was it?\nEma:\nYeah, something like that! He's got some big show lined up, I hear.\nApollo:\n(So, he's out interviewing Valant Gramarye... Looks like I'll be heading out to that coliseum again sooner than I thought.)\nEma:\nHere, I'll give you that reporter's card if you want.\nBrushel's Card added to the Court Record.\nAfter clearing all Talk options in Detention Center - Visitor's Room, then visiting any other location:\nOctober 7Detention CenterVisitor's Room\nGuard:\nAh, you're here to see Vera Misham?\nApollo:\nYes, that's right!\nGuard:\nShe's in the medical office at the moment.\nTrucy:\nMedical office...? Is she OK?\nGuard:\nShe's just lying down. Said she didn't feel so good. I'm sorry but I can't allow any meetings at the moment.\nApollo:\nMost. Annoying. Client. Ever.\nTrucy:\nGuess we should come back.\nAfter clearing \"Valant Gramarye\" Talk option in Wright Anything Agency:\nOctober 7Sunshine Coliseum\nTrucy:\nWoo hoo! This is it, Apollo! The place where magic and dreams converge!\nApollo:\nJust a while ago it was the place where murder and nightmares converged.\nTrucy:\nLet's go say hi to Uncle Valant!\nApollo:\n(What about the case...?)\n???:\nWaaaah ha ha ha ha ha ha ha ha ha ha!\nTrucy:\nOnly a performer laughs like that...\nValant:\nThe young Miss Trucy! How often I hoped we'd meet again only to tell myself it was an impossible dream!\nTrucy:\nTee hee, Uncle Valant! How's it going? I'm glad to see you, too!\nValant:\nOf course you are.\nApollo:\n(Humility is definitely NOT one of his stronger traits...)\nValant:\nWell, Miss Trucy, how does the day find you? If you've come to give me flowers, do it after the show, I beg you.\nTrucy:\nActually, we came to wish you good luck! And congratulations on your big magic show!\nValant:\nOh? But it is I who wish to congratulate you! Not everyone is so lucky as to witness miracles such as I shall perform!\nApollo:\n(Yeah, yeah, you're amazing, we get the picture.)\nValant:\nThe world will watch in wonderment as Magnifi's illusions are reborn! Here, on stage! By my hand!\nAfter clearing all Talk options and presenting Gramarye Envelope:\nValant:\nNow, the time has come when I must return to make my prestidigitation preparations! By your leave, Miss Trucy.\nTrucy:\nThanks, Uncle Valant!\nValant:\nThree days from now... make ready for a miracle!\nApollo:\nWhat do you think that journalist was after? And why did Valant react like that to this envelope?\nTrucy:\nI think it's time to pay the detention center another visit.\nOctober 7Detention CenterVisitor's Room\n???:\n...I think I hear what you're saying. \"We're All Doing It For The Money\", end quote.\nGuard:\nNo no no no! Not at all!\nApollo:\n...Looks like someone's already meeting here.\nTrucy:\nMaybe that reporter?\n???:\nHey there! How ya doing? Who might you be?\nApollo:\nAh, sorry, we didn't know someone was already here. I'm Apollo Justice, attorney at law. (Talk about a nervous monkey.)\n???:\nYou? You're Justice!? You?\nApollo:\nYou... know me?\n???:\nDo I know you? Of course I know you! \"Stares Down Witnesses On Stand Till They Spill Beans\", end quote.\nApollo:\nTh-That's not true! (What's he writing...?)\nTrucy:\nAre you a reporter by any chance?\n???:\nWoo! You! You're Trucy!\nTrucy:\nEh? Am I famous?\n???:\nOh yeah. Oh yeah! \"Trucy Wright Hates Carrying A Bag: Puts Everything She Owns In Her Panties\", end quote.\nTrucy:\nEeeeeeeeeeek! That's so not true!\n???:\nJust hold on to your breeches, there. I'll wrap up this interview in a jiffy.\nTrucy:\nInterview...?\n???:\nSo, guard. I think I know what's going on here. \"Guarding Rooms Is My Life. What Else Could I Possibly Need?\" end quote.\nGuard:\nNo! How many times do I have to tell you this? Look, I've got work to do. You deal with him.\nTrucy:\nUm... did you come here to interview the guard?\n???:\nOoh wee, what a pickle! \"Accused Wouldn't Talk, Had To Interview Someone Or Go Plum Crazy\", end quote.\nTrucy:\nHuh...\nApollo:\n...I should've guessed.\n???:\nWhere're my manners!?\nBrushel:\nName's Brushel. Spark Brushel. \"I'm Not Picky -- Journalist Just Closes Eyes, Writes\", end quote.\nApollo:\n(What's that nauseatingly strong mint smell every time he grins?)\nBrushel:\nUntil you've been interviewed by me, you don't know what thrilling is! \"Wild Romp Through Crossroads Of Mayhem, Madness\", end quote.\nApollo:\n...I can see that. (He's writing something again! Well, if he's a reporter, maybe he knows something...)\nAfter clearing all Talk options:\nBrushel:\nWell, there's nothing I can talk about really. \"Walls Have Ears, Eyes -- Especially Glass Walls With Speakers\", end quote.\nApollo:\nRight. Guess we'll leave then.\nBrushel:\nAh, but since you're here... ...might as well tell you a tidbit of news I saw. Just for the heck of it.\nTrucy:\nSure, tell us! ...Just for the heck of it.\nBrushel:\nI remember it like it was yesterday... ...I'd seen a movie on a trip, and wandered into this burger place with amazing ketchup... ...when an article in a tabloid caught my eye. \"Famous Oil Painting Stolen From Art Dealer's Gallery\", end quote, I believe it was.\nApollo:\nAn oil painting...?\nBrushel:\nHappens every day, right? But, I thought I'd seen that painting somewhere before. ...A painting of a giant peach floating down a river.\nApollo:\n(Someone stole an oil painting... of a giant peach.)\nBrushel:\n\"Journalist Can Smell Scoop Better Than Burgers\", end quote.\nOctober 7Drew Studio\nEma:\nWell, how'd it go? Find anything out?\nApollo:\nActually, there was one thing I wanted to check with you.\nEma:\nWh-What's with that scary face you're making?\nApollo:\n(And what's with the \"I know something but I'm not telling\" face you've got going, Ema?)\nApollo:\nUm, I kind of wanted to see the rough sketch under this painting. And I was wondering if your \"tool\" there might do the trick?\nEma:\nOh, fine. Fine! Just this time, though.\nTrucy:\nLet's check it out!\nEma:\nOK, let's print this one out.\nApollo:\nWhat... What the heck?\nTrucy:\nWow, he really blows! The finished painting isn't anything like the rough!\nEma:\nDevices like mine didn't exist until recently. He probably thought he could draw any sort of thing he wanted to for the rough.\nTrucy:\nWhat do you mean?\nEma:\nWell, in the past, you could only analyze the composition of a rough sketch.\nTrucy:\nComposition?\nEma:\nIn other words, the traces of charcoal between paint and canvas. So you could tell if there had been a rough sketch... ...but not what it looked like.\nApollo:\nAh, I think I follow you. So, in essence, it wouldn't matter what was underneath the finished painting.\nEma:\nSome pros would actually paint out a rough sketch entirely. Then do a completely new painting on top of that.\nTrucy:\nSo Mr. Misham was drawing whatever he wanted before painting over them...?\nEma:\nPossibly. Is there a problem with that?\nApollo:\n(Not particularly... But something about the sketch itself is kind of... odd.)\nTrucy:\nYou're awfully silent all of a sudden, Apollo.\nApollo:\nYou think we could check out one of the other paintings!?\nEma:\nWell, sure. You like this detection stuff, don't you?\nEma:\nOK, let's print this one out.\nApollo:\nThis one, too!\nTrucy:\nWhat's wrong, Apollo? You look so serious all of a sudden!\nApollo:\nUm, you think I could just look at the last of these?\nEma:\nFine by me. Knock yourself out.\nEma:\nOK, let's print this one out.\nApollo:\nWh-Wh... What the heck is all this!?\nEma:\n...I hesitate to ask why you're getting so excited.\nTrucy:\nYou sure your device isn't leaking some kind of strange radiation?\nApollo:\nTrucy! Look at these three sketches! ...Do you notice anything?\nTrucy:\nAaaaaaaaaaaaaaaaaaaaaaaaaaah! Th-Th-They're...!!\nEma:\nNow you're both white as sheets! What's going on!?\nApollo:\nThese sketches... are of the three cases I worked on!\nEma:\nWhat...?\nApollo:\nThe murder in the poker room at the Borscht Bowl Club! The dead man pulling the noodle stand! And then... ...the events that transpired during the Gavinners concert!\nEma:\n...What could it mean? How could he have painted those things... and why!?\nApollo:\nThat's what I want to know!\nEma:\nWait! Is Drew Misham... ...your father?\nApollo:\nGive me a break! Does that seem even REMOTELY possible to you!?\nApollo:\n(I'd never even heard of any Drew Misham before. I hadn't even seen a picture of him. But there were my cases, drawn on his canvas! ...Every single one of them. It couldn't have been a coincidence. Just who was this Drew Misham... and what did he have to do with me?)\nTo be continued.October 8, 9:48 AMDistrict CourtDefendant Lobby No. 6\nApollo:\nGood morning!\nVera:\n......\nTrucy:\nSo! You're... Vera, right? I'm Trucy! Trucy Wright! That's \"Wright\" with a \"W\"! Uh, but not \"write\", right?\nVera:\n......\nTrucy:\nUm! We're... on your side! You can tell us anything! ...Please?\nVera:\n...... ...Good morning...\nApollo:\n...! (She... She speaks!)\nTrucy:\nHmm, not bad, not bad. But I think you'd do better with a little smile, you know? You're so pretty! You need to sell yourself, you know?\nApollo:\nTrucy! Let's... take it easy for starters.\nVera:\n...... ...Thank you for taking my case...\nTrucy:\n...!\nApollo:\n(Okaaaaay... Well, that's a start, I guess.)\nVera:\n......\nApollo:\n(There she goes with the nail polish again...)\nTrucy:\nThat's great, really! It's so cultured!\nVera:\n............ ...Want to try...?\nTrucy:\nOooooh! Really!?\nApollo:\n*sigh* Girls... (The victim, Drew Misham, was a forger. And a stolen painting was found in his studio. A life of crime, really... ...And maybe one that led to his death.)\nOctober 8, 10:00 AMDistrict CourtCourtroom No. 3\nJudge:\nWell, we will now... er... *cough* Begin the, er, trial of... Vuh... Vuh... Vuh... Vera Misham!\nTrucy:\n...Is the judge OK? His voice is all raspy, and he's looking around all nervous-like.\nJudge:\nErm... ahem. The repercussions of today's trial will, most likely, be felt for a long time. ...And may, indeed, alter our legal system forever.\nKlavier:\nToday is a test of the Jurist System... ...and the first step toward a new order in our courts.\nTrucy:\nDaddy's secret mission!\nKlavier:\nThe jurists will function like a jury. It is hoped their inclusion will help the courts to better reflect the people's will.\nApollo:\nWhy... aren't there any jurists in the courtroom?\nKlavier:\nThree closed-circuit cameras watch this courtroom at all times. The jurists have access to everything that transpires. Jurists! Judge well, and judge cool.\nJudge:\nN-Now see here, Prosecutor Gavin! I-I was going to say that!\nKlavier:\nAh, my apologies, Herr Judge.\nJudge:\nAhem. Jurists! Today, er... Judge today's trial \"coolly\", if you would be so kind!\nApollo:\n(The jurists are unbound by the letter of the law. They don't affect the trial with evidence... but by their \"feelings\". And we're about to find out just what effect they're going to have.)\nJudge:\nVery well, Prosecutor Gavin. The details of the case, if you would.\nKlavier:\nThe victim is the painter Drew Misham. He was killed in his own studio. His coffee... was poisoned. By whom, you ask? By none other than the defendant, Vera Misham.\nApollo:\nApollo:\nThere wasn't any poison in the coffee!\nKlavier:\nAchtung... Someone has been doing their homework! Indeed. Poison was not present in the coffee... but on the mug itself.\nJudge:\nThe mug...? Ah, residue was found on the rim, I see.\nKlavier:\nThe autopsy report describes the manner of our victim's death.\nJudge:\nThe court accepts this as evidence.\nMisham's Autopsy Report added to the Court Record.\nJudge:\nAccording to this report... ...the victim's death was caused by \"atroquinine\" poisoning.\nKlavier:\nA chemical compound that does not occur naturally. Lethal dosage is a mere 0.002mg. A touch of atroquinine in the body... ...is the touch of the Reaper's scythe.\nJudge:\nVery well, Prosecutor Gavin. You may present your witness.\nKlavier:\nI have for you today a simple man, for a simple case. ...A man who witnessed the murder in its entirety.\nApollo:\n(That journalist, no doubt...)\nKlavier:\nThe witness will state his name and occupation.\nBrushel:\nAh! Right! Well, for starters, my name's Spark Brushel! My job is... a lone observer of the world!\nApollo:\nIn other words, a freelance journalist, right?\nBrushel:\nAhem! If you don't mind, I'd like to state something here for the record.\nJudge:\nYes, Mr. Brushel?\nBrushel:\nI dislike conclusions, specifically, the jumping to aspect of conclusions. \"Preconceptions Make Park Sandbox of Endless Desert Waste...\" end quote.\nApollo:\nBut, you are a journalist. You said so yourself yesterday.\nBrushel:\n...Well, that's true, yes. But you must understand, I stand before you today a man with a dream! I'm offering you my testimony in exchange for exclusive rights to the story! \"Scoop Turns Mr. Brushel Into THAT Mr. Brushel!\" end quote.\nJudge:\n...Let's hear your testimony then, shall we?\nApollo:\n(A \"simple case\", eh, Gavin? For me, the jury... is still out.)\nWitness Testimony\n-- The Journalist's Story --\nBrushel:\nI visited the studio around 9:00 that night to do the interview.\nThe first outsider to enter the atelier! \"Journalistic History Made\", end quote!\nHis daughter brought us coffee right after we started.\nAnd you know what happened next. \"Star Falls!\" end quote.\nNo one else entered the room besides her the whole time.\nJudge:\nHmm... That does sound like a simple case. Unless... you were the one who poisoned him!\nBrushel:\nWh-Wh-Wh-Whatareyousaying!? Judge!\nJudge:\nAhem. Need I remind you, the cameras are rolling today. I felt the need to be a bit dramatic.\nKlavier:\nYou didn't do it, did you?\nBrushel:\nM-M-M-M-Medoathinglikethat!? Come on! That's like... \"Newsmaker Making the News\", end quote. Or even \"Contemporary Witch-Hunt\", end quote! I know! \"Wild Accusations Rock Courtroom\", end quote.\nKlavier:\nAh ha ha ha. Rock, indeed.\nTrucy:\nProsecutor Gavin sure looks like he's having fun.\nApollo:\nI'm so happy for him.\nJudge:\nVery well, Mr. Justice, your cross-examination, please.\nCross Examination\n-- The Journalist's Story --\nBrushel:\nI visited the studio around 9:00 that night to do the interview.\nBrushel:\nThe first outsider to enter the atelier! \"Journalistic History Made\", end quote!\nBrushel:\nHis daughter brought us coffee right after we started.\nBrushel:\nAnd you know what happened next. \"Star Falls!\" end quote.\nBrushel:\nThose spasms... That was definitely death by poison.\nBrushel:\nI drank the coffee, too, but I'm not dead yet!\nBrushel:\nHe had one sip, if that. The next moment, he was on the floor!\nBrushel:\nNo one else entered the room besides her the whole time.\nTrucy:\nHe sure makes it sound exciting. I guess that's his job.\nApollo:\nThere's only one moment we need to focus on, really.\nTrucy:\n...The moment when Drew Misham died?\nApollo:\nExactly. There has to be something there!\nApollo:\nYou know what I have a problem with? A particular property of the poison used, atroquinine.\nJudge:\nOh? Prosecutor Gavin was quite clear about the poison. A lethal dosage of 0.002mg paralyzes the central nervous system. If you drank that, even you, Mr. Justice, would be reduced to a quivering pile...\nApollo:\n(Why are you using me as an example!?) Unfortunately, we weren't told everything. There was a vital omission in Prosecutor Gavin's information!\nKlavier:\n......\nJudge:\nAn omission?\nApollo:\nAtroquinine is as virulent as he says. But death doesn't come upon ingestion, not immediately. That's because atroquinine is slow-acting!\nJudge:\nSlow-acting!\nBrushel:\nWhatwhatwhatwhat!?\nApollo:\nAccording to one forensic scientist...\nEma:\nIt's one of the most virulent poisons, but is absorbed into the body astonishingly slowly. It takes at least 15 minutes from the time of ingestion for adverse effects to show.\nApollo:\nIf we suppose that the moment Mr. Misham sipped the coffee was when he sealed his fate... ...then he would still have had time left to enjoy his last cup of joe!\nJudge:\nOrder! Order!!! What's the meaning of this!? If what the defense says is correct... ...why, that contradicts the entire testimony we've just heard!\nApollo:\nWell, Mr. Brushel? Anything to say... on the record!?\nBrushel:\nSlow-acting. S-L-O-W A-C-T... It was virulent, alright. Even then, it had already begun digging its claws into the journalist.\nTrucy:\n...He's working on his scoop.\nApollo:\n(*sigh*)\nKlavier:\nKlavier:\n...It's \"Brushel\", ja? Herr Brushel... let's take a trip back down memory lane.\nBrushel:\nHuh?\nKlavier:\nDid the victim really die the instant he took a sip? Think it over. This is vital.\nBrushel:\nYou know what I think? I think that was... \"A Not-So-Subliminal Suggestion\"... end quote.\nKlavier:\nI admit, it does cause a problem if he died when you say he died. ...I would be forced to say auf Wiedersehen to my simple case. And you would be forced to say farewell to your article.\nBrushel:\nCome again?\nKlavier:\nYou can't write a story based on conjecture, can you? And as the case drags on, other reporters will pick up the scent. ...And you'll be forced to kiss your exclusive scoop goodbye.\nBrushel:\nScoop... Scoop... .....................! Look, wait. Just wait a second. Just one second.\nJudge:\nWe're waiting, we're waiting! Out with it!\nBrushel:\nI think I just recalled a so-called \"important detail\"! \"A Revival of Recollection\", end quote! \"A Story's Survival\", end quote!\nApollo:\n\"Attorney Utterly Confused\", end quote.\nBrushel:\nActually, I did notice something when I visited the studio. I'd heard of poison that \"takes its sweet time\", see!\nKlavier:\n...But not what I've been saying for the last few minutes, apparently.\nJudge:\nMr. Brushel! Are you saying you noticed something that explains what happened!?\nBrushel:\nYou bet I am! The \"Antidote For A Poisonous Contradiction\", end quote, you might say!\nApollo:\nOr \"I Still Have No Idea What You're Talking About\", end quote, I might say.\nBrushel:\nI figured it out, but only after an in-depth interview! See, thanks to my journalism skills, I know who poisoned that coffee!\nJudge:\nOrder! Order! Order!\nKlavier:\nAs far as I can tell, the witness is standing by his testimony. ...That Mr. Misham died the instant after he drank.\nBrushel:\nOf course I'm standing by my testimony! ...And my dream of exclusive rights to this story!\nKlavier:\n...Ach. I suppose it was too much to hope for.\nApollo:\nWhat was?\nKlavier:\nOf course he wouldn't choose a simple case, not him.\nJudge:\n\"Him\"...?\nKlavier:\nPhoenix Wright, who else?\nApollo:\n...!\nKlavier:\nAchtung, Herr Brushel! Report for us, if you would. What is it that you noticed?\nBrushel:\n......\nJudge:\nThis court is a critical trial of the Jurist System. I'm afraid no room for doubt is permissible. You will testify to the court about what you noticed!\nWitness Testimony\n-- What Brushel Noticed --\nBrushel:\nWhen I arrived at the studio, Mr. Misham was at his desk.\nHe seemed to be writing a letter... but he quickly sealed the envelope.\nI thought nothing of it at the time, of course.\nNow that I think about it, what if he was writing a suicide note!?\nJudge:\nHmm... A suicide note?\nBrushel:\nYes... he had this look on his face. \"Man's Face Inscrutable As A Quadratic Equation\", end quote.\nTrucy:\nSuicide? Poor Mr. Misham... But that means Vera's innocent!\nApollo:\nWould someone commit suicide in the middle of an interview?\nTrucy:\nOh.\nJudge:\nVery well, you may begin your cross-examination.\nCross Examination\n-- What Brushel Noticed --\nBrushel:\nWhen I arrived at the studio, Mr. Misham was at his desk.\nBrushel:\nHe seemed to be writing a letter... but he quickly sealed the envelope.\nBrushel:\nIt was a yellow envelope. ...I heard it was left at the crime scene.\nBrushel:\nI thought nothing of it at the time, of course.\nBrushel:\nNow that I think about it, what if he was writing a suicide note!?\nTrucy:\nDo you think Mr. Misham was writing a suicide note?\nApollo:\nIf he was, that would solve the case in a jiffy.\nTrucy:\nIt kind of makes me wonder about that letter...\nApollo:\nAs it just so happens, there was a single letter in a desk drawer at the scene. In a red envelope!\nBrushel:\nWhaaaaaaaaaaaaaaaat!?\nApollo:\n...Prosecutor Gavin!\nKlavier:\n...Yes?\nApollo:\nWas a yellow envelope found at the scene of the crime?\nKlavier:\n...Unfortunately no. But, Herr Forehead... ...it's easy to mistake the color of an envelope.\nApollo:\nI guess. But not this envelope. You see, it was postmarked already. Seven years ago.\nJudge:\nWell, Mr. Brushel?\nBrushel:\n...I can explain that. Drew, right, he wanted to get that letter in an envelope, pronto! Get it out of sight of my beady eyes, right? So he grabbed the nearest envelope and crammed away!\nApollo:\n(And what about the whole red and yellow envelope contradiction, chump!?)\nJudge:\nWell, Mr. Justice? Have you anything to say to the witness's claim?\nApollo:\n\"That night, the victim put a letter he had been writing in a red envelope\"...\nApollo:\n...As it just so happens, the defense team investigated the contents of this envelope! With, erm, the assistance of a forensic scientist.\nKlavier:\nWhat...?\nApollo:\nNote that this letter is addressed to \"Drew Misham\".\nBrushel:\nOh?\nApollo:\nWhy would he address a letter to himself? Let alone send a suicide note to himself!\nBrushel:\n...... I... I've been scooped!\nJudge:\nOrder! Order! Order!!! Mr. Brushel! Can you explain this to the court?\nBrushel:\nOh, my, my, my. How could I have forgotten? I suppose this happens to the best of us! \"Reporter Gets Old, Forgets Lots\", end quote.\nJudge:\nI'm still waiting for an explanation, Mr. Brushel!\nBrushel:\nWell, that's the thing, see. After he put his letter in that envelope... ...Mr. Misham sat there searching his desk drawer for something!\nApollo:\nHis desk drawer...?\nBrushel:\nYes! A stamp! A so-called \"Postage Stamp\", end quote!\nJudge:\nA stamp? Whatever for?\nBrushel:\nWell, to mail his letter, what else? And then, why yes, I think I saw him put it in his letter box. Yes, it was a yellow envelope, and he put it in that box!\nJudge:\nWell, apparently, this yellow letter has nothing to do with this case.\nBrushel:\nOh, how I wish it did! Just think if that were a suicide note... What a story! \"Star Writes Suicide Note In Front Of Reporter, Falls\", end quote.\nJudge:\nAhem. As I was saying, that has nothing to do with this case! That said.\nApollo:\nYes, Your Honor?\nJudge:\nIt makes me wonder about the contents of that red envelope. $100,000 is quite a good deal of money!\nKlavier:\nSo this was from seven years ago, ja...?\nBrushel:\n...! So, am I finished? Here, I mean. Am I finished here? I was thinking of, you know, going home, to start writing...\nApollo:\n...Um, I hate to state what should be pretty obvious to anyone... ...but when you catch the scent of a story... ...you make that... er, rather unique face.\nBrushel:\nAck! C-C'mon! \"Attorney Has Active Imagination, Little Else\", end quote.\nJudge:\nEven I noticed something, and my eyes aren't what they used to be. You know, I'm starting to understand what all this \"perceiving\" stuff is about!\nApollo:\n(\"Judge Has Active Imagination\"... end quote.)\nJudge:\nPlease, continue with your testimony. Tell us about the scent of a story!\nBrushel:\nHey... I'm the one asking the questions here. Usually.\nWitness Testimony\n-- The Scent Of A Story --\nBrushel:\nActually, it took a bit of work to get a thumbs-up on the interview.\n\"Reporter Leverages Story, Gets His Interview\", end quote.\nThe story concerned a certain case from seven years ago.\nThat red envelope probably had something to do with it.\nSay what you will, but Drew's talent was without compare.\nJudge:\nSo you threatened to go to press with this \"story\"? That's how you got your interview? Blackmail?\nBrushel:\nWell, yes. ... I mean no! No, no, no, no! It wasn't exactly black... I mean, I'm not... urk!\nJudge:\n...Something wrong, Mr. Brushel?\nBrushel:\nL-Look! This is my story! My tidbit! \"Journalist's Into Is Livelihood\", end quote.\nJudge:\n...I see.\nBrushel:\nWhile you have me chatting away in here, what's going on out there? What if some Wally Wordsworth or Sally Scooper gets wind of my story? They could be going to press while I'm going to waste!\nJudge:\nThe court feels your pain, Mr. Brushel. Mr. Justice, let's pick up the pace.\nApollo:\n(A certain case, seven years ago... Wait... \"seven years ago\"?)\nTrucy:\n...?\nCross Examination\n-- The Scent Of A Story --\nBrushel:\nActually, it took a bit of work to get a thumbs-up on the interview.\nBrushel:\n\"Reporter Leverages Story, Gets His Interview\", end quote.\nBrushel:\nThe story concerned a certain case from seven years ago.\nBrushel:\nThat red envelope probably had something to do with it.\nBrushel:\nSay what you will, but Drew's talent was without compare.\nTrucy:\n...That testimony left a bad taste in my mouth.\nApollo:\nIt all makes sense. Nothing jumps out as ridiculous.\nTrucy:\nI wonder what this \"story\" he's talking about is? It must have been good, to get an interview with a famous recluse like that.\nApollo:\n(Something powerful enough to drag Drew Misham out of hiding. I wonder... Maybe it had something to do with Mr. Misham's art?)\nApollo:\nSweat much, Mr. Brushel?\nBrushel:\nUrk! Eh, yeah, well... ...a man can't help his glands, you know!\nApollo:\nIt's more than that. When \"Mr. Misham's talent\" was mentioned... ...you suddenly began to sweat buckets.\nBrushel:\n...Ack!\nApollo:\nYou're hiding something... about his talent!\nBrushel:\nWhaaaaaaaaaaaaaaaaaaaaaaaaat! Th-Th-Th-Th-Th-That's r-r-r-ridiculous!\nApollo:\n(Evidence time. Let's show where Mr. Misham's true \"talent\" lay!) It just so happens I have evidence showing the \"talent\" mentioned in that letter!\nApollo:\nThis painting was found in Mr. Misham's studio.\nBrushel:\n...!\nApollo:\nThere are two problems with this painting. The first is it wasn't painted by Mr. Misham. The second is that there was another painting in the studio... ...which looked exactly like this one. Except it was only half done!\nBrushel:\n......\nApollo:\nThen we have a letter discussing a payment of $100,000. Which suggests a certain business operation. The business of making forgeries!\nBrushel:\nAoooooooooooooogg!\nApollo:\n...That is all, Your Honor.\nBrushel:\nEveryone! Please, everyone! Can we keep this private? Please!? This is my story! My scoop!\nJudge:\nForgery... that's a serious crime!\nBrushel:\nDrew Misham is known as an artist these days. But there were rumors he dabbled in another kind of art until a few years back.\nJudge:\n\"Another art\" meaning... forgery?\nBrushel:\nDrew Misham was talented, alright. Talented at making precise, detailed fakes. A fact that certain criminal elements were quick to discover.\nApollo:\nCriminal elements...? What...!? You can't seriously be talking about...\nBrushel:\n...Exactly. I'm talking about forging evidence! The rumors started circulating seven years ago.\nJudge:\nS-Seven years ago...? So, are we to understand that this letter... ...this payment of $100,000 was for...?\nBrushel:\n...Exactly. \"Forged Evidence Nets Tidy Profit\", end quote.\nJudge:\nOrder! Order! Order! Why, it's like our victim was living a double life!\nApollo:\n(Ah ha! This is my chance!) So the victim had ties to the criminal world, right? He could have had plenty of enemies we know nothing about!\nKlavier:\nKlavier:\nThis is my first time hearing of this \"criminal world\". We certainly found no criminal connections when we conducted our investigation.\nApollo:\nApollo:\nBut how do you explain all this money? You have to admit there's a possibility of some illegal activity here!\nKlavier:\nKlavier:\n...But there is no proof tying this letter to our case.\nApollo:\n...!\nKlavier:\n...Our case was, and remains, simple from the beginning. Only the defendant could have poisoned that mug that night. And, you, of course.\nBrushel:\nHey, hey, hey, the only thing I poison is my pen... when I'm writing reviews!\nJudge:\nMr. Brushel, your testimony to this point has been quite unreliable. ...It doesn't speak well of your reporting acumen.\nBrushel:\nWhat're you talking about!? My journalism is rock solid! \"Journalism So Solid, You Could Stand An Elephant On It\", end quote.\nJudge:\nIn any case... Let's hear a summarized recap of your testimony. If we can ascertain the situation in that studio from the recap, the trial is over.\nTrucy:\nApollo! What's he talking about?\nApollo:\nThe cross-examination showed Mr. Brushel didn't have reason or means to poison him. As long as there're no other suspects... ...then the killer had to be Vera. That's what. ...This next testimony is our last chance!\nJudge:\nMr. Brushel, your testimony please!\nWitness Testimony\n-- The Interview: A Recap --\nBrushel:\nThe only other person in the studio that night was the defendant.\nIt was Vera who poured the coffee. She's admitted as much herself.\nThe only thing that touched Drew's lips during the interview was that mug.\nAnd nothing left that studio after he died. Nothing.\n...Clearly, the only one who could have poisoned him was his daughter!\nKlavier:\nA nice testimony. Clear, succinct... and without room for doubt.\nBrushel:\nAw... Shucks. You really think so?\nJudge:\nI believe this clarifies the situation that night. Very well, Mr. Justice. You may begin your final cross-examination!\nApollo:\nR-Right... (...I still have one trump card left to play. And I won't let this trial end until I use it!)\nCross Examination\n-- The Interview: A Recap --\nBrushel:\nThe only other person in the studio that night was the defendant.\nBrushel:\nIt was Vera who poured the coffee. She's admitted as much herself.\nBrushel:\nThe only thing that touched Drew's lips during the interview was that mug.\nBrushel:\nAnd nothing left that studio after he died. Nothing.\nBrushel:\nA letter was put in the post from the studio, but I hardly think that matters.\nBrushel:\n...Clearly, the only one who could have poisoned him was his daughter!\nTrucy:\nWhat do you think, Apollo? Everything he's saying seems so... not flawed!\nApollo:\n...Well, that's kind of what you want from a testimony, really. (...I need to keep my eye on what matters. How, and why, was Drew Misham, killed? Vera poured the coffee, that's not going to change. But if that coffee didn't kill him, I need to find what did... and prove it!)\nApollo:\nProof is... possible. (Here goes nothing...)\nKlavier:\nYou do understand what we need, ja? Proof, Herr Forehead. Not \"possibilities\".\nApollo:\nOf course. And, Prosecutor Gavin, I hope you understand... ...I'm ready to give you that proof.\nKlavier:\nWh-What did you say?\nApollo:\nI have proof of the disappearing envelope!\nBrushel:\nI saw him writing a letter, I did!\nJudge:\n...Which was picked up by the mailman, I assume?\nApollo:\nOf course, which means... ...that envelope had a stamp on it.\nJudge:\nA stamp... Ah..................\nApollo:\nAs we all know, stamps come with dried glue on the back. In order to use the glue you have to wet it... ...by licking the stamp!\nKlavier:\nKlavier:\nFeh. No one worth talking to actually licks stamps in this day and age.\nApollo:\nApollo:\nEven if you wanted to talk to him, you couldn't. ...He's dead, after all.\nKlavier:\nKlavier:\nOK, so he licked the stamp. But wait! How does that explain the atroquinine on the rim of the coffee mug?\nApollo:\nApollo:\nIf he licked the back of a poisoned stamp, the poison would get on his tongue, yes? What would then happen if he put the coffee mug to his mouth, hmm?\nKlavier:\n...!\nApollo:\nThose traces on the mug weren't the killer's doing! It was the other way around!\nJudge:\nWhat!?\nApollo:\nThe coffee mug didn't poison Mr. Misham... ...Mr. Misham poisoned the coffee mug himself!\nJudge:\nOrder! Order! Order! B-But that doesn't... Does it?\nApollo:\nRecall, if you would... ...atroquinine is a slow-acting poison, yes? The poison entered his body when he put the stamp on that envelope. But his time wasn't up until the very moment he touched his lips to that cup of joe.\nJudge:\nYou have something to add, Mr. Brushel?\nApollo:\n(Uh oh. His nose is picking up another scent...)\nBrushel:\nAs I believe I mentioned earlier.\nBrushel:\nWell, that's the thing, see. After he put his letter in that envelope... ...Mr. Misham sat there searching his desk drawer for something! Yes! A stamp! A so-called \"Postage Stamp\", end quote!\nBrushel:\nBut you know, I don't seem to remember him ever finding one.\nJudge:\nMaybe he'd just run out?\nKlavier:\nIncidentally, we searched the desk drawer at the scene of the crime. There were no stamps. Not a single one.\nApollo:\n...!\nJudge:\nHmm, that does pose a problem. How will you prove that the stamp was coated with poison?\nApollo:\nActually, I'm glad no other stamps were found. It makes proving the stamp he used was poisoned possible!\nKlavier:\nAh ha ha ha ha ha. ...Good show, good show. You can't even prove there was a stamp at the scene in the first place!\nJudge:\n...Well, let's hear what the defense has to say anyway. Where's your evidence that proves the existence of this poisoned stamp?\nJudge:\nWell, that certainly is a cute little frame. And by little, I mean really little.\nApollo:\nIt was on the victim's desk, Your Honor. ...Quite empty, as you can see for yourself.\nKlavier:\nI noticed that too during my inspection. So what?\nApollo:\nAh, apparently you weren't as observant as you should have been. You see, when you saw this frame, it was missing something quite important.\nJudge:\n\"Missing\" something...?\nApollo:\nYes. A pale bluish stain on the inside of the frame... Atroquinine residue!\nKlavier:\nWhat!? Why wasn't I told about this!?\nApollo:\nThe frame is only two inches square. The face of the frame is even smaller. Maybe an inch wide at most.\nKlavier:\nYou aren't saying...\nApollo:\n...Oh, but I am. Tell me: what fits in such a small frame? A commemorative stamp, perhaps?\nJudge:\nOrder! Order! Order!!! The poisoned stamp was in this frame...!?\nKlavier:\nImpossible!\nJudge:\nP-Prosecutor Gavin...!\nKlavier:\nWhy would he put something like that on his desk? Don't tell me he had it there so he could commit suicide if the mood struck!\nBrushel:\nYou know, can I say something? I had a thought, see!\nJudge:\nWhat, Mr. Brushel, and please stop jittering around like that!\nBrushel:\nThe victim was a forger, right? There's a lot of money in that line of work. \"Forger Forges Friends, Makes Enemies, Too\", end quote.\nApollo:\nSo the poisoned stamp might have been a murder weapon, aimed at him!\nKlavier:\nKlavier:\n...Oh, rich. That's rich. Leave the ridiculous flights of fancy to the Gavinners's song lyrics, please.\nApollo:\n(Finally, something we agree on.)\nKlavier:\nThe stamp was a \"murder weapon\"? Nonsense! Murder is a simple business. Who would go to such lengths? No one.\nApollo:\nOh, I disagree.\nKlavier:\nC-Come again...?\nApollo:\nRecall, if you would, the victim's reclusive lifestyle. Drew Misham hid from the world. He avoided meetings. His only contact with the outside world... was the mail.\nJudge:\nThe... mail!\nApollo:\nNow, if you wanted to kill someone you couldn't meet, but you knew read letters... ...a stamp would be the perfect weapon!\nKlavier:\nRidiculous! Where's your proof? I want proof! Show us evidence that this poisoned stamp was sent to him... as a murder weapon!\nApollo:\n(I might not have \"evidence\" per se... But things are finally starting to come together!)\nTrucy:\nWh-What is it, Apollo? Your fists are trembling!\nApollo:\nI think I know what happened! I don't believe it... but I can see it! I think I know how Mr. Misham was killed!\nJudge:\nWell, fill us in, Mr. Justice!\nApollo:\n...A certain piece of evidence points to the truth, Your Honor. I can show you how someone with the intent to kill sent Mr. Misham the stamp of death!\nJudge:\nIsn't this the envelope... the one from seven years ago?\nApollo:\nThink about the text of the letter again. There were two pages in the envelope. This is page one. ...And this is page two. I want to draw your attention to one phrase in particular. \"...Send in the enclosed envelope with the enclosed stamp within 3 days.\" The enclosed stamp, Your Honor.\nJudge:\nAh...!\nBrushel:\nIn other words, if I have this straight... \"The Stamp! Poison! On The Stamp! Lick, Lick, Gasp...\" end quote!\nApollo:\nNow, what if he had done exactly as the letter asked?\nTrucy:\nHe would sign the document, put it in the envelope... and put the stamp on it, right? Then he would put it in his letter box...!\nApollo:\nFifteen minutes wouldn't have elapsed between affixing the stamp, and mailing the letter. But the clock started ticking, and when the time came... he drew his last breath. And the murder weapon would be taken away from the scene.\nJudge:\n...Quite conveniently, thanks to the postal system!\nKlavier:\n...Such a splendid imagination you have, Herr Forehead!\nApollo:\n......\nKlavier:\nLet me confirm one thing with you, if I might. So, this \"poisoned stamp\" was inside this envelope from seven years ago... ja? Is that what you'd have us believe? Really?\nApollo:\n...W-Well...\nTrucy:\nIt is a little bit of a stretch, but there's a possibility.\nKlavier:\nYes. A very small possibility. How small, I wonder?\nTrucy:\nUm...\nKlavier:\nA poisoned stamp in this envelope? A stamp that then became the murder weapon? How do you intend to prove this seeming coincidence?\nTrucy:\nW-Well...\nApollo:\n(Ack! It was seven years ago, and we don't even know who sent that letter!)\nKlavier:\nAnd your answer... is silence, I see. Very well! I move to...\n???:\n...It's not nice to pick on the Fräulein, Klavier.\nKlavier:\n...!\nApollo:\nAh... Ema!\nEma:\nWell? Like my Kristoph Gavin impression? Did I sound like him?\nApollo:\n...Don't quit your day job.\nKlavier:\nDon't you have a crime scene to be looking after, Fräulein Detective?\nEma:\nSomeone had to come dig you all out of the mess you're making of this case.\nApollo:\nMess...?\nEma:\nYou know, none of this would happen if you just trusted in science a little more. You can find out if that stamp was in that envelope, easy.\nKlavier:\nCare to explain yourself, Fräulein Detective?\nEma:\nGlare at me all you want, but science is on my side. It's all in the residue, right?\nApollo:\nThat's right! The poison detection spray...\nJudge:\nProduce the red envelope at once! You can open it on the authority of the court!\nJudge:\nWell! Would you look at that!\nEma:\nNo mistaking it. That's atroquinine residue!\nJudge:\nI-I don't believe it... A murder weapon from the past... Now, seven years later, it bares its fangs at last!\nKlavier:\nKlavier:\nAbsolutely outrageous! ...Tell me why! Why didn't this murder take place seven years ago!?\nApollo:\nWell, um...\nEma:\nThere's one possibility. Maybe Mr. Misham figured it out.\nJudge:\nFigured what out?\nEma:\nHe realized that the person who sent that letter wanted him dead. So he sent his reply with a different stamp.\nJudge:\n...And put his decisive evidence in a frame.\n???:\nBrushel:\n......\nJudge:\nAck! You're still here!?\nBrushel:\nC-Can I make a statement here, on the record? I, Spark \"Razortooth\" Brushel, claim this scoop as mine! \"Drew Misham Killed In Cold Blood... ...By Sender Of Seven-Year-Old Letter!\" end quote. Hmm, no, maybe something more succinct. \"Star Falls After 7 Year Delay\", end quote.\nJudge:\nOrder! Order! Order! I see no room for further argument here. Though I admit, this is all coming as quite a shock. To think that the murder weapon reached his mouth after seven years...! \"Stamp Is Ticket Straight To Afterlife\", end quote!\nTrucy:\nUh oh. I think the witness is a bad influence on our judge.\nJudge:\n...I see no need for further debate on this matter. The sender of that letter seven years ago could hardly have been our defendant!\nTrucy:\nA-Apollo!\nApollo:\nI think we just won!\nJudge:\n...Very well! This court finds the defendant...\nKlavier:\nKlavier:\n...Is this the bright future of our legal system?\nJudge:\nProsecutor... Gavin?\nKlavier:\nA ticket to the afterlife from seven years ago...? Tickets for Gavinners's shows are invalid after two weeks.\nJudge:\nB-But it doesn't make sense any other way!\nKlavier:\n...It boggles my mind that so many people haven't noticed this. There's a fatal contradiction in Herr Forehead's claim!\nApollo:\nA c-contradiction?\nKlavier:\nA poisoned stamp was placed in this envelope seven years ago. Whereupon it was framed, until now. If that's the case, then why would Drew Misham have done what he did?\nApollo:\nE-Ema explained that! He must have realized it was poisoned!\nKlavier:\n...Therein lies the rub.\nApollo:\n...!\nKlavier:\nSeven years ago, the forger Drew Misham sensed a trap, and put the stamp in a frame. I do not debate this. ...But this begs the question. Why, seven years later, did he use that stamp on the night of the murder?\nApollo:\nAh...!\nKlavier:\nSurely, you don't mean to suggest that Mr. Misham simply \"forgot\"? He put the murder weapon in a frame on his desk for seven years... and forgot? You expect us to believe he sprang the trap on himself?\nApollo:\n...... Uh... Uwaaaaaaaaaaaaaaaaaaaaaaaugh!\nJudge:\nWhile I admit, this is all quite shocking, myself... ...it does seem highly unlikely that he would fall afoul of a trap... ...that had been sitting on his desk for seven years!\nTrucy:\nA-Apollo!\nApollo:\nI don't think we're winning anymore.\nKlavier:\nAh, I'm glad to see we're all back in the real world now. Welcome back to reality! We've been waiting for you.\nApollo:\nApollo:\nOK... Then how do you explain the poisoned stamp that was in this envelope?\nKlavier:\nThe \"poisoned stamp\"...? Where exactly is this poisoned stamp, again? Have you brought it to court for us?\nApollo:\nUh...\nKlavier:\nI see no proof that such a thing ever existed.\nApollo:\nApollo:\nWhat about the atroquinine residue, huh!?\nKlavier:\nOh, I agree, that does seem to be atroquinine residue. But, Herr Forehead, it's certainly no stamp.\nApollo:\n...! Y-Yeah, but...\nKlavier:\nEven if your precious poisoned stamp did exist... ...Drew Misham never would have used it. ...That is all.\nApollo:\n...... Urk.\nJudge:\nI believe we've come to a conclusion. Again.\nTrucy:\nA-Apollo! Were we wrong the whole time?\nApollo:\nI-I can't believe it! The poison traces match up! It can't be coincidence!\nJudge:\nI'd like to bring some closure to this issue, sometime this year. ...Mr. Justice?\nApollo:\n...Yes, Your Honor!\nJudge:\nLet's review the facts, and see where we stand. Seven years ago, Drew Misham received a red envelope. There were traces of the poison atroquinine on the document inside that envelope. A similar trace was also found at the crime scene... ...on this tiny picture frame. The defense has indicated the possibility of a yellow envelope. An envelope that left the scene of the crime with the poisoned stamp on it.\nKlavier:\nYes, but even if this envelope contained a poisoned stamp... ...and Drew Misham, knowing this, put it in a frame... ...he never would have used that stamp!\nJudge:\n...I'm afraid you're right. Which means there is a fatal flaw in the defense's case!\nApollo:\n(I haven't been on the wrong track this whole time, I'm sure of it! The traces of atroquinine, the envelope, the frame... ...and Drew Misham's mysterious death... They're all connected somehow!)\nJudge:\nWell, Mr. Justice, do you have a conclusion for us?\nApollo:\n...The defense stands by its case, Your Honor. We've seen that the logical outcome of the evidence makes no sense. Which means that one of our clues... must be a fake.\nKlavier:\nAh, a fake clue? Fascinating! And if we find this fake, your wild fantasies will prove quite reasonable, ja?\nApollo:\nThe fake clue that's thrown us off the poison's trail is none other than...\nJudge:\nTh-the victim was a \"fake clue\"? I'm afraid I don't understand.\nApollo:\n...I'll explain. We have an envelope, a frame, and a mug, linked by poison. That all makes sense. What doesn't make sense is the victim himself!\nKlavier:\nKlavier:\n...Congratulations. You've completely lost me. So the fake evidence is none other than the master of fake himself, the forger? ...It makes a good story, I'll give you that.\nApollo:\n(The fake clue... Fakes... forgeries...) Ah...!\nTrucy:\nI know that face! That's the \"I just had an idea\" face!\nApollo:\nI don't know if I'm right... but I'm going with it anyway! What if our \"forger\" is the \"fake\"!?\nKlavier:\n...Come again?\nApollo:\nSeven years ago, our forger sniffed a trap, and stepped aside. ...Seven years passed. Now the forger stumbles into that very same trap, and dies. ...Why?\nJudge:\nThat's what I want to know!\nApollo:\nBecause the forger who was killed... was a fake.\nKlavier:\nHere we are again. The victim... was a \"fake\"?\nApollo:\nOne forger smelled the trap. One forger fell into the trap. That's two forgers! And one of them was a fake!\nJudge:\nOrder! Order! Order!!!\nKlavier:\nSo you are telling us that Drew Misham, the victim, was a fake? Well, if he was the fake, who was the real forger? You'd better not be claiming there was some kind of switcheroo?\nJudge:\n...I'm afraid you're going to have to back up your story. Mr. Justice. Show us just who the real Drew Misham was!\nApollo:\n(If Drew Misham wasn't the real forger... ...there's only one other person it could have been!) ...Understood, Your Honor. Forger Drew Misham was himself a forgery! The real forger was...!\nApollo:\nThere can be only one explanation, really. The real identity of the forger known as Drew Misham is none other than... ...his only daughter, Vera Misham!\nJudge:\nOrder! Order! Order! ...Mr. Justice! This is going out on a limb, even for you!\nTrucy:\nI kinda agree. I mean, Vera, a forger?\nApollo:\nLet's consider it before you write it off entirely. If you look at the paintings in the studio, one fact becomes quite clear. Forgery had been taking place in that studio for quite some time! The forger wasn't caught in that trap seven years ago. This can only mean that the one who was caught in the trap wasn't the forger!\nJudge:\nWell... Actually, that does make a certain kind of sense.\nApollo:\nOne more thing! Only two sets of fingerprints were found in the forger's studio. Drew Misham's... and Vera Misham's.\nKlavier:\n......\nApollo:\nIf we know that Drew Misham wasn't the forger... ...that leaves only one possibility, by process of elimination. The forger was Vera Misham. ...Well?\nKlavier:\n...... ...Fascinating!\nJudge:\nVera Misham...?\nVera:\n......\nJudge:\nYou've been paying attention to the trial so far?\nVera:\n......\nKlavier:\nLet's just ask her and be done with it, shall we? Who are you? Who is the forger, Drew Misham?\nVera:\n...... ...! ......\nApollo:\n(Was that... an expression of emotion I saw on her face? She's staring holes into Prosecutor Gavin's face...)\nKlavier:\n...I'm used to being stared at by Fräuleins, believe me. Though they usually talk to me, too. Tell us. Were you the one who forged those works of art?\nVera:\n...... ...Yes...\nApollo:\n...!\nJudge:\nSo... so the forger, Drew Misham was... you!?\nVera:\n...... ...Yes, it was me...\nJudge:\nWha... Whaaaaaaaaaaaaaaaaaaaat!?\nApollo:\n(The court was in an uproar, and it wasn't coming down. We had to break for a ten minute recess.)\nTo be continued.\nOctober 8, 1:24 PMDistrict CourtDefendant Lobby No. 6\nTrucy:\nOK... So where exactly does this leave us, Apollo?\nApollo:\nWell, the Drew Misham who was killed... ...wasn't \"Drew Misham the forger\", basically.\nTrucy:\nHuh? Well then, who was he?\nApollo:\nWell \"he\" was actually...\nVera:\n......\nApollo:\n(...Doing her nails.) So, you really made those forgeries?\nVera:\n...... ...Yes... For Father... ...I know it was wrong...\nTrucy:\nCould you tell us how it happened?\nVera:\n...... ...My father was a painter... ...I love painting ever since I was a child... ...One day, Father saw it in me... ...He saw that I had the \"talent\"...\nTrucy:\nThe talent... for making forgeries?\nVera:\n...How should I say it? It was not only paintings I made... ...Given the materials, I could make... anything...\nApollo:\nAnything...?\nVera:\n...Father was so proud, and I, so happy... ...But, in the end, I was making... those...\nApollo:\n...Forgeries.\nVera:\n...I've never had a good constitution, nor... personality... ...I know very little of the world outside my door... ...... ...Now, because of me... Father... is...\nTrucy:\n...Do you know about this red envelope?\nVera:\n...I remember that envelope. It was some time ago...\nApollo:\nSo, you were already a, um... You were already creating your \"works\" back then?\nVera:\n...I started when I was only twelve years old...\nApollo:\nSo the one who figured out the stamp was poisoned, that was...\nBailiff:\n...Mr. Justice! It's time! To the courtroom, please!\nApollo:\nR-Right! (Out of time...)\nTrucy:\nWait, Vera! Just one more thing, please! Those three paintings in the studio...\nVera:\n...I painted those, as part of my work...\nTrucy:\nRight. See, we checked them out and we saw what was underneath. We saw the rough sketches underneath the three finished paintings...\nVera:\n...I see... ...... ...Mr. Justice...\nApollo:\n...Yes!?\nVera:\n...Father... He knew of you... ...Of both of you...\nApollo:\nYour late father...?\nVera:\n...He was watching, gathering information... ...All about the \"Wright & Co. Law Offices\"...\nTrucy:\nB-But lately, we're not doing just law...!\nVera:\n...Yes... You do tricks, gags to amuse... and play piano...\nTrucy:\nWell, they're not really \"gags\"...\nVera:\n...Yet when Father heard you had resumed the legal business... ...How pleased he was...\nTrucy:\n...Who was Mr. Misham?\nApollo:\n...How'm I supposed to know?\nTrucy:\nWhat if he was Daddy's Daddy?\nApollo:\nJudging from the relative ages involved, I'd say it's highly unlikely. (Things are already confusing enough with all these daddies running around. We know that the victim's daughter, Vera, was the forger. What does this mean for the case...? Guess we're about to find out.)\nOctober 8, 1:36 PMDistrict CourtCourtroom, No. 3\nJudge:\nCourt is now back in session.\nVera:\n......\nApollo:\n(Vera seems pretty tense. She's practically chewing her fingernails clean off!)\nKlavier:\nPerhaps you could begin by telling us how it all worked. How did you set up this \"Drew Misham forger\" persona?\nVera:\n...... ......\nApollo:\n(There's that stare again... She's drilling more holes into his head.)\nTrucy:\nI know it's hard for you, but hey, he's a handsome guy.\nApollo:\nWhat's \"hard\"!?\nJudge:\nVery well, miss, if you would... ...did you really make those detestable forgeries...?\nVera:\n...!\nKlavier:\nPerhaps you'd rather answer my question? Were you the one who painted that painting. The remarkably similar one?\nVera:\n...Ah... Yes... ...I painted it, yes... ...Father praised me quite highly for it...\nJudge:\nSo... she was the one who made the forgeries.\nKlavier:\nYet, she did not wish to reveal the truth of their operation. So the victim was a stand-in, a decoy. To the world at large, he was the forger, not her.\nVera:\n...... ...I've done... a bad thing. I have, haven't I...?\nKlavier:\nRegardless, we need a little more information. About, for instance... ...this!\nApollo:\n...!\nKlavier:\n...You have seen this before, ja?\nVera:\n...Y-Yes... It was in the desk drawer...\nJudge:\nVery well, you may proceed with your testimony. Tell us everything you know about this envelope.\nWitness Testimony\n-- The Red Envelope --\nVera:\n...I created things and Father sold them...\n...This envelope came after my first work... that was other than a painting...\n...Father handled the deal, all of it...\n...I received the stamp that was in that envelope...\n...It was after that job that we moved to the current studio...\nJudge:\nHmm... There certainly was much of great interest in your testimony.\nKlavier:\n...Not that the witness realizes it.\nJudge:\nVery well, please begin the cross-examination!\nApollo:\nRight! OK! (I need more information about this \"forger\"... ...This \"Drew Misham\"...)\nCross Examination\n-- The Red Envelope --\nVera:\n...I created things and Father sold them...\nVera:\n...This envelope came after my first work... that was other than a painting...\nVera:\n...Father handled the deal, all of it...\nVera:\n...I received the stamp that was in that envelope...\nVera:\n...It was after that job that we moved to the current studio...\nVera:\n...The stamp was a picture of my favorite magicians... so I kept it...\nApollo:\n(The red envelope came after she'd completed her first \"job\"... That makes it a letter from her client... whoever wanted a forgery made.)\nTrucy:\nApollo...!\nApollo:\nWe're close. We just have to piece together the parts: A deadly weapon in a red envelope... ...and the path it took to take Drew Misham's life.\nApollo:\nThose magicians you liked, was it this bunch!?\nVera:\n......\nTrucy:\nApollo! They're not a \"bunch\"!\nJudge:\nHmm... I see! Still, I have to wonder. Why include a commemorative stamp like that in a business letter?\nApollo:\nGood question!\nTrucy:\nWell, pretty stamps are always better, and you can't beat Troupe Gramarye!\nJudge:\nBut, the whole murder plan was a failure because of it. Ironic, don't you think. ...Prosecutor Gavin?\nKlavier:\n......\nJudge:\n...Prosecutor Gavin?\nKlavier:\n...... Gram... Gram... Gramarye.\nApollo:\n(What's with Gavin...?)\nKlavier:\n...Might I ask just one question of this witness?\nVera:\n...?\nKlavier:\nIn your testimony just now, you stated... ...this was your \"first work that was other than a painting\".\nVera:\n......\nKlavier:\nPlease, tell me... ...what exactly did you make?\nVera:\n...... ...Can I ask why--\nKlavier:\nNo! Answer the question! ...Now!\nVera:\nEeeeeeeeeek!\nJudge:\nP-Prosecutor Gavin...? You're usually not the one whose volume concerns me.\nKlavier:\n...Yes, it is unbecoming of me. I apologize. But... I must know. Please, Ms. Misham, tell me.\nVera:\n...... ...It was... a book... ...A single page... In a \"book\"...\nKlavier:\nA \"book\"...? Please be more specific.\nVera:\n...... ...It was a handwritten book. Like... Like a diary...\nKlavier:\n...... Nnnno! I don't... No!!!\nTrucy:\nWh-What's wrong with Prosecutor Gavin? He looks like he just saw a ghost!\nKlavier:\n...Ms. Misham. This \"book\"... ...was there a picture of a silk hat on the back cover? Yes or no!?\nVera:\n...! ...How... How did you know...?\nApollo:\nApollo:\n...Prosecutor Gavin! The defendant is answering all of your questions! Stop badgering her!\nKlavier:\n...... He's told you nothing, has he? ...Your soiled, sullied mentor. Nothing!?\nApollo:\nSullied... who?\nKlavier:\nPhoenix Wright. Who else!?\nTrucy:\n...Daddy?\nKlavier:\nHe never told you about the trial, seven years ago? About how he came to lose his attorney's badge...\nApollo:\n...!\nKlavier:\nIt was a certain piece of evidence that decided his fate, you know. ...A certain diary. On the back, it bore the mark of a silk hat.\nApollo:\n...Whaaaaaat!? (Phoenix Wright, tossed out of the profession by false evidence... And the forger who made that evidence... ...is this girl standing right in front of me!?) Vera! You must tell us! The evidence you made was used in a trial seven years ago. Who asked \"Drew Misham\", you, to forge that evidence!? ...For all of our sakes, who was it!?\nVera:\n...... ...We... only met once...\nApollo:\nYou... You met the client!? Well, who was it!?\nVera:\n...It was... ...It was... ......\nTrucy:\nWhat's going on with Vera? She's staring at Prosecutor Gavin's face again...\nKlavier:\nYes, what? Is there something about me...?\nVera:\n...... ...I remember clearly... ...I remember who gave me the book... the diary... ......\nApollo:\nWho was it!?\nVera:\n...... Ugh...! *choke*...!\nApollo:\nVe... Vera!!!\n...The... De... vil......*thump*...\nDefendant Vera Misham -- Condition: unconscious. Examiner's diagnosis: Acute atroquinine poisoning.\n...This ends the recording of the trial for the murder of Drew Misham. Vera Misham was, during the trial, poisoned by an unknown assailant. The dosage was just under the lethal amount, sparing the defendant's life. She is currently in intensive care, and is not to be disturbed for any reason. ...A very simple case, at first glance... ...until it finally began to show its true colors. The long road to the truth takes us to the record of another trial. In some ways, that was the starting point of it all. And that is where we must go... ...to find the whole truth.\nTo be continued....Showdown time.\nI... I lost.\nIt's only a game of poker.\nA game I've played for a long time... and only lost twice.\n...Who was the first?\nThe man I \"killed\"... of course.\n......\n...Well. It seems I've found the partner I've been looking for all along.\n...Over a game of cards?\nWhy, yes. Over a game of cards.\nPhoenix:\nThat was how we first met. ...Seven years ago.\n-- Seven Years Earlier --Phoenix Wright's Final Trial\nApril 19, 9:27 AMDistrict CourtDefendant Lobby No. 2\nPhoenix:\n(Whew, OK. It's been a long time since I've felt like such a rookie. Got to try and relax.) Ah, good morning, Mr. Enigmar.\nEnigmar:\nI'm... sorry to have sprung this on you so suddenly.\nPhoenix:\nI received the files from your previous attorney only yesterday. Honestly, I'm not entirely sure I'm prepared.\nEnigmar:\n...I understand I am asking the impossible of you.\nPhoenix:\nYes, well, you haven't really told me what happened yet! All we did... was play cards.\nEnigmar:\nAnd that was enough.\nPhoenix:\n(Actually, it wasn't. Trust me.)\n???:\nOoh! Morning, Daddy!\nEnigmar:\nAh, I'm so glad you came.\n???:\nYou OK, Daddy? They picking on you?\nEnigmar:\nHa ha ha ha ha ha ha. I am fine, as always. This old boy is here to help me, after all.\nPhoenix:\n(That's \"young man\" to you.) Good morning. That's a cute outfit you have on.\n???:\nThanks! My first show's today, after all!\nPhoenix:\nOh, I'm sure it is! (What the heck is she talking about?)\n???:\nOh... Old boy!\nPhoenix:\nHuh? Me? (Look what he's started.)\n???:\nUm, uh... Here.\nPhoenix:\nWhat's this...?\n???:\nI dunno! I just got it over there in the hall. They told me to give it to the \"old boy in the blue suit with the spiky hair\". They said it was really important!\nEnigmar:\n...What's this? A memo for you or some such?\nPhoenix:\nHmm... Not from the looks of it. (What is this? Looks like a page from someone's diary.) I'll give it a read later.\nNotebook Page added to the Court Record.\nEnigmar:\nWell, how do you feel about the trial today?\nPhoenix:\nWe'll get through it. Somehow. Incidentally... the prosecutor today is a new guy, I hear.\nEnigmar:\nAh... An easy win, then, yes?\nPhoenix:\nThey're calling him a \"true thoroughbred in the history of the prosecutor's office\". ...Of course, there's one of those every year.\nEnigmar:\n...The switching of attorneys just before the trial... ...I know it is a difficult situation I put you in. But... allow me to say one thing, Mr. Wright.\nPhoenix:\n...Yes?\nEnigmar:\nThey will not be able to pronounce me guilty today. So, do your best, but do not worry.\nPhoenix:\n(First time a defendant's ever given me a pep speech...) I'll do what I can.\nEnigmar:\nHa ha ha ha ha ha ha. I see you do not understand. You see, it will be impossible for them to declare a verdict.\nPhoenix:\nI-Impossible?\nEnigmar:\nYes. Isn't that right, Trucy?\nTrucy:\nYup! You bet, Daddy.\nPhoenix:\n(My first look at the case was only yesterday. And the information I was given was a tad bit lacking, to be honest. Still, I'll do what I can. ...For their sake.)\nEnigmar:\nI believe the curtains will be lifting any time now. I am in your capable hands, Mr. Wright.\nPhoenix:\nMy client is Shadi Enigmar. Known to the world as Zak Gramarye. A wildly popular magician, star of Troupe Gramarye. His mentor, Magnifi Gramarye, was a rare breed of magician. He single-handedly ushered in a golden age of stage magic... until he was shot dead. And Zak Gramarye is the suspect.\nApril 19, 10:00 AMDistrict CourtCourtroom No. 7\nJudge:\nCourt is now in session for the trial of Shadi Enigmar.\nPhoenix:\nThe defense is ready, Your Honor.\n???:\n......\nJudge:\nIs the prosecution ready?\n???:\nI was just thinking, is this what all the fuss is about? Bit of a buzz-kill, really.\nJudge:\n\"Buzz-kill\"...? Is this some new kind of crime?\n???:\nOne of the worst. This is a trial, ja? Where are the sweaty palms? The pounding hearts? A Gavinners concert's got ten times the thrill this gig's got.\nJudge:\nWho... were you, again?\nKlavier:\nKlavier. Klavier Gavin. I came... to get the party started. Legally, ja?\nJudge:\nGavin? Defense Attorney Kristoph Gavin's...?\nKlavier:\nAh, figures my bro's more famous in this part of town.\nPhoenix:\n(Klavier Gavin... Lead singer for the megahit band, the Gavinners. You're out of your league, rock-boy.)\nKlavier:\nI know what you're thinking: \"You're out of your league, rock-boy.\"\nPhoenix:\n......\nKlavier:\nTrue, my debut single, \"13 Years Hard Time for Love\", went platinum overnight... ...but that's just a hobby to me compared to this, ja?\nPhoenix:\n...Talkative, aren't you? I like your affected Euro-rock accent, by the way.\nKlavier:\nI'm just getting warmed up, Herr Attorney Wright.\nJudge:\nPerhaps you would be so kind as to fill us in on the case?\nKlavier:\n...Achtung, baby. Time to call on the opening act. ...What was his name again? Ah yes... Detective Gumshoe! Hit it!\nKlavier:\n...And you are?\nGumshoe:\nHey, you were the one who called me up here... sir. Name's Dick Gumshoe. I'm a homicide detective down at the precinct.\nPhoenix:\n(Detective Gumshoe... Long time no see.)\nGumshoe:\nHey, you!\nPhoenix:\nH-Huh? Me?\nGumshoe:\nToday's the day, pal. Today, I win, and you lose! I got confidence in my testimony today, see.\nPhoenix:\n(What, you normally lack confidence in your testimony...?)\nKlavier:\n...Herr Detective, this is my stage. Can the antics.\nGumshoe:\nHuh...?\nKlavier:\nAll this \"hey you\"-ing and such. And I could care less about your history together.\nGumshoe:\nUrk.\nJudge:\n...Very well, Detective Gumshoe, if you would. Please tell us about the case at hand.\nGumshoe:\nIt happened six days back, in a room at the General Hospital! The facts are as simple as they come. Here's the crime scene. The victim was a patient, asleep in a hospital bed. The killer comes in, puts a pistol to his forehead, and bam. Lights out. ...Them's the facts.\nJudge:\nHmm... Not so long ago, the victim, Magnifi Gramarye was a famous man. He had the entire country under his \"magical spell\", as it were.\nKlavier:\nAh yes, the great magician. He retired years ago, though. Say the name \"Magnifi\" to one of my generation... and you'd be lucky to get a blank stare.\nJudge:\nYes, though I'm sure the youngsters today know his disciples even better. I daresay Troupe Gramarye has made quite a name for themselves.\nGumshoe:\nAnyhow, the retired Magnifi's been in the hospital for the last year. Hmm, what was it? A mall-ignorant tutor or something. Doing something to his liver, I think. Yeah.\nJudge:\nA \"malignant tumor\", perhaps?\nKlavier:\nIn other words, he had liver cancer. He had only three months left to live, in fact.\nMagnifi's Chart added to the Court Record.\nJudge:\nHmm... The facts do seem simple enough. But... something's not right.\nKlavier:\n...The victim was already climbing a three-month stairway to heaven. ...Why not wait for him to knock-knock-knock on heaven's door? Why shoot him?\nPhoenix:\n(I wouldn't have put it quite so lyrically, but it's true. Why make the effort to commit murder when the victim was about to die?)\nGumshoe:\nIncidentally, the victim had a serious case of diabetes.\nPhoenix:\nDiabetes?\nKlavier:\nIn fact, he was about to \"shoot up\" with insulin... ...when he was shot with a pistol. The syringe was found at the crime scene. Chronic diabetes... and cancer. As much as it pains me to say it... ...the victim was clearly at the end of his life.\nSmall Syringe added to the Court Record.\nJudge:\nHmm... I believe the question before us is clear, then. Why did the killer have to shoot this dying man? What reason could he have had?\nKlavier:\n...Very well, Detective. Perhaps you can enlighten us as to the circumstances of the shooting.\nGumshoe:\nY-Yes, sir!\nWitness Testimony\n-- The Circumstances --\nGumshoe:\nActually... the victim kind of ordered the defendant to do him in.\nA few days before it happened, the victim sent a letter \"ordering\" his own murder.\nThe defendant did what was asked of him, and shot the old man in the forehead!\nThe bullet was fired from the pistol found at the scene, no doubt about it.\nAnd the pistol definitely belonged to the old man, sir!\nJudge:\nWh-Whaaat!? You're saying the victim ordered his own shooting?\nKlavier:\nThose are the facts. I have here the letter in question.\nMagnifi's Letter added to the Court Record.\nJudge:\n...Very unusual, indeed! Although, could such a thing as a letter really cause one to pull a trigger, I wonder?\nKlavier:\nI believe the answer to that question can be found at the end of the letter.\nJudge:\nAh... \"You cannot refuse, and we both know the reason why.\" Detective Gumshoe, can you explain this to the court?\nGumshoe:\nUnfortunately, even the defendant won't say a peep about that bit, sir.\nPhoenix:\nOne thing bothers me about this. Why didn't he just say \"11\"? Why have him come at \"11:05\" without some specific reason...?\nKlavier:\nThe devil is in the details, Herr Attorney...\nJudge:\nWell? Was there some reason?\nKlavier:\nAs it turns out, there was. Every night, for a half hour, starting at 11:00... ...the victim, Magnifi Gramarye, was given an IV.\nPhoenix:\nAn IV...?\nJudge:\nThere it is in the picture, off to the side of the bed.\nKlavier:\nAt 11:00, a doctor would come to set up the IV. Thirty minutes later, he would come back for the empty bag. This happened every night, without fail.\nPhoenix:\nSo that was the only time they could meet without the chance of an untimely interruption. ...During his IV.\nJudge:\nVery well, shall we begin? ...Mr. Wright, your cross-examination, if you would!\nPhoenix:\n(What's this \"reason he couldn't refuse\", I wonder? He could have at least mentioned it to me...)\nCross Examination\n-- The Circumstances --\nGumshoe:\nActually... the victim kind of ordered the defendant to do him in.\nGumshoe:\nA few days before it happened, the victim sent a letter \"ordering\" his own murder.\nGumshoe:\nThe defendant did what was asked of him, and shot the old man in the forehead!\nGumshoe:\nThe bullet was fired from the pistol found at the scene, no doubt about it.\nGumshoe:\nAnd the pistol definitely belonged to the old man, sir!\nGumshoe:\nSo what if he shot the clown? He still shot the victim, pal!\nPhoenix:\n(...I didn't have time to gather all the details before coming in here. This testimony might be my only source of information. Better pay attention... and read this letter carefully.)\nPhoenix:\nThe trickiest cases often seem the simplest. Prosecutor Gavin, you missed the bullet hole in the clown's forehead. If you hadn't missed that, you might have come to a very different conclusion. ...Understand?\nGumshoe:\nY-Yeah, but like I just said, pal... ...after he shot the clown in the forehead, he went and...\nPhoenix:\nPhoenix:\n...Did nothing of the sort to the victim. The pistol proves he could not.\nJudge:\nThe murder weapon? How?\nPhoenix:\nIt's quite simple, Your Honor. This pistol only holds one bullet at a time.\nGumshoe:\nAh...!\nPhoenix:\nIf he had shot the clown in the forehead... ...he couldn't have shot the victim, too!\nGumshoe:\nYeeeeeeeeeeeeeargh!\nKlavier:\nKlavier:\nTh-That's not a contradiction. Not even close! All he had to do was reload the pistol after the first shot!\nPhoenix:\nPhoenix:\nOh? Where did he get the extra bullet? They're not so easy to come by, you know. If you claim the defendant \"had one ready\"... ...then prove to us how he got it!\nKlavier:\nUrk...! ...... Heh... Ha ha ha... I had a feeling this wasn't over yet. No... this party's just getting started. And I haven't proven anything yet, beyond my good looks, and startling record sales.\nPhoenix:\n(And utter lack of humility.)\nJudge:\nHmm... Ah... what's this? It seems that the prosecution has another witness prepared.\nKlavier:\nLike I said, Herr Detective was just the warm-up act.\nGumshoe:\n...Ugh.\nKlavier:\nNow that the audience has gotten a taste of what's to come, they're ready.\nPhoenix:\n...Ready for what?\nKlavier:\nFor my decisive witness, of course. A witness who, you will find, can prove one thing for us: That it was Zak Gramarye who shot the victim in the forehead!\nJudge:\n...Very well. We will pause for a 15-minute recess.\nPhoenix:\n(This might be my lucky break... I'll need that 15 minutes to talk to my client... Zak.)\nJudge:\n...Court is adjourned!\nTo be continued.\nApril 19, 11:21 AMDistrict CourtDefendant Lobby No. 2\nZak:\nVery impressive, Mr. Wright. I have to say, I expected nothing less.\nPhoenix:\n...We've only just begun. I was hoping you could tell me a bit more about what happened, actually.\nZak:\nI did not think you would believe me if I told you. Better that you discovered the truth for yourself. I was thinking of you, you know.\nPhoenix:\nI think we need less thinking and more talking! That night in the hospital... What really happened?\nZak:\nAh, the way your eyes gleam, Mr. Wright... ...you'll scare Trucy.\nPhoenix:\n(Speaking of which, where is she?)\nZak:\nYou have seen the problem yourself: the letter.\nPhoenix:\nThe \"one shot in the forehead\" one, right?\nZak:\nYes, and the reason he speaks of. I could not deny my mentor's wishes... even if it meant my own death.\nPhoenix:\nWhy not...?\nZak:\nThis is something I will not say... for now, at least.\nPhoenix:\n(What's this \"for now\" business?)\nZak:\nI have done many things in my life, some well, some poorly. But this is a cross we must bear alone to our graves.\nPhoenix:\n...\"We\"?\nZak:\nYou wanted to know about the night of the incident?\nPhoenix:\n(Finally... This guy sure likes to take his time getting to the important stuff.)\nZak:\nOf course, I had no intention of shooting my mentor. I snuck into his room that night at the appointed time. And found there upon his bedside table two pistols.\nPhoenix:\n...\"Two\"?\nZak:\nYes. The one I had used on stage... ...and the one that had been used by my partner, Valant.\nPhoenix:\nOh, for the \"Zak & Valant's Quick-Draw\" thing?\nZak:\nMy mentor... had the look of one sleeping. I stood by his bedside, hearing only the light sound of his breathing. ...Then I took the pistol into my hand. I cannot deny that my resolve faltered then, for a moment.\nPhoenix:\nYou \"faltered\"...? You mean you thought about shooting him?\nZak:\nRecall there was a reason I could not refuse his request. His last such request... though not his first.\nPhoenix:\nSo... there were other requests you \"couldn't refuse\" before?\nZak:\nTo be honest, I've not always been steadfast... and I fear I've brought pain upon Trucy.\nPhoenix:\n(Was Magnifi coercing his disciples somehow? Just what was going on in Troupe Gramarye...?)\nZak:\nYet... in the end, I did not shoot him. Instead, I turned and shot the clown! I took the pistol I had fired and placed it in my pocket.\nPhoenix:\nIn your pocket?\nZak:\nI believe if you examine the bullet in the clown's head... ...you will find it to be different than the one in my mentor. The... What were those called?\nPhoenix:\n\"Rifling marks\".\nZak:\nYes. Well, that is all I have to tell you... concerning the case.\nPhoenix:\n\"Concerning the case\"...? You mean, there's something else you can tell me?\nZak:\nHeh... Ha ha ha! You are a fascinating man, Mr. Wright.\nPhoenix:\n...Thanks?\nZak:\nYes... there is something. My mentor... his eyes opened.\nPhoenix:\nWhat!? Magnifi Gramarye...?\nZak:\nThe old devil. He was not asleep, you see. ...Of course, the gunshot would have woken him anyway. And there we had our last discussion as mentor and pupil. It was not a long discussion. Maybe five, ten minutes or so.\nPhoenix:\nWhat did you talk about...?\nZak:\nHa ha. Mr. Wright. ...Did I not just tell you? It does not concern this case.\nPhoenix:\n(Zak Gramarye... He seems pretty steadfast to me... or maybe just stubborn.)\nBailiff:\nMr. Wright! Your presence is requested in the courtroom!\nZak:\nOnce again, I am in your hands.\nPhoenix:\n...Right. Let's get back in there.\nApril 19, 11:37 AMDistrict CourtCourtroom No. 7\nJudge:\nCourt is now back in session.\nKlavier:\nDuring our recess, a bullet was found in and dug out from the clown's head.\nJudge:\nWell! This is news! And the rifling marks...?\nKlavier:\nThere wasn't time to do a detailed analysis. Though they did find the weapon type matches the murder weapon.\nJudge:\nHmm... Well, that's not very conclusive, is it?\nKlavier:\nWhich is why I'm about to call my very decisive witness.\nPhoenix:\nYour \"decisive witness\"? How many times have I heard those words... ...though they often turn out to be far less decisive than you think.\nKlavier:\n...Oh, don't worry on my account. I'm quite confident this witness will do the job. After all, he is intimately acquainted with the players in our little production... ...being the other half of Troupe Gramarye's famous duo... \"Zak & Valant\"!\nPhoenix:\n(Valant Gramarye... So, we get to meet the Great Magnifi's other disciple!)\nKlavier:\nPerhaps we'll start by asking your name and occupation?\nValant:\nValant Gramarye... Magician.\nJudge:\nEr, and you're the \"decisive witness\", are you? You can prove your fellow student... your partner's guilt?\nValant:\n\"Fate\"... the grand illusion, filled with traps and tricks.\nPhoenix:\nW-Wait! The shooting took place in that hospital after 11 o'clock at night! If you're a \"witness\", does that mean you were there that late?\nValant:\nIf one were to deduce this logically, the conclusion is... yes!\nPhoenix:\nUm... OK. (I always get the characters, don't I?)\nKlavier:\nI have an interesting fact for you. You see, several days before the crime... ...my witness received this.\nJudge:\nThat... looks very familiar...\nPhoenix:\nW-Wait... That's the same letter Zak Gramarye received!\nValant:\nYes. Or perhaps I should say \"ta da\"!\nJudge:\nOrder! Order! Order! And what does it say? Surely not the same thing!\nKlavier:\nPerhaps you should see for yourself.\nJudge:\nWhy, it's practically the same! The court accepts this into evidence!\nMagnifi's Second Letter added to the Court Record. (Changed from [Magnifi's Letter 2 added to the Court Record.] in the original release)\nJudge:\nThis is most unusual... Exactly what was going on with you folks? What exactly was your \"Troupe Gramarye\" up to?\nValant:\n...By which you mean?\nJudge:\nI'm just having trouble envisioning a man who would ask his students to kill him. Both of them, no less!\nKlavier:\nIt's just my opinion, Herr Judge. But from these letters, I'd say he was coercing them, not asking them.\nValant:\nWe walked the magician's path together, and in so doing, shared much of our lives. When people are so close, there is strain... a warping of relations, you might say. ...Yet this has nothing to do with the case at hand.\nPhoenix:\n(By which you mean you're not going to tell us. ...Which makes me wonder even more about this \"reason they couldn't refuse\".)\nJudge:\n...Well, let's get on with the testimony for starters. The defendant, Zak Gramarye stands accused. Tell us why.\nValant:\n...Oh, I'll do more than that. \"For where he walks, the red roses rise singing hymns to the miracle that is magic!\"\nPhoenix:\nFascinating. Though, I hardly need to remind you... ...that the evidence could just as clearly point to you as the suspect. The letter, the murder weapon... ...and now, the two bullets found at the scene.\nJudge:\nIn fact, the only difference seems to be the designated time...\nValant:\nHa ha ha ha ha ha ha ha! As every magician knows... timing is everything.\nKlavier:\nYes... And now it's time to get this party fired up!\nWitness Testimony\n-- The Night of the Crime --\nValant:\nThat night, I visited the hospital room at the time Magnifi requested.\nThe smell of gunpowder hung in the room... and my mentor had taken his final bow.\nI did not imagine my fellow student might have received the same instructions!\nYet a deal with the dead is still a deal. Death's sweet kiss... I gave to the clown.\nThen I informed the doctor and the police.\nJudge:\nHmm... So you were the one who reported the crime?\nValant:\nIndeed. I would think... ...this fact alone would clear my name of suspicion!\nPhoenix:\nLet's not jump to any conclusions!\nJudge:\nYes, the cross-examination generally comes before the conclusions in this court. But, if your testimony proves to be true... ...then the defendant, Zak Gramarye, is guilty.\nPhoenix:\n(And if it wasn't Zak Gramarye, then the killer was you, Valant! And no disappearing act will get you out of that.)\nCross Examination\n-- The Night of the Crime --\nValant:\nThat night, I visited the hospital room at the time Magnifi requested.\nValant:\nThe smell of gunpowder hung in the room... and my mentor had taken his final bow.\nValant:\nI did not imagine my fellow student might have received the same instructions!\nValant:\nYet a deal with the dead is still a deal. Death's sweet kiss... I gave to the clown.\nValant:\nThe pistol was already loaded. I merely had to pull the trigger.\nValant:\nI took up the pistol from the small table and shot the clown.\nValant:\nOnly one pistol was in the hospital room that night. With it, I shot the clown.\nValant:\nThen I informed the doctor and the police.\nPhoenix:\n(Both of Magnifi's students received the same letter. Both admit to having gone to the hospital that night. Two bullets were fired... and one of them killed Magnifi! Time to find the cracks in his testimony...)\nPhoenix:\nAccording to the defendant, Zak Gramarye, when he entered the room... ...there were two pistols on that table.\nJudge:\nTwo...?\nPhoenix:\nOne of those pistols he used to shoot the clown in the forehead. Then he left with it in his pocket.\nKlavier:\nOf course, this is what he would say. Unlike the hapless clown, we must assume our defendant has some brains in his head.\nPhoenix:\n...Well, what about what Mr. Valant has told us? You see, there's something about his testimony that doesn't make sense.\nValant:\n...What might that be? I told you, I took the pistol that was there, and shot the clown...\nPhoenix:\nThat's your story, at least.\nValant:\n...?\nPhoenix:\nBut the rifling marks tell a very different story, Mr. Valant. Recall what Prosecutor Gavin told us!\nKlavier:\nWe compared the bullet taken from the victim's skull with a bullet fired from this gun. The rifling marks on the bullets were a perfect match.\nValant:\nAh...\nPhoenix:\nMr. Valant, if you fired this pistol... ...then YOU shot the victim in the forehead!\nJudge:\nOrder! Order! Order!!! Well, this is all rather sudden...\nKlavier:\nKlavier:\nHeh heh heh heh... What have I done?\nJudge:\nP-Prosecutor Gavin?\nKlavier:\nI owe the court an apology. ...Sorry.\nPhoenix:\nS-Sorry for what!?\nKlavier:\nYou see, I was unaware that two of these unique pistols were crafted. The analysis of the rifling marks only proved the type of gun that fired them.\nPhoenix:\nPhoenix:\nBut... But that's not what you told us before! You said you'd verified the murder weapon!\nKlavier:\nWhich is why I'm apologizing to you now. Quite sincerely, I might add. ...Would you hold me accountable for a mistake made in my youth?\nPhoenix:\nThat was just this morning!\nKlavier:\n...I am still young. And, I might add, it wasn't really my fault. If the defendant had only admitted he took one pistol from the scene of the crime... ...we would not be having this pleasant discussion now.\nPhoenix:\n...!\nJudge:\nHmm. Valant Gramarye?\nValant:\n...Yes, Your Honor?\nJudge:\nYou were presented to this court as a \"decisive witness\". But you've proven to be more \"divisive\" than \"decisive\".\nKlavier:\nKlavier:\n...You'll see, in time.\nPhoenix:\n...!\nKlavier:\nThe testimony so far has merely been a review of the \"facts\". The proof... comes next.\nJudge:\nCare to elaborate, Prosecutor Gavin?\nKlavier:\nWhen Mr. Valant entered the hospital room, the victim had already been shot. As his next testimony will prove! Herr Wright, the real fight is about to begin.\nPhoenix:\n(...Bring it.)\nJudge:\nVery well. The witness will now testify to the court. Help us determine who shot what!\nWitness Testimony\n-- Who Shot What --\nValant:\nI arrived in the hospital room at the appointed time, which is to say 11:20 PM.\nAfter discovering the body, I fulfilled my obligation... then called in the doctor.\nThe doctor examined the body before the police arrived...\nHe was quite clear about the time of death: 11:10 PM.\nAnd the one in the room at the time was my partner... not me.\nJudge:\nHmm... Those times are rather close, you have to admit. You're talking about an alibi established over a matter of minutes. To use a 10-minute discrepancy as the basis of your alibi...\nKlavier:\n...Is easy to explain in this situation, Herr Judge. For example... ...take our debut hit single, \"13 Years Hard Time For Love\". Cue to the song, press the play button, and it will play for 2 minutes, 15 seconds. Do it a hundred times, the result is the same.\nPhoenix:\n(Their debut single was only 2 minutes and 15 seconds long? What a rip-off!)\nKlavier:\nMagic is a world of utmost precision! Hocus pocus... requires admirable focus. And in the time of death determined by the doctor there is an incontrovertible truth.\nJudge:\n...Very well. The prosecution warns us that we're dealing with rather precise times. And we can expect the cross-examination to require the same level of precision.\nKlavier:\nI would hope the defense refrains from its customarily broad, sweeping accusations. ...Lest we blur the focus this case so clearly demands.\nJudge:\n...Point taken. Baseless remarks will result in a penalty. Carry on, Mr. Wright!\nPhoenix:\n(Carry on... Right.)\nCross Examination\n-- Who Shot What --\nValant:\nI arrived in the hospital room at the appointed time, which is to say 11:20 PM.\nValant:\nAfter discovering the body, I fulfilled my obligation... then called in the doctor.\nValant:\nThe doctor examined the body before the police arrived...\nValant:\nHe was quite clear about the time of death: 11:10 PM.\nValant:\nThe water of life springs not eternal... The remaining IV liquid proves my innocence!\nValant:\nAnd the one in the room at the time was my partner... not me.\nPhoenix:\n(An alibi over a matter of minutes. Precise is right! Hmm. And pressing with impunity will earn me a nice penalty, too. Better focus on one thing... this \"time of death\".)\nPhoenix:\n...The crime scene tells all, Your Honor.\nJudge:\nThe photo of the crime scene?\nKlavier:\n...All this talk of color has me yearning for black and white, clear-cut simplicity. ...Tell us, Herr Wright, just where is the contradiction in this photo?\nPhoenix:\n...My pleasure. And, I assure you, it's quite simple. ...But I can't promise anything in black and white.\nJudge:\n...Let's hear what Mr. Wright has to say. What in this photo contradicts the witness's testimony?\nPhoenix:\n...Valant Gramarye! Let's get one thing straight about your \"lucky color\". ...It's \"yellow\", yes?\nValant:\n...Kind of takes the mystery out of it, but yes.\nJudge:\nSomething wrong with yellow, Mr. Wright?\nPhoenix:\nYes, there is. Decisively wrong, in fact. Take another look at the photo of the crime scene.\nJudge:\nWh-What's this...?\nValant:\nConfusion, doubt... tell us, what do your elderly eyes spy?\nJudge:\nEven my elderly eyes can see a problem here, Mr. Valant. Look at that IV bag!\nValant:\nAck! Wh-What is this...!? What foul mag... ick!\nPhoenix:\n...It would be hard to call the IV liquid \"yellow\". And I'm afraid, no magic was involved in the taking of this photograph.\nValant:\nAh... Alla... Allakaz... Allakanooooooooooooo!\nJudge:\nOrder! Order! Order!!! What does this mean!?\nKlavier:\nKlavier:\nThis... This is some kind of mistake!\nJudge:\nYes, Prosecutor Gavin... Your witness's mistake.\nKlavier:\n...!\nPhoenix:\n(The greener they are, the harder they fall... I suppose there's no substitute for experience.) Valant Gramarye, as you reminded us several times... ...your lucky color is yellow. But the IV is clearly not.\nValant:\nW-Well...\nPhoenix:\nThis contradiction can mean only one thing!\nKlavier:\nKlavier:\n...And to think... You almost had me.\nPhoenix:\n...?\nKlavier:\nI see your true colors now, \"ace attorney\" Phoenix Wright!\nJudge:\nSomething you'd like to tell us, Prosecutor Gavin? As far as this court can tell, the witness's testimony does contradict the evidence.\nKlavier:\nAh ha ha... Yes, a contradiction. One that I shall be pleased to hand right back to Mr. Wright!\nPhoenix:\nHow do you mean...?\nKlavier:\nHow? Because the witness has made no mistakes! I agree, at a glance, the IV liquid does appear a sort of greenish-yellow. But I assure you, the liquid itself is quite yellow.\nJudge:\nYellow liquid...? How can you say that? As far as I can tell from this photo, it's green...\nKlavier:\nYes, but what color is the IV bag itself?\nPhoenix:\nThe bag? You mean the plastic bag on the hook?\nJudge:\nHmm... It looks like a... I want to say \"light blue\"?\nKlavier:\nPrecisely. ...Figured it out yet? Put a yellow liquid in a blue bag and...?\nPhoenix:\n...You get green.\nKlavier:\nThis, incidentally, is the liquid's true color!\nJudge:\n...I see! Your explanation does have the ring of truth to it.\nPhoenix:\nPhoenix:\nAs I thought... There's no substitute for experience, Prosecutor Gavin.\nKlavier:\nWhat...?\nPhoenix:\nYou may tell a good tale. But. You've just proven something rather grave. For you, that is.\nKlavier:\nG-Grave?\nPhoenix:\nThe liquid in the IV is yellow, yes. ...But how did this witness know that?\nValant:\n...!\nPhoenix:\nIt's quite unnatural when you think about it. You... did think about it, didn't you?\nKlavier:\n...Ah... Urk!\nPhoenix:\nYour Honor! The defense requests an explanation from the witness! At the scene of the crime, the IV liquid appears to be green! ...So let me ask! How did the witness know the IV liquid was actually yellow!?\nValant:\nAllakazooooooooooomg!\nJudge:\nOrder! Order! Order!!! Mr. Wright! You will explain this at once! The witness clearly knew the color of the IV liquid... ...so I'm sure it means something, but what!?\nPhoenix:\n...I can think of only one possibility, Your Honor. The witness, Valant Gramarye... ...has testified that the IV liquid was yellow because...\nPhoenix:\n...From the facts before us, the answer is clear. The witness knew that the IV liquid was yellow. ...Why? Because he'd seen it before. But not inside the blue bag we see in the photo. He saw the liquid by itself, in a clear, colorless bag.\nJudge:\nI suppose he would have had to. But I'm still not clear as to what all this means.\nPhoenix:\nAsk yourself, why would he know, if he didn't work at a hospital? ...That's where you'll find your meaning, Your Honor.\nKlavier:\nKlavier:\nI'm afraid I find nothing. So what if he knew the IV liquid's color? Leave the getting excited over absolutely nothing to our teenybopper fans, ja?\nPhoenix:\nPhoenix:\nThe IV liquid is the only evidence \"proving\" the time of death. A 30-minute hourglass, with 20 minutes worth of sand remaining. Your claim, Prosecutor Gavin.\nJudge:\nI remember it well.\nPhoenix:\nHowever... ...there's a critical difference between an hourglass and an IV bag.\nJudge:\nW-W-Wait! I know!!! An hourglass uses sand, but an IV bag uses liquid... ...I'm right, right?\nPhoenix:\nAs much as it pains me to say this, Your Honor, no. Unlike the sands through an hourglass, IV liquid enters the patient's body. At which point, like magic, it disappears. However! What if the amount of IV liquid had increased? You couldn't tell, could you? After all, there's no way of knowing how much went in.\nKlavier:\nKlavier:\nLet me get this straight, Herr Wright. You're saying the witness watered down the victim's IV bag!?\nPhoenix:\nNot with water... but with IV liquid. That's how you knew the IV liquid was yellow!\nValant:\nNow wait. Wait. I said wait!!! How might an amateur such as myself assay to perform such a task?\nPhoenix:\nPhoenix:\nI'm an amateur, too, but I can pour water into a cup.\nKlavier:\nKlavier:\nI'm afraid there's quite a big difference between a cup and an IV bag. Quite. Can you prove our witness is capable of such a feat!?\nJudge:\nHmm... He has a point, amateurs. I, at least, would have some difficulty pouring IV liquid into that bag.\nPhoenix:\n(You don't need to be an expert to see the look on the witness's face! He added liquid to that IV to throw off the time of death!)\nKlavier:\n...I tire of these fairy tales lacking evidence.\nJudge:\nWell, Mr. Wright? Any solid evidence to bring us back down to earth?\nPhoenix:\n...Valant Gramarye. I'm afraid your \"magic\" won't serve you well in a life of crime.\nValant:\nMight I ask what you're strongly suggesting?\nPhoenix:\n...Magic relies on props. And props... become evidence. Our witness was certainly able to increase the amount of IV liquid in the bag. All he had to do was work a little magic. And the prop was...\nJudge:\nThe victim's syringe...\nPhoenix:\n...It's the perfect prop for the \"Magically Increasing IV\" trick! And easy enough for an amateur to use.\nKlavier:\nKlavier:\nWh-What kind of evidence is that!? The syringe was clean! Not a trace of liquid in it!\nPhoenix:\nPhoenix:\nAnd don't you find that odd, Prosecutor Gavin?\nKlavier:\nWh-What...?\nPhoenix:\nThe victim had the syringe to administer his insulin shots... ...There should have been traces of insulin left inside!\nKlavier:\n...!\nPhoenix:\nWell, Valant Gramarye? As you pointed out yourself, the IV liquid makes the perfect clock... ...one that you could manipulate at will!\nValant:\nAllak... Allakazzzzzzzaaaaaaaugh!\nJudge:\nI do believe... well, with this being his first... ...that the burden of this trial has been a bit too much to bear for Prosecutor Gavin.\nKlavier:\n......\nJudge:\nI'm afraid that, while there is a doubt as to the amount of IV liquid in that bag... ...the time of death cannot be proven. ...And that brings our trial to a close for today.\nPhoenix:\n(Well. Maybe I can squeeze an extra day out of this... I can do a little much-needed investigation work.)\nJudge:\nI see there are no objections, court is adjour--\nKlavier:\nKlavier:\nHeh. Heh heh heh! ...Truly, there's no substitute for experience. Nothing blinds one to the truth so effectively.\nPhoenix:\n...!\nKlavier:\nA word to the wise: Underestimate the young, and they'll sweep your feet out from under you. In a way you never, ever expected. ...You see, I know exactly what you're thinking.\nPhoenix:\n...? (What's he talking about?)\nKlavier:\nYou say the witness used the syringe to manipulate the level of the IV liquid. But there is no proof.\nPhoenix:\nThere's no proof he didn't do it, either.\nKlavier:\n...Yes, quite true.\nPhoenix:\n(Huh? He's admitting it?)\nKlavier:\nNor was this witness quite as decisive as I'd hoped. This, I admit. After all, why linger in the past, when the future holds so much?\nJudge:\nYou... have something in mind, Prosecutor Gavin?\nKlavier:\nProof, Herr Judge. I have another way to prove my case. ...With evidence, no less.\nJudge:\nWhat's this...?\nKlavier:\nThis... is the victim, Magnifi Gramarye's diary.\nPhoenix:\nDiary...?\nKlavier:\nAfter going into the hospital, Magnifi began writing his memoirs, it seems. The story of his birth, his startling debut... and of meeting his disciples. It seems he intended for the last chapter to end, quite appropriately, with his death.\nPhoenix:\nWait... That book doesn't say what the reason was, does it? The reason why his disciples couldn't refuse his last request?\nKlavier:\n...Sadly, it does not. What's important here... is on the last page. Apparently, the victim wrote in his journal that night. Even after the IV had begun at 11:00 PM. ...Let's read it, shall we?\nJudge:\nHmm... This does appear to have been written just before his death. The court accepts this into evidence.\nMagnifi's Diary added to the Court Record.\nKlavier:\nRead the very last part with particular care. \"This journal may end here or it may go on... but not long. That depends on his hand.\" Of course, by \"his\"... ...he refers to our defendant, Zak Gramarye.\nJudge:\n...That would make sense, yes. He was the first scheduled visitor, after all.\nKlavier:\nBut look at what he said before that! \"This journal may end here or it may go on.\" ...\"It may go on\"! Magnifi Gramarye intended to write again! That is... ...if Zak Gramarye didn't pull the trigger.\nPhoenix:\n......\nKlavier:\nI see the defense understands the meaning of this. The victim's diary does not \"go on\"... It ends! Because Magnifi's life was brought to an end by the defendant, Zak Gramarye!\nJudge:\nOrder! Order! Order!!! ...Prosecutor Gavin! Are you certain that Magnifi Gramarye wrote this!?\nKlavier:\n...There is no mistaking his handwriting.\nJudge:\nWell, this does seem to be significant. According to this, Magnifi did intend to continue his diary. Yet, if his diary ended here, which plainly, it did...\nKlavier:\n...Then the one who pulled the trigger was the first visitor. ...Zak Gramarye. Well, how do you like me now, Herr Wright? Still too \"green\" for your tastes? Hmm?\nPhoenix:\n...... (He's right about the diary being pretty clear. Still I find it hard to believe... ...that he'd overlook such an obvious problem with his precious evidence!)\nJudge:\nWell, Mr. Wright? The witness's testimony we heard was lacking... ...but put together with this evidence, it seems quite sufficient for a case.\nPhoenix:\n(...If the diary is accepted like this, the trial's over. Hmm. Maybe it's time for me to show them something.)\nPhoenix:\nI'm left with no choice but to show my own evidence.\nJudge:\n...What!? You have some evidence that overturns this diary!?\nKlavier:\nHmm... ...It's not too late to rethink this and avoid more... embarrassment. (Changed from [...It's not to [sic] late to rethink this and avoid more... embarrassment.] in the original release)\nJudge:\nVery well. Please show us your evidence, Mr. Wright.\nKlavier:\nIncidentally, don't even think of showing us this diary I've just shown the court.\nPhoenix:\n...!\nKlavier:\nNow that we've come this far, I hope you have something a little more... decisive. Show us evidence that proves the victim continued writing his diary!\nPhoenix:\n...Alright. I'd be happy to. The decisive evidence proving that the diary didn't end with this page is...\nPhoenix:\nFirst... take a close look at this diary. ...Note that a page has clearly been ripped out!\nJudge:\nWhat's this...!? ...I hadn't noticed that at all.\nPhoenix:\n(That's why we're still here talking about this...) As it just so happens... ...I have here what I believe to be the missing page.\nValant:\n...Allaka-I-don't-believe-it.\nPhoenix:\nLooking at this page... It's hard to imagine that the first visitor that night shot Magnifi Gramarye. That's the defense's position.\nJudge:\nW-Wait. Let me see that! What in Sam Hill...? Why, this is the continuation of the victim's diary!\nPhoenix:\nNote the torn edge of the page. It's a perfect match with the torn remains of the last page in Magnifi's diary!\nValant:\nQuite... remarkable...\nKlavier:\nWould you care to explain what all this means, Herr Attorney?\nPhoenix:\nThe diary continued after his first visitor came. Which means that the victim was still alive after Zak Gramarye left! Leaving no one to take his life but the second visitor! Valant Gramarye!\nValant:\nNo... Nooooo...!\nJudge:\nThe handwriting, too, matches that on the other pages. This is, without a doubt, the genuine article! Order! Order! Order!\nValant:\nBut, but wait! This is... That's impossible! That old man couldn't have written that...\nKlavier:\nKlavier:\n...Finally. You just couldn't resist, could you, Herr Wright?\nPhoenix:\n...Resist what? Presenting solid evidence?\nKlavier:\n...... Herr Judge?\nJudge:\nY-Yes, Prosecutor Gavin?\nKlavier:\nMight I request we put the current cross-examination on hold? The prosecution would like to call a new witness.\nJudge:\nB-But, Prosecutor Gavin! This evidence overturns the current witness's...\nKlavier:\n...I ask only to put it on hold! Please. My new witness has a very, very important piece of testimony to give. ...Five minutes. No more. I promise... Your Honor.\nJudge:\nW-Well, if you put it that way... Mr. Wright, what's your take on this?\nPhoenix:\n...... Well, Your Honor. Judging from his enthusiasm... ...we'll have to hear this new testimony sooner or later anyway. ...So it might as well be sooner.\nJudge:\n...Then, though this is highly, highly irregular... ...we will put the current cross-examination on hold. The witness may step down. ...Now, Prosecutor Gavin! Please bring this surprise witness to the courtroom!\nPhoenix:\n(...I had a bad feeling just then. That ripped-out page was too obvious... ...He must have known. And I should've known it was a bad sign all around...)\nJudge:\nHmm... Holding trial with no audience is a first, even for me, Prosecutor Gavin.\nKlavier:\n...I beg the court's understanding. But I had to make a judiciary deal with the witness to secure his testimony.\nPhoenix:\nA judiciary \"deal\"...?\nKlavier:\nThe details of his testimony may have some \"legal ramifications\", shall we say. I thought it best to contain the information to this room.\nJudge:\nHmm... Very well. And you are the witness, I gather...?\n???:\nAh... Y-Yes. Yes, sir.\nKlavier:\n...State your name and occupation for the record.\nDrew:\nErm... My name's Drew Misham. I'm... a painter.\nJudge:\nA painter? And you are somehow related to this case?\nDrew:\nNo, well. Not per se...\nKlavier:\n...I have one simple question for this witness.\nPhoenix:\n......\nKlavier:\nMister... Misham, was it? Do you know what this is?\nDrew:\nOh... yeah. I know it well.\nPhoenix:\n...How's that possible? Have you seen this diary page somewhere before?\nDrew:\nOh, yeah. I mean... I made it.\nPhoenix:\nYou... what? You \"made\" it!?\nDrew:\n...Yes. You might call it one of my \"works\".\nKlavier:\n...The regional prosecutor's office received a tip-off yesterday. \"Illegal evidence has been prepared for the trial of Zak Gramarye.\"\nJudge:\nIllegal... evidence?\nKlavier:\nI initiated an investigation, and found this witness. A painter to the world at large, Drew Misham has another side, you might say. He is skilled in making perfect reproductions of certain things... ...Forgeries, in other words.\nPhoenix:\nF-Forgeries...!?\nJudge:\nW-Well! So, we are to understand that this page here is...\nKlavier:\n...A fake. Prepared by a certain defense attorney.\nPhoenix:\nPhoenix:\nHold it! I didn't \"prepare\" this evidence!\nKlavier:\nKlavier:\n...Ah, the attorney speaks. Something about this page, I presume. But what is he saying? It makes no sense! ...After all it was you who presented this evidence to us, Phoenix Wright!\nJudge:\n...Witness! Er, Mr. Misham, was it? Who requested this forgery!? Who was your client!?\nDrew:\nThat... I don't know.\nPhoenix:\nWhat...!?\nDrew:\nMost of my clients prefer to remain anonymous, even to me. I make the items they want, and receive my payment. That's the extent of my contact with them.\nPhoenix:\nPhoenix:\nB-But...! There's no proof this is a fake!\nDrew:\nIt's a fake.\nPhoenix:\nHuh...\nDrew:\nTo avoid just this sort of problem... I always put a special mark on my \"works\". I can say, without a doubt, this is mine.\nJudge:\n...Mr. Wright. You have just presented illegal evidence to this court. My court.\nPhoenix:\n(...It was careless of me. ...That's all I can say.)\nTrucy:\nOh... Old boy! Um, uh... Here.\nPhoenix:\nWhat's this...?\nTrucy:\nI dunno! I just got it over there in the hall. They told me to give it to the \"old boy in the blue suit with the spiky hair\". They said it was really important!\nPhoenix:\n(It was all a trap. A fatal trap...)\nJudge:\n...Mr. Wright?\nPhoenix:\nYes.\nJudge:\nDo you have an explanation for yourself?\nPhoenix:\nIf I did, would the court hear it?\nJudge:\n...... Probably not. Forging evidence is a serious crime. And presenting it in court, a serious mistake. A fatal mistake, for an attorney.\nKlavier:\nFatal, too, perhaps, for your client, I fear.\nPhoenix:\n...!\nKlavier:\nTell me, what kind of defendant relies on forged evidence...? The answer is quite clear. A guilty one!\nPhoenix:\nPhoenix:\n...Your Honor, wait! I understand that presenting forged evidence in court is a serious crime. But you cannot hold my client responsible for actions I undertook as an individual...\nJudge:\n...I am sorry, Mr. Wright.\nPhoenix:\n...Your Honor?\nKlavier:\nAnother close call, I dare say. If the prosecutor's office hadn't received that hot tip... ...everything would have gone the way you wanted it to, ja?\nPhoenix:\n......\nKlavier:\n...I even gave you a chance. Too bad you decided not to think before embarrassing yourself...\nJudge:\nI see no need for further discussion on this matter. Special witness dismissed!\nDrew:\n...Mr. Attorney?\nPhoenix:\nYes?\nDrew:\nCould I... ask your name?\nPhoenix:\n...? Phoenix Wright...\nDrew:\nMr. Wright... I have seen and studied many people, but none like you. I'll remember you, Mr. Wright.\nJudge:\n...Though I deeply regret having to declare a verdict in this way... This trial is over.\nZak:\n......\nJudge:\nYou have the right to find a new attorney and make an appeal. However, this court must...\nZak:\nAh, Your Honor?\nJudge:\nY-Yes, Mr. Zak?\nZak:\nThere is one thing I wish to make clear. Today, in this courtroom... ...you cannot declare me \"guilty\". ...It is impossible.\nJudge:\n...I'm afraid the defendant is quite mistaken. I most certainly have the authority to declare a verdict on you.\nZak:\nExcept... tell me, how do you plan on announcing your verdict... ...when your defendant does not exist?\nJudge:\n\"Doesn't exist\"...? What are you talking about?\nZak:\nI am talking... about this!\nPhoenix:\nM-Mr. Enigmar!!!\nKlavier:\nThe defendant's escaped! Find him! Quick!\nJudge:\nBailiff! Close all exits from the building! On the double! He must not be allowed to escape!\nThat day, in that courtroom, a miracle occurred. The defendant, Shadi Enigmar, a.k.a. Zak Gramarye, did not just \"escape\" from court. He literally, unbelievably, \"vanished\". ...Right before the bailiff's eyes. No one ever saw him again. Not since that day.\n...This is the \"Gramarye Miracle\"! Ah ha ha ha ha ha!\nNo verdict was declared. ...After all, the defendant didn't exist. That's how it happened. The trial of magician Zak Gramarye vanished, along with him, for all eternity. The mysteries that remained behind were all solved, however. ...But not until seven years later.\nTo be continued....That trial seven years ago was the beginning of it all. This I know beyond a doubt. The mysteries of the past work their magic on the present. But you'll soon be finding all of this out for yourself. Which of Magnifi Gramarye's disciples pulled that trigger? Where did the vanishing defendant, Zak Gramarye, go? What dark truth lurks behind the forged diary page? And what about the girl who was left behind...?\n...The past left us these four \"keys\" to unlocking the truth. But that's not all. There are four \"keys\" in the present, as well. And when all the questions have found their answers... ...the final trial will begin. But first, you must chase the truth through then and now. Think of it... as a game.\nPhoenix:\nI, Phoenix Wright, will be your guide through this game. That terrible trial saw me present forged evidence. ...It ended, half-finished, when the defendant vanished. What became of me after that...? As your investigation proceeds the answer will become clear. ...Oh, and one more thing. There is something I must tell you. As Apollo Justice has his bracelet... ...so, too, do I have my own \"weapon\" of sorts. ...My Magatama. What does it do, you ask? That I would have you see for yourself. ...Well now. Shall we begin? Use [L / LB / Q] and  [R / RB / E] to jump between past and present. (Changed from [Touch the arrow to switch between past and present.] in the original release) But let's begin seven years ago... in the past. It is right after my last trial came to an abrupt end. ...Now that you know the game, let's play.\nAfter visiting any location in the past:\nPhoenix:\nThe nightmare trial was over... ...and the new nightmare of figuring out what had happened had just begun. I wanted to wake up, to walk away. ...But I figured I'm the only one who could do this, probably. And besides, I had plenty of time. Thanks to the Bar Association Review Board's decision. It's hard to work when your attorney's badge has been taken away.\nSeven Years AgoWright & Co. Law Offices\nTrucy:\nOoh! Morning, Daddy!\nEnigmar:\nAh, I'm so glad you came.\nTrucy:\nYou OK, Daddy? They picking on you?\nEnigmar:\nHa ha ha ha ha ha ha. I am fine, as always. This old boy is here to help me, after all.\nPhoenix:\n(That's \"young man\" to you.) Good morning. That's a cute outfit you have on.\nTrucy:\nThanks! My first show's today, after all!\nPhoenix:\n...Two weeks had passed since then. I called her into my office.\nPhoenix:\nTrucy, there's something we need to talk about.\nTrucy:\n......\nPhoenix:\nIt's been two weeks since your father... disappeared. We need to start thinking about... your future.\nTrucy:\n......\nPhoenix:\nI, um, did some calling around. This is hard to say, but... ...you have no living relatives.\nTrucy:\n......\nPhoenix:\nSo... ...I was wondering if you wanted to stay with me for a while. Just until your daddy comes home. It won't be long. (...I hope.)\nTrucy:\n......\nPhoenix:\nUh, of course, it's totally your choice. If you don't like it here, you can go wherever you'd like. I could look up some places you might like to stay at... (This is so weird...)\nTrucy:\n...Mr. Attorney. Daddy told me about you. He said I could trust you.\nPhoenix:\nHuh...? Really?\nTrucy:\nSo, if I stay here... ...does that mean you'll be my family?\nPhoenix:\nHuh? Uh... Um... I guess so? (Getting weirder...)\nTrucy:\nUm... Mr. Attorney?\nPhoenix:\nEr, actually, why don't you call me... Nick. ...Or you can call me \"Daddy\" if you'd like. It doesn't have to be today, or anything.\nTrucy:\nOK! Say, Daddy?\nPhoenix:\n(That was quick.) ...Yes?\nTrucy:\nIf I move here, I have to switch schools, right? And I was thinking, I haven't paid for lunches at my last school... for a year. So thanks, Daddy!\nPhoenix:\n...Ah.\nTrucy:\nOh, and this office? It's a little blah. A little color goes a long way, you know?\nPhoenix:\n...Ah.\nTrucy:\nOh, and Daddy? You got fired from work, right? Don't you worry one bit! I'll work twice as hard! We'll make it through this!\nPhoenix:\nTrucy... how old are you?\nTrucy:\nOh, I'm eight. But don't let appearances deceive you! I'm a young professional! Stick with me and you'll do just fine, Daddy!\nPhoenix:\n...Ah, thanks. (Why does it feel like she's already in charge...?)\nAfter clearing all Talk options:\nPhoenix:\nI think that's probably enough for today. Sorry to ask you so much all at once like that.\nTrucy:\nIt's OK! After all, we're family! I just hope you're ready! The Wright Talent Agency opens tomorrow!\nPhoenix:\nWh-What!? B-But are we... representing anyone?\nTrucy:\nMe and you... That makes two, Daddy...!\nPhoenix:\nI think you need more than that to make an agency. Besides... ...you may be a magician... but I'm no talent!\nTrucy:\nOh, I'm sure there's something you're good at!\nPhoenix:\nWell, when you put it that way...\nTrucy:\nYou mean you don't have any tricks? No old standbys? This will not do! A boy should always have a trick or two in his pocket.\nPhoenix:\nOK, OK! I'll think of something.\nTrucy:\nThat's the spirit! See you bright and early tomorrow, Daddy!\nMr. Hat:\nWelcome to the team, Daddy-O!\nPhoenix:\nThe team... right.\nPhoenix:\nSometimes when magicians vanish, they leave something behind... That's how Trucy became Trucy Wright... my daughter. To be honest, I was pretty lost those first few days. Thinking back on it, it was a pretty dark time in my life. But Trucy... happy, smiling Trucy... she was my light.\nSeven Years AgoDistrict CourtDefendant Lobby No. 2\nPhoenix:\n...Didn't think I'd be back here for a while. I didn't want to have to remember that day.\nJudge:\n...Though I deeply regret having to declare a verdict in this way... This trial is over.\nZak:\nAh, Your Honor?\nJudge:\nY-Yes, Mr. Zak?\nZak:\nThere is one thing I wish to make clear. Today, in this courtroom... ...you cannot declare me \"guilty\".\nJudge:\nWhat are you talking about?\nZak:\nI am talking... about this!\nPhoenix:\nM-Mr. Enigmar!!!\nKlavier:\nThe defendant's escaped! Find him! Quick!\nJudge:\nBailiff! Close all exits from the building! On the double! He must not be allowed to escape!\nPhoenix:\n(When I came here on that fateful morning, I still had my badge. But now... Like an amputated limb... I can still feel it itching. Where do I start? I don't even have the authority to investigate...)\n???:\nHey, you there. Sir! Down on the hands! Floor on your head! Now now now!\nPhoenix:\nWh-Wh-What's the big idea!? My ears...!\n???:\nNo unauthorized personnel aren't allowed in here!\nPhoenix:\n...... But that would mean all unauthorized personnel are allowed.\n???:\nZoooooooooooooooooooink!? ...I just say it like it is sir! And it's usually wrong. Thrown out of the precinct... lost my friends, my girl and even my wallet.\nPhoenix:\n...... We've... met before, haven't we? On a case... two years ago?\n???:\nNo recollection of that, sir!\nPhoenix:\n...Huh?\n???:\nFor me, \"working on a case\" is always in the present progressive tense, sir! There is no past! There is only now! Sir!\nPhoenix:\nOK, OK! You're... the bailiff, right?\nMeekins:\nYes sir! Court Bailiff Mike Meekins at your service, sir!\nPhoenix:\nUm... I've asked to meet with the bailiff at this court who let the magician escape.\nMeekins:\nLet me try to make this as absolutely clear as possible for you, sir! It was meeeeeeeeeeeee! Sir.\nPhoenix:\nB-But... you were a regular police officer once... right?\nMeekins:\n...... Sometimes bad things happen to good people, sir.\nPhoenix:\n(Something tells me it's a long story. Let's not go there.) So, you were in charge of security at the time of the \"vanishing\"...?\nMeekins:\nI'm. Dying. Over. Here! Oh! Ohh! It's a hard knock life, sir! Thrown out of the precinct... lost my friends, my girl and even my wallet.\nPhoenix:\n(Guess I wasn't the only \"victim\"...)\nPhoenix:\nThough it seems complex, what really happened that day was quite simple. You were standing by the door, and out came Zak. ...But that wasn't all. Another person got in on the act... and she was standing in front of Lobby No. 2. Along with Mr. Hat.\nMeekins:\nAh, and that's the beauty of it, isn't it...?\nPhoenix:\nSo... ...while you are standing in shock and amazement, the magician rounds the corner... ...and, most likely, runs through the closest door... into Lobby No. 1. This is where you come in. You turn the corner, in rather lukewarm pursuit... ...and at that very moment, Trucy runs into Lobby No. 2! Then, all she has to do is tuck away the Amazing Mr. Hat.\nMeekins:\nSir, I... ...I only lost sight of him for the briefest of moments! Then, I saw that cape! Zak Gramarye's red cape fluttering like a... cape! ...... ...Astounding, sir! All my days of posing queries and making inquiries and chasing quarries... wasted! It was as if I could see them melting away like... ...an ice cream cone left by the side of the road to die!!! Or the scattered remains of a messily eaten chocolate parfait!!!\nPhoenix:\n(Such sweet sorrows...)\nPhoenix:\n...I'm sorry. I had no idea how much you'd suffered on account of this case.\nMeekins:\nIt... It's an honor, sir!!! I've apologized to people many, many times! Sometimes more than once! But this is the first time anyone's ever apologized to meeeeeeeeeeeeee!\nPhoenix:\nActually, about that girl... ...I'm sort of her guardian now.\nMeekins:\nIs that so? ...... ...... Sir! You should know that I harbor no ill feelings whatsoever in my harbor!\nPhoenix:\nUm, OK...\nMeekins:\nI let the defendant escape, that's the stone cold truth! Just another step on my way from singing the blues to wearing the blues! Someday, sir, I'll be standing side-by-side with the great Detective Guamshoooooooooooe!\nPhoenix:\n...Erm, Mr. Meekins. This is a free ticket to the show at the Wonder Bar. If you want...\nMeekins:\nIt... It's an honor, sir!!! Sir! I can't count the number of things I've had taken from me, sir! But no one's ever given me anything for freeeeeeee! Right! I'll see you in court next time then, sir!\nPhoenix:\nI look forward to it.\nPhoenix:\nAll eyes were on Zak Gramarye that day in court... until his mysterious disappearance. Now part of the mystery's been revealed... but the magician remained out of sight. It would be seven years before I met him again...\nDefendant Lobby No. 2\nPresent DayBorscht Bowl Club\nKristoph:\n...I'll be taking my leave, now. Still have some work to do back at the office.\nPhoenix:\n...Then I guess I'll go back to my piano.\nKristoph:\nTo be honest, it's better when you aren't playing. This frigid culinary dungeon almost feels... comfortable. ...Later, then.\nPhoenix:\n(*sigh*... Two hours left on my shift. Wonder if we'll get any \"customers\" tonight.)\n???:\n...Ahem. Do you know who I am?\nPhoenix:\n\"Who I Am\"? No... But if you hum it, I can play it! ...Just kidding, I don't do requests.\n???:\nHow about a different sort of request? You see... I play cards.\nPhoenix:\nOh... a customer. I was just hoping someone would come in and save me from a night at the keys.\n???:\n...I seek a true competition. I have heard the Borscht Bowl Club is the place for this. Now I see the rumor is true.\nPhoenix:\n...And this is? A friend of yours?\n???:\nAh! Don't mind me! I'm just your friendly neighborhood newsman!\n???:\n...Ah. He will not be playing tonight. When his business is finished, I shall send him home. This competition will be between us. No others.\nPhoenix:\nThe Wright Talent Agency represents two artists. And I'm number two. I play piano... Well, sort of. It's actually just a front for my real talent... ...which is playing poker. Don't ask me how I got started. I don't remember. But I'm good. Real good. It didn't take long for the rumors to get around... \"Go to the Borscht Bowl Club if you want a real game. That guy's never lost\"... People don't come to hear me tickle the ivory. They come to watch me play cards. Is this a seedy poker club? No. It's a restaurant. We don't play for high stakes. There's no money involved. But real players carry cash... and they're always thirsty. It's a handy source of income for the club owner.\nPhoenix:\nThen, let's compete. I'll take you to the room.\n???:\nThe Hydeout, yes. But before we go...\nPhoenix:\n...Yes?\n???:\nAllow me to introduce myself. My name is Shadi Smith.\nBrushel:\nOh, and I'm Brushel! Spark Brushel! News reporter!\nPhoenix:\nOh. I'm...\n???:\nNo, no, Phoenix Wright.\nPhoenix:\nHuh...?\n???:\nYou must always look a man in the eye when you make your introductions. ...You still do not know who I am?\nPhoenix:\nHave we... met? (Ah...!)\nZak:\nToday, in this courtroom... ...you cannot declare me \"guilty\".\nJudge:\nWhat are you talking about?\nZak:\nI am talking... about this!\nPhoenix:\nM-Mr. Enigmar!!!\nKlavier:\nThe defendant's escaped! Find him! Quick!\nJudge:\nBailiff! Close all exits from the building! On the double! He must not be allowed to escape!\nPhoenix:\nY-You can't be... But you're...! ...Zak Gramarye!?\nZak:\nYes... The reincarnation act of the century. Pity I have only an audience of one. ...You.\nPhoenix:\n(Zak Gramarye!? This must be a bad dream. In a sense, this guy ruined my life.)\nZak:\nYou there!\nOlga:\n...D-Dah?\nZak:\nWe will play soon. Ready the room.\nOlga:\nDah... I will be preparing the Hydeout for you.\nPhoenix:\nAre you really him? THE Zak Gramarye? (Changed from [Are you really him? The Zak Gramarye?] in the original release)\nZak:\nNow I am Shadi Smith. Remember this.\nPhoenix:\n...How many years has it been now? Six?\nZak:\nIn exactly three days from now, it will be seven. I caused you much... inconvenience, I fear.\nPhoenix:\nYeah, you could say that.\nZak:\nIs... she well? Trucy, I mean.\nPhoenix:\nShe's fine. I've got her working already. Hope you don't mind.\nZak:\nI hardly need express my gratitude. But, you have it. ...This is why I have come. That, and to settle a matter of cards.\nPhoenix:\n...By which you mean poker? (Those eyes! He's serious...)\nZak:\nI despise losing above all else. And so, I have decided that I will win tonight. No matter what it takes.\nPhoenix:\n(I know this guy's type... and they're dangerous. Everything's about the competition. All else is secondary.)\nZak:\n...Perhaps we should take this time to talk, before we play. I know you have much to ask me. ...And I, you.\nAfter clearing all Talk options and presenting Trucy's Locket:\nZak:\nWell, the prelude may have been longer than the main attraction. Shall we begin our game? My final competition?\nPhoenix:\nFinal...? Why?\nZak:\nAs you said, I have come out of hiding today to make this document legally binding. Once that is done, I shall slip once more underground.\nPhoenix:\n...Without seeing your daughter?\nZak:\n...... It would be best if I did not. ...Seven years ago, we played. Seven years ago, I lost. I already lost to Magnifi. I do not care to lose to another. And I have heard that you never lose.\nPhoenix:\n...It's just a rumor.\nZak:\nYes... for it is impossible to never lose. Unless one has an ace up one's sleeve.\nPhoenix:\n......\nZak:\nAs a magician, it causes me no end of irritation. To think a mere lawyer might be out there, pulling the wool over so many eyes.\nPhoenix:\nHey... I just signed your document for you. Maybe you could try lightening up?\nZak:\nThat was that. This is this. For my final competition, I will destroy your perfect record, Phoenix Wright. This... will be my final performance. You are warned.\nPhoenix:\n(This guy is beyond serious... So much for a fun evening of cards.)\nZak:\n...Brushel. You may leave.\nBrushel:\nAh, but, it's your last game! I mean, what a scoop...\nZak:\n...... ...I punch, and I punch. But still, it is not enough.\nBrushel:\n...... Er, I just remembered a future, er, prior engagement! Toodles, gentlemen! Oh, and nice meeting you, piano man!\nZak:\n...Then let us begin. Dealer!\nOlga:\n...Dah?\nZak:\nYou will be witness to our competition.\nOlga:\nDah. It is honor for me.\nPhoenix:\n...? (Why haven't I seen her around here before?)\nZak:\nAh, that reminds me... I saw a familiar face as I entered this restaurant. ...He did not seem to notice me, however.\nPhoenix:\n...?\nZak:\nGavin... I believe was his name.\nPhoenix:\nYou know him?\nZak:\nAfter a fashion. ...Listen, Phoenix Wright. One can learn much from a true competition. ...Remember this.\nPhoenix:\nThe Gramarye \"power\"... I was close to understanding it, but I needed more. And I knew where to get it. ...Trucy's mother. I'd need to meet that reporter again, that was clear... ...And one other thing. From the moment my \"final competition\" with Zak began that night... ...a name was running through my head. ...The name of a man now in prison. ...A name Zak Gramarye knew. But how? And why...?\nPresent DayCentral PrisonSolitary Cell 13\nKristoph:\nWell well, isn't this an unexpected surprise? What errand brings you down to my cramped confines?\nPhoenix:\nGavin...\nKristoph:\nIs... this your idea of revenge, Phoenix Wright? Revenge for the events that took away your attorney's badge seven years ago!?\nPhoenix:\nMy past is like my logic, straight and true. Nothing's changed. All I did was point the finger of justice in the proper direction.\nKristoph:\n... Fine. I'm glad we could have this little tête-à-tête, Wright.\nKristoph:\n...You look well, Phoenix Wright.\nPhoenix:\nYou, too... Gavin.\nSeven Years AgoDrew Studio\n???:\nI... figured you'd come here sooner or later.\nPhoenix:\nI decided on sooner. Drew Misham... was it?\nDrew:\n...... I... I haven't done anything illegal.\nPhoenix:\n...And I didn't come here to whine about past events. I wanted to ask you some questions.\nDrew:\n...I suppose you have that right. That day... the entire court descended into chaos. Only you stood still, your eyes calmly watching. I admit, it made quite an impression on me.\nPhoenix:\nI'm used to finding myself in outrageous situations.\nDrew:\nPhoenix Wright, was it? I'll answer what I can.\nPhoenix:\n...... (I'm not sure, but... ...it feels like I'm being watched... intensely.)\n???:\n......\nDrew:\nAh, this is my daughter. Vera, say hello.\nVera:\n......\nPhoenix:\n(She's gone...)\nDrew:\nShall we begin, then?\nPhoenix:\n...Mr. Misham, I have a request.\nDrew:\nLet me guess. You'd like to speak with my daughter.\nPhoenix:\n...Can I?\nDrew:\n...My daughter has never been one to talk to strangers. She's quite shy. Extremely so, actually. ...With only one exception.\nPhoenix:\nWhich was...?\nDrew:\nOddly enough, it was that client.\nPhoenix:\n...!\nDrew:\nI left the studio while they talked. I returned when they had finished... and she was laughing! It was the first time I'd seen anything of the sort.\nPhoenix:\n...Please, let me speak with her.\nDrew:\n...Alright.\nVera:\n......\nPhoenix:\n(Uh oh... this could be tough.)\nAfter clearing all Talk options:\nPhoenix:\nWell... I think that's all. I'll be leaving now.\nDrew:\n...I am sorry for what happened.\nPhoenix:\nIf you want to apologize, try my client, Zak Gramarye.\nVera:\nUm... Did I... do something bad?\nPhoenix:\n...What makes you think that?\nVera:\nYour eyes... they're sad. Very sad.\nPhoenix:\n...... I'll put on my smile next time I come, promise. ...I hope to see you smile then, too, Vera.\nVera:\nOh... OK.\nPhoenix:\n...Take care.\nPhoenix:\nThinking back on my first encounter with the young forger... ...I witnessed something of vital importance that day. ...Of course, by the time I realized it... ...it was already too late.\nSeven Years AgoDetention CenterVisitor's Room\nValant:\nWhat strange sight doth mine eyes behold!\nPhoenix:\nExcuse me?\nValant:\nTwo men on either side of a single transparent pane... ...yet it seems fickle Fate has switched sides, so to speak! The forger of fakes walks freely. While the innocent languishes within these flexiglass confines.\nPhoenix:\nThere's been no proof that I forged anything.\nValant:\nNor proof that I took the life of my dear mentor.\nPhoenix:\n......\nValant:\nYet... these chains cannot hold me for long. The stage awaits! And what, may I ask, awaits you?\nPhoenix:\n(A little piano in a cold little hole-in-the-wall...)\nValant:\nBut, since you are here... ...what shall we discuss?\nPhoenix:\n(The shooting of Magnifi Gramarye, for one... Who pulled that trigger? Valant? Or his partner Zak? His partner vanished before the answer could be found. If I'm going to get any closer to the truth, this is the place to start.)\nPhoenix:\nWhy did Magnifi Gramarye try to cover up the \"accident\"...? It was his own daughter who died!\nValant:\nAll I can say is, it was a critical time for Troupe Gramarye. A passing of the torch from Magnifi to Zak & Valant. We all sacrificed so that it might be a success. Thalassa's death... was the greatest sacrifice of all. Yet... ...even when her life was extinguished, her presence was not.\nPhoenix:\nWhat do you mean?\nValant:\nIn time, we, myself and Zak, found we could no longer oppose Magnifi's wishes. Magnifi forced us to perform his art, for his benefit.\nPhoenix:\nI see... I guess I can understand. I mean, he did lose his only daughter.\nValant:\nBut do you not find cowardice in his actions?\nPhoenix:\nHuh...?\nValant:\nTo decide to hide the truth of your own daughter's death is one thing... ...but then to hang that death as a guillotine above our heads!?\nPhoenix:\n(Things were dark behind the scenes in Troupe Gramarye, that's for sure.) Does Trucy know...?\nValant:\nShe was not told. ...Naturally. Who would want to know that their father might have taken their mother's life?\nPhoenix:\nTrue...\nValant:\n...I had not thought of that accident for a very long time.\nPhoenix:\nI'm sorry to dredge up old memories... but this has helped a lot.\nValant:\nNot to find Magnifi's slayer, I should think.\nPhoenix:\n...True.\nValant:\nAh...\nPhoenix:\n...?\nValant:\nAfter that accident... ...there was one who came sniffing, quite persistently.\nPhoenix:\nA reporter?\nValant:\nHe called himself a \"newsman\" at the time. Often I spied him lurking about the dressing room, doing his \"research\".\nPhoenix:\nWould you happen to remember his name?\nValant:\nWhat was his name...? Sorry, I have forgotten. But, in the course of his interviewing, he became quite close to my partner, Zak. I liked him not.\nPhoenix:\nI see...\nValant:\nHis name... I do not recall. But his scent -- the cloying aroma of mint. ...Yes, whenever he smiled. Which was far too often.\nPhoenix:\nI see... Thanks for your help.\nValant:\n...It does no good to interfere with the past, Mr. Wright. You will not uncover answers. Only wounds.\nPhoenix:\n...I'm sorry.\nPhoenix:\nI had begun to notice a dark curtain hanging over Troupe Gramarye... ...and I began to realize what I had to do. I had to protect Trucy from that darkness. The reporter he mentioned... ...the \"newsman\". I never learned who that was, at the time. ...Though I've got a pretty good idea who it is now. That smile, and the sickly sweet smell of mint. The last floss-thin thread connecting Zak Gramarye to this world. Sooner or later, I'd have to track him down.\nDetention Center\nPresent DayDrew Studio\nBrushel:\nEh? Well well well what do we have here?\nPhoenix:\nRemember me?\nBrushel:\nOf course I remember you! \"Journalist Meets Ex-Attorney In Bar\", end quote.\nPhoenix:\nCan I ask what you're doing here? Mr. Misham was poisoned, and his daughter's...\nBrushel:\nOh, yes, I know. Oh, how I know! Yes. It's caused me no end of grief, to be honest. \"Journalist Wishes He'd Tracked Down Case Just A Little Quicker\", end quote.\nPhoenix:\nWere you on the trail of this case the whole time?\nBrushel:\nZak Gramarye... was a good friend.\nPhoenix:\nZak said something to that effect back at the Borscht Bowl Club.\nBrushel:\nWhat a character, what a man! If a little... No, a lot... No, extremely rough around the edges!\nPhoenix:\nDo you think I could ask you a few questions?\nBrushel:\nOh? You serious? I mean, I'm usually the interviewer, not interviewee! \"Journalist Asks Questions, Not Other Way Around\", end quote.\nPhoenix:\n......\nBrushel:\nFine, shoot, I don't care! People have been asking me all sorts of things lately.\nAfter clearing all Talk options:\nBrushel:\nPeople and events all get tangled together and get biggerer and biggerer... ...don'tcha think?\nPhoenix:\n(I was too busy wondering about \"biggerer\" to listen to what you were saying.)\nBrushel:\n...Sometimes, you just gotta accept that you won't be able to untangle it all, I think.\nPhoenix:\nMaybe so. But still... ...I have to do what I can. And... I have to tell what I find to those who come next.\nBrushel:\n\"Next\" you say?\nPhoenix:\nI'm not the one who will close the curtain on this little play. Apparently, that's not my role anymore.\nBrushel:\nMagnifi...\nPhoenix:\n...?\nBrushel:\nI was just wondering what Magnifi would think of all this.\nPhoenix:\nWhat do you mean?\nBrushel:\nHaven't you seen it in Trucy? She's got his power.\nPhoenix:\nYou mean, how I can't lie to Trucy?\nBrushel:\nIt was the same with Magnifi. And with his daughter... Thalassa.\nPhoenix:\nIt's a strange thing. You think it's some Gramarye gene?\nBrushel:\nMagnifi told me once, back when Zak married Thalassa. He said Zak had good \"eyes\". But not good like a Gramarye's eyes. Not that good.\nPhoenix:\n(...I wonder if Zak ever played a game of poker with his wife?) Who knows what the \"Gramarye Secret\" was...?\nBrushel:\nMaybe nobody, now that Zak's gone.\nPhoenix:\n(Zak Gramarye...)\nPhoenix:\n...The plot had finally begun to reveal itself. It sprouted from a warp in the Gramarye fabric, and grew, swallowing everything... ...wrapping itself around the Gramaryes' \"power\". A power which passed from Magnifi Gramarye to Thalassa ...to the next generation. And I would once again need to meet... ...the one who bridged it all together.\nBorscht Bowl Club\nAfter clearing all Talk options:\nZak:\n...That is all I know of things Gramarye.\nPhoenix:\nThank you, Mr. Zak.\nZak:\nIf this boy's bracelet is the real thing, then he will use it before long. Thereby awakening his power.\nPhoenix:\n...I'll keep that in mind. Well, shall we play a game?\nZak:\nAh... I've said so much. Let me say one more thing. ...I will tell you of that night.\nPhoenix:\n\"That night\"...?\nZak:\nThe night my mentor, Magnifi Gramarye, passed from this world to the next.\nPhoenix:\n...!\nZak:\nThere were two pistols, and two letters sent. This... was Magnifi's \"test\".\nPhoenix:\nA test?\nZak:\nIn his last years, Magnifi Gramarye worked us to the bone... No. To the pain. But that night, I could not shoot him. ...So I shot the clown's forehead instead. This, it seems, was the correct \"answer\".\nMagnifi:\n...Take this. I give my art to you, Zak.\nZak:\nWhat...?\nMagnifi:\nIt is thanks for playing along with my \"show\". You shot well tonight, Zak. Though I would not have minded dying by your hand.\nZak:\nHow could I shoot you? ...You're my mentor.\nMagnifi:\nBah! I thought you might say that.\nZak:\n...If I went home without shooting anything... ...what would you have done then?\nMagnifi:\nThen, of course, I would have given Valant his chance.\nZak:\nAnd if I had shot you in the forehead instead?\nMagnifi:\nThen it would be over. If you or Valant were to shoot me in the head... ...then I to the darkness would go, and my art with me. A fitting end, don't you think?\nZak:\nAh...\nMagnifi:\nYet this ending, too, gives me no cause for regret. I thank you, Zak. And... I am sorry. I have done much that was wrong in my day.\nPhoenix:\nIt seems to me that Magnifi wanted you to be his successor all along. That's why the time he gave you was earlier than Valant's.\nZak:\n...Perhaps. But it is not something we will ever know for sure now. I wonder... What is Valant up to these days?\nPhoenix:\n...Waiting for you to \"die\". If seven years pass like this, the performance rights go to him.\nZak:\n...Ahh. And now here I am... and his dream is ended.\nPhoenix:\nIt's worse than that, actually. Public opinion's a fickle thing, you know?\nZak:\nWhat...? You don't mean to tell me they've put the blame for our mentor's death on... him?\nPhoenix:\nThe trial ended when you vanished, Mr. Zak. There were even rumors that Valant had helped you pull it off.\nZak:\nBut that's madness! ...... Well. It seems that before I can once again disappear from this world... ...I have one more act to perform.\nPhoenix:\n...?\nZak:\n...Isn't it odd that sorting out my life should prove so complicated... ...even though I'm \"dead\"?\nPhoenix:\n...That night, Zak Gramarye was killed. He died as \"Shadi Smith\", a mysterious traveler with a secret past. But he left one thing behind before he parted... This. His \"confession\". ...To use as I saw fit. ...Of course, he'd killed no one. This was his way of tying up loose ends with his old partner, Valant Gramarye.\nZak's Confession added to the Court Record.\nPresent DaySunshine Coliseum\nValant:\nWell, this is a blast from the distant past.\nPhoenix:\nLong time no see, Mr. Valant.\nValant:\nSeven years, has it been? Frankly, I didn't think I'd ever see you again.\nPhoenix:\nActually, I came because there's something I want to ask you.\nValant:\n...I've spoken to the press. I've nothing more to say.\nPhoenix:\nI've spoken to a lot of people myself... and come to some conclusions. But then I realized... ...I needed to hear it from you.\nValant:\n......\nValant:\nYou see... I knew that two letters had been sent.\nPhoenix:\n...!\nValant:\nThere are no secrets between partners. It was easy to find out. ...That was when I understood Magnifi's plan.\nPhoenix:\nHe wanted to die by one of your hands...?\nValant:\nLittle did I expect it had anything to do with the rights to his repertoire! That was when I heard it... ...the little demon whispering inside my heart.\nPhoenix:\nThe demon...\nValant:\n...Let me confess: I had intended to shoot Magnifi. And... I planned on framing my partner for the crime.\nPhoenix:\nWha... Whaaat!?\nValant:\nThat night, I prepared something before going to Magnifi's hospital room.\nPhoenix:\nWhich was...?\nValant:\nIV fluid, of course. I'd seen it on an earlier visit. If Zak did not shoot, I would do the deed! Then, I would use the IV liquid to place the murder on his hands. That was my plan.\nPhoenix:\nBut... you didn't shoot him.\nValant:\n...... I could not. The demon in my heart fled when the moment came. But then Magnifi called me back.\nMagnifi:\n...I am sorry, Valant. ...I am giving my magic to Zak... not you... ...You still lack the draw he has... ...Please, help him, if you can...\nValant:\nI left the room... ...and then I stopped. The shock of what I had just been told consumed me. That is when I heard that fateful gunshot.\nPhoenix:\nMagnifi Gramarye... killing himself.\nValant:\nThen, the demon awoke anew within me! ...Zak killed him, he was the one... ...Frame him, and the magic will be yours... I... altered the scene of his suicide. I took the pistol from his hand, wiped off the prints... ...then I used the syringe to add the IV liquid I'd brought.\nPhoenix:\nSo in the end, things happened pretty much as planned. Magnifi died, and you framed Zak for his murder.\nValant:\n...... \"As planned\", indeed. Of course, the outcome was somewhat different than I had anticipated. Well... what do you think? Do you believe my story? Can it be believed, truly?\nPhoenix:\n...... That was seven years ago. I don't know what to believe. But...\nValant:\n...Yes?\nPhoenix:\nI'm glad I heard it from you, Mr. Valant. Thank you.\nValant:\n...It is I who should be thanking you, Mr. Wright. Only when I had lost everything could I make my decision...\nPhoenix:\n...You're going to turn yourself in?\nValant:\nMy partner may have vanished, but not so my guilt. And as my guilt stays, all else begins to leave me. My friends... my performance rights... my magic. I've had enough of vanishing acts.\nPhoenix:\n...I understand.\nValant:\nI thought my life was ruled by a dead man... ...but I find I was wrong. For Zak Gramarye was alive...\nPhoenix:\n(Well, not anymore.)\nValant:\n...... And now, it occurs to me: What if he was not the only one who survived?\nPhoenix:\n...What do you mean?\nValant:\nYou see, now that I think about it... ...I realize that I, no... we never saw proof of her demise. We never saw her body.\nPhoenix:\nUm, \"her\"...?\nValant:\n...The mind races and the mouth flaps on. My apologies. Forget this matter. I can only hope that the day will come when I again meet my partner, Zak Gramarye. Then... I shall apologize for my terrible mistake. I am glad we had this chance to talk... Thank you.\nPhoenix:\nZak Gramarye... \"Shadi Smith\". Whichever name you prefer... he is no longer with us. The truth revealed in that trial was only a sliver... ...and the impenetrable darkness that remained has taken another life. I knew what I'd have to do to push back the darkness for good. And it would involve paying that man a visit.\nSunshine Coliseum\nSolitary Cell 13 (after clearing all Talk options in Solitary Cell 13, clearing all Talk options with Vera Misham in Drew Studio (past), clearing all Talk options in Drew Studio (present), and clearing \"Valant's \"crime\"\" Talk option in Sunshine Coliseum)\nGuard:\nSorry sir. Prisoner Kristoph Gavin is currently \"occupied\".\nPhoenix:\nI see... Do you know when he'll be finished?\nGuard:\nAh, erm, well...\nPhoenix:\n...Could you go find out?\nGuard:\nAh... Certainly, sir. Please wait here a moment.\nPhoenix:\n(My apologies to the guard... But there's something I need to see.)\nPhoenix:\n...There it is. The yellow envelope! And the sender is... Drew Misham! I was right!\nBrushel:\nWhen I arrived at the studio, Mr. Misham was at his desk. He seemed to be writing a letter... but he quickly sealed the envelope. It was a yellow envelope. ...I heard it was left at the crime scene.\nPhoenix:\nIf this is the last letter that Drew Misham wrote... ...then there's something I need to do. ...The last thing I need to do, in fact. ...Here goes! Let's see if this atroquinine spray finds anything...\nPhoenix:\nSo this was Drew Misham's \"messenger of death\". It was this stamp alright! No mistaking it! And his last letter... was sent to Kristoph Gavin. Gotcha.\nLetter from Misham added to the Court Record.\nPhoenix:\nFinally... decisive evidence!\nKristoph:\n...What's this? A burglar... in jail?\nPhoenix:\n...Gavin!\nKristoph:\nI didn't know you moonlighted in larceny, Wright.\nPhoenix:\nGavin... There's something I have to ask you.\nKristoph:\n\"Can I steal your stuff\"? The answer is \"no\". My apologies, but there's not much I care to discuss.\nPhoenix:\n...... Vera Misham hasn't received her verdict yet. ...You follow me, Gavin?\nKristoph:\nThere are no known survivors of atroquinine poisoning. But it never hurts to hope.\nPhoenix:\n...OK, I'll be leaving now, then.\nKristoph:\nWright. Wait.\nPhoenix:\n...Yeah, Gavin?\nKristoph:\nWould you mind leaving that letter? ...It's private.\nPhoenix:\nOh, sorry. Forgot I had it.\nKristoph:\n...Many thanks.\nPhoenix:\n...We've now seen all the clues in this case. Clues I gathered over seven long years. Now, it is time. Every story has an ending. We've come to the final chapter, the final trial. Find the truth. You're the only ones who can.\nTo be continued.",
  "characters": [
    {
      "currentChapter": "Turnabout Succession",
      "name": "Phoenix Wright",
      "age": "33",
      "gender": "Male",
      "description1": "A pianist who can't play a lick. Formerly an ace defense attorney of some renown."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Trucy Enigmar → Trucy Wright",
      "age": "8 → 15",
      "gender": "Female",
      "description1": "Future star magician, and Phoenix Wright's daughter. Fond of her Mr. Hat trick.",
      "description2": "Zak Gramarye's daughter. Already dresses the part of a magician to the hilt.",
      "description3": "Future star magician, and Phoenix Wright's daughter. Fond of her Mr. Hat trick."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Vera Misham",
      "age": "12 → 19",
      "gender": "Female",
      "description1": "My client, apparently. I know nothing other than her name and mailing address.",
      "description2": "The defendant. Accused of poisoning her father, Drew Misham.",
      "description3": "Arrested on suspicion of poisoning her father, Drew Misham. Currently on trial."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Ema Skye",
      "age": "25",
      "gender": "Female",
      "description1": "Detective obsessed with forensics. In charge of the initial investigation."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Drew Misham",
      "age": "45 → 52",
      "gender": "Male",
      "description1": "Painter known for his illustrations. Poisoned at Drew Studio.",
      "description2": "Painter. Summoned to this trial by the authority of Prosecutor Gavin.",
      "description3": "Painter known for his illustrations. Poisoned at Drew Studio."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Valant Gramarye",
      "age": "37 → 44",
      "gender": "Male",
      "description1": "Popular stage magician. His overly loquacious manner can get annoying.",
      "description2": "Zak's young partner and understudy. The two of them on stage was a sight to see.",
      "description3": "The most popular stage magician today. Once performed with his partner, Zak."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Spark Brushel",
      "age": "29 → 36",
      "gender": "Male",
      "description1": "Freelance journalist. Can smell a scoop from miles away."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Klavier Gavin",
      "age": "17 → 24",
      "gender": "Male",
      "description1": "Star prosecutor and leader/vocalist for the rock group, the Gavinners."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Shadi Enigmar → Zak Gramarye",
      "age": "40 → 47",
      "gender": "Male",
      "description1": "My client in this case. Usually goes by his stage name, \"Zak Gramarye\".",
      "description2": "Trucy's father. Defendant in a trial, vanished just before the verdict was announced."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Magnifi Gramarye",
      "age": "67 → deceased",
      "gender": "Male",
      "description1": "The victim in this case. Died after being shot in the head while in the hospital.",
      "description2": "Founder of Troupe Gramarye, and a great magician. Mentor to Zak and Valant."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Dick Gumshoe",
      "age": "32",
      "gender": "Male",
      "description1": "Homicide detective at the local precinct. In charge of the initial investigation."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Apollo Justice",
      "age": "15 → 22",
      "gender": "Male",
      "description1": "A greenhorn defense attorney I happened to meet. I call him Apollo."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Kristoph Gavin",
      "age": "25 → 32",
      "gender": "Male",
      "description1": "Incarcerated at the Central Penitentiary for the murder of Shadi Smith."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Thalassa Gramarye",
      "age": "33 → 40",
      "gender": "Female",
      "description1": "Trucy's mother. Still missing after her sudden disappearance.",
      "description2": "Trucy's mother, and the daughter of Magnifi Gramarye. Whereabouts currently unknown."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Mike Meekins",
      "age": "24 → 31",
      "gender": "Male",
      "description1": "Bailiff responsible for security at the trial where Zak Gramarye vanished."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Shadi Smith",
      "age": "47",
      "gender": "Male",
      "description1": "In reality, the magician Zak. Murdered at Russian eatery: the Borscht Bowl Club."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Succession",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "How long did I yearn for one of these? Just putting it on makes me feel... ready.* (when playing as Apollo Justice)",
      "description2": "It's my all-important badge. It shows that I am a defense attorney.* (when playing as Phoenix Wright)"
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Magic Show Ticket",
      "type": "Other",
      "obtained": "Received from Trucy Wright.",
      "description1": "For premier showing of a grand illusion, to be performed by the magician, Valant Gramarye."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Gramarye Envelope",
      "type": "Documents",
      "obtained": "Received from Phoenix Wright.",
      "description1": "Envelope from Mr. Wright. Do not open until the time is right."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Vera's Card",
      "type": "Documents",
      "obtained": "Received from Vera Misham.",
      "description1": "Defendant's business card. The address for Drew Studio is on the front."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Portrait",
      "type": "Other",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "Obtained at Drew Studio. That bit in the middle is supposed to be a person."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Acrylic",
      "type": "Other",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "Obtained at Drew Studio. An undersea scene in vivid colors."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Landscape",
      "type": "Other",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "Obtained at Drew Studio. Only half finished, the rough sketch is still visible."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Coffee Mug",
      "type": "Evidence",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "The victim's last mug of coffee. The scrawl on the side is Drew Misham's signature.",
      "description2": "Traces of the slow-acting deadly poison atroquinine were found on the rim."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Hidden Painting",
      "type": "Other",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "Found at Drew Studio. Notable for the large peach in the foreground."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Red Envelope",
      "type": "Documents",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "Found in the victim's desk drawer. Appears to have been opened once and resealed.",
      "description2": "Found in the victim's desk drawer. Contains two sheets of writing paper."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Letter Box",
      "type": "Other",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "Drew Misham's contact with the outside world. It's empty."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Tiny Frame",
      "type": "Evidence",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "Frame measuring two inches by two inches. Bears traces of deadly poison atroquinine."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Brushel's Card",
      "type": "Documents",
      "obtained": "Received from Ema Skye.",
      "description1": "This business card reads \"Spark Brushel, Freelance Journalist\"."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Misham's Autopsy Report",
      "type": "Reports",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "Death by atroquinine poisoning. Estimated time of death: 9:00-9:30 PM."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Crime Photo",
      "type": "Photographs",
      "obtained": "Received during the preliminary hearing.",
      "description1": "Body found in hospital room, shot in the forehead. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Magnifi's Autopsy Report",
      "type": "Reports",
      "obtained": "Received during the preliminary hearing.",
      "description1": "Cause of death: single gunshot to the head. Estimated time of death: 11:00-11:30 PM."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Notebook Page",
      "type": "Documents",
      "obtained": "Received from Trucy Enigmar.  → Submitted as evidence by Prosecutor Gavin.",
      "description1": "Mysterious paper received just before the trial. Click here for details.",
      "description2": "Forged to look like a page of Magnifi's diary. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Magnifi's Chart",
      "type": "Documents",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "Diagnosed with a malignant tumor. Given 3 months. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Small Syringe",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "Used for administering insulin shots. Has been washed and shows no sign of use."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Magnifi's Letter",
      "type": "Documents",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "Letter asking Zak to shoot him. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Stage Pistol",
      "type": "Weapons",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Fires one real bullet. Rifling marks match bullet found in victim. No fingerprints found."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Magnifi's Letter 2",
      "type": "Documents",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "Letter telling Valant to come at 11:20 PM. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "IV Report",
      "type": "Reports",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "IV stopped 10 min. after administration began. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Magnifi's Diary",
      "type": "Documents",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "A memoir of sorts. Written in up to just before he died."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "The Amazing Mr. Hat",
      "type": "Other",
      "obtained": "Received from Trucy Enigmar.",
      "description1": "Trucy's favorite trick. Startlingly realistic."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Trucy's Locket",
      "type": "Other",
      "obtained": "Received from Trucy Enigmar.",
      "description1": "Contains a photo of Trucy's mother, Thalassa."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Transferal of Rights",
      "type": "Documents",
      "obtained": "Received from Shadi Smith.",
      "description1": "Document tranferring the right to perform the Gramarye repertoire to daughter Trucy."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Nail Polish",
      "type": "Other",
      "obtained": "Received from Solitary Cell 13.",
      "description1": "Retrieved from Kristoph Gavin's cell. The nail polish is colorless."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Commemorative Stamp",
      "type": "Other",
      "obtained": "Received from Drew Studio.",
      "description1": "Commemorative stamp showing Troupe Gramarye. Click here for details.",
      "description2": "Sent from the real \"client\". Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Thalassa's Portrait",
      "type": "Other",
      "obtained": "Received from Spark Brushel.",
      "description1": "Photo of a young Thalassa, Trucy's mother. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Zak's Confession",
      "type": "Documents",
      "obtained": "Received from Shadi Smith.",
      "description1": "Confession to the slaying of Magnifi Gramarye. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Letter from Misham",
      "type": "Evidence",
      "obtained": "Retrieved from Solitary Cell 13.",
      "description1": "Letter posted by Drew Misham just before dying. Poison traces found on the stamp."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Letter from Mr. Wright",
      "type": "Evidence",
      "obtained": "Received from Phoenix Wright.",
      "description1": "Reproduction of information found by Mr. Wright during his investigation."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "Turnabout Succession\n\n\n\n\n\n\n\n\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 4\n\nPart 5Phoenix:\n...Welcome to court. Seven years... all leading to one verdict. A verdict which you must decide. Is the defendant, Vera Misham, innocent... or guilty? The courtroom doors are opening... the trial awaits. Are you ready to begin?Courtroom No. 3Preparations Complete...Something inside me... rising... surfacing... ...Something important... lost long ago... it's close now... so close.October 9, 10:00 AMDistrict CourtCourtroom No. 3Examine evidence\n\n\n\n\n\n\n\n\n\nNail Polish\n\n\n\n\n\n\n\n\n\nBottom\n\n\n\n\n\n\n\nApollo:\nThe nail polish Mr. Wright gave me. This must be the brand symbol. It's an \"A\", drawn like a flower. It's refreshing to see a brand with a simple, clear design like this.\n\n\n\n\n\nLetter from Misham\n\n\n\n\n\n\n\n\n\nStamp\n\n\n\n\n\n\n\nApollo:\nThis stamp... It's of the Gramaryes, Isn't it? Why did Mr. Wright give me this letter right before the trial? What could it mean...?\n\n\n\n\nFront side\n\n\n\n\n\n\n\nApollo:\nThere's an address on here... And a name I've never heard of. At least, I think so... It's too blurry to read.Judge:\nCourt is now in session for the trial of Vera Misham.Apollo:\n...The defense is ready, Your Honor.Klavier:\n...Prosecution's ready to rock.Judge:\nProsecutor Gavin. How is the defendant... Vera Misham's condition?Klavier:\nAcute atroquinine poisoning. According to her physician... ...she could die at any time. Thus... her absence from the courtroom today.Trucy:\nWhat!? They can't put her on trial without her being here!Apollo:\nIt... is unusual.Trucy:\nThey should wait for her to get better and do it then. ...It's so bureaucratic of them!Apollo:\nThat's being a little harsh. (They can't delay the trial any longer. ...Or they risk having no one left to try.)Klavier:\nA trial without a verdict can only cause grief... ...The records of this case, and experience, tell us this. ...Apologies to the defendant, but the show must go on.Apollo:\n(Right... if Vera dies, the trial will be canceled. ...I'm not going to let that happen! Mr. Wright told me everything that's been going on behind the curtain all these years. I'm going to get Vera her innocent verdict while there's still time!)Judge:\n...Very well. Your opening statement, Prosecutor Gavin.Klavier:\nThe prosecution's case is unchanged by recent events. Why did Vera Misham succumb to poison? Because she couldn't live with the guilt of what she'd done.Apollo:Apollo:\nBut Vera was poisoned with atroquinine! The exact same poison that took her father's life!Klavier:\n...What better confession could you ask for? Being the killer she would have had access to the poison. Significant, since it's rather hard to come by.Judge:\nHmm... That is true.Klavier:\nIn other words... I see no need for further discussion. We could have had our verdict... yesterday.Judge:\nWell, Mr. Justice? If you have no objections, I see no reason to postpone a verdict.Apollo:\n...What we need to worry about isn't the verdict... but the trial itself! The defense holds that Vera Misham is the victim not the killer!Klavier:\nIf that's so... then you have to prove something. She was in court, giving her testimony before us. How do you propose her \"killer\" poisoned her? Oh... and incidentally, it would be nice if you told us who her mystery \"killer\" was.Judge:\n...The prosecution's objection is sustained. I ask the defense to prove its claims to this court. Tell us how Vera Misham was \"poisoned\"!Apollo:\n(...I've got two things to prove here. Who did it, and how. Which to hit first?)Show \"how\"\n\n\n\n\n\n\n\nApollo:\nHow did the killer poison Vera Misham...? I will focus first on the method used.\nJudge:\nHmm... Any comments before we begin, Prosecutor Gavin?\nKlavier:\nNot a bottle or container of the poison was found on the defendant's body.\nJudge:\nI see... So the vector of poisoning is unknown. Is the defense prepared to prove how the poison reached Vera Misham?\nApollo:\n...Yes, Your Honor.\nJudge:\nVery well. What method was used to poison Vera Misham?\n\n\n\nPresent Nail Polish\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"What's this...? My, what a beautiful bottle.\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nApollo:\n\nJudge:\nFrom what I hear... ...atroquinine takes a while before it acts on the body.\nKlavier:\nYes. \"Slow acting\", it's called.\nJudge:\nAlso from what I hear... ...my penalties hurt more later than at the moment they're given. ...But let's find out!\nApollo:\n(OK, I'm wrong, I get it.)\nTrucy:\nThey've really made an art out of this penalty thing.\nLeads back to:\n\"Very well.\"\n\n\nJudge:\nWhat's this...? My, what a beautiful bottle. I'd like to give whoever designed that a hand.\nKlavier:\nIs that... nail polish? Hmm, it's colorless. Ah...!\nApollo:\nSomething the matter?\nKlavier:\nN-No. Nothing. Nothing at all.\nJudge:\nSo the killer put poison in this bottle, and made her drink it?\nApollo:\nAs Prosecutor Gavin has told us, this is nail polish.\nJudge:\nNail polish...?\nApollo:\n...It's like paint for nails. Know any women with red nails?\nJudge:\nAh! My wife has red nails! I see... so she's been painting them all this time!\nApollo:\nLet's recall yesterday's trial. Remember when Vera was testifying to the court?\n\n\nJudge:\nCourt is now back in session.\nVera:\n......\nApollo:\n(Vera seems pretty tense. She's practically chewing her fingernails clean off!)\n\n\nApollo:\nWhenever Vera became nervous, she had a habit... ...of biting her nails.\nJudge:\nHer nails... Aaah!\nApollo:\n...Prosecutor Gavin? When the prosecution had Vera examined, did they check her nails?\nKlavier:\nI... Well I...\nJudge:\nBailiff! Have them check the defendant's nails at once! ...Mr. Justice!\nApollo:\n...Yes?\nJudge:\nDo you know who did this? Do you know who put poison in that nail polish!?\nApollo:\n...Yes.\nKlavier:\nThat bottle... belongs to Vera Misham?\nApollo:\nWhy do you ask? Know someone else who might have a bottle like this?\nKlavier:\n...... No. Just checking.\nJudge:\nMr. Justice. You are about to accuse someone of poisoning that bottle of nail polish! Please dispense with the chatter. You realize the weight of this accusation? Here, let me show you.\nApollo:\n...Understood, Your Honor. (No problem. I know what I'm doing this time.)\nJudge:\nThen let us ask! Who poisoned Vera Misham via her nail polish!?\n\n\n\nPresent Kristoph Gavin profile\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Wh-What's this? Kristoph Gavin...?\"\n\n\n\n\nPresent anyone else\n\n\n\n\n\n\n\nApollo:\n\nJudge:\nHmm... I'm having a little trouble following your reasoning. Any insights, Prosecutor Gavin?\nKlavier:\nIt is clear just who is poisonous here. Herr Forehead is poisoning the hearts and minds of this court!\nJudge:\n...Very well. Then let's fight poison, with penalty!\nApollo:\n(...No slouching now, Justice! This is my chance to drag the real killer out into the light of day! I know who gave Vera that bottle!)\nLeads back to:\n\"Then let us ask!\"\n\n\nJudge:\nWh-What's this? Kristoph Gavin...?\nKlavier:\n\nKlavier:\n...What's your game? My bro... There's no way he could do a thing like that! You should know that better than anyone else!\nJudge:\nIndeed... ...He is behind bars.\nApollo:\n...I know. However... ...that doesn't mean it was impossible to do what he did.\nKlavier:\nWhat...?\nApollo:\nAsk yourselves \"when\" he put the poison in the bottle. It could have been yesterday. ...It could have been a month ago. Maybe it was a year ago? ...Or perhaps, it was seven years ago.\nJudge:\nB-But...! Kristoph Gavin had no motive for killing this poor girl!\nLeads to:\n\"...It's simply inconceivable!\"Show \"who\"\n\n\n\n\n\n\n\nApollo:\nJust who poisoned Vera Misham? I have a name for you.\nKlavier:\nJust a moment, Herr Forehead. You are aware this is an accusation you're making? I think a bit of risk is in order. This much, to be precise.\nApollo:\n...I understand. (No problem. I know what I'm doing this time.)\nJudge:\nThen let's hear it! Who poisoned Vera Misham?\n\n\n\nPresent Kristoph Gavin profile\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Wh-What's this? Kristoph Gavin...?\"\n\n\n\n\nPresent anyone else\n\n\n\n\n\n\n\nApollo:\n\nJudge:\nHmm... I'm not sure I entirely understand. Do you understand, Prosecutor Gavin?\nKlavier:\nIt is clear just who is poisonous here. Herr Forehead is poisoning the hearts and minds of this court!\nJudge:\n...Very well. Then let's fight poison, with penalty!\nApollo:\n(...No slouching now, Justice! This is my chance to drag the real killer out into the light of day! I know who gave Vera that bottle!)\nLeads back to:\n\"Then let's hear it!\"\n\n\nJudge:\nWh-What's this? Kristoph Gavin...?\nKlavier:\n\nKlavier:\n...What's your game? My bro... There's no way he could do a thing like that! You should know that better than anyone else!\nJudge:\nIndeed... ...He is behind bars.\nApollo:\n...I know. However... ...that doesn't mean it was impossible to do what he did.\nKlavier:\nWhat...?\nApollo:\nKristoph Gavin had the opportunity to poison Vera Misham!\nJudge:\nApparently, the defense has something in mind. Let's see what it is! How did Kristoph Gavin, currently in solitary confinement, poison her!?\n\n\n\nPresent Nail Polish\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"What's this...? My, what a beautiful bottle.\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nApollo:\n\nJudge:\nFrom what I hear... ...atroquinine takes a while before it acts on the body.\nKlavier:\nYes. \"Slow-acting\", it's called.\nJudge:\nAlso from what I hear... ...my penalties hurt more later than at the moment they're given. ...But let's find out!\nApollo:\n(OK, I'm wrong, I get it.)\nTrucy:\nThey've really made an art out of this penalty thing.\nLeads back to:\n\"How did Kristoph Gavin, currently in solitary confinement, poison her!?\"\n\n\nJudge:\nWhat's this...? My, what a beautiful bottle. I'd like to give whoever designed that a hand.\nKlavier:\nIs that... nail polish? Hmm, it's colorless. Ah...!\nApollo:\nSomething the matter?\nKlavier:\nN-No. Nothing. Nothing at all.\nJudge:\nSo the killer put poison in this bottle, and made her drink it?\nApollo:\nAs Prosecutor Gavin has told us, this is nail polish.\nJudge:\nNail polish...?\nApollo:\n...It's like paint for nails. Know any women with red nails?\nJudge:\nAh! My wife has red nails! I see... so she's been painting them all this time!\nApollo:\nLet's recall yesterday's trial. Remember when Vera was testifying to the court?\n\n\nJudge:\nCourt is now back in session.\nVera:\n......\nApollo:\n(Vera seems pretty tense. She's practically chewing her fingernails clean off!)\n\n\nApollo:\nWhenever Vera became nervous, she had a habit... ...of biting her nails.\nJudge:\nHer nails... Aaah!\nApollo:\n...Prosecutor Gavin? When the prosecution had Vera examined, did they check her nails?\nKlavier:\nI... Well I...\nJudge:\nBailiff! Have them check the defendant's nails at once!\nApollo:\nKristoph Gavin didn't have to \"poison\" that bottle the day of the poisoning, Your Honor! The moment Vera first held that bottle in her hand, her fate was sealed!\nJudge:\nB-But wait! This business about Kristoph Gavin giving her that bottle is only conjecture!\nLeads to:\n\"...It's simply inconceivable!\"Judge:\n...It's simply inconceivable!Apollo:\n...Prosecutor Gavin doesn't seem to think so.Klavier:\n......Apollo:\n...That face tells me one thing. Kristoph Gavin's own younger brother doesn't find it inconceivable at all.Judge:\nHmm... Well, Prosecutor Gavin? If you feel there is a clear and pressing need... ...then we may have to summon Kristoph Gavin from jail as a special witness.Klavier:\n...... Fine. I've known for some time that an impenetrable darkness lurked at the bottom of this. ...A darkness that has swallowed even myself.Apollo:\n......Klavier:\n...OK. The defense's wish is granted. Let prisoner Kristoph Gavin take the stand!Judge:\nBailiff, begin proceedings to call a special witness! The witness is Kristoph Gavin, currently residing in Solitary Cell 13 at Central Prison!Kristoph:\n...Ah, Your Honor. How nice to see you again.Judge:\nI-It's been quite a while, hasn't it?Kristoph:\nTo what do I owe the pleasure of your company? It's not every day I'm summoned from my solitary cell. In fact, it's never.Apollo:\nI think you already know, Mister Kristoph Gavin.Kristoph:\nAh... Mr. Justice. ...I hear you've been doing quite well for yourself.Apollo:\n(Ack... Why do I feel like somehow, he's still my boss...?)Trucy:\nStiff upper lip, Apollo! You can do it!Apollo:\n...Does this bottle look familiar?Kristoph:\nAriadoney nail polish? ...Why yes, I use it myself. As did the late defendant, I hear.Apollo:\nShe's not dead yet!Kristoph:\nAnd...? Was there something concerning this bottle you wished to ask me about? I admit, I respect her for her taste in nail polish.Apollo:\nHer \"taste\" indeed! This nail polish was how Vera Misham was poisoned!Kristoph:\nAtroquinine... was it?Judge:\nYou're well informed about the case, Mr. Gavin.Kristoph:\nEven in solitary, much comes to my desk. And I have nothing to do but read. ...Well, Klavier?Klavier:\n...!Kristoph:\n...Maybe you can explain this?Klavier:\n...... You're being accused again. ...By him. Again.Kristoph:\nAhh. And? You agree with his accusation, do you?Klavier:\n......Judge:\nLet's hold a proper trial, shall we? Kristoph Gavin... your testimony, please.Kristoph:\n...I'd be delighted.Judge:\nThe charges against you are quite severe, Mr. Gavin. You are suspected of the poisoning of the defendant, Vera Misham... ...Please testify on this matter to the court!Witness Testimony-- Poisoning Vera --Kristoph:\nOwning the same nail polish does not a murderer make.\nI have been in solitary confinement for half a year. How could I poison her?\nHer father died of the same poison... the meaning of which should be clear.\nThe prosecution's case holds. She poisoned her father, then attempted to poison herself.\nSurely, you aren't going to suggest I was responsible for poisoning her father, too?Judge:\nWell... ...I'm afraid the defense's claim is sounding rather unlikely.Kristoph:\nNaturally. For one, I don't even know the Mishams. Isn't that so, Mr. Justice?Apollo:\n......Judge:\nVery well. Mr. Justice, begin your cross-examination.Apollo:\n(I'm accusing Kristoph Gavin, my ex-boss. But I know he poisoned the Mishams! The question is \"when\" could he have done it...? Not to mention... \"why\"?)Cross Examination",
      "testimonies": [
        {
          "testimony": "Owning the same nail polish does not a murderer make.",
          "person": "Kristoph",
          "present": []
        },
        {
          "testimony": "I have been in solitary confinement for half a year. How could I poison her?",
          "person": "Kristoph",
          "present": []
        },
        {
          "testimony": "Her father died of the same poison... the meaning of which should be clear.",
          "person": "Kristoph",
          "present": []
        },
        {
          "testimony": "The prosecution's case holds. She poisoned her father, then attempted to poison herself.",
          "person": "Kristoph",
          "present": []
        },
        {
          "testimony": "Surely, you aren't going to suggest I was responsible for poisoning her father, too?",
          "person": "Kristoph",
          "present": []
        }
      ],
      "noPresent": true
    }
  ]
}