{
  "previousContext": "Turnabout Succession\nTranscript\nPart 1\nPart 2\nPart 3\nPart 4\nPart 5\nEpisode 4\nTurnabout Succession\n...And that is the whole truth of this case. In order to understand it myself... ...I had to know the story of these last seven long years. Nothing happens by chance... All is connected. And now... ..you stand ready to begin the final chapter of this story. Will the defendant be found guilty, or innocent? The decision is yours.\nOctober 7, 10:37 AMWright Anything Agency\nExamine evidence\nAttorney's Badge\nBack side\nApollo:\nThere's a number inscribed on the back of the badge. There are many numbers like it, but this one is mine. Proof that I'm an attorney. To tell the truth, I get a happy feeling inside just looking at it.\nTrucy:\nHey, Apollo! Look, on TV! Look! Look!\nApollo:\nYeah... uh, I'm kinda busy.\nTrucy:\nWhoa! Look at that! He's the last Gramarye, alright! Amazing!\nApollo:\n......\nTrucy:\nApollo, you should be watching this!\nApollo:\nOw ow ow! What? What!? ...I was writing about our last case in my journal.\nTrucy:\nLawyers are supposed to write things in \"records\", Apollo, not journals. And why now? That case was three months ago.\nApollo:\nHey, it's a long story. ...I did a lot, you know. I want to vacuum pack the feel of the moment for later. Right now I'm wowing the crowd by figuring out how Lamiroir disappeared.\nTrucy:\nThat's right! Uncle Valant did that illusion, too! But you're missing him on TV right now!\nApollo:\n*sigh*... I was just getting to the good part. (I suppose I should watch a little TV with her. After all, her father's expecting me to look after her while he's away...)\nAnnouncer:\nWhat you're now seeing is a rehearsal for the greatest magic show on Earth... ...happening right here at our very own Sunshine Coliseum!\nApollo:\nThe Sunshine Coliseum? Hey, that's where the Gavinners concert was!\nAnnouncer:\n...Only three more days until miracles happen here, right before your unbelieving eyes! The legendary Troupe Gramarye is performing for the first time in seven years!\nTrucy:\nThat's going to be great! I'm so there! You and Daddy are coming, too!\nApollo:\n(The legendary Gramaryes... ...If Trucy's real father were still alive... ...he'd be on that stage performing miracles.)\nTrucy:\nI've got the tickets and everything! Here's yours, Apollo.\nMagic Show ticket received.\nExamine evidence\nMagic Show Ticket\nBack side\nTrucy:\nAre you ready, Apollo!?\nApollo:\nReady? For what?\nTrucy:\nFor what!? For the Troupe Gramarye Grand Magic Show!\nApollo:\nI-It's not like I'm getting up on stage or anything...\nTrucy:\n...What are you talking about, Apollo!? You can't enjoy magic if you're not part of what's going on up on stage! I'll lend you my spare costume if you need one.\nApollo:\nHuh? You mean, I can't go in this?\nTrucy:\nNo.\nApollo:\n(...Doesn't get more straightforward than that.)\n...*squeak*...\n???:\nAh, you are here. Working hard or hardly working?\nPhoenix:\nHey! How have you been?\nTrucy:\nHi there, stranger!\nApollo:\n(Not exactly the kind of greeting I'd want to hear from my own kid. Though he has been gone a long time.)\nPhoenix:\nAh ha ha, how goes it, Trucy? Here, I got a present for you.\nTrucy:\nYay! Pudding! I love pudding! Ooh, it's farm-fresh! And not just one pudding, but three whole cups! I'll have to pace myself.\nPhoenix:\nWell, I'm beat.\nTrucy:\nThat's right, Daddy. You're on a top secret mission! You've got to take it easy with the secrets, you know.\nPhoenix:\nAh ha ha. How right you are.\nApollo:\nSo, you still can't tell us what your \"mission\" is?\nPhoenix:\n...... Maybe it is time. It has something to do with you, anyway.\nApollo:\nHuh? With... me?\nTrucy:\nOoh! Maybe you're getting a top secret mission, too! Maybe you can be one of those guys! A spy!\nApollo:\n(Can't I just be a defense attorney...?)\nPhoenix:\nAh ha ha! To be honest... ...telling you about the mission was my whole reason for coming here today.\nApollo:\nWhat...?\nPhoenix:\nTell me... ...you've heard of the Jurist System, yes?\nTrucy:\nThe Jurist System...?\nPhoenix:\nThat's right. The new legal system everyone's talking about.\nTrucy:\nHave you heard of it, Apollo?\nApollo:\nHuh? Uh... Maybe?\nPhoenix:\n...... Maybe not as many people are talking about it as I thought.\nApollo:\n(The \"Jurist System\", huh?)\nExamine\nBookshelf\nPhoenix:\nAh, those legal books were left by my mentor. Too bad I gave up the practice before reading them.\nApollo:\nThere's quite a few magic books in there, too, you know.\nPhoenix:\nAh ha ha. Those would be Trucy's. She'll remember they're there eventually, I'm sure.\nApollo:\n(For a moment, I thought Mr. Wright might do magic, too... A scary thought.)\nCharley the plant\nPhoenix:\n...The plant. It intrigues you, doesn't it?\nApollo:\nNot really. It's just the only thing in here that doesn't have some secret function.\nPhoenix:\nAh ha ha. No, no secrets. But lots of memories. And a name, too. Want to hear it?\nApollo:\nNot really.\nPhoenix:\nHis name... is Charley. If you were curious.\nApollo:\n(Really, I wasn't.)\nHula hoop\nTrucy:\nWant to have a go at that ring, Apollo?\nApollo:\nNo, no, I was just touching it.\nTrucy:\nC'mon, there's no need to be shy! Just slip it on... There!\nApollo:\nYoooooowwwwwwwwch!\nTrucy:\nYou're way too tense! You gotta loosen up, there.\nApollo:\nThe human body wasn't meant to bend like that!\nMagic split box\nApollo:\nI can't believe you're using this cutting-a-person-apart box as... shelf space.\nTrucy:\nYou know, I used that trick on stage the other night. Imagine my surprise when I pulled one of my shirts out of the box!\nApollo:\n...You should really examine your props before the show.\nPhotograph\nApollo:\nThat magician in the photo, is that your...?\nTrucy:\nMy real Daddy, yup! Zak Gramarye! He disappeared when I was little. I hung that up there so I wouldn't forget what he looked like.\nApollo:\n...I see. (She's smiling, but I'll bet that smile doesn't go very deep...)\nPiano\nApollo:\n(No one's practicing the piano, as usual. Even calling him a pianist is an insult to pianists everywhere.)\nTrucy:\nOK, Apollo! I'm going to guess what you're thinking right now!\nApollo:\nHuh? What, was I making a funny face or something?\nTrucy:\n\"Argh! I'm so hungry!\"... I'm right, right? Of course I am.\nApollo:\nThere's no \"of course\" about it! You guessed wrong. ...Besides, that's not what I'm thinking... it's what you're thinking!\nTrucy:\nAck! How did you do that!? You read my mind, Apollo!\nApollo:\nAt least you've got that pudding.\nTrucy:\nThat's right!\nApollo:\n...Try not to eat my share, will you?\nSilk hat\nApollo:\nThat hat... Is that a spare? It looks exactly like the one you always wear.\nTrucy:\nThat's the first rule of a professional: be prepared! You know, I put it on the other day... ...and this strange white substance fell all over me! It was like magic!\nApollo:\nOr... like fingerprint powder.\nSpaghetti\nApollo:\nA plate of plastic spaghetti for displaying in a shop. ...Where the heck does she get this stuff?\nTable\nTrucy:\nOoh, careful there, Apollo. A lot of people run into that table, you know. Why, some client knocked the pot clean over the other day.\nApollo:\n...Um, why not get a more sturdy table?\nTrucy:\nHmm. Maybe the table is partially to blame...\nApollo:\n...There's no \"maybe\" to this. That thing is a deathtrap.\nMove\nPhoenix:\nAhem. I wasn't finished talking to you, you know. Or rather, you weren't finished asking me questions.\nApollo:\n(Why try to fight it? I can't win...)\nTalk\nThe Jurist System\nTrucy:\nSo, Daddy, what's this \"Jurist System\" thing?\nPhoenix:\nWell, Trucy, do you know what a \"jury\" is?\nTrucy:\nI've heard of it. Isn't that those people who sit in court in those old courtroom dramas? The ones who get to decide if a guy's innocent or guilty? Do you know, Apollo?\nApollo:\n...Only from TV. It's twelve people, chosen from the community, right?\nPhoenix:\nWell, they're thinking about reviving that system. They're calling the new system, the \"Jurist System\".\nTrucy:\n\"No more doing whatever you like, Your Honor!\"\nPhoenix:\nNot quite that harsh. The jurists cooperate with the judge. They help analyze the case from different angles.\nApollo:\nAh, and there will be only six of them under the current proposal, right?\nTrucy:\nWow, you know your stuff, Apollo!\nPhoenix:\nTheir findings directly affect the verdict. Hopefully, people will start taking the courts a little more seriously now.\nTrucy:\nI feel like I'm on some kind of educational TV show! Starring Dr. Wright!\nPhoenix:\nAh ha. Dr. Wright, his assistant Trucy... ...and mascot Apollo. The perfect team!\nApollo:\n(Mascot...? Hey!)\nThe secret mission\nApollo:\nSo... What is this secret mission?\nPhoenix:\nThe Jurist System is my mission... more or less. Anyway, keep in mind that new ideas like this system are always risky, Apollo.\nTrucy:\nToo true... Everyone's got an opinion, and they just talk and talk and nothing gets decided. Kind of like you, Apollo.\nApollo:\nUh, I'm not that bad. Am I?\nPhoenix:\nIn any case... ...we're going to give it a shot. A test, if you will.\nTrucy:\nI don't like tests.\nPhoenix:\nWe'll take a case as a sample, and choose six jurists. I'll be the one helping with that process, incidentally.\nApollo:\nHelping... how?\nPhoenix:\nWell, for one, I'll be chair of the Jurist System Simulated Court Committee. The chair constructs the ideal situation... choosing the case, the jurist candidates... ...even the judge and the courtroom.\nTrucy:\nWow! It's like you have a real job!\nPhoenix:\n...I was never that good at the piano, to be honest.\nApollo:\n(Once a lawyer, always a lawyer, I guess.)\nPhoenix:\nThe trial's tomorrow, by the way. Don't miss it. The trial simulation that is.\nTrucy:\nA simulation, huh... Sounds interesting.\nValant Gramarye\nTrucy:\nHey, Apollo, I know you're all excited about that secret mission... ...but what about this!? The \"Troupe Gramarye Grand Magic Show\"!\nApollo:\nHuh? Oh, right. The card tricks.\nTrucy:\nThey're not \"card tricks\"! They're grand illusions! Miracles! The apocalypse! Heaven and Earth will shake!\nApollo:\n...So what, that's three whole days from now.\nTrucy:\nIt's at Sunshine Coliseum! Let's go! Let's go today! We can say hi to Uncle Valant!\nApollo:\nHave fun.\nTrucy:\nWhaaaat!? I can't go by myself! You know I'm not very outgoing!\nApollo:\nRiiight!\nPhoenix:\nWhy not go with her?\nApollo:\nBut... what about the \"secret mission\"...?\nPhoenix:\nOh, don't worry about that. You'll hear all about it tomorrow, regardless.\nApollo:\n(I don't trust that smile. He knows something that he's not telling me.)\nTrucy:\nYippee! Now you can take me to the coliseum!\nApollo:\n(*sigh* I suppose it wouldn't kill me to pop over there.)\nPhoenix:\nAh, \"Gramarye\", that reminds me...\nTrucy:\n...What's this, Daddy? Isn't that silk hat the Gramarye seal?\nPhoenix:\nConsider it a birthday present, Trucy.\nTrucy:\nThanks! It's great! But... ...today isn't my birthday.\nPhoenix:\n...Hmm. Good point. ...What day is it today, Apollo?\nApollo:\nHuh? Today? Um... I think it's \"Recycle Your Plastics\" day...\nPhoenix:\nThen, it's a Recycle-Your-Plastics present.\nTrucy:\nYippee! So it's plastic!\nApollo:\n(I've given up trying to understand them. It's much easier that way.) ...So what is it?\nTrucy:\nCan I open it, Daddy?\nPhoenix:\n...No.\nTrucy:\nHuh!?\nPhoenix:\nYou'll need that envelope someday. Someday soon. Don't open it until then.\nTrucy:\n...... Well, why didn't you just hold on to it until then?\nApollo:\n(...Because that would be the logical thing to do.)\nGramarye Envelope obtained.\nApollo:\nAn envelope about the Gramaryes, huh? Hmm...\nValant Gramarye (subsequent times)\nTrucy:\nHey, Apollo, I know you're all excited about that secret mission... ...but what about this!? The \"Troupe Gramarye Grand Magic Show\"!\nApollo:\nHuh? Oh, right. The card tricks.\nTrucy:\nThey're not \"card tricks\"! They're grand illusions! Miracles! The apocalypse! Heaven and Earth will shake!\nApollo:\n...So what, that's three whole days from now.\nTrucy:\nIt's at Sunshine Coliseum! Let's go! Let's go today! We can say hi to Uncle Valant!\nApollo:\nHave fun.\nTrucy:\nWhaaaat!? I can't go by myself! You know I'm not very outgoing!\nApollo:\nRiiight!\nPhoenix:\nWhy not go with her?\nApollo:\nBut... what about the \"secret mission\"...?\nPhoenix:\nOh, don't worry about that. You'll hear all about it tomorrow, regardless.\nApollo:\n(I don't trust that smile. He knows something that he's not telling me.)\nTrucy:\nYippee! Now you can take me to the coliseum!\nApollo:\n(*sigh* I suppose it wouldn't kill me to pop over there.)\nPresent\nAnything\nPhoenix:\nAh, \"presenting\", are we? I did my fair share of that back in the day. Showed my attorney's badge a lot, too.\nTrucy:\nHe may look cool and calm now, but you should have seen him before!\nPhoenix:\nAh ha ha. You know me too well, Trucy.\nApollo:\n(I'm glad I provided this opportunity for a little family bonding.)\nExamine evidence\nGramarye Envelope\nSignature\nApollo:\nAh, lookey here. A handwritten signature. It says... I can't read it.\nTrucy:\nThat seems odd to me. I mean, isn't a signature intended to show ownership? What's the use if no one can read it?\nApollo:\nIsn't enough if you can read your own? <!- potential typo? -->\nTrucy:\n...Oh! I never thought of it that way!\nAfter clearing \"The Jurist System\" and \"The secret mission\" Talk options:\nApollo:\nSo... what kind of case is the trial simulation about?\nPhoenix:\nWell, since it is the first run through of a new system, I wanted something simple.\nTrucy:\nGood thinking! No sense wearing yourself out on something too serious!\nPhoenix:\nTrue. The case is a murder.\nApollo:\nThat's not simple at all!!\nTrucy:\nBy \"simple\", did you mean that the defendant is...\nPhoenix:\n...Guilty. Yes. Most likely. ...So, good luck, Apollo.\nApollo:\nUm... with what?\nPhoenix:\nWith the trial tomorrow. You're defending, of course. Recall that I said it had something to do with you.\nTrucy:\nGo for it, Apollo! It's just a test case, anyway. No sweat!\nApollo:\nYeah, but there's still a verdict to be decided.\nPhoenix:\n...And a potentially serious sentence. The most serious, in a worst-case scenario.\nApollo:\nAck! You mean... the verdict's for real!? That's not a \"test\" trial! That's a... real trial!\nPhoenix:\nAll the forms have been filed. There's no turning back now. The trial begins tomorrow at 10 AM. Hope you can make room in your schedule.\nApollo:\nWh-Why am I only hearing about this now!?\nPhoenix:\n...Ah, yes. There was a change this morning. ...I picked a new case.\nApollo:\nEh...?\nPhoenix:\n...Something that happened last night.\nTalk\nThe trial simulation\nApollo:\nAlright, so what case are you going to use?\nPhoenix:\nYou really want to know don't you?\nApollo:\nOf course I do! I mean... I'm going to be defending, aren't I?\nPhoenix:\nIf all goes well, then yes. Of course, this is just a test. We wanted everyone to start without preconceptions. A blank slate, as it were.\nApollo:\nThere's a difference between having a blank slate and just being totally clueless. Whose dumb idea was that anyway? (Changed from [Who's [sic] dumb idea was that anyway?] in the original release)\nPhoenix:\nWell mine. Committee chair, remember?\nApollo:\nOh...\nPhoenix:\nWell, if you want to know that badly, I suppose... ...I could give you permission to examine the scene of the crime.\nApollo:\nGood! That's better.\nPhoenix:\n...But you can't talk to anyone involved with the case.\nApollo:\nWhat!? Then how am I supposed to defend...?\nPhoenix:\nYou let me worry about the details, there. Remember... I'm in charge of this trial. All of it.\nApollo:\nBut you don't want it to backfire, do you?\nPhoenix:\nApollo... ...if I am in charge of the whole trial... ...that means the entire affair is my responsibility. For good, or for bad.\nApollo:\n...!\nPhoenix:\nJust do what you can. And don't worry. I know what I'm doing.\nApollo:\nA... Alright.\nPhoenix:\nI'd recommend going down to the detention center. Your client's waiting for you. You can ask about the scene there.\nApollo:\nBut you just said I couldn't talk to anyone involved...\nPhoenix:\n...Oh, you can talk to your client. If... you can get her to talk.\nTrucy:\nWell, time's a wasting!\nThe trial simulation (subsequent times)\nApollo:\nAlright, so what case are you going to use?\nPhoenix:\nYou really want to know don't you?\nApollo:\nOf course I do! I mean... I'm going to be defending, aren't I?\nPhoenix:\nIf all goes well, then yes. Of course, this is just a test. We wanted everyone to start without preconceptions. A blank slate, as it were.\nApollo:\nThere's a difference between having a blank slate and just being totally clueless. Whose dumb idea was that anyway? (Changed from [Who's [sic] dumb idea was that anyway?] in the original release)\nPhoenix:\nWell mine. Committee chair, remember?\nApollo:\nOh...\nPhoenix:\nWell, if you want to know that badly, I suppose... ...I could give you permission to examine the scene of the crime.\nApollo:\nGood! That's better.\nPhoenix:\n...But you can't talk to anyone involved with the case.\nApollo:\nWhat!? Then how am I supposed to defend...?\nPhoenix:\nYou let me worry about the details, there. Remember... I'm in charge of this trial. All of it.\nApollo:\nBut you don't want it to backfire, do you?\nPhoenix:\nApollo... ...if I am in charge of the whole trial... ...that means the entire affair is my responsibility. For good, or for bad.\nApollo:\n...!\nPhoenix:\nJust do what you can. And don't worry. I know what I'm doing.\nApollo:\nA... Alright.\nAfter clearing \"The trial simulation\" Talk option in Wright Anything Agency:\nOctober 7Detention CenterVisitor's Room\nApollo:\n......\nTrucy:\n......\nApollo:\nThat's 20 minutes we've been waiting here! 20 minutes!\nTrucy:\nMaybe I should complain? I'm sure that guard has better things to do than stand there pretending he doesn't see us.\nApollo:\nYou know the minute we get angry, the client will show. It always works that way.\nTrucy:\nLike shouting, \"Oh, waiter!\" and they're standing right behind you? Oh, guaaaaard! Is our client going to be much longer?\nGuard:\nWhat are you talking about!? Haven't you already started the meeting, yet!?\nTrucy:\n...Huh? Eeeeeeeeeeeeeeek!\nApollo:\nWh-Wh-Where'd you come from!?\n???:\n......\nApollo:\nW-W-W-Well... ...Anyway! Please have a seat!\n???:\n......\nTrucy:\n...... I'm nervous, Apollo.\nApollo:\nIt's the silence. It builds suspense. Why don't you do something, Trucy? You're a magician, aren't you?\nTrucy:\nTh-That's right. OK...\nMr. Hat:\nI'm the Amazing Mr. Hat!\n???:\n......\n...*thud*...\nTrucy:\nEeeeeeeeek! She passed out!\nApollo:\nHmm. Ms. Magic Underwear might have been a better bet.\nTrucy:\nThat's \"Magic Panties\", Apollo!\nExamine\nSecurity camera\nApollo:\nThe security camera stares down from the ceiling, all-seeing, unblinking. Not that I'm nervous or anything.\nSecurity guard\nApollo:\nThe same old security guard is glaring at us. ...He winked. Maybe he's not such a bad guy after all.\nTalk\nIntroductions\nApollo:\nUm. Uh. Hi! Well, I'm your defense... ...I really think it has to be fate, you know!\n???:\n......\nApollo:\nAnd by fate, I mean destiny! Did you know I'm good with astrology? Tell me, what's your sign?\n???:\n......\nTrucy:\n...I can tell you mine, if you'd like, Apollo?\nApollo:\n...No, never mind. I just got carried away there. (I seem destined to get difficult clients, it seems.)\nYour name?\nApollo:\nUm... So, what's your name?\n???:\n......\nApollo:\nOh, right, I'm supposed to introduce myself first! I'm Apollo! Apollo Justice!\n???:\n......\nTrucy:\nAnd I'm Trucy Wright.\nApollo:\n...I know. (This is getting nowhere fast.)\nThe case\nApollo:\nHey, I know! Maybe you can tell us what happened? I'm your defense attorney, after all!\n???:\n......\nApollo:\nUm, anything out of the ordinary happen lately?\n???:\n......\nTrucy:\nWell, the other day this tourist from out of town stopped to ask me directions.\nApollo:\n...Later, Trucy. (I feel like I need to ask directions myself here...)\nPresent\nAnything\nApollo:\nUm, see this here?\n???:\n......\nApollo:\nUm, does it ring any bells?\n???:\n......\nApollo:\n(Does anything I say ring anything?)\nAfter clearing all Talk options:\nApollo:\n(Well, that was fruitless. Though I think I understand despair a little better now.)\nTrucy:\nYou did good, Apollo!\n???:\n......\nTrucy:\nL-Look! She's doing her nails!\nApollo:\nWhat? Are nails more important than defense? Is that it!? ...Let's go, Trucy.\n???:\n...Excuse me...\nApollo:\n...!\n???:\nC-Could you... Could you read this?\nApollo:\nUm, sure. (I feel like a teenager on a first date! And this is the love letter we passed from desk to desk at school...)\nTrucy:\nStop looking so wistful and read it, Apollo!\nApollo:\nIt... It's a business card. With a name and an address. The name is... Vera Misham? The address is for \"Drew Studio\".\nVera's Card added to the Court Record.\nExamine evidence\nVera's Card\nBack side\nTrucy:\nWhat a pretty business card. Looks like a postcard, almost.\nApollo:\nAnd on the back... Hmm. Just her name.\nTrucy:\nThat seems odd to me.\nApollo:\nHuh? What does?\nTrucy:\nWhy write your name on the front and back of the card? Why not use the space on the back for a self-portrait! Or a caricature! Then people would remember what you look like, too.\nApollo:\nThat's not a bad idea, actually.\nTrucy:\nHere, give me one of your cards, Apollo...\nApollo:\n(...She's drawing something. Hey! My hair's not THAT spiky!)\nApollo:\nAnd you're giving me this card because...?\nVera:\n......\nApollo:\n...... Well, looks like we're finished here.\nTrucy:\nI wonder if Drew Studio is the scene of the crime?\nApollo:\nLet's go find out.\nOctober 7Drew Studio\nApollo:\nWow, this looks like... it looks like a studio.\nTrucy:\nIt's like life imitating art... Or, maybe, it's the other way around... Hmm. But the tape on the ground there... It's a bit jarring...\nApollo:\nYeah... Looks like we found our crime scene...\nTrucy:\nApollo! Look at all those paintings!\nApollo:\nHey, don't touch those.\nTrucy:\nIt's OK, I'm just looking. Huh? Apollo... Look at this one.\nApollo:\n...Looks half finished. (You can still see the rough sketch underneath.)\nTrucy:\nBut, that's odd. The rough part doesn't look like the rest of the painting at all.\nApollo:\nYeah, good point. (That is odd...)\nDrew Misham's Paintings added to the Court Record.\nExamine evidence\nPortrait\nThinking person\nApollo:\nWell, what do we have here...? It looks like a person... thinking about something.\nTrucy:\nMaybe they're worried? Like, what should I have for supper: a hot dog, or a hamburger? ...... You know, I've always wondered about that. Why is there \"supper\" and \"dinner\"? Are they different meals or the same thing?\nApollo:\n...Maybe that's what this person's thinking about.\nAcrylic\nPorcupinefish\nApollo:\nIs that... a pufferfish?\nTrucy:\nApollo! That's clearly a porcupinefish!\nApollo:\n...They're not the same thing?\nTrucy:\nYou know what gets me? They're got all these needles, right? But what's protecting that soft spot on the lower belly there? Nothing!\nApollo:\n(...Must remember to keep Trucy away from small, round fish.)\nLandscape\nRough sketch\nTrucy:\nApollo, look at this painting. You can see the rough sketch!\nApollo:\nOh. Looks like it was only half-completed.\nTrucy:\nHuh? That's funny. Do the rough sketch and the finished painting look totally different to you, too?\nApollo:\n...They do, actually! (What's that all about...?)\nTrucy:\n...All the paintings have a really different style, too.\n???:\nAh! I thought I might find you two here.\nTrucy:\nEma! Long time no see!\nEma:\nOh? Seems like I run into you far too often. I'll bet I know why you're here, too.\nApollo:\nYou know about the trial simulation tomorrow?\nEma:\nI've heard about it, sure. So Mr. Wright chose you, huh?\nApollo:\nWe don't even know what the case is about.\nEma:\nWell, he was killed. The artist who owns this studio, that is. Mr. Drew Misham.\nTrucy:\nMisham...\nEma:\nAnd his daughter was put under arrest.\nApollo:\nYeah... We just saw her at the detention center.\nTrucy:\nIt was funny, though. She seemed more like a victim than the kind of person who could commit murder.\nEma:\nYou don't say. Not even by poisoning? That's how it was done, you know. Poisoning's a common way to get the job done, when the murderer is a woman.\nTrucy:\nP-Poisoning...?\nEma:\nAnyway, Mr. Wright told me you'd be coming. Feel free to take a look around. I'll just be over here. With my Snackoos.\nApollo:\n(We can't talk to anyone related to the case this time around... ...Which means we'd better find out as much as we can here at the scene. ...Or else.)\nExamine\nCoffee mug\nEma:\nAh, that's the victim's coffee mug.\nTrucy:\nAh ha! So the poison was in here! This is my first time seeing a real poisoned mug of coffee!\nApollo:\nI would hope so.\nEma:\n...... \"Poisoned Coffee\"...? Not exactly, actually.\nApollo:\nWhat do you mean?\nEma:\nNo traces of poison were found in the coffee.\nTrucy:\nWhat!?\nEma:\n...You'll have to figure out the rest yourself. I'm officially not on your side, after all.\nCoffee Mug added to the Court Record.\nCoffee mug (subsequent times)\nEma:\nThat coffee mug... it's not what you'd expect. No traces of poison were found in the coffee.\nApollo:\nHuh? Whaaaat?\nEma:\nYet the only thing the victim drank that night was this coffee... ...so the poison definitely reached him through this mug.\nTrucy:\n...... I like you better when you tell us stuff.\nEma:\nLook... Just figure it out yourselves, OK? I have my \"position\" here to consider.\nFloor outline\nTrucy:\nEek, Apollo! Th-That's where the body was!\nEma:\nThat's the spot where Mr. Drew Misham passed away. He put the coffee mug to his lips, and the next moment...\nApollo:\nThere's quite a bit of paint on the ground.\nEma:\nSee that half-painted painting there? He must have been working on that right up to the moment he died.\nTrucy:\nWow! A true artist to the end!\nEma:\nOr maybe he started it a year ago and was procrastinating.\nPainting behind dresser\nTrucy:\nHey... There's a painting hidden back here!\nApollo:\n...Hey, you're right!\nTrucy:\nWhat if it's embarrassing somehow, and he didn't want anyone to see it!?\nApollo:\nYou certainly seem pleased by the possibility.\nTrucy:\nHuh. It's so... normal!\nApollo:\nThat's hardly something to get mad about... ......\nTrucy:\nHuh? What is it, Apollo?\nApollo:\nWell, doesn't this painting look like... never mind.\nTrucy:\n...?\nApollo:\n(I'd better get a professional opinion on this...)\nHidden Painting added to the Court Record.\nPainting behind dresser (subsequent times)\nTrucy:\nHuh? What is it, Apollo?\nApollo:\nWell, doesn't this painting look like... never mind.\nTrucy:\n...?\nApollo:\n(I'd better get a professional opinion on this...)\nLetterbox\nTrucy:\nThat letter box looks funny sitting inside a room like this.\nApollo:\nLet's take a look... Empty.\nEma:\nThe other half of that letter box is actually connected to the outside of the studio. Mr. Misham would put his letters in there... ...and the postman took them away.\nTrucy:\nImpressive that someone still writes letters in this day and age. Or wrote, rather.\nPaintings\nTrucy:\nI wouldn't mind taking a closer look at those paintings. I just love oils! You know, how they're so thick? Is that the word?\nApollo:\n...These paints are all dry. I'm just surprised at how different these all are.\nTrucy:\nYeah... And what's going on with this half-finished one?\nApollo:\nIt must have been a work in progress. You can still see the rough sketch below...\nTrucy:\n...That's what's so weird. The sketched part doesn't really fit the finished parts.\nApollo:\nI noticed. (That is weird...)\nPaintings (subsequent times, before presenting Hidden Painting)\nTrucy:\nLet's take a closer look.\nApollo:\nThis painting here looks like a work in progress.\nTrucy:\nBut... the rough sketch part doesn't fit the other parts.\nApollo:\nI know. (Very peculiar...)\nPaintings (after presenting Hidden Painting)\nTrucy:\nLet's take a closer look! Why are two of the paintings identical?\nApollo:\nIt certainly is a bit curious. (...And a whole lot of suspicious.)\nPaintings (after presenting Hidden Painting; after Red Envelope is updated in the Court Record)\nTrucy:\nLet's take a closer look. Mr. Misham sure worked on a lot of different paintings. You think his works really go for a 100 grand a piece? Maybe I should take up painting.\nApollo:\n(I don't think his paintings are worth THAT much. Something's not right here.)\nWhite teacup\nEma:\nI imagine this coffee cup was for guests to use.\nTrucy:\n...Guests?\nApollo:\nDid the police already analyze this cup, too?\nEma:\nNot a trace of poison was found on that cup.\nApollo:\n(So the killer was after Drew Misham alone.)\nDrafting table\nTrucy:\nIs this desk for painting, Apollo?\nEma:\nThat would be a drafting table.\nTrucy:\n...Drafting?\nEma:\nBasically, it's a tool for making precise diagrams.\nTrucy:\n...Wow, painting is harder than I thought.\nApollo:\n(Why would a painter need a drafting table? Was he an architect, too?)\nEquipment\nTrucy:\nWhat is all this equipment here for? It doesn't look very artistic, really.\nEma:\nHe had everything from a lathe to a laser cutter. Looks like he was ready to work on metals and wood, too. ...Though his equipment's a bit old, to tell the truth.\nApollo:\nWhy would a painter need all this?\nEma:\nFrom the dust, I'd say he hasn't used this stuff for years.\nApollo:\n(This corner doesn't fit with the rest of the studio.)\nTrucy:\nOh, do you think I could borrow this? I want to cut a quarter in half to make a trick coin!\nApollo:\n...This is a crime scene, Trucy.\nTrucy:\nBut these cost like 50 bucks at the magic shop!\nDesk\nApollo:\nLet's take a closer look at this desk here.\nDesk drawer\nApollo:\nThis envelope has been opened and resealed.\nTrucy:\nOoh! I know how to do that! You take a pot of boiling water, and hold the envelope up to the steam. The glue melts and it opens! Cool, huh?\nApollo:\nWhoever did this wasn't so delicate.\nTrucy:\nYou're right. Looks like they just ripped it open and stuck it back together. ...Huh? The postmark on this letter is from seven years ago!\nApollo:\n(Why would someone open a letter, then seal it again? Hmm... I'd better hang on to this.)\nRed Envelope added to the Court Record.\nDesk drawer (subsequent times)\nApollo:\nThis envelope has been opened and resealed.\nTrucy:\nYou're right. Looks like they just ripped it open and stuck it back together.\nApollo:\nVery strange... (Why would someone open a letter, then seal it again? Hmm... I'd better hang on to this.)\nFeather\nTrucy:\nHey, Apollo, what's this feather-thingy?\nApollo:\nIsn't that a pen? Like an old-fashioned quill pen?\nTrucy:\nBut it doesn't have a pointy end.\nEma:\nThat was most likely for sweeping detritus off the desk.\nTrucy:\nWow, you sure know a lot, Ema.\nEma:\nBold and scientific, that's my motto.\nApollo:\n(...Exactly what about that was \"bold\" or \"scientific\"?)\nFigurine\nApollo:\nHmm. Something about the way that figure is posed...\nTrucy:\n...I've seen that pose before! It's you, Apollo! See, you're making one of your flamboyant gestures!\nApollo:\nPlease, I am a professional. (...I wonder why it's posed like that? Coincidence?)\nJournal\nApollo:\nIs this... a journal?\nTrucy:\nWow, talk about a clue! Let's read it!\nApollo:\n......\nTrucy:\nWh-What is it, Apollo!? He didn't write the name of the killer, did he!?\nApollo:\n...It's new. He didn't write a single line.\nTrucy:\nArgh! You had me going for a while there.\nPhotograph\nApollo:\nSo this is Drew Misham?\nTrucy:\nAnd this little girl must be Vera!\nEma:\nYes, they took that some years ago. They look close. A happy little family.\nApollo:\nUntil you arrested his daughter.\nEma:\n...Ack! Look, I was personally against that, OK? She just didn't seem very suspicious. Scientifically speaking.\nApollo:\nUh huh. Right.\nSmaller frame\nTrucy:\nOoh! Cute! Look at the tiny frame, Apollo!\nApollo:\nTiny is right. That thing's barely two inches high. What picture would fit in that?\nTrucy:\nNone, apparently. It's empty.\nApollo:\n(There's no glass in it, either. What's it doing sitting on the desk?)\nTrucy:\nThis is a lesson for us all: be sure to check the size when you buy frames!\nSmaller frame (after Tiny Frame is added to the Court Record)\nApollo:\nI wonder why there's poison on this tiny frame.\nTrucy:\nVery strange indeed. Wait, I know! I'll bet it was poisoned from the time he bought it! Haven't you heard about some kinds of green paint being toxic?\nApollo:\nI don't think they sell that kind anymore. And the poison was atroquinine, anyway. (A tiny, mysterious, poisoned frame...)\nPaint shelf\nTrucy:\nLook at all these paints, Apollo! There's so many! He's got like... twenty kinds of red! We could repaint your suit, Apollo! How about this shade of... green!?\nApollo:\nThat'll be enough of that, thanks.\nTalk\nThe victim\nTrucy:\nSo, this, um, Drew Misham was some kind of artist?\nEma:\nApparently. Did a lot of illustrations for books, I hear. Had a lot of female fans, too, for what it's worth.\nTrucy:\nOh? Well, I guess his stuff is kinda pretty. Like that oil painting over there, for instance.\nEma:\nUm... yeah. That... wasn't one of his illustrations, actually.\nApollo:\n(Huh? So it was a standalone painting or something? Is that what she means?)\nEma:\nHe was an odd bird, Misham. Hadn't shown his face to anyone until the end.\nTrucy:\nWhat do you mean, \"to anyone\"?\nEma:\nHe was always locked up here in this studio, apparently. His only connection to the outside world... ...was through letters he'd put in that letter box there.\nApollo:\nLetters? Do people still write letters?\nTrucy:\nWhat do you mean, Apollo?\nApollo:\nI mean, when was the last time you wrote a real letter? Don't most people use e-mail and stuff these days?\nEma:\nNot Mr. Misham. Couldn't stand technology, it seems. He did everything by mail.\nTrucy:\nMaybe he thought that way was more artistic, you know?\nLetter Box added to the Court Record.\nEma:\nIn any case, the only person besides him allowed in here... ...was his daughter, Vera.\nTrucy:\nOh, you mean the killer?\nApollo:\n...The \"suspect\", please.\nEma:\nWe took some fingerprints, of course. The only ones found in the room were Mr. Misham's and Vera's, basically.\nTrucy:\n\"Basically\"...?\nEma:\nActually, last night... ...Mr. Misham gave an interview to a reporter for the first time. It happened during the interview, apparently.\nEma:\nHis first interview ever...?\nApollo:\nCould you tell us a bit more about what happened the night of the murder?\nThe victim (subsequent times)\nTrucy:\nSo, this, um, Drew Misham was some kind of artist?\nEma:\nApparently. Did a lot of illustrations for books, I hear. Had a lot of female fans, too, for what it's worth.\nTrucy:\nOh? Well, I guess his stuff is kinda pretty. Like that oil painting over there, for instance.\nEma:\nUm... yeah. That... wasn't one of his illustrations, actually.\nApollo:\n(Huh? So it was a standalone painting or something? Is that what she means?)\nEma:\nHe was an odd bird, Misham. Hadn't shown his face to anyone until the end.\nTrucy:\nWhat do you mean, \"to anyone\"?\nEma:\nHe was always locked up here in this studio, apparently. His only connection to the outside world... ...was through letters he'd put in that letter box there.\nApollo:\nLetters? Do people still write letters?\nTrucy:\nWhat do you mean, Apollo?\nApollo:\nI mean, when was the last time you wrote a real letter? Don't most people use e-mail and stuff these days?\nEma:\nNot Mr. Misham. Couldn't stand technology, it seems. He did everything by mail.\nTrucy:\nMaybe he thought that way was more artistic, you know?\nEma:\nIn any case, the only person besides him allowed in here... ...was his daughter, Vera.\nTrucy:\nOh, you mean the killer?\nApollo:\n...The \"suspect\", please.\nEma:\nWe took some fingerprints, of course. The only ones found in the room were Mr. Misham's and Vera's, basically.\nTrucy:\n\"Basically\"...?\nEma:\nActually, last night... ...Mr. Misham gave an interview to a reporter for the first time. It happened during the interview, apparently.\nEma:\nHis first interview ever...?\nApollo:\nCould you tell us a bit more about what happened the night of the murder?\nThe defendant\nApollo:\nSo, this woman, Vera... She's Mr. Misham's daughter, right?\nEma:\nYep. A real sickly girl, ever since she was little. Hardly ever went outside.\nTrucy:\nShe did kind of give off a withdrawn sort of aura...\nEma:\nShe was home-schooled by her father, apparently. It was quite a scene when they took her to the detention center. She was screaming about how she'd die \"if they took her outside\".\nApollo:\nThat... does sound like a scene.\nEma:\nIn the end, she agreed to leave if she was allowed her \"good luck charm\" for company.\nTrucy:\nHer \"good luck charm\"...?\nEma:\nApparently, she has this charm that magically gives her the courage to go outside.\nApollo:\n(...Why can't I ever get a normal client?)\nTrucy:\nBut why would a shut-in daughter kill her own dad?\nEma:\nDon't look at me.\nApollo:\nSo, about the poison... It was found to be in his coffee, right...?\nEma:\nNo... Not precisely.\nTrucy:\nNot precisely? What does that mean?\nApollo:\n(It means \"see for yourself\", I think.)\nThe night of the crime (appears after \"The victim\"; before adding Tiny Frame to the Court Record and updating Red Envelope in the Court Record)\nEma:\nLike I said. Last night was the first time someone from the \"outside\" came into this studio. I guess mysterious painters who never go outside make for good articles.\nApollo:\nAnd it just so happened that he died the night of his first interview...?\nEma:\n...At around 9:00 PM every night... ...Vera always made him a cup of coffee. Last night, he drank his usual coffee, and suddenly became violently ill...\nTrucy:\n...And died? She poisoned him on the night of his interview!? Wouldn't the reporter see?\nEma:\nHe wasn't near Mr. Misham when she brought her father his coffee. He was checking out some equipment in the back of the room. ...Supposedly, that's why she didn't notice he was there. It was the reporter who called the police, in fact.\nApollo:\nWait, but why is she the suspect? If anyone is suspicious, it's the reporter!\nEma:\nYet the reporter never got near Mr. Misham's coffee. Even Vera acknowledges that.\nApollo:\n(Regardless, I want to know more about this \"reporter\".)\nThe night of the crime (appears after \"The victim\"; after adding Tiny Frame to the Court Record and updating Red Envelope in the Court Record)\nEma:\nLike I said. Last night was the first time someone from the \"outside\" came into this studio. I guess mysterious painters who never go outside make for good articles.\nApollo:\nAnd it just so happened that he died the night of his first interview...?\nEma:\n...At around 9:00 PM every night... ...Vera always made him a cup of coffee. Last night, he drank his usual coffee, and suddenly became violently ill...\nTrucy:\n...And died? She poisoned him on the night of his interview!? Wouldn't the reporter see?\nEma:\nHe wasn't near Mr. Misham when she brought her father his coffee. He was checking out some equipment in the back of the room. ...Supposedly, that's why she didn't notice he was there. It was the reporter who called the police, in fact.\nApollo:\nWait, but why is she the suspect? If anyone is suspicious, it's the reporter!\nEma:\nYet the reporter never got near Mr. Misham's coffee. Even Vera acknowledges that.\nApollo:\n(Regardless, I want to know more about this \"reporter\".) So, about this reporter...\nEma:\nI can't tell you much. I hear he's going to be a witness tomorrow, though.\nLeads to:\n\"I thought so.\"\nForensic science (appears after presenting Red Envelope or examining lip mark on Coffee Mug or seal on Red Envelope)\nApollo:\n(I bet Ema could help us out here...)\nTrucy:\nDon't forget, flattery will get you everywhere with her, Apollo!\nEma:\nHuh? What are you two whispering about?\nApollo:\nWell... I was thinking. I mean, what is it we always do when we run into you at a crime scene? What is it we always do... scientifically?\nEma:\nAh, you know me too well! OK...\nApollo:\nOK... meaning we can get erm, scientific now?\nEma:\nOh, I suppose. Just this once! Bring me anything you find suspicious and we'll check it out.\nForensic science (subsequent times)\nApollo:\nI was hoping we could do a little forensics works...\nEmma:\n...I suppose. If we must. Just this once!\nPresent\nPortrait, Acrylic, or Landscape\nApollo:\nEma, about this painting...\nEma:\nOh, that? Quite good, isn't it.\nApollo:\nEr, that's not what I wanted to ask you about.\nEma:\nYou want to examine it, is that it? I'd be happy to let you, if you had a good reason. But without that... sorry.\nApollo:\n(...I guess she wants us to do a little footwork on our own first.)\nHidden Painting\nApollo:\nOh, Ema, I was wondering about this painting here...\nEma:\nAh. Aaah. That one? What about it?\nApollo:\n\"What about it\"!?\nTrucy:\nYeah, what about it, Apollo?\nApollo:\nTake a closer look at it, both of you. Now... look at this one. This is the third painting he was working on.\nTrucy:\nHey. They're the same!\nEma:\n...I was hoping you wouldn't find that. You're right, though. Drew Misham was copying this painting.\nTrucy:\nWow. It's pretty good!\nApollo:\n(Copying a painting...? What for?)\nCoffee Mug\nApollo:\nSo, Ema, about this coffee mug...\nEma:\nI hope you aren't trying to grill me for information. You know I'm not talking.\nApollo:\n...I suppose you are the detective here.\nEma:\nWhy don't you two take a look yourselves? If you find a clue, I might not be unwilling to lend a hand.\nTrucy:\n...I think she's going to help us, Apollo.\nApollo:\nLet's check out this mug, shall we?\nCoffee Mug (after examining lip mark)\nApollo:\nUm, Ema, about this mug... ...there's a pale blue, uh, \"residue\" on the rim.\nEma:\nEh? Ah! Th-That! Yes, well, it's just a rumor... ...but I've heard there's a kind of coffee called \"Blue Mountain\"!\nApollo:\nI'm pretty sure it isn't actually blue, Ema.\nEma:\nAh. Right. OK, you got me. That's left over from my testing spray.\nTrucy:\nForensic science! I knew your hobby was behind this somehow, Ema!\nEma:\nIt's not a \"hobby\"!\nTrucy:\nSo, what kind of scientific stuff were you up to?\nEma:\nThis spray, that's what. It turns blue when it touches poison.\nApollo:\nSo, the poison that killed the victim was on this mug?\nEma:\nThat's right. See? It wasn't in the coffee. The killer applied it to the rim of the mug itself!\nTrucy:\nWow! Science is amazing!\nApollo:\n(It certainly is helpful... Maybe Ema'd be willing to help us out a bit more...)\nTrucy:\nYou should try buttering her up, Apollo. They say flattery will get you everywhere.\nApollo:\n(It's certainly worth talking to her a bit more.)\nCoffee Mug (after examining lip mark and clearing \"Forensic science\" Talk option)\nApollo:\nUm, Ema, about this mug... ...there's a pale blue, uh, \"residue\" on the rim.\nEma:\nEh? Ah! Th-That! Yes, well, it's just a rumor... ...but I've heard there's a kind of coffee called \"Blue Mountain\"!\nApollo:\nI'm pretty sure it isn't actually blue, Ema.\nEma:\nAh. Right. OK, you got me. That's left over from my testing spray.\nTrucy:\nForensic science! I knew your hobby was behind this somehow, Ema!\nEma:\nIt's not a \"hobby\"!\nTrucy:\nSo, what kind of scientific stuff were you up to?\nEma:\nThis spray, that's what. It turns blue when it touches poison.\nApollo:\nSo, the poison that killed the victim was on this mug?\nEma:\nThat's right. See? It wasn't in the coffee. The killer applied it to the rim of the mug itself!\nTrucy:\nWow! Science is amazing!\nApollo:\n(It certainly is helpful... Maybe Ema'd be willing to help us out a bit more...)\nTrucy:\nYou should try buttering her up, Apollo. They say flattery will get you everywhere.\nApollo:\n(It's certainly worth talking to her a bit more.) Um, about poison analysis...\nEma:\n...I was afraid you were going to ask about that. See, this solution is used to test for atroquinine.\nTrucy:\nAtro... huh?\nEma:\nAtroquinine! The deadly poison found in the autopsy!\nApollo:\n(...Uh oh, I know that spark in her eyes. She's getting excited. Best tread lightly.)\nEma:\nIt's one of the most virulent poisons, but is absorbed into the body astonishingly slowly. It takes at least 15 minutes from the time of ingestion for adverse effects to show. Oh, and guess what!? Recent research has shown...\nApollo:\nTh-That's fine, really. We don't need to know all the gory details.\nTrucy:\nI think I get it. You just spray this stuff on something you want to test, right?\nEma:\nPrecisely! You can find even the slightest trace of poison with this!\nTrucy:\nI wanna try, too, Ema! Pretty please?\nEma:\nYou don't have to ask twice! ...I already used it on everything suspicious, of course.\nTrucy:\nYay! Let's give it a whirl, Apollo!\nApollo:\nAaaaugh! What are you doing!?\nTrucy:\nI was just seeing if I got a reaction off of you.\nApollo:\nHow's this for a reaction: Never do that again! I'm not poisonous!\nTrucy:\nTell that to those hapless witnesses on the stand!\nApollo:\n(Let's just get down to checking for real poisons, shall we?)\nGo back\nLeads to:\n\"Too bad. No reaction there.\"\nTrucy:\nToo bad. No reaction there.\nApollo:\nI'm sure Ema checked out all the likely spots. ...Wait a second.\nTrucy:\nWhat is it, Apollo?\nApollo:\nDid you spray that little desk over there?\nTrucy:\nI don't think so... The spray probably can't reach that far, you know?\nApollo:\nLet's check it out, just to be sure.\nSpray smaller frame\nLeads to:\n\"Eeeeeeeeeeeek! A reaction, Apollo!\"\nTrucy:\nEeeeeeeeeeeek! A reaction, Apollo!\nEma:\nAaaaaaugh! Where, where!?\nTrucy:\nThe inside of that cute little frame! Look!\nEma:\nWell, would you look at that. Nice going, Trucy.\nTrucy:\nI'm known to work magic!\nApollo:\n(Never mind that I was the one who found it.)\nTiny Frame added to the Court Record.\nApollo:\n(Why would the inside of that frame have poison on it? ...It looks like we found the only other place that was poisoned, in any case.)\nCoffee Mug (after Tiny Frame is added to the Court Record)\nTrucy:\nAre we going to test for poison again?\nApollo:\nWhy not? Just to be sure.\nEma:\nBut, you found your clue already. Isn't that enough? This stuff isn't cheap, you know?\nTrucy:\nI bet she doesn't have a lot of spending money.\nApollo:\n(I bet she spends it all on Snackoos.)\nRed Envelope\nApollo:\nEma, about this...\nEma:\nOh! Th-That! Y-Yes, why that's a bright red envelope.\nApollo:\n(She sure is jumpy...)\nTrucy:\nSomeone opened this, didn't they?\nEma:\n...... My lips are sealed.\nApollo:\nY-Your \"lips are sealed\"...? (That's a first!) You mean... you know what's inside the envelope?\nEma:\nSure. I read it, after all.\nTrucy:\nAh! You mean you were the one who ripped this open!?\nEma:\nHah! Please! I would have steamed it open.\nApollo:\n(But she did sneak a peek at it, apparently.)\nEma:\nKnow that I have a powerful weapon on my side.\nTrucy:\nWeapon...?\nEma:\nYes! The use of tools! Highly specialized tools for information gathering.\nApollo:\n(Tools I wouldn't mind getting my hands on...)\nTrucy:\nYou should try flattering her, Apollo... They say a little praise can open big doors.\nApollo:\n(Never heard that one, but it's good advice... Let's try talking to her some more.)\nRed Envelope (after clearing \"Forensic science\" Talk option)\nApollo:\nEma, about this...\nEma:\nOh! Th-That! Y-Yes, why that's a bright red envelope.\nApollo:\n(She sure is jumpy...)\nTrucy:\nSomeone opened this, didn't they?\nEma:\n...... My lips are sealed.\nApollo:\nY-Your \"lips are sealed\"...? (That's a first!) You mean... you know what's inside the envelope?\nEma:\nSure. I read it, after all.\nTrucy:\nAh! You mean you were the one who ripped this open!?\nEma:\nHah! Please! I would have steamed it open.\nApollo:\n(But she did sneak a peek at it, apparently.)\nEma:\nKnow that I have a powerful weapon on my side.\nTrucy:\nWeapon...?\nEma:\nYes! The use of tools! Highly specialized tools for information gathering.\nApollo:\n(Tools I wouldn't mind getting my hands on...)\nTrucy:\nYou should try flattering her, Apollo... They say a little praise can open big doors.\nApollo:\n(Never heard that one, but it's good advice... Let's try talking to her some more.) About that envelope we found... ...I was wondering if you could help us out with that \"tool\" you were mentioning?\nEma:\nEh heh heh, you want to know about my tool do you? It's called an X-Ray Analyzer.\nTrucy:\nX-Ray... like the x-rays you get at the dentist?\nEma:\nThat's right! At least, that's what I call it.\nTrucy:\nHuh?\nEma:\nIt has a real name, but it's much more complicated: the X-Ray Spectraliziation... ...something. How am I supposed to remember all that?\nTrucy:\nSo, basically, it lets you see inside things... like envelopes?\nEma:\nThat's right! You're sharp, Trucy. But it's a bit more complicated than that, in practice, of course. Actually, to tell the truth, I'm not really sure how it works, scientifically.\nTrucy:\nCan I try it out, Ema? Please!?\nEma:\nOh, I suppose. ...Of course, I've already checked out everything suspicious myself.\nTrucy:\nAlright! Let's give it a spin, Apollo!\nApollo:\nYeeeeargh! What are you doing!?\nTrucy:\nOh, just seeing if I could see through your hair... But it's like lead!\nApollo:\nPoint that thing at me any more, and it might all fall out.\nTrucy:\nThen I wouldn't need an x-ray machine to see through it!\nApollo:\n(Let's just get down to business, shall we?)\nEma:\nRight. Let's test it on a sample, first. It just so happens that I have a lottery ticket here. You set the sample in the device like so...\nApollo:\n...I don't see anything.\nEma:\nPatience. There's no need to get all antsy. Look at the right side of the screen. That's the \"layer view\" of the envelope.\nTrucy:\nLayer view...?\nEma:\nYou've got it set to display the outside of the envelope now, see? Actually, it's quicker to just have you give it a try. Turn that dial there with [right analog stick / arrow keys] for me, would you? (Changed from [Turn that dial there for me, would you?] in the original release) That's right. That's how you choose what \"depth\" you want to scan.\nTrucy:\nHey! I got something!\nEma:\nSee? That's how you can read the letters on the ticket inside. Cool, huh?\nApollo:\nExcept... I can't read them.\nEma:\nJust turn the dial a little more. What you have to understand is that a sheet of paper isn't really flat at all. When you zoom in that much, you see that paper is like a bunch of hills and valleys.\nTrucy:\nWow! Really?\nEma:\nThis x-ray device uses a beam with a wavelength of only 0.05 microns! It breaks cards down into thin layers, so it can only show what's written on that layer.\nApollo:\nI'm not entirely following you, but what good is it if you can't read anything?\nEma:\nThat's why we go on to step two! Try rubbing the image a bit, if you would.\nTrucy:\n\"Rubbing\"? Like going over the image with [left analog stick / WASD] while holding [A / Space]? (Changed from ['The image'? You mean rub the screen?] in the original release)\nRub entire area\nLeads to:\n\"There. That fixes the image on the screen.\"\nEma:\nThere. That fixes the image on the screen. Now, turn the dial again, just a little. Good. Now you can rub this image to \"fix\" it, too.\nTrucy:\nHey, I get it! We just keep doing this until we've got the whole thing!\nEma:\nExactly! Not bad!\nTrucy:\nNeat! Let's do some more!\nFully fix image\nLeads to:\n\"OK, let's print this one out.\"\nEma:\nOK, let's print this one out.\nIf \"BIG WINNER!\" ticket was printed\nTrucy:\nWoo hoo! I'm a big winner!!!\nEma:\nAh ha ha. See! This is the true hidden power of my weapon. Neat, huh?\nLeads to:\n\"Now let's try it out on the real thing, shall we?\"\nIf \"TRY AGAIN!\" ticket was printed\nTrucy:\n...Hmm. Does this mean I have to buy another one to win?\nApollo:\nWell, it's Ema's ticket. Let her buy another one.\nEma:\nIt's OK, there's no need. But see, this is the true hidden power of my weapon. Neat, huh?\nLeads to:\n\"Now let's try it out on the real thing, shall we?\"\nIf \"YOU LOSE!\" ticket was printed\nTrucy:\nOuch. \"You lose\".\nEma:\nAt least you know where you stand, eh? Anyway, now you see the true hidden power of my weapon. Neat, huh?\nLeads to:\n\"Now let's try it out on the real thing, shall we?\"\nEma:\nNow let's try it out on the real thing, shall we?\nFully fix image\nLeads to:\n\"OK, let's print this one out.\"\nEma:\nOK, let's print this one out.\nTrucy:\nSomeone deposited $100,000 into Mr. Misham's account? His paintings must be really valuable!\nEma:\nThere's another page in there. ...Care to take a look?\nTrucy:\nYou bet I do! If you're going to read someone's mail you might as well read it all!\nEma:\nHere goes with the second page, then.\nFully fix image\nLeads to:\n\"OK, let's print this one out.\"\nEma:\nOK, let's print this one out.\nTrucy:\n...So it was a letter about payment for one of his paintings.\nApollo:\nWhy all the secrecy, though? And...\nTrucy:\n...And what?\nApollo:\n...Why was this letter the only one in here? ...It's seven years old, right?\nTrucy:\nMaybe it had some special significance to him? Well, Ema?\nEma:\nWell indeed. ......\nApollo:\n(She knows something she's not telling us. ...Looks like she's keeping mum about it.)\nRed Envelope updated in the Court Record.\nRed Envelope (after Red Envelope is updated in the Court Record)\nTrucy:\nBut we just did the X-ray detection thing!\nApollo:\nOh, right. Sorry.\nAnything else\nApollo:\nEma, I was wondering if you could take a look at this...\nEma:\nLook, I'm a detective. A detective! You can't just ask me any old thing and expect an answer, OK? I think you need to be a little more focused in your inquiries. Scientific, even.\nApollo:\n(Somehow I knew she'd get around to science.)\nExamine evidence\nHidden Painting\nPeach\nTrucy:\nHey, Apollo. This painting, I know it!\nApollo:\nHuh? Really!?\nTrucy:\nIt's that story where the old woman is doing the wash in the river... ...and this giant peach comes a' floating on down.\nApollo:\n...That might possibly be the strangest thing I have ever heard.\nCoffee Mug\nLip mark\nTrucy:\nHey... look there! That stain doesn't look so healthy, Apollo! That must be the \"Blue Mountain\" stuff we've been hearing about!\nApollo:\nSomething tells me that even Blue Mountain Coffee isn't THIS blue. No, this stain is probably... (Hmm, better ask Ema.)\nLip mark (after Tiny Frame is added to the Court Record)\nTrucy:\nSee that, there? That's poison.\nApollo:\nYeah.\nTrucy:\nDon't lick it, Apollo!\nApollo:\nDon't worry, I'll be fine.\nTrucy:\nNo, you won't! You'll die!\nApollo:\nLook, I know! I meant I won't lick it!\nTrucy:\nWho knows what you do when I'm not watching...\nApollo:\n(...The concern is touching, really. Next thing you know she'll be telling me not to drink coffee before bedtime...)\nRed Envelope (before Red Envelope is updated in the Court Record)\nSeal\nTrucy:\nApollo, look! It's been opened once here.\nApollo:\n...You're right. I wonder if there's some way we can see what's inside?\nTrucy:\nShould I try to get it open and then stick it back shut?\nApollo:\nLet's not tamper with the evidence, shall we? I've got a better idea...\nTrucy:\n...Ema! Let's ask her!\nTiny Frame\nBack side\nApollo:\nHmm... Looks like you have to take this back part off first to put a photo inside.\nTrucy:\nIt'd have to be a really small photo to fit in there.\nApollo:\nTrue. And that pale bluish stain... Why would there be poison in a place like this?\nTrucy:\nWell, there's one obvious reason. Whoever put poison in the coffee rubbed a bit on here, too!\nApollo:\nThat's not very obvious, Trucy.\nAfter clearing \"The night of the crime\" Talk option, then adding Tiny Frame to the Court Record and updating Red Envelope in the Court Record\nApollo:\nSo, Ema, I was wondering... What's the story about this reporter that came here for a story the night of the crime?\nEma:\nAh! I'm afraid I can't tell you, because he's going to be a witness tomorrow, I hear.\nLeads to:\n\"I thought so.\"\nTrucy:\nI thought so.\nEma:\nI'll never forget that face, but what was his name...? Oh, right. Brushel.\nTrucy:\nBrushel...\nEma:\nHe's after a scoop to sell to the papers.\nApollo:\nSo a reporter comes for an interview with a painter. His first interview ever, and that night, he's killed. Seem strange to you?\nTrucy:\nReally strange.\nEma:\nIt does raise a few questions.\nApollo:\nI'd like to speak with this reporter if I could.\nEma:\nWell, I hear he's on the beat today, too. ...He said something about covering a magician.\nApollo:\nMagician...? (Well, if it's not Trucy, that leaves only one other person.)\nTrucy:\nIt wasn't Valant Gramarye, by any chance, was it?\nEma:\nYeah, something like that! He's got some big show lined up, I hear.\nApollo:\n(So, he's out interviewing Valant Gramarye... Looks like I'll be heading out to that coliseum again sooner than I thought.)\nEma:\nHere, I'll give you that reporter's card if you want.\nBrushel's Card added to the Court Record.\nExamine evidence\nBrushel's Card\nFront side\nTrucy:\nI guess you gotta have a good business card if you work freelance.\nApollo:\nReally. What's this... a camera lens finder?\nTrucy:\nDo reporters take photos too?\nApollo:\nI guess if he's freelance, he'd have to.\nTrucy:\nMaybe you should try being a prosecutor and a defense attorney! You'd always win!\nApollo:\nWhy don't I become a rock star too, while I'm at it?\nAfter clearing all Talk options in Detention Center - Visitor's Room, then visiting any other location:\nOctober 7Detention CenterVisitor's Room\nGuard:\nAh, you're here to see Vera Misham?\nApollo:\nYes, that's right!\nGuard:\nShe's in the medical office at the moment.\nTrucy:\nMedical office...? Is she OK?\nGuard:\nShe's just lying down. Said she didn't feel so good. I'm sorry but I can't allow any meetings at the moment.\nApollo:\nMost. Annoying. Client. Ever.\nTrucy:\nGuess we should come back.\nAfter clearing \"Valant Gramarye\" Talk option in Wright Anything Agency:\nOctober 7Sunshine Coliseum\nTrucy:\nWoo hoo! This is it, Apollo! The place where magic and dreams converge!\nApollo:\nJust a while ago it was the place where murder and nightmares converged.\nTrucy:\nLet's go say hi to Uncle Valant!\nApollo:\n(What about the case...?)\n???:\nWaaaah ha ha ha ha ha ha ha ha ha ha!\nTrucy:\nOnly a performer laughs like that...\nValant:\nThe young Miss Trucy! How often I hoped we'd meet again only to tell myself it was an impossible dream!\nTrucy:\nTee hee, Uncle Valant! How's it going? I'm glad to see you, too!\nValant:\nOf course you are.\nApollo:\n(Humility is definitely NOT one of his stronger traits...)\nValant:\nWell, Miss Trucy, how does the day find you? If you've come to give me flowers, do it after the show, I beg you.\nTrucy:\nActually, we came to wish you good luck! And congratulations on your big magic show!\nValant:\nOh? But it is I who wish to congratulate you! Not everyone is so lucky as to witness miracles such as I shall perform!\nApollo:\n(Yeah, yeah, you're amazing, we get the picture.)\nValant:\nThe world will watch in wonderment as Magnifi's illusions are reborn! Here, on stage! By my hand!\nExamine\nBlue Badger\nApollo:\n...Hey, that creature there. He was handing out balloons during our last case, too.\nTrucy:\nHe's not a \"creature\", Apollo! Poor guy.\nApollo:\nOh, sorry. Was I mean somehow?\nTrucy:\nYou know how hot it is inside one of those suits? He's stuck in there, with only the smell of his own sweat to keep him company. On the verge of passing out, he hands out each balloon as though it were his last!\nApollo:\nKind of takes the fun out of seeing the Blue Badger.\nColiseum building\nApollo:\nYou know, I thought this at the time of the Gavinners's concert, too, but... ...this coliseum is just way too big. It's huge.\nTrucy:\nIt's got a big-sounding name, too... \"Sunshine Coliseum\", was it?\nValant:\nAh ha ha ha ha ha! Would you like to hear what the grand finale of the show in three days will be?\nTrucy:\nWhat!? Really!? Yeah, yeah!\nValant:\nEh heh heh... The grand finale will be nothing other than...\nApollo:\nDon't tell me. You're going to make the coliseum disappear, right?\nValant:\n...Ah!\nApollo:\n(Oh. Oops. Looks like I was right.)\nValant:\n......\nTrucy:\nApollo! I can't believe you'd use your power of perception on something like this!\nApollo:\nIt was just a wild guess, really.\nHot air balloon\nTrucy:\nLook, Apollo! A balloon! A hot air balloon!!!\nApollo:\nWith the Gramarye seal on it, no less.\nValant:\nWell, this is a long-awaited revival, after all! And it's been seven years, you know. I've spent plenty of time and a pretty penny on promotion.\nTrucy:\nI hope it's a huge success, Uncle Valant!\nValant:\nOh, I intend for it to be nothing less, I assure you!\nApollo:\n(They both sure seem excited about it. I guess it's a big deal for magicians.)\nSignboard\nApollo:\nThey've changed the sign since our last case.\nTrucy:\nIt was all Gavinners back then, wasn't it?\nApollo:\nI hope nothing bizarre and mysterious happens this time.\nValant:\nBut it shall! Why, the show itself will be bizarre and mysterious, I assure you!\nApollo:\nI don't have a problem with mystery as long as it's legal.\nTrucy:\nI don't think lawyers and magicians were really meant to have conversations like this.\nTalk\nThe big magic show\nTrucy:\nEveryone's talking about the big magic show! Is it true that the \"Gramarye Miracle\" is back after a seven year absence?\nValant:\n...Miss Trucy. I must apologize. This show, and this honor, should have been his.\nTrucy:\nDaddy...\nValant:\nMy co-magician-in-training Zak Gramarye... If that terrible thing hadn't...\nTrucy:\n...It's OK.\nValant:\nYour father was a great magician, Trucy. If he were alive, then I, Valant Gramarye... ...would have been proud to stand upon this stage as his assistant!\nTrucy:\nThanks... Uncle Valant. You know, I'm happy you're doing the show! To think, we get to see the Great Magnifi's illusions again!\nApollo:\n(She really is looking forward to this, isn't she.)\nMagnifi Gramarye\nValant:\nMy mentor, the magnificent Magnifi Gramarye was a true deity among magicians. A creator-god who gave birth to magic and illusions that defied our very imaginations!\nTrucy:\nI was so little when I last saw one, but I still remember his shows! He did wheelies in a sports car through the air above the audience...! And then sped off to outer space, faster than the speed of sound!\nApollo:\n(I'm guessing that memory was a bit embellished.)\nValant:\nFor seven long years, the world has been waiting for a miracle to match his. As heir to the Gramarye Troupe's secrets, it falls to me to provide one. It is my god-given destiny!\nApollo:\nUm...\nValant:\nYes! You, nameless face who speaks for the nameless masses. How can I help you?\nApollo:\nIf the world was waiting, why did you hold off for seven long years?\nValant:\nHmm... It appears the lad is uninformed! Perhaps you have heard of the magic known as \"law\" which governs our land?\nApollo:\n...I have, though I'm not sure it qualifies as \"magic\".\nValant:\nThe performance of Magnifi's miracle was impossible. ...A certain \"law\" prevented it for seven years. But no more!\nApollo:\n(\"Seven years\"... That phrase sure likes to pop up, doesn't it...)\nTrucy:\n...And why was that?\nValant:\nA little matter called \"performance rights\", Miss Trucy.\nPerformance rights (appears after \"Magnifi Gramarye\")\nTrucy:\nCan you tell us about these \"performance rights\"?\nValant:\nMagnifi's magic relied on an incredibly innovative idea... a \"trick\", if you will. That trick... was considered his property, and as such, was protected by property laws.\nApollo:\nIntellectual property, maybe?\nValant:\nMagnifi knew this and bequeathed it in his will... ...to one person.\nApollo:\nYou mean... him!?\nValant:\nYes. Miss Trucy, it was your father. Zak Gramarye was the inheritor of the Gramarye Miracle!\nTrucy:\nDaddy...\nValant:\nYet, as you well know, he is gone. He disappeared suddenly, seven years ago.\nApollo:\n(I think I see where this story is going...) Once a person is classified missing for a certain period of time... ...they're considered legally deceased, correct?\nValant:\n...In all absoluteness. Those rolled-up sleeves conceal your competence well, young man! That \"certain period of time\" of which you speak... is seven years.\nTrucy:\nAh...\nValant:\nYes, Miss Trucy... Though it pains me to say it. This past spring... April to be precise, was the time. Your father was legally declared deceased. In the absence of a formal will... ...the secrets of our mighty mentor Magnifi passed to me. This was, in fact, stipulated in the will by Magnifi himself.\nTrucy:\nIs... that how it works, Apollo?\nApollo:\nYeah. It's called \"death in absentia\". He's declared missing... permanently.\nTrucy:\nDaddy...\nMr. Brushel, Journalist (appears after presenting Brushel's Card)\nValant:\nA man by that name called on me just now.\nApollo:\nJust now...\nValant:\nValant's vision is always toward tomorrow! Valant's feet step always forward! ...That is all.\nTrucy:\nThat's all... very confusing.\nValant:\nI am to perform a big magic show, yes? I wanted someone to cover it. Yet, he had ears only for that incident...\nApollo:\nThat incident?\nValant:\nIn any case, I requested that the rapacious reporter remove himself. So a painter has died, what of it!? It is but a footnote in the footlights compared to the magic of Gramarye!\nTrucy:\nUncle Valant! Do you know where the reporter went?\nValant:\n...I recommended he visit that place popular with penalized perpetrators.\nApollo:\n(The detention center...?)\nValant:\nHe was a rude individual. Might I see that card?\nApollo:\nUh, sure...\nValant:\n...He would tear apart my respectability? I will tear apart him!\nTrucy:\nOoh! Here it comes, Apollo! Uncle Valant's big magic trick!\nApollo:\nIs he going to fix the card? (Not sure that qualifies as \"big\" magic...)\nTrucy:\n......\nValant:\n......\nTrucy:\nWhat happened to the big magic...?\nValant:\nAh ha ha ha ha ha! Is it not more miraculous for it to stay ripped?\nApollo:\n(He must have really not liked that journalist...)\nMr. Brushel, Journalist (subsequent times)\nValant:\nA man by that name called on me just now.\nApollo:\nJust now...?\nValant:\nValant's vision is always toward tomorrow! Valant's feet step always forward! ...That is all.\nTrucy:\nThat's all... very confusing.\nValant:\nI am to perform a big magic show, yes? I wanted someone to cover it. Yet, he had ears only for that incident...\nApollo:\nThat incident?\nValant:\nIn any case, I requested that the rapacious reporter remove himself. So a painter has died, what of it!? It is but a footnote in the footlights compared to the magic of Gramarye!\nTrucy:\nUncle Valant! Do you know where the reporter went?\nValant:\n...I recommended he visit that place popular with penalized perpetrators.\nApollo:\n(The detention center...?)\nPresent\nGramarye Envelope\nApollo:\nUm, I was wondering if you could tell me about this?\nValant:\nAh ha! Why, that bears the Gramarye seal! ...... Hmm.\nTrucy:\n...Uncle Valant? Is something wrong?\nValant:\n...Trucy. Where... did you get this?\nTrucy:\nHuh? Um, Daddy gave it to me.\nValant:\nYour... Y-Y-Y-Your D-D-D-Daddy!? My partner, Zak Gramar--\nTrucy:\nNo, no, no. My other daddy, Phoenix Wright!\nValant:\nWhy now... Why would your Lord Daddy...!?\nApollo:\n(\"Lord Daddy\"? That's kind of stretching the whole archaic thing a bit...)\nValant:\nThis signature upon the back. Do you recognize it? That belongs to none other than Zak Gramarye!\nTrucy:\nWhaaaaaaaaat!? Daddy signed this!?\nValant:\nMight I be so bold as to open it?\nApollo:\n...I-I'm sorry, but I can't let you do that!\nValant:\nMmmmnk. Ah... Ah.\nApollo:\n(What's in this envelope, I wonder...?)\nGramarye Envelope (subsequent times)\nValant:\nThis signature... Why, it's none other than Zak Gramarye! Perhaps I might take a look inside?\nApollo:\nNo means no! Trucy's father didn't want us to open it yet.\nValant:\nHrmmmm... Ah... Ah. Your Lord Daddy... Why?\nApollo:\n(...What could be in this envelope...?)\nBrushel's Card\nApollo:\nSo, a journalist was here on a story?\nValant:\nAll eyes in the universe are upon my stage. All pens seek to commit its mysteries to paper!\nTrucy:\nUm, his name was Brushel.\nValant:\nBrushel... Brushel... Brushel... Brushel...\nTrucy:\n...I think he remembers him!\nApollo:\nHe doesn't look too happy about it.\nValant:\nBrushel... That cloying smell of mint when he smiles, yes...\nTrucy:\nUm, could you tell us more about him? What did he want?\nBrushel's Card (subsequent times)\nValant:\n...Put that away. I care not to see it ever again.\nApollo:\n(He really didn't like that guy, did he?)\nTrucy:\nLet's ask why, Apollo!\nAnything else\nValant:\nAh ha ha ha ha ha! A challenge, is it? You want me to make that disappear? Very well! Give it to me!\nApollo:\nAck! N-N-No thanks! (Are all magicians like this?)\nTrucy:\nApollo? What was that look just now?\nApollo:\nI was just thinking how hard it is to get any information out of a magician.\nAfter clearing all Talk options and presenting Gramarye Envelope:\nValant:\nNow, the time has come when I must return to make my prestidigitation preparations! By your leave, Miss Trucy.\nTrucy:\nThanks, Uncle Valant!\nValant:\nThree days from now... make ready for a miracle!\nApollo:\nWhat do you think that journalist was after? And why did Valant react like that to this envelope?\nTrucy:\nI think it's time to pay the detention center another visit.\nExamine\nColiseum building\nApollo:\nWorkers are busily preparing the coliseum for the magic show three days from now. Maybe we should go check it out... once this case is solved.\nHot air balloon\nApollo:\nA hot air balloon. You hardly see those anymore these days. It kind of reminds me of when I was a kid. Maybe Valant's playing the nostalgia card to drum up interest in the show.\nSignboard\nApollo:\nThat was a Gavinners sign last time, wasn't it? I hope nothing strange happens this time around...\nOctober 7Detention CenterVisitor's Room\n???:\n...I think I hear what you're saying. \"We're All Doing It For The Money\", end quote.\nGuard:\nNo no no no! Not at all!\nApollo:\n...Looks like someone's already meeting here.\nTrucy:\nMaybe that reporter?\n???:\nHey there! How ya doing? Who might you be?\nApollo:\nAh, sorry, we didn't know someone was already here. I'm Apollo Justice, attorney at law. (Talk about a nervous monkey.)\n???:\nYou? You're Justice!? You?\nApollo:\nYou... know me?\n???:\nDo I know you? Of course I know you! \"Stares Down Witnesses On Stand Till They Spill Beans\", end quote.\nApollo:\nTh-That's not true! (What's he writing...?)\nTrucy:\nAre you a reporter by any chance?\n???:\nWoo! You! You're Trucy!\nTrucy:\nEh? Am I famous?\n???:\nOh yeah. Oh yeah! \"Trucy Wright Hates Carrying A Bag: Puts Everything She Owns In Her Panties\", end quote.\nTrucy:\nEeeeeeeeeeek! That's so not true!\n???:\nJust hold on to your breeches, there. I'll wrap up this interview in a jiffy.\nTrucy:\nInterview...?\n???:\nSo, guard. I think I know what's going on here. \"Guarding Rooms Is My Life. What Else Could I Possibly Need?\" end quote.\nGuard:\nNo! How many times do I have to tell you this? Look, I've got work to do. You deal with him.\nTrucy:\nUm... did you come here to interview the guard?\n???:\nOoh wee, what a pickle! \"Accused Wouldn't Talk, Had To Interview Someone Or Go Plum Crazy\", end quote.\nTrucy:\nHuh...\nApollo:\n...I should've guessed.\n???:\nWhere're my manners!?\nBrushel:\nName's Brushel. Spark Brushel. \"I'm Not Picky -- Journalist Just Closes Eyes, Writes\", end quote.\nApollo:\n(What's that nauseatingly strong mint smell every time he grins?)\nBrushel:\nUntil you've been interviewed by me, you don't know what thrilling is! \"Wild Romp Through Crossroads Of Mayhem, Madness\", end quote.\nApollo:\n...I can see that. (He's writing something again! Well, if he's a reporter, maybe he knows something...)\nTalk\nSpark Brushel\nTrucy:\nSo, Mr. Brushel... You're a journalist?\nBrushel:\nAh me? Look, let me state one thing for the record here...\nTrucy:\n...Y-Yes?\nBrushel:\nI'm the interviewer. You understand, yeah? \"I'm The One Asking The Questions Here\", end quote.\nTrucy:\nOK...\nBrushel:\n...For instance! You think a movie director watches movies?\nTrucy:\n...Well, I think he probably does.\nBrushel:\nExactly! I knew you'd understand.\nApollo:\n(...Huh?)\nThe night of the crime\nTrucy:\nSo, the night of the murder... ...you were at Drew Studio?\nBrushel:\nWho? Me? Look, let me state one thing for the record...\nTrucy:\n...Y-Yes?\nBrushel:\nI may look calm and collected, but I'm busy. Real busy. Always on the road. \"Journalist Always Buys One-Way Tickets, Never Looks Back\", end quote.\nTrucy:\nI can understand that philosophy, but...\nBrushel:\nYou want to know the thing about one-way tickets? Once you use them, they're gone. ...All because you have to give them to the guy at the airport.\nTrucy:\nTrue enough. But don't they give normal tickets away, too?\nBrushel:\nExactly! See? It's the same thing!\nTrucy:\n...What is?\nApollo:\n(*sigh*)\nThe interview\nTrucy:\nSo, you went to do a story on Drew Misham... ...and he'd never had a story done about him before?\nBrushel:\nThat's right! Look, let me state one thing for the record here...\nTrucy:\nWh-What...?\nBrushel:\nI'm sure you're going to want to know about my source. What tipped me off to Drew? Why do the interview in the first place?\nTrucy:\nWell... yes.\nBrushel:\nLook, it's like... Oh! I've got it! Say there's this burger joint with fabulous ketchup. You think the burger guy's going to tell me where he got it?\nTrucy:\n...At the supermarket, maybe?\nBrushel:\nExactly! See? That's what I'm talking about.\nApollo:\n(I think I may have actually understood that one.)\nPresent\nAnything\nBrushel:\nAh, right. Let me go on the record here.\nTrucy:\nY-Yes?\nBrushel:\nI know what you're going to say. \"Brushel! Take This, Write Brilliant Column!\" end quote.\nApollo:\nI don't think so!\nBrushel:\nLook, buddy, I write brilliant columns about one thing: ...and that's food. Try to understand.\nApollo:\n(What could he possibly be writing? He didn't listen to a word I said!)\nAfter clearing all Talk options:\nBrushel:\nWell, there's nothing I can talk about really. \"Walls Have Ears, Eyes -- Especially Glass Walls With Speakers\", end quote.\nApollo:\nRight. Guess we'll leave then.\nBrushel:\nAh, but since you're here... ...might as well tell you a tidbit of news I saw. Just for the heck of it.\nTrucy:\nSure, tell us! ...Just for the heck of it.\nBrushel:\nI remember it like it was yesterday... ...I'd seen a movie on a trip, and wandered into this burger place with amazing ketchup... ...when an article in a tabloid caught my eye. \"Famous Oil Painting Stolen From Art Dealer's Gallery\", end quote, I believe it was.\nApollo:\nAn oil painting...?\nBrushel:\nHappens every day, right? But, I thought I'd seen that painting somewhere before. ...A painting of a giant peach floating down a river.\nApollo:\n(Someone stole an oil painting... of a giant peach.)\nBrushel:\n\"Journalist Can Smell Scoop Better Than Burgers\", end quote.\nOctober 7Drew Studio\nEma:\nWell, how'd it go? Find anything out?\nApollo:\nActually, there was one thing I wanted to check with you.\nEma:\nWh-What's with that scary face you're making?\nApollo:\n(And what's with the \"I know something but I'm not telling\" face you've got going, Ema?)\nTalk\nForger (appears after presenting Hidden Painting)\nTrucy:\nSo, what exactly is a \"forger\"?\nEma:\nWell, basically, it's someone who makes \"forgeries\". Fakes, in other words.\nTrucy:\nFakes...?\nEma:\nCopies of an original. Exact copies, so precise, you can't tell them apart.\nTrucy:\nWell, why not just photocopy them?\nEma:\nThe big problem with forgeries... ...is that people try to sell them as the real article. It's a crime, of course.\nTrucy:\nSo, Drew Misham was...?\nEma:\nA criminal? I'm afraid so. He received money to create elaborate forgeries. ...To supplement his work in illustration, I guess.\nApollo:\nI see.\nEma:\nActually... ...that's why I brought this here in the first place.\nApollo:\nWhat do you mean?\nEma:\nWhen you're trying to determine if a painting is a forgery... ...the rough sketch underneath can be a valuable clue.\nTrucy:\nSo the rough sketch is like practice for the real thing! Like doing a magic trick in front of a mirror before you go on stage!\nEma:\n...But not in the case of a forgery. Not necessarily, anyway. You know what the finished product is going to look like, after all.\nTrucy:\nOh, yeah. I guess you would.\nEma:\nThat's why I brought this. I'm going to use it to see what's under the paint of the finished pieces.\nApollo:\n(I get it now...)\nEma:\nNot that I really needed to go to such lengths. Seeing as how one of the paintings was only half-finished anyway.\nTrucy:\n...Still, it'd be neat to see Mr. Misham's rough sketches. Kind of like what he was drawing when he thought no one was looking.\nApollo:\n(True... That would be interesting. And maybe valuable for our case.)\nTrucy:\nYou should try buttering her up, Apollo! Flattery will get you everywhere, they say!\nApollo:\n(...Hmm, maybe I should ask Ema to help us out.)\nPresent\nHidden Painting\nApollo:\nThis painting... came from behind that dresser.\nEma:\nAh, yes. So?\nApollo:\n...It was stolen, no?\nEma:\n...... I was hoping you wouldn't figure that out.\nApollo:\nDo you think you could tell us a bit about this?\nEma:\n...I suppose. It's what you think. Drew Misham... was a forger.\nTrucy:\nA forger...?\nHidden Painting (subsequent times)\nApollo:\nEma... about this painting from behind the dresser there.\nEma:\n...Ah, yes. It's what you think. Drew Misham... was a forger.\nTrucy:\nA forger...?\nPortrait, Acrylic, or Landscape (after clearing \"Forger\" Talk option)\nLeads to:\n\"Um, I kind of wanted to see the rough sketch under this painting.\"\nApollo:\nUm, I kind of wanted to see the rough sketch under this painting. And I was wondering if your \"tool\" there might do the trick?\nEma:\nOh, fine. Fine! Just this time, though.\nTrucy:\nLet's check it out!\nFully fix any painting\nLeads to:\n\"OK, let's print this one out.\"\nEma:\nOK, let's print this one out.\nApollo:\nWhat... What the heck?\nTrucy:\nWow, he really blows! The finished painting isn't anything like the rough!\nEma:\nDevices like mine didn't exist until recently. He probably thought he could draw any sort of thing he wanted to for the rough.\nTrucy:\nWhat do you mean?\nEma:\nWell, in the past, you could only analyze the composition of a rough sketch.\nTrucy:\nComposition?\nEma:\nIn other words, the traces of charcoal between paint and canvas. So you could tell if there had been a rough sketch... ...but not what it looked like.\nApollo:\nAh, I think I follow you. So, in essence, it wouldn't matter what was underneath the finished painting.\nEma:\nSome pros would actually paint out a rough sketch entirely. Then do a completely new painting on top of that.\nTrucy:\nSo Mr. Misham was drawing whatever he wanted before painting over them...?\nEma:\nPossibly. Is there a problem with that?\nApollo:\n(Not particularly... But something about the sketch itself is kind of... odd.)\nTrucy:\nYou're awfully silent all of a sudden, Apollo.\nApollo:\nYou think we could check out one of the other paintings!?\nEma:\nWell, sure. You like this detection stuff, don't you?\nFully fix either remaining painting\nLeads to:\n\"OK, let's print this one out.\"\nEma:\nOK, let's print this one out.\nApollo:\nThis one, too!\nTrucy:\nWhat's wrong, Apollo? You look so serious all of a sudden!\nApollo:\nUm, you think I could just look at the last of these?\nEma:\nFine by me. Knock yourself out.\nFully fix final painting\nLeads to:\n\"OK, let's print this one out.\"\nEma:\nOK, let's print this one out.\nApollo:\nWh-Wh... What the heck is all this!?\nEma:\n...I hesitate to ask why you're getting so excited.\nTrucy:\nYou sure your device isn't leaking some kind of strange radiation?\nApollo:\nTrucy! Look at these three sketches! ...Do you notice anything?\nTrucy:\nAaaaaaaaaaaaaaaaaaaaaaaaaaah! Th-Th-They're...!!\nEma:\nNow you're both white as sheets! What's going on!?\nApollo:\nThese sketches... are of the three cases I worked on!\nEma:\nWhat...?\nApollo:\nThe murder in the poker room at the Borscht Bowl Club! The dead man pulling the noodle stand! And then... ...the events that transpired during the Gavinners concert!\nEma:\n...What could it mean? How could he have painted those things... and why!?\nApollo:\nThat's what I want to know!\nEma:\nWait! Is Drew Misham... ...your father?\nApollo:\nGive me a break! Does that seem even REMOTELY possible to you!?\nApollo:\n(I'd never even heard of any Drew Misham before. I hadn't even seen a picture of him. But there were my cases, drawn on his canvas! ...Every single one of them. It couldn't have been a coincidence. Just who was this Drew Misham... and what did he have to do with me?)\nTo be continued.\nNothing to examine during investigation\nApollo:\nNo clues here.\nTurnabout Succession\nTranscript\nPart 1\nPart 2\nPart 3\nPart 4\nPart 5\nOctober 8, 9:48 AMDistrict CourtDefendant Lobby No. 6\nExamine evidence\nLandscape\nRough sketch\nTrucy:\nThis rough sketch is only half-hidden by the oil painting.\nApollo:\nI'll never understand artists.\nTrucy:\nStill, it's impressive. I wouldn't think you could hide such a dark sketch under a little paint.\nApollo:\nWell, it is called \"oil paint\" for a reason. I bet it's pretty oily. The paint I mean.\nTrucy:\nI'm still waiting for you to get to your point.\nApollo:\nGood morning!\nVera:\n......\nTrucy:\nSo! You're... Vera, right? I'm Trucy! Trucy Wright! That's \"Wright\" with a \"W\"! Uh, but not \"write\", right?\nVera:\n......\nTrucy:\nUm! We're... on your side! You can tell us anything! ...Please?\nVera:\n...... ...Good morning...\nApollo:\n...! (She... She speaks!)\nTrucy:\nHmm, not bad, not bad. But I think you'd do better with a little smile, you know? You're so pretty! You need to sell yourself, you know?\nApollo:\nTrucy! Let's... take it easy for starters.\nVera:\n...... ...Thank you for taking my case...\nTrucy:\n...!\nApollo:\n(Okaaaaay... Well, that's a start, I guess.)\nVera:\n......\nApollo:\n(There she goes with the nail polish again...)\nTrucy:\nThat's great, really! It's so cultured!\nVera:\n............ ...Want to try...?\nTrucy:\nOooooh! Really!?\nApollo:\n*sigh* Girls... (The victim, Drew Misham, was a forger. And a stolen painting was found in his studio. A life of crime, really... ...And maybe one that led to his death.)\nOctober 8, 10:00 AMDistrict CourtCourtroom No. 3\nJudge:\nWell, we will now... er... *cough* Begin the, er, trial of... Vuh... Vuh... Vuh... Vera Misham!\nTrucy:\n...Is the judge OK? His voice is all raspy, and he's looking around all nervous-like.\nJudge:\nErm... ahem. The repercussions of today's trial will, most likely, be felt for a long time. ...And may, indeed, alter our legal system forever.\nKlavier:\nToday is a test of the Jurist System... ...and the first step toward a new order in our courts.\nTrucy:\nDaddy's secret mission!\nKlavier:\nThe jurists will function like a jury. It is hoped their inclusion will help the courts to better reflect the people's will.\nApollo:\nWhy... aren't there any jurists in the courtroom?\nKlavier:\nThree closed-circuit cameras watch this courtroom at all times. The jurists have access to everything that transpires. Jurists! Judge well, and judge cool.\nJudge:\nN-Now see here, Prosecutor Gavin! I-I was going to say that!\nKlavier:\nAh, my apologies, Herr Judge.\nJudge:\nAhem. Jurists! Today, er... Judge today's trial \"coolly\", if you would be so kind!\nApollo:\n(The jurists are unbound by the letter of the law. They don't affect the trial with evidence... but by their \"feelings\". And we're about to find out just what effect they're going to have.)\nJudge:\nVery well, Prosecutor Gavin. The details of the case, if you would.\nKlavier:\nThe victim is the painter Drew Misham. He was killed in his own studio. His coffee... was poisoned. By whom, you ask? By none other than the defendant, Vera Misham.\nApollo:\nApollo:\nThere wasn't any poison in the coffee!\nKlavier:\nAchtung... Someone has been doing their homework! Indeed. Poison was not present in the coffee... but on the mug itself.\nJudge:\nThe mug...? Ah, residue was found on the rim, I see.\nKlavier:\nThe autopsy report describes the manner of our victim's death.\nJudge:\nThe court accepts this as evidence.\nMisham's Autopsy Report added to the Court Record.\nJudge:\nAccording to this report... ...the victim's death was caused by \"atroquinine\" poisoning.\nKlavier:\nA chemical compound that does not occur naturally. Lethal dosage is a mere 0.002mg. A touch of atroquinine in the body... ...is the touch of the Reaper's scythe.\nJudge:\nVery well, Prosecutor Gavin. You may present your witness.\nKlavier:\nI have for you today a simple man, for a simple case. ...A man who witnessed the murder in its entirety.\nApollo:\n(That journalist, no doubt...)\nKlavier:\nThe witness will state his name and occupation.\nBrushel:\nAh! Right! Well, for starters, my name's Spark Brushel! My job is... a lone observer of the world!\nApollo:\nIn other words, a freelance journalist, right?\nBrushel:\nAhem! If you don't mind, I'd like to state something here for the record.\nJudge:\nYes, Mr. Brushel?\nBrushel:\nI dislike conclusions, specifically, the jumping to aspect of conclusions. \"Preconceptions Make Park Sandbox of Endless Desert Waste...\" end quote.\nApollo:\nBut, you are a journalist. You said so yourself yesterday.\nBrushel:\n...Well, that's true, yes. But you must understand, I stand before you today a man with a dream! I'm offering you my testimony in exchange for exclusive rights to the story! \"Scoop Turns Mr. Brushel Into THAT Mr. Brushel!\" end quote.\nJudge:\n...Let's hear your testimony then, shall we?\nApollo:\n(A \"simple case\", eh, Gavin? For me, the jury... is still out.)\nWitness Testimony\n-- The Journalist's Story --\nBrushel:\nI visited the studio around 9:00 that night to do the interview.\nThe first outsider to enter the atelier! \"Journalistic History Made\", end quote!\nHis daughter brought us coffee right after we started.\nAnd you know what happened next. \"Star Falls!\" end quote.\nNo one else entered the room besides her the whole time.\nJudge:\nHmm... That does sound like a simple case. Unless... you were the one who poisoned him!\nBrushel:\nWh-Wh-Wh-Whatareyousaying!? Judge!\nJudge:\nAhem. Need I remind you, the cameras are rolling today. I felt the need to be a bit dramatic.\nKlavier:\nYou didn't do it, did you?\nBrushel:\nM-M-M-M-Medoathinglikethat!? Come on! That's like... \"Newsmaker Making the News\", end quote. Or even \"Contemporary Witch-Hunt\", end quote! I know! \"Wild Accusations Rock Courtroom\", end quote.\nKlavier:\nAh ha ha ha. Rock, indeed.\nTrucy:\nProsecutor Gavin sure looks like he's having fun.\nApollo:\nI'm so happy for him.\nJudge:\nVery well, Mr. Justice, your cross-examination, please.\nCross Examination\n-- The Journalist's Story --\nBrushel:\nI visited the studio around 9:00 that night to do the interview.\nPress\nApollo:\nApollo:\n9:00 at night? Isn't that a little late for an interview?\nBrushel:\nIf the great painter Drew Misham says, \"come at 9:00\"... ...believe you me, I go at 9:00! The first, and as it turned out, last interview with such a prolific painter!\nApollo:\nRight. Can you tell us what it was like when you arrived?\nBrushel:\nThe first outsider to enter the atelier! \"Journalistic History Made\", end quote!\nPress\nApollo:\nApollo:\nYou were the first reporter ever in \"Drew Studio\"?\nBrushel:\nPosterity will look back on that night as a turning point in journalistic history! \"A Basically Insignificant Step For All Mankind... But A Giant Step For That Brushel Guy\", end quote.\nKlavier:\nIf no one on the outside ever had access to the studio... ...then it would serve to reason that the deed was done by an \"insider\".\nApollo:\n(...By which he means Vera did it.)\nKlavier:\nSo, how did this epoch-making interview go?\nBrushel:\nHis daughter brought us coffee right after we started.\nPress\nApollo:\nApollo:\n...Would you mind being a little more specific?\nBrushel:\nOooh wee, let me tell you, I enjoy a cuppa. In fact, it all began when I was in third grade, no wait, fourth grade--\nApollo:\nThat's not what I meant!\nKlavier:\nI believe I know what Herr Forehead is driving at. This coffee the victim was served... Did anyone other than the victim touch it?\nApollo:\nR-Right! That! (That's what I was going to say, really.)\nBrushel:\nWell, now, if you've got a question to ask, you'd best straight up ask it! That's what I tell all the new recruits. Several times, if necessary. \"Write for a grade schooler\", that's my motto. Which isn't to say I can only write grade school-level stuff, mind you--\nApollo:\n...Who touched the coffee!?\nBrushel:\nDunno. I was in the back, looking at the studio's equipment when she served it.\nApollo:\n......\nKlavier:\n...And what happened next?\nBrushel:\nAnd you know what happened next. \"Star Falls!\" end quote.\nPress\nApollo:\nApollo:\nWhat's this about a star falling?\nTrucy:\n\"Star Falls!\" huh... It's like an old telegram! \"Send Money, Over\".\nBrushel:\nZowie! You don't know? That's like a journalism code word. An important personage passes away... a star falls. Get it?\nTrucy:\nBut there's no gravity in space, is there? I wouldn't think stars could fall, really.\nApollo:\n...Does this matter?\nBrushel:\nHoo boy! This is good stuff, good stuff! How about \"Star Breaks\"... Nah... lacks punch. I know, I know! \"Star Dies\". Nah... lacks imagination. Of course, you could go with \"Drew Dies\". Straight, to the point. I like it.\nApollo:\n(I think we need to hear about something a little more substantial...)\nThe moment of death\nApollo:\nUm, about when Mr. Misham passed away...\nBrushel:\nHoo boy, what a scene that was! He puts his coffee mug down with a crash, right?\nJudge:\nHmm... Yes, and then?\nBrushel:\nThen the cold finger of Death touches his spine! Life's flame sputters and fails! So cold was that touch, he could do naught but tremble uncontrollably! ...Actually \"life's flame\" is a little tired. \"Life's river froze over\"... Yes! That's a go.\nTrucy:\n...I think he's starting his article already.\nApollo:\nCould you describe that a little more simply?\nBrushel:\nWell, as you can imagine, I was pretty surprised. He hit the floor, as they say. \"Artist's Seizure Is Final Performance\", end quote.\nKlavier:\nAtroquinine paralyzes the central nervous system. The body arches back like a bow, the limbs tremble, the throat burns--\nJudge:\nTh-That's quite enough of that! Some of us want to be able to sleep tonight.\nBrushel:\nOh yeah? Well I want details, lots of juicy details!\nKlavier:\nFor that you can listen to our last year's hit single. \"Atroquinine, My Love\", by the Gavinners. Available at all major music outlets.\nJudge:\nThe point here is that the victim died of atroquinine poisoning. Well, Mr. Justice? How did you find that testimony?\nVery important\nApollo:\nWell, as an account of the moment of the victim's death, I'd say it's very important. ...Please add it to the testimony.\nJudge:\nVery well. The court requests the witness add this account to his testimony.\nChanges statement from \"And you know what happened next. \"Star Falls!\" end quote.\" to \"Those spasms... That was definitely death by poison.\"\nNot important\nApollo:\n(You'd think the moment of Mr. Misham's death would be important... ...But Mr. Brushel's story really didn't tell us anything we didn't already know.)\nJudge:\nVery well, please continue with the testimony.\nLeads back to cross-examination\nBrushel's coffee\nApollo:\nSo, you drank the coffee that Vera served you, too?\nBrushel:\nCourse. \"When someone serves you coffee, you drink it\"... That's what my old boss always used to say. Never did get what he meant by it, though.\nApollo:\nBut you're still alive, which is to say, you didn't die.\nBrushel:\nOf course not! \"No Point Falling Before You're A Star\", end quote.\nApollo:\n...That's not exactly what I was getting at.\nKlavier:\nWhat were you getting at, then? You know the poison was on the rim, not in the coffee.\nBrushel:\nOh yes, yes! There were two cups on the tray she brought. And one of the cups had Drew's signature painted on the side.\nApollo:\n(Hmm. No chance the guest would take that one by mistake, I guess.)\nJudge:\nWell, Mr. Justice? Was that testimony important?\nVery important\nApollo:\nWe're talking about the coffee the witness drank. I'd say that is important!\nJudge:\nVery well, please add that to your testimony, Mr. Brushel.\nChanges statement from \"And you know what happened next. \"Star Falls!\" end quote.\" to \"I drank the coffee, too, but I'm not dead yet!\"\nNot important\nApollo:\n(So Brushel drank the coffee, too... Doesn't look like this is going to lead to much...)\nJudge:\nVery well, please continue with the testimony.\nLeads back to cross-examination\nThe \"star's\" coffee\nApollo:\nYou say Mr. Misham had the coffee, too. But did you actually see him \"drink\" the coffee?\nBrushel:\nCourse! \"He Who Sees It Wins, But He Who Says It Wins Bigger\", end quote. I live in a man-sees-dog-eat-dog-and-writes-about-it world. Yet...\nApollo:\n\"Yet\"?\nBrushel:\nI guess I can't say I \"saw\" him drink it, really. He had one so-called \"sip\", if that. \"Man Puts Lips To Mug, Drinks?\" end quote.\nJudge:\nHmm. That poison is quite virulent, I hear.\nBrushel:\nMy stomach did a so-called \"somersault\". Since I'd gulped down that coffee without so much as a second glance at it. Wait, maybe something's there! Some kind of so-called \"trick\"! Anyone want to venture a guess? For the record?\nApollo:\n(Does this guy have a pause button?)\nJudge:\nWell, Mr. Justice? Did you find that testimony valuable?\nVery important\nApollo:\nThe victim drank his coffee, then immediately fell over?\nBrushel:\nOh yes, yes. You can go to press with that one.\nApollo:\nYour Honor! This is a vital piece of information! Please add it to the testimony.\nJudge:\nVery well. The witness will add this to his testimony.\nBrushel:\nVital! Right!\nChanges statement from \"And you know what happened next. \"Star Falls!\" end quote.\" to \"He had one sip, if that. The next moment, he was on the floor!\"\nNot important\nApollo:\n(The coffee Mr. Misham drank... That has to be important somehow... ...Nah.)\nJudge:\nVery well, please continue with the testimony.\nLeads back to cross-examination\nBrushel:\nThose spasms... That was definitely death by poison.\nPress\nApollo:\nApollo:\nYou say it was \"definitely death by poison\"... How can you be so sure?\nBrushel:\nHey, look, I'm a journalist. I've seen a lot of things. And I've had more than my share of experiences with so-called \"poisonings\". \"Man Eats Fishy Fish, Goes Bye-Bye\"... end quote.\nApollo:\n(Food poisoning doesn't count. Hmm. Should I get him to talk about something else?)\nNo need\nApollo:\n(Let's just go with what we have for now.)\nLeads back to cross-examination\nBrushel's coffee\nApollo:\nSo, you drank the coffee that Vera served you, too?\nBrushel:\nCourse. \"When someone serves you coffee, you drink it\"... That's what my old boss always used to say. Never did get what he meant by it, though.\nApollo:\nBut you're still alive, which is to say, you didn't die.\nBrushel:\nOf course not! \"No Point Falling Before You're A Star\", end quote.\nApollo:\n...That's not exactly what I was getting at.\nKlavier:\nWhat were you getting at, then? You know the poison was on the rim, not in the coffee.\nBrushel:\nOh yes, yes! There were two cups on the tray she brought. And one of the cups had Drew's signature painted on the side.\nApollo:\n(Hmm. No chance the guest would take that one by mistake, I guess.)\nJudge:\nWell, Mr. Justice? Was that testimony important?\nVery important\nApollo:\nWe're talking about the coffee the witness drank. I'd say that is important!\nJudge:\nVery well, please add that to your testimony, Mr. Brushel.\nChanges statement from \"Those spasms... That was definitely death by poison.\" to \"I drank the coffee, too, but I'm not dead yet!\"\nNot important\nApollo:\n(So Brushel drank the coffee, too... Doesn't look like this is going to lead to much...)\nJudge:\nVery well, please continue with the testimony.\nLeads back to cross-examination\nThe \"star's\" coffee\nApollo:\nYou say Mr. Misham had the coffee, too. But did you actually see him \"drink\" the coffee?\nBrushel:\nCourse! \"He Who Sees It Wins, But He Who Says It Wins Bigger\", end quote. I live in a man-sees-dog-eat-dog-and-writes-about-it world. Yet...\nApollo:\n\"Yet\"?\nBrushel:\nI guess I can't say I \"saw\" him drink it, really. He had one so-called \"sip\", if that. \"Man Puts Lips To mug, Drinks?\" end quote.\nJudge:\nHmm. That poison is quite virulent, I hear.\nBrushel:\nMy stomach did a so-called \"somersault\". Since I'd gulped down that coffee without so much as a second glance at it. Wait, maybe something's there! Some kind of so-called \"trick\"! Anyone want to venture a guess? For the record?\nApollo:\n(Does this guy have a pause button?)\nJudge:\nWell, Mr. Justice? Did you find that testimony valuable?\nVery important\nApollo:\nThe victim drank his coffee, then immediately fell over?\nBrushel:\nOh yes, yes. You can go to press with that one.\nApollo:\nYour Honor! This is a vital piece of information! Please add it to the testimony.\nJudge:\nVery well. The witness will add this to his testimony.\nBrushel:\nVital! Right!\nChanges statement from \"Those spasms... That was definitely death by poison.\" to \"He had one sip, if that. The next moment, he was on the floor!\"\nNot important\nApollo:\n(The coffee Mr. Misham drank... That has to be important somehow... ...Nah.)\nJudge:\nVery well, please continue with the testimony.\nLeads back to cross-examination\nBrushel:\nI drank the coffee, too, but I'm not dead yet!\nPress\nApollo:\nApollo:\nYou're sure you drank the coffee?\nBrushel:\nOh yes, yes, quite. I gulped it down, felt that sweet scorch in my throat!\nApollo:\nBut you say the victim took one sip and fell over. ...And you still kept drinking?\nBrushel:\nCourse! \"Drink your coffee when it's hot, never when it's not\". That's what my old boss used to always say. Never really knew what he meant by it.\nApollo:\n(Hmm. Should I get him to talk about something else?)\nNo need\nApollo:\n(Let's just go with what we have for now.)\nLeads back to cross-examination\nThe moment of death\nApollo:\nUm, about when Mr. Misham passed away...\nBrushel:\nHoo boy, what a scene that was! He puts his coffee mug down with a crash, right?\nJudge:\nHmm... Yes, and then?\nBrushel:\nThen the cold finger of Death touches his spine! Life's flame sputters and fails! So cold was that touch, he could do naught but tremble uncontrollably! ...Actually \"life's flame\" is a little tired. \"Life's river froze over\"... Yes! That's a go.\nTrucy:\n...I think he's starting his article already.\nApollo:\nCould you describe that a little more simply?\nBrushel:\nWell, as you can imagine, I was pretty surprised. He hit the floor, as they say. \"Artist's Seizure Is Final Performance\", end quote.\nKlavier:\nAtroquinine paralyzes the central nervous system. The body arches back like a bow, the limbs tremble, the throat burns--\nJudge:\nTh-That's quite enough of that! Some of us want to be able to sleep tonight.\nBrushel:\nOh yeah? Well I want details, lots of juicy details!\nKlavier:\nFor that you can listen to our last year's hit single. \"Atroquinine, My Love\", by the Gavinners. Available at all major music outlets.\nJudge:\nThe point here is that the victim died of atroquinine poisoning. Well, Mr. Justice? How did you find that testimony?\nVery important\nApollo:\nWell, as an account of the moment of the victim's death, I'd say it's very important. ...Please add it to the testimony.\nJudge:\nVery well. The court requests the witness add this account to his testimony.\nChanges statement from \"I drank the coffee, too, but I'm not dead yet!\" to \"Those spasms... That was definitely death by poison.\"\nNot important\nApollo:\n(You'd think the moment of Mr. Misham's death would be important... ...But Mr. Brushel's story really didn't tell us anything we didn't already know.)\nJudge:\nVery well, please continue with the testimony.\nLeads back to cross-examination\nThe \"star's\" coffee\nApollo:\nYou say Mr. Misham had the coffee, too. But did you actually see him \"drink\" the coffee?\nBrushel:\nCourse! \"He Who Sees It Wins, But He Who Says It Wins Bigger\", end quote. I live in a man-sees-dog-eat-dog-and-writes-about-it world. Yet...\nApollo:\n\"Yet\"?\nBrushel:\nI guess I can't say I \"saw\" him drink it, really. He had one so-called \"sip\", if that. \"Man Puts Lips To mug, Drinks?\" end quote.\nJudge:\nHmm. That poison is quite virulent, I hear.\nBrushel:\nMy stomach did a so-called \"somersault\". Since I'd gulped down that coffee without so much as a second glance at it. Wait, maybe something's there! Some kind of so-called \"trick\"! Anyone want to venture a guess? For the record?\nApollo:\n(Does this guy have a pause button?)\nJudge:\nWell, Mr. Justice? Did you find that testimony valuable?\nVery important\nApollo:\nThe victim drank his coffee, then immediately fell over?\nBrushel:\nOh yes, yes. You can go to press with that one.\nApollo:\nYour Honor! This is a vital piece of information! Please add it to the testimony.\nJudge:\nVery well. The witness will add this to his testimony.\nBrushel:\nVital! Right!\nChanges statement from \"I drank the coffee, too, but I'm not dead yet!\" to \"He had one sip, if that. The next moment, he was on the floor!\"\nNot important\nApollo:\n(The coffee Mr. Misham drank... That has to be important somehow... ...Nah.)\nJudge:\nVery well, please continue with the testimony.\nLeads back to cross-examination\nBrushel:\nHe had one sip, if that. The next moment, he was on the floor!\nPress\nApollo:\nApollo:\nSo he either took a sip, or he didn't, and then fell over?\nBrushel:\nOh yes! Indubitably! Just like that! Wham bam!\nApollo:\n(So Mr. Misham drank the coffee, and fell over immediately... Hmm. I think Brushel's telling the truth, too. Hmm. Should I get him to talk about something else?)\nNo need\nApollo:\n(There's no real need to change the testimony. The problem with the testimony is already pretty obvious!)\nLeads back to cross-examination\nThe moment of death\nApollo:\nUm, about when Mr. Misham passed away...\nBrushel:\nHoo boy, what a scene that was! He puts his coffee mug down with a crash, right?\nJudge:\nHmm... Yes, and then?\nBrushel:\nThen the cold finger of Death touches his spine! Life's flame sputters and fails! So cold was that touch, he could do naught but tremble uncontrollably! ...Actually \"life's flame\" is a little tired. \"Life's river froze over\"... Yes! That's a go.\nTrucy:\n...I think he's starting his article already.\nApollo:\nCould you describe that a little more simply?\nBrushel:\nWell, as you can imagine, I was pretty surprised. He hit the floor, as they say. \"Artist's Seizure Is Final Performance\", end quote.\nKlavier:\nAtroquinine paralyzes the central nervous system. The body arches back like a bow, the limbs tremble, the throat burns--\nJudge:\nTh-That's quite enough of that! Some of us want to be able to sleep tonight.\nBrushel:\nOh yeah? Well I want details, lots of juicy details!\nKlavier:\nFor that you can listen to our last year's hit single. \"Atroquinine, My Love\", by the Gavinners. Available at all major music outlets.\nJudge:\nThe point here is that the victim died of atroquinine poisoning. Well, Mr. Justice? How did you find that testimony?\nVery important\nApollo:\nWell, as an account of the moment of the victim's death, I'd say it's very important. ...Please add it to the testimony.\nJudge:\nVery well. The court requests the witness add this account to his testimony.\nChanges statement from \"He had one sip, if that. The next moment, he was on the floor!\" to \"Those spasms... That was definitely death by poison.\"\nNot important\nApollo:\n(You'd think the moment of Mr. Misham's death would be important... ...But Mr. Brushel's story really didn't tell us anything we didn't already know.)\nJudge:\nVery well, please continue with the testimony.\nLeads back to cross-examination\nBrushel's coffee\nApollo:\nSo, you drank the coffee that Vera served you, too?\nBrushel:\nCourse. \"When someone serves you coffee, you drink it\"... That's what my old boss always used to say. Never did get what he meant by it, though.\nApollo:\nBut you're still alive, which is to say, you didn't die.\nBrushel:\nOf course not! \"No Point Falling Before You're A Star\", end quote.\nApollo:\n...That's not exactly what I was getting at.\nKlavier:\nWhat were you getting at, then? You know the poison was on the rim, not in the coffee.\nBrushel:\nOh yes, yes! There were two cups on the tray she brought. And one of the cups had Drew's signature painted on the side.\nApollo:\n(Hmm. No chance the guest would take that one by mistake, I guess.)\nJudge:\nWell, Mr. Justice? Was that testimony important?\nVery important\nApollo:\nWe're talking about the coffee the witness drank. I'd say that is important!\nJudge:\nVery well, please add that to your testimony, Mr. Brushel.\nChanges statement from \"He had one sip, if that. The next moment, he was on the floor!\" to \"I drank the coffee, too, but I'm not dead yet!\"\nNot important\nApollo:\n(So Brushel drank the coffee, too... Doesn't look like this is going to lead to much...)\nJudge:\nVery well, please continue with the testimony.\nLeads back to cross-examination\nPresent Coffee Mug\nApollo:\nLeads to:\n\"You know what I have a problem with? A particular property of the poison used, atroquinine.\"\nBrushel:\nNo one else entered the room besides her the whole time.\nPress\nApollo:\nApollo:\nCan you say that for sure?\nBrushel:\nFor sure? Sure! I'm sure. Drew Studio isn't a big place, kiddo. I'd know it if someone else had come in!\nApollo:\nWhat if they had been hiding in there from before!?\nKlavier:\nKlavier:\nEven if someone had been hiding in the studio... ...they hardly could have poisoned that mug without anyone noticing.\nBrushel:\nYou think I, Spark Brushel, would miss something as obvious as that? Nooooo way.\nTrucy:\nHe sure makes it sound exciting. I guess that's his job.\nApollo:\nThere's only one moment we need to focus on, really.\nTrucy:\n...The moment when Drew Misham died?\nApollo:\nExactly. There has to be something there!\nApollo:\nYou know what I have a problem with? A particular property of the poison used, atroquinine.\nJudge:\nOh? Prosecutor Gavin was quite clear about the poison. A lethal dosage of 0.002mg paralyzes the central nervous system. If you drank that, even you, Mr. Justice, would be reduced to a quivering pile...\nApollo:\n(Why are you using me as an example!?) Unfortunately, we weren't told everything. There was a vital omission in Prosecutor Gavin's information!\nKlavier:\n......\nJudge:\nAn omission?\nApollo:\nAtroquinine is as virulent as he says. But death doesn't come upon ingestion, not immediately. That's because atroquinine is slow-acting!\nJudge:\nSlow-acting!\nBrushel:\nWhatwhatwhatwhat!?\nApollo:\nAccording to one forensic scientist...\nEma:\nIt's one of the most virulent poisons, but is absorbed into the body astonishingly slowly. It takes at least 15 minutes from the time of ingestion for adverse effects to show.\nApollo:\nIf we suppose that the moment Mr. Misham sipped the coffee was when he sealed his fate... ...then he would still have had time left to enjoy his last cup of joe!\nJudge:\nOrder! Order!!! What's the meaning of this!? If what the defense says is correct... ...why, that contradicts the entire testimony we've just heard!\nApollo:\nWell, Mr. Brushel? Anything to say... on the record!?\nBrushel:\nSlow-acting. S-L-O-W A-C-T... It was virulent, alright. Even then, it had already begun digging its claws into the journalist.\nTrucy:\n...He's working on his scoop.\nApollo:\n(*sigh*)\nKlavier:\nKlavier:\n...It's \"Brushel\", ja? Herr Brushel... let's take a trip back down memory lane.\nBrushel:\nHuh?\nKlavier:\nDid the victim really die the instant he took a sip? Think it over. This is vital.\nBrushel:\nYou know what I think? I think that was... \"A Not-So-Subliminal Suggestion\"... end quote.\nKlavier:\nI admit, it does cause a problem if he died when you say he died. ...I would be forced to say auf Wiedersehen to my simple case. And you would be forced to say farewell to your article.\nBrushel:\nCome again?\nKlavier:\nYou can't write a story based on conjecture, can you? And as the case drags on, other reporters will pick up the scent. ...And you'll be forced to kiss your exclusive scoop goodbye.\nBrushel:\nScoop... Scoop... .....................! Look, wait. Just wait a second. Just one second.\nJudge:\nWe're waiting, we're waiting! Out with it!\nBrushel:\nI think I just recalled a so-called \"important detail\"! \"A Revival of Recollection\", end quote! \"A Story's Survival\", end quote!\nApollo:\n\"Attorney Utterly Confused\", end quote.\nBrushel:\nActually, I did notice something when I visited the studio. I'd heard of poison that \"takes its sweet time\", see!\nKlavier:\n...But not what I've been saying for the last few minutes, apparently.\nJudge:\nMr. Brushel! Are you saying you noticed something that explains what happened!?\nBrushel:\nYou bet I am! The \"Antidote For A Poisonous Contradiction\", end quote, you might say!\nApollo:\nOr \"I Still Have No Idea What You're Talking About\", end quote, I might say.\nBrushel:\nI figured it out, but only after an in-depth interview! See, thanks to my journalism skills, I know who poisoned that coffee!\nJudge:\nOrder! Order! Order!\nKlavier:\nAs far as I can tell, the witness is standing by his testimony. ...That Mr. Misham died the instant after he drank.\nBrushel:\nOf course I'm standing by my testimony! ...And my dream of exclusive rights to this story!\nKlavier:\n...Ach. I suppose it was too much to hope for.\nApollo:\nWhat was?\nKlavier:\nOf course he wouldn't choose a simple case, not him.\nJudge:\n\"Him\"...?\nKlavier:\nPhoenix Wright, who else?\nApollo:\n...!\nKlavier:\nAchtung, Herr Brushel! Report for us, if you would. What is it that you noticed?\nBrushel:\n......\nJudge:\nThis court is a critical trial of the Jurist System. I'm afraid no room for doubt is permissible. You will testify to the court about what you noticed!\nWitness Testimony\n-- What Brushel Noticed --\nBrushel:\nWhen I arrived at the studio, Mr. Misham was at his desk.\nHe seemed to be writing a letter... but he quickly sealed the envelope.\nI thought nothing of it at the time, of course.\nNow that I think about it, what if he was writing a suicide note!?\nJudge:\nHmm... A suicide note?\nBrushel:\nYes... he had this look on his face. \"Man's Face Inscrutable As A Quadratic Equation\", end quote.\nTrucy:\nSuicide? Poor Mr. Misham... But that means Vera's innocent!\nApollo:\nWould someone commit suicide in the middle of an interview?\nTrucy:\nOh.\nJudge:\nVery well, you may begin your cross-examination.\nCross Examination\n-- What Brushel Noticed --\nBrushel:\nWhen I arrived at the studio, Mr. Misham was at his desk.\nPress\nApollo:\nApollo:\nWas there anyone at the studio other than Mr. Misham?\nBrushel:\nWell, his daughter Vera, of course.\nApollo:\nWas anyone besides Mr. Misham and Vera present?\nBrushel:\nNot a single one. Not a cat, not a rat, not even a mouse.\nApollo:\nThe only person who didn't belong to that studio there... ...was you, wasn't it, Mr. Brushel?\nBrushel:\nAh. Ah! I know what you're doing! I know your game! \"Attorney Uses Classic Ramsden Phenomenon Ploy\", end quote.\nKlavier:\nIf you intend to suggest that this reporter is a suspect... ...I'm sure you also intend to present evidence supporting that assertion, correct? In the meantime, let's move along, shall we?\nBrushel:\nHe seemed to be writing a letter... but he quickly sealed the envelope.\nPress\nApollo:\nApollo:\nSo he put the letter away when he saw you?\nBrushel:\n\"Early Reporter Gets Worm\", end quote. ...That's my secret!\nApollo:\nI'm not sure I follow.\nBrushel:\nIt's the night of the interview. I arrive 15 minutes ahead of schedule! The handle turns, the door opens, and I barge in!\nApollo:\nAre you sure that's OK to do? I mean, isn't that unlawful entry, really?\nBrushel:\nMr. Misham sure seemed to think so! You shoulda seen him! He crammed his letter into that yellow envelope as fast as he could. I know a secret when I spot one, and that was one!\nJudge:\nIt does seem significant. Well, Mr. Justice?\nApollo:\n(I wonder... It does have the ring of something important...)\nAdd to testimony\nApollo:\nThe defense finds this testimony vital, Your Honor!\nJudge:\nVery well, please add it to the testimony then.\nBrushel:\nHey, why not? My \"account\" comes free of charge!\nAdds statement \"It was a yellow envelope. ...I heard it was left at the crime scene.\"\nNo need\nApollo:\n(I can't see what, though. Nothing seemed unusual.) ...It won't be necessary to add this to the testimony, Your Honor.\nJudge:\nVery well, please continue with your testimony!\nBrushel:\nYou got it!\nLeads back to cross-examination\nPress (after adding statement)\nApollo:\nApollo:\nSo he put the letter away when he saw you?\nBrushel:\n\"Early Reporter Gets Worm\", end quote. ...That's my secret!\nApollo:\nI'm not sure I follow.\nBrushel:\nIt's the night of the interview. I arrive 15 minutes ahead of schedule! The handle turns, the door opens, and I barge in!\nApollo:\nAre you sure that's OK to do? I mean, isn't that unlawful entry, really?\nBrushel:\nMr. Misham sure seemed to think so! You shoulda seen him! He crammed his letter into that yellow envelope as fast as he could. I know a secret when I spot one, and that was one!\nApollo:\nMaybe you could tell us a bit more about this envelope?\nBrushel:\nIt was a yellow envelope. ...I heard it was left at the crime scene.\nPress\nApollo:\nApollo:\nAnd you saw him seal this yellow envelope with the letter?\nBrushel:\nHey, don't look at me like that! I saw what I saw.\nTrucy:\nApollo! You think this might be...\nApollo:\n...Our big break. Yeah. (What I need is to show some decisive evidence now...)\nPresent Red Envelope\nApollo:\nLeads to:\n\"As it just so happens, there was a single letter in a desk drawer at the scene.\"\nBrushel:\nI thought nothing of it at the time, of course.\nPress\nApollo:\nApollo:\nYou didn't think anything might be wrong at the time?\nBrushel:\nHey, when I go in for an interview, that's what I'm there to do. \"Interviewer Finds Looking More Effective Than Caring\", end quote.\nApollo:\nSo what about now? Thinking back on it, did you sense anything strange in Mr. Misham's behavior?\nBrushel:\nWell, yeah, that's why I'm telling you all this to begin with!\nJudge:\nVery well, continue with your testimony.\nBrushel:\nNow that I think about it, what if he was writing a suicide note!?\nPress\nApollo:\nApollo:\nA \"suicide note\"...?\nBrushel:\nWell, yeah, don't quote me or anything. I'm just saying it's a possibility, you know?\nApollo:\nSo you didn't actually check the letter.\nBrushel:\nOf course not! It was sealed! \"Contents Of Can Unknown Until Can Is Opened\", end quote.\nApollo:\n...You can always check the label.\nTrucy:\nDo you think Mr. Misham was writing a suicide note?\nApollo:\nIf he was, that would solve the case in a jiffy.\nTrucy:\nIt kind of makes me wonder about that letter...\nApollo:\nAs it just so happens, there was a single letter in a desk drawer at the scene. In a red envelope!\nBrushel:\nWhaaaaaaaaaaaaaaaat!?\nApollo:\n...Prosecutor Gavin!\nKlavier:\n...Yes?\nApollo:\nWas a yellow envelope found at the scene of the crime?\nKlavier:\n...Unfortunately no. But, Herr Forehead... ...it's easy to mistake the color of an envelope.\nApollo:\nI guess. But not this envelope. You see, it was postmarked already. Seven years ago.\nJudge:\nWell, Mr. Brushel?\nBrushel:\n...I can explain that. Drew, right, he wanted to get that letter in an envelope, pronto! Get it out of sight of my beady eyes, right? So he grabbed the nearest envelope and crammed away!\nApollo:\n(And what about the whole red and yellow envelope contradiction, chump!?)\nJudge:\nWell, Mr. Justice? Have you anything to say to the witness's claim?\nApollo:\n\"That night, the victim put a letter he had been writing in a red envelope\"...\nIt's possible\nApollo:\nIt's entirely possible!\nTrucy:\nBut Apollo! We checked the contents of that envelope yesterday, didn't we?\nApollo:\nOh... You're right! (Gah! The answer was clear if I'd only given it a little thought...)\nLeads to:\n\"...As it just so happens, the defense team investigated the contents of this envelope!\"\nIt's impossible\nApollo:\nThat's impossible.\nKlavier:\nAh, I like your expression. So full of confidence.\nApollo:\nIt's simple, really.\nLeads to:\n\"...As it just so happens, the defense team investigated the contents of this envelope!\"\nApollo:\n...As it just so happens, the defense team investigated the contents of this envelope! With, erm, the assistance of a forensic scientist.\nKlavier:\nWhat...?\nApollo:\nNote that this letter is addressed to \"Drew Misham\".\nBrushel:\nOh?\nApollo:\nWhy would he address a letter to himself? Let alone send a suicide note to himself!\nBrushel:\n...... I... I've been scooped!\nJudge:\nOrder! Order! Order!!! Mr. Brushel! Can you explain this to the court?\nBrushel:\nOh, my, my, my. How could I have forgotten? I suppose this happens to the best of us! \"Reporter Gets Old, Forgets Lots\", end quote.\nJudge:\nI'm still waiting for an explanation, Mr. Brushel!\nBrushel:\nWell, that's the thing, see. After he put his letter in that envelope... ...Mr. Misham sat there searching his desk drawer for something!\nApollo:\nHis desk drawer...?\nBrushel:\nYes! A stamp! A so-called \"Postage Stamp\", end quote!\nJudge:\nA stamp? Whatever for?\nBrushel:\nWell, to mail his letter, what else? And then, why yes, I think I saw him put it in his letter box. Yes, it was a yellow envelope, and he put it in that box!\nJudge:\nWell, apparently, this yellow letter has nothing to do with this case.\nBrushel:\nOh, how I wish it did! Just think if that were a suicide note... What a story! \"Star Writes Suicide Note In Front Of Reporter, Falls\", end quote.\nJudge:\nAhem. As I was saying, that has nothing to do with this case! That said.\nApollo:\nYes, Your Honor?\nJudge:\nIt makes me wonder about the contents of that red envelope. $100,000 is quite a good deal of money!\nKlavier:\nSo this was from seven years ago, ja...?\nBrushel:\n...! So, am I finished? Here, I mean. Am I finished here? I was thinking of, you know, going home, to start writing...\nApollo:\n...Um, I hate to state what should be pretty obvious to anyone... ...but when you catch the scent of a story... ...you make that... er, rather unique face.\nBrushel:\nAck! C-C'mon! \"Attorney Has Active Imagination, Little Else\", end quote.\nJudge:\nEven I noticed something, and my eyes aren't what they used to be. You know, I'm starting to understand what all this \"perceiving\" stuff is about!\nApollo:\n(\"Judge Has Active Imagination\"... end quote.)\nJudge:\nPlease, continue with your testimony. Tell us about the scent of a story!\nBrushel:\nHey... I'm the one asking the questions here. Usually.\nWitness Testimony\n-- The Scent Of A Story --\nBrushel:\nActually, it took a bit of work to get a thumbs-up on the interview.\n\"Reporter Leverages Story, Gets His Interview\", end quote.\nThe story concerned a certain case from seven years ago.\nThat red envelope probably had something to do with it.\nSay what you will, but Drew's talent was without compare.\nJudge:\nSo you threatened to go to press with this \"story\"? That's how you got your interview? Blackmail?\nBrushel:\nWell, yes. ... I mean no! No, no, no, no! It wasn't exactly black... I mean, I'm not... urk!\nJudge:\n...Something wrong, Mr. Brushel?\nBrushel:\nL-Look! This is my story! My tidbit! \"Journalist's Into Is Livelihood\", end quote.\nJudge:\n...I see.\nBrushel:\nWhile you have me chatting away in here, what's going on out there? What if some Wally Wordsworth or Sally Scooper gets wind of my story? They could be going to press while I'm going to waste!\nJudge:\nThe court feels your pain, Mr. Brushel. Mr. Justice, let's pick up the pace.\nApollo:\n(A certain case, seven years ago... Wait... \"seven years ago\"?)\nTrucy:\n...?\nCross Examination\n-- The Scent Of A Story --\nBrushel:\nActually, it took a bit of work to get a thumbs-up on the interview.\nPress\nApollo:\nApollo:\nThe victim, Drew Misham, had an aversion to reporters?\nBrushel:\nBoy, I guess. Not even my considerable charms did much for him. Until I finally got my thumbs-up, that is.\nKlavier:\nMaybe you can elaborate on that a bit for us?\nBrushel:\n\"Reporter Leverages Story, Gets His Interview\", end quote.\nPress\nApollo:\nApollo:\n...Exactly what sort of story was this?\nBrushel:\nOh a little one. Like I said. \"Nothing More, Nothing Less, Nothing In-Between\", end quote. I might have suggested I had a lead on this particular story. But I didn't threaten, or cajole, or nothing! Honest!\nApollo:\n(So a suggestion was enough to get an interview? Mr. Misham must have really wanted to keep it under wraps...)\nBrushel:\nThe story concerned a certain case from seven years ago.\nPress\nApollo:\nApollo:\nA certain case, seven years ago? Tell us! What case!?\nBrushel:\nLet me state one thing, Mr. Attorney, and you can quote me on this! I... can't talk about that case!\nApollo:\nWh-Why not!?\nBrushel:\nIt's about journalistic pride, and staunchness, and credibility, and connections! \"Journalist Reveals Sources Only Over His Dead Body\", end quote. So what'll it be? Gonna strangle me? Dead men don't tell tales, Mr. Attorney!\nApollo:\n(He sounds pretty determined not to talk.)\nTrucy:\nHmm. Our chances of breaking his will aren't looking good.\nBrushel:\nThat red envelope probably had something to do with it.\nPress\nApollo:\nApollo:\nOn the one hand we have your \"story\", and on the other, this letter. What makes you think the two are related?\nBrushel:\nOh! Ah, er, I was just saying it's possible. Call it \"Reporter's Intuition\", end quote. Hey, I say a lot of things. You going to pick all of them apart? Be my guest!\nApollo:\n(All of them? No. Just the incredibly suspicious ones.)\nJudge:\n...I see. Anything else to add about Mr. Misham?\nBrushel:\nSay what you will, but Drew's talent was without compare.\nPress\nApollo:\nApollo:\nJust how amazing was \"Mr. Misham's talent\"?\nBrushel:\nHuh? Hoo wee, boy. I mean, hey! He's a star, man, a star! The flow of his brush is like a great, undulating river across the canvas! \"Artist's Paints Light Up Studio Like Sun\", end quote.\nApollo:\n(This guy is full of wacky gestures... But that one just now was wackier than usual.)\nTrucy:\nHe looks kind of nervous to me, Apollo.\nApollo:\nDefinitely. I'm sensing something different than before here... (Maybe it's time to bring out you-know-what...)\nPerceive sweating armpit on \"but Drew's talent\"\nApollo:\nLeads to:\n\"Sweat much, Mr. Brushel?\"\nTrucy:\n...That testimony left a bad taste in my mouth.\nApollo:\nIt all makes sense. Nothing jumps out as ridiculous.\nTrucy:\nI wonder what this \"story\" he's talking about is? It must have been good, to get an interview with a famous recluse like that.\nApollo:\n(Something powerful enough to drag Drew Misham out of hiding. I wonder... Maybe it had something to do with Mr. Misham's art?)\nApollo:\nSweat much, Mr. Brushel?\nBrushel:\nUrk! Eh, yeah, well... ...a man can't help his glands, you know!\nApollo:\nIt's more than that. When \"Mr. Misham's talent\" was mentioned... ...you suddenly began to sweat buckets.\nBrushel:\n...Ack!\nApollo:\nYou're hiding something... about his talent!\nBrushel:\nWhaaaaaaaaaaaaaaaaaaaaaaaaat! Th-Th-Th-Th-Th-That's r-r-r-ridiculous!\nApollo:\n(Evidence time. Let's show where Mr. Misham's true \"talent\" lay!) It just so happens I have evidence showing the \"talent\" mentioned in that letter!\nPresent Hidden Painting\nApollo:\nLeads to:\n\"This painting was found in Mr. Misham's studio.\"\nPresent anything else\nApollo:\nBrushel:\nEr, I can't help but wonder what the court is supposed to conclude from this evidence?\nApollo:\nOh...\nBrushel:\nOther than that you've made a horrible mistake? \"Man Burns Bridge, Forgets To Cross First\", end quote.\nApollo:\n(...Let's try that again. All I have to do is reveal what Mr. Misham really was. That shouldn't be so hard, right?)\nLeads back to:\n\"It just so happens I have evidence showing the \"talent\" mentioned in that letter!\"\nApollo:\nThis painting was found in Mr. Misham's studio.\nBrushel:\n...!\nApollo:\nThere are two problems with this painting. The first is it wasn't painted by Mr. Misham. The second is that there was another painting in the studio... ...which looked exactly like this one. Except it was only half done!\nBrushel:\n......\nApollo:\nThen we have a letter discussing a payment of $100,000. Which suggests a certain business operation. The business of making forgeries!\nBrushel:\nAoooooooooooooogg!\nApollo:\n...That is all, Your Honor.\nBrushel:\nEveryone! Please, everyone! Can we keep this private? Please!? This is my story! My scoop!\nJudge:\nForgery... that's a serious crime!\nBrushel:\nDrew Misham is known as an artist these days. But there were rumors he dabbled in another kind of art until a few years back.\nJudge:\n\"Another art\" meaning... forgery?\nBrushel:\nDrew Misham was talented, alright. Talented at making precise, detailed fakes. A fact that certain criminal elements were quick to discover.\nApollo:\nCriminal elements...? What...!? You can't seriously be talking about...\nBrushel:\n...Exactly. I'm talking about forging evidence! The rumors started circulating seven years ago.\nJudge:\nS-Seven years ago...? So, are we to understand that this letter... ...this payment of $100,000 was for...?\nBrushel:\n...Exactly. \"Forged Evidence Nets Tidy Profit\", end quote.\nJudge:\nOrder! Order! Order! Why, it's like our victim was living a double life!\nApollo:\n(Ah ha! This is my chance!) So the victim had ties to the criminal world, right? He could have had plenty of enemies we know nothing about!\nKlavier:\nKlavier:\nThis is my first time hearing of this \"criminal world\". We certainly found no criminal connections when we conducted our investigation.\nApollo:\nApollo:\nBut how do you explain all this money? You have to admit there's a possibility of some illegal activity here!\nKlavier:\nKlavier:\n...But there is no proof tying this letter to our case.\nApollo:\n...!\nKlavier:\n...Our case was, and remains, simple from the beginning. Only the defendant could have poisoned that mug that night. And, you, of course.\nBrushel:\nHey, hey, hey, the only thing I poison is my pen... when I'm writing reviews!\nJudge:\nMr. Brushel, your testimony to this point has been quite unreliable. ...It doesn't speak well of your reporting acumen.\nBrushel:\nWhat're you talking about!? My journalism is rock solid! \"Journalism So Solid, You Could Stand An Elephant On It\", end quote.\nJudge:\nIn any case... Let's hear a summarized recap of your testimony. If we can ascertain the situation in that studio from the recap, the trial is over.\nTrucy:\nApollo! What's he talking about?\nApollo:\nThe cross-examination showed Mr. Brushel didn't have reason or means to poison him. As long as there're no other suspects... ...then the killer had to be Vera. That's what. ...This next testimony is our last chance!\nJudge:\nMr. Brushel, your testimony please!\nWitness Testimony\n-- The Interview: A Recap --\nBrushel:\nThe only other person in the studio that night was the defendant.\nIt was Vera who poured the coffee. She's admitted as much herself.\nThe only thing that touched Drew's lips during the interview was that mug.\nAnd nothing left that studio after he died. Nothing.\n...Clearly, the only one who could have poisoned him was his daughter!\nKlavier:\nA nice testimony. Clear, succinct... and without room for doubt.\nBrushel:\nAw... Shucks. You really think so?\nJudge:\nI believe this clarifies the situation that night. Very well, Mr. Justice. You may begin your final cross-examination!\nApollo:\nR-Right... (...I still have one trump card left to play. And I won't let this trial end until I use it!)\nCross Examination\n-- The Interview: A Recap --\nBrushel:\nThe only other person in the studio that night was the defendant.\nPress\nApollo:\nApollo:\nBut that doesn't prove Vera poisoned it!\nKlavier:\nKlavier:\nHow many times have we heard that one, Herr Forehead? The poison reached its victim via that coffee mug. And from where did that coffee come, hmm?\nApollo:\n...!\nKlavier:\nNot to beat a dead horse again, and again, but perhaps you could fill us in?\nBrushel:\nI'm on it! You need a horse beat? I'm your man!\nBrushel:\nIt was Vera who poured the coffee. She's admitted as much herself.\nPress\nApollo:\nApollo:\nAnd you witnessed her pouring the coffee?\nBrushel:\nCourse I didn't witness it! When she came in with that tray... ...the coffee was already poured and a-steamin'.\nKlavier:\n...Let us not forget the defendant has admitted to pouring the coffee herself. I heard her statement: \"I poured, I served, and I killed.\"\nApollo:\n...Wha--!?\nKlavier:\nAh ha ha ha ha. That last part was just a little joke.\nApollo:\n(I don't think I'm going to get anywhere with this coffee mug. I need to find another weak spot in this case.)\nBrushel:\nThe only thing that touched Drew's lips during the interview was that mug.\nPress\nApollo:\nApollo:\n...You're sure about that?\nBrushel:\nWell, to be really, really, precise... ...I was busy gobbling mint candies the whole time.\nApollo:\nOne of those candies might have been poisoned!\nKlavier:\nKlavier:\nYet, at the time of the autopsy, no fresh fragrance of mint filled the room. ...And no \"mint residue\" was found.\nApollo:\n...! (It was a long shot anyway.)\nKlavier:\nDon't tell me you're still trying to prove this? You think the victim ate, drank, or otherwise ingested something other than coffee?\nJudge:\nHmm. Well, Mr. Justice? If you have some proof...\nApollo:\n(The possibility is there, I can feel it. Just maybe not prove it, not yet. And possibility isn't going to cut it, not now!) Mr. Misham ingested that poison via a route other than that coffee!\nI can prove it. (before changing fourth statement)\nApollo:\nProof... is possible. (I gotta risk it...)\nJudge:\nOh? Excellent. Let's see your proof then. Please show us your evidence! What evidence shows that the victim wasn't poisoned via his coffee mug?\nPresent anything\nApollo:\nKlavier:\nMust I explain this over and over and over? We don't need possibilities, here, Herr Forehead. We need proof.\nApollo:\nI-I know that!\nKlavier:\nYou should also know that every proof has its moment. Perhaps you're a bit early?\nJudge:\n...I can tell you what we know at this point: The victim put nothing to his mouth but that coffee mug.\nApollo:\n(*sigh* Another hole in this case that needs plugging before I can prove anything. But first things first. I'd better uncover a weak spot before I try to strike again!)\nJudge:\nOn with the cross-examination!\nLeads back to cross-examination\nI can prove it. (after changing fourth statement)\nLeads to:\n\"Proof is... possible.\"\nNot yet (before changing fourth statement)\nApollo:\nIt... can't be proven.\nKlavier:\n...I do believe our little Forehead is growing up. Pity. We liked the rash, youthful Forehead best.\nApollo:\n(*sigh* Another hole in this case that needs plugging before I can prove anything. But first things first. I'd better uncover a weak spot before I try to strike again!)\nJudge:\nOn with the cross-examination!\nLeads back to cross-examination\nNot yet (after changing fourth statement)\nApollo:\nIt... can't be proven.\nKlavier:\n...I do believe our little Forehead is growing up. Pity. We liked the rash, youthful Forehead best.\nApollo:\n(Wait a second... We already know a letter might have left the studio that night. Couldn't that have opened another path for poisoning? The situation's already changed... I just need to take advantage of it!)\nJudge:\nLet's continue with the cross-examination.\nLeads back to cross-examination\nBrushel:\nAnd nothing left that studio after he died. Nothing.\nPress\nApollo:\nApollo:\nNot one thing...? You're sure?\nBrushel:\nYep, sure as sure can be. ...Well, with one exception.\nJudge:\nOne exception!? What!?\nBrushel:\n\"Journalist Spark Brushel Does Interview, Leaves Studio\", end quote. Ah. Ah ha ha! C'mon! It's a joke! Get it? Not funny, I know, but still!\nApollo:\n(Did something leave the studio that night? Why does that sound familiar? Where have I heard something like that before...?)\nJudge:\nNow that we've proven our witness is a comedian of sorts... ...I'd like to turn to our defense attorney before returning to the testimony. Do you have any idea what, if anything, might have left the studio that night?\nNot a thing\nApollo:\n...... (I can't think of a single thing!) ...If anything did leave, wouldn't Mr. Brushel have noticed?\nBrushel:\nThat I would, that I would! Nothing left! Save myself, of course.\nJudge:\nSay that again and you'll be held in contempt of court. Let's get back to the cross-examination, then!\nLeads back to cross-examination\nJust one thing\nApollo:\nI think one thing might very well have left the studio that night, actually. A certain something that has vanished from the crime scene.\nJudge:\nBy which you mean... ...something other than our witness?\nApollo:\n...Of course.\nKlavier:\nDon't tell me. \"Vera Misham\"?\nApollo:\nBelieve me, any comic relief I may provide is entirely unintentional.\nJudge:\nThen, let's see what you've got for us, Mr. Justice!\nApollo:\nWell, this thing wasn't at the scene of the crime, so I can't show it to you. But I do have evidence that shows how it could have been taken from the scene!\nPresent Letter Box\nApollo:\nLeads to:\n\"This is the only link between that studio and the outside world.\"\nPresent anything else\nApollo:\nJudge:\n......\nKlavier:\n......\nBrushel:\n...I find Prosecutor Gavin more amusing than this guy, really.\nKlavier:\nIf that was comic relief, why do I not feel amused?\nJudge:\nWe want evidence, not entertainment, Mr. Justice!\nApollo:\n(There goes my career in stand-up...)\nLeads back to:\n\"Well, this thing wasn't at the scene of the crime, so I can't show it to you.\"\nApollo:\nThis is the only link between that studio and the outside world.\nJudge:\nA letter box?\nApollo:\nWhat did Mr. Brushel just tell us? When he entered the studio on the night of the murder... ...the victim had just finished writing a letter!\nBrushel:\nYeah, I said that. And yeah, it was true.\nApollo:\nFurthermore, you went on to tell us... ...that he put the letter in a yellow envelope and put it in the letter box.\nJudge:\nAh...!\nApollo:\nBut that very same letter box was empty! In other words... ...that night, the \"yellow envelope\" disappeared!\nKlavier:\nKlavier:\n...Ah, yes, intriguing. So an envelope has disappeared from the scene of the crime. Of course... this changes nothing.\nApollo:\nHuh...?\nJudge:\nHe has a point, Mr. Justice. What we're trying to figure out here is how the poison got into Mr. Misham. Is it really important that this envelope the witness says he saw disappeared?\nApollo:\nWell, if it did disappear, then something did leave the studio that night. That seems very important to me!\nJudge:\nVery well then. The witness will add this to his testimony.\nBrushel:\nYou got it.\nKlavier:\n...I still think this fails to change anything, Herr Forehead.\nApollo:\n(I wouldn't be so sure. A letter disappeared from the crime scene that night... This is exactly the opening I've been looking for!)\nChanges statement from \"And nothing left that studio after he died. Nothing.\" to \"A letter was put in the post from the studio, but I hardly think that matters.\"\nBrushel:\nA letter was put in the post from the studio, but I hardly think that matters.\nPress\nApollo:\nApollo:\nNothing could be more serious than an envelope disappearing from that studio! And you were hiding that fact from us!\nBrushel:\nEr, yes, well, actually...\nKlavier:\nI don't argue the possibility that a letter disappeared from that studio. ...But Herr Forehead, isn't there a much more serious question before us?\nApollo:\n(...Right, how Mr. Misham was poisoned. I know. But Mr. Brushel's testimony has changed, which means the facts of the case have, too. And what he's told us means something entirely different now, I'm starting to think.)\nTrucy:\nLet's keep thinking, Apollo!\nBrushel:\n...Clearly, the only one who could have poisoned him was his daughter!\nPress\nApollo:\nApollo:\nYou say \"clearly\" as though it were obvious. But this claim that the defendant poisoned the victim is merely conjecture!\nBrushel:\nAh, yes, well, you see... In my business, it's all about making the most ridiculous things sound right. A bad habit, I know.\nJudge:\n......\nKlavier:\n......\nBrushel:\nYes, well, er, actually... ...I guess this is more a case of \"Ridiculous Journalist Sounds Wrong\", end quote.\nJudge:\nThe court is forced to agree with you. Please refrain from wild conjecture.\nBrushel:\nUnderstoodloudandclear!\nApollo:\n(If only I could believe that.)\nTrucy:\nWhat do you think, Apollo? Everything he's saying seems so... not flawed!\nApollo:\n...Well, that's kind of what you want from a testimony, really. (...I need to keep my eye on what matters. How, and why, was Drew Misham, killed? Vera poured the coffee, that's not going to change. But if that coffee didn't kill him, I need to find what did... and prove it!)\nApollo:\nProof is... possible. (Here goes nothing...)\nKlavier:\nYou do understand what we need, ja? Proof, Herr Forehead. Not \"possibilities\".\nApollo:\nOf course. And, Prosecutor Gavin, I hope you understand... ...I'm ready to give you that proof.\nKlavier:\nWh-What did you say?\nApollo:\nI have proof of the disappearing envelope!\nBrushel:\nI saw him writing a letter, I did!\nJudge:\n...Which was picked up by the mailman, I assume?\nApollo:\nOf course, which means... ...that envelope had a stamp on it.\nJudge:\nA stamp... Ah..................\nApollo:\nAs we all know, stamps come with dried glue on the back. In order to use the glue you have to wet it... ...by licking the stamp!\nKlavier:\nKlavier:\nFeh. No one worth talking to actually licks stamps in this day and age.\nApollo:\nApollo:\nEven if you wanted to talk to him, you couldn't. ...He's dead, after all.\nKlavier:\nKlavier:\nOK, so he licked the stamp. But wait! How does that explain the atroquinine on the rim of the coffee mug?\nApollo:\nApollo:\nIf he licked the back of a poisoned stamp, the poison would get on his tongue, yes? What would then happen if he put the coffee mug to his mouth, hmm?\nKlavier:\n...!\nApollo:\nThose traces on the mug weren't the killer's doing! It was the other way around!\nJudge:\nWhat!?\nApollo:\nThe coffee mug didn't poison Mr. Misham... ...Mr. Misham poisoned the coffee mug himself!\nJudge:\nOrder! Order! Order! B-But that doesn't... Does it?\nApollo:\nRecall, if you would... ...atroquinine is a slow-acting poison, yes? The poison entered his body when he put the stamp on that envelope. But his time wasn't up until the very moment he touched his lips to that cup of joe.\nJudge:\nYou have something to add, Mr. Brushel?\nApollo:\n(Uh oh. His nose is picking up another scent...)\nBrushel:\nAs I believe I mentioned earlier.\nBrushel:\nWell, that's the thing, see. After he put his letter in that envelope... ...Mr. Misham sat there searching his desk drawer for something! Yes! A stamp! A so-called \"Postage Stamp\", end quote!\nBrushel:\nBut you know, I don't seem to remember him ever finding one.\nJudge:\nMaybe he'd just run out?\nKlavier:\nIncidentally, we searched the desk drawer at the scene of the crime. There were no stamps. Not a single one.\nApollo:\n...!\nJudge:\nHmm, that does pose a problem. How will you prove that the stamp was coated with poison?\nApollo:\nActually, I'm glad no other stamps were found. It makes proving the stamp he used was poisoned possible!\nKlavier:\nAh ha ha ha ha ha. ...Good show, good show. You can't even prove there was a stamp at the scene in the first place!\nJudge:\n...Well, let's hear what the defense has to say anyway. Where's your evidence that proves the existence of this poisoned stamp?\nPresent Tiny Frame\nApollo:\nLeads to:\n\"Well, that certainly is a cute little frame. And by little, I mean really little.\"\nPresent anything else\nApollo:\nJudge:\n...... Well, Prosecutor Gavin?\nKlavier:\nI think our beloved attorney has been licking too many stamps in his free time.\nApollo:\n(Grr... Do you smile like that when you torture all your victims, or just me?)\nJudge:\nTake care that we don't lick you and stick you in the letter box, Mr. Justice!\nApollo:\n(...I think I'm making this out to be way more complicated than it really is. That stamp would have left a small atroquinine residue on something... But what?)\nLeads back to:\n\"...Well, let's hear what the defense has to say anyway.\"\nJudge:\nWell, that certainly is a cute little frame. And by little, I mean really little.\nApollo:\nIt was on the victim's desk, Your Honor. ...Quite empty, as you can see for yourself.\nKlavier:\nI noticed that too during my inspection. So what?\nApollo:\nAh, apparently you weren't as observant as you should have been. You see, when you saw this frame, it was missing something quite important.\nJudge:\n\"Missing\" something...?\nApollo:\nYes. A pale bluish stain on the inside of the frame... Atroquinine residue!\nKlavier:\nWhat!? Why wasn't I told about this!?\nApollo:\nThe frame is only two inches square. The face of the frame is even smaller. Maybe an inch wide at most.\nKlavier:\nYou aren't saying...\nApollo:\n...Oh, but I am. Tell me: what fits in such a small frame? A commemorative stamp, perhaps?\nJudge:\nOrder! Order! Order!!! The poisoned stamp was in this frame...!?\nKlavier:\nImpossible!\nJudge:\nP-Prosecutor Gavin...!\nKlavier:\nWhy would he put something like that on his desk? Don't tell me he had it there so he could commit suicide if the mood struck!\nBrushel:\nYou know, can I say something? I had a thought, see!\nJudge:\nWhat, Mr. Brushel, and please stop jittering around like that!\nBrushel:\nThe victim was a forger, right? There's a lot of money in that line of work. \"Forger Forges Friends, Makes Enemies, Too\", end quote.\nApollo:\nSo the poisoned stamp might have been a murder weapon, aimed at him!\nKlavier:\nKlavier:\n...Oh, rich. That's rich. Leave the ridiculous flights of fancy to the Gavinners's song lyrics, please.\nApollo:\n(Finally, something we agree on.)\nKlavier:\nThe stamp was a \"murder weapon\"? Nonsense! Murder is a simple business. Who would go to such lengths? No one.\nApollo:\nOh, I disagree.\nKlavier:\nC-Come again...?\nApollo:\nRecall, if you would, the victim's reclusive lifestyle. Drew Misham hid from the world. He avoided meetings. His only contact with the outside world... was the mail.\nJudge:\nThe... mail!\nApollo:\nNow, if you wanted to kill someone you couldn't meet, but you knew read letters... ...a stamp would be the perfect weapon!\nKlavier:\nRidiculous! Where's your proof? I want proof! Show us evidence that this poisoned stamp was sent to him... as a murder weapon!\nApollo:\n(I might not have \"evidence\" per se... But things are finally starting to come together!)\nTrucy:\nWh-What is it, Apollo? Your fists are trembling!\nApollo:\nI think I know what happened! I don't believe it... but I can see it! I think I know how Mr. Misham was killed!\nJudge:\nWell, fill us in, Mr. Justice!\nApollo:\n...A certain piece of evidence points to the truth, Your Honor. I can show you how someone with the intent to kill sent Mr. Misham the stamp of death!\nPresent Red Envelope\nApollo:\nLeads to:\n\"Isn't this the envelope... the one from seven years ago?\"\nPresent anything else\nApollo:\nJudge:\n...... I'm not sure it's entirely clear to me what this proves, Mr. Justice.\nApollo:\nHuh...? (Was I wrong?)\nKlavier:\nI believe we have shown probable \"intent to kill\". Except the killer would be Herr Judge, and the victim, you!\nApollo:\nYeeeeargh!\nJudge:\nConsider that a warning, Mr. Justice. Think before presenting next time.\nApollo:\nYes, Your Honor. (Let's think this one over again.)\nLeads back to:\n\"...A certain piece of evidence points to the truth, Your Honor.\"\nJudge:\nIsn't this the envelope... the one from seven years ago?\nApollo:\nThink about the text of the letter again. There were two pages in the envelope. This is page one. ...And this is page two. I want to draw your attention to one phrase in particular. \"...Send in the enclosed envelope with the enclosed stamp within 3 days.\" The enclosed stamp, Your Honor.\nJudge:\nAh...!\nBrushel:\nIn other words, if I have this straight... \"The Stamp! Poison! On The Stamp! Lick, Lick, Gasp...\" end quote!\nApollo:\nNow, what if he had done exactly as the letter asked?\nTrucy:\nHe would sign the document, put it in the envelope... and put the stamp on it, right? Then he would put it in his letter box...!\nApollo:\nFifteen minutes wouldn't have elapsed between affixing the stamp, and mailing the letter. But the clock started ticking, and when the time came... he drew his last breath. And the murder weapon would be taken away from the scene.\nJudge:\n...Quite conveniently, thanks to the postal system!\nKlavier:\n...Such a splendid imagination you have, Herr Forehead!\nApollo:\n......\nKlavier:\nLet me confirm one thing with you, if I might. So, this \"poisoned stamp\" was inside this envelope from seven years ago... ja? Is that what you'd have us believe? Really?\nApollo:\n...W-Well...\nTrucy:\nIt is a little bit of a stretch, but there's a possibility.\nKlavier:\nYes. A very small possibility. How small, I wonder?\nTrucy:\nUm...\nKlavier:\nA poisoned stamp in this envelope? A stamp that then became the murder weapon? How do you intend to prove this seeming coincidence?\nTrucy:\nW-Well...\nApollo:\n(Ack! It was seven years ago, and we don't even know who sent that letter!)\nKlavier:\nAnd your answer... is silence, I see. Very well! I move to...\n???:\n...It's not nice to pick on the Fräulein, Klavier.\nKlavier:\n...!\nApollo:\nAh... Ema!\nEma:\nWell? Like my Kristoph Gavin impression? Did I sound like him?\nApollo:\n...Don't quit your day job.\nKlavier:\nDon't you have a crime scene to be looking after, Fräulein Detective?\nEma:\nSomeone had to come dig you all out of the mess you're making of this case.\nApollo:\nMess...?\nEma:\nYou know, none of this would happen if you just trusted in science a little more. You can find out if that stamp was in that envelope, easy.\nKlavier:\nCare to explain yourself, Fräulein Detective?\nEma:\nGlare at me all you want, but science is on my side. It's all in the residue, right?\nApollo:\nThat's right! The poison detection spray...\nJudge:\nProduce the red envelope at once! You can open it on the authority of the court!\nSpray bottom right of page\nLeads to:\n\"Well! Would you look at that!\"\nJudge:\nWell! Would you look at that!\nEma:\nNo mistaking it. That's atroquinine residue!\nJudge:\nI-I don't believe it... A murder weapon from the past... Now, seven years later, it bares its fangs at last!\nKlavier:\nKlavier:\nAbsolutely outrageous! ...Tell me why! Why didn't this murder take place seven years ago!?\nApollo:\nWell, um...\nEma:\nThere's one possibility. Maybe Mr. Misham figured it out.\nJudge:\nFigured what out?\nEma:\nHe realized that the person who sent that letter wanted him dead. So he sent his reply with a different stamp.\nJudge:\n...And put his decisive evidence in a frame.\n???:\nBrushel:\n......\nJudge:\nAck! You're still here!?\nBrushel:\nC-Can I make a statement here, on the record? I, Spark \"Razortooth\" Brushel, claim this scoop as mine! \"Drew Misham Killed In Cold Blood... ...By Sender Of Seven-Year-Old Letter!\" end quote. Hmm, no, maybe something more succinct. \"Star Falls After 7 Year Delay\", end quote.\nJudge:\nOrder! Order! Order! I see no room for further argument here. Though I admit, this is all coming as quite a shock. To think that the murder weapon reached his mouth after seven years...! \"Stamp Is Ticket Straight To Afterlife\", end quote!\nTrucy:\nUh oh. I think the witness is a bad influence on our judge.\nJudge:\n...I see no need for further debate on this matter. The sender of that letter seven years ago could hardly have been our defendant!\nTrucy:\nA-Apollo!\nApollo:\nI think we just won!\nJudge:\n...Very well! This court finds the defendant...\nKlavier:\nKlavier:\n...Is this the bright future of our legal system?\nJudge:\nProsecutor... Gavin?\nKlavier:\nA ticket to the afterlife from seven years ago...? Tickets for Gavinners's shows are invalid after two weeks.\nJudge:\nB-But it doesn't make sense any other way!\nKlavier:\n...It boggles my mind that so many people haven't noticed this. There's a fatal contradiction in Herr Forehead's claim!\nApollo:\nA c-contradiction?\nKlavier:\nA poisoned stamp was placed in this envelope seven years ago. Whereupon it was framed, until now. If that's the case, then why would Drew Misham have done what he did?\nApollo:\nE-Ema explained that! He must have realized it was poisoned!\nKlavier:\n...Therein lies the rub.\nApollo:\n...!\nKlavier:\nSeven years ago, the forger Drew Misham sensed a trap, and put the stamp in a frame. I do not debate this. ...But this begs the question. Why, seven years later, did he use that stamp on the night of the murder?\nApollo:\nAh...!\nKlavier:\nSurely, you don't mean to suggest that Mr. Misham simply \"forgot\"? He put the murder weapon in a frame on his desk for seven years... and forgot? You expect us to believe he sprang the trap on himself?\nApollo:\n...... Uh... Uwaaaaaaaaaaaaaaaaaaaaaaaugh!\nJudge:\nWhile I admit, this is all quite shocking, myself... ...it does seem highly unlikely that he would fall afoul of a trap... ...that had been sitting on his desk for seven years!\nTrucy:\nA-Apollo!\nApollo:\nI don't think we're winning anymore.\nKlavier:\nAh, I'm glad to see we're all back in the real world now. Welcome back to reality! We've been waiting for you.\nApollo:\nApollo:\nOK... Then how do you explain the poisoned stamp that was in this envelope?\nKlavier:\nThe \"poisoned stamp\"...? Where exactly is this poisoned stamp, again? Have you brought it to court for us?\nApollo:\nUh...\nKlavier:\nI see no proof that such a thing ever existed.\nApollo:\nApollo:\nWhat about the atroquinine residue, huh!?\nKlavier:\nOh, I agree, that does seem to be atroquinine residue. But, Herr Forehead, it's certainly no stamp.\nApollo:\n...! Y-Yeah, but...\nKlavier:\nEven if your precious poisoned stamp did exist... ...Drew Misham never would have used it. ...That is all.\nApollo:\n...... Urk.\nJudge:\nI believe we've come to a conclusion. Again.\nTrucy:\nA-Apollo! Were we wrong the whole time?\nApollo:\nI-I can't believe it! The poison traces match up! It can't be coincidence!\nJudge:\nI'd like to bring some closure to this issue, sometime this year. ...Mr. Justice?\nApollo:\n...Yes, Your Honor!\nJudge:\nLet's review the facts, and see where we stand. Seven years ago, Drew Misham received a red envelope. There were traces of the poison atroquinine on the document inside that envelope. A similar trace was also found at the crime scene... ...on this tiny picture frame. The defense has indicated the possibility of a yellow envelope. An envelope that left the scene of the crime with the poisoned stamp on it.\nKlavier:\nYes, but even if this envelope contained a poisoned stamp... ...and Drew Misham, knowing this, put it in a frame... ...he never would have used that stamp!\nJudge:\n...I'm afraid you're right. Which means there is a fatal flaw in the defense's case!\nApollo:\n(I haven't been on the wrong track this whole time, I'm sure of it! The traces of atroquinine, the envelope, the frame... ...and Drew Misham's mysterious death... They're all connected somehow!)\nJudge:\nWell, Mr. Justice, do you have a conclusion for us?\nApollo:\n...The defense stands by its case, Your Honor. We've seen that the logical outcome of the evidence makes no sense. Which means that one of our clues... must be a fake.\nKlavier:\nAh, a fake clue? Fascinating! And if we find this fake, your wild fantasies will prove quite reasonable, ja?\nApollo:\nThe fake clue that's thrown us off the poison's trail is none other than...\nthe red envelope.\nJudge:\nThis red envelope... is a fake?\nApollo:\n...Without a doubt, Your Honor.\nKlavier:\nKlavier:\n...Wasn't it you who presented this evidence to the court?\nApollo:\n...Oh.\nTrucy:\nHold on a second, Apollo! The poison on that envelope, the frame, and the coffee mug... They're all connected somehow!\nApollo:\nOh... right! (*sigh* I can hear it already. \"It looks like the fake... was you, Herr Forehead!\")\nTrucy:\nNow's no time for wallowing in self-pity! Let's get thinking, Apollo!\nLeads back to:\n\"The fake clue that's thrown us off the poison's trail is none other than...\"\nthe frame.\nJudge:\nThis frame... is the \"fake\" clue?\nApollo:\n...Without a doubt, Your Honor.\nKlavier:\nKlavier:\n...Wasn't it you who presented this evidence to the court?\nApollo:\n...Oh.\nTrucy:\nHold on a second, Apollo! The poison on that envelope, the frame, and the coffee mug... They're all connected somehow!\nApollo:\nOh... right! (*sigh* I can hear it already. \"It looks like the fake... was you, Herr Forehead!\")\nTrucy:\nWe can flog ourselves later, Apollo! Now's the time for thinking!\nLeads back to:\n\"The fake clue that's thrown us off the poison's trail is none other than...\"\nDrew Misham.\nLeads to:\n\"Th-the victim was a \"fake clue\"? I'm afraid I don't understand.\"\nJudge:\nTh-the victim was a \"fake clue\"? I'm afraid I don't understand.\nApollo:\n...I'll explain. We have an envelope, a frame, and a mug, linked by poison. That all makes sense. What doesn't make sense is the victim himself!\nKlavier:\nKlavier:\n...Congratulations. You've completely lost me. So the fake evidence is none other than the master of fake himself, the forger? ...It makes a good story, I'll give you that.\nApollo:\n(The fake clue... Fakes... forgeries...) Ah...!\nTrucy:\nI know that face! That's the \"I just had an idea\" face!\nApollo:\nI don't know if I'm right... but I'm going with it anyway! What if our \"forger\" is the \"fake\"!?\nKlavier:\n...Come again?\nApollo:\nSeven years ago, our forger sniffed a trap, and stepped aside. ...Seven years passed. Now the forger stumbles into that very same trap, and dies. ...Why?\nJudge:\nThat's what I want to know!\nApollo:\nBecause the forger who was killed... was a fake.\nKlavier:\nHere we are again. The victim... was a \"fake\"?\nApollo:\nOne forger smelled the trap. One forger fell into the trap. That's two forgers! And one of them was a fake!\nJudge:\nOrder! Order! Order!!!\nKlavier:\nSo you are telling us that Drew Misham, the victim, was a fake? Well, if he was the fake, who was the real forger? You'd better not be claiming there was some kind of switcheroo?\nJudge:\n...I'm afraid you're going to have to back up your story. Mr. Justice. Show us just who the real Drew Misham was!\nApollo:\n(If Drew Misham wasn't the real forger... ...there's only one other person it could have been!) ...Understood, Your Honor. Forger Drew Misham was himself a forgery! The real forger was...!\nPresent Vera Misham profile\nApollo:\nLeads to:\n\"There can be only one explanation, really.\"\nPresent anyone else\nApollo:\nJudge:\n......\nKlavier:\n......\nBrushel:\n......\nApollo:\n(Ack! \"Attorney Makes Wild Claim, Becomes Subject Of Mass Ridicule\"... end quote! Better come up with something quick before that story goes to print...!)\nLeads back to:\n\"Forger Drew Misham was himself a forgery!\"\nApollo:\nThere can be only one explanation, really. The real identity of the forger known as Drew Misham is none other than... ...his only daughter, Vera Misham!\nJudge:\nOrder! Order! Order! ...Mr. Justice! This is going out on a limb, even for you!\nTrucy:\nI kinda agree. I mean, Vera, a forger?\nApollo:\nLet's consider it before you write it off entirely. If you look at the paintings in the studio, one fact becomes quite clear. Forgery had been taking place in that studio for quite some time! The forger wasn't caught in that trap seven years ago. This can only mean that the one who was caught in the trap wasn't the forger!\nJudge:\nWell... Actually, that does make a certain kind of sense.\nApollo:\nOne more thing! Only two sets of fingerprints were found in the forger's studio. Drew Misham's... and Vera Misham's.\nKlavier:\n......\nApollo:\nIf we know that Drew Misham wasn't the forger... ...that leaves only one possibility, by process of elimination. The forger was Vera Misham. ...Well?\nKlavier:\n...... ...Fascinating!\nJudge:\nVera Misham...?\nVera:\n......\nJudge:\nYou've been paying attention to the trial so far?\nVera:\n......\nKlavier:\nLet's just ask her and be done with it, shall we? Who are you? Who is the forger, Drew Misham?\nVera:\n...... ...! ......\nApollo:\n(Was that... an expression of emotion I saw on her face? She's staring holes into Prosecutor Gavin's face...)\nKlavier:\n...I'm used to being stared at by Fräuleins, believe me. Though they usually talk to me, too. Tell us. Were you the one who forged those works of art?\nVera:\n...... ...Yes...\nApollo:\n...!\nJudge:\nSo... so the forger, Drew Misham was... you!?\nVera:\n...... ...Yes, it was me...\nJudge:\nWha... Whaaaaaaaaaaaaaaaaaaaat!?\nApollo:\n(The court was in an uproar, and it wasn't coming down. We had to break for a ten minute recess.)\nTo be continued.\nOctober 8, 1:24 PMDistrict CourtDefendant Lobby No. 6\nTrucy:\nOK... So where exactly does this leave us, Apollo?\nApollo:\nWell, the Drew Misham who was killed... ...wasn't \"Drew Misham the forger\", basically.\nTrucy:\nHuh? Well then, who was he?\nApollo:\nWell \"he\" was actually...\nVera:\n......\nApollo:\n(...Doing her nails.) So, you really made those forgeries?\nVera:\n...... ...Yes... For Father... ...I know it was wrong...\nTrucy:\nCould you tell us how it happened?\nVera:\n...... ...My father was a painter... ...I love painting ever since I was a child... ...One day, Father saw it in me... ...He saw that I had the \"talent\"...\nTrucy:\nThe talent... for making forgeries?\nVera:\n...How should I say it? It was not only paintings I made... ...Given the materials, I could make... anything...\nApollo:\nAnything...?\nVera:\n...Father was so proud, and I, so happy... ...But, in the end, I was making... those...\nApollo:\n...Forgeries.\nVera:\n...I've never had a good constitution, nor... personality... ...I know very little of the world outside my door... ...... ...Now, because of me... Father... is...\nTrucy:\n...Do you know about this red envelope?\nVera:\n...I remember that envelope. It was some time ago...\nApollo:\nSo, you were already a, um... You were already creating your \"works\" back then?\nVera:\n...I started when I was only twelve years old...\nApollo:\nSo the one who figured out the stamp was poisoned, that was...\nBailiff:\n...Mr. Justice! It's time! To the courtroom, please!\nApollo:\nR-Right! (Out of time...)\nTrucy:\nWait, Vera! Just one more thing, please! Those three paintings in the studio...\nVera:\n...I painted those, as part of my work...\nTrucy:\nRight. See, we checked them out and we saw what was underneath. We saw the rough sketches underneath the three finished paintings...\nVera:\n...I see... ...... ...Mr. Justice...\nApollo:\n...Yes!?\nVera:\n...Father... He knew of you... ...Of both of you...\nApollo:\nYour late father...?\nVera:\n...He was watching, gathering information... ...All about the \"Wright & Co. Law Offices\"...\nTrucy:\nB-But lately, we're not doing just law...!\nVera:\n...Yes... You do tricks, gags to amuse... and play piano...\nTrucy:\nWell, they're not really \"gags\"...\nVera:\n...Yet when Father heard you had resumed the legal business... ...How pleased he was...\nTrucy:\n...Who was Mr. Misham?\nApollo:\n...How'm I supposed to know?\nTrucy:\nWhat if he was Daddy's Daddy?\nApollo:\nJudging from the relative ages involved, I'd say it's highly unlikely. (Things are already confusing enough with all these daddies running around. We know that the victim's daughter, Vera, was the forger. What does this mean for the case...? Guess we're about to find out.)\nOctober 8, 1:36 PMDistrict CourtCourtroom, No. 3\nJudge:\nCourt is now back in session.\nVera:\n......\nApollo:\n(Vera seems pretty tense. She's practically chewing her fingernails clean off!)\nKlavier:\nPerhaps you could begin by telling us how it all worked. How did you set up this \"Drew Misham forger\" persona?\nVera:\n...... ......\nApollo:\n(There's that stare again... She's drilling more holes into his head.)\nTrucy:\nI know it's hard for you, but hey, he's a handsome guy.\nApollo:\nWhat's \"hard\"!?\nJudge:\nVery well, miss, if you would... ...did you really make those detestable forgeries...?\nVera:\n...!\nKlavier:\nPerhaps you'd rather answer my question? Were you the one who painted that painting. The remarkably similar one?\nVera:\n...Ah... Yes... ...I painted it, yes... ...Father praised me quite highly for it...\nJudge:\nSo... she was the one who made the forgeries.\nKlavier:\nYet, she did not wish to reveal the truth of their operation. So the victim was a stand-in, a decoy. To the world at large, he was the forger, not her.\nVera:\n...... ...I've done... a bad thing. I have, haven't I...?\nKlavier:\nRegardless, we need a little more information. About, for instance... ...this!\nApollo:\n...!\nKlavier:\n...You have seen this before, ja?\nVera:\n...Y-Yes... It was in the desk drawer...\nJudge:\nVery well, you may proceed with your testimony. Tell us everything you know about this envelope.\nWitness Testimony\n-- The Red Envelope --\nVera:\n...I created things and Father sold them...\n...This envelope came after my first work... that was other than a painting...\n...Father handled the deal, all of it...\n...I received the stamp that was in that envelope...\n...It was after that job that we moved to the current studio...\nJudge:\nHmm... There certainly was much of great interest in your testimony.\nKlavier:\n...Not that the witness realizes it.\nJudge:\nVery well, please begin the cross-examination!\nApollo:\nRight! OK! (I need more information about this \"forger\"... ...This \"Drew Misham\"...)\nCross Examination\n-- The Red Envelope --\nVera:\n...I created things and Father sold them...\nPress\nApollo:\nApollo:\nSo, these \"things\" you were making, er... ...you mean paintings identical to other paintings, right?\nVera:\n...The closer they were, the happier Father was... ...I was happy, too...\nJudge:\nStill, you're quite young now. When did you begin this work?\nVera:\n...My first painting sold when I was twelve...\nApollo:\n...Your Honor! She had no idea what she was doing was illegal!\nKlavier:\nKlavier:\n...Easy there, little attorney. You're not here to defend her for the crime of forgery.\nJudge:\nHmm... true. Please, tell us more about this envelope. ...This envelope that may very well have killed your father.\nVera:\n...Alright...\nPress (after pressing second, fourth, and fifth statements, before adding statement)\nApollo:\nApollo:\nSo, these \"things\" you were making, er... ...you mean paintings identical to other paintings, right?\nVera:\n...The closer they were, the happier Father was... ...I was happy, too...\nJudge:\nStill, you're quite young now. When did you begin this work?\nVera:\n...My first painting sold when I was twelve...\nApollo:\n...Your Honor! She had no idea what she was doing was illegal!\nKlavier:\nKlavier:\n...Easy there, little attorney. You're not here to defend her for the crime of forgery.\nJudge:\nHmm... true. Please, tell us more about this envelope. ...This envelope that may very well have killed your father.\nVera:\n...Alright...\nJudge:\nSo... you really didn't know anything, did you? You had no idea how much danger you were in.\nKlavier:\nApparently not.\nApollo:\n...... About this \"commemorative stamp\". Could you tell us more about it?\nVera:\n...... ...It was very pretty. And, more than that...\nApollo:\nYes?\nVera:\n...It was a picture of people I liked at the time...\nApollo:\n...! (This is something new!)\nKlavier:\n...Apparently, we've got some cross-examination yet ahead of us. If you would be so kind as to continue your testimony, Fräulein.\nVera:\n......\nAdds statement \"...The stamp was a picture of my favorite magicians... so I kept it...\"\nVera:\n...This envelope came after my first work... that was other than a painting...\nPress\nApollo:\nApollo:\nBy \"other than a painting\", you mean... ...you'd only done paintings up to that point?\nVera:\n...Yes... ...But Father had a realization... ...He noticed my talent extended to making things other than paintings...\nApollo:\nFor instance...?\nVera:\n...For instance... a letter someone had written... ...Or a fingerprint left upon a cup... ...Or a signature on a document... a seal upon a letter...\nApollo:\n(...None of this makes her sound very innocent at all!)\nKlavier:\nAnd the $100,000 promised in this letter was the start. ...The beginning of a new industry for Drew Misham.\nJudge:\nA new... \"industry\"?\nKlavier:\nThe creation of items to be used in criminal proceedings. ...Forging evidence, in other words.\nApollo:\n(Uh oh...)\nPress (after pressing first, fourth, and fifth statements, before adding statement)\nApollo:\nApollo:\nBy \"other than a painting\", you mean... ...you'd only done paintings up to that point?\nVera:\n...Yes... ...But Father had a realization... ...He noticed my talent extended to making things other than paintings...\nApollo:\nFor instance...?\nVera:\n...For instance... a letter someone had written... ...Or a fingerprint left upon a cup... ...Or a signature on a document... a seal upon a letter...\nApollo:\n(...None of this makes her sound very innocent at all!)\nKlavier:\nAnd the $100,000 promised in this letter was the start. ...The beginning of a new industry for Drew Misham.\nJudge:\nA new... \"industry\"?\nKlavier:\nThe creation of items to be used in criminal proceedings. ...Forging evidence, in other words.\nApollo:\n(Uh oh...)\nJudge:\nSo... you really didn't know anything, did you? You had no idea how much danger you were in.\nKlavier:\nApparently not.\nApollo:\n...... About this \"commemorative stamp\". Could you tell us more about it?\nVera:\n...... ...It was very pretty. And, more than that...\nApollo:\nYes?\nVera:\n...It was a picture of people I liked at the time...\nApollo:\n...! (This is something new!)\nKlavier:\n...Apparently, we've got some cross-examination yet ahead of us. If you would be so kind as to continue your testimony, Fräulein.\nVera:\n......\nAdds statement \"...The stamp was a picture of my favorite magicians... so I kept it...\"\nVera:\n...Father handled the deal, all of it...\nPress\nApollo:\nApollo:\nSo, you didn't know how the things you were making were being used?\nVera:\n...I enjoy painting very much...\nKlavier:\nI think I understand. The Fräulein has lived in an... unusual little world.\nApollo:\nCan you tell us what happened to the \"papers\" that were in this envelope?\nVera:\n...Father signed them and sent them back I believe...\nApollo:\nUm... did he follow the instructions? \"Send in the enclosed envelope with the enclosed stamp\"...\nVera:\n......\nJudge:\nThis is a rather important matter! Give your answer some thought.\nVera:\n...I received the stamp that was in that envelope...\nPress\nApollo:\nApollo:\nWhat do you mean, you \"received\" it!?\nVera:\n...Did I do something wrong...?\nApollo:\nY-You didn't use that stamp because it was dangerous, correct!? Deadly poison! On the back! Atroquinine...!\nKlavier:\nKlavier:\n...A moment, Herr Forehead.\nApollo:\n...!\nKlavier:\nYou can't force an answer upon the witness. Now then. Perhaps... you would tell me, Fräulein Vera? Why did you \"receive\" this stamp?\nVera:\n......\nJudge:\nIs something wrong?\nVera:\n...It was... beautiful...\nJudge:\n...Ah. You mean it was one of those commemorative stamps?\nVera:\n...Yes, I think it was...\nApollo:\nSo... you didn't know about the poison?\nVera:\n......\nApollo:\n...... (I guess not!)\nKlavier:\nSo the trap failed by chance... by mistake. Thanks to this commemorative stamp.\nJudge:\nHmm. Quite the close call!\nPress (after pressing first, second, and fifth statements, before adding statement)\nApollo:\nApollo:\nWhat do you mean, you \"received\" it!?\nVera:\n...Did I do something wrong...?\nApollo:\nY-You didn't use that stamp because it was dangerous, correct!? Deadly poison! On the back! Atroquinine...!\nKlavier:\nKlavier:\n...A moment, Herr Forehead.\nApollo:\n...!\nKlavier:\nYou can't force an answer upon the witness. Now then. Perhaps... you would tell me, Fräulein Vera? Why did you \"receive\" this stamp?\nVera:\n......\nJudge:\nIs something wrong?\nVera:\n...It was... beautiful...\nJudge:\n...Ah. You mean it was one of those commemorative stamps?\nVera:\n...Yes, I think it was...\nApollo:\nSo... you didn't know about the poison?\nVera:\n......\nApollo:\n...... (I guess not!)\nKlavier:\nSo the trap failed by chance... by mistake. Thanks to this commemorative stamp.\nJudge:\nHmm. Quite the close call! So... you really didn't know anything, did you? You had no idea how much danger you were in.\nKlavier:\nApparently not.\nApollo:\n...... About this \"commemorative stamp\". Could you tell us more about it?\nVera:\n...... ...It was very pretty. And, more than that...\nApollo:\nYes?\nVera:\n...It was a picture of people I liked at the time...\nApollo:\n...! (This is something new!)\nKlavier:\n...Apparently, we've got some cross-examination yet ahead of us. If you would be so kind as to continue your testimony, Fräulein.\nVera:\n......\nAdds statement \"...The stamp was a picture of my favorite magicians... so I kept it...\"\nVera:\n...It was after that job that we moved to the current studio...\nPress\nApollo:\nApollo:\nYou mean you moved to where the current \"Drew Studio\" is?\nVera:\n...Yes... we saw very few people there... ...I began drawing picture books...\nKlavier:\nThis single job had tied them to the criminal underworld. I'd think Mr. Misham wished to reduce their visibility in the world at large.\nVera:\n...When we had to meet someone for some reason... ...Father posed as the creator of the work...\nApollo:\nSo that was the real essence of the artist, \"Drew Misham\". You did the work, and he supplied the face.\nPress (after pressing first, second, and fourth statements, before adding statement)\nApollo:\nApollo:\nYou mean you moved to where the current \"Drew Studio\" is?\nVera:\n...Yes... we saw very few people there... ...I began drawing picture books...\nKlavier:\nThis single job had tied them to the criminal underworld. I'd think Mr. Misham wished to reduce their visibility in the world at large.\nVera:\n...When we had to meet someone for some reason... ...Father posed as the creator of the work...\nApollo:\nSo that was the real essence of the artist, \"Drew Misham\". You did the work, and he supplied the face.\nJudge:\nSo... you really didn't know anything, did you? You had no idea how much danger you were in.\nKlavier:\nApparently not.\nApollo:\n...... About this \"commemorative stamp\". Could you tell us more about it?\nVera:\n...... ...It was very pretty. And, more than that...\nApollo:\nYes?\nVera:\n...It was a picture of people I liked at the time...\nApollo:\n...! (This is something new!)\nKlavier:\n...Apparently, we've got some cross-examination yet ahead of us. If you would be so kind as to continue your testimony, Fräulein.\nVera:\n......\nAdds statement \"...The stamp was a picture of my favorite magicians... so I kept it...\"\nVera:\n...The stamp was a picture of my favorite magicians... so I kept it...\nPress\nApollo:\nApollo:\nM-Magicians...?\nVera:\n...I love mysterious things, I always have...\nTrucy:\n...Even though she fainted when she saw Mr. Hat.\nApollo:\nYou're confusing \"mysterious\" with \"freaky\".\nVera:\n...Father took me when I was very young... ...It was a great magic show. I loved it so much...\nTrucy:\nSee!? See!? Isn't magic great?\nApollo:\nFine, great, yeah, sure. No need to get all excited.\nVera:\n...But the magic troupe we saw disbanded soon after... ...I was quite sad...\nApollo:\n...... (Did she just say what I think she said? Magic \"troupe\"? Now where have I heard that before...?)\nPresent Magic Show Ticket\nApollo:\nLeads to:\n\"Those magicians you liked, was it this bunch!?\"\nApollo:\n(The red envelope came after she'd completed her first \"job\"... That makes it a letter from her client... whoever wanted a forgery made.)\nTrucy:\nApollo...!\nApollo:\nWe're close. We just have to piece together the parts: A deadly weapon in a red envelope... ...and the path it took to take Drew Misham's life.\nApollo:\nThose magicians you liked, was it this bunch!?\nVera:\n......\nTrucy:\nApollo! They're not a \"bunch\"!\nJudge:\nHmm... I see! Still, I have to wonder. Why include a commemorative stamp like that in a business letter?\nApollo:\nGood question!\nTrucy:\nWell, pretty stamps are always better, and you can't beat Troupe Gramarye!\nJudge:\nBut, the whole murder plan was a failure because of it. Ironic, don't you think. ...Prosecutor Gavin?\nKlavier:\n......\nJudge:\n...Prosecutor Gavin?\nKlavier:\n...... Gram... Gram... Gramarye.\nApollo:\n(What's with Gavin...?)\nKlavier:\n...Might I ask just one question of this witness?\nVera:\n...?\nKlavier:\nIn your testimony just now, you stated... ...this was your \"first work that was other than a painting\".\nVera:\n......\nKlavier:\nPlease, tell me... ...what exactly did you make?\nVera:\n...... ...Can I ask why--\nKlavier:\nNo! Answer the question! ...Now!\nVera:\nEeeeeeeeeek!\nJudge:\nP-Prosecutor Gavin...? You're usually not the one whose volume concerns me.\nKlavier:\n...Yes, it is unbecoming of me. I apologize. But... I must know. Please, Ms. Misham, tell me.\nVera:\n...... ...It was... a book... ...A single page... In a \"book\"...\nKlavier:\nA \"book\"...? Please be more specific.\nVera:\n...... ...It was a handwritten book. Like... Like a diary...\nKlavier:\n...... Nnnno! I don't... No!!!\nTrucy:\nWh-What's wrong with Prosecutor Gavin? He looks like he just saw a ghost!\nKlavier:\n...Ms. Misham. This \"book\"... ...was there a picture of a silk hat on the back cover? Yes or no!?\nVera:\n...! ...How... How did you know...?\nApollo:\nApollo:\n...Prosecutor Gavin! The defendant is answering all of your questions! Stop badgering her!\nKlavier:\n...... He's told you nothing, has he? ...Your soiled, sullied mentor. Nothing!?\nApollo:\nSullied... who?\nKlavier:\nPhoenix Wright. Who else!?\nTrucy:\n...Daddy?\nKlavier:\nHe never told you about the trial, seven years ago? About how he came to lose his attorney's badge...\nApollo:\n...!\nKlavier:\nIt was a certain piece of evidence that decided his fate, you know. ...A certain diary. On the back, it bore the mark of a silk hat.\nApollo:\n...Whaaaaaat!? (Phoenix Wright, tossed out of the profession by false evidence... And the forger who made that evidence... ...is this girl standing right in front of me!?) Vera! You must tell us! The evidence you made was used in a trial seven years ago. Who asked \"Drew Misham\", you, to forge that evidence!? ...For all of our sakes, who was it!?\nVera:\n...... ...We... only met once...\nApollo:\nYou... You met the client!? Well, who was it!?\nVera:\n...It was... ...It was... ......\nTrucy:\nWhat's going on with Vera? She's staring at Prosecutor Gavin's face again...\nKlavier:\nYes, what? Is there something about me...?\nVera:\n...... ...I remember clearly... ...I remember who gave me the book... the diary... ......\nApollo:\nWho was it!?\nVera:\n...... Ugh...! *choke*...!\nApollo:\nVe... Vera!!!\n...The... De... vil......*thump*...\nDefendant Vera Misham -- Condition: unconscious. Examiner's diagnosis: Acute atroquinine poisoning.\n...This ends the recording of the trial for the murder of Drew Misham. Vera Misham was, during the trial, poisoned by an unknown assailant. The dosage was just under the lethal amount, sparing the defendant's life. She is currently in intensive care, and is not to be disturbed for any reason. ...A very simple case, at first glance... ...until it finally began to show its true colors. The long road to the truth takes us to the record of another trial. In some ways, that was the starting point of it all. And that is where we must go... ...to find the whole truth.\nTo be continued.\nPresenting wrong evidence during testimony\nApollo:\nApollo:\nThe witness's statement is clearly faulty, Your Honor!\nJudge:\n... I'm sorry, but I can see nothing faulty. Unfortunately, I will have to penalize you, Mr. Justice.\nApollo:\n(Ugh. I must be on the wrong track...)\nPresenting wrong evidence during testimony\nApollo:\nApollo:\nYour Honor! That statement contradicts this evidence!\nJudge:\n...? It does? I don't see anything contradictory...\nApollo:\n...Um... You sure about that?\nJudge:\nObjection overruled. Try to think before you make accusations, Mr. Justice!\nApollo:\n(Ack! That didn't go so well.)\nPresenting wrong evidence during testimony\nApollo:\nApollo:\nThis evidence clearly reveals a contradiction in that statement, Your Honor!\nJudge:\nHow exactly are the evidence and the statement just now related?\nApollo:\nThey aren't, are they...?\nJudge:\nNot at all. Mr. Justice, please think the facts over before making accusations.\nApollo:\n(I don't think that won me any points with the judge...)\nPresenting wrong evidence during testimony\nApollo:\nApollo:\nYour Honor! What do you think about the witness's statement?\nJudge:\nUh... I'm not sure I follow you.\nApollo:\nIt clearly, er, contradicts the... um... I thought...\nJudge:\n...You don't sound very sure, Mr. Justice. Objection overruled.\nApollo:\n(I don't think that won me any points with the judge...)\nPerceive wrong area (during cross-examination segment \"The Scent of a Story\")\nApollo:\nApollo:\nMr. Brushel! You're hiding something!\nBrushel:\nYooooooooooooooooooowrk! Dontyellallofasuddenlikethat! You'll give a guy a heart attack...\nApollo:\nAck! Sorry! It's just... the way you were moving just now. It was particularly suspicious.\nBrushel:\nWhat's that supposed to mean!? So usually I'm just sort of \"averagely\" suspicious?\nApollo:\n...Sorry. My mistake. You're fine. (I know I'm on to something here. Time to focus!)\nToo many penalties\nJudge:\nThat's enough! I see no need to further prolong this trial. The defense's case is insufficient to overturn the prosecution's claims! This court finds the defendant, Vera Misham...\nGuilty\nJudge:\nThe defendant will surrender herself to the court's care... ...to undergo a regular trial at the High Court within a month's time. Court is adjourned!",
  "characters": [
    {
      "currentChapter": "Turnabout Succession",
      "name": "Phoenix Wright",
      "age": "33",
      "gender": "Male",
      "description1": "A pianist who can't play a lick. Formerly an ace defense attorney of some renown."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Trucy Enigmar → Trucy Wright",
      "age": "8 → 15",
      "gender": "Female",
      "description1": "Future star magician, and Phoenix Wright's daughter. Fond of her Mr. Hat trick.",
      "description2": "Zak Gramarye's daughter. Already dresses the part of a magician to the hilt.",
      "description3": "Future star magician, and Phoenix Wright's daughter. Fond of her Mr. Hat trick."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Vera Misham",
      "age": "12 → 19",
      "gender": "Female",
      "description1": "My client, apparently. I know nothing other than her name and mailing address.",
      "description2": "The defendant. Accused of poisoning her father, Drew Misham.",
      "description3": "Arrested on suspicion of poisoning her father, Drew Misham. Currently on trial."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Ema Skye",
      "age": "25",
      "gender": "Female",
      "description1": "Detective obsessed with forensics. In charge of the initial investigation."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Drew Misham",
      "age": "45 → 52",
      "gender": "Male",
      "description1": "Painter known for his illustrations. Poisoned at Drew Studio.",
      "description2": "Painter. Summoned to this trial by the authority of Prosecutor Gavin.",
      "description3": "Painter known for his illustrations. Poisoned at Drew Studio."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Valant Gramarye",
      "age": "37 → 44",
      "gender": "Male",
      "description1": "Popular stage magician. His overly loquacious manner can get annoying.",
      "description2": "Zak's young partner and understudy. The two of them on stage was a sight to see.",
      "description3": "The most popular stage magician today. Once performed with his partner, Zak."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Spark Brushel",
      "age": "29 → 36",
      "gender": "Male",
      "description1": "Freelance journalist. Can smell a scoop from miles away."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Klavier Gavin",
      "age": "17 → 24",
      "gender": "Male",
      "description1": "Star prosecutor and leader/vocalist for the rock group, the Gavinners."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Shadi Enigmar → Zak Gramarye",
      "age": "40 → 47",
      "gender": "Male",
      "description1": "My client in this case. Usually goes by his stage name, \"Zak Gramarye\".",
      "description2": "Trucy's father. Defendant in a trial, vanished just before the verdict was announced."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Magnifi Gramarye",
      "age": "67 → deceased",
      "gender": "Male",
      "description1": "The victim in this case. Died after being shot in the head while in the hospital.",
      "description2": "Founder of Troupe Gramarye, and a great magician. Mentor to Zak and Valant."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Dick Gumshoe",
      "age": "32",
      "gender": "Male",
      "description1": "Homicide detective at the local precinct. In charge of the initial investigation."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Apollo Justice",
      "age": "15 → 22",
      "gender": "Male",
      "description1": "A greenhorn defense attorney I happened to meet. I call him Apollo."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Kristoph Gavin",
      "age": "25 → 32",
      "gender": "Male",
      "description1": "Incarcerated at the Central Penitentiary for the murder of Shadi Smith."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Thalassa Gramarye",
      "age": "33 → 40",
      "gender": "Female",
      "description1": "Trucy's mother. Still missing after her sudden disappearance.",
      "description2": "Trucy's mother, and the daughter of Magnifi Gramarye. Whereabouts currently unknown."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Mike Meekins",
      "age": "24 → 31",
      "gender": "Male",
      "description1": "Bailiff responsible for security at the trial where Zak Gramarye vanished."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Shadi Smith",
      "age": "47",
      "gender": "Male",
      "description1": "In reality, the magician Zak. Murdered at Russian eatery: the Borscht Bowl Club."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Succession",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "How long did I yearn for one of these? Just putting it on makes me feel... ready.* (when playing as Apollo Justice)",
      "description2": "It's my all-important badge. It shows that I am a defense attorney.* (when playing as Phoenix Wright)"
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Magic Show Ticket",
      "type": "Other",
      "obtained": "Received from Trucy Wright.",
      "description1": "For premier showing of a grand illusion, to be performed by the magician, Valant Gramarye."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Gramarye Envelope",
      "type": "Documents",
      "obtained": "Received from Phoenix Wright.",
      "description1": "Envelope from Mr. Wright. Do not open until the time is right."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Vera's Card",
      "type": "Documents",
      "obtained": "Received from Vera Misham.",
      "description1": "Defendant's business card. The address for Drew Studio is on the front."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Portrait",
      "type": "Other",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "Obtained at Drew Studio. That bit in the middle is supposed to be a person."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Acrylic",
      "type": "Other",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "Obtained at Drew Studio. An undersea scene in vivid colors."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Landscape",
      "type": "Other",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "Obtained at Drew Studio. Only half finished, the rough sketch is still visible."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Coffee Mug",
      "type": "Evidence",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "The victim's last mug of coffee. The scrawl on the side is Drew Misham's signature.",
      "description2": "Traces of the slow-acting deadly poison atroquinine were found on the rim."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Hidden Painting",
      "type": "Other",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "Found at Drew Studio. Notable for the large peach in the foreground."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Red Envelope",
      "type": "Documents",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "Found in the victim's desk drawer. Appears to have been opened once and resealed.",
      "description2": "Found in the victim's desk drawer. Contains two sheets of writing paper."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Letter Box",
      "type": "Other",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "Drew Misham's contact with the outside world. It's empty."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Tiny Frame",
      "type": "Evidence",
      "obtained": "Retrieved from Drew Studio.",
      "description1": "Frame measuring two inches by two inches. Bears traces of deadly poison atroquinine."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Brushel's Card",
      "type": "Documents",
      "obtained": "Received from Ema Skye.",
      "description1": "This business card reads \"Spark Brushel, Freelance Journalist\"."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Misham's Autopsy Report",
      "type": "Reports",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "Death by atroquinine poisoning. Estimated time of death: 9:00-9:30 PM."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Crime Photo",
      "type": "Photographs",
      "obtained": "Received during the preliminary hearing.",
      "description1": "Body found in hospital room, shot in the forehead. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Magnifi's Autopsy Report",
      "type": "Reports",
      "obtained": "Received during the preliminary hearing.",
      "description1": "Cause of death: single gunshot to the head. Estimated time of death: 11:00-11:30 PM."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Notebook Page",
      "type": "Documents",
      "obtained": "Received from Trucy Enigmar.  → Submitted as evidence by Prosecutor Gavin.",
      "description1": "Mysterious paper received just before the trial. Click here for details.",
      "description2": "Forged to look like a page of Magnifi's diary. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Magnifi's Chart",
      "type": "Documents",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "Diagnosed with a malignant tumor. Given 3 months. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Small Syringe",
      "type": "Evidence",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "Used for administering insulin shots. Has been washed and shows no sign of use."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Magnifi's Letter",
      "type": "Documents",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "Letter asking Zak to shoot him. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Stage Pistol",
      "type": "Weapons",
      "obtained": "Submitted as evidence by Detective Gumshoe.",
      "description1": "Fires one real bullet. Rifling marks match bullet found in victim. No fingerprints found."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Magnifi's Letter 2",
      "type": "Documents",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "Letter telling Valant to come at 11:20 PM. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "IV Report",
      "type": "Reports",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "IV stopped 10 min. after administration began. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Magnifi's Diary",
      "type": "Documents",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "A memoir of sorts. Written in up to just before he died."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "The Amazing Mr. Hat",
      "type": "Other",
      "obtained": "Received from Trucy Enigmar.",
      "description1": "Trucy's favorite trick. Startlingly realistic."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Trucy's Locket",
      "type": "Other",
      "obtained": "Received from Trucy Enigmar.",
      "description1": "Contains a photo of Trucy's mother, Thalassa."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Transferal of Rights",
      "type": "Documents",
      "obtained": "Received from Shadi Smith.",
      "description1": "Document tranferring the right to perform the Gramarye repertoire to daughter Trucy."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Nail Polish",
      "type": "Other",
      "obtained": "Received from Solitary Cell 13.",
      "description1": "Retrieved from Kristoph Gavin's cell. The nail polish is colorless."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Commemorative Stamp",
      "type": "Other",
      "obtained": "Received from Drew Studio.",
      "description1": "Commemorative stamp showing Troupe Gramarye. Click here for details.",
      "description2": "Sent from the real \"client\". Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Thalassa's Portrait",
      "type": "Other",
      "obtained": "Received from Spark Brushel.",
      "description1": "Photo of a young Thalassa, Trucy's mother. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Zak's Confession",
      "type": "Documents",
      "obtained": "Received from Shadi Smith.",
      "description1": "Confession to the slaying of Magnifi Gramarye. Click here for details."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Letter from Misham",
      "type": "Evidence",
      "obtained": "Retrieved from Solitary Cell 13.",
      "description1": "Letter posted by Drew Misham just before dying. Poison traces found on the stamp."
    },
    {
      "currentChapter": "Turnabout Succession",
      "name": "Letter from Mr. Wright",
      "type": "Evidence",
      "obtained": "Received from Phoenix Wright.",
      "description1": "Reproduction of information found by Mr. Wright during his investigation."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "Turnabout Succession\n\n\n\n\n\n\n\n\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 4\n\nPart 5...Showdown time.I... I lost.It's only a game of poker.A game I've played for a long time... and only lost twice....Who was the first?The man I \"killed\"... of course..........Well. It seems I've found the partner I've been looking for all along....Over a game of cards?Why, yes. Over a game of cards.Phoenix:\nThat was how we first met. ...Seven years ago.-- Seven Years Earlier --Phoenix Wright's Final TrialApril 19, 9:27 AMDistrict CourtDefendant Lobby No. 2Examine evidence\n\n\n\n\n\n\n\n\n\nAttorney's Badge\n\n\n\n\n\n\n\n\n\nBack side\n\n\n\n\n\n\n\nPhoenix:\nEach attorney's badge has a number engraved on the back. No two numbers are the same. So if you drop it, people will know it was you. Better make sure I don't lose mine.Phoenix:\n(Whew, OK. It's been a long time since I've felt like such a rookie. Got to try and relax.) Ah, good morning, Mr. Enigmar.Enigmar:\nI'm... sorry to have sprung this on you so suddenly.Phoenix:\nI received the files from your previous attorney only yesterday. Honestly, I'm not entirely sure I'm prepared.Enigmar:\n...I understand I am asking the impossible of you.Phoenix:\nYes, well, you haven't really told me what happened yet! All we did... was play cards.Enigmar:\nAnd that was enough.Phoenix:\n(Actually, it wasn't. Trust me.)???:\nOoh! Morning, Daddy!Enigmar:\nAh, I'm so glad you came.???:\nYou OK, Daddy? They picking on you?Enigmar:\nHa ha ha ha ha ha ha. I am fine, as always. This old boy is here to help me, after all.Phoenix:\n(That's \"young man\" to you.) Good morning. That's a cute outfit you have on.???:\nThanks! My first show's today, after all!Phoenix:\nOh, I'm sure it is! (What the heck is she talking about?)???:\nOh... Old boy!Phoenix:\nHuh? Me? (Look what he's started.)???:\nUm, uh... Here.Phoenix:\nWhat's this...????:\nI dunno! I just got it over there in the hall. They told me to give it to the \"old boy in the blue suit with the spiky hair\". They said it was really important!Enigmar:\n...What's this? A memo for you or some such?Phoenix:\nHmm... Not from the looks of it. (What is this? Looks like a page from someone's diary.) I'll give it a read later.Notebook Page added to the Court Record.Enigmar:\nWell, how do you feel about the trial today?Phoenix:\nWe'll get through it. Somehow. Incidentally... the prosecutor today is a new guy, I hear.Enigmar:\nAh... An easy win, then, yes?Phoenix:\nThey're calling him a \"true thoroughbred in the history of the prosecutor's office\". ...Of course, there's one of those every year.Enigmar:\n...The switching of attorneys just before the trial... ...I know it is a difficult situation I put you in. But... allow me to say one thing, Mr. Wright.Phoenix:\n...Yes?Enigmar:\nThey will not be able to pronounce me guilty today. So, do your best, but do not worry.Phoenix:\n(First time a defendant's ever given me a pep speech...) I'll do what I can.Enigmar:\nHa ha ha ha ha ha ha. I see you do not understand. You see, it will be impossible for them to declare a verdict.Phoenix:\nI-Impossible?Enigmar:\nYes. Isn't that right, Trucy?Trucy:\nYup! You bet, Daddy.Phoenix:\n(My first look at the case was only yesterday. And the information I was given was a tad bit lacking, to be honest. Still, I'll do what I can. ...For their sake.)Enigmar:\nI believe the curtains will be lifting any time now. I am in your capable hands, Mr. Wright.Phoenix:\nMy client is Shadi Enigmar. Known to the world as Zak Gramarye. A wildly popular magician, star of Troupe Gramarye. His mentor, Magnifi Gramarye, was a rare breed of magician. He single-handedly ushered in a golden age of stage magic... until he was shot dead. And Zak Gramarye is the suspect.April 19, 10:00 AMDistrict CourtCourtroom No. 7Judge:\nCourt is now in session for the trial of Shadi Enigmar.Phoenix:\nThe defense is ready, Your Honor.???:\n......Judge:\nIs the prosecution ready????:\nI was just thinking, is this what all the fuss is about? Bit of a buzz-kill, really.Judge:\n\"Buzz-kill\"...? Is this some new kind of crime????:\nOne of the worst. This is a trial, ja? Where are the sweaty palms? The pounding hearts? A Gavinners concert's got ten times the thrill this gig's got.Judge:\nWho... were you, again?Klavier:\nKlavier. Klavier Gavin. I came... to get the party started. Legally, ja?Judge:\nGavin? Defense Attorney Kristoph Gavin's...?Klavier:\nAh, figures my bro's more famous in this part of town.Phoenix:\n(Klavier Gavin... Lead singer for the megahit band, the Gavinners. You're out of your league, rock-boy.)Klavier:\nI know what you're thinking: \"You're out of your league, rock-boy.\"Phoenix:\n......Klavier:\nTrue, my debut single, \"13 Years Hard Time for Love\", went platinum overnight... ...but that's just a hobby to me compared to this, ja?Phoenix:\n...Talkative, aren't you? I like your affected Euro-rock accent, by the way.Klavier:\nI'm just getting warmed up, Herr Attorney Wright.Judge:\nPerhaps you would be so kind as to fill us in on the case?Klavier:\n...Achtung, baby. Time to call on the opening act. ...What was his name again? Ah yes... Detective Gumshoe! Hit it!Klavier:\n...And you are?Gumshoe:\nHey, you were the one who called me up here... sir. Name's Dick Gumshoe. I'm a homicide detective down at the precinct.Phoenix:\n(Detective Gumshoe... Long time no see.)Gumshoe:\nHey, you!Phoenix:\nH-Huh? Me?Gumshoe:\nToday's the day, pal. Today, I win, and you lose! I got confidence in my testimony today, see.Phoenix:\n(What, you normally lack confidence in your testimony...?)Klavier:\n...Herr Detective, this is my stage. Can the antics.Gumshoe:\nHuh...?Klavier:\nAll this \"hey you\"-ing and such. And I could care less about your history together.Gumshoe:\nUrk.Judge:\n...Very well, Detective Gumshoe, if you would. Please tell us about the case at hand.Gumshoe:\nIt happened six days back, in a room at the General Hospital! The facts are as simple as they come. Here's the crime scene. The victim was a patient, asleep in a hospital bed. The killer comes in, puts a pistol to his forehead, and bam. Lights out. ...Them's the facts.Judge:\nHmm... Not so long ago, the victim, Magnifi Gramarye was a famous man. He had the entire country under his \"magical spell\", as it were.Klavier:\nAh yes, the great magician. He retired years ago, though. Say the name \"Magnifi\" to one of my generation... and you'd be lucky to get a blank stare.Judge:\nYes, though I'm sure the youngsters today know his disciples even better. I daresay Troupe Gramarye has made quite a name for themselves.Gumshoe:\nAnyhow, the retired Magnifi's been in the hospital for the last year. Hmm, what was it? A mall-ignorant tutor or something. Doing something to his liver, I think. Yeah.Judge:\nA \"malignant tumor\", perhaps?Klavier:\nIn other words, he had liver cancer. He had only three months left to live, in fact.Magnifi's Chart added to the Court Record.Judge:\nHmm... The facts do seem simple enough. But... something's not right.Klavier:\n...The victim was already climbing a three-month stairway to heaven. ...Why not wait for him to knock-knock-knock on heaven's door? Why shoot him?Phoenix:\n(I wouldn't have put it quite so lyrically, but it's true. Why make the effort to commit murder when the victim was about to die?)Gumshoe:\nIncidentally, the victim had a serious case of diabetes.Phoenix:\nDiabetes?Klavier:\nIn fact, he was about to \"shoot up\" with insulin... ...when he was shot with a pistol. The syringe was found at the crime scene. Chronic diabetes... and cancer. As much as it pains me to say it... ...the victim was clearly at the end of his life.Small Syringe added to the Court Record.Examine evidence\n\n\n\n\n\n\n\n\n\nSmall Syringe\n\n\n\n\n\n\n\n\n\nSyringe barrel\n\n\n\n\n\n\n\nPhoenix:\n...I always hated getting shots. I guess Magnifi was giving himself the insulin shots... There's no way I could do that... *shudder* ...! Wait! If Magnifi used this to inject his insulin... ...why are there no traces of it having been used? Hmm... Something to keep in mind.Judge:\nHmm... I believe the question before us is clear, then. Why did the killer have to shoot this dying man? What reason could he have had?Klavier:\n...Very well, Detective. Perhaps you can enlighten us as to the circumstances of the shooting.Gumshoe:\nY-Yes, sir!Witness Testimony-- The Circumstances --Gumshoe:\nActually... the victim kind of ordered the defendant to do him in.\nA few days before it happened, the victim sent a letter \"ordering\" his own murder.\nThe defendant did what was asked of him, and shot the old man in the forehead!\nThe bullet was fired from the pistol found at the scene, no doubt about it.\nAnd the pistol definitely belonged to the old man, sir!Judge:\nWh-Whaaat!? You're saying the victim ordered his own shooting?Klavier:\nThose are the facts. I have here the letter in question.Magnifi's Letter added to the Court Record.Judge:\n...Very unusual, indeed! Although, could such a thing as a letter really cause one to pull a trigger, I wonder?Klavier:\nI believe the answer to that question can be found at the end of the letter.Judge:\nAh... \"You cannot refuse, and we both know the reason why.\" Detective Gumshoe, can you explain this to the court?Gumshoe:\nUnfortunately, even the defendant won't say a peep about that bit, sir.Phoenix:\nOne thing bothers me about this. Why didn't he just say \"11\"? Why have him come at \"11:05\" without some specific reason...?Klavier:\nThe devil is in the details, Herr Attorney...Judge:\nWell? Was there some reason?Klavier:\nAs it turns out, there was. Every night, for a half hour, starting at 11:00... ...the victim, Magnifi Gramarye, was given an IV.Phoenix:\nAn IV...?Judge:\nThere it is in the picture, off to the side of the bed.Klavier:\nAt 11:00, a doctor would come to set up the IV. Thirty minutes later, he would come back for the empty bag. This happened every night, without fail.Phoenix:\nSo that was the only time they could meet without the chance of an untimely interruption. ...During his IV.Judge:\nVery well, shall we begin? ...Mr. Wright, your cross-examination, if you would!Phoenix:\n(What's this \"reason he couldn't refuse\", I wonder? He could have at least mentioned it to me...)Cross ExaminationCross Examination-- The Circumstances --Gumshoe:\nActually... the victim kind of ordered the defendant to do him in.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nJust because he got the letter doesn't mean he went through with it!\nKlavier:\nOh? I disagree. The victim was, indeed, shot in the forehead, after all. Just as he had commanded.\nPhoenix:\nIt could be a set-up. But let's not be in such a hurry. Maybe we should let the witness talk for a change.\nGumshoe:\n...Thanks, pal.\nKlavier:\n...... Fine. I can play it slow as well as I can play it fast. On with the testimony, Detective Gumshoe.Gumshoe:\nA few days before it happened, the victim sent a letter \"ordering\" his own murder.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n...And this letter was sent by the victim?\nGumshoe:\nThere it is! Gotcha! You're all mine this time, pal.\nPhoenix:\n...Huh?\nGumshoe:\nI had the handwriting checked out, of course. It's the victim's, no mistake!\nPhoenix:\nAh, I see...\nGumshoe:\nHa ha ha ha ha! Score one for the boys!\nPhoenix:\n(I didn't \"lose\". I was just ascertaining the facts. ...So why am I so annoyed?)\nJudge:\nBut... a letter ordering your own death? Things aren't what they used to be, I guess.\nPhoenix:\nI'm not sure this is exactly \"commonplace\", even now, Your Honor.\nGumshoe:\n...So anyway, guess I'll keep going while I'm ahead!Gumshoe:\nThe defendant did what was asked of him, and shot the old man in the forehead!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n...How can you be so sure!?\nGumshoe:\nHey, you gotta learn to stop relying on people to do your thinking for you, pal. Learn to think for yourself! Get that noggin cranking!\nPhoenix:\n(You fail to grasp the concept of \"questioning\", detective.)\nGumshoe:\nFirst, we got this letter. It says \"shoot... in the forehead\" loud and clear.\nPhoenix:\nI can see that. But I still wouldn't do it.\nGumshoe:\nWell, maybe you need to grow yourself a backbone, pal.\nPhoenix:\n(You fail to grasp the concept of \"shooting people is bad\", detective.)\nGumshoe:\nWe also found the defendant's pistol at the scene.\nKlavier:\nTraces of gunpowder residue shows that it had been fired recently.\nJudge:\n...Well, Mr. Wright? As far as I can tell from looking at this photo... ...there seems to be no issue with the prosecution's claim.\nPhoenix:\n(The photo... Maybe there's something in there I can use. So they're saying the defendant \"shot the victim in the forehead\"? I think there's a hole in the prosecution's argument! Clearly, Mr. Enigmar...)\n\n\n\nI have no clue.\n\n\n\n\n\n\n\nPhoenix:\nUnfortunately, nothing in this picture suggests he didn't do it.\nJudge:\nAh, I see. That is unfortunate.\nPhoenix:\n...Huh?\nKlavier:\nWell, let's pay it no mind and carry on, shall we? I like a fast tempo.\nPhoenix:\n...Huh?\nGumshoe:\nHey, I still got stuff to talk about, pal!\nPhoenix:\n(...Everyone's so eager to move on. So of course, I want to slow down. ...Is there really not a single clue in this picture?)\nJudge:\nBack to the testimony, if you would, detective.\nLeads back to cross-examination\n\n\n\n\ndidn't pull the trigger.\n\n\n\n\n\n\n\nPhoenix:\nPeople don't normally commit murder just because their teacher told them to. Which means the defendant didn't fire that pistol!\nKlavier:\n\nKlavier:\n...This is your position, then?\nPhoenix:\nUm, well, yes.\nKlavier:\nThis is the sort of occasion when my brother would present some \"evidence\".\nPhoenix:\n...Ah.\nKlavier:\nDid you have some evidence you wanted to show us? Something proving it wasn't the defendant who shot the old man?\nPhoenix:\n...... ......\nJudge:\nPenalty for excessive perspiration, Mr. Wright!\nPhoenix:\n(But it's a cold sweat, Your Honor...)\nLeads back to cross-examination\n\n\n\n\nshot something else.\n\n\n\n\n\n\n\nPhoenix:\nLooking at this photo, another possibility occurs to me.\nJudge:\nYes...?\nPhoenix:\nWhat does the letter tell us? That the defendant had a \"reason he couldn't refuse\" his teacher's wishes.\nGumshoe:\nBingo, pal! That's why the defendant popped him one in the forehead!\nPhoenix:\nOh? The defense disagrees. You see, the defendant had another choice he could make.\nKlavier:\n\nKlavier:\nWhat, and you can prove that with this photo!?\nPhoenix:\n...I can prove he had a choice, yes.\nJudge:\n\"The defendant might have fired, like he was ordered. But he didn't shoot the victim's forehead.\" Well, let's hear what you're thinking, Mr. Wright. If he didn't shoot the victim's forehead, what did the defendant shoot?\n\n\n\nPresent clown doll's forehead\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\nThe clown doll...?\nPhoenix:\nTake a closer look. See? It's been shot in the forehead, too.\nJudge:\nAh...! There's a hole in its forehead!\nPhoenix:\nYes, and a hole in the prosecution's claim!\nKlavier:\n\nKlavier:\nHah! And I suppose you have a reason as to why he'd shoot the clown doll?\nPhoenix:\nHe didn't just shoot the doll. He shot the doll's forehead.\nKlavier:\nHis \"forehead\"...? Aah...!\nPhoenix:\nLet's read the \"orders\" once more, shall we? \"...You will shoot, one shot, square in the forehead.\" ...Which is exactly what he did. He shot the clown doll square in the forehead!\nJudge:\nThe defense has raised an intriguing possibility. That hole in the clown's forehead... It definitely looks like it was shot! Bailiff! Send someone to investigate this matter!\nKlavier:\n\nKlavier:\nI admit, I'm impressed. But I expected nothing less. Still, this doesn't mean he didn't shoot the victim!\nPhoenix:\n\nPhoenix:\nPerhaps he did have to shoot a forehead, as ordered. But the letter says nothing about whose forehead... This was the only way he had to follow his orders without taking a life!\nJudge:\nHmm. The bullet hole in the clown doll's forehead does demand an explanation. It might very well be a clue. Yet Prosecutor Gavin is right. It alone does not prove the defendant's innocence. You cannot say for sure the defendant didn't shoot the victim.\nKlavier:\nSo sorry, Mr. Wright. How sad it is to see the mighty fall.\nPhoenix:\n(...How sad it is to see the novice's overconfidence. He doesn't realize just how big this little \"hole\" is going to get.)\nJudge:\n...Detective Gumshoe. Please take this new-found fact into account as you continue your testimony.\nAdds statement \"So what if he shot the clown? He still shot the victim, pal!\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\nAh... I see! Which is to say... ...I have no idea what you're talking about. Prosecutor Gavin?\nKlavier:\nThe defendant had a choice other than shooting the victim in the forehead? ...Perhaps I might suggest one. He could have shot this attorney in the forehead!\nPhoenix:\n...Urk!\nJudge:\nAh... I see. Which is to say... ...I still don't see. Still, when in doubt, give a penalty, I always say.\nPhoenix:\n(Ugh. Time to think this one through again.)\nLeads back to cross-examinationPress (after adding statement)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nBut... it might have been the clown's forehead he shot.\nGumshoe:\nOK, so he practiced first on the doll, then shot him!\nPhoenix:\nHe \"practiced\" in the middle of the hospital? Anyone could have come in at any moment!\nGumshoe:\nYeah, but no one did come, did they, pal? Besides, it's what I woulda done. \"Always look before you shoot,\" I say.\nKlavier:\n...Might I suggest we move on? This is getting us nowhere.\nPhoenix:\n(Patience. We'll get there sooner than you think.)\nJudge:\nVery well. Please continue with your testimony, detective.Gumshoe:\nThe bullet was fired from the pistol found at the scene, no doubt about it.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou mean this pistol, the one in the crime scene photo?\nGumshoe:\n...That's the one! It's a funny-looking gun so there's no mistaking it.\nKlavier:\nWe compared the bullet taken from the victim's skull with a bullet fired from this gun. The rifling marks on the bullets were a perfect match.\nPhoenix:\nSo... you verified the murder weapon, in other words.\nGumshoe:\nYou bet we did!Press (after pressing fifth statement, before Stage Pistol is added to the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou mean this pistol, the one in the crime scene photo?\nGumshoe:\n...That's the one! It's a funny-looking gun so there's no mistaking it.\nKlavier:\nWe compared the bullet taken from the victim's skull with a bullet fired from this gun. The rifling marks on the bullets were a perfect match.\nPhoenix:\nSo... you verified the murder weapon, in other words.\nGumshoe:\nYou bet we did!\nJudge:\n...The court would like to see the pistol in question.\nGumshoe:\nYou got it, sir! Here she is!\nJudge:\nWell. This truly is a \"blast\" from the past.\nGumshoe:\nIt's a stage pistol for magic shows, see. But it can fire real bullets.\nJudge:\nHmm. It looks so much bigger in real life than on TV.\nGumshoe:\nYeah, but it can only hold one round. ...By the way, the pistol's firing chamber is empty. ...And it shows traces of having been fired recently.\nPhoenix:\nSo... were any fingerprints found on the gun?\nKlavier:\n...Unfortunately, no. Of course, the defendant is known for wearing gloves. We might say that a lack of fingerprints is, in fact, a \"fingerprint\" of its own.\nJudge:\nAh ha! Intriguing point, well made!\nPhoenix:\nWhoa whoa whoa! Not well made! Not intriguing!\nJudge:\nIn any case, the court accepts this evidence.\nStage Pistol added to the Court Record.\nJudge:\n...My grandchild would get a kick out of seeing this. ...But now it's time to return to our testimony.Examine evidence\n\n\n\n\n\n\n\n\n\nStage Pistol\n\n\n\n\n\n\n\n\n\nChamber\n\n\n\n\n\n\n\nPhoenix:\nIf you look closely, you can see how the pistol's made to bend here. It's a one-shot model, and I guess this bend is where you load it. So... this is the famous Gramarye Golden Sun. They say kids used to love pretending they had one of those. I wonder if they pretended to miss their targets, too?Gumshoe:\nAnd the pistol definitely belonged to the old man, sir!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n...Why are you so certain?\nGumshoe:\nWhat pile of sand has your head been stuck in all this time, pal? You never heard of \"Zak & Valant's Quick-Draw Shootem\"?\nPhoenix:\nHuh? What's that?\nGumshoe:\nOne of the defendant's specialties. Zak and Valant stand on either side of a girl! Then, they shoot! But the bullets don't hit her! Instead, they hit everything else on stage!!! This was one of the pistols they used in their show. Got a great design, huh? The kids love it.\nKlavier:\nMany boys and girls joined the police because of that pistol, I hear.\nPhoenix:\n(You know, that would explain a lot about the police force.)\nGumshoe:\nTroupe Gramarye stopped doing that act a while ago. The old man held on to that pistol ever since.Press (after pressing fourth statement, before Stage Pistol is added to the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n...Why are you so certain?\nGumshoe:\nWhat pile of sand has your head been stuck in all this time, pal? You never heard of \"Zak & Valant's Quick-Draw Shootem\"?\nPhoenix:\nHuh? What's that?\nGumshoe:\nOne of the defendant's specialties. Zak and Valant stand on either side of a girl! Then, they shoot! But the bullets don't hit her! Instead, they hit everything else on stage!!! This was one of the pistols they used in their show. Got a great design, huh? The kids love it.\nKlavier:\nMany boys and girls joined the police because of that pistol, I hear.\nPhoenix:\n(You know, that would explain a lot about the police force.)\nGumshoe:\nTroupe Gramarye stopped doing that act a while ago. The old man held on to that pistol ever since.\nJudge:\n...The court would like to see the pistol in question.\nGumshoe:\nYou got it, sir! Here she is!\nJudge:\nWell. This truly is a \"blast\" from the past.\nGumshoe:\nIt's a stage pistol for magic shows, see. But it can fire real bullets.\nJudge:\nHmm. It looks so much bigger in real life than on TV.\nGumshoe:\nYeah, but it can only hold one round. ...By the way, the pistol's firing chamber is empty. ...And it shows traces of having been fired recently.\nPhoenix:\nSo... were any fingerprints found on the gun?\nKlavier:\n...Unfortunately, no. Of course, the defendant is known for wearing gloves. We might say that a lack of fingerprints is, in fact, a \"fingerprint\" of its own.\nJudge:\nAh ha! Intriguing point, well made!\nPhoenix:\nWhoa whoa whoa! Not well made! Not intriguing!\nJudge:\nIn any case, the court accepts this evidence.\nStage Pistol added to the Court Record.\nJudge:\n...My grandchild would get a kick out of seeing this. ...But now it's time to return to our testimony.Gumshoe:\nSo what if he shot the clown? He still shot the victim, pal!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo let me get this straight. You're saying my client first shot the clown, then shot the victim?\nGumshoe:\nHey! Not a bad summary, pal!\nPhoenix:\n(More of a confirmation than a summary, but whatever.)\nKlavier:\nThat was really more of a confirmation than a summary. But our defense attorney seems pleased enough with himself.\nPhoenix:\n(Do these people ever miss a chance to mock me?)\nKlavier:\nWell, now that Mr. Wright's gotten that out of his system... ...shall we continue with the testimony?Present Stage Pistol\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"The trickiest cases often seem the simplest.\"Phoenix:\n(...I didn't have time to gather all the details before coming in here. This testimony might be my only source of information. Better pay attention... and read this letter carefully.)",
      "testimonies": [
        {
          "testimony": "Actually... the victim kind of ordered the defendant to do him in.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "A few days before it happened, the victim sent a letter \"ordering\" his own murder.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "The defendant did what was asked of him, and shot the old man in the forehead!",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "The bullet was fired from the pistol found at the scene, no doubt about it.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "And the pistol definitely belonged to the old man, sir!",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "So what if he shot the clown? He still shot the victim, pal!",
          "person": "Gumshoe",
          "present": [
            "Stage Pistol"
          ]
        }
      ],
      "noPresent": false
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Circumstances --Gumshoe:\nActually... the victim kind of ordered the defendant to do him in.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nJust because he got the letter doesn't mean he went through with it!\nKlavier:\nOh? I disagree. The victim was, indeed, shot in the forehead, after all. Just as he had commanded.\nPhoenix:\nIt could be a set-up. But let's not be in such a hurry. Maybe we should let the witness talk for a change.\nGumshoe:\n...Thanks, pal.\nKlavier:\n...... Fine. I can play it slow as well as I can play it fast. On with the testimony, Detective Gumshoe.Gumshoe:\nA few days before it happened, the victim sent a letter \"ordering\" his own murder.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n...And this letter was sent by the victim?\nGumshoe:\nThere it is! Gotcha! You're all mine this time, pal.\nPhoenix:\n...Huh?\nGumshoe:\nI had the handwriting checked out, of course. It's the victim's, no mistake!\nPhoenix:\nAh, I see...\nGumshoe:\nHa ha ha ha ha! Score one for the boys!\nPhoenix:\n(I didn't \"lose\". I was just ascertaining the facts. ...So why am I so annoyed?)\nJudge:\nBut... a letter ordering your own death? Things aren't what they used to be, I guess.\nPhoenix:\nI'm not sure this is exactly \"commonplace\", even now, Your Honor.\nGumshoe:\n...So anyway, guess I'll keep going while I'm ahead!Gumshoe:\nThe defendant did what was asked of him, and shot the old man in the forehead!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n...How can you be so sure!?\nGumshoe:\nHey, you gotta learn to stop relying on people to do your thinking for you, pal. Learn to think for yourself! Get that noggin cranking!\nPhoenix:\n(You fail to grasp the concept of \"questioning\", detective.)\nGumshoe:\nFirst, we got this letter. It says \"shoot... in the forehead\" loud and clear.\nPhoenix:\nI can see that. But I still wouldn't do it.\nGumshoe:\nWell, maybe you need to grow yourself a backbone, pal.\nPhoenix:\n(You fail to grasp the concept of \"shooting people is bad\", detective.)\nGumshoe:\nWe also found the defendant's pistol at the scene.\nKlavier:\nTraces of gunpowder residue shows that it had been fired recently.\nJudge:\n...Well, Mr. Wright? As far as I can tell from looking at this photo... ...there seems to be no issue with the prosecution's claim.\nPhoenix:\n(The photo... Maybe there's something in there I can use. So they're saying the defendant \"shot the victim in the forehead\"? I think there's a hole in the prosecution's argument! Clearly, Mr. Enigmar...)\n\n\n\nI have no clue.\n\n\n\n\n\n\n\nPhoenix:\nUnfortunately, nothing in this picture suggests he didn't do it.\nJudge:\nAh, I see. That is unfortunate.\nPhoenix:\n...Huh?\nKlavier:\nWell, let's pay it no mind and carry on, shall we? I like a fast tempo.\nPhoenix:\n...Huh?\nGumshoe:\nHey, I still got stuff to talk about, pal!\nPhoenix:\n(...Everyone's so eager to move on. So of course, I want to slow down. ...Is there really not a single clue in this picture?)\nJudge:\nBack to the testimony, if you would, detective.\nLeads back to cross-examination\n\n\n\n\ndidn't pull the trigger.\n\n\n\n\n\n\n\nPhoenix:\nPeople don't normally commit murder just because their teacher told them to. Which means the defendant didn't fire that pistol!\nKlavier:\n\nKlavier:\n...This is your position, then?\nPhoenix:\nUm, well, yes.\nKlavier:\nThis is the sort of occasion when my brother would present some \"evidence\".\nPhoenix:\n...Ah.\nKlavier:\nDid you have some evidence you wanted to show us? Something proving it wasn't the defendant who shot the old man?\nPhoenix:\n...... ......\nJudge:\nPenalty for excessive perspiration, Mr. Wright!\nPhoenix:\n(But it's a cold sweat, Your Honor...)\nLeads back to cross-examination\n\n\n\n\nshot something else.\n\n\n\n\n\n\n\nPhoenix:\nLooking at this photo, another possibility occurs to me.\nJudge:\nYes...?\nPhoenix:\nWhat does the letter tell us? That the defendant had a \"reason he couldn't refuse\" his teacher's wishes.\nGumshoe:\nBingo, pal! That's why the defendant popped him one in the forehead!\nPhoenix:\nOh? The defense disagrees. You see, the defendant had another choice he could make.\nKlavier:\n\nKlavier:\nWhat, and you can prove that with this photo!?\nPhoenix:\n...I can prove he had a choice, yes.\nJudge:\n\"The defendant might have fired, like he was ordered. But he didn't shoot the victim's forehead.\" Well, let's hear what you're thinking, Mr. Wright. If he didn't shoot the victim's forehead, what did the defendant shoot?\n\n\n\nPresent clown doll's forehead\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\nThe clown doll...?\nPhoenix:\nTake a closer look. See? It's been shot in the forehead, too.\nJudge:\nAh...! There's a hole in its forehead!\nPhoenix:\nYes, and a hole in the prosecution's claim!\nKlavier:\n\nKlavier:\nHah! And I suppose you have a reason as to why he'd shoot the clown doll?\nPhoenix:\nHe didn't just shoot the doll. He shot the doll's forehead.\nKlavier:\nHis \"forehead\"...? Aah...!\nPhoenix:\nLet's read the \"orders\" once more, shall we? \"...You will shoot, one shot, square in the forehead.\" ...Which is exactly what he did. He shot the clown doll square in the forehead!\nJudge:\nThe defense has raised an intriguing possibility. That hole in the clown's forehead... It definitely looks like it was shot! Bailiff! Send someone to investigate this matter!\nKlavier:\n\nKlavier:\nI admit, I'm impressed. But I expected nothing less. Still, this doesn't mean he didn't shoot the victim!\nPhoenix:\n\nPhoenix:\nPerhaps he did have to shoot a forehead, as ordered. But the letter says nothing about whose forehead... This was the only way he had to follow his orders without taking a life!\nJudge:\nHmm. The bullet hole in the clown doll's forehead does demand an explanation. It might very well be a clue. Yet Prosecutor Gavin is right. It alone does not prove the defendant's innocence. You cannot say for sure the defendant didn't shoot the victim.\nKlavier:\nSo sorry, Mr. Wright. How sad it is to see the mighty fall.\nPhoenix:\n(...How sad it is to see the novice's overconfidence. He doesn't realize just how big this little \"hole\" is going to get.)\nJudge:\n...Detective Gumshoe. Please take this new-found fact into account as you continue your testimony.\nAdds statement \"So what if he shot the clown? He still shot the victim, pal!\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\nAh... I see! Which is to say... ...I have no idea what you're talking about. Prosecutor Gavin?\nKlavier:\nThe defendant had a choice other than shooting the victim in the forehead? ...Perhaps I might suggest one. He could have shot this attorney in the forehead!\nPhoenix:\n...Urk!\nJudge:\nAh... I see. Which is to say... ...I still don't see. Still, when in doubt, give a penalty, I always say.\nPhoenix:\n(Ugh. Time to think this one through again.)\nLeads back to cross-examinationPress (after adding statement)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nBut... it might have been the clown's forehead he shot.\nGumshoe:\nOK, so he practiced first on the doll, then shot him!\nPhoenix:\nHe \"practiced\" in the middle of the hospital? Anyone could have come in at any moment!\nGumshoe:\nYeah, but no one did come, did they, pal? Besides, it's what I woulda done. \"Always look before you shoot,\" I say.\nKlavier:\n...Might I suggest we move on? This is getting us nowhere.\nPhoenix:\n(Patience. We'll get there sooner than you think.)\nJudge:\nVery well. Please continue with your testimony, detective.Gumshoe:\nThe bullet was fired from the pistol found at the scene, no doubt about it.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou mean this pistol, the one in the crime scene photo?\nGumshoe:\n...That's the one! It's a funny-looking gun so there's no mistaking it.\nKlavier:\nWe compared the bullet taken from the victim's skull with a bullet fired from this gun. The rifling marks on the bullets were a perfect match.\nPhoenix:\nSo... you verified the murder weapon, in other words.\nGumshoe:\nYou bet we did!Press (after pressing fifth statement, before Stage Pistol is added to the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou mean this pistol, the one in the crime scene photo?\nGumshoe:\n...That's the one! It's a funny-looking gun so there's no mistaking it.\nKlavier:\nWe compared the bullet taken from the victim's skull with a bullet fired from this gun. The rifling marks on the bullets were a perfect match.\nPhoenix:\nSo... you verified the murder weapon, in other words.\nGumshoe:\nYou bet we did!\nJudge:\n...The court would like to see the pistol in question.\nGumshoe:\nYou got it, sir! Here she is!\nJudge:\nWell. This truly is a \"blast\" from the past.\nGumshoe:\nIt's a stage pistol for magic shows, see. But it can fire real bullets.\nJudge:\nHmm. It looks so much bigger in real life than on TV.\nGumshoe:\nYeah, but it can only hold one round. ...By the way, the pistol's firing chamber is empty. ...And it shows traces of having been fired recently.\nPhoenix:\nSo... were any fingerprints found on the gun?\nKlavier:\n...Unfortunately, no. Of course, the defendant is known for wearing gloves. We might say that a lack of fingerprints is, in fact, a \"fingerprint\" of its own.\nJudge:\nAh ha! Intriguing point, well made!\nPhoenix:\nWhoa whoa whoa! Not well made! Not intriguing!\nJudge:\nIn any case, the court accepts this evidence.\nStage Pistol added to the Court Record.\nJudge:\n...My grandchild would get a kick out of seeing this. ...But now it's time to return to our testimony.Examine evidence\n\n\n\n\n\n\n\n\n\nStage Pistol\n\n\n\n\n\n\n\n\n\nChamber\n\n\n\n\n\n\n\nPhoenix:\nIf you look closely, you can see how the pistol's made to bend here. It's a one-shot model, and I guess this bend is where you load it. So... this is the famous Gramarye Golden Sun. They say kids used to love pretending they had one of those. I wonder if they pretended to miss their targets, too?Gumshoe:\nAnd the pistol definitely belonged to the old man, sir!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n...Why are you so certain?\nGumshoe:\nWhat pile of sand has your head been stuck in all this time, pal? You never heard of \"Zak & Valant's Quick-Draw Shootem\"?\nPhoenix:\nHuh? What's that?\nGumshoe:\nOne of the defendant's specialties. Zak and Valant stand on either side of a girl! Then, they shoot! But the bullets don't hit her! Instead, they hit everything else on stage!!! This was one of the pistols they used in their show. Got a great design, huh? The kids love it.\nKlavier:\nMany boys and girls joined the police because of that pistol, I hear.\nPhoenix:\n(You know, that would explain a lot about the police force.)\nGumshoe:\nTroupe Gramarye stopped doing that act a while ago. The old man held on to that pistol ever since.Press (after pressing fourth statement, before Stage Pistol is added to the Court Record)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n...Why are you so certain?\nGumshoe:\nWhat pile of sand has your head been stuck in all this time, pal? You never heard of \"Zak & Valant's Quick-Draw Shootem\"?\nPhoenix:\nHuh? What's that?\nGumshoe:\nOne of the defendant's specialties. Zak and Valant stand on either side of a girl! Then, they shoot! But the bullets don't hit her! Instead, they hit everything else on stage!!! This was one of the pistols they used in their show. Got a great design, huh? The kids love it.\nKlavier:\nMany boys and girls joined the police because of that pistol, I hear.\nPhoenix:\n(You know, that would explain a lot about the police force.)\nGumshoe:\nTroupe Gramarye stopped doing that act a while ago. The old man held on to that pistol ever since.\nJudge:\n...The court would like to see the pistol in question.\nGumshoe:\nYou got it, sir! Here she is!\nJudge:\nWell. This truly is a \"blast\" from the past.\nGumshoe:\nIt's a stage pistol for magic shows, see. But it can fire real bullets.\nJudge:\nHmm. It looks so much bigger in real life than on TV.\nGumshoe:\nYeah, but it can only hold one round. ...By the way, the pistol's firing chamber is empty. ...And it shows traces of having been fired recently.\nPhoenix:\nSo... were any fingerprints found on the gun?\nKlavier:\n...Unfortunately, no. Of course, the defendant is known for wearing gloves. We might say that a lack of fingerprints is, in fact, a \"fingerprint\" of its own.\nJudge:\nAh ha! Intriguing point, well made!\nPhoenix:\nWhoa whoa whoa! Not well made! Not intriguing!\nJudge:\nIn any case, the court accepts this evidence.\nStage Pistol added to the Court Record.\nJudge:\n...My grandchild would get a kick out of seeing this. ...But now it's time to return to our testimony.Gumshoe:\nSo what if he shot the clown? He still shot the victim, pal!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo let me get this straight. You're saying my client first shot the clown, then shot the victim?\nGumshoe:\nHey! Not a bad summary, pal!\nPhoenix:\n(More of a confirmation than a summary, but whatever.)\nKlavier:\nThat was really more of a confirmation than a summary. But our defense attorney seems pleased enough with himself.\nPhoenix:\n(Do these people ever miss a chance to mock me?)\nKlavier:\nWell, now that Mr. Wright's gotten that out of his system... ...shall we continue with the testimony?Present Stage Pistol\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"The trickiest cases often seem the simplest.\"Phoenix:\n(...I didn't have time to gather all the details before coming in here. This testimony might be my only source of information. Better pay attention... and read this letter carefully.)Phoenix:\nThe trickiest cases often seem the simplest. Prosecutor Gavin, you missed the bullet hole in the clown's forehead. If you hadn't missed that, you might have come to a very different conclusion. ...Understand?Gumshoe:\nY-Yeah, but like I just said, pal... ...after he shot the clown in the forehead, he went and...Phoenix:Phoenix:\n...Did nothing of the sort to the victim. The pistol proves he could not.Judge:\nThe murder weapon? How?Phoenix:\nIt's quite simple, Your Honor. This pistol only holds one bullet at a time.Gumshoe:\nAh...!Phoenix:\nIf he had shot the clown in the forehead... ...he couldn't have shot the victim, too!Gumshoe:\nYeeeeeeeeeeeeeargh!Klavier:Klavier:\nTh-That's not a contradiction. Not even close! All he had to do was reload the pistol after the first shot!Phoenix:Phoenix:\nOh? Where did he get the extra bullet? They're not so easy to come by, you know. If you claim the defendant \"had one ready\"... ...then prove to us how he got it!Klavier:\nUrk...! ...... Heh... Ha ha ha... I had a feeling this wasn't over yet. No... this party's just getting started. And I haven't proven anything yet, beyond my good looks, and startling record sales.Phoenix:\n(And utter lack of humility.)Judge:\nHmm... Ah... what's this? It seems that the prosecution has another witness prepared.Klavier:\nLike I said, Herr Detective was just the warm-up act.Gumshoe:\n...Ugh.Klavier:\nNow that the audience has gotten a taste of what's to come, they're ready.Phoenix:\n...Ready for what?Klavier:\nFor my decisive witness, of course. A witness who, you will find, can prove one thing for us: That it was Zak Gramarye who shot the victim in the forehead!Judge:\n...Very well. We will pause for a 15-minute recess.Phoenix:\n(This might be my lucky break... I'll need that 15 minutes to talk to my client... Zak.)Judge:\n...Court is adjourned!To be continued.April 19, 11:21 AMDistrict CourtDefendant Lobby No. 2Zak:\nVery impressive, Mr. Wright. I have to say, I expected nothing less.Phoenix:\n...We've only just begun. I was hoping you could tell me a bit more about what happened, actually.Zak:\nI did not think you would believe me if I told you. Better that you discovered the truth for yourself. I was thinking of you, you know.Phoenix:\nI think we need less thinking and more talking! That night in the hospital... What really happened?Zak:\nAh, the way your eyes gleam, Mr. Wright... ...you'll scare Trucy.Phoenix:\n(Speaking of which, where is she?)Zak:\nYou have seen the problem yourself: the letter.Phoenix:\nThe \"one shot in the forehead\" one, right?Zak:\nYes, and the reason he speaks of. I could not deny my mentor's wishes... even if it meant my own death.Phoenix:\nWhy not...?Zak:\nThis is something I will not say... for now, at least.Phoenix:\n(What's this \"for now\" business?)Zak:\nI have done many things in my life, some well, some poorly. But this is a cross we must bear alone to our graves.Phoenix:\n...\"We\"?Zak:\nYou wanted to know about the night of the incident?Phoenix:\n(Finally... This guy sure likes to take his time getting to the important stuff.)Zak:\nOf course, I had no intention of shooting my mentor. I snuck into his room that night at the appointed time. And found there upon his bedside table two pistols.Phoenix:\n...\"Two\"?Zak:\nYes. The one I had used on stage... ...and the one that had been used by my partner, Valant.Phoenix:\nOh, for the \"Zak & Valant's Quick-Draw\" thing?Zak:\nMy mentor... had the look of one sleeping. I stood by his bedside, hearing only the light sound of his breathing. ...Then I took the pistol into my hand. I cannot deny that my resolve faltered then, for a moment.Phoenix:\nYou \"faltered\"...? You mean you thought about shooting him?Zak:\nRecall there was a reason I could not refuse his request. His last such request... though not his first.Phoenix:\nSo... there were other requests you \"couldn't refuse\" before?Zak:\nTo be honest, I've not always been steadfast... and I fear I've brought pain upon Trucy.Phoenix:\n(Was Magnifi coercing his disciples somehow? Just what was going on in Troupe Gramarye...?)Zak:\nYet... in the end, I did not shoot him. Instead, I turned and shot the clown! I took the pistol I had fired and placed it in my pocket.Phoenix:\nIn your pocket?Zak:\nI believe if you examine the bullet in the clown's head... ...you will find it to be different than the one in my mentor. The... What were those called?Phoenix:\n\"Rifling marks\".Zak:\nYes. Well, that is all I have to tell you... concerning the case.Phoenix:\n\"Concerning the case\"...? You mean, there's something else you can tell me?Zak:\nHeh... Ha ha ha! You are a fascinating man, Mr. Wright.Phoenix:\n...Thanks?Zak:\nYes... there is something. My mentor... his eyes opened.Phoenix:\nWhat!? Magnifi Gramarye...?Zak:\nThe old devil. He was not asleep, you see. ...Of course, the gunshot would have woken him anyway. And there we had our last discussion as mentor and pupil. It was not a long discussion. Maybe five, ten minutes or so.Phoenix:\nWhat did you talk about...?Zak:\nHa ha. Mr. Wright. ...Did I not just tell you? It does not concern this case.Phoenix:\n(Zak Gramarye... He seems pretty steadfast to me... or maybe just stubborn.)Bailiff:\nMr. Wright! Your presence is requested in the courtroom!Zak:\nOnce again, I am in your hands.Phoenix:\n...Right. Let's get back in there.April 19, 11:37 AMDistrict CourtCourtroom No. 7Judge:\nCourt is now back in session.Klavier:\nDuring our recess, a bullet was found in and dug out from the clown's head.Judge:\nWell! This is news! And the rifling marks...?Klavier:\nThere wasn't time to do a detailed analysis. Though they did find the weapon type matches the murder weapon.Judge:\nHmm... Well, that's not very conclusive, is it?Klavier:\nWhich is why I'm about to call my very decisive witness.Phoenix:\nYour \"decisive witness\"? How many times have I heard those words... ...though they often turn out to be far less decisive than you think.Klavier:\n...Oh, don't worry on my account. I'm quite confident this witness will do the job. After all, he is intimately acquainted with the players in our little production... ...being the other half of Troupe Gramarye's famous duo... \"Zak & Valant\"!Phoenix:\n(Valant Gramarye... So, we get to meet the Great Magnifi's other disciple!)Klavier:\nPerhaps we'll start by asking your name and occupation?Valant:\nValant Gramarye... Magician.Judge:\nEr, and you're the \"decisive witness\", are you? You can prove your fellow student... your partner's guilt?Valant:\n\"Fate\"... the grand illusion, filled with traps and tricks.Phoenix:\nW-Wait! The shooting took place in that hospital after 11 o'clock at night! If you're a \"witness\", does that mean you were there that late?Valant:\nIf one were to deduce this logically, the conclusion is... yes!Phoenix:\nUm... OK. (I always get the characters, don't I?)Klavier:\nI have an interesting fact for you. You see, several days before the crime... ...my witness received this.Judge:\nThat... looks very familiar...Phoenix:\nW-Wait... That's the same letter Zak Gramarye received!Valant:\nYes. Or perhaps I should say \"ta da\"!Judge:\nOrder! Order! Order! And what does it say? Surely not the same thing!Klavier:\nPerhaps you should see for yourself.Judge:\nWhy, it's practically the same! The court accepts this into evidence!Magnifi's Second Letter added to the Court Record. (Changed from [Magnifi's Letter 2 added to the Court Record.] in the original release)Judge:\nThis is most unusual... Exactly what was going on with you folks? What exactly was your \"Troupe Gramarye\" up to?Valant:\n...By which you mean?Judge:\nI'm just having trouble envisioning a man who would ask his students to kill him. Both of them, no less!Klavier:\nIt's just my opinion, Herr Judge. But from these letters, I'd say he was coercing them, not asking them.Valant:\nWe walked the magician's path together, and in so doing, shared much of our lives. When people are so close, there is strain... a warping of relations, you might say. ...Yet this has nothing to do with the case at hand.Phoenix:\n(By which you mean you're not going to tell us. ...Which makes me wonder even more about this \"reason they couldn't refuse\".)Judge:\n...Well, let's get on with the testimony for starters. The defendant, Zak Gramarye stands accused. Tell us why.Valant:\n...Oh, I'll do more than that. \"For where he walks, the red roses rise singing hymns to the miracle that is magic!\"Phoenix:\nFascinating. Though, I hardly need to remind you... ...that the evidence could just as clearly point to you as the suspect. The letter, the murder weapon... ...and now, the two bullets found at the scene.Judge:\nIn fact, the only difference seems to be the designated time...Valant:\nHa ha ha ha ha ha ha ha! As every magician knows... timing is everything.Klavier:\nYes... And now it's time to get this party fired up!Witness Testimony-- The Night of the Crime --Valant:\nThat night, I visited the hospital room at the time Magnifi requested.\nThe smell of gunpowder hung in the room... and my mentor had taken his final bow.\nI did not imagine my fellow student might have received the same instructions!\nYet a deal with the dead is still a deal. Death's sweet kiss... I gave to the clown.\nThen I informed the doctor and the police.Judge:\nHmm... So you were the one who reported the crime?Valant:\nIndeed. I would think... ...this fact alone would clear my name of suspicion!Phoenix:\nLet's not jump to any conclusions!Judge:\nYes, the cross-examination generally comes before the conclusions in this court. But, if your testimony proves to be true... ...then the defendant, Zak Gramarye, is guilty.Phoenix:\n(And if it wasn't Zak Gramarye, then the killer was you, Valant! And no disappearing act will get you out of that.)Cross ExaminationCross Examination-- The Night of the Crime --Valant:\nThat night, I visited the hospital room at the time Magnifi requested.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n...Which, according to the letter, was 11:20 PM?\nValant:\n...Indeed. In magic, timing is everything.\nPhoenix:\n...Right.\nValant:\nConsider, the illusion of teleportation. If I were to appear on stage before my stunt double has left, how would that look? Why, it would reveal the very secrets of my magic!\nKlavier:\nNow that you've revealed the very secrets of your magic for all of us, let's move on. You went at the designated time... and what did you see?Valant:\nThe smell of gunpowder hung in the room... and my mentor had taken his final bow.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo... you weren't worried for your own safety at all? I mean, you smelled gunpowder, yes? What if the shooter was still nearby?\nValant:\nI... I did not consider this, to be honest. It is forbidden for a magician to have a good imagination.\nPhoenix:\n...Uh, really? (Isn't magic all about illusions and imagination?) How about this: you were the shooter, which is why you weren't afraid.\nValant:\nN-Now you are the one imagining! It is forbidden for a lawyer to have a good imagination.\nJudge:\nThe witness will refrain from pausing so suspiciously before responding. ...My forbidden imagination is starting to imagine things.Valant:\nI did not imagine my fellow student might have received the same instructions!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhich brings us back to this \"reason\" neither of you could refuse.\nValant:\nSo it does. And my partner, he did not refuse.\nPhoenix:\nBut Magnifi wrote the same thing to you. Why could you \"refuse\" if Zak couldn't?\nValant:\nBecause I have a will of steel! Of course... ...I also do this trick where I bend steel bars. So perhaps steel isn't all so strong.\nPhoenix:\n(...So which is it!?)\nValant:\n...Mind if I continue?Valant:\nYet a deal with the dead is still a deal. Death's sweet kiss... I gave to the clown.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThere were two bullet holes at the scene: one in the victim, and one in the clown. You're saying the one who shot the clown... was you?\nValant:\nNo doubt my partner Zak has said much the same thing.\nPhoenix:\n(Yeah, because whoever didn't shoot the clown committed murder. I'd better dig around here a bit more... and see what I turn up.) Mr. Valant... Let me ask about something else concerning the crime scene, namely...\n\n\n\nthe bullet in the pistol.\n\n\n\n\n\n\n\nPhoenix:\nIn order to shoot a pistol, you need a bullet. Where was the bullet?\nValant:\n...I entered the room, and took the pistol in my hand. The bullet was already loaded, ready to fire at any time. A magician is always prepared, you see.\nPhoenix:\nPrepared for...?\nValant:\nOne never knows when a miracle will be called for. A magician always has seven doves in his pocket, and a white rabbit up each sleeve!\nKlavier:\nClearly, we're dealing with professionals here.\nJudge:\nHmm... Is this bullet that was loaded in the pistol really so important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nWithout a loaded bullet, we wouldn't have a murder. It's very important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"Yet a deal with the dead is still a deal. Death's sweet kiss... I gave to the clown.\" to \"The pistol was already loaded. I merely had to pull the trigger.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nthe location of the pistol.\n\n\n\n\n\n\n\nPhoenix:\nWhere exactly was the pistol when you entered the room?\nValant:\n...Atop a small bedside table, it was. As if to say, \"Here I am, take me into your hand, pull my trigger. Shoot him.\"\nKlavier:\nThe victim clearly wanted to be shot.\nJudge:\nBut... why?\nKlavier:\nPerhaps he wanted to go out... with a bang? ...Yet we will never hear the truth from his lips, so all we can do... is guess.\nJudge:\nHmm... Is the location of the pistol all that important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nWithout a murder weapon, there would be no murder! It's very important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"Yet a deal with the dead is still a deal. Death's sweet kiss... I gave to the clown.\" to \"I took up the pistol from the small table and shot the clown.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nthe number of pistols.\n\n\n\n\n\n\n\nPhoenix:\nHow many pistols were there when you entered the room?\nValant:\n...By which you mean what, precisely?\nPhoenix:\nTwo pistols were used in the \"Zak & Valant Quick-Draw Shootem\", correct? One for each of you.\nValant:\nYou are well informed, yet... ...only one of my \"old friends\" sat in the hospital room that night.\nPhoenix:\n(What did Zak tell me back in the lobby...?)\n\n\nZak:\nOf course, I had no intention of shooting my mentor. I snuck into his room that night at the appointed time. And found there upon his bedside table two pistols. I took the pistol I had fired and placed it in my pocket.\n\n\nJudge:\nHmm... I see no problem with that statement. Only one pistol is visible in the photograph of the crime scene, after all.\nPhoenix:\n...... So you picked up that pistol and fired it?\nValant:\nIndeed I did. Allakazam... Allakazing... Allakaboom.\nJudge:\nHmm... Is the number of pistols really so important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nThe number of pistols is quite important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"Yet a deal with the dead is still a deal. Death's sweet kiss... I gave to the clown.\" to \"Only one pistol was in the hospital room that night. With it, I shot the clown.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examinationValant:\nThe pistol was already loaded. I merely had to pull the trigger.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nIf the pistol was already loaded, something doesn't make sense. Why weren't the victim's fingerprints on it?\nValant:\nYou should know that we of the Troupe Gramarye are capable of many things. One of these being the levitation of iron balls... without touching them.\nKlavier:\nThere's no magic involved here. The shooter was just methodical, is all. He simply wiped everything of fingerprints.\nPhoenix:\n(Can't really do much with fingerprints that weren't there. Maybe I should ask about something else?)\n\n\n\nthe location of the pistol.\n\n\n\n\n\n\n\nPhoenix:\nWhere exactly was the pistol when you entered the room?\nValant:\n...Atop a small bedside table, it was. As if to say, \"Here I am, take me into your hand, pull my trigger. Shoot him.\"\nKlavier:\nThe victim clearly wanted to be shot.\nJudge:\nBut... why?\nKlavier:\nPerhaps he wanted to go out... with a bang? ...Yet we will never hear the truth from his lips, so all we can do... is guess.\nJudge:\nHmm... Is the location of the pistol all that important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nWithout a murder weapon, there would be no murder! It's very important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"The pistol was already loaded. I merely had to pull the trigger.\" to \"I took up the pistol from the small table and shot the clown.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nthe number of pistols.\n\n\n\n\n\n\n\nPhoenix:\nHow many pistols were there when you entered the room?\nValant:\n...By which you mean what, precisely?\nPhoenix:\nTwo pistols were used in the \"Zak & Valant Quick-Draw Shootem\", correct? One for each of you.\nValant:\nYou are well informed, yet... ...only one of my \"old friends\" sat in the hospital room that night.\nPhoenix:\n(What did Zak tell me back in the lobby...?)\n\n\nZak:\nOf course, I had no intention of shooting my mentor. I snuck into his room that night at the appointed time. And found there upon his bedside table two pistols. I took the pistol I had fired and placed it in my pocket.\n\n\nJudge:\nHmm... I see no problem with that statement. Only one pistol is visible in the photograph of the crime scene, after all.\nPhoenix:\n...... So you picked up that pistol and fired it?\nValant:\nIndeed I did. Allakazam... Allakazing... Allakaboom.\nJudge:\nHmm... Is the number of pistols really so important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nThe number of pistols is quite important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"The pistol was already loaded. I merely had to pull the trigger.\" to \"Only one pistol was in the hospital room that night. With it, I shot the clown.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nNo need\n\n\n\n\n\n\n\nPhoenix:\n(...On second thought, let's run with this testimony for a while longer.)\nLeads back to cross-examinationValant:\nI took up the pistol from the small table and shot the clown.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhy did you do that? I would think calling the police would come first.\nValant:\nThen you know nothing of the relationship between a master and his disciple! If your master says die, you die. Do you understand?\nPhoenix:\nSo, you're going to die?\nValant:\nCertainly not! ...It was but an example! In any case, I wanted to fulfill my obligation. A final courtesy to a great mentor, perhaps. Or, perhaps not!\nPhoenix:\n(...Perhaps I'm totally confused. Maybe I should ask about something else?)\n\n\n\nthe bullet in the pistol.\n\n\n\n\n\n\n\nPhoenix:\nIn order to shoot a pistol, you need a bullet. Where was the bullet?\nValant:\n...I entered the room, and took the pistol in my hand. The bullet was already loaded, ready to fire at any time. A magician is always prepared, you see.\nPhoenix:\nPrepared for...?\nValant:\nOne never knows when a miracle will be called for. A magician always has seven doves in his pocket, and a white rabbit up each sleeve!\nKlavier:\nClearly, we're dealing with professionals here.\nJudge:\nHmm... Is this bullet that was loaded in the pistol really so important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nWithout a loaded bullet, we wouldn't have a murder. It's very important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"I took up the pistol from the small table and shot the clown.\" to \"The pistol was already loaded. I merely had to pull the trigger.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nthe number of pistols.\n\n\n\n\n\n\n\nPhoenix:\nHow many pistols were there when you entered the room?\nValant:\n...By which you mean what, precisely?\nPhoenix:\nTwo pistols were used in the \"Zak & Valant Quick-Draw Shootem\", correct? One for each of you.\nValant:\nYou are well informed, yet... ...only one of my \"old friends\" sat in the hospital room that night.\nPhoenix:\n(What did Zak tell me back in the lobby...?)\n\n\nZak:\nOf course, I had no intention of shooting my mentor. I snuck into his room that night at the appointed time. And found there upon his bedside table two pistols. I took the pistol I had fired and placed it in my pocket.\n\n\nJudge:\nHmm... I see no problem with that statement. Only one pistol is visible in the photograph of the crime scene, after all.\nPhoenix:\n...... So you picked up that pistol and fired it?\nValant:\nIndeed I did. Allakazam... Allakazing... Allakaboom.\nJudge:\nHmm... Is the number of pistols really so important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nThe number of pistols is quite important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"I took up the pistol from the small table and shot the clown.\" to \"Only one pistol was in the hospital room that night. With it, I shot the clown.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nNo need\n\n\n\n\n\n\n\nPhoenix:\n(...On second thought, let's run with this testimony for a while longer.)\nLeads back to cross-examinationValant:\nOnly one pistol was in the hospital room that night. With it, I shot the clown.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo you took the only pistol there, and fired it?\nValant:\n...That's correct.\nPhoenix:\nAnd that pistol was this one, which was left at the crime scene?\nValant:\nGood show! I see you, too, are a magician of sorts.\nPhoenix:\n(And you're an idiot of sorts... Do you have any idea what you just said...?)\nKlavier:\nI see the fire in your eyes as you glare at the witness. So how about heating up this trial a bit? These slow ballads bore me.\nPhoenix:\n(Hmm... I've got a hunch, but maybe that's all it is. Maybe I should ask about something else?)\n\n\n\nthe bullet in the pistol.\n\n\n\n\n\n\n\nPhoenix:\nIn order to shoot a pistol, you need a bullet. Where was the bullet?\nValant:\n...I entered the room, and took the pistol in my hand. The bullet was already loaded, ready to fire at any time. A magician is always prepared, you see.\nPhoenix:\nPrepared for...?\nValant:\nOne never knows when a miracle will be called for. A magician always has seven doves in his pocket, and a white rabbit up each sleeve!\nKlavier:\nClearly, we're dealing with professionals here.\nJudge:\nHmm... Is this bullet that was loaded in the pistol really so important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nWithout a loaded bullet, we wouldn't have a murder. It's very important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"Only one pistol was in the hospital room that night. With it, I shot the clown.\" to \"The pistol was already loaded. I merely had to pull the trigger.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nthe location of the pistol.\n\n\n\n\n\n\n\nPhoenix:\nWhere exactly was the pistol when you entered the room?\nValant:\n...Atop a small bedside table, it was. As if to say, \"Here I am, take me into your hand, pull my trigger. Shoot him.\"\nKlavier:\nThe victim clearly wanted to be shot.\nJudge:\nBut... why?\nKlavier:\nPerhaps he wanted to go out... with a bang? ...Yet we will never hear the truth from his lips, so all we can do... is guess.\nJudge:\nHmm... Is the location of the pistol all that important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nWithout a murder weapon, there would be no murder! It's very important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"Only one pistol was in the hospital room that night. With it, I shot the clown.\" to \"I took up the pistol from the small table and shot the clown.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nNo need\n\n\n\n\n\n\n\nPhoenix:\n(...On second thought, let's run with this testimony for a while longer.)\nLeads back to cross-examinationPresent Stage Pistol\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"According to the defendant, Zak Gramarye, when he entered the room...\"Valant:\nThen I informed the doctor and the police.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo you informed the police... What did you do then?\nValant:\n...What do you suppose I did? Used my magic to levitate my mentor's corpse, perhaps?\nPhoenix:\nI don't know, that's why I'm asking. Now please answer the question and skip the sarcasm.\nValant:\nAfter I made my report, I called the doctor, and we returned to the room. While we waited for the police to arrive, we discussed... stomach medicine.\nKlavier:\nWe've confirmed this with the doctor. It all checks out. He praised Mr. Valant's knowledge of stomach medicine, in fact.\nValant:\n...Ah, it is an honor I do not deserve. But, I accept.Phoenix:\n(Both of Magnifi's students received the same letter. Both admit to having gone to the hospital that night. Two bullets were fired... and one of them killed Magnifi! Time to find the cracks in his testimony...)",
      "testimonies": [
        {
          "testimony": "That night, I visited the hospital room at the time Magnifi requested.",
          "person": "Valant",
          "present": []
        },
        {
          "testimony": "The smell of gunpowder hung in the room... and my mentor had taken his final bow.",
          "person": "Valant",
          "present": []
        },
        {
          "testimony": "I did not imagine my fellow student might have received the same instructions!",
          "person": "Valant",
          "present": []
        },
        {
          "testimony": "Yet a deal with the dead is still a deal. Death's sweet kiss... I gave to the clown.",
          "person": "Valant",
          "present": []
        },
        {
          "testimony": "The pistol was already loaded. I merely had to pull the trigger.",
          "person": "Valant",
          "present": []
        },
        {
          "testimony": "I took up the pistol from the small table and shot the clown.",
          "person": "Valant",
          "present": []
        },
        {
          "testimony": "Only one pistol was in the hospital room that night. With it, I shot the clown.",
          "person": "Valant",
          "present": [
            "Stage Pistol"
          ]
        },
        {
          "testimony": "Then I informed the doctor and the police.",
          "person": "Valant",
          "present": []
        }
      ],
      "noPresent": false
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Night of the Crime --Valant:\nThat night, I visited the hospital room at the time Magnifi requested.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n...Which, according to the letter, was 11:20 PM?\nValant:\n...Indeed. In magic, timing is everything.\nPhoenix:\n...Right.\nValant:\nConsider, the illusion of teleportation. If I were to appear on stage before my stunt double has left, how would that look? Why, it would reveal the very secrets of my magic!\nKlavier:\nNow that you've revealed the very secrets of your magic for all of us, let's move on. You went at the designated time... and what did you see?Valant:\nThe smell of gunpowder hung in the room... and my mentor had taken his final bow.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo... you weren't worried for your own safety at all? I mean, you smelled gunpowder, yes? What if the shooter was still nearby?\nValant:\nI... I did not consider this, to be honest. It is forbidden for a magician to have a good imagination.\nPhoenix:\n...Uh, really? (Isn't magic all about illusions and imagination?) How about this: you were the shooter, which is why you weren't afraid.\nValant:\nN-Now you are the one imagining! It is forbidden for a lawyer to have a good imagination.\nJudge:\nThe witness will refrain from pausing so suspiciously before responding. ...My forbidden imagination is starting to imagine things.Valant:\nI did not imagine my fellow student might have received the same instructions!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhich brings us back to this \"reason\" neither of you could refuse.\nValant:\nSo it does. And my partner, he did not refuse.\nPhoenix:\nBut Magnifi wrote the same thing to you. Why could you \"refuse\" if Zak couldn't?\nValant:\nBecause I have a will of steel! Of course... ...I also do this trick where I bend steel bars. So perhaps steel isn't all so strong.\nPhoenix:\n(...So which is it!?)\nValant:\n...Mind if I continue?Valant:\nYet a deal with the dead is still a deal. Death's sweet kiss... I gave to the clown.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nThere were two bullet holes at the scene: one in the victim, and one in the clown. You're saying the one who shot the clown... was you?\nValant:\nNo doubt my partner Zak has said much the same thing.\nPhoenix:\n(Yeah, because whoever didn't shoot the clown committed murder. I'd better dig around here a bit more... and see what I turn up.) Mr. Valant... Let me ask about something else concerning the crime scene, namely...\n\n\n\nthe bullet in the pistol.\n\n\n\n\n\n\n\nPhoenix:\nIn order to shoot a pistol, you need a bullet. Where was the bullet?\nValant:\n...I entered the room, and took the pistol in my hand. The bullet was already loaded, ready to fire at any time. A magician is always prepared, you see.\nPhoenix:\nPrepared for...?\nValant:\nOne never knows when a miracle will be called for. A magician always has seven doves in his pocket, and a white rabbit up each sleeve!\nKlavier:\nClearly, we're dealing with professionals here.\nJudge:\nHmm... Is this bullet that was loaded in the pistol really so important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nWithout a loaded bullet, we wouldn't have a murder. It's very important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"Yet a deal with the dead is still a deal. Death's sweet kiss... I gave to the clown.\" to \"The pistol was already loaded. I merely had to pull the trigger.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nthe location of the pistol.\n\n\n\n\n\n\n\nPhoenix:\nWhere exactly was the pistol when you entered the room?\nValant:\n...Atop a small bedside table, it was. As if to say, \"Here I am, take me into your hand, pull my trigger. Shoot him.\"\nKlavier:\nThe victim clearly wanted to be shot.\nJudge:\nBut... why?\nKlavier:\nPerhaps he wanted to go out... with a bang? ...Yet we will never hear the truth from his lips, so all we can do... is guess.\nJudge:\nHmm... Is the location of the pistol all that important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nWithout a murder weapon, there would be no murder! It's very important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"Yet a deal with the dead is still a deal. Death's sweet kiss... I gave to the clown.\" to \"I took up the pistol from the small table and shot the clown.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nthe number of pistols.\n\n\n\n\n\n\n\nPhoenix:\nHow many pistols were there when you entered the room?\nValant:\n...By which you mean what, precisely?\nPhoenix:\nTwo pistols were used in the \"Zak & Valant Quick-Draw Shootem\", correct? One for each of you.\nValant:\nYou are well informed, yet... ...only one of my \"old friends\" sat in the hospital room that night.\nPhoenix:\n(What did Zak tell me back in the lobby...?)\n\n\nZak:\nOf course, I had no intention of shooting my mentor. I snuck into his room that night at the appointed time. And found there upon his bedside table two pistols. I took the pistol I had fired and placed it in my pocket.\n\n\nJudge:\nHmm... I see no problem with that statement. Only one pistol is visible in the photograph of the crime scene, after all.\nPhoenix:\n...... So you picked up that pistol and fired it?\nValant:\nIndeed I did. Allakazam... Allakazing... Allakaboom.\nJudge:\nHmm... Is the number of pistols really so important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nThe number of pistols is quite important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"Yet a deal with the dead is still a deal. Death's sweet kiss... I gave to the clown.\" to \"Only one pistol was in the hospital room that night. With it, I shot the clown.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examinationValant:\nThe pistol was already loaded. I merely had to pull the trigger.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nIf the pistol was already loaded, something doesn't make sense. Why weren't the victim's fingerprints on it?\nValant:\nYou should know that we of the Troupe Gramarye are capable of many things. One of these being the levitation of iron balls... without touching them.\nKlavier:\nThere's no magic involved here. The shooter was just methodical, is all. He simply wiped everything of fingerprints.\nPhoenix:\n(Can't really do much with fingerprints that weren't there. Maybe I should ask about something else?)\n\n\n\nthe location of the pistol.\n\n\n\n\n\n\n\nPhoenix:\nWhere exactly was the pistol when you entered the room?\nValant:\n...Atop a small bedside table, it was. As if to say, \"Here I am, take me into your hand, pull my trigger. Shoot him.\"\nKlavier:\nThe victim clearly wanted to be shot.\nJudge:\nBut... why?\nKlavier:\nPerhaps he wanted to go out... with a bang? ...Yet we will never hear the truth from his lips, so all we can do... is guess.\nJudge:\nHmm... Is the location of the pistol all that important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nWithout a murder weapon, there would be no murder! It's very important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"The pistol was already loaded. I merely had to pull the trigger.\" to \"I took up the pistol from the small table and shot the clown.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nthe number of pistols.\n\n\n\n\n\n\n\nPhoenix:\nHow many pistols were there when you entered the room?\nValant:\n...By which you mean what, precisely?\nPhoenix:\nTwo pistols were used in the \"Zak & Valant Quick-Draw Shootem\", correct? One for each of you.\nValant:\nYou are well informed, yet... ...only one of my \"old friends\" sat in the hospital room that night.\nPhoenix:\n(What did Zak tell me back in the lobby...?)\n\n\nZak:\nOf course, I had no intention of shooting my mentor. I snuck into his room that night at the appointed time. And found there upon his bedside table two pistols. I took the pistol I had fired and placed it in my pocket.\n\n\nJudge:\nHmm... I see no problem with that statement. Only one pistol is visible in the photograph of the crime scene, after all.\nPhoenix:\n...... So you picked up that pistol and fired it?\nValant:\nIndeed I did. Allakazam... Allakazing... Allakaboom.\nJudge:\nHmm... Is the number of pistols really so important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nThe number of pistols is quite important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"The pistol was already loaded. I merely had to pull the trigger.\" to \"Only one pistol was in the hospital room that night. With it, I shot the clown.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nNo need\n\n\n\n\n\n\n\nPhoenix:\n(...On second thought, let's run with this testimony for a while longer.)\nLeads back to cross-examinationValant:\nI took up the pistol from the small table and shot the clown.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nWhy did you do that? I would think calling the police would come first.\nValant:\nThen you know nothing of the relationship between a master and his disciple! If your master says die, you die. Do you understand?\nPhoenix:\nSo, you're going to die?\nValant:\nCertainly not! ...It was but an example! In any case, I wanted to fulfill my obligation. A final courtesy to a great mentor, perhaps. Or, perhaps not!\nPhoenix:\n(...Perhaps I'm totally confused. Maybe I should ask about something else?)\n\n\n\nthe bullet in the pistol.\n\n\n\n\n\n\n\nPhoenix:\nIn order to shoot a pistol, you need a bullet. Where was the bullet?\nValant:\n...I entered the room, and took the pistol in my hand. The bullet was already loaded, ready to fire at any time. A magician is always prepared, you see.\nPhoenix:\nPrepared for...?\nValant:\nOne never knows when a miracle will be called for. A magician always has seven doves in his pocket, and a white rabbit up each sleeve!\nKlavier:\nClearly, we're dealing with professionals here.\nJudge:\nHmm... Is this bullet that was loaded in the pistol really so important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nWithout a loaded bullet, we wouldn't have a murder. It's very important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"I took up the pistol from the small table and shot the clown.\" to \"The pistol was already loaded. I merely had to pull the trigger.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nthe number of pistols.\n\n\n\n\n\n\n\nPhoenix:\nHow many pistols were there when you entered the room?\nValant:\n...By which you mean what, precisely?\nPhoenix:\nTwo pistols were used in the \"Zak & Valant Quick-Draw Shootem\", correct? One for each of you.\nValant:\nYou are well informed, yet... ...only one of my \"old friends\" sat in the hospital room that night.\nPhoenix:\n(What did Zak tell me back in the lobby...?)\n\n\nZak:\nOf course, I had no intention of shooting my mentor. I snuck into his room that night at the appointed time. And found there upon his bedside table two pistols. I took the pistol I had fired and placed it in my pocket.\n\n\nJudge:\nHmm... I see no problem with that statement. Only one pistol is visible in the photograph of the crime scene, after all.\nPhoenix:\n...... So you picked up that pistol and fired it?\nValant:\nIndeed I did. Allakazam... Allakazing... Allakaboom.\nJudge:\nHmm... Is the number of pistols really so important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nThe number of pistols is quite important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"I took up the pistol from the small table and shot the clown.\" to \"Only one pistol was in the hospital room that night. With it, I shot the clown.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nNo need\n\n\n\n\n\n\n\nPhoenix:\n(...On second thought, let's run with this testimony for a while longer.)\nLeads back to cross-examinationValant:\nOnly one pistol was in the hospital room that night. With it, I shot the clown.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo you took the only pistol there, and fired it?\nValant:\n...That's correct.\nPhoenix:\nAnd that pistol was this one, which was left at the crime scene?\nValant:\nGood show! I see you, too, are a magician of sorts.\nPhoenix:\n(And you're an idiot of sorts... Do you have any idea what you just said...?)\nKlavier:\nI see the fire in your eyes as you glare at the witness. So how about heating up this trial a bit? These slow ballads bore me.\nPhoenix:\n(Hmm... I've got a hunch, but maybe that's all it is. Maybe I should ask about something else?)\n\n\n\nthe bullet in the pistol.\n\n\n\n\n\n\n\nPhoenix:\nIn order to shoot a pistol, you need a bullet. Where was the bullet?\nValant:\n...I entered the room, and took the pistol in my hand. The bullet was already loaded, ready to fire at any time. A magician is always prepared, you see.\nPhoenix:\nPrepared for...?\nValant:\nOne never knows when a miracle will be called for. A magician always has seven doves in his pocket, and a white rabbit up each sleeve!\nKlavier:\nClearly, we're dealing with professionals here.\nJudge:\nHmm... Is this bullet that was loaded in the pistol really so important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nWithout a loaded bullet, we wouldn't have a murder. It's very important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"Only one pistol was in the hospital room that night. With it, I shot the clown.\" to \"The pistol was already loaded. I merely had to pull the trigger.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nthe location of the pistol.\n\n\n\n\n\n\n\nPhoenix:\nWhere exactly was the pistol when you entered the room?\nValant:\n...Atop a small bedside table, it was. As if to say, \"Here I am, take me into your hand, pull my trigger. Shoot him.\"\nKlavier:\nThe victim clearly wanted to be shot.\nJudge:\nBut... why?\nKlavier:\nPerhaps he wanted to go out... with a bang? ...Yet we will never hear the truth from his lips, so all we can do... is guess.\nJudge:\nHmm... Is the location of the pistol all that important?\n\n\n\nQuite important\n\n\n\n\n\n\n\nPhoenix:\nWithout a murder weapon, there would be no murder! It's very important, Your Honor.\nJudge:\n...Very well. Please add this detail to your testimony!\nValant:\n...What can I do, but obey?\nChanges statement from \"Only one pistol was in the hospital room that night. With it, I shot the clown.\" to \"I took up the pistol from the small table and shot the clown.\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\n...Actually, let me ask about something else.\nJudge:\nVery well. The witness may continue with the testimony.\nValant:\n...What can I do, but obey?\nLeads back to cross-examination\n\n\n\n\n\nNo need\n\n\n\n\n\n\n\nPhoenix:\n(...On second thought, let's run with this testimony for a while longer.)\nLeads back to cross-examinationPresent Stage Pistol\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"According to the defendant, Zak Gramarye, when he entered the room...\"Valant:\nThen I informed the doctor and the police.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nSo you informed the police... What did you do then?\nValant:\n...What do you suppose I did? Used my magic to levitate my mentor's corpse, perhaps?\nPhoenix:\nI don't know, that's why I'm asking. Now please answer the question and skip the sarcasm.\nValant:\nAfter I made my report, I called the doctor, and we returned to the room. While we waited for the police to arrive, we discussed... stomach medicine.\nKlavier:\nWe've confirmed this with the doctor. It all checks out. He praised Mr. Valant's knowledge of stomach medicine, in fact.\nValant:\n...Ah, it is an honor I do not deserve. But, I accept.Phoenix:\n(Both of Magnifi's students received the same letter. Both admit to having gone to the hospital that night. Two bullets were fired... and one of them killed Magnifi! Time to find the cracks in his testimony...)Phoenix:\nAccording to the defendant, Zak Gramarye, when he entered the room... ...there were two pistols on that table.Judge:\nTwo...?Phoenix:\nOne of those pistols he used to shoot the clown in the forehead. Then he left with it in his pocket.Klavier:\nOf course, this is what he would say. Unlike the hapless clown, we must assume our defendant has some brains in his head.Phoenix:\n...Well, what about what Mr. Valant has told us? You see, there's something about his testimony that doesn't make sense.Valant:\n...What might that be? I told you, I took the pistol that was there, and shot the clown...Phoenix:\nThat's your story, at least.Valant:\n...?Phoenix:\nBut the rifling marks tell a very different story, Mr. Valant. Recall what Prosecutor Gavin told us!Klavier:\nWe compared the bullet taken from the victim's skull with a bullet fired from this gun. The rifling marks on the bullets were a perfect match.Valant:\nAh...Phoenix:\nMr. Valant, if you fired this pistol... ...then YOU shot the victim in the forehead!Judge:\nOrder! Order! Order!!! Well, this is all rather sudden...Klavier:Klavier:\nHeh heh heh heh... What have I done?Judge:\nP-Prosecutor Gavin?Klavier:\nI owe the court an apology. ...Sorry.Phoenix:\nS-Sorry for what!?Klavier:\nYou see, I was unaware that two of these unique pistols were crafted. The analysis of the rifling marks only proved the type of gun that fired them.Phoenix:Phoenix:\nBut... But that's not what you told us before! You said you'd verified the murder weapon!Klavier:\nWhich is why I'm apologizing to you now. Quite sincerely, I might add. ...Would you hold me accountable for a mistake made in my youth?Phoenix:\nThat was just this morning!Klavier:\n...I am still young. And, I might add, it wasn't really my fault. If the defendant had only admitted he took one pistol from the scene of the crime... ...we would not be having this pleasant discussion now.Phoenix:\n...!Judge:\nHmm. Valant Gramarye?Valant:\n...Yes, Your Honor?Judge:\nYou were presented to this court as a \"decisive witness\". But you've proven to be more \"divisive\" than \"decisive\".Klavier:Klavier:\n...You'll see, in time.Phoenix:\n...!Klavier:\nThe testimony so far has merely been a review of the \"facts\". The proof... comes next.Judge:\nCare to elaborate, Prosecutor Gavin?Klavier:\nWhen Mr. Valant entered the hospital room, the victim had already been shot. As his next testimony will prove! Herr Wright, the real fight is about to begin.Phoenix:\n(...Bring it.)Judge:\nVery well. The witness will now testify to the court. Help us determine who shot what!Witness Testimony-- Who Shot What --Valant:\nI arrived in the hospital room at the appointed time, which is to say 11:20 PM.\nAfter discovering the body, I fulfilled my obligation... then called in the doctor.\nThe doctor examined the body before the police arrived...\nHe was quite clear about the time of death: 11:10 PM.\nAnd the one in the room at the time was my partner... not me.Judge:\nHmm... Those times are rather close, you have to admit. You're talking about an alibi established over a matter of minutes. To use a 10-minute discrepancy as the basis of your alibi...Klavier:\n...Is easy to explain in this situation, Herr Judge. For example... ...take our debut hit single, \"13 Years Hard Time For Love\". Cue to the song, press the play button, and it will play for 2 minutes, 15 seconds. Do it a hundred times, the result is the same.Phoenix:\n(Their debut single was only 2 minutes and 15 seconds long? What a rip-off!)Klavier:\nMagic is a world of utmost precision! Hocus pocus... requires admirable focus. And in the time of death determined by the doctor there is an incontrovertible truth.Judge:\n...Very well. The prosecution warns us that we're dealing with rather precise times. And we can expect the cross-examination to require the same level of precision.Klavier:\nI would hope the defense refrains from its customarily broad, sweeping accusations. ...Lest we blur the focus this case so clearly demands.Judge:\n...Point taken. Baseless remarks will result in a penalty. Carry on, Mr. Wright!Phoenix:\n(Carry on... Right.)Cross ExaminationCross Examination-- Who Shot What --Valant:\nI arrived in the hospital room at the appointed time, which is to say 11:20 PM.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\n11:20 PM... Can you prove that's when you arrived?\nValant:\nAlas, such a feat may be beyond even the Great Valant. For there was no one in that room but Magnifi, and he was departed, after a fashion.\nKlavier:\nI have here defendant Zak Gramarye's sworn deposition. \"I snuck into his room that night at the appointed time. It was 10 minutes before I left the room... and the victim was still alive.\"\nJudge:\nThe time indicated by this letter to Zak was 11:05 PM.\nKlavier:\nExactly. Which means the witness could not have entered that room before 11:15! ...Because his partner was still in the middle of his crime.\nJudge:\nI see someone did their arithmetic homework.\nKlavier:\nYou see, the defendant himself has corroborated the witness's testimony!\nPhoenix:\n(Hmm... Does that all make sense?)\n\n\n\nNot a problem\n\n\n\n\n\n\n\nPhoenix:\nI don't see any problem with that testimony.\nJudge:\n...... If you say so. Let's continue, shall we?\nValant:\nSometimes the most magical thing of all... is the truth.\nLeads back to cross-examination\n\n\n\n\nThere's a contradiction\n\n\n\n\n\n\n\nPhoenix:\n...The only problem I see here is the glaring contradiction in that testimony?\nJudge:\n...... Was that a question?\nPhoenix:\n...... I guess it was?\nKlavier:\nYou have been warned, Herr Wright. ...Baseless remarks will be penalized.\nJudge:\nWell put, Prosecutor Gavin! Oh, and Mr. Wright? Here's my answer to your question!\nPhoenix:\n(...Ugh...)\nLeads back to cross-examinationValant:\nAfter discovering the body, I fulfilled my obligation... then called in the doctor.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou walk in on a murder, and the first thing you do is shoot the clown?\nValant:\n...The disciple does what the disciple must. My mentor's request, without reason, had caused for me a surfeit of sorrow. For what would I, Valant, be now without him? \"May the soul of Magnifi the Great find greater peace above.\" This I muttered to myself as I pulled that lonely trigger.\nKlavier:\nIn any case, I believe this is nothing more than what we have already learned. I'm still waiting for one of those \"Wright moments\", Herr Attorney.\nJudge:\nMay I remind you that baseless remarks will earn penalties. Proceed with that in mind.\nPhoenix:\nYes, Your Honor. (What a pain this is turning out to be...)Valant:\nThe doctor examined the body before the police arrived...Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nDid the doctor say anything concerning the cause of death?\nValant:\nWhy yes... I believe he screamed, \"My God! He's been shot in the head!\"\nJudge:\nIt doesn't take a doctor to notice that. I believe I would have said much the same thing.\nKlavier:\nAnd I would have penned the requiem that arose in my soul at that horrid sight.\nPhoenix:\n(What ever happened to good old-fashioned investigation?)\nKlavier:\nIn any case, I believe this is nothing more than what we have already learned. I'm still waiting for one of those \"Wright moments\", Herr Attorney.\nJudge:\nMay I remind you that baseless remarks will earn penalties. Proceed with that in mind.\nPhoenix:\nYes, Your Honor. (What a pain this is turning out to be...)Valant:\nHe was quite clear about the time of death: 11:10 PM.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nI don't think I'm stepping out on a limb to say I have some doubts about this. How could the doctor be so precise with the time?\nJudge:\nWe do usually only get an \"estimated\" time of death, true. I'm not sure I've heard of a \"verified\" time of death.\nValant:\nMagic revels in making the complex appear simple, but reality is the opposite. What appears complex, in this case, is a simple matter of subtraction.\nJudge:\nI see another person has done their arithmetic homework!\nKlavier:\nThe point here... is the IV the victim was taking. It's quite visible in the photograph of the scene. Recall what we heard earlier about the victim, Magnifi Gramarye's schedule. Every night at 11:00, Magnifi took an IV drip for thirty minutes.\nJudge:\nI can see the IV bag right there, yes.\nKlavier:\nNow, look a little closer. Follow the tube down from the bag to the end...\nJudge:\nAh...! The needle's been removed!\nKlavier:\nDoubtlessly, it fell out when he was shot.\nJudge:\nThat would seem to be the case!\nKlavier:\n...When the needle comes out, the IV no longer drips.\nPhoenix:\nAh! You could just measure the remaining IV liquid...\nKlavier:\n...Precisely. The IV liquid functions, for our purposes, as an hourglass of sorts. This is how the doctor determined the time of death. From the amount remaining in the bag, it was determined that... ...the IV had \"stopped 10 minutes after administration began\".\nIV Report added to the Court Record.\nValant:\n...And so it was. When I, Valant, entered that room... ...10 minutes had passed since that horrible crime was committed! And this is proof.\nJudge:\nHmm... Well, Mr. Wright?\nPhoenix:\n(Hmm. Did that seem important?)\n\n\n\nVery important\n\n\n\n\n\n\n\nPhoenix:\nWell, seeing how it is the biggest clue we have to the time of death... ...I'd say it's very important.\nJudge:\nHmm. Agreed! It would be hard to imagine a more precise way to determine the time. Behold the power of arithmetic! Very well. The witness will add this detail to his testimony!\nValant:\nSometimes the most magical thing of all... is the truth.\nAdds statement \"The water of life springs not eternal... The remaining IV liquid proves my innocence!\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\nI don't see any problem with that testimony.\nJudge:\n...... If you say so. Let's continue, shall we?\nValant:\nSometimes the most magical thing of all... is the truth.\nLeads back to cross-examinationPress (subsequent times, before adding statement)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nHow could the doctor be so precise with the time?\nJudge:\nWe do usually only get an \"estimated\" time of death, true. I'm not sure I've heard of a \"verified\" time of death.\nValant:\nMagic revels in making the complex appear simple, but reality is the opposite. What appears complex, in this case, is a simple matter of subtraction.\nKlavier:\nThe point here... is the IV the victim was taking. The IV liquid functions, for our purposes, as an hourglass. You see the IV needle fell out of the victim's arm the moment he was shot.\nPhoenix:\nAh! You could just measure the remaining IV liquid...\nKlavier:\n...This is how the doctor determined the time of death. From the amount remaining in the bag it was determined that... ...the IV had \"stopped 10 minutes after administration began\".\nValant:\n...And so it was. When I, Valant, entered that room... ...10 minutes had passed since that horrible crime was committed! And this is proof.\nJudge:\nHmm... Well, Mr. Wright?\nPhoenix:\n(Hmm. Did that seem important?)\n\n\n\nVery important\n\n\n\n\n\n\n\nPhoenix:\nWell, seeing how it is the biggest clue we have to the time of death... ...I'd say it's very important.\nJudge:\nHmm. Agreed! It would be hard to imagine a more precise way to determine the time. Behold the power of arithmetic! Very well. The witness will add this detail to his testimony!\nValant:\nSometimes the most magical thing of all... is the truth.\nAdds statement \"The water of life springs not eternal... The remaining IV liquid proves my innocence!\"\n\n\n\n\nNot important\n\n\n\n\n\n\n\nPhoenix:\nI don't see any problem with that testimony.\nJudge:\n...... If you say so. Let's continue, shall we?\nValant:\nSometimes the most magical thing of all... is the truth.\nLeads back to cross-examinationPress (after adding statement)\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nAnd he knew this by the amount of IV liquid left?\nValant:\nIndeed. Apparently, doctors, as well as magicians, have a few tricks up their sleeves.\nKlavier:\nThe impact of the shot caused the IV needle to drop, telling us the time of death. ...The deceased's final message to this world.\nPhoenix:\n(If I left this \"alibi\" go through... ...I'm finished. There has to be a hole in this somewhere. Heck, I'll take a pinprick.)Valant:\nThe water of life springs not eternal... The remaining IV liquid proves my innocence!Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nDid you notice the IV yourself, by any chance?\nValant:\nWhen first I entered that room, the stench of gunpowder assailed me. Next, the mark of death upon my mentor's forehead! And then, his left arm did I spy, a rose, drooping and wilted. Its thorn, the discarded IV needle.\nKlavier:\n...Knocked from the vein by the force of the shot. Luckily for you. If that IV had not been there, why... you might be a suspect.\nValant:\n...Indubitably so. I might say it's thanks to my lucky color.\nPhoenix:\nYour... lucky color?\nValant:\nIndeed. Even today I wear it proudly 'pon my suspect self. For it always, without fail, brings me luck. Why, when \"Zak & Valant\" won their first Magician's Grand Prix... Yes! The very one held by the Association of International Magicians! I was adorned in this attire then, too! And our trophy: a bust. Ah, what a day that was!\nPhoenix:\n(*groan* This is one trip down memory lane no one needs.)\nValant:\nMy lucky color, yes indeed! And that IV, too... ...I say, I think 'twas hued especially for me, Valant!\nJudge:\nHmm... That does seem to be the case, indeed. ...Well, Mr. Wright? Any thoughts on this testimony?\nPhoenix:\n(...Valant sure looks happy with himself. ...OK, how about this \"lucky color\" testimony?)\n\n\n\nNot a problem\n\n\n\n\n\n\n\nPhoenix:\nI don't see any problem with that testimony.\nJudge:\n...... If you say so. Let's continue, shall we?\nValant:\nSometimes the most magical thing of all... is the truth.\nLeads back to cross-examination\n\n\n\n\nThere's a contradiction\n\n\n\n\n\n\n\nPhoenix:\nIt certainly sounds like your lucky color's brought you plenty of luck. But not this time. Mr. Valant... your lucky color's betrayed you.\nValant:\n...I'm afraid you've lost me.\nPhoenix:\n...Your Honor! The witness's testimony just now clearly contradicts the evidence!\nJudge:\n...Whaaat!? Please recall my warning at the beginning of this cross-examination, Mr. Wright. Baseless accusations will be duly penalized! I do hope this latest accusation is well-based.\nPhoenix:\n(...Don't worry, I've got all your bases right here.)\nJudge:\n...Very well. Let's hear the defense's claim. Where is your evidence that contradicts what Mr. Valant has told us?\n\n\n\nPresent Crime Photo\n\n\n\n\n\n\n\nPhoenix:\n\nLeads to:\n\"...The crime scene tells all, Your Honor.\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nPhoenix:\n\nJudge:\nHmm... pity. That didn't \"do it\" for me, as the kids are fond of saying nowadays. Perhaps you can explain it in such a way that it would.\nPhoenix:\nWell, I don't know whether it's the sort of evidence to \"do it\" for anyone but...\nKlavier:\n\nKlavier:\n\"Do\" yourself a favor and stop flailing around for excuses! ...Before you \"do\" yourself in! ...And \"do\" try to straighten your spine. All that bending over is bad for your posture.\nPhoenix:\n...!\nJudge:\nI've got something that should make you sit up straight.\nPhoenix:\n(Darn... I was so close on that one.)\nJudge:\n...Now that we're all upstanding citizens again, back to the testimony.\nValant:\nSometimes the most magical thing of all... is the truth.\nLeads back to cross-examinationValant:\nAnd the one in the room at the time was my partner... not me.Press\n\n\n\n\n\n\n\nPhoenix:\n\nPhoenix:\nYou entered that hospital room at 11:20 PM. The time given by the defendant, Zak Gramarye, was 11:05 PM. ...You didn't run into him at the hospital that night?\nValant:\nHmm. This is why I never perform with amateurs, you see.\nPhoenix:\nHuh...?\nValant:\nPicture if you will the night-time hospital. Outside, only the pale light of the moon. If two dressed as we were to meet in such circumstances... ...I daresay that would ruin the mood completely!\nPhoenix:\n...... The mood isn't in question here.\nKlavier:\nI believe the witness is saying they didn't meet, ja?\nValant:\nFor what is magic, if not the study of beauty? Us meeting was not only out of the question, it was an impossibility!\nPhoenix:\n(For what is magic, if not the study of how to make absolutely no sense at all? That said... was there a contradiction in there?)\n\n\n\nNot a problem\n\n\n\n\n\n\n\nPhoenix:\nI don't see any problem with that testimony.\nJudge:\n...... If you say so. Let's continue, shall we?\nValant:\nSometimes the most magical thing of all... is the truth.\nLeads back to cross-examination\n\n\n\n\nThere's a contradiction\n\n\n\n\n\n\n\nPhoenix:\n...The only problem I see here is the glaring contradiction in that testimony?\nJudge:\n...... Was that a question?\nPhoenix:\n...... I guess it was?\nKlavier:\nYou have been warned, Herr Wright. ...Baseless remarks will be penalized.\nJudge:\nWell put, Prosecutor Gavin! Oh, and Mr. Wright? Here's my answer to your question!\nPhoenix:\n(...Ugh...)\nLeads back to cross-examinationPhoenix:\n(An alibi over a matter of minutes. Precise is right! Hmm. And pressing with impunity will earn me a nice penalty, too. Better focus on one thing... this \"time of death\".)",
      "testimonies": [
        {
          "testimony": "I arrived in the hospital room at the appointed time, which is to say 11:20 PM.",
          "person": "Valant",
          "present": []
        },
        {
          "testimony": "After discovering the body, I fulfilled my obligation... then called in the doctor.",
          "person": "Valant",
          "present": []
        },
        {
          "testimony": "The doctor examined the body before the police arrived...",
          "person": "Valant",
          "present": []
        },
        {
          "testimony": "He was quite clear about the time of death: 11:10 PM.",
          "person": "Valant",
          "present": []
        },
        {
          "testimony": "The water of life springs not eternal... The remaining IV liquid proves my innocence!",
          "person": "Valant",
          "present": []
        },
        {
          "testimony": "And the one in the room at the time was my partner... not me.",
          "person": "Valant",
          "present": []
        }
      ],
      "noPresent": true
    }
  ]
}