{
  "previousContext": "Episode 3Turnabout Serenade\nLet's rock!!!\nKlavier:\nWe love you! Rock on, everyone! This party's not over yet! Get out your handkerchiefs for our special guest! That's right, baby! The night's just getting started!\nThank you for coming to the Gavinners: \"Guilty as Charged\" Tour! This ends the first part of tonight's show. There will now be a 20-minute intermission.\nJuly 7, 8:05 PMBackstage Hallway\nTrucy:\nThis is so cool! Us, at a Gavinners concert!\nApollo:\nHuh? Did you say something? My ears are still ringing... The Gavinners: putting the \"sick\" back in \"music\".\nTrucy:\nWell, I thought Mr. Gavin was really nice! Sending us those tickets at 20% off! They're hard to get ahold of, you know.\nApollo:\nWhen you invite people to a concert it's usually free.\nTrucy:\nLet's head to his dressing room, Apollo! You know, like we're a couple of VIPs. I've always dreamed of being a VIP at a Gavinners show!\nApollo:\nUm, Trucy... You didn't know who Prosecutor Gavin was before that case. What kind of fan doesn't know the lead vocalist's name?\nTrucy:\nOh! This guy, well, he was more like a prince really. He let us in...\nTrucy:\nKlavier... What a lovely name! He's so dreamy!\nTrucy:\nYeah, but I'm a girl! I'm supposed to swoon over gods of rock!\nApollo:\nGod-awful, maybe.\nTrucy:\nI bought all their stuff on the way home from the trial! I got twelve Gavinners albums, and fifteen concert videos!\nApollo:\n...That was quite a bit of impulse shopping.\nTrucy:\nI got an advance on my next 15-years-worth of allowance.\nApollo:\n...For Mr. Wright that sounds like a real act of generosity.\nApollo:\n(Who would have imagined me here... ...at a Gavinners concert, watching Prosecutor Gavin \"rock\". To be honest... ...he was kind of cool. And I'm kind of envious. Not that I'd ever admit that to Trucy.)\nJuly 7Gavinners's Dressing Room\nKlavier:\nAh, you made it.\nTrucy:\nMr. Gavin! Thanks so much for the tickets!\nApollo:\n...And the invoice you sent along with them.\nTrucy:\nYou were incredible up on stage, Mr. Gavin!\nKlavier:\nNothing like music to brighten the mood after a trial, ja? ...And we're almost ready for our next act. I'm looking forward to it myself.\nTrucy:\nLamiroir's singing, right!? The \"Siren of the Ballad\"?\nApollo:\nOh yeah... That flyer said she flew all the way over for this show.\nKlavier:\nThat's right. I happened to catch her show while overseas. Her voice... is divine. I knew I had to invite her to perform with us.\n???:\nLamiroir says... \"You praise me too highly.\"\nApollo:\n(Whoa! Who's this guy? He's huge!)\nKlavier:\nAh, allow me to introduce Mr. Romein LeTouse. ...Lamiroir's manager. And her interpreter, incidentally.\nLeTouse:\nIt is a great honor for us to be here. And a great honor for Lamiroir to be heard in this country.\n???:\n[Foreign text]....\nApollo:\n(That voice... I wish I could understand it... It's beautiful.)\n???:\n[Foreign text]... [Foreign text]...\nTrucy:\nOoooh! It's Lamiroir! I'm actually meeting Lamiroir!\nApollo:\n(Lamiroir... Mysterious songstress... Her quiet, deep song glides through the air... Lilting above a sparse, but elegant piano accompaniment. Now this is music. She's a real artist.)\nLamiroir:\n[Foreign text]....\nLeTouse:\nLamiroir says... \"We have long looked forward to this joint performance.\"\nKlavier:\nAh, Lamiroir... Your voice... ...It is art.\nLamiroir:\n[Foreign text]....\nLeTouse:\n\"Yet without his piano to guide me... ...it is but a voice.\"\n???:\n....................\nApollo:\n(I've seen this kid somewhere before.)\nTrucy:\nHe plays piano at all of Lamiroir's concerts! He's cute! And he's a really good pianist.\nApollo:\nGood pianists are a dying breed, I hear.\nLeTouse:\nAllow me to introduce Machi Tobaye. ...He is blind. This is why he never strays far from Lamiroir. They are always together.\nMachi:\n....................\nApollo:\n(They're like characters from some fairy tale..)\nTrucy:\nLamiroir's so, um, what's that word... Exotic! ...And mysterious!\nApollo:\nShe does seem quite pretty. At least, her eyes do.\nKlavier:\nHers is a kind of \"sight-seeing musique\"...\nTrucy:\nHuh?\nKlavier:\nShe travels the globe, putting the sights she sees into song. Even though her appearance and voice are exotic... ...her songs remind us of something close, and warm.\nTrucy:\nSights into song... That's so poetic!\nKlavier:\nShe was gracious enough to put music to my lyrics tonight. \"The Guitar's Serenade\". ...I hope you enjoy it.\nTrucy:\nI can't wait!\nKlavier:\n...And now it is time. For the next part, we're giving the Gavinners's hard rock a little rest. Lamiroir, the stage is yours.\nLamiroir:\n[Foreign text]....\nLeTouse:\nThe band members will not play during Lamiroir's ballad. Only Machi's tender tones, and Lamiroir's dulcet voice...\nKlavier:\n...And my guitar, of course.\nTrucy:\nWoo hoo! Nights like this make it all worthwhile, you know!\nApollo:\n(I should have learned to play the guitar. There's not much romance in Chords of Steel.)\nKlavier:\nShall we hit the stage, then?\nTrucy:\nGood luck, Mr. Gavin!\nKlavier:\nTake care your hearts aren't stolen away, ja?\nTrucy:\nLet's get back to the concert hall, Polly!\nSugar, Sugar...\nO that night, in your embrace.\nWhen you stole away the keys\nmy heart held on to so tight.\nPleasure...\nBut a fleeting melody\nIt wraps itself around me,\nAnd now through the air I fly.\nWoh... Woh...\nBurning on in my heart. Fire.\nBurn my love away. All away.\nLike a bullet of love. Fire.\nTake my life away. All away.\nGuitar, Guitar...\n\nUp together to the sky.\nJuly 7, 9:05 PMBackstage Hallway\nTrucy:\nWow, wasn't Lamiroir amazing? I *sniffle* I even cried a little!\nApollo:\nI was surprised Prosecutor Gavin actually burned his guitar.\nTrucy:\nYeah! That even surprised me, and I'm a magician! What a production!\nApollo:\nWhat a destruction. (I don't think Prosecutor Gavin was expecting it either, oddly. He looked as surprised as I was.)\nTrucy:\nIs that what they call \"risking life and limb for art\"? I think he's my new hero!\nApollo:\nI'm not sure I'd call that \"art\".\nTrucy:\nWell, what are we doing here? Let's get going to Mr. Gavin's dressing room! There's twenty minutes till the last part of the show!\nApollo:\nHow many breaks does this band need?\nJuly 7Gavinners's Dressing Room\nKlavier:\nWhat the heck was that!? I was never consulted about it!\nStaff:\nS-Sorry, Mr. Gavin, sir! I've asked the man in charge...\nKlavier:\nI play new rock, not Great Balls of Fire! Speaking of fire, I have a good mind to fire whoever's responsible!\nTrucy:\n...He seems upset.\nKlavier:\nApollo Justice! Were you the one who tried to torch me!?\nApollo:\nHey, I didn't do it!\nTrucy:\nSo much for risking your life for art...\nKlavier:\n\"The Guitar's Serenade\" is ruined! Ruined!\nTrucy:\nWell, let's try to talk to him at least.\nApollo:\n...I'm not sure that's the best move right now.\nAfter clearing all Talk options:\nKlavier:\nAlmost time for the third act of the night.\nTrucy:\nOh! There's more?\nKlavier:\nYes! Lamiroir's part is done. Now it's time for us to drop our groove again, ja? Hope you're ready to catch it.\nTrucy:\nWoo hoo! Ready, Apollo?\nApollo:\nUh... I think I'll pass.\nTrucy:\nEh.\nApollo:\nI liked the bit with Lamiroir. But the rest could use a volume knob. Turned way down.\nTrucy:\nAh, Apollo, you're getting old!\nApollo:\nAck! (Does 22 quality as \"old\" to a 15-year-old...?)\nTrucy:\nWell, I'm going!\nKlavier:\nLet the old folks rest backstage, ja? ...Time to rock.\nApollo:\n(Hey, you're older than I am!)\nJuly 7Backstage Hallway\nEma:\nHey, it's you! That Wright kid.\nApollo:\nDetective Skye! (I'll let that \"Wright kid\" business pass.)\nEma:\nCall me Ema. There's no need for titles once you've shared a bottle of fingerprinting powder!\nApollo:\nThat's a new one. So, um, Ema, what are you doing here?\nEma:\n...Isn't it obvious? I'm snacking. You think I want to be here!? Me, in charge of security in this pit!?\nApollo:\nSecurity...? Did something happen?\nEma:\nThere's no knowing with that glimmerous fop. Apparently, he's all upset because something was stolen. He wanted security back here during the concert. Where does he get off acting like he's some big rock star?\nApollo:\n(...He is a big rock star.)\nEma:\nHey! You listening to me?\nApollo:\nSo... Where's this door here lead to?\nEma:\nThis one? That's Lamiroir's dressing room. Don't even think of going in there unless you want a piece of Snackoos in your face!\nApollo:\n(Is she ever in a good mood, I wonder?)\nApollo:\nSo this is Lamiroir's dressing room.\nEma:\nIf you even think about going in there, I'll--\n...BANG...!\nApollo:\n......\nEma:\n......\nApollo:\nWhat was that?\n...BANG...!\nApollo:\nWas that... a gunshot?\n...CRASH...!\nApollo:\n(Something's going on!)\nEma:\nYou, out of my way!\nApollo:\nE-Ema!\nEma:\nLamiroir! Lamiroir!\n......\nEma:\nIt's not locked... I'm going in!\nJuly 7, 9:30 PMLamiroir's Dressing Room\nApollo:\n(What's that awful noise... Oh, it's the concert.) Aaack! That's-- (It's Lamiroir's manager! Mister what's-his-name...)\nEma:\nLeTouse! Oh no... Hey, you!\nApollo:\nM-Me?\nEma:\nWatch this room for me. I have to call for backup!\nApollo:\nR-Right, understood. You want me to make sure no one comes in, right?\nEma:\nAnd don't touch anything! I'll be right back!\nApollo:\n(...What's going on? I just talked to him, and now...)\nLeTouse:\n......Nnnh......\nApollo:\n...! (He... He's alive!) Mr. LeTouse! Can you hear me!?\nLeTouse:\n...Sh...Shot. ...I was...shot.\nApollo:\nWho? Who shot you!?\nLeTouse:\n...I don't know... Ask...\nApollo:\nAsk? Ask what?\nLeTouse:\nAsk... wi...witness...\nApollo:\nWitness... There was a witness!? Who!?\nLeTouse:\n...Cold... so cold... Witness...\nApollo:\nYou're cold? D-Don't worry, you're going to be fine! Help is on the way!\nLeTouse:\n...Can't s...see...\nApollo:\nHang in there, Mr. LeTouse! Tell me, who was the witness?\nLeTouse:\nThe wi...witness...is ...si...si...ren...\nApollo:\n(...\"Siren\"? How can a siren witness anything...?) Mr. LeTouse! Yipes! Ema!? (What was that!?) Wh-Who's there!?\nEma:\nWhat's wrong?\nApollo:\nEma! Did you see anyone just now!?\nEma:\nHuh? No...\nApollo:\n(I could have sworn I heard a door close...)\nEma:\nThe concert's been cancelled. Backup's on its way. Is Mr. LeTouse... ...He's dead, isn't he? That's terrible.\nApollo:\n...! (I lost him!)\nApollo:\n(Romein LeTouse... shot. And I heard his last words... \"The witness is the siren\"... Whatever that means.)\nJuly 7Backstage Hallway\n???:\nThe venue's locked down. We took names and addresses before letting the crowd go.\nKlavier:\nGood work, Daryan.\n???:\nI'll let you know if I find out anything about the victim. Later.\nKlavier:\nIt's investigation time, then, ja, Fräulein Detective?\nEma:\nI don't need some rock 'n' rolling prosecutor to tell me that.\nKlavier:\nOne request I must make... Tell no one, on staff or otherwise, anything of this.\nTrucy:\nOoh, a gag order!\nKlavier:\nNo word gets out, other than that Mr. LeTouse is dead. No word of the cause of death, or of the murder.\nApollo:\nTell no one... Not even Lamiroir?\nKlavier:\nNot even her. We must keep everything under wraps. Oh, one other thing. I'll need your signature on this, Herr Forehead. Yours too, Fräulein.\nApollo:\nOn that? Hmm... An \"Investigation Request\"...?\nTrucy:\nWhy just us?\nKlavier:\nYou two are civilians. It's standard procedure.\nApollo:\n(That should be OK to sign, I think...)\nSigned Prosecutor Gavin's Investigation Request.\nKlavier:\nRight, well, get started with the investigation!\nEma:\nI'm on it already!\nKlavier:\nAh, and one tip for you.\nApollo:\nHuh? Me?\nKlavier:\nTry not to get in the Fräulein detective's way. ...She's in a foul mood today.\nApollo:\n(Gee, I wonder why...)\nApollo:\n(We were all questioned as witnesses... ...And now none of us can go home. We'll investigate alright. ...Our way!)\nTrucy:\n...Somehow I don't see us getting back to that crime scene any time soon.\nApollo:\nI still can't believe I was there when it happened. Not an experience I care to repeat any time soon.\nTrucy:\nThis is no time for navel-gazing! Let's crack this case!\nApollo:\n(I worry about Trucy. She seems to have a very loose idea of what it means to be an \"attorney\". Of course, that's not surprising considering who her father is...)\nTrucy:\nSomething the matter?\nApollo:\nNo... Let's get cracking!\nApollo:\n(I'm the only one who was there... The only one who heard Mr. LeTouse's last words.)\nLeTouse:\nThe wi...witness...is ...si...si...ren...\nApollo:\n(First order of business is to find out what he meant by \"siren\"!)\nJuly 7Gavinners's Dressing Room\nTrucy:\nHuh. Looks like nobody's here.\nApollo:\nProsecutor Gavin's probably busy with the case, too. No rest for the wicked.\nTrucy:\nNo rest for us, either, Apollo! Let's get rocking! Rock, rock!\nJuly 7In the Wings\nTrucy:\nHmm. The stage looks empty.\nApollo:\nI was hoping to get a chance to talk to Prosecutor Gavin...\nTrucy:\nOh well. Nothing to do but go to the crime scene, I guess!\nApollo:\nI guess...\nJuly 7Lamiroir's Dressing Room\nEma:\nOh, it's you. I figured you'd come.\nApollo:\nYou have to let us investigate the scene, please!\nEma:\nYou're attorneys, no? Shouldn't you wait until you have a client...?\nApollo:\n(LeTouse did tell me to ask the witness, the siren... ...With his dying breath, no less. Doesn't that count?)\nEma:\n...G-Glare at me all you want, you'll get no snacks from me.\nTrucy:\nPlease! Think of poor Lamiroir!\nEma:\nHmph. Oh well, I suppose. You did find the body with me.\nApollo:\nGreat! Let's get to it!\nTrucy:\nRight!\nEma:\nJust try not to touch anything!\nApollo:\n(She's letting us look! And she's not munching her snacks! This bodes well. There are clues here, I can feel it! Leave no hanger unhung, no spot unspotted!)\nAfter clearing all Talk options and examining brooch and Romein LeTouse's left hand:\nEma:\nWell, that's about it. I think we've looked at just about everything there is.\nApollo:\nI guess you're right.\nEma:\nI know how you're feeling. It is hard to know when to stop. But anything more involved has to wait until the squad gets here.\nTrucy:\nArgh... I suppose...\nEma:\nI'll go report the evidence. Sorry, but could you wait here till I get back?\nApollo:\nHuh? Oh, actually, we have to--\nEma:\nGreat! Thanks!\nApollo:\n...She left.\nTrucy:\nWhat do we do, Apollo? She told us to wait...\nApollo:\nGreat. Now how am I supposed to investigate?\nTrucy:\nOh well, I guess it can't be helped. Let's go.\nApollo:\nHuh? Go?\nTrucy:\nTime's a wasting, Apollo! We've got a lot of ground to cover!\nApollo:\nWell, that's true, but... ...On second thought, why not. I'm sure everything will be fine.\nTrucy:\nOf course it will! Let's go!\nJuly 7Backstage Hallway\nTrucy:\nEeeeeeeeeeeeek!\nApollo:\nWho's there!?\nTrucy:\nWe... didn't just imagine that, did we?\nApollo:\nHe was wearing a silk hat. ...Friend of yours?\nTrucy:\nHardly!\nApollo:\n(Whoever that was, he sure looked suspicious!)\nJuly 7In the Wings\nKlavier:\nWhat is it with today!? Problem after problem! Achtung!\n???:\nYou ain't kidding.\nTrucy:\nIt's the two leading members of the Gavinners, Apollo! Klavier on vocals, and Daryan on guitar! They're so cool!\nApollo:\nI have a hard time thinking of \"Klavier\" as anything but a prosecutor, honestly.\nTrucy:\nHuh? What are they arguing about?\nApollo:\nProbably the case, I'd bet.\nKlavier:\nMy hog won't start. My guitar case is busted... ...my guitar's been burnt to a crisp, and to top it all off, someone's dead! ...And then there was that performance just now. What was that all about!?\nDaryan:\nHey, man, don't blame me. You were the one who missed the cue.\nKlavier:\nMe? Miss a cue!? How could I conceivably get the most important part of that song wrong? How!? And what was all that tinny playing of yours?\nDaryan:\nWho you calling \"tinny\"!?\nTrucy:\n...Sounds like they're having a spat. One of those \"differences in musical direction\" bands are always splitting up over.\nApollo:\nThis is hardly the time...\nKlavier:\n...Hmm? What are you two doing here?\nApollo:\nAh, um, hiya. ......\nKlavier:\nWe were just discussing the investigation, if you don't mind.\nApollo:\nSorry. Wait... You were what?\nKlavier:\nListen... You need to confirm that with the Republic of Borginia, Detective Crescend.\nDaryan:\nRight. Anything else?\nApollo:\nWhat did he just call him? \"Detective\"...?\nDaryan:\nAh, greetings. Daryan Crescend... Criminal Affairs, Division 3.\nApollo:\nUh... H-Hello. (\"Criminal Affairs\"!?)\nTrucy:\n*sigh* Apollo... You really don't know anything about the Gavinners, do you?\nApollo:\n(Something tells me that's about to be remedied.)\nAfter clearing \"The missed cue\" and \"The song's prediction\" Talk options:\nDaryan:\nThe lyrics predicting the crime... Klavier?\nKlavier:\nSeems a bit more than just a coincidence to me.\nDaryan:\nI have to agree. The key ring, the guitar, and the murder...\nApollo:\nThe key ring might have been dropped by accident.\nKlavier:\nYet the victim was holding it. Hard to think that it was unconnected.\nApollo:\nThat's true. (Prosecutor Gavin's as calm and collected as ever...)\nTrucy:\nSo the criminal matched their actions to the lyrics?\nDaryan:\nThat sounds likely.\nApollo:\nWhy would anyone do that?\nDaryan:\n...While we think about that, I'm going to get cracking on the biggest crime here. I'm going to talk to the Borginian Embassy about this Mr. LeTouse.\nKlavier:\nAh, right. Thanks, Daryan.\nDaryan:\nI'll leave the pondering of mysteries to you. I'm outta here.\nKlavier:\nA foreign national, Mr. LeTouse was killed... It seems like that would have to be the \"point\" of all this. But they did more than that. They left us with not only a murder, but a mystery!\nTrucy:\nMr. Gavin sure is irritable today.\nApollo:\nMaybe this is the real Prosecutor Gavin we don't get to see in the courtroom.\nKlavier:\n...I've had enough, frankly. If you find any more mysteries, do me a favor and keep them to yourselves, ja?\nApollo:\nJa... (I guess this is all we're going to get from Prosecutor Gavin. That leaves Lamiroir to question.) Prosecutor Gavin... do you know where Lamiroir is now?\nKlavier:\nAh, I had her go to my dressing room. With that pianist, Machi Tobaye, of course. She seemed rather shocked by Mr. LeTouse's sudden passing.\nApollo:\n(The Gavinners's dressing room. Got it!)\nJuly 7Backstage Hallway\nTrucy:\nEeeeeeeeeeeeek!\nApollo:\nWho's there!? ...There he goes again. Who is that guy!?\nTrucy:\n......\nApollo:\nHuh? Trucy?\nTrucy:\nYou know, he did look sort of familiar...\nApollo:\n...So he is a friend of yours!\nTrucy:\nNo, that's not it. ...Sorry, I don't remember.\nApollo:\n(Curiouser and curiouser...)\nJuly 7Gavinners's Dressing Room\nTrucy:\nAh... Lamiroir!\nLamiroir:\nWhat... What has happened? I heard that Mr. LeTouse has died!\nApollo:\nL-Lamiroir! You speak? I mean, you speak English?\nLamiroir:\nAh... Yes. I was invited here from the Republic of Borginia... But I am not Borginian by birth.\nTrucy:\nBut wasn't Mr. LeTouse your interpreter...?\nLamiroir:\nAh that. Yes, well... It was Mr. LeTouse's idea. He thought it would add to the mystery, you see.\nApollo:\nThen, your pianist is also...?\nMachi:\n....................\nLamiroir:\nNo, Machi Tobaye is Borginian. He does not speak English. Now, please tell me! What has happened to Mr. LeTouse? Why did he...\nTrucy:\nActually, Mr. LeTouse was...\nApollo:\nTrucy!\nTrucy:\nHuh?\nApollo:\nRemember what Prosecutor Gavin said? \"Not a word\"!\nTrucy:\nB-But Mr. LeTouse is Lamiroir's manager! That's not fair to her! I mean, isn't she a related party?\nApollo:\n(Precisely who Prosecutor Gavin doesn't want to alert, I'd suspect.)\nLamiroir:\nAll we have been told is to wait here in this room. It is very unsettling.\nApollo:\nI'm sorry, we're trying to figure it out ourselves. Do... you think I could ask you some questions?\nLamiroir:\nOf course. I am always willing to help.\nApollo:\n(She's as calm as she looked on stage... I can't put my finger on why, but I like this Lamiroir.)\nMachi:\n[Foreign text]....\nLamiroir:\nWhat is it, Machi?\nMachi:\n[Foreign text]....\nLamiroir:\nWhat... but you'd be alone!\nMachi:\n[Foreign text]....\nApollo:\nUm, what seems to be the problem?\nLamiroir:\nMachi... he is not good around strangers. He wishes to go out for a breath of fresh air. Would that be alright?\nApollo:\nUh, sure, of course.\nMachi:\n....................\nLamiroir:\nVery well. What is it you wished to ask me about?\nAfter clearing \"Lamiroir\" and \"Mr. LeTouse\" Talk options:\nApollo:\nThe \"siren\"... That's what he meant!\nTrucy:\nHuh? Apollo?\nApollo:\nYou are \"the Siren\", right Lamiroir?\nLamiroir:\nThat is the meaning of my name in Borginian, yes. (Changed from [That is the meaning of my name in Borginese, yes.] in the original release) It was the name my producer gave me. But why do you ask?\nApollo:\n...It's very important. I had to know for sure if the \"Siren\" was you.\nLamiroir:\nWhat do you mean, important?\nApollo:\n...I'll tell you. You deserve to know.\nAfter examining postcards, clearing \"The \"Siren\"\" Talk option, and presenting Brooch in Gavinners's Dressing Room:\nJuly 8, 12:22 AMBackstage Hallway\nApollo:\nWhoa! Who's there now!?\nEma:\nAh, it's you. ...Where were you!?\nApollo:\nAck! Ema! ...Is something wrong? (She's looks grumpier than usual.)\nEma:\nYou bet something's wrong! The impossible's happened! Arrgh! It's all your fault, you know!\nApollo:\n(Oops. Maybe this is about us leaving the crime scene.)\nTrucy:\nWhat do you mean by \"impossible\"?\nEma:\nWell it's gone! Utterly gone!\nTrucy:\n...What's gone?\nEma:\nThe body, stupid! What else?\nTrucy:\nEh...\nEma:\nMr. LeTouse's body has disappeared!\nTrucy:\nWhaaaaaaaaaat!?\nJuly 8Lamiroir's Dressing Room\nApollo:\nAh... Prosecutor Gavin.\nKlavier:\nFrom your vacant stare, I gather you've heard the news.\nApollo:\nI heard Mr. LeTouse's body has gone missing...\nKlavier:\nLook for yourself. Quite the pickle. Quite. The. Pickle.\nEma:\nHow can you just stand there!? We have to start the investi...\nKlavier:\nThere's no need for alarm, Fräulein Detective.\nEma:\n...!\nKlavier:\nAll entrances and exits have been sealed. The body will not leave the building. So, I suggest we go find ourselves a cadaver. There will be plenty of time to ponder the \"whys\" later.\nTrucy:\nWell, you seem pretty sure of yourself, Mr. Gavin.\nKlavier:\nOh, we'll find him. I'm rather enjoying this.\nApollo:\n(How could Mr. LeTouse's body just \"disappear\"?)\nTrucy:\nWell, you heard the man. Let's get searching!\nDaryan:\n...Hey, I don't know if this's exactly the right time, but...\nKlavier:\nYes, Daryan?\nDaryan:\nSee, Geeter's gone missing. It was in the dressing room.\nTrucy:\nGeeter? Who's Geeter!?\nDaryan:\nThat's what I call my guitar! You like, man?\nKlavier:\nYour guitar... was stolen?\nEma:\nThis hasn't been a good day for guitars or geeters.\nKlavier:\nOK. Body first, then guitar. And if someone finds that guitar, please bring it to our dressing room.\nDaryan:\nGeeter's like a missing person, not lost 'n' found, man.\nJuly 8, 12:57 AMIn the Wings\nTrucy:\nHmm. Does something seem different to you, Apollo?\nApollo:\nSomething is definitely different here.\nTrucy:\nLet's check it out!\nTrucy:\nThat stage there must have been lowered before.\nApollo:\nThat's the tower that Lamiroir and Prosecutor Gavin were singing on.\nTrucy:\nSomeone must have raised it. Hmm. I don't see a way to control it from here. Apollo, what about that ladder there against the wall? We could use that to take a look up top...\nApollo:\n...... Maybe we should get Ema.\nTrucy:\nWhat are you talking about? We have to see this sort of thing for ourselves!\nApollo:\n(I'm... not so good with heights.)\nTrucy:\nStop whining and start climbing!\nApollo:\nUrk...\nApollo:\n(It didn't look that high from below, really. But when we got to the top, I felt every one of those fifteen feet down. (Changed from [But when we got to the top, I felt every one of those 20 feet down.] in the original release) Of course, I wasn't thinking about the height any more. Not after what we found up there.)\nTrucy:\nEeeeeeeeeeeeeeek!\nApollo:\n(We found two things we were looking for, and one thing we never expected to find.) ...The body, guitar in hand, and the pianist, Machi Tobaye.\nJuly 8, 10:09 AMWright Anything Agency\nApollo:\nWow, that concert last night sure went south in a hurry!\nTrucy:\nNo kidding. Why did they arrest Machi!? Why!?\nApollo:\nDon't look at me like it's my fault! (Machi Tobaye, the blind pianist... ...arrested on suspicion of murdering Romein LeTouse.)\nTrucy:\nI can't believe such a cute little boy could do something so horrible!\nApollo:\nI guess they had proof of some kind.\nTrucy:\nWhat proof could possibly prove that!?\nKlavier:\nMornin'.\nApollo:\nP-Prosecutor Gavin?\nKlavier:\nWhat a night, eh? I apologize for being so upset...\nTrucy:\nMr. Gavin, do you know what's going on? Why did they arrest Machi!? Why!?\nApollo:\nDon't look at him like it's his fault either.\nKlavier:\nIt was tough for me, too. We performed together that night, after all. Yet...\nTrucy:\nYet?\nKlavier:\nThe powers that be say that, given the circumstances, it could only have been him.\nApollo:\nWhat do you mean by the \"circumstances\"?\nKlavier:\nLamiroir was invited from Borginia as an ambassador of goodwill. It is vital that this case be wrapped up swiftly. That's all the powers that be want, really.\nApollo:\nWell those are circumstances, alright. But what makes Machi the only possible suspect?\nKlavier:\nHerr Forehead... You seem to have forgotten that you're talking to the prosecution... the enemy.\nApollo:\nAh. Right. (I think I like this side of Prosecutor Gavin better, actually.)\nKlavier:\nI'm not at liberty to discuss the particulars of the case. ...Especially not to the defense attorney.\nApollo:\nWhat... did you just say? Me? The defense attorney?\nKlavier:\nThat's what I came to tell you. He's down at the detention center... He wants to request your services.\nApollo:\nHe...? You mean Machi? Machi wants me...?\nTrucy:\nThis is what we've been waiting for, Apollo! Let's get going!\nApollo:\nUh... Right...!\nKlavier:\nGood luck. I'm off to question Lamiroir.\nApollo:\nR-Right. Later! (I hope I'm up to this...)\nJuly 8Detention CenterVisitor's Room\nTrucy:\nWell, I just don't get it. I refuse to believe a cute little kid like that could do something so terrible.\nApollo:\n...You said that already.\nMachi:\n...........................\nTrucy:\nMachi! Everything's going to be OK! We're here for you!\nApollo:\nUm, h-hi. Maybe you can tell me about last night...\nMachi:\n[Foreign text]....\nTrucy:\nHuh?\nMachi:\n[Foreign text].... [Foreign text]!\nApollo:\n(That was when I realized how tough it must be... A little kid like this... ...in a country so far from everything he's ever known.)\nTrucy:\nUm, maybe Lamiroir can help?\nApollo:\nBut didn't Prosecutor Gavin say she was with him?\nKlavier:\nGood luck. I'm off to question Lamiroir.\nTrucy:\nWell, what are we going to do?\nApollo:\nThat's, um, a good question. (I can't think of anything we can do but go with this. ...And hope for the best at the trial tomorrow.)\nMachi:\n[Foreign text].... [Foreign text]....\nTo be continued.July 9, 10:00 AMDistrict CourtCourtroom No. 3\nJudge:\nCourt is now in session for... how do I say that?\nKlavier:\n\"Machi Tobaye\", Your Honor. The Pixie of the Arpeggio.\nJudge:\nRight, his trial. Court is in session!\nApollo:\nThe defense is ready, Your Honor.\nKlavier:\nThe prosecution is A-OK, Herr Judge.\nJudge:\nHmm... Very well, Prosecutor Gavin.\nKlavier:\nAh, my opening statement, ja?\nJudge:\nNo, no, actually... There was something else I wanted to ask you about.\nKlavier:\n...? Yes?\nJudge:\nSay you're going to visit someone in the hospital with an incurable disease... What do you say to them?\nKlavier:\nEh?\nJudge:\nI mean, you wouldn't say \"get well soon\", right? You'd only be kicking them when they're down...\nApollo:\nUm, what are you talking about?\nJudge:\nAhem, actually I'm going to visit someone who is terminally ill. ...Right after this trial. The Chief Justice's son.\nApollo:\nThe Chief Justice...?\nJudge:\nHis son is afflicted with a most terrible disease... He doesn't have long, it seems.\nApollo:\nAh...\nJudge:\nSo I thought I'd go pay him a visit. I thought saying something moving might be the order of the day.\nTrucy:\nWhy don't grown-ups ever just say what's on their mind instead of pretending?\nApollo:\n(She's looking at me with something like... disgust.) ...Hey! What are you looking at me like that for!?\nJudge:\nIn any case... I'm a bit busy today, so let's wrap this up quickly. Prosecutor Gavin, your opening statement, briefly!\nKlavier:\nYou're in luck, Herr Judge... I believe you'll be going on your hospital visit sooner than you think.\nApollo:\n...!\nKlavier:\nFirst, to review the victim in this case. Romein LeTouse, age 35. The global manager for diva songstress, Lamiroir. The cause of death: blood loss due to being shot by a large caliber revolver. This report has all the details.\nJudge:\nThe court accepts this into evidence.\nLeTouse's Autopsy Report added to the Court Record.\nJudge:\n45-caliber... That's quite large, isn't it? A direct hit from that could knock a man off his feet.\nKlavier:\nHowever, the bullet struck him in his shoulder. The damage to his body was slight... death was not immediate. Sadly, his blood loss was such that he could not be saved.\nJudge:\nHmm... I suppose the victim's condition could have been much worse, considering.\nCrime Photo added to the Court Record.\nKlavier:\n...Two shots were fired. One shot missed, the other penetrated and passed through the victim's shoulder. Both bullets were found in the wall at the scene. Observe the diagram... ...This is where the bullets hit.\nJudge:\nI see... The court accepts this evidence.\nDiagram added to the Court Record.\nJudge:\nIf we're talking about a 45-caliber revolver... ...we must assume that the killer was adept at the weapon's use.\nTrucy:\nReally?\nApollo:\nYeah, apparently, weapons that size have a powerful kickback. If, say, the judge tried to fire one, it'd break every bone in his body.\nJudge:\nThe defense will take more care in choosing examples!\nKlavier:\n...As I was saying, the victim was shot backstage, in a dressing room. This dressing room has only one entrance: this door.\nJudge:\nThat does seem to be the case, yes.\nKlavier:\nHowever, there were witnesses who heard the gunshots.\nTrucy:\nHe's talking about you and Ema, huh.\nKlavier:\nYet when the witnesses entered the room... ...it was empty, save for the victim's body, of course.\nJudge:\nB-But that's... That's impossible!\nKlavier:\nExactly. This murder was impossible. ...For all but one person.\nJudge:\nOne person?\nKlavier:\nThat is, of course... ...the defendant, Machi Tobaye.\nJudge:\nOnly this defendant could have committed the crime? But how?\nKlavier:\nIt's quite simple. The circumstances of the crime scene make it clear.\nJudge:\nVery well, I assume you have testimony to back up this claim. Please show the witness to the stand! (Changed from [Let the witness please take the stand!] in the original release)\nKlavier:\nYour name and profession, please.\nEma:\nEma Skye, I'm a detective for the police department. I was on security detail at the concert forum that night.\nApollo:\n(Ema seems... tired, somehow.)\nJudge:\nHmm... Security at the concert, you say?\nEma:\nSome security I was. Couldn't even stop a murder... ......\nJudge:\nNow, don't blame yourself! Things like this happen! I've made even bigger mistakes in my career, you know!\nApollo:\n(I'm sure that makes her feel much better.)\nTrucy:\nI want to hear about these bigger mistakes!\nKlavier:\nIn any case... Because you were on security detail, the crime was quickly discovered. And, we were able to identify the killer.\nEma:\n......\nKlavier:\nYou may give the court your testimony, if you would. Describe the circumstances of that day, and your discovery of the crime, please.\nEma:\n...Alright.\nWitness Testimony\n-- Murderous Circumstances --\nEma:\nThe night of the murder, I was on security backstage, at Prosecutor Gavin's request.\nOnly people involved with the concert in some way were allowed backstage.\nAt the beginning of the third set... I heard shots.\nI went into the room, filled with blaring rock music, and found the body.\nI examined the scene and determined that only the defendant could have done it.\nJudge:\nHmm... It was lucky that a detective was the first on the scene.\nTrucy:\nBut that door was the only way out of the room, right?\nApollo:\nYeah, pretty much.\nTrucy:\nThen I don't get it. How can they say that Machi did it?\nApollo:\nLooks like we need a bit more information.\nJudge:\nVery well, the defense may begin the cross-examination.\nCross Examination\n-- Murderous Circumstances --\nEma:\nThe night of the murder, I was on security backstage, at Prosecutor Gavin's request.\nEma:\nOnly people involved with the concert in some way were allowed backstage.\nEma:\nAt the beginning of the third set... I heard shots.\nEma:\nI went into the room, filled with blaring rock music, and found the body.\nEma:\nI examined the scene and determined that only the defendant could have done it.\nApollo:\n(I know the circumstances under which the body was found... I was there.)\nTrucy:\nAn examination of the crime scene was enough to nail down the killer?\nApollo:\nI'm sure they have a good reason. (They must have had a good reason to arrest Machi... ...And I'm going to find out what it was!)\nAfter pressing first, fourth, and fifth statements:\nJudge:\nI believe that's enough of that.\nApollo:\n!\nJudge:\nThe prosecution has a rather convincing case. The only way in and out of the crime scene was watched. Making the defendant the only one who could possibly leave the scene. Simple, and decisive.\nApollo:\nUgh...\nJudge:\nI believe we've heard enough to determine our verdict. Even if I wasn't in a hurry to make a hospital visit.\nKlavier:\nI'm sure the Chief Justice will appreciate the gesture. Unfortunately, we have no direct witnesses. Fortunately, the criminal left decisive evidence for us. That will have to be enough.\nApollo:\n(Argh! It can't be over already!)\nJudge:\nVery well, I believe this trial is finished. If the defense has no contradicting evidence...?\nKlavier:\nThe prosecution has presented our proof, clear and plain. If you have contradicting evidence... ...it'd better be clear and plain.\nTrucy:\nAck, Apollo! They've got us on the ropes already! We'd better come up with something quick!\nApollo:\nI know! I know! (Think! What can get us out of this!? We need evidence, or a witness, that can prove Machi is innocent beyond a doubt. Without that... *gulp*)\nJudge:\nMr. Justice? Do you have contradicting proof that can overturn the prosecution's case? If you do, you'd better tell us about it now.\nApollo:\n(This is it... and so soon! If I mess this one up, it's all over...!) The court wants contradicting proof?\nApollo:\nProsecutor Gavin, you claim that there were no witnesses to this crime. Are you absolutely sure?\nKlavier:\nAbsolutely. I'd swear it on my career as a prosecutor... And on my million-seller hit song \"Atroquinine, My Love\".\nTrucy:\n...There he goes again.\nApollo:\nThat's too bad, because there was a witness.\nJudge:\nHo ho! Really now? But how did you come to possess knowledge the prosecution clearly does not?\nApollo:\nBecause I am the only one in the world who knows this.\nApollo:\n(...What's going on? I just talked to him, and now...)\nLeTouse:\n......Nnnh......\nApollo:\n...! (He... He's alive!) Mr. LeTouse! Can you hear me!?\nLeTouse:\n...Cold... so cold... Witness...\nApollo:\nYou're cold? D-Don't worry, you're going to be fine! Help is on the way!\nLeTouse:\n...Can't s...see...\nApollo:\nHang in there, Mr. LeTouse! Tell me, who was the witness?\nLeTouse:\nThe wi...witness...is ...si...si...ren...\nJudge:\nWhaaat!? The victim said this before he died!?\nKlavier:\nPerhaps he did... and perhaps he did not.\nApollo:\nWhat do you mean by that?\nKlavier:\nAll we know is what Herr Forehead says he said. It's no testimony, especially since it comes from the defense attorney himself.\nApollo:\nApollo:\nBut it's the truth! He said it! I even told you about it! But apparently, you ignored me completely.\nKlavier:\nIt's my policy to fully investigate everything I deem relevant. Clearly this rookie lawyer thinks he can tell me how to do my job.\nJudge:\n...That's enough! Mr. Justice, we need clear contradictory proof from you. This witness of yours, unknown to the prosecution... ...I hope you're right. Failure carries a stiff penalty.\nKlavier:\nPerhaps... A stiffer penalty than usual is called for?\nApollo:\n(Urk! There's no backing out now!)\nJudge:\nLet's hear the name of your witness, Mr. Justice.\nJudge:\nLamiroir...?\nApollo:\nRecall Mr. LeTouse's last words.\nLeTouse:\nThe wi...witness...is ...si...si...ren...\nJudge:\nThe siren... Ah ha! He meant the \"Siren\"!\nApollo:\nThat's right. The \"Siren of the Ballad\"... Lamiroir! Lamiroir was only on stage for the second set... ...and she had access to the backstage area. She could have been a witness!\nJudge:\nI see... Well, Prosecutor Gavin?\nKlavier:\nMy claim still stands. There was no witness to this crime!\nJudge:\nVery well! Let's hear it from the horse's mouth then, shall we? We will now take a break from Detective Ema Skye's cross-examination. ...Please show Lamiroir to the witness stand.\nApollo:\n(Lamiroir would say nothing the night of the murder... Not today, though. Today we'll drag that story out of her no matter what it is!)\nKlavier:\n......\nKlavier:\nIt is my distinct honor to welcome the Siren of the Ballad to our courtroom...\nLamiroir:\nYou are too kind.\nJudge:\nAh, y-you can speak English?\nLamiroir:\nYes... Yes I can. Though I am not very good. ...There is much I do not know.\nJudge:\nYou speak so well! Have you spent time here before?\nLamiroir:\nActually, I do not know how I came by my knowledge of your language. Nor where I studied it...\nApollo:\n...? (What does she mean, she doesn't know...?)\nKlavier:\nI, too, thought to call her as a witness. But I did not. I had a reason, of course.\nApollo:\nWhat's that?\nKlavier:\nLamiroir... suffers from amnesia.\nJudge:\nAmnesia...?\nLamiroir:\nLamiroir... is not my true name. Yet I remember nothing of the time before I was given it. ...Nothing of the time before I started singing on stage.\nTrucy:\nWhoa! She's even more mysterious than I thought!\nKlavier:\nAs lauded singer Lamiroir, she lives a good life. There are little difficulties for her, thanks to her success. Yet... I did not wish to subject her to unnecessary stress.\nJudge:\nHmm... I see. I care surprisingly little about people's pasts. You have nothing to fear in this court, Lamiroir.\nLamiroir:\n...Thank you. Yet there is something I do not understand. I am being called as a witness? What might I say? No one will tell me anything of what happened...\nKlavier:\nLamiroir, let me be frank. I did not want to ask you up here to testify. Yet, that young gentleman with the wide forehead over there was adamant that you stand.\nLamiroir:\nOh my...\nTrucy:\nCongratulations, Apollo. You're the bad guy!\nApollo:\nUgh...\nJudge:\nWell, now that you're here, please give us your testimony. ...If nothing else, the sound of your voice is welcome. Tell us what you saw the night of the crime!\nWitness Testimony\n-- What I Saw --\nLamiroir:\nAs for what I saw... I saw nothing.\nThat night, I was invited to sing on stage, and this I did.\nI did not return backstage after the second set.\nThen I was led by the police to Mr. Gavin's dressing room, and told to wait there.\nThat was where I learned that something had happened... But I wasn't told the details.\nJudge:\nHmm... I must say, you sound wonderful just testifying.\nApollo:\n(I hope he was too distracted to hear what she was actually saying...)\nKlavier:\nThere you have it. She saw nothing that night. Now we can only pray that the defense has the sense to admit defeat. ...And refrain from detaining her here longer than need be.\nTrucy:\nWow, you just got badder, Apollo! Way to go!\nApollo:\nGrr...\nJudge:\nVery well, Mr. Justice. Keep it short and sweet!\nApollo:\n(Lamiroir wouldn't talk to me the night of the crime. She must know something, and I've got to find out what!)\nCross Examination\n-- What I Saw --\nLamiroir:\nAs for what I saw... I saw nothing.\nLamiroir:\nThat night, I was invited to sing on stage, and this I did.\nLamiroir:\nI did not return backstage after the second set.\nLamiroir:\nWhen my performance was finished, I went backstage for just a moment...\nLamiroir:\nI saw nothing. The late Mr. LeTouse's body was behind a wall.\nLamiroir:\nI saw bullet holes in the wall, and knew Mr. LeTouse had been shot...\nLamiroir:\nThen I was led by the police to Mr. Gavin's dressing room, and told to wait there.\nLamiroir:\nThat was where I learned that something had happened... But I wasn't told the details.\nApollo:\n(Think, what doesn't ring true about her testimony?)\nTrucy:\n...It's hard to imagine Lamiroir lying...\nApollo:\nShe might not be lying, but she's hiding something... (What wouldn't she tell me the night of the murder?)\nApollo:\nLamiroir. They call you the Siren of the Ballad... ...but lies are hardly becoming of such a creature.\nJudge:\n...A put-down worthy of our prosecutor, Mr. Justice.\nTrucy:\n...Such put-downs are hardly becoming of you, Apollo.\nKlavier:\n...Stop polishing your forehead and start polishing your character, ja?\nApollo:\n(C'mon, can't I be cool for once!?) Observe the diagram! Lamiroir, you looked in from the door for just a moment. Correct?\nLamiroir:\nY-Yes, that is so.\nApollo:\nThere were bullet holes in the room, yes. But they were in the wall the door is on!\nLamiroir:\nEh...\nApollo:\nYou see? Assuming you merely glanced into the room... ...you couldn't have seen those bullet holes!\nLamiroir:\nYeeeeeeeeeeeeeooowrk!\nJudge:\n...... Lamiroir.\nLamiroir:\n...Yes.\nJudge:\nI'm afraid the defense has raised a good point. It appears you have been holding back something.\nLamiroir:\n...And I must tell you? I must tell you what it is that I saw?\nJudge:\nYes. The happenings in this trial are being recorded. And I'm certain it will be on the news in Borginia. You understand your reputation is at stake. It falls to you to avoid tarnishing it.\nKlavier:\nPersonally speaking... I still believe that cross-examining her will yield us absolutely nothing.\nApollo:\nBut she knew how Mr. LeTouse died! And he named her as a witness! You must have seen something, Lamiroir!\nJudge:\n...Very well. Lamiroir... Please continue your testimony.\nLamiroir:\n... Very well, I shall.\nWitness Testimony\n-- What I Saw 2 --\nLamiroir:\nI was on my way from the stage to the backstage exit.\nThere was something like a little window there... That's how I saw it.\nThere were two shots... I couldn't do anything to stop it.\nBut it wasn't Machi!\nIt was a grown person! ...I know it was!\nJudge:\nSo you did witness the crime! And the killer was... a grown person, you say?\nKlavier:\nAch. This is my first time hearing this, I assure you. Nice play, Herr Forehead.\nApollo:\n......\nJudge:\nVery well, Herr... er, Mr. Justice. You may begin your cross-examination!\nTrucy:\nGreat going, Apollo! You were right about Lamiroir. ...What's wrong? You don't look too happy.\nApollo:\n(This whole thing smells fishy... That's what's wrong.)\nTrucy:\n...?\nCross Examination\n-- What I Saw 2 --\nLamiroir:\nI was on my way from the stage to the backstage exit.\nLamiroir:\nThere was something like a little window there... That's how I saw it.\nLamiroir:\nThere were two shots... I couldn't do anything to stop it.\nLamiroir:\nBut it wasn't Machi!\nLamiroir:\nIt was a grown person! ...I know it was!\nTrucy:\nYou can't ask for a better testimony than that!\nApollo:\nI'm not so sure it's all that simple, Trucy. (There's a critical flaw in this testimony... And I have to point it out, even if it isn't good for our case...)\nApollo:\nA \"grown person\"... That's a little vague.\nLamiroir:\nI am sorry. My skill with your language is... lacking, I know.\nJudge:\nCertainly you could at least see whether the shooter was male or female?\nLamiroir:\n...... It was a man. A young man.\nJudge:\nAnd you're sure of that?\nLamiroir:\nYes, his voice was quite clear.\nApollo:\nVoice...?\nJudge:\nHmm... Looking at this diagram, it seems the dressing room was quite cluttered. It does seem likely that you wouldn't have had a clear view of the shooter.\nLamiroir:\nAs a singer, I rely more on my ears than my eyes. When I hear a voice, I do not forget it. That voice... was the voice of a man.\nKlavier:\nSo you heard a voice. But wait... ...Couldn't that have been the victim, Mr. LeTouse?\nLamiroir:\nAbsolutely not. Did I not just say that I do not forget a voice? If it was Mr. LeTouse who spoke, I would have known.\nJudge:\nHmm... Indeed. So you were at the window, and you heard the shooter's voice, the voice of a young man.\nTrucy:\nApollo! This is a good testimony! That proves it wasn't Machi!\nApollo:\n......\nJudge:\nIndeed... If this turns out to be true, it would cast this case in a considerably different light. What is the defense's opinion of this testimony...?\nKlavier:\nLamiroir. I understand why you would want to protect Machi. Yet remember, you are the Siren of the Ballad... ...And lies do not become such a creature.\nJudge:\nWhat does the prosecution mean!?\nTrucy:\nApollo! What's he talking about!?\nApollo:\n(How come no one bats an eye when he says stuff like that?)\nKlavier:\nI recall the state of the crime scene quite well.\nApollo:\nThe state of the room...?\nKlavier:\nYes, and when the murder took place... ...that window was closed. I find it hard to believe you could hear a voice through it.\nLamiroir:\nWhat!? B-But I... I'm sure...\nKlavier:\n...Lamiroir. I have nothing but the highest regard for your musical sense. ...But my opinion of you as a witness is somewhat lesser.\nApollo:\nApollo:\nB-But she's the only eye-witness we have!\nKlavier:\nKlavier:\nSo you say. And the victim named her, the \"Siren\" as the witness?\nApollo:\nTh-That's right! That's what Mr. LeTouse...\nKlavier:\nWe heard your claim. We even entertained the possibility. And it brought us to this. Herr Judge!\nJudge:\nYes?\nKlavier:\nThe prosecution requests that the witness... be excused. Please.\nJudge:\nHmm... I'm afraid I must honor the prosecution's request. There is indeed a question of the witness's credibility.\nApollo:\nB-But if Lamiroir can't testify...\nTrucy:\nThen we don't have a chance of proving Machi's innocence.\nJudge:\nThis cross-examination is over! ...Prosecutor Gavin. You may continue making your case.\nKlavier:\n...Danke. Now where were we? Ah yes, I would like to hear from Fräulein Detective again.\nApollo:\nApollo:\nWait! Let me hear Lamiroir's testimony one last time...\nJudge:\nBut the cross-examination is already over. Until such a time as a need arises... ...this witness may leave the stand.\nLamiroir:\n...... I'm sorry I could not be of more assistance.\nKlavier:\n......\nKlavier:\nAt last, back to the real trial. Ready, Herr Forehead?\nApollo:\n(Grr... I hope I didn't just miss my only chance.)\nKlavier:\nFräulein Detective, how far had we gotten until we were so rudely interrupted?\nEma:\nDon't ask me!\nKlavier:\nI dislike saying the same thing twice. And I never repeat a song for an encore.\nJudge:\n...If you would, Ms. Skye.\nEma:\n...Hmph. I believe I was saying that the only way Mr. LeTouse's killer could have escaped... ...was through that air vent on the ceiling.\nJudge:\nAh, yes, there was only one door in the room. And a witness, you, was standing in front of it.\nEma:\nThat air vent isn't very big, see. Kind of limits the people who could possibly get through.\nJudge:\nI certainly would have a difficult time.\nEma:\nYou sure would. Not that you would have been there in the first place, though. Remember, the whole backstage area was off-limits to people not involved with the concert. The only one who meets the conditions for our killer... is the defendant.\nKlavier:\n...A virtuoso performance! I couldn't have put it better myself.\nJudge:\nHmm. She does state a clear case. Though, reading the report, something caught my eye.\nKlavier:\nOh? What's that?\nJudge:\nThe circumstances of the defendant's arrest.\nApollo:\nThe circumstances...? (Again...?)\nTrucy:\nHey, that's right, Apollo! Remember when we found Machi? That was bizarre!\nApollo:\n(She's right... Why did Mr. LeTouse's body disappear from the room... ...and end up on top of that stage tower? ...Holding a guitar, no less.)\nKlavier:\n...A perceptive observation, Herr Judge.\nJudge:\nAh, er, thanks! It was kind of an accident, really. But you work in this job long enough... ...you get a nose for things. Eh he he.\nTrucy:\nThe judge sure seems pleased with himself!\nKlavier:\nVery good, Fräulein Detective. Perhaps you can tie it all together for us. Why was the body moved? And how does that lead us to the killer!?\nWitness Testimony\n-- The Missing Body --\nEma:\nI believe Machi stole the body because of some lyrics.\nHe moved the body to match Lamiroir's song.\nNo one in this country had a motive to kill the victim.\nAnd, Machi practically left his signature at the scene.\nAll of the evidence clearly points to the defendant.\nApollo:\nLamiroir's... song?\nKlavier:\nYes... \"The Guitar's Serenade\". You noticed its \"code\" too, did you not?\nApollo:\nIts \"code\"...?\nKlavier:\nAll the events that day followed the lyrics to our song. First, the keys my \"heart\" held on to so tightly were stolen.\nApollo:\nThen Prosecutor Gavin's guitar burst into flames on stage. Mr. LeTouse's life was taken by a bullet...\nKlavier:\nThe rest hardly needs explanation... \"Guitar, Guitar... Up together to the sky.\"\nJudge:\nTh-That's mad! It's like a story out of some fairy tale!\nApollo:\n(I admit, I'd forgotten about the song... But there it is now, waiting for me... the grand finale, as it were.)\nTrucy:\nHey! You know I was the one who first noticed that!\nJudge:\nI've heard of jumping rope to songs, and counting to songs... ...But killing!?\nKlavier:\nIt's a wild world out there, Herr Judge.\nJudge:\nVery well! We've heard one song and dance, let's get on to the next: the cross-examination!\nApollo:\n(I'm not so sure I'm going to be doing much singing...)\nCross Examination\n-- The Missing Body --\nEma:\nI believe Machi stole the body because of some lyrics.\nEma:\nHe moved the body to match Lamiroir's song.\nEma:\nNo one in this country had a motive to kill the victim.\nEma:\nAnd, Machi practically left his signature at the scene.\nEma:\nAll of the evidence clearly points to the defendant.\nEma:\nFrom the state of the crime scene, I conclude the shooter was blind.\nTrucy:\nThis doesn't look so good, does it, Apollo?\nApollo:\nNo, it doesn't.\nTrucy:\n...... What do we do!?\nApollo:\n(First, we don't panic. Even though Machi's case is leaking water by the gallon. Gavin's on a roll, and it's up to me to stop him!)\nApollo:\nThis is that evidence!\nJudge:\nThe photograph of the crime scene...?\nApollo:\n(I don't care much for the smirk on Prosecutor Gavin's face... But this is no time to think twice... Time to press on!) Yes, Your Honor, the crime scene. There is something in here that decisively contradicts the prosecution's point!\nKlavier:\nThen perhaps you'd best show us this \"something\". Get your finger out of the breeze and put it to good use, ja?\nJudge:\nVery well, show us what you're talking about, Mr. Justice! The contradiction at the scene of the crime is...\nApollo:\nThe contradiction is right here!\nEma:\nThe smeared blood stains...!\nJudge:\nHmm... I thought it was just my blurry vision. But it really was blurry! The way the victim's hand is raised above his head... ...Much like a gesture I have seen many times in this court.\nEma:\nIt's almost as if he wrote something...?\nTrucy:\nAh ha! I get it! At least, I think I get it!\nKlavier:\nGet what, Fräulein?\nTrucy:\nWhen Mr. LeTouse was shot, he tried to write something! And what would he write but the shooter's name? And what would he write it in but his own blood? Pretty good, huh?\nApollo:\n(Thanks for making my point for me...) Yes, in fact, that's what I think happened here.\nJudge:\nHmm... That does seem to be a distinct possibility.\nEma:\nThe victim wrote the killer's name... ...It's certainly a logical conclusion.\nTrucy:\nDrat! I just wish it wasn't all rubbed out like that.\nJudge:\nOf course it's rubbed out. Why, if I were a killer... ...I certainly wouldn't want to leave my own name behind!\nKlavier:\nNeither would I.\nEma:\n......\nKlavier:\n......\nJudge:\n......\nApollo:\nUm... No one has anything else to say?\nJudge:\n...About what?\nApollo:\nSo the prosecution accepts this? You agree this was the victim making an attempt to record the name of the killer? ...And that the killer tried to rub the name out?\nEma:\nWhat's your point?\nApollo:\nWhat's my point!? Let me ask you this: How did the killer know the victim was writing their name?\nEma:\nWell, Mr. LeTouse was writing something in blood. Once the killer saw what it was... ...Wait.\nJudge:\nOnce he \"saw\" what it was...?\nApollo:\nBut what did you just testify about the shooter?\nEma:\nI said... they were blind. Ack!!!\nApollo:\nYet the crime scene itself contradicts that! The killer had to have been able to see! Why would they rub out the name in blood otherwise?\nEma:\nAh... ahh...\nApollo:\nMay I remind the court that the defendant, Machi Tobaye, is blind! He couldn't have been the shooter!\nEma:\nUrk... Immmmmmmmposssssibbleee!\nJudge:\nOrder! Order! Order!!! P-Prosecutor Gavin! Please explain to me what all this means!?\nKlavier:\n......\nJudge:\nI mean, looking at this photo... It seems quite clear that the shooter could see! Yet, up until now...\nKlavier:\n...It seems I owe the court an apology.\nJudge:\nHmm!?\nKlavier:\nThe Gavinners are a band with law enforcement ties, yet a murder occurred... ...during our concert! Apparently, this caused some confusion over jurisdiction. As a result, some reports were not filed in an entirely timely manner.\nApollo:\n(I... I'm not sure I like the vibe I'm getting here.)\nTrucy:\nHey Apollo, look at him. Why is Prosecutor Gavin all relaxed and smiling like that? Like he knows something we don't... and he's about to tell us.\nKlavier:\nHeh heh heh. I've got an idea... Let's rock! ...With these documents. But before that. I have a question for the Fräulein Detective. If I may?\nEma:\nWh-What?\nKlavier:\nTell me... Why do you think that Machi Tobaye is blind?\nEma:\nHuh...?\nApollo:\nWh-What did he say?\nEma:\nWhat are you saying? Of course he's blind!\nKlavier:\nOf course...?\nEma:\nH-He's the blind pianist, right? So... So he's... Doesn't Lamiroir lead him around by the hand all the time?\nApollo:\n(No way...)\nKlavier:\nI have a report here on the defendant, Machi Tobaye. According to this, Machi Tobaye... ...can see perfectly well.\nEma:\nWhat...?\nKlavier:\nHis blindness was merely a publicity ploy by those clever Borginians. He can see quite well.\nApollo:\nApollo:\nB-But you said...\nKlavier:\n...What did I say, exactly?\nApollo:\n!\nKlavier:\nHerr Forehead, not once in the course of this trial... ...have I claimed the defendant was blind. The only one who did was Fräulein Detective.\nApollo:\nBu-But that's...\nKlavier:\n...A significant fact, yes! Consider: Machi Tobaye sees. And he was the only one who could have fled through the air vent. I see no problems with this.\nEma:\nBut what about the bullet holes in the wall?\nKlavier:\nYes, the bullet holes. I believe Herr Forehead neatly explained those for us. He didn't miss because he couldn't see. It was the kickback from the 45-caliber revolver. A simple accident, in other words.\nApollo:\nAck...!\nKlavier:\nHow's that? I'm afraid your \"objection\" has just flown off for brighter skies...\nApollo:\nUrk...\nKlavier:\nThis is where the real fun begins, Herr Forehead!\nApollo:\nYeeeeaaaaaaaarrrrrrrrrggh!\nKlavier:\nI knew you didn't have what it took.\nEma:\nYou... You jerk! Just what was I in here for? Comic relief!?\nTrucy:\nYeah! Apologize!\nKlavier:\nAh ha ha. Oh, sorry!\nTrucy:\nThat's no way to apologize!\nApollo:\n(He's angered the Trucy now. Look out...)\nJudge:\nAhem. If we can please end the bickering. Now.\nEma:\nWhatever! I'm not leaving! I can't leave like this. I'll come up with some clue to solving this case if it kills me!\nJudge:\nBut your testimony has already given us enough to convict the defendant...\nApollo:\n(Ugh, don't say that...)\nEma:\nAh! Ah ha!\nApollo:\n\"Ah ha\" what?\nEma:\nThis blood stain... The criminal tried to wipe it off, right?\nApollo:\nThat seems to be what happened, yes.\nEma:\nWe might be able to find out what was really written here!\nApollo:\n...! Really...? You can do that?\nEma:\nThat's right, with this! It's called Luminol! Maybe you know of it? It's a chemical that reacts to blood.\nKlavier:\nAh yes, have we done those tests yet...?\nEma:\nHah! As if I'm going to tell you!\nKlavier:\nThe blood stains covered a section of the carpet. In order to perform blood tests, that section was removed and submitted. Perhaps we should request it here in court now.\nEma:\nRight! Go for it, Apollo!\nApollo:\nHuh? I have to do the test?\nEma:\nYou just have to spray the luminol on it! Simple!\nApollo:\n(A chemical that reacts to blood... I've heard of this somewhere.)\nJudge:\n...Yes, I believe an analysis is called for. Have at it!\nEma:\nRight, ready? It's easy as pie! Just press [A / Space] to spray an area. (Changed from [Just touch the screen to spray an area.] in the original release) Here! Give it a try!\nApollo:\n(...The eyes of the entire court are focused on me!)\nTrucy:\nApollo! Your hand's shaking!\nApollo:\n(Ugh... Grrrah! Let's do this!)\nApollo:\n(Wow... it really works!)\nTrucy:\nThis must be... this must be the power of science!\nEma:\nIt says... \"IPXX314206\"... ...Is that the killer's name?\nJudge:\nHmm. Maybe it is... if the killer was a robot!\nKlavier:\nAh hah! I have it!\nApollo:\n...So what is it?\nKlavier:\nI thought those letters \"IPXX\" looked familiar. This is an Interpol ID number.\nEma:\nI-Interpol? You mean the international police agency?\nKlavier:\nYes. Most are undercover agents working to solve international crimes. But why would he write that number...?\nApollo:\nWhy would Mr. LeTouse even know a number like that!?\nKlavier:\nGood show, Fräulein Detective. Rock on.\nEma:\nEh?\nKlavier:\nYour Honor! We can verify this number immediately. ...Daryan, are you there? Come up to the witness stand!\nKlavier:\nDaryan... you heard what we need. Go check into this Interpol ID number.\nDaryan:\nSure thing. Gimme 30 minutes. No... Gimme 27.\nJudge:\nHmm... I'm not sure what to think of all this. The prosecution's case is airtight, or so it seems. Yet if this number is really that of an Interpol agent...\nEma:\nOh, wait, I know... What if Machi Tobaye's really an undercover Interpol agent?\nKlavier:\nThat would be a possibility.\nJudge:\nA possibility, yes. And one that would mark him as the killer for certain.\nApollo:\n(Why did LeTouse know an Interpol ID number...? That's what I want to know.)\nKlavier:\nWell, we have some time while we await Daryan's report. Let's work on unraveling another mystery, shall we? A curious mystery concerning Machi Tobaye.\nApollo:\n...What are you talking about?\nKlavier:\nFräulein Detective, please accept my apologies. I received word that the defendant could, in fact, see, just before the trial began. It seemed too much of a bother to tell you.\nEma:\n...You had me until that last bit.\nKlavier:\nDoes this not raise a rather straightforward question?\nEma:\nWell, sure... Why did Machi pretend he couldn't see?\nKlavier:\nExactly... It makes little sense. What do you think, Herr Forehead?\nApollo:\nHuh? Me?\nKlavier:\nMachi Tobaye pretended he was blind... ...Do you know why?\nEma:\nHow could he know!?\nTrucy:\nWait... Prosecutor Gavin knows why, doesn't he...\nApollo:\n(He's known from the start of the trial. He's been leading us on the whole time!)\nKlavier:\nHmm? Something wrong? Do you think, perhaps, this is all some kind of game? Know that the moment I heard that report... ...I knew why.\nJudge:\nHmm... I suppose people who have sold over a million records really are something else.\nApollo:\n(What does that have to do with anything!?)\nKlavier:\nThere was a reason why Machi Tobaye pretended to be blind. But it wasn't for his own sake. ...Getting the picture now?\nApollo:\nIt wasn't for himself...!?\nJudge:\nWell, Mr. Justice? Can you present evidence that shows us why the defendant had to feign blindness?\nEma:\nYeah! Wasn't she supposed to be the \"landscape painter in sound\" or something?\nKlavier:\nWell, since we have her here...\nEma:\n!\nKlavier:\n...Why not ask Lamiroir herself? I believe she is still in the witness waiting room.\nTrucy:\nA-Apollo, what does this mean for our case!?\nApollo:\nDon't ask me! I had no idea she couldn't see... I hadn't even imagined it until now!\nJudge:\nBailiff! Bring in Lamiroir!\nKlavier:\n...Lamiroir. It pains me deeply to call you before us again in this way. And yet I must.\nLamiroir:\nPlease, do not be concerned on my behalf.\nApollo:\n(Those eyes... She really can't see? Really?)\nLamiroir:\n...... It is true.\nApollo:\n...!\nLamiroir:\nHow funny it is that a tiny lie born in the Borginian countryside... ...would one day grow to entangle the entire world.\nJudge:\nSo... So you are...!?\nLamiroir:\nYes. As I mentioned before... ...I have no memory of the time before I became Lamiroir. Know too that my memories begin in darkness. The word \"light\" has no meaning for Lamiroir.\nJudge:\nI see...\nKlavier:\nYou may recall me saying something toward the beginning of this trial, Herr Forehead.\nApollo:\n...? What's that?\nKlavier:\nI believe I said it was unfortunate this crime had no \"direct\" witnesses.\nApollo:\nAh...\nKlavier:\nNow, Lamiroir, I must ask you to stand once more. Will you testify to the court about your eyes?\nLamiroir:\nOf course. It was never my intent to deceive any of you. May I begin, Your Honor?\nJudge:\nUh, yes, yes of course... Though I admit, I'm a little lost here.\nApollo:\nI think we're all a bit lost here, Your Honor.\nWitness Testimony\n-- Lamiroir's Eyes --\nLamiroir:\nI have no memory of the \"light\".\nI debuted in a world of darkness and sound...\nMy producer came up with my PR line before he knew this.\nSo, silly as it may sound, I had to pretend I could see.\nEveryone on my staff knew, of course, but no others.\nJudge:\nBut... this is a murder trial!\nLamiroir:\nI apologize. It was part of my contract, you see. I was to keep my blindness a secret, no matter what. Music is everything for me. I never imagined something like this would...\nKlavier:\nShe told us the truth in the beginning. When she said she \"saw nothing\".\nJudge:\nVery well. Does the defense have anything to add?\nApollo:\n...... I'd like to cross-examine.\nTrucy:\nBut, what is there left to ask!?\nApollo:\nThere was one thing in her testimony that bothered me.\nKlavier:\nPerhaps it is best we let you get it out of your system. Someday you'll come to understand... ...the importance of thinking for yourself.\nJudge:\nVery well. The defense may proceed. However... Be aware this court will not tolerate any questions deemed too stressful to the witness.\nApollo:\n...OK. (There was only one part that bothered me... Just let me ask about that and I'll be happy.)\nCross Examination\n-- Lamiroir's Eyes --\nLamiroir:\nI have no memory of the \"light\".\nLamiroir:\nI debuted in a world of darkness and sound...\nLamiroir:\nMy producer came up with my PR line before he knew this.\nLamiroir:\nSo, silly as it may sound, I had to pretend I could see.\nLamiroir:\nEveryone on my staff knew, of course, but no others.\nApollo:\n(I suppose that's her confession, of sorts. There's just one part that bothers me... ...And I'm going to get to the bottom of it.)\nApollo:\nWhen you say your staff, do you include Mr. LeTouse?\nLamiroir:\nOf course. He was my manager.\nApollo:\n(So he knew... and that's what's been bugging me!)\nJudge:\nSomething the matter, Mr. Justice?\nKlavier:\nI believe I know what is bothering our young defense attorney. ...You are thinking of when you discovered the body, yes?\nApollo:\n...!\nTrucy:\nIs he right, Apollo?\nApollo:\n...Yes, I was.\nLeTouse:\n......Nnnh......\nApollo:\n...! (He... He's alive!) Mr. LeTouse! Can you hear me!?\nLeTouse:\n...Cold... so cold... Witness...\nApollo:\nYou're cold? D-Don't worry, you're going to be fine! Help is on the way!\nLeTouse:\n...Can't s...see...\nApollo:\nHang in there, Mr. LeTouse! Tell me, who was the witness?\nLeTouse:\nThe wi...witness...is ...si...si...ren...\nApollo:\nMr. LeTouse told me to ask the witness, and he named you.\nLamiroir:\n...!\nApollo:\nWhy would he do that? He knew you were blind!\nLamiroir:\nI... I don't know...\nKlavier:\nTsk, tsk.\nApollo:\n...!\nKlavier:\nWhat did I just say? You need to learn to think for yourself.\nApollo:\nMeaning what...?\nKlavier:\nThere is no mystery here if you recall everything he said. Think of his last words once more.\nJudge:\n\"The witness... siren\"? We've heard them many times. Along with a little play-acting by our defense.\nKlavier:\nI remember them well myself, but that statement is not to what I refer. I mean what he said before that.\nApollo:\n...Before? (What came before that...?) Ack!\nKlavier:\n...That's right. He tried to tell you. When he said \"can't see\" he wasn't talking about himself. He was talking about the witness!\nJudge:\nI see!\nKlavier:\nToo bad the defense did not. Well, Herr Forehead? Try relaxing and \"looking\" at the facts first next time.\nApollo:\n...Urk!\nJudge:\nOrder! Order!\nKlavier:\nRecall Lamiroir's earlier testimony...\nLamiroir:\nI was on my way from the stage to the backstage exit. There were two shots... I couldn't do anything to stop it.\nJudge:\nBut she couldn't have heard those gunshots! I thought we proved that...\nKlavier:\nThat is not the most important point here.\nJudge:\nHmm?\nKlavier:\nThe moment he was shot, Mr. LeTouse \"witnessed\" her through that window. ...Why else would he have named her as the witness?\nApollo:\nAh...\nLamiroir:\nBut I really did hear them! Two gunshots... and the man's voice!\nKlavier:\nUnfortunately, such a thing was impossible. The window was closed. We have already run a simulation, of course.\nLamiroir:\nBut it was so clear... If I heard that voice again, I would know it in an instant...\nJudge:\nHmm...\nBailiff:\n...Your Honor!\nJudge:\nWhat is it, Bailiff? Can't you see we're in session here!?\nBailiff:\nWe have the results back from the investigation!\nJudge:\nThe investigation...?\nKlavier:\nAh, the Interpol number that Mr. LeTouse left us.\nJudge:\n...! Well let's hear it! ...We will continue this cross-examination afterward. Detective Crescend! Your report please!\nDaryan:\nI asked Interpol about that number. I'm sure you'll find their answer intriguing.\nKlavier:\n...Quick work as always, Daryan.\nJudge:\nWell, tell us about the number! Is the defendant a secret agent!?\nDaryan:\n\"IPXX314206\"... The agent registered under that number... ...was Romein LeTouse.\nKlavier:\nWhat...?\nDaryan:\nOur undercover Interpol agent was Mr. LeTouse himself! He was apparently in the middle of an operation.\nApollo:\nSo, when he wrote those letters...\nDaryan:\n...He was trying to tell us his own identity. And a cautious killer tried to wipe them away.\nTrucy:\nMr. LeTouse was an undercover Interpol agent... So him being Lamiroir's manager...\nApollo:\n...Was just a cover, most likely.\nDaryan:\nThere's one other important detail I found.\nKlavier:\nWell, out with it.\nDaryan:\nIt concerns that 45-caliber revolver, the murder weapon. Apparently, it belonged to Romein LeTouse. He had an Interpol permit to carry firearms. ...And the registration number on the revolver matched.\nKlavier:\nSo the victim was killed with his own weapon, which makes sense. It's hard to imagine someone who wasn't an Interpol agent with such a large revolver.\nApollo:\n(So the victim was an Interpol agent on an undercover op... I wonder how that ties into everything.)\nTrucy:\nIt's got to tie in somehow, you'd think.\nApollo:\nYeah, somehow...\nJudge:\nThanks for looking into that for us, Detective Crescend. It's a great help.\nDaryan:\nOh, no problem at all, Your Honor. ...I'll be heading out...\n???:\nLamiroir:\nWait!\nJudge:\nLa-Lamiroir! Is something the matter?\nLamiroir:\nThat voice just now...\nKlavier:\nDaryan?\nLamiroir:\nMr. Daryan, is it...? ............ It was him. I am sure of it.\nJudge:\nIt was \"him\"?\nKlavier:\nY-You aren't saying--!?\nLamiroir:\nThat voice I heard, talking to Mr. LeTouse... when I heard the gunshots fired. It was him! It was Mr. Daryan!\nKlavier:\nIs this some kind of a joke!?\nApollo:\nWhaaaaaaaat!?\nDaryan:\n...No way...\nApollo:\n(The courtroom fell into such a chaotic state, the trial had to be suspended temporarily. I'd never seen that happen before. Of course, it's not every day that you get an accusation like that one. Lamiroir, fingering Daryan Crescend. Not only is he a guitarist, he's a detective! Could it really have been his voice Lamiroir heard? Things were changing fast, and frankly, I wasn't sure I could keep up with it.)\nTrucy:\nHey! No wimping out now, Apollo!\nTo be continued.",
  "characters": [
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Phoenix Wright",
      "age": "33",
      "gender": "Male",
      "description1": "A pianist who can't play a lick. Formerly an ace defense attorney of some renown."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Trucy Wright",
      "age": "15",
      "gender": "Female",
      "description1": "Future star magician, and Phoenix Wright's daughter. Fond of her Mr. Hat trick."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Klavier Gavin",
      "age": "24",
      "gender": "Male",
      "description1": "Star prosecutor and leader/vocalist for the rock group, the Gavinners."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "LeTouse",
      "age": "35",
      "gender": "Male",
      "description1": "Lamiroir's interpreter. His first name is \"Romein\".",
      "description2": "Shot during the performance. He died after leaving me with his last words.",
      "description3": "Victim in this case, actually an undercover Interpol agent."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Lamiroir",
      "age": "40",
      "gender": "Female",
      "description1": "Singer lauded as the \"Siren of the Ballad\", from the tiny country of Borginia.",
      "description2": "Famed singer from Borginia. Hid the fact that she is blind."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Machi Tobaye",
      "age": "14",
      "gender": "Male",
      "description1": "Lamiroir's favorite pianist. He is blind.",
      "description2": "Blind pianist. Arrested on suspicion of having shot Mr. LeTouse.",
      "description3": "Defendant in this case. Concealed the fact that he could actually see.",
      "description4": "Defendant in this case. Turns out he isn't blind and can understand English."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Ema Skye",
      "age": "25",
      "gender": "Female",
      "description1": "Detective obsessed with forensics. In charge of the initial investigation."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Daryan Crescend",
      "age": "24",
      "gender": "Male",
      "description1": "Guitarist for the Gavinners. His day job is as a detective in Criminal Affairs, Div. 3."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Valant Gramarye",
      "age": "44",
      "gender": "Male",
      "description1": "Famous magician, often on TV. Fond of exaggeration.",
      "description2": "A famous magician, responsible for the illusion used in the concert."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "How long did I yearn for one of these? Just putting it on makes me feel... ready."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Postcard",
      "type": "Other",
      "obtained": "Retrieved from Gavinners's Dressing Room.",
      "description1": "Lamiroir's own publicity postcard. Click here for details."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Lyrics Sheet",
      "type": "Documents",
      "obtained": "Received from Prosecutor Gavin.",
      "description1": "Contains the lyrics to Lamiroir's ballad. Click here for details."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Investigation Request",
      "type": "Documents",
      "obtained": "Received from Prosecutor Gavin.",
      "description1": "Information concerning the crime to be restricted to police and related parties."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Brooch",
      "type": "Other",
      "obtained": "Retrieved from Lamiroir's Dressing Room.",
      "description1": "Found at the crime scene. Seems strangely familiar...",
      "description2": "Found at the crime scene. Turns out it belongs to Lamiroir."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Revolver",
      "type": "Weapons",
      "obtained": "Retrieved from Lamiroir's Dressing Room.",
      "description1": "The murder weapon.  A deadly, high-caliber revolver.",
      "description2": "The murder weapon. A deadly, high-caliber revolver belonging to Mr. LeTouse."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Key Ring",
      "type": "Evidence",
      "obtained": "Retrieved from Lamiroir's Dressing Room.",
      "description1": "Mr. LeTouse died clutching this. Note the heart-shaped ring.",
      "description2": "Found in the victim's left hand. Holds keys to a guitar case and a motorcycle."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Mixing Board",
      "type": "Other",
      "obtained": "Received from Prosecutor Gavin.",
      "description1": "Allows music to be played in separate tracks. Click here to use."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "LeTouse's Autopsy Report",
      "type": "Reports",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "Death due to loss of blood from a gunshot wound. Est. time of death: 9:00-9:30 PM."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Crime Photo",
      "type": "Photographs",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "Victim shot in shoulder in Lamiroir's room. Click here for details."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Diagram",
      "type": "Maps",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "The crime scene was Lamiroir's dressing room. Click here for details."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Video Tape",
      "type": "Other",
      "obtained": "Received from Valant Gramarye.",
      "description1": "Taped recording of Lamiroir's performance. Click here for details."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Headset",
      "type": "Evidence",
      "obtained": "Received from Valant Gramarye.",
      "description1": "Retrieved from Backstage Hallway. Receiver/transmitter for voice signals. All concert staff wore one.",
      "description2": "Receiver/transmitter for voice signals with a 30-foot range. All concert staff wore one."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Switch → Remote Trigger",
      "type": "Other",
      "obtained": "Retrieved from the stage.",
      "description1": "Found on the stage. It's a switch for something, and that's about all I know.",
      "description2": "Found on the stage. Triggers an igniter. Use with caution.",
      "description3": "Found on the stage. Triggers an igniter within 30 feet."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Forum Diagram",
      "type": "Maps",
      "obtained": "Received from Ema Skye.",
      "description1": "Cross-section diagram of the Sunshine Coliseum. Click here for details."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Igniter",
      "type": "Evidence",
      "obtained": "Retrieved from Lamiroir's Dressing Room.",
      "description1": "Found at the crime scene. Emits a flame when triggered by remote control.",
      "description2": "Identical igniters in Gavin's guitar and at the crime scene. Triggered by \"Remote Trigger\"."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Borginian Newspaper",
      "type": "Documents",
      "obtained": "Received at Prosecutor Gavin's Office.",
      "description1": "Article about the case. It doesn't mention the lyrics of Lamiroir's ballad."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Prosecutor Gavin's Guitar",
      "type": "Other",
      "obtained": "Received at Prosecutor Gavin's Office.",
      "description1": "A gift from Lamiroir, sent from Borginia. Burned the night of the concert."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Replica",
      "type": "Evidence",
      "obtained": "Received at Prosecutor Gavin's Office.",
      "description1": "Replica of something, held by Mr. LeTouse. Apparently the focus of his investigation.",
      "description2": "Borginia Cocoon replica, held by Mr. LeTouse.",
      "description3": "Replica of a cocoon from which a remedy for \"incuritis\" may be extracted."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Newspaper Article",
      "type": "Documents",
      "obtained": "Received from a court bailiff.",
      "description1": "Article about the Chief Justice's son, who is inflicted with \"incuritis\"."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Burnt Fragments",
      "type": "Evidence",
      "obtained": "Received from Phoenix Wright.",
      "description1": "Found at the crime scene, bearing a gunpowder residue. Possibly a firecracker?"
    }
  ],
  "turns": []
}