{
  "previousContext": "Turnabout Serenade\nTranscript\nPart 1\nPart 2\nPart 3\nPart 4\nEpisode 3Turnabout Serenade\nLet's rock!!!\nKlavier:\nWe love you! Rock on, everyone! This party's not over yet! Get out your handkerchiefs for our special guest! That's right, baby! The night's just getting started!\nThank you for coming to the Gavinners: \"Guilty as Charged\" Tour! This ends the first part of tonight's show. There will now be a 20-minute intermission.\nJuly 7, 8:05 PMBackstage Hallway\nExamine evidence\nAttorney's Badge\nBack side\nApollo:\nThere's a number inscribed on the back of the badge. There are many numbers like it, but this one is mine. Proof that I'm an attorney. To tell the truth, I get a happy feeling inside just looking at it.\nTrucy:\nThis is so cool! Us, at a Gavinners concert!\nApollo:\nHuh? Did you say something? My ears are still ringing... The Gavinners: putting the \"sick\" back in \"music\".\nTrucy:\nWell, I thought Mr. Gavin was really nice! Sending us those tickets at 20% off! They're hard to get ahold of, you know.\nApollo:\nWhen you invite people to a concert it's usually free.\nTrucy:\nLet's head to his dressing room, Apollo! You know, like we're a couple of VIPs. I've always dreamed of being a VIP at a Gavinners show!\nApollo:\nUm, Trucy... You didn't know who Prosecutor Gavin was before that case. What kind of fan doesn't know the lead vocalist's name?\nTrucy:\nOh! This guy, well, he was more like a prince really. He let us in...\nTrucy:\nKlavier... What a lovely name! He's so dreamy!\nTrucy:\nYeah, but I'm a girl! I'm supposed to swoon over gods of rock!\nApollo:\nGod-awful, maybe.\nTrucy:\nI bought all their stuff on the way home from the trial! I got twelve Gavinners albums, and fifteen concert videos!\nApollo:\n...That was quite a bit of impulse shopping.\nTrucy:\nI got an advance on my next 15-years-worth of allowance.\nApollo:\n...For Mr. Wright that sounds like a real act of generosity.\nApollo:\n(Who would have imagined me here... ...at a Gavinners concert, watching Prosecutor Gavin \"rock\". To be honest... ...he was kind of cool. And I'm kind of envious. Not that I'd ever admit that to Trucy.)\nJuly 7Gavinners's Dressing Room\nKlavier:\nAh, you made it.\nTrucy:\nMr. Gavin! Thanks so much for the tickets!\nApollo:\n...And the invoice you sent along with them.\nTrucy:\nYou were incredible up on stage, Mr. Gavin!\nKlavier:\nNothing like music to brighten the mood after a trial, ja? ...And we're almost ready for our next act. I'm looking forward to it myself.\nTrucy:\nLamiroir's singing, right!? The \"Siren of the Ballad\"?\nApollo:\nOh yeah... That flyer said she flew all the way over for this show.\nKlavier:\nThat's right. I happened to catch her show while overseas. Her voice... is divine. I knew I had to invite her to perform with us.\n???:\nLamiroir says... \"You praise me too highly.\"\nApollo:\n(Whoa! Who's this guy? He's huge!)\nKlavier:\nAh, allow me to introduce Mr. Romein LeTouse. ...Lamiroir's manager. And her interpreter, incidentally.\nLeTouse:\nIt is a great honor for us to be here. And a great honor for Lamiroir to be heard in this country.\n???:\n[Foreign text]....\nApollo:\n(That voice... I wish I could understand it... It's beautiful.)\n???:\n[Foreign text]... [Foreign text]...\nTrucy:\nOoooh! It's Lamiroir! I'm actually meeting Lamiroir!\nApollo:\n(Lamiroir... Mysterious songstress... Her quiet, deep song glides through the air... Lilting above a sparse, but elegant piano accompaniment. Now this is music. She's a real artist.)\nLamiroir:\n[Foreign text]....\nLeTouse:\nLamiroir says... \"We have long looked forward to this joint performance.\"\nKlavier:\nAh, Lamiroir... Your voice... ...It is art.\nLamiroir:\n[Foreign text]....\nLeTouse:\n\"Yet without his piano to guide me... ...it is but a voice.\"\n???:\n....................\nApollo:\n(I've seen this kid somewhere before.)\nTrucy:\nHe plays piano at all of Lamiroir's concerts! He's cute! And he's a really good pianist.\nApollo:\nGood pianists are a dying breed, I hear.\nLeTouse:\nAllow me to introduce Machi Tobaye. ...He is blind. This is why he never strays far from Lamiroir. They are always together.\nMachi:\n....................\nApollo:\n(They're like characters from some fairy tale..)\nTrucy:\nLamiroir's so, um, what's that word... Exotic! ...And mysterious!\nApollo:\nShe does seem quite pretty. At least, her eyes do.\nKlavier:\nHers is a kind of \"sight-seeing musique\"...\nTrucy:\nHuh?\nKlavier:\nShe travels the globe, putting the sights she sees into song. Even though her appearance and voice are exotic... ...her songs remind us of something close, and warm.\nTrucy:\nSights into song... That's so poetic!\nKlavier:\nShe was gracious enough to put music to my lyrics tonight. \"The Guitar's Serenade\". ...I hope you enjoy it.\nTrucy:\nI can't wait!\nKlavier:\n...And now it is time. For the next part, we're giving the Gavinners's hard rock a little rest. Lamiroir, the stage is yours.\nLamiroir:\n[Foreign text]....\nLeTouse:\nThe band members will not play during Lamiroir's ballad. Only Machi's tender tones, and Lamiroir's dulcet voice...\nKlavier:\n...And my guitar, of course.\nTrucy:\nWoo hoo! Nights like this make it all worthwhile, you know!\nApollo:\n(I should have learned to play the guitar. There's not much romance in Chords of Steel.)\nKlavier:\nShall we hit the stage, then?\nTrucy:\nGood luck, Mr. Gavin!\nKlavier:\nTake care your hearts aren't stolen away, ja?\nTrucy:\nLet's get back to the concert hall, Polly!\nSugar, Sugar...\nO that night, in your embrace.\nWhen you stole away the keys\nmy heart held on to so tight.\nPleasure...\nBut a fleeting melody\nIt wraps itself around me,\nAnd now through the air I fly.\nWoh... Woh...\nBurning on in my heart. Fire.\nBurn my love away. All away.\nLike a bullet of love. Fire.\nTake my life away. All away.\nGuitar, Guitar...\nUp together to the sky.\nJuly 7, 9:05 PMBackstage Hallway\nTrucy:\nWow, wasn't Lamiroir amazing? I *sniffle* I even cried a little!\nApollo:\nI was surprised Prosecutor Gavin actually burned his guitar.\nTrucy:\nYeah! That even surprised me, and I'm a magician! What a production!\nApollo:\nWhat a destruction. (I don't think Prosecutor Gavin was expecting it either, oddly. He looked as surprised as I was.)\nTrucy:\nIs that what they call \"risking life and limb for art\"? I think he's my new hero!\nApollo:\nI'm not sure I'd call that \"art\".\nTrucy:\nWell, what are we doing here? Let's get going to Mr. Gavin's dressing room! There's twenty minutes till the last part of the show!\nApollo:\nHow many breaks does this band need?\nJuly 7Gavinners's Dressing Room\nKlavier:\nWhat the heck was that!? I was never consulted about it!\nStaff:\nS-Sorry, Mr. Gavin, sir! I've asked the man in charge...\nKlavier:\nI play new rock, not Great Balls of Fire! Speaking of fire, I have a good mind to fire whoever's responsible!\nTrucy:\n...He seems upset.\nKlavier:\nApollo Justice! Were you the one who tried to torch me!?\nApollo:\nHey, I didn't do it!\nTrucy:\nSo much for risking your life for art...\nKlavier:\n\"The Guitar's Serenade\" is ruined! Ruined!\nTrucy:\nWell, let's try to talk to him at least.\nApollo:\n...I'm not sure that's the best move right now.\nExamine\nBlack gloves\nApollo:\nThose are some pretty heavy-duty gloves. Maybe they have to carry around hot pots or something?\nTrucy:\nThey are a little thick. I couldn't even stuff a pigeon in those.\nApollo:\n...... That's exactly what I was thinking.\nBowl of stew\nApollo:\nWhy is that plastic bowl of stew sitting there?\nTrucy:\nMaybe they use it for interrogating bad guys... \"'Fess up to what you did, and we'll let you eat that stew!\"\nApollo:\nThat's just mean.\nTrucy:\nIt gets worse! See, if the bad guy confesses, they say: \"OK, eat it... If you can! See, it's made of plastic!\" It's like, you don't know which ones are the real bad guys!\nApollo:\nI think you need to take a deep breath, Trucy.\nChains\nApollo:\nThis place is decorated like a high-school dance. Though I think our decorations were paper, not... chains.\nTrucy:\nThe Gavinners are into chains. It's part of their image.\nApollo:\nHuh, no kidding.\nTrucy:\nEver since they used chains on the cover art for \"Gunna Lock U Up\".\nApollo:\nThey're really into the whole police thing, aren't they.\nTrucy:\nIt'd be cooler if they turned that red light on.\nApollo:\n...They don't have to turn on the red light.\nCruiser Guitar\nTrucy:\nOoh! A \"Cruiser Guitar\"! They sold those to commemorate five years of the band.\nApollo:\nRocking it hard... under the speed limit.\nTrucy:\nThere's a \"Cruiser Bass\", and a \"Cruiser Drum Set\", and a \"Cruiser Keyboard\"... ...Even a \"Cruiser Whistle\".\nApollo:\n...I'm not so sure about that last one.\nTrucy:\nIt's for blowing the whistle on criminals!\nApollo:\n...I don't think that requires an actual whistle, Trucy.\nLipstick on mirror\nApollo:\nSomeone drew the Gavinners's mark in lipstick here.\nTrucy:\nLipstick... I'd like to wear lipstick someday.\nApollo:\nOh? You don't use lipstick yet, Trucy?\nTrucy:\nDaddy won't let me. \"Not until I learn to play piano,\" he says.\nApollo:\nYou'll be waiting a long time then, I'm afraid.\nPolice uniform\nApollo:\nA police uniform hangs on the stand here.\nTrucy:\nOoh! I want to try it on! \"Nothing to see here, move along.\"\nApollo:\n...It's OK, you don't have to go that far to be \"special\". I mean, you're not exactly the type who's \"just another face in the crowd\".\nTrucy:\nReally? You think so? Hmm... I guess you're right!\nApollo:\n(...Now I feel like a meanie for making that insinuation.)\nPostcards\nTrucy:\nLook! It's a postcard of Lamiroir!\nApollo:\nWhat are these letters at the bottom? I've never seen these before.\nTrucy:\nIt must be her native tongue, Borginian! (Changed from [It must be her native tongue, Borginese!] in the original release)\nApollo:\nBorginian, huh...? (Changed from [Borginese, huh...?] in the original release)\nPostcard added to the Court Record.\nPostcards (subsequent times)\nApollo:\nIt's a stack of Lamiroir's postcards. They have an air of mystery to them that matches her voice.\nRed Badger Guitar\nTrucy:\nThat guitar! That's the legendary AA-400! The \"Red Badger\".\nApollo:\nI thought rock was supposed to be rebellious, not... civic.\nTrucy:\nEvery aspiring guitarist wants one of these! They even paint their own guitars to look like it.\nApollo:\nAh, the fickleness of youth.\nTrucy:\nYou should dye your hair \"Badger Red\", too!\nApollo:\nI like my hair the way it is, thank you very much.\nTrucy:\nArgh, the stubbornness of age!\nSpeaker\nApollo:\nThat speaker looks familiar.\nTrucy:\nOh?\nApollo:\nYeah, like the one for the P.A. system back in school.\nTrucy:\nOh, we have one of those in my classroom, too!\nApollo:\n(That's right, she's still in junior high. ...I feel old.)\nWall poster\nApollo:\nWhat's a police recruitment poster doing here? \"Rock on ...with the police.\"\nTrucy:\nMaybe they're trying to trick kids into thinking the police are some kind of band.\nApollo:\nBut that's just silly. Who'd name a band the \"police\"?\nMove\nTrucy:\nApollo! Where do you think you're going!?\nApollo:\nHuh? Oh, I was just...\nTrucy:\nLet's talk to Mr. Gavin while we have the chance!\nApollo:\n(OK, I suppose...)\nTalk\nThe flaming guitar\nTrucy:\nYou mean, the guitar... That wasn't part of the act?\nKlavier:\nPart of the act!? Who'd burn up a guitar on purpose!?\nTrucy:\nBut, it worked really well with the lyrics just then... Burning on in my heart. Fire. Burn my love away. All away.\nKlavier:\n...... ! Wait, you think the audience thought it was...?\nApollo:\n(Sounds like he got lucky.)\nTrucy:\nThey probably thought it was part of the act. At least, I did.\nKlavier:\n......\nApollo:\n(He got lucky, and he didn't realize it...)\nKlavier:\nA-Anyway, that guitar was the Ferrari of guitars! All the speed, all the sound ...and all the price. If I burned one of those at every show I'd go broke!\nApollo:\nUnusually frugal for a rock band.\nTrucy:\nTry saying that to Mr. Gavin.\nKlavier:\nAchtung! Today's been one disaster after another... My hog won't run, my guitar case's broken...\nTrucy:\nDaddy told me there'd be days like these.\nLamiroir's song\nTrucy:\nW-Wasn't Lamiroir's song incredible!? You worked on it too, right, Mr. Gavin?\nKlavier:\nAh, yes, thanks. It was a collaboration. I wrote the lyrics, and she wrote the melody.\nTrucy:\nYou know... I was surprised she could sing in English...\nKlavier:\nI'm sure she practiced a long time for this day. Ah, here.\nApollo:\nWhat's this...?\nKlavier:\nA lyrics sheet. It's yours. Signed by myself and Lamiroir.\nTrucy:\nYippee! Thanks so much!\nApollo:\n(All I ever get to sign are client defense agreements.)\nLyrics Sheet added to the Court Record.\nLamiroir's song (subsequent times)\nKlavier:\nFor that song, I wrote the lyrics and she wrote the melody. It was a collaboration.\nTrucy:\nThat's so cool... I'd love to do a collaboration myself some day, or a song...\nApollo:\nYou can't do a collaboration alone, you know, Trucy.\nTrucy:\nI know that!\nKlavier:\nThen practice singing those lyrics. If you get good, I'll invite you into the band.\nTrucy:\nEeeek! R-Really!? I'll sing 'em every day!\nApollo:\nWhat about your magic act?\nTrucy:\n...... Maybe I can be a singing and dancing magician!\nApollo:\nThen you'd end up only being average in both, no?\nKlavier:\nNot at all. Why, I'm a rock star and a star prosecutor.\nApollo:\nUrk! (That's right, he is. I'd totally forgotten.)\nTrucy:\nOoh! See, you can excel in more than one thing!\nApollo:\n(Ugh... I'm having trouble enough with just one thing.)\nPresent\nAttorney's Badge\nKlavier:\n...... Herr Forehead.\nApollo:\nY-Yeah?\nKlavier:\nUnderstand that I am not Prosecutor Gavin now. I am lead vocal of the Gavinners. That badge sings a different song... on a different stage.\nApollo:\nRight... (I wish I had an alter-ego to hide behind sometimes.)\nPostcard\nApollo:\nWhat are those postcards there, Prosecutor Gavin?\nKlavier:\nEh? Lamiroir's, you mean? It's part of her PR campaign. I received a stack. You can have one if you'd like.\nApollo:\n...Ah, that's good to hear. Trucy already swiped one, is why.\nTrucy:\nEh! B-But that... But I... ... What's the big idea!? Making me look like a criminal... It was... a collaboration! I've always wanted to do a collaboration!\nKlavier:\nUsually, a collaboration is for creating, not stealing.\nApollo:\n...Let the kid dream.\nLyrics Sheet\nKlavier:\nI wrote those lyrics, you know. Though it was Lamiroir who gave them life.\nTrucy:\nWow... That's beautiful!\nApollo:\n(Grr. Maybe I should try to write some lyrics someday.)\nAfter clearing all Talk options:\nKlavier:\nAlmost time for the third act of the night.\nTrucy:\nOh! There's more?\nKlavier:\nYes! Lamiroir's part is done. Now it's time for us to drop our groove again, ja? Hope you're ready to catch it.\nTrucy:\nWoo hoo! Ready, Apollo?\nApollo:\nUh... I think I'll pass.\nTrucy:\nEh.\nApollo:\nI liked the bit with Lamiroir. But the rest could use a volume knob. Turned way down.\nTrucy:\nAh, Apollo, you're getting old!\nApollo:\nAck! (Does 22 quality as \"old\" to a 15-year-old...?)\nTrucy:\nWell, I'm going!\nKlavier:\nLet the old folks rest backstage, ja? ...Time to rock.\nApollo:\n(Hey, you're older than I am!)\nExamine\nBlack gloves\nApollo:\nThick leather gloves and sunglasses... Maybe I'll try these on... ...On second thought, no. They might be evidence for one of Prosecutor Gavin's cases.\nBowl of stew\nApollo:\nA delicious bowl of stew! ...Made of plastic. Huh, the bottom of the bowl has a \"G\" on it. They sell these at concerts? Whatever happened to T-shirts?\nChains\nApollo:\nChains dangle from the ceiling. They aren't \"glimmerous\", but I bet Detective Skye'd have something to say about them.\nCruiser Guitar\nApollo:\nThat guitar looks like it was made out of a cop car door. ...... That's right. Trucy's not here to set me straight. Now I feel kinda lonely.\nLipstick on mirror\nApollo:\nThere's graffiti on the mirror... in lipstick. Wait, but the Gavinners are all guys. ...Maybe Prosecutor Gavin wears lipstick?\nPolice uniform\nApollo:\nA police uniform. Next to it is a policeman's hat, and a pair of handcuffs. One of the band members must like the police. Must be Mr. Gavin's \"bad influence\". ...... I thought rock 'n' roll was all about being rebellious.\nPostcards\nApollo:\nA postcard of Lamiroir... I can't read a single word of the sentence at the bottom. Hmm. Trucy might want one of these. I'll show it to her next time we're here.\nRed Badger Guitar\nApollo:\nThat's an odd guitar. The design is that character I saw in the hallway, but with sunglasses. What a strange mascot. He looks like he's crying. Since when was rock about crying? ...They should name this guy \"Emo\".\nSpeaker\nApollo:\nAn old-fashioned speaker hangs from the ceiling. That must be to monitor what's happening out on stage. I think we had the same kind for my school's P.A. system.\nWall poster\nApollo:\n...That police officer looks ready to rock. Some kids must see this and actually want to be cops. Somehow I don't think a rocking defense attorney would work too well.\nJuly 7Backstage Hallway\nEma:\nHey, it's you! That Wright kid.\nApollo:\nDetective Skye! (I'll let that \"Wright kid\" business pass.)\nEma:\nCall me Ema. There's no need for titles once you've shared a bottle of fingerprinting powder!\nApollo:\nThat's a new one. So, um, Ema, what are you doing here?\nEma:\n...Isn't it obvious? I'm snacking. You think I want to be here!? Me, in charge of security in this pit!?\nApollo:\nSecurity...? Did something happen?\nEma:\nThere's no knowing with that glimmerous fop. Apparently, he's all upset because something was stolen. He wanted security back here during the concert. Where does he get off acting like he's some big rock star?\nApollo:\n(...He is a big rock star.)\nEma:\nHey! You listening to me?\nApollo:\nSo... Where's this door here lead to?\nEma:\nThis one? That's Lamiroir's dressing room. Don't even think of going in there unless you want a piece of Snackoos in your face!\nApollo:\n(Is she ever in a good mood, I wonder?)\nExamine\nBlue Badger doll\nApollo:\nWhat's that odd looking doll doing there?\nEma:\nMUNCH MUNCH... oh, MUNCH, that's the Blue MUNCH Badger.\nApollo:\nCould you try either talking or munching, but not both?\n*ka-tonk*\nApollo:\n(She hit me with a snack.)\nEma:\nServes me MUNCH right MUNCH for going MUNCH out MUNCH of MUNCH my MUNCH way MUNCH\nApollo:\n...... (Sorry, I don't speak Snackoos.)\nEma:\nMUNCH MUNCH MUNCH.\nEarpiece\nApollo:\nWhat's this? Some kind of headset earpiece?\nEma:\nMUNCH MUNCH MUNCH.\nApollo:\nWhy would someone leave this in the hallway?\nEma:\nMUNCH MUNCH MUNCH.\nApollo:\nMaybe Lamiroir's bodyguard dropped it?\nEma:\nMUNCH MUNCH MUNCH.\nApollo:\nEma! Will you stop eating those snacks for one second and listen!?\nEma:\nHah! If you think you're going to pull me away from my snacks just to hear you mumbling... ...on and on about whatever, you're going to be sorely disappointed!\nApollo:\n(...At least I got her to stop munching.)\nInstrument trunk\nApollo:\nThat's a pretty sturdy-looking box there. Maybe it's an instrument case. There's a guitar next to it.\nEma:\nDon't even think about taking that!\nApollo:\nI don't think I could even carry it...\n*ka-tonk*\nApollo:\n(She Snackoo'd me.)\n\"Dressing #1\" door\nApollo:\nThat's Prosecutor Gavin's... er, the Gavinners's dressing room.\nEma:\nPut so much as a hand on the door and I'll Snackoo you.\nApollo:\nHold on! But I just came out of there!\nEma:\nDon't play smart with me!\nApollo:\n(*sigh*)\n\"Dressing #2\" door\nLeads to:\n\"So this is Lamiroir's dressing room.\"\nVending machine\nApollo:\nCome to think of it, I am a little thirsty.\nEma:\nI'll have some tea.\nApollo:\n...... I think I'll get a water.\nEma:\nI'll have tea!\nApollo:\nIf you want tea so bad go buy it yourself!\n*ka-tonk*\nApollo:\n(She Snackoo'd me.)\nEma:\nI'll take a tea.\nWall poster\nApollo:\nA Gavinners \"Guilty As Charged\" tour poster.\nEma:\nThey're plastered all over the place. It's annoying.\nApollo:\nWell, this is the concert venue. It makes sense.\nEma:\nWhy? Everyone here is already here! Why advertise to them?\nApollo:\nPeople like to see the poster at the concert... It's part of the experience.\nEma:\nDo you have to find fault with everything I say?\n*ka-tonk*\nApollo:\n(She Snackoo'd me.)\nTalk\nAny option\nApollo:\nUm... Ema?\nEma:\nMUNCH MUNCH MUNCH.\nApollo:\n(I've never seen someone eat snacks with such vehemence. Better give her a wide berth...)\n*ka-tonk*\nApollo:\n(She Snackoo'd me.)\nPresent\nAnything\nApollo:\nEma, could you take a look at this?\nEma:\nMUNCH MUNCH MUNCH.\nApollo:\nUm... What do you think?\nEma:\nMUNCH MUNCH MUNCH.\nApollo:\n(That must be a bottomless bag of snacks.)\nApollo:\nSo this is Lamiroir's dressing room.\nEma:\nIf you even think about going in there, I'll--\n...BANG...!\nApollo:\n......\nEma:\n......\nApollo:\nWhat was that?\n...BANG...!\nApollo:\nWas that... a gunshot?\n...CRASH...!\nApollo:\n(Something's going on!)\nEma:\nYou, out of my way!\nApollo:\nE-Ema!\nEma:\nLamiroir! Lamiroir!\n......\nEma:\nIt's not locked... I'm going in!\nJuly 7, 9:30 PMLamiroir's Dressing Room\nApollo:\n(What's that awful noise... Oh, it's the concert.) Aaack! That's-- (It's Lamiroir's manager! Mister what's-his-name...)\nEma:\nLeTouse! Oh no... Hey, you!\nApollo:\nM-Me?\nEma:\nWatch this room for me. I have to call for backup!\nApollo:\nR-Right, understood. You want me to make sure no one comes in, right?\nEma:\nAnd don't touch anything! I'll be right back!\nApollo:\n(...What's going on? I just talked to him, and now...)\nLeTouse:\n......Nnnh......\nApollo:\n...! (He... He's alive!) Mr. LeTouse! Can you hear me!?\nLeTouse:\n...Sh...Shot. ...I was...shot.\nApollo:\nWho? Who shot you!?\nLeTouse:\n...I don't know... Ask...\nApollo:\nAsk? Ask what?\nLeTouse:\nAsk... wi...witness...\nApollo:\nWitness... There was a witness!? Who!?\nLeTouse:\n...Cold... so cold... Witness...\nApollo:\nYou're cold? D-Don't worry, you're going to be fine! Help is on the way!\nLeTouse:\n...Can't s...see...\nApollo:\nHang in there, Mr. LeTouse! Tell me, who was the witness?\nLeTouse:\nThe wi...witness...is ...si...si...ren...\nApollo:\n(...\"Siren\"? How can a siren witness anything...?) Mr. LeTouse! Yipes! Ema!? (What was that!?) Wh-Who's there!?\nEma:\nWhat's wrong?\nApollo:\nEma! Did you see anyone just now!?\nEma:\nHuh? No...\nApollo:\n(I could have sworn I heard a door close...)\nEma:\nThe concert's been cancelled. Backup's on its way. Is Mr. LeTouse... ...He's dead, isn't he? That's terrible.\nApollo:\n...! (I lost him!)\nApollo:\n(Romein LeTouse... shot. And I heard his last words... \"The witness is the siren\"... Whatever that means.)\nJuly 7Backstage Hallway\n???:\nThe venue's locked down. We took names and addresses before letting the crowd go.\nKlavier:\nGood work, Daryan.\n???:\nI'll let you know if I find out anything about the victim. Later.\nKlavier:\nIt's investigation time, then, ja, Fräulein Detective?\nEma:\nI don't need some rock 'n' rolling prosecutor to tell me that.\nKlavier:\nOne request I must make... Tell no one, on staff or otherwise, anything of this.\nTrucy:\nOoh, a gag order!\nKlavier:\nNo word gets out, other than that Mr. LeTouse is dead. No word of the cause of death, or of the murder.\nApollo:\nTell no one... Not even Lamiroir?\nKlavier:\nNot even her. We must keep everything under wraps. Oh, one other thing. I'll need your signature on this, Herr Forehead. Yours too, Fräulein.\nApollo:\nOn that? Hmm... An \"Investigation Request\"...?\nTrucy:\nWhy just us?\nKlavier:\nYou two are civilians. It's standard procedure.\nApollo:\n(That should be OK to sign, I think...)\nSigned Prosecutor Gavin's Investigation Request.\nKlavier:\nRight, well, get started with the investigation!\nEma:\nI'm on it already!\nKlavier:\nAh, and one tip for you.\nApollo:\nHuh? Me?\nKlavier:\nTry not to get in the Fräulein detective's way. ...She's in a foul mood today.\nApollo:\n(Gee, I wonder why...)\nApollo:\n(We were all questioned as witnesses... ...And now none of us can go home. We'll investigate alright. ...Our way!)\nTrucy:\n...Somehow I don't see us getting back to that crime scene any time soon.\nApollo:\nI still can't believe I was there when it happened. Not an experience I care to repeat any time soon.\nTrucy:\nThis is no time for navel-gazing! Let's crack this case!\nApollo:\n(I worry about Trucy. She seems to have a very loose idea of what it means to be an \"attorney\". Of course, that's not surprising considering who her father is...)\nTrucy:\nSomething the matter?\nApollo:\nNo... Let's get cracking!\nApollo:\n(I'm the only one who was there... The only one who heard Mr. LeTouse's last words.)\nLeTouse:\nThe wi...witness...is ...si...si...ren...\nApollo:\n(First order of business is to find out what he meant by \"siren\"!)\nExamine\nBlue Badger doll\nTrucy:\nThat's the Blue Badger, the police mascot!\nApollo:\nDoes the Blue Badger have something to do with the band?\nTrucy:\nWell, yeah! The Blue Badger is the Gavinners's mascot, too!\nApollo:\nHuh. Go figure.\nTrucy:\nI hear those things fly off the shelves.\nApollo:\n(I'll have to take a closer look at one some day.)\nEarpiece\nTrucy:\nWhat's that? It looks like some kind of future-phone!\nApollo:\nNot a phone, a transceiver. It's called a \"headset\".\nTrucy:\nWhat's a headset doing on the floor? Wait! Do you think Mr. LeTouse might have been wearing it? Like one of those bodyguards?\nApollo:\nHmm. I don't think he was wearing one when we first met. (The L.E.D. on this thing is lit. It must be on.)\nInstrument trunk\nApollo:\nLooks like an instrument case. A big instrument case.\nTrucy:\nThere's a great magic trick you can do with one of these!\nApollo:\nHuh? What kind?\nTrucy:\nThe \"Miraculous Beautiful Girl Escapes the Case\" illusion.\nApollo:\nSo it's the girl who's miraculous, not the escape?\nTrucy:\nSo picky!\n\"Dressing #1\" door\nApollo:\nThat's the Gavinners's dressing room. The crime scene was Lamiroir's dressing room... ...Next door.\nTrucy:\nNever know where clues might be hiding, Apollo! Let's case this joint!\nApollo:\n(After you, Trucy, P.I.)\n\"Dressing #2\" door\nApollo:\nLamiroir's dressing room...\nTrucy:\nThe scene of the crime!\nApollo:\nWe're not supposed to go in there.\nTrucy:\nBut aren't we involved? Aren't we duty-bound to investigate!?\nApollo:\nSadly, no. (Though, the situation being what it is... Now may be our best chance to do some snooping...)\nVending machine\nTrucy:\nI'm thirsty, Apollo!\nApollo:\n...Want something to drink?\nTrucy:\nHmm... How about... this one! A Steel Samurai Soda!\nApollo:\n(\"Now in Real Steel flavor.\") ...Hmm.\nTrucy:\nHuh?\nApollo:\n...Here, my treat.\nTrucy:\nHey! This isn't enough change.\nApollo:\nThe machines outside are cheaper. This one is highway robbery.\nWall poster\nApollo:\nA concert poster for the \"Guilty as Charged\" Tour.\nTrucy:\nI love that name! \"Guilty As Charged\"!\nApollo:\n...Seems kind of negative to me.\nTrucy:\nWell, why don't we do the opposite! Magician Trucy presents the \"Innocent as Charged\" tour!\nApollo:\nIt kind of loses its impact, doesn't it?\nJuly 7Gavinners's Dressing Room\nTrucy:\nHuh. Looks like nobody's here.\nApollo:\nProsecutor Gavin's probably busy with the case, too. No rest for the wicked.\nTrucy:\nNo rest for us, either, Apollo! Let's get rocking! Rock, rock!\nJuly 7In the Wings\nTrucy:\nHmm. The stage looks empty.\nApollo:\nI was hoping to get a chance to talk to Prosecutor Gavin...\nTrucy:\nOh well. Nothing to do but go to the crime scene, I guess!\nApollo:\nI guess...\nExamine\nComputer\nApollo:\nLook at all these electronic devices. I'm guessing they have something to do with sound.\nTrucy:\nWhy guess when we can fiddle? Hmm... let's see here...\nApollo:\nDon't touch that!\nTrucy:\nA healthy curiosity is the key to a good investigation! When in doubt, fiddle! That's what Daddy always says.\nApollo:\n(They should require parental testing, clearly...)\nGuitar case\nApollo:\nNow that's a big instrument case.\nTrucy:\nThat's a case for a contrabass, I think.\nApollo:\nYou could fit twenty violins in there, I bet.\nTrucy:\nIt may look like a violin, but it's a completely different instrument!\nApollo:\nYou could fit five Trucys in there, I bet.\nTrucy:\nHey! Are you comparing me to an instrument? Hmm. I wonder who left it sitting open like that.\n(Step)ladder\nApollo:\nLook, a ladder. I guess they need one to work on the lights and such.\nTrucy:\nWhy don't they use a stepladder? I prefer stepladders, really. ...Is that so wrong?\nApollo:\nNot wrong, just... well, why do you prefer stepladders?\nTrucy:\n...... They're so much more flexible than plain old ladders!\nApollo:\n...... (I prefer my ladders rigid and stable, thank you.)\nPiano\nTrucy:\nWow, that piano looks much bigger close up! Machi played so beautifully...\nApollo:\nYeah, like a real pianist.\nTrucy:\nThat's just silly, Apollo! How can you call someone as good as Machi a \"pianist\"? Why, that's like throwing him in the same class as Daddy!\nApollo:\n...Good thing Mr. Wright didn't hear that one.\nStage\nTrucy:\nWhat a big stage! It's on a whole other scale than the Wonder Bar!\nApollo:\nThe lights were so bright I couldn't see the whole first part of the concert.\nTrucy:\nI'd love to do my act on a stage like this some day!\nApollo:\nJust hold back on the lights, for my eyes' sake, please.\nTrucy:\nYou'll be too blinded by my magic to worry about lights!\nApollo:\nYou probably don't want to blind the audience if you plan on showing them magic.\nJuly 7Lamiroir's Dressing Room\nEma:\nOh, it's you. I figured you'd come.\nApollo:\nYou have to let us investigate the scene, please!\nEma:\nYou're attorneys, no? Shouldn't you wait until you have a client...?\nApollo:\n(LeTouse did tell me to ask the witness, the siren... ...With his dying breath, no less. Doesn't that count?)\nEma:\n...G-Glare at me all you want, you'll get no snacks from me.\nTrucy:\nPlease! Think of poor Lamiroir!\nEma:\nHmph. Oh well, I suppose. You did find the body with me.\nApollo:\nGreat! Let's get to it!\nTrucy:\nRight!\nEma:\nJust try not to touch anything!\nApollo:\n(She's letting us look! And she's not munching her snacks! This bodes well. There are clues here, I can feel it! Leave no hanger unhung, no spot unspotted!)\nExamine\nAir vent\nApollo:\n......\nTrucy:\nWhat's wrong, Apollo? Your mouth is catching flies.\nApollo:\nAh? Um, nothing. It's nothing.\nEma:\n\"Maybe that's how the killer escaped.\" ...That's what you were thinking, right?\nApollo:\nEh.\nEma:\nWhen we arrived on the scene, the killer had already fled. He or she must have had a way out. And that air vent is one possibility.\nTrucy:\nBut it's much too small.\nApollo:\nHmm... Not if the killer were about your size, Trucy...\nTrucy:\n......\nApollo:\n......\nTrucy:\nI didn't do it!\nApollo:\nEh.\nTrucy:\nI was cutting up the dance floor at the time, thank you!\nApollo:\nI know, I know! Of course I don't think you did it.\nTrucy:\nIt's hard to tell with you, sometimes, Apollo.\nApollo:\n(Hey! What have I done?)\nBrooch\nTrucy:\nOoh, what a pretty brooch! Oh, Ema...?\nEma:\nYou're not going to say, \"Can I have it, please,\" are you?\nTrucy:\nOh.\nEma:\nLook you may be a cute little girl of fifteen... ...but that doesn't get you any special treatment with me!\nTrucy:\nOh...\nApollo:\nIt's not healthy to envy the young, Ema.\nEma:\nIt's not about envy! It's about tampering with evidence!\nApollo:\n(Note to self: Ema lacks a sense of humor. Use caution.)\nEma:\nYou need to learn to respect your elders a little!\nApollo:\n(...Something seems so familiar about that brooch.)\nBrooch added to the Court Record.\nBrooch (subsequent times)\nTrucy:\n......\nApollo:\n(Trucy's still after that brooch, clearly...)\nEma:\nNo way! If you want one that bad, get your daddy to buy it for you!\nTrucy:\nDaddy always says: \"Trucy, if you want something go find or borrow it.\" Oh, and \"When in doubt, beg.\"\nEma:\nLeave it to Mr. Wright...\nApollo:\n(I'm a little concerned for Trucy's future... But I'm more concerned about the owner of that brooch.)\nBullet holes\nTrucy:\nAre these... bullet holes?\nApollo:\nLooks like it. There are two here in the wall.\nEma:\nFrom the look of it, the victim was shot once in the shoulder. The first shot must have missed.\nTrucy:\nBut there are two holes. Wouldn't that mean two misses?\nEma:\nThe murder weapon is a 45-caliber revolver. It's very powerful. I believe what we're seeing here... ...is the mark left by the second bullet after it passed through his shoulder!\nTrucy:\nOuch... Sounds painful.\nApollo:\n(No kidding. I wonder about this murder weapon...)\nFruit basket\nTrucy:\nOoh! Apollo! Can I eat some of those, please!?\nEma:\nAbsolutely not!\nTrucy:\nI know. I know! But still, I yearn!\nEma:\nLook, you're not the only one eyeing that fruit here.\nTrucy:\nWell then, what are we waiting for? Let's eat!\nEma:\nRight!\nApollo:\nWhoa whoa whoa! Stop it! Are you two crazy? Ema, you of all people should know better...\nEma:\nBut she tempted me! She's a... She's a temptress!\nApollo:\n(Please, grow up...)\n(Step)ladder\nApollo:\nHuh, another ladder.\nTrucy:\nActually, it's technically a stepladder.\nApollo:\nWell hello, Ms. Fancy Pants! Please forgive my lack of ladder discrimination.\nTrucy:\n! ......\nEma:\nI'm less worried about the stepladder, and more worried about why it's there.\nApollo:\n(Why is the ladder there? Well, to climb, right? To reach something on the ceiling?)\nTrucy:\n...... I still say it's a stepladder.\nPoster right of TV\nApollo:\nWhat's this poster...?\nTrucy:\nLet's see... \"This Summer: A Legal Eagles Production of 'Case Closed'.\" ...Looks like a poster for a different show.\nApollo:\n...One I wouldn't mind seeing real soon.\nPoster above TV\nApollo:\nThere's another Gavinners poster here.\nEma:\nI'm just about sick of seeing those, personally. Maybe I'll tear it down! Ha ha!\nApollo:\nNo tampering with the crime scene, Ema!\nEma:\nHmph. Maybe there's something else I can tear to shreds...\nTrucy:\nD-Don't look at me!\nSpeaker\nApollo:\nThat speaker was blaring at the time of the murder...\nEma:\nAh, that's for monitoring the stage from this room.\nTrucy:\nMonitoring?\nEma:\nIt pipes in a real-time feed from the stage microphones. Useful for knowing when your set is coming up.\nApollo:\nYes, I seem to recall it being loud and vaguely musical. (It made it hard to hear Mr. LeTouse's last words.)\nTelevision\nTrucy:\nAh, ah, Apollo! Look at that thing! It's huge! That... That's a TV!!!\nApollo:\nUm, yeah, a wide flatscreen TV. I want one of those.\nEma:\nYou'll be wanting for a long time on your salary, junior. Wait till you're as famous as Mr. Wright was, then dream.\nTrucy:\nI don't think Daddy was ever rich, even when he was in law.\nApollo:\nGreat, just stomp on my dreams why don't you.\nFlower bouquet\nApollo:\nWhat an amazing bouquet. I mean, it's giant.\nEma:\nNot sure I approve. It'd be better if this flower was a bit more... Oh.\nTrucy:\nEek! The flower fell off!\nApollo:\nWhat happened to preserving the crime scene, Ema?\nEma:\nIt's fine! Fine! I'll just put it back, see?\nApollo:\n(How scientific...)\nHairdryer\nApollo:\nThis is one of those... uh, things, right? At the barbers?\nEma:\nA permanent dryer. Want me to curl those bangs of yours?\nApollo:\nUm, no thanks.\nTrucy:\nBetter not mess with his hair, Ema. It's part of his identity, you know.\nRomein LeTouse's body\nTrucy:\nTh-That's a body, isn't it?\nEma:\nSure is. The victim, no less. Let's take a closer look.\nTrucy:\nEeek! G-Go ahead, Apollo. You first.\nApollo:\nMe!? No, you should go first, Trucy, really...\nEma:\nWill you two stop bickering and get over here!?\nApollo:\n(She's munching on Snackoos again. Hope she's not too annoyed.)\nRomein LeTouse's left hand\nTrucy:\nApollo, look at this hand...\nApollo:\nHmm. He's holding something.\nEma:\nHey! No touching!\nApollo:\nYou can throw all the snacks at me you'd like, Ema. But sooner or later... you're going to run out of them.\nEma:\nHmm. You raise a good point. ...I'm a bit intrigued by this scene. Let's take a look.\nTrucy:\nAh... see there? He's holding something! What's this...?\nApollo:\n...A key ring?\nTrucy:\nYou think it might belong to the killer!?\nEma:\nCertainly a possibility...\nApollo:\n(What an unusual key ring... And what unusual keys. This could be a vital clue.)\nKey Ring added to the Court Record.\nRomein LeTouse's left hand (subsequent times)\nApollo:\nThe body was holding a key ring...\nEma:\nI wonder what it could mean?\nTrucy:\nIt must mean something!\nApollo:\nIt doesn't look like the kind Mr. LeTouse would use. So the question is, whose key ring is it?\nEma:\nWell, you're practically a detective there, Apollo.\nTrucy:\nPractically!\nApollo:\n...... (I'm glad it brings them so much joy to mock me.)\nSmeared blood\nTrucy:\nEeek! Is that... blood? Umm... Why don't you examine this one, Apollo. You know more about, uh, red stuff than I do. Yep!\nApollo:\n...Says who? (Something is strange about this blood, though... Is that what it looks like?)\nMirror dresser\nApollo:\nSeeing these mirrors lined up like that makes me think I'm really in a dressing room.\nEma:\nYou are in a dressing room. Hmm... This must be makeup. ...I've never heard of most of these brands.\nEma:\nMaybe they're Borginian?\nTrucy:\nWell, I haven't got a clue, and I doubt those are.\nGift boxes\nApollo:\nLook at all these presents. Lamiroir sure is popular.\nTrucy:\nOoh! I wonder what's inside? We... can't open them, can we?\nEma:\nProbably not a good idea. You never know what you might find in one of these boxes. Bombs, razors, ransom notes... It could be anything.\nTrucy:\n...... I'm never having a birthday party again.\nRevolver\nApollo:\nThis is the murder weapon, isn't it? This revolver...?\nEma:\nThat's right. A big 45-caliber revolver.\nTrucy:\nWow. I wonder who brought this in here? I thought only police were allowed to have one of those.\nApollo:\n......\nEma:\nWhy are you giving me that look!? I didn't do it!\nApollo:\nI didn't...\nEma:\nListen, I was out in the hall eating Snackoos when it happened!\nApollo:\nI know, I know! No one here thinks you did it, Ema.\nEma:\nIt's hard to tell with you, sometimes, Apollo.\nApollo:\n(Hey! What have I done?)\nTrucy:\nWait... If the killer brought a revolver... ...it must mean they had planned this from the start. That's right, right?\nRevolver added to the Court Record.\nRevolver (subsequent times)\nApollo:\nA 45-caliber revolver, very deadly.\nTrucy:\nYou know, Apollo, I was wondering... What's a caliber? And what does the \"45\" mean?\nApollo:\nHuh?\nEma:\nHeh, you want me to tell you? It's the size of the barrel. Simply put, the larger the caliber, the bigger the round. ...The bullet, in other words. Bigger bullets do more damage.\nApollo:\nWow, chalk one point up for forensic science.\nEma:\nYou know it!\nTrucy:\n...But it's not 45 inches, right? That'd be too big. What's the unit of measurement they use, Ms. Science? Well?\nEma:\n...... Hush. Kids shouldn't ask so many questions.\nSmall window\nTrucy:\nLook, there's a little window over here! Maybe the killer escaped through that!\nApollo:\nIt's barely big enough for me to get my head through.\nEma:\nNot to mention it only opens a crack.\nTrucy:\n...What? I was just saying it's possible.\nApollo:\nRight, right, no harm in that. (Except I'm pretty sure it is impossible.)\nEma:\nYou could peek into the room through it, though, you know.\nTalk\nThe victim\nEma:\nMr. \"Romein LeTouse\", wasn't it? He was Lamiroir's manager. And interpreter, apparently. This was his first time in the country.\nTrucy:\nHmm... So I'm guessing he didn't know many people here.\nEma:\nIt doesn't seem likely. Nor can I think of anyone with a motive to murder him. ...Except for one person, of course.\nTrucy:\nOne person...? Who?\nApollo:\nLamiroir. No one here might have had a motive, but she's from...\nTrucy:\nWhat are you talking about!?\nApollo:\nUrk! H-Hey, it was Ema's idea!\nEma:\nI said nothing. MUNCH MUNCH MUNCH.\nApollo:\n(Always with the snacks...)\nTrucy:\nHe's a big man. Or was. I don't think even I would win in a fight with him.\nApollo:\nWhich is why whoever it was used a revolver, I'm guessing.\nEma:\nWe've sent a request to the Borginian Embassy for more info on him.\nThe crime\nEma:\nWell, you and I know more about the crime than anyone.\nTrucy:\nY-You do?\nApollo:\nThat's true. It was us who found the body.\nTrucy:\nWhaaaa-!? Hmph. I guess that's what I miss for watching the concert.\nApollo:\nHey, I wish I was watching the concert. ...Anything would be better than this.\nEma:\nWell, we know the crime took place during the concert.\nApollo:\nAnd when we heard the shot and entered the room... ...the killer was already gone.\nTrucy:\nWhat? But that doesn't make sense! You came in when you heard the shot and no one was here? How did they leave the room?\nApollo:\nHmm, that window is a little too small, isn't it?\nEma:\n......\nApollo:\n(The mystery of the disappearing killer...)\nThe murder weapon (appears after presenting Revolver)\nEma:\nWhat do you think about this revolver?\nApollo:\nWell... it's pretty big. And heavy.\nEma:\nThat's right. It's a 45-caliber. That makes it one of the deadliest revolvers around. Even the police don't carry guns this big.\nApollo:\nReally?\nEma:\nYeah. It doesn't make sense... You don't need so much power to kill at such close range. ...It's overkill.\nTrucy:\nI'm not sure I see the problem. I mean, whenever I go out to eat curry... ...I order it \"extra spicy\". Just to be sure it's spicy. Of course, I can only ever eat one or two bites.\nApollo:\n...Um, and that's not a problem?\nEma:\nThere's another thing about a gun this big. It puts a lot of strain on the shooter.\nApollo:\nStrain...?\nEma:\nYeah. Say, if you were to fire this revolver... ...the recoil would probably dislocate your shoulder.\nTrucy:\nOuuuuuch! It's like the shooter's a victim, too!\nEma:\nYet, the killer used this revolver, and quite well. I'm guessing whoever did it was used to shooting.\nApollo:\n(Used to shooting a high-caliber weapon? Hmm...)\nPresent\nAttorney's Badge\nEma:\nYou always carry that around, do you? ...Just like Mr. Wright.\nApollo:\nHuh?\nEma:\nIt's good to never let yourself forget who you are. I'm proud of you. Keep up the good work.\nApollo:\n(...Come to think of it, why do I carry this around? Though I suppose that's one compliment it's got me.)\nRevolver\nApollo:\nSo this... is the murder weapon? (This revolver is incredibly heavy!)\nEma:\nIt's been fired twice. You can still smell the gunpowder... ...That's odd.\nApollo:\nWhat's odd?\nEma:\nHmm? Oh, nothing.\nTrucy:\nHey, no fair! Tell us!\nEma:\nIt's just, something about this revolver seems... strange.\nApollo:\nStrange...?\nAnything else\nEma:\nHmm, sorry. I can't comment on anything not scientifically relevant. I am a forensic scientist after all.\nApollo:\n(A self-styled one, at least.)\nExamine evidence\nBrooch\nBack side\nApollo:\nA sort of pin-fastener for attaching things to clothes. Not a safety pin-type, though.\nTrucy:\nSo if it's not a safety pin... ...is it a danger pin!?\nApollo:\nI suppose if you stuck it in your eye, then yeah, sure. But you could do that with a safety pin, too, for that matter.\nTrucy:\n...... Thanks for taking the fun out of my danger pin.\nApollo:\n(Aw, you're driving a danger pin through my heart here.)\nRevolver\nMuzzle\nApollo:\nYikes! Don't point that thing at me!\nTrucy:\nDon't worry! I'm an old hand with firearms. I have one that shoots \"Bullets\".\nApollo:\nI don't want it shooting any bullets, thank you!\nTrucy:\nNot those bullets, silly! My gun shoots \"Bullets, the Magic Cat\".\nApollo:\nA cat... comes out of a gun?\nTrucy:\nI can tell your expression you've never heard of that trick. It's a great one!\nApollo:\n(Honestly, That one sounds halfway interesting.)\nChamber\nApollo:\nThe middle of the weapon is a revolving chamber. That's where you load the bullets. A revolver, see?\nTrucy:\nRevolver... Revolver... That sounds a bit like \"Wonder Bar\"! Especially if you say it really fast!\nApollo:\nUh... I guess.\nTrucy:\nYou know what I always used to think? I used to think the closest sound to \"Wonder Bar\" was \"One Liver\"! There's just so many words in the world, Apollo! Isn't it amazing!?\nApollo:\n...... So many different words, so many different people. (...People like Trucy.)\nKey Ring\nGuitar-shaped key\nApollo:\nThere are three keys on this heart-shaped key ring. Hmm? This middle key is shaped like... a guitar?\nTrucy:\nI get it! It must be the key to a guitar case!\nApollo:\nA guitar case key... (I'll bet I know who this belongs to.)\nTrucy:\n...... Thanks for taking the fun out of my danger pin.\nApollo:\n(Aw, you're driving a danger pin through my heart here.)\nAfter clearing all Talk options and examining brooch and Romein LeTouse's left hand:\nEma:\nWell, that's about it. I think we've looked at just about everything there is.\nApollo:\nI guess you're right.\nEma:\nI know how you're feeling. It is hard to know when to stop. But anything more involved has to wait until the squad gets here.\nTrucy:\nArgh... I suppose...\nEma:\nI'll go report the evidence. Sorry, but could you wait here till I get back?\nApollo:\nHuh? Oh, actually, we have to--\nEma:\nGreat! Thanks!\nApollo:\n...She left.\nTrucy:\nWhat do we do, Apollo? She told us to wait...\nApollo:\nGreat. Now how am I supposed to investigate?\nTrucy:\nOh well, I guess it can't be helped. Let's go.\nApollo:\nHuh? Go?\nTrucy:\nTime's a wasting, Apollo! We've got a lot of ground to cover!\nApollo:\nWell, that's true, but... ...On second thought, why not. I'm sure everything will be fine.\nTrucy:\nOf course it will! Let's go!\nExamine\nAir vent\nApollo:\n...... That air vent bothers me. If Ema and I came in through the door... That makes that vent the only exit from the room.\nTrucy:\nBut it's much too small.\nApollo:\nHmm... Not if the killer were about your size, Trucy...\nTrucy:\n......\nApollo:\n......\nTrucy:\nI didn't do it!\nApollo:\nEh.\nTrucy:\nI was cutting up the dance floor at the time, thank you!\nApollo:\nI know, I know! Of course I don't think you did it.\nTrucy:\nIt's hard to tell with you, sometimes, Apollo.\nApollo:\n(Hey! What have I done?)\nBrooch\nTrucy:\n......\nApollo:\nNo snatching people's brooches.\nTrucy:\nDarn... Maybe there's another one lying around here somewhere.\nApollo:\nIf there is, you can't have that one either.\nTrucy:\n...Don't be so stingy, Apollo.\nApollo:\n...I think the word you're looking for is \"principled\".\nBullet holes\nTrucy:\nAre these... bullet holes?\nApollo:\nLooks like it. There are two here in the wall.\nTrucy:\nWell, if there are two marks, they must have missed twice.\nApollo:\nNot necessarily... Some revolvers can put a bullet through a person. So it wasn't necessarily a miss.\nTrucy:\nOuch... Sounds painful.\nFruit basket\nTrucy:\nOoh! Apollo! Can I eat some of those, please!?\nApollo:\nBetter not. Ema will find out. Somehow, she will. \"How could you eat those without telling me!?\"\nTrucy:\nYeah... I'll make sure to leave some for her to eat, too.\nApollo:\n(I don't think that's the issue here...)\n(Step)ladder\nApollo:\nHuh, another ladder.\nTrucy:\nActually, it's technically a stepladder.\nApollo:\nWell hello, Ms. Fancy Pants! Please forgive my lack of ladder discrimination.\nTrucy:\n! ......\nApollo:\nI'd say this ladder is used to climb up to reach things. ...Is there something on the ceiling?\nTrucy:\nI still say it's a stepladder.\nPoster over TV\nApollo:\nLook, there's another Gavinners poster. Ema didn't seem too happy about it.\nTrucy:\nMaybe I should take it down before she rips it up.\nApollo:\nYou walk around with that thing and she'll sniff it out.\nTrucy:\n...Maybe I'll pass then.\nApollo:\n(It's probably wise to be wary of Ema...)\nSpeaker\nApollo:\nThat speaker was blaring when it happened. Apparently, it monitors sound from the main stage. ...Which made it hard to hear Mr. LeTouse's last words.\nTrucy:\nWell, you know what I do at loud concerts? I wear earplugs! It really cuts down on the noise.\nApollo:\n...And this would have helped me hear him how?\nTelevision\nTrucy:\nAh, ah, Apollo! Look at that thing! It's huge! That... That's a TV!!!\nApollo:\nUm, yeah, a wide flatscreen TV. I want one of those. Someday when I'm a famous attorney, I'll get one...\nTrucy:\nBut Daddy never had one. I don't think he ever even had money when he was a lawyer.\nApollo:\nGreat, just stomp on my dreams why don't you.\nFlower bouquet\nApollo:\nWhat an amazing bouquet. I mean, it's giant.\nTrucy:\nThat's super dazzle-frazzle!\nApollo:\n...\"Dazzle-frazzle\"?\nTrucy:\nYeah, it's super, and it makes you feel all dazzle-frazzle!\nApollo:\nUm... Who taught you to say that?\nTrucy:\nOh, Daddy.\nApollo:\n(...I knew it.)\nHairdryer\nApollo:\nThis is one of those... uh, things, right? At the barbers? It's one of those permanent hair things.\nTrucy:\nI've never tried one.\nApollo:\nWant to?\nTrucy:\nHmm... I think I'll stick with my top hat. We have an understanding, me and my hat.\nApollo:\n(It's... just a hat, Trucy.)\nRomein LeTouse's body\nRomein LeTouse's left hand\nApollo:\nThe body was holding a key ring...\nTrucy:\nDo you think it belongs to the killer?\nApollo:\nIf it's not Mr. LeTouse's, that seems like a possibility.\nMirror dresser\nApollo:\nSeeing these mirrors lined up like that makes me think I'm really in a dressing room. Look at all that makeup.\nTrucy:\nWell, I haven't got a clue, and I doubt those are.\nApollo:\n(I guess she's not into makeup yet.)\nGift boxes\nApollo:\nLook at all these presents. Lamiroir sure is popular.\nTrucy:\nI got a present once, from a person in the audience.\nApollo:\nThat's pretty cool.\nTrucy:\nIsn't it! Maybe you'll get one someday. ...From someone you defend!\nApollo:\n(That's called getting paid, and I certainly hope I do.)\nRevolver\nApollo:\nA 45-caliber revolver, very powerful. This is definitely the murder weapon.\nTrucy:\nI wonder who brought this revolver in here? It's huge.\nApollo:\nSomeone unusual, that's for sure.\nTrucy:\nNo one I want to meet, that's also for sure.\nApollo:\nMe either. Unless it's in court, of course!\nSmall window\nTrucy:\nLook, there's a little window over here! Maybe the killer escaped through that!\nApollo:\nIt's only big enough to stick your head through. And it doesn't even open all the way.\nTrucy:\n...What? I was just saying it's possible.\nApollo:\nRight, right, no harm in that. (Except I'm pretty sure it is impossible.)\nJuly 7Backstage Hallway\nTrucy:\nEeeeeeeeeeeeek!\nApollo:\nWho's there!?\nTrucy:\nWe... didn't just imagine that, did we?\nApollo:\nHe was wearing a silk hat. ...Friend of yours?\nTrucy:\nHardly!\nApollo:\n(Whoever that was, he sure looked suspicious!)\nJuly 7In the Wings\nKlavier:\nWhat is it with today!? Problem after problem! Achtung!\n???:\nYou ain't kidding.\nTrucy:\nIt's the two leading members of the Gavinners, Apollo! Klavier on vocals, and Daryan on guitar! They're so cool!\nApollo:\nI have a hard time thinking of \"Klavier\" as anything but a prosecutor, honestly.\nTrucy:\nHuh? What are they arguing about?\nApollo:\nProbably the case, I'd bet.\nKlavier:\nMy hog won't start. My guitar case is busted... ...my guitar's been burnt to a crisp, and to top it all off, someone's dead! ...And then there was that performance just now. What was that all about!?\nDaryan:\nHey, man, don't blame me. You were the one who missed the cue.\nKlavier:\nMe? Miss a cue!? How could I conceivably get the most important part of that song wrong? How!? And what was all that tinny playing of yours?\nDaryan:\nWho you calling \"tinny\"!?\nTrucy:\n...Sounds like they're having a spat. One of those \"differences in musical direction\" bands are always splitting up over.\nApollo:\nThis is hardly the time...\nKlavier:\n...Hmm? What are you two doing here?\nApollo:\nAh, um, hiya. ......\nKlavier:\nWe were just discussing the investigation, if you don't mind.\nApollo:\nSorry. Wait... You were what?\nKlavier:\nListen... You need to confirm that with the Republic of Borginia, Detective Crescend.\nDaryan:\nRight. Anything else?\nApollo:\nWhat did he just call him? \"Detective\"...?\nDaryan:\nAh, greetings. Daryan Crescend... Criminal Affairs, Division 3.\nApollo:\nUh... H-Hello. (\"Criminal Affairs\"!?)\nTrucy:\n*sigh* Apollo... You really don't know anything about the Gavinners, do you?\nApollo:\n(Something tells me that's about to be remedied.)\nTalk\nThe case\nApollo:\nUm, about the crime...\nKlavier:\n...Which crime do you mean?\nApollo:\nThe murder, what else!?\nKlavier:\nOh, that. For me, today has been a hit parade of crimes, you see.\nTrucy:\nProsecutor Gavin was singing the blues earlier, wasn't he? ...Something about his hog, and his guitar case.\nKlavier:\n...Anyway. I'm afraid you know more about the killing of Mr. LeTouse than I do. ...For now, at least.\nApollo:\nHuh?\nKlavier:\nYou were the one who found the body, ja? While we were in the middle of a performance, no less.\nTrucy:\nAren't you going to examine the crime scene, Prosecutor Gavin?\nKlavier:\nI'll leave that to Fräulein Detective. Wouldn't want to step on her toes.\nTrucy:\nThey're not exactly best buddies are they. Ema and Prosecutor Gavin, I mean.\nApollo:\nWell, what to do next. We've already checked out the scene. (Prosecutor Gavin may be right. We might be the most informed, for once.)\nTrucy:\nMaybe Prosecutor Gavin can shed some light on things we've found!\nThe Gavinners\nTrucy:\nI don't believe you, Apollo! How can you come to this concert and not know about the Gavinners!?\nKlavier:\nIt's not surprising. Why, even our ancestors knew nothing of America's existence once.\nApollo:\nUm... I know America exists.\nTrucy:\nThe Gavinners aren't just an average rock band, Apollo. Each member is connected to the police somehow!\nApollo:\nThe Police?\nTrucy:\nThe real police! By day they pack heat, but by night they heat up the stage! By day those lips interrogate, by night they sing songs of unrequited passion!\nApollo:\n...Um, OK.\nTrucy:\nThey debuted seven years ago with \"13 Years Hard Time For Love\"... Then came \"Love With No Chance Of Parole\", and \"My Boyfriend Is The Prosecution's Witness\". The list of hits goes on and on!\nKlavier:\nThis here's my right-hand man. ...Daryan Crescend. I make the melodies, and he attacks them with his guitar. He's a bit of a rogue, really.\nDaryan:\nHeh. And this guy's a bit of a perfectionist. When a performance goes the least bit wrong he goes into this funk... Just like today.\nApollo:\n(I'd hope murder would be a bit more off-putting than a ruined concert...)\nKlavier:\nThe concert today? A disaster! I'll get to the bottom of this and then we'll see who missed a cue!\nTrucy:\nThe missed cue... They were arguing about that before...\nApollo:\n(Great, I love nothing more than questioning tormented artists.)\nThe missed cue (appears after \"The Gavinners\")\nTrucy:\nWhat's this missed cue you keep talking about?\nKlavier:\nAh ha, you heard it, didn't you? From the audience?\nTrucy:\nUm, actually, I didn't notice anything...\nDaryan:\nSee! No amateur is going to pick up on that!\nKlavier:\nCan you guarantee an entire audience of amateurs? No! Now take a listen to this!\nTrucy:\nWhat's that...?\nKlavier:\nA mixing board. We used it to record our concert tonight.\nApollo:\n(Aren't we supposed to be investigating a murder...?)\nTrucy:\nWell, we've come this far, might as well go all the way! I've always wanted to learn about the recording industry!\nKlavier:\nThis is but one of the devices used in recordings. We're a five-part band... This lets us record each member's performance separately. You use the sliders to adjust the volume for each part. Check it out!\nTrucy:\nWow, neat! So, could you, say, hear only the drum part?\nKlavier:\nOf course. That's how we'll find the criminal guilty of missing his cue tonight!\nApollo:\nI'm more concerned with the other criminal. The one who kills people.\nKlavier:\nYou want help on the case? Then help me with mine!\nApollo:\n(I guess rock 'n' roll comes before prosecuting.)\nKlavier:\nLet's begin! First, we bring up the part of the performance in question. You simply choose the section of the song you wish to hear on the upper-most bar. (Changed from [You simply choose the section of the song you wish to hear on the bottom-most bar.] in the original release) Like so. There it is. Now, listen.\nTrucy:\n...Was something wrong?\nKlavier:\nYou couldn't hear it? Listen again, closely...\nTrucy:\nAh... the timing's a little off, isn't it!?\nKlavier:\nYou see? There! Right at the most important part! And even an amateur can hear it!\nDaryan:\nAn amateur with a mixing board, maybe.\nKlavier:\nYou're missing the point! We'll never stamp out crime until we're perfect. Perfect!\nDaryan:\nHere he goes again...\nKlavier:\nRight. Herr Amateur, you will prove my point.\nApollo:\nHuh? Me!?\nKlavier:\nYou will find the missed cue! You will tell us which instrument, which part, is the guilty party!\nApollo:\nBut how...?\nKlavier:\nDid I not just explain it? Move the sliders with [left analog stick up / W] and [left analog stick down / S] to adjust the volume for each part. (Changed from [Use these sliders to adjust the volume for each part.] in the original release) Then you will find the part that hopelessly bungles the cue with [left analog stick left / A] and [left analog stick right / D]! (Changed from [Then you will find the part that hopelessly bungles the cue!] in the original release) You'll find it, with your untrained amateur ears!\nTrucy:\nNothing to do but try, Apollo!\nApollo:\n(I guess... I'll admit, this looks kind of fun.)\nKlavier:\nFirst, a quick review: use [left analog stick up / W] and [left analog stick down / S] to adjust a part's volume. (Changed from [First, a quick review: use the slider to adjust volumes.] in the original release) Jump to another section of the song with [L / LB / Q] and [R / RB / E]. (Changed from [Press the section of the song you wish to hear on the bottom bar.] in the original release)\nApollo:\n(And use [left analog stick left / A] and [left analog stick right / D] to switch parts, right? Got it.) (Changed from [Sliders and the bar, got it.] in the original release)\nKlavier:\nOnce you've found the guilty part, press [X / Y / R] to point it out! (Changed from [Once you've found the guilty part, press the corresponding number!] in the original release) Time to rock!\nPresent part 2\nApollo:\nLeads to:\n\"This part is off.\"\nPresent any other part\nApollo:\nApollo:\nThis part sounds a little off.\nKlavier:\nLet's see............... ...Herr Forehead.\nApollo:\nYes?\nKlavier:\nLet me guess... ...You got a D in high school chorus, didn't you?\nApollo:\n(How'd he know!?)\nKlavier:\nThis part is perfection. Absolute perfection. I'd bet all the royalties from my last platinum-selling album on it. The guilty part is elsewhere.\nApollo:\n(Yeah, yeah, I know you sold a bazillion records.)\nTrucy:\nFocus, Apollo! I'll cheer you on!\nApollo:\nActually, it's probably better if you stay quiet... (Let's give this another shot.)\nLeads back to track selection\nApollo:\nThis part is off.\nKlavier:\nWhich is that? Hmm... 2nd Guitar.\nDaryan:\nAh.\nKlavier:\nIt was you Daryan!\nDaryan:\n...... Ah well, looks like the cat's out of the bag.\nKlavier:\n\"Ah well\"? That's all you have to say!? That kind of attitude lets killers walk free, Daryan!\nTrucy:\nHere they go again.\nApollo:\nMaybe it wasn't such a good idea to ask about the concert. It's starting to feel like we're just wasting time.\nTrucy:\nIt's all experience under our belts! That can't be bad!\nMixing Board added to the Court Record.\nApollo:\n(I still can't get over the title for that song... ...\"Guilty Love\"...?)\nThe missed cue (subsequent times)\nApollo:\n(Best to avoid bringing up that topic again... I'm sure I can think of something else to ask about.)\nGavin's troubles (appears after presenting Key Ring)\nApollo:\nYou were saying something about your motorcycle not starting?\nTrucy:\nAnd something about your guitar case being busted?\nKlavier:\n...You're well informed.\nTrucy:\nYou mentioned it a few times.\nKlavier:\nAch. Ach! It all happened this morning. It's all this key ring's fault.\nApollo:\nThe key ring...\nKlavier:\nIt's got all my keys on it, ja? My bike key, my car key... and the key to my guitar case.\nTrucy:\nWait, so this key ring...\nKlavier:\n...It disappeared. I thought I'd put it in my jacket pocket...\nApollo:\n(Prosecutor Gavin's key ring... disappeared?)\nKlavier:\nI had to come to the concert by taxi. How embarrassing! And in order to get my guitar out, I had to break the lock.\nApollo:\nWait, this guitar wasn't the one that...\nKlavier:\nThe very one. Up in flames... ...And right on stage, too.\nTrucy:\nI actually thought that was part of the show.\nKlavier:\nCrazy. ...And to top it off, Mr. LeTouse's life was taken. Nobody told me 'bout days like these.\nApollo:\nStrange days, indeed.\nKlavier:\n...You think?\nTrucy:\n......\nApollo:\nWhat's wrong, Trucy?\nTrucy:\nWell, I was just trying to make sense of everything. First this heart-shaped key ring gets stolen. Then a very expensive guitar flares up on stage. Then Mr. LeTouse dies...\nKlavier:\nYes, and...?\nTrucy:\nCould it all really be just a coincidence?\nKlavier:\nCoincidence...? Meaning...? Daryan, can you make any sense of all this?\nDaryan:\n...Hey, don't look at me.\nTrucy:\nWhat do you think, Apollo?\nApollo:\nHuh?\nTrucy:\nI mean, either Mr. Gavin's having a really bad day... ...or all this was planned.\nKlavier:\n...... You... aren't thinking what I think you're thinking... ...are you, Fräulein?\nTrucy:\nI am!\nDaryan:\nWhat? What!? Hey, don't leave me in the dark with Spike, here.\nApollo:\n(...The name's Apollo, but yeah, I agree... Don't leave us in the dark! What are you talking about?)\nTrucy:\nHaven't you noticed a connection, Apollo? ...A curious connection between all of Mr. Gavin's troubles today?\nApollo:\nUm, well...\nI have noticed\nApollo:\nYou know, something was bugging me, too! That key ring, and the guitar, and the body...\nTrucy:\nSlow down there, Polly. You look a wee bit dizzy.\nDaryan:\nHe's bluffing. He hasn't figured it out. Fess up, if you're a man. You're as clueless as I am!\nApollo:\nHuh?\nKlavier:\nNo, no, give Herr Forehead a chance. Let's see your evidence of the connection, shall we?\nApollo:\nE-Evidence!? (Ack! I'd better think of something pronto!)\nTrucy:\nC'mon c'mon c'mon! Let's see it! What's the connection between all of Mr. Gavin's troubles?\nPresent Lyrics Sheet\nApollo:\nLeads to:\n\"It's this, isn't it?\"\nPresent anything else\nApollo:\nApollo:\nThe connection... is this! Right?\nTrucy:\nUm, I would say you were close, but really, you're kinda far. Remote, even.\nApollo:\n(Oops. Try not to anger the Trucy, Apollo. No sudden motions... Just find that evidence slowly.)\nLeads back to:\n\"C'mon c'mon c'mon! Let's see it!\"\nApollo:\nIt's this, isn't it?\nLeads to:\n\"A lyrics sheet? ...\"The Guitar's Serenade\"...? What's that got to do with anything?\"\nI haven't noticed\nTrucy:\nYou haven't!?\nApollo:\n...I just don't see the connection. Sorry.\nTrucy:\nWell don't just give up! Give it a little more thought!\nApollo:\nWait... You don't mean this, do you?\nLeads to:\n\"A lyrics sheet? ...\"The Guitar's Serenade\"...? What's that got to do with anything?\"\nDaryan:\nA lyrics sheet? ...\"The Guitar's Serenade\"...? What's that got to do with anything?\nKlavier:\nIt has everything to do with everything. Though I wouldn't have believed it if the Fräulein hadn't pointed it out.\nDaryan:\nWhat are you talking about, man? Enough with the riddles!\nKlavier:\nMaybe it is a coincidence, or perhaps it means something. Don't you think, Fräulein?\nTrucy:\nI do. Everything that's happened to Mr. Gavin today... ...is predicted in the lyrics to this song!\nDaryan:\nWh-Whaaat!? No way!\nThe song's prediction (appears after \"Gavin's troubles\")\nTrucy:\nLook, just think about everything that's happened to Mr. Gavin. Let's list them in the order that they occurred... ...while reading this lyrics sheet!\nApollo:\nFirst, the key ring was stolen.\nTrucy:\nAnd not just any key ring! A heart-shaped key ring!\nApollo:\nThat's right here! \"When you stole away the keys my heart held on to so tight.\" This is a \"heart\" holding \"keys\"!\nTrucy:\nAnd next, his guitar burst into flame.\nApollo:\n\"Burning on in my heart. Fire. Burn my love away...\"\nTrucy:\nAnd then Mr. LeTouse was killed...\nApollo:\n\"Like a bullet of love. Fire. Take my life away...\" But... But that's crazy!\nTrucy:\nYeah, no kidding!\nDaryan:\nSo everything that happened today, here... ...This song predicted it all?\nKlavier:\nOr perhaps it was the other way around...\nApollo:\nHuh?\nKlavier:\nThe criminal could have based their crime on the lyrics. (Changed from [The criminal could have based his crime on the lyrics.] in the original release)\nApollo:\nBut who would go through all that trouble...?\nKlavier:\nSomeone who moves in mysterious ways, no doubt. I believe you've stumbled upon something quite vital... and quite annoying, Fräulein.\nTrucy:\nEh heh.\nApollo:\n(She looks pleased...)\nPresent\nKey Ring\nApollo:\nUm, I was wondering if you knew anything about this?\nKlavier:\nTh-That...!\nApollo:\nDoes it look familiar?\nKlavier:\nFamiliar! It's mine! That's my key ring! I've been looking all over for it!\nTrucy:\nWhaaaaaat!? This is yours, Mr. Gavin!?\nApollo:\n(I knew it...)\nTrucy:\nApollo! How can you make that \"I knew it\" face!? This is the key ring that was...\nApollo:\nYeah, I know.\nKlavier:\nThanks, anyway. So, where did you find it?\nApollo:\nErm, actually, the victim was holding it. Like he was trying to keep it from the killer. Even if it meant his life.\nKlavier:\n...... Wh-Wha... Whaaaaaaaaaaaaaaaat!? The victim... you mean, Mr. LeTouse had my keys?\nApollo:\nIndeed.\nKlavier:\nHrmm... When will my trials be over?\nTrucy:\nSpeaking of trials, I've never heard Mr. Gavin whine in court like he has been today.\nApollo:\nEma was right about the fop, I'll give her that.\nTrucy:\nApollo! Mr. Gavin, maybe we can help. Tell us about your troubles today.\nKlavier:\nI really don't think that's...\nTrucy:\nTell us... ...and we'll keep mum about the key ring for now.\nKlavier:\nAre... you blackmailing me, Fräulein?\nKey Ring (subsequent times)\nKlavier:\nAnyway... Thanks for finding this. If you'd found it under different circumstances, I'd be even happier.\nTrucy:\nI wonder why Mr. LeTouse was holding it?\nApollo:\nMaybe he was trying to tell us something? Maybe that Prosecutor Gavin is the killer?\nKlavier:\nHerr Forehead, save your wild accusations for the court. I do so enjoy the penalties.\nAnything else\nKlavier:\nSorry, but I'm not in the mood to talk about that right now. Even I can only take so much in one day.\nApollo:\n(Funny, I always thought of Prosecutor Gavin as one of those cool, stoic types. The sort that never complains. How wrong I was!)\nAfter clearing \"The missed cue\" and \"The song's prediction\" Talk options:\nDaryan:\nThe lyrics predicting the crime... Klavier?\nKlavier:\nSeems a bit more than just a coincidence to me.\nDaryan:\nI have to agree. The key ring, the guitar, and the murder...\nApollo:\nThe key ring might have been dropped by accident.\nKlavier:\nYet the victim was holding it. Hard to think that it was unconnected.\nApollo:\nThat's true. (Prosecutor Gavin's as calm and collected as ever...)\nTrucy:\nSo the criminal matched their actions to the lyrics?\nDaryan:\nThat sounds likely.\nApollo:\nWhy would anyone do that?\nDaryan:\n...While we think about that, I'm going to get cracking on the biggest crime here. I'm going to talk to the Borginian Embassy about this Mr. LeTouse.\nKlavier:\nAh, right. Thanks, Daryan.\nDaryan:\nI'll leave the pondering of mysteries to you. I'm outta here.\nKlavier:\nA foreign national, Mr. LeTouse was killed... It seems like that would have to be the \"point\" of all this. But they did more than that. They left us with not only a murder, but a mystery!\nTrucy:\nMr. Gavin sure is irritable today.\nApollo:\nMaybe this is the real Prosecutor Gavin we don't get to see in the courtroom.\nKlavier:\n...I've had enough, frankly. If you find any more mysteries, do me a favor and keep them to yourselves, ja?\nApollo:\nJa... (I guess this is all we're going to get from Prosecutor Gavin. That leaves Lamiroir to question.) Prosecutor Gavin... do you know where Lamiroir is now?\nKlavier:\nAh, I had her go to my dressing room. With that pianist, Machi Tobaye, of course. She seemed rather shocked by Mr. LeTouse's sudden passing.\nApollo:\n(The Gavinners's dressing room. Got it!)\nTalk\nThe Gavinners\nTrucy:\nI don't believe you, Apollo! How can you come to this concert and not know about the Gavinners!?\nKlavier:\nIt's not surprising. Why, even our ancestors knew nothing of America's existence once.\nApollo:\nUm... I know America exists.\nTrucy:\nThe Gavinners aren't just an average rock band, Apollo. Each member is connected to the police somehow!\nApollo:\nThe Police?\nTrucy:\nThe real police! By day they pack heat, but by night they heat up the stage! By day those lips interrogate, by night they sing songs of unrequited passion!\nApollo:\n...Um, OK.\nThe song's prediction\nTrucy:\nLook, just think about everything that's happened to Mr. Gavin. Let's list them in the order that they occurred... ...while reading this lyrics sheet!\nApollo:\nFirst, the key ring was stolen.\nTrucy:\nAnd not just any key ring! A heart-shaped key ring!\nApollo:\n\"When you stole away the keys my heart held on to so tight.\" This is a \"heart\" holding \"keys\"!\nTrucy:\nAnd next, his guitar burst into flame.\nApollo:\n\"Burning on in my heart. Fire. Burn my love away...\"\nTrucy:\nAnd then Mr. LeTouse was killed...\nApollo:\n\"Like a bullet of love. Fire. Take my life away...\"\nApollo:\nSo this song prerdicted everything that was going to happen!?\nKlavier:\nOr perhaps it was the other way around...\nApollo:\nHuh?\nKlavier:\nThe criminal could have based their crime on the lyrics. (Changed from [The criminal could have based his crime on the lyrics.] in the original release)\nKlavier:\nSomeone who moves in mysterious ways, no doubt. I believe you've stumbled upon something quite vital... and quite annoying, Fräulein.\nTrucy:\nEh heh.\nApollo:\n(She looks pleased...)\nJuly 7Backstage Hallway\nTrucy:\nEeeeeeeeeeeeek!\nApollo:\nWho's there!? ...There he goes again. Who is that guy!?\nTrucy:\n......\nApollo:\nHuh? Trucy?\nTrucy:\nYou know, he did look sort of familiar...\nApollo:\n...So he is a friend of yours!\nTrucy:\nNo, that's not it. ...Sorry, I don't remember.\nApollo:\n(Curiouser and curiouser...)\nExamine evidence\nKey Ring\nGuitar-shaped key\nApollo:\nThere are three keys on this heart-shaped key ring. And this guitar-shaped key was the key to a guitar case.\nTrucy:\nWasn't he saying he had to break his case because he couldn't get it unlocked? I could open a lock like that in 10 seconds, easy! He should have given me a call.\nApollo:\n...So he could slap handcuffs on you after you opened it?\nTrucy:\nHandcuffs? 20 seconds, tops!\nApollo:\n(I'm glad she's on my side.)\nJuly 7Gavinners's Dressing Room\nTrucy:\nAh... Lamiroir!\nLamiroir:\nWhat... What has happened? I heard that Mr. LeTouse has died!\nApollo:\nL-Lamiroir! You speak? I mean, you speak English?\nLamiroir:\nAh... Yes. I was invited here from the Republic of Borginia... But I am not Borginian by birth.\nTrucy:\nBut wasn't Mr. LeTouse your interpreter...?\nLamiroir:\nAh that. Yes, well... It was Mr. LeTouse's idea. He thought it would add to the mystery, you see.\nApollo:\nThen, your pianist is also...?\nMachi:\n....................\nLamiroir:\nNo, Machi Tobaye is Borginian. He does not speak English. Now, please tell me! What has happened to Mr. LeTouse? Why did he...\nTrucy:\nActually, Mr. LeTouse was...\nApollo:\nTrucy!\nTrucy:\nHuh?\nApollo:\nRemember what Prosecutor Gavin said? \"Not a word\"!\nTrucy:\nB-But Mr. LeTouse is Lamiroir's manager! That's not fair to her! I mean, isn't she a related party?\nApollo:\n(Precisely who Prosecutor Gavin doesn't want to alert, I'd suspect.)\nLamiroir:\nAll we have been told is to wait here in this room. It is very unsettling.\nApollo:\nI'm sorry, we're trying to figure it out ourselves. Do... you think I could ask you some questions?\nLamiroir:\nOf course. I am always willing to help.\nApollo:\n(She's as calm as she looked on stage... I can't put my finger on why, but I like this Lamiroir.)\nMachi:\n[Foreign text]....\nLamiroir:\nWhat is it, Machi?\nMachi:\n[Foreign text]....\nLamiroir:\nWhat... but you'd be alone!\nMachi:\n[Foreign text]....\nApollo:\nUm, what seems to be the problem?\nLamiroir:\nMachi... he is not good around strangers. He wishes to go out for a breath of fresh air. Would that be alright?\nApollo:\nUh, sure, of course.\nMachi:\n....................\nLamiroir:\nVery well. What is it you wished to ask me about?\nExamine\nPostcards (if not already examined)\nTrucy:\nLook! It's a postcard of Lamiroir!\nApollo:\nWhat are these letters at the bottom? I've never seen these before.\nTrucy:\nIt must be her native tongue, Borginian! (Changed from [It must be her native tongue, Borginese!] in the original release)\nLamiroir:\n\"A landscape painter in sound\"... This is how it would translate, roughly. Please, take one.\nApollo:\n(\"A landscape painter in sound\"...? That's a nice image...)\nPostcard added to the Court Record.\nPostcards (subsequent times)\nLamiroir:\nYou see the words written upon the postcard? They say \"a landscape painter in sound\".\nApollo:\n(\"A landscape painter in sound\"...? That's a nice image...)\nTalk\nLamiroir\nApollo:\nThe Republic of Borginia... that's in Northern Europe, right?\nTrucy:\nI've never even heard of it...\nLamiroir:\nI started out singing in a restaurant... Then a producer called me. Before I knew it... here I am.\nTrucy:\nYou don't say! You know, my daddy plays piano in a restaurant!\nApollo:\nProducers tend to look for talent, Trucy. ...Lamiroir, you're not from Borginia originally? Were you born here?\nLamiroir:\nWell...\nApollo:\nOh, is that supposed to be a secret?\nTrucy:\nImage is everything when you're a star! I know a bit about that, of course...\nLamiroir:\nAh, yes, it is something like this. A contract, you might say. I'm also not to speak anything but Borginian in public. (Changed from [I'm also not to speak anything but Borginese in public.] in the original release)\nApollo:\nImage is important, I guess.\nTrucy:\nShe's not all image, though! Her songs are lovely! A real \"landscape painter in sound\"!\nApollo:\nA painter in what?\nTrucy:\nShe travels the world, turning the sights she sees into music! That's the secret to your music's beauty, right?\nLamiroir:\nYou're very perceptive.\nTrucy:\nOh, I use your songs all the time in my stage act. ...I don't have to pay royalties for that, do I?\nApollo:\nStop while you're ahead, Trucy.\nLamiroir:\nThis \"landscape painter in sound\", too, is an image. Yet without it, my songs would not be so widely heard.\nTrucy:\nThey even call you the \"Siren of the Ballad\", right?\nLamiroir:\nYes. In Borginian, \"Lamiroir\" means \"the Siren\". (Changed from [Yes. In Borginese, \"Lamiroir\" means \"the Siren\".] in the original release) I fear that, perhaps, already I am not the siren I once was.\nMachi\nTrucy:\nYour pianist... Machi, was it? He's cute! Like a porcelain doll...\nApollo:\nHe's very \"European\".\nLamiroir:\nI met him while singing in restaurants in Borginia. He is an orphan... yet his playing is exquisite. Soon he came to live with me.\nTrucy:\nIt's like a fairy tale, almost...\nApollo:\nI noticed he hardly leaves your side.\nLamiroir:\nYes, well, he is blind. At first, I hesitated at dragging him across the world.\nApollo:\nHe doesn't speak English, either, does he?\nLamiroir:\nHe had never left Borginia before we met. I made his presence part of my contract. Machi and I together are \"Lamiroir\". Together, always.\nMr. LeTouse\nLamiroir:\nMr. LeTouse... was my new manager.\nApollo:\nNew?\nLamiroir:\nYes, from three months ago. Around when I received Mr. Gavin's invitation to come. I met Mr. LeTouse at my office. He was to be my manager and bodyguard... And, as it turned out, my interpreter.\nApollo:\nInterpreter... even though you speak English.\nLamiroir:\nYes... but we were to visit more places than just here. We had a concert in Japan scheduled after this one. Though I fear that may have to be canceled now...\nTrucy:\nWas Mr. LeTouse from the Republic of Borginia, too?\nLamiroir:\nWell... he was only with me for three months. I'm afraid there is much I do not know about him. And now, I shall never know. No one will even tell me why he has died.\nApollo:\nI-I'm sorry... Prosecutor Gavin said we weren't to talk to anyone...\nLamiroir:\nMr. LeTouse... was a talented man. The \"Siren of the Ballad\"... That phrase was his idea, you know. I am happy for him that it has become so well known.\nAfter clearing \"Lamiroir\" and \"Mr. LeTouse\" Talk options:\nApollo:\nThe \"siren\"... That's what he meant!\nTrucy:\nHuh? Apollo?\nApollo:\nYou are \"the Siren\", right Lamiroir?\nLamiroir:\nThat is the meaning of my name in Borginian, yes. (Changed from [That is the meaning of my name in Borginese, yes.] in the original release) It was the name my producer gave me. But why do you ask?\nApollo:\n...It's very important. I had to know for sure if the \"Siren\" was you.\nLamiroir:\nWhat do you mean, important?\nApollo:\n...I'll tell you. You deserve to know.\nTalk\nThe \"Siren\"\nApollo:\n\"Siren\"... It turns out that's a very important word in this case.\nTrucy:\nH-How?\nApollo:\nWhen we found Mr. LeTouse... ...he was still alive.\nLamiroir:\nWhat...?\nApollo:\nI heard him say something... ...his last words.\nApollo:\nMr. LeTouse! Can you hear me!?\nLeTouse:\nAsk... wi...witness...\nApollo:\nHang in there, Mr. LeTouse! Tell me, who was the witness?\nLeTouse:\nThe wi...witness...is ...si...si...ren...\nTrucy:\nHe said \"siren\"... Really?\nApollo:\nI was the only one there to hear it... ...but I'm sure that's what he said!\nLamiroir:\nMr. LeTouse said that!? \"Ask the witness\"...?\nApollo:\nAnd you're the Siren, Lamiroir.\nLamiroir:\n......\nApollo:\nDid you see what happened?\nLamiroir:\n......\nApollo:\nLamiroir...?\nLamiroir:\nMight I ask, are you with the police?\nApollo:\nEh! Uh, well, no. I'm a defense attorney.\nLamiroir:\nAn attorney? Yet there have been no arrests, yes?\nApollo:\n...Is that a problem?\nLamiroir:\nDoes an attorney not work for a \"client\"? If you have no client, you should leave the investigation to the police, I think.\nTrucy:\nBut Lamiroir, we...\nLamiroir:\nI am sorry, but I cannot answer your questions. I'm afraid you lack the authority to ask them.\nApollo:\nAck... (Why...? If she witnessed the crime, why won't she tell us...?)\nLamiroir:\nI believe we are through here.\nApollo:\n...I believe so.\nThe \"Siren\" (subsequent times)\nApollo:\n\"Siren\"... It turns out that's a very important word in this case.\nTrucy:\nH-How?\nApollo:\nWhen we found Mr. LeTouse... ...he was still alive.\nLamiroir:\nWhat...?\nApollo:\nI heard him say something... ...his last words.\nApollo:\nMr. LeTouse! Can you hear me!?\nLeTouse:\nAsk... wi...witness...\nApollo:\nHang in there, Mr. LeTouse! Tell me, who was the witness?\nLeTouse:\nThe wi...witness...is ...si...si...ren...\nTrucy:\nHe said \"siren\"... Really?\nApollo:\nI was the only one there to hear it... ...but I'm sure that's what he said!\nLamiroir:\nMr. LeTouse said that!? \"Ask the witness\"...?\nApollo:\nAnd you're the Siren, Lamiroir.\nLamiroir:\n......\nApollo:\nDid you see what happened?\nLamiroir:\n......\nPresent\nBrooch\nApollo:\nThat reminds me... Does this brooch look familiar to you?\nLamiroir:\nMy brooch... yes! Well... It may be mine.\nApollo:\nYours, Lamiroir...?\nLamiroir:\nI was wearing a brooch earlier, you see. I must have lost it.\nTrucy:\nWell that explains the brooch we found. It was Lamiroir's!\nLamiroir:\nThank you. I was wondering where I'd dropped it.\nApollo:\n(So this brooch belongs to her... That begs the question...)\nTrucy:\nIs something wrong, Apollo?\nApollo:\n(...What was this brooch doing at the crime scene?)\nBrooch (subsequent times)\nLamiroir:\nI believe that brooch is mine, yes. ... I was wondering where I had dropped it.\nApollo:\n(So it's Lamiroir's brooch, which begs the question... ...what was it doing at the crime scene?)\nAnything else\nApollo:\nWould you mind taking a look at this, Lamiroir?\nLamiroir:\n...... I'm sorry, I'm not sure what to say. I wish I could help you.\nApollo:\nAh, don't worry about it. (Certainly one of the most pleasant refusals I've had.)\nAfter examining postcards, clearing \"The \"Siren\"\" Talk option, and presenting Brooch in Gavinners's Dressing Room:\nJuly 8, 12:22 AMBackstage Hallway\nApollo:\nWhoa! Who's there now!?\nEma:\nAh, it's you. ...Where were you!?\nApollo:\nAck! Ema! ...Is something wrong? (She's looks grumpier than usual.)\nEma:\nYou bet something's wrong! The impossible's happened! Arrgh! It's all your fault, you know!\nApollo:\n(Oops. Maybe this is about us leaving the crime scene.)\nTrucy:\nWhat do you mean by \"impossible\"?\nEma:\nWell it's gone! Utterly gone!\nTrucy:\n...What's gone?\nEma:\nThe body, stupid! What else?\nTrucy:\nEh...\nEma:\nMr. LeTouse's body has disappeared!\nTrucy:\nWhaaaaaaaaaat!?\nJuly 8Lamiroir's Dressing Room\nApollo:\nAh... Prosecutor Gavin.\nKlavier:\nFrom your vacant stare, I gather you've heard the news.\nApollo:\nI heard Mr. LeTouse's body has gone missing...\nKlavier:\nLook for yourself. Quite the pickle. Quite. The. Pickle.\nEma:\nHow can you just stand there!? We have to start the investi...\nKlavier:\nThere's no need for alarm, Fräulein Detective.\nEma:\n...!\nKlavier:\nAll entrances and exits have been sealed. The body will not leave the building. So, I suggest we go find ourselves a cadaver. There will be plenty of time to ponder the \"whys\" later.\nTrucy:\nWell, you seem pretty sure of yourself, Mr. Gavin.\nKlavier:\nOh, we'll find him. I'm rather enjoying this.\nApollo:\n(How could Mr. LeTouse's body just \"disappear\"?)\nTrucy:\nWell, you heard the man. Let's get searching!\nDaryan:\n...Hey, I don't know if this's exactly the right time, but...\nKlavier:\nYes, Daryan?\nDaryan:\nSee, Geeter's gone missing. It was in the dressing room.\nTrucy:\nGeeter? Who's Geeter!?\nDaryan:\nThat's what I call my guitar! You like, man?\nKlavier:\nYour guitar... was stolen?\nEma:\nThis hasn't been a good day for guitars or geeters.\nKlavier:\nOK. Body first, then guitar. And if someone finds that guitar, please bring it to our dressing room.\nDaryan:\nGeeter's like a missing person, not lost 'n' found, man.\nExamine\nBloodstains on floor\nApollo:\nThere should be a body here. But there's not. How could this have happened? And why?\nTalk\nDisappearing act\nEma:\nWell, this sure is a... what did he call it? A sausage? No wait, it was a pickle. And it's your pickle! I told you to stay in the room!\nApollo:\n...Sorry. (Not much else I can say.)\nEma:\n...It's alright. Top priority now is finding that body. ...You can make it up to me later. Ten bags or so of chocolate Snackoos should do the trick nicely.\nApollo:\n(You should watch your sugar intake, Ema.)\nPresent\nAnything\nApollo:\nEma, could you take a look at this?\nEma:\nJust hold it right there. This is not time to be waving a bag of Snackoos in my face!\nApollo:\nUm, it's not a bag of Snackoos.\nEma:\nLook. What's important is that Mr. LeTouse's body is missing! And we've got to find it!\nApollo:\n(She would be more convincing if she wasn't standing around eating her precious Snackoos.)\nJuly 8, 12:57 AMIn the Wings\nTrucy:\nHmm. Does something seem different to you, Apollo?\nApollo:\nSomething is definitely different here.\nTrucy:\nLet's check it out!\nExamine\nStage tower\nLeads to:\n\"That stage there must have been lowered before.\"\nAnywhere else\nTrucy:\nI'm not sure that's all that important right now. Let's check out that thing in the middle of the stage!\nTrucy:\nThat stage there must have been lowered before.\nApollo:\nThat's the tower that Lamiroir and Prosecutor Gavin were singing on.\nTrucy:\nSomeone must have raised it. Hmm. I don't see a way to control it from here. Apollo, what about that ladder there against the wall? We could use that to take a look up top...\nApollo:\n...... Maybe we should get Ema.\nTrucy:\nWhat are you talking about? We have to see this sort of thing for ourselves!\nApollo:\n(I'm... not so good with heights.)\nTrucy:\nStop whining and start climbing!\nApollo:\nUrk...\nApollo:\n(It didn't look that high from below, really. But when we got to the top, I felt every one of those fifteen feet down. (Changed from [But when we got to the top, I felt every one of those 20 feet down.] in the original release) Of course, I wasn't thinking about the height any more. Not after what we found up there.)\nTrucy:\nEeeeeeeeeeeeeeek!\nApollo:\n(We found two things we were looking for, and one thing we never expected to find.) ...The body, guitar in hand, and the pianist, Machi Tobaye.\nJuly 8, 10:09 AMWright Anything Agency\nApollo:\nWow, that concert last night sure went south in a hurry!\nTrucy:\nNo kidding. Why did they arrest Machi!? Why!?\nApollo:\nDon't look at me like it's my fault! (Machi Tobaye, the blind pianist... ...arrested on suspicion of murdering Romein LeTouse.)\nTrucy:\nI can't believe such a cute little boy could do something so horrible!\nApollo:\nI guess they had proof of some kind.\nTrucy:\nWhat proof could possibly prove that!?\nKlavier:\nMornin'.\nApollo:\nP-Prosecutor Gavin?\nKlavier:\nWhat a night, eh? I apologize for being so upset...\nTrucy:\nMr. Gavin, do you know what's going on? Why did they arrest Machi!? Why!?\nApollo:\nDon't look at him like it's his fault either.\nKlavier:\nIt was tough for me, too. We performed together that night, after all. Yet...\nTrucy:\nYet?\nKlavier:\nThe powers that be say that, given the circumstances, it could only have been him.\nApollo:\nWhat do you mean by the \"circumstances\"?\nKlavier:\nLamiroir was invited from Borginia as an ambassador of goodwill. It is vital that this case be wrapped up swiftly. That's all the powers that be want, really.\nApollo:\nWell those are circumstances, alright. But what makes Machi the only possible suspect?\nKlavier:\nHerr Forehead... You seem to have forgotten that you're talking to the prosecution... the enemy.\nApollo:\nAh. Right. (I think I like this side of Prosecutor Gavin better, actually.)\nKlavier:\nI'm not at liberty to discuss the particulars of the case. ...Especially not to the defense attorney.\nApollo:\nWhat... did you just say? Me? The defense attorney?\nKlavier:\nThat's what I came to tell you. He's down at the detention center... He wants to request your services.\nApollo:\nHe...? You mean Machi? Machi wants me...?\nTrucy:\nThis is what we've been waiting for, Apollo! Let's get going!\nApollo:\nUh... Right...!\nKlavier:\nGood luck. I'm off to question Lamiroir.\nApollo:\nR-Right. Later! (I hope I'm up to this...)\nJuly 8Detention CenterVisitor's Room\nTrucy:\nWell, I just don't get it. I refuse to believe a cute little kid like that could do something so terrible.\nApollo:\n...You said that already.\nMachi:\n...........................\nTrucy:\nMachi! Everything's going to be OK! We're here for you!\nApollo:\nUm, h-hi. Maybe you can tell me about last night...\nMachi:\n[Foreign text]....\nTrucy:\nHuh?\nMachi:\n[Foreign text].... [Foreign text]!\nApollo:\n(That was when I realized how tough it must be... A little kid like this... ...in a country so far from everything he's ever known.)\nTrucy:\nUm, maybe Lamiroir can help?\nApollo:\nBut didn't Prosecutor Gavin say she was with him?\nKlavier:\nGood luck. I'm off to question Lamiroir.\nTrucy:\nWell, what are we going to do?\nApollo:\nThat's, um, a good question. (I can't think of anything we can do but go with this. ...And hope for the best at the trial tomorrow.)\nMachi:\n[Foreign text].... [Foreign text]....\nTo be continued.\nNothing to examine during investigation\nApollo:\nNo clues here.",
  "characters": [
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Phoenix Wright",
      "age": "33",
      "gender": "Male",
      "description1": "A pianist who can't play a lick. Formerly an ace defense attorney of some renown."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Trucy Wright",
      "age": "15",
      "gender": "Female",
      "description1": "Future star magician, and Phoenix Wright's daughter. Fond of her Mr. Hat trick."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Klavier Gavin",
      "age": "24",
      "gender": "Male",
      "description1": "Star prosecutor and leader/vocalist for the rock group, the Gavinners."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "LeTouse",
      "age": "35",
      "gender": "Male",
      "description1": "Lamiroir's interpreter. His first name is \"Romein\".",
      "description2": "Shot during the performance. He died after leaving me with his last words.",
      "description3": "Victim in this case, actually an undercover Interpol agent."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Lamiroir",
      "age": "40",
      "gender": "Female",
      "description1": "Singer lauded as the \"Siren of the Ballad\", from the tiny country of Borginia.",
      "description2": "Famed singer from Borginia. Hid the fact that she is blind."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Machi Tobaye",
      "age": "14",
      "gender": "Male",
      "description1": "Lamiroir's favorite pianist. He is blind.",
      "description2": "Blind pianist. Arrested on suspicion of having shot Mr. LeTouse.",
      "description3": "Defendant in this case. Concealed the fact that he could actually see.",
      "description4": "Defendant in this case. Turns out he isn't blind and can understand English."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Ema Skye",
      "age": "25",
      "gender": "Female",
      "description1": "Detective obsessed with forensics. In charge of the initial investigation."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Daryan Crescend",
      "age": "24",
      "gender": "Male",
      "description1": "Guitarist for the Gavinners. His day job is as a detective in Criminal Affairs, Div. 3."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Valant Gramarye",
      "age": "44",
      "gender": "Male",
      "description1": "Famous magician, often on TV. Fond of exaggeration.",
      "description2": "A famous magician, responsible for the illusion used in the concert."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Attorney's Badge",
      "type": "Other",
      "obtained": "One of my possessions.",
      "description1": "How long did I yearn for one of these? Just putting it on makes me feel... ready."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Postcard",
      "type": "Other",
      "obtained": "Retrieved from Gavinners's Dressing Room.",
      "description1": "Lamiroir's own publicity postcard. Click here for details."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Lyrics Sheet",
      "type": "Documents",
      "obtained": "Received from Prosecutor Gavin.",
      "description1": "Contains the lyrics to Lamiroir's ballad. Click here for details."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Investigation Request",
      "type": "Documents",
      "obtained": "Received from Prosecutor Gavin.",
      "description1": "Information concerning the crime to be restricted to police and related parties."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Brooch",
      "type": "Other",
      "obtained": "Retrieved from Lamiroir's Dressing Room.",
      "description1": "Found at the crime scene. Seems strangely familiar...",
      "description2": "Found at the crime scene. Turns out it belongs to Lamiroir."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Revolver",
      "type": "Weapons",
      "obtained": "Retrieved from Lamiroir's Dressing Room.",
      "description1": "The murder weapon.  A deadly, high-caliber revolver.",
      "description2": "The murder weapon. A deadly, high-caliber revolver belonging to Mr. LeTouse."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Key Ring",
      "type": "Evidence",
      "obtained": "Retrieved from Lamiroir's Dressing Room.",
      "description1": "Mr. LeTouse died clutching this. Note the heart-shaped ring.",
      "description2": "Found in the victim's left hand. Holds keys to a guitar case and a motorcycle."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Mixing Board",
      "type": "Other",
      "obtained": "Received from Prosecutor Gavin.",
      "description1": "Allows music to be played in separate tracks. Click here to use."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "LeTouse's Autopsy Report",
      "type": "Reports",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "Death due to loss of blood from a gunshot wound. Est. time of death: 9:00-9:30 PM."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Crime Photo",
      "type": "Photographs",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "Victim shot in shoulder in Lamiroir's room. [caption] The victim was lying head down on the floor, his face turned to the left. There is smeared writing in blood on the floor in front of his head next to his right hand."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Diagram",
      "type": "Maps",
      "obtained": "Submitted as evidence by Prosecutor Gavin.",
      "description1": "The crime scene was Lamiroir's dressing room. [caption] Observing from the door, the victim was blocked from sight by items. There was a gun next to the victim's body. Two bullet holes were found on the wall where the door was."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Video Tape",
      "type": "Other",
      "obtained": "Received from Valant Gramarye.",
      "description1": "Taped recording of Lamiroir's performance. Click here for details."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Headset",
      "type": "Evidence",
      "obtained": "Received from Valant Gramarye.",
      "description1": "Retrieved from Backstage Hallway. Receiver/transmitter for voice signals. All concert staff wore one.",
      "description2": "Receiver/transmitter for voice signals with a 30-foot range. All concert staff wore one."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Switch → Remote Trigger",
      "type": "Other",
      "obtained": "Retrieved from the stage.",
      "description1": "Found on the stage. It's a switch for something, and that's about all I know.",
      "description2": "Found on the stage. Triggers an igniter. Use with caution.",
      "description3": "Found on the stage. Triggers an igniter within 30 feet."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Forum Diagram",
      "type": "Maps",
      "obtained": "Received from Ema Skye.",
      "description1": "Cross-section diagram of the Sunshine Coliseum. Click here for details."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Igniter",
      "type": "Evidence",
      "obtained": "Retrieved from Lamiroir's Dressing Room.",
      "description1": "Found at the crime scene. Emits a flame when triggered by remote control.",
      "description2": "Identical igniters in Gavin's guitar and at the crime scene. Triggered by \"Remote Trigger\"."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Borginian Newspaper",
      "type": "Documents",
      "obtained": "Received at Prosecutor Gavin's Office.",
      "description1": "Article about the case. It doesn't mention the lyrics of Lamiroir's ballad."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Prosecutor Gavin's Guitar",
      "type": "Other",
      "obtained": "Received at Prosecutor Gavin's Office.",
      "description1": "A gift from Lamiroir, sent from Borginia. Burned the night of the concert."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Replica",
      "type": "Evidence",
      "obtained": "Received at Prosecutor Gavin's Office.",
      "description1": "Replica of something, held by Mr. LeTouse. Apparently the focus of his investigation.",
      "description2": "Borginia Cocoon replica, held by Mr. LeTouse.",
      "description3": "Replica of a cocoon from which a remedy for \"incuritis\" may be extracted."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Newspaper Article",
      "type": "Documents",
      "obtained": "Received from a court bailiff.",
      "description1": "Article about the Chief Justice's son, who is inflicted with \"incuritis\"."
    },
    {
      "currentChapter": "Turnabout Serenade",
      "name": "Burnt Fragments",
      "type": "Evidence",
      "obtained": "Received from Phoenix Wright.",
      "description1": "Found at the crime scene, bearing a gunpowder residue. Possibly a firecracker?"
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "Turnabout Serenade\n\n\n\n\n\n\n\n\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 4July 9, 10:00 AMDistrict CourtCourtroom No. 3Judge:\nCourt is now in session for... how do I say that?Klavier:\n\"Machi Tobaye\", Your Honor. The Pixie of the Arpeggio.Judge:\nRight, his trial. Court is in session!Apollo:\nThe defense is ready, Your Honor.Klavier:\nThe prosecution is A-OK, Herr Judge.Judge:\nHmm... Very well, Prosecutor Gavin.Klavier:\nAh, my opening statement, ja?Judge:\nNo, no, actually... There was something else I wanted to ask you about.Klavier:\n...? Yes?Judge:\nSay you're going to visit someone in the hospital with an incurable disease... What do you say to them?Klavier:\nEh?Judge:\nI mean, you wouldn't say \"get well soon\", right? You'd only be kicking them when they're down...Apollo:\nUm, what are you talking about?Judge:\nAhem, actually I'm going to visit someone who is terminally ill. ...Right after this trial. The Chief Justice's son.Apollo:\nThe Chief Justice...?Judge:\nHis son is afflicted with a most terrible disease... He doesn't have long, it seems.Apollo:\nAh...Judge:\nSo I thought I'd go pay him a visit. I thought saying something moving might be the order of the day.Trucy:\nWhy don't grown-ups ever just say what's on their mind instead of pretending?Apollo:\n(She's looking at me with something like... disgust.) ...Hey! What are you looking at me like that for!?Judge:\nIn any case... I'm a bit busy today, so let's wrap this up quickly. Prosecutor Gavin, your opening statement, briefly!Klavier:\nYou're in luck, Herr Judge... I believe you'll be going on your hospital visit sooner than you think.Apollo:\n...!Klavier:\nFirst, to review the victim in this case. Romein LeTouse, age 35. The global manager for diva songstress, Lamiroir. The cause of death: blood loss due to being shot by a large caliber revolver. This report has all the details.Judge:\nThe court accepts this into evidence.LeTouse's Autopsy Report added to the Court Record.Judge:\n45-caliber... That's quite large, isn't it? A direct hit from that could knock a man off his feet.Klavier:\nHowever, the bullet struck him in his shoulder. The damage to his body was slight... death was not immediate. Sadly, his blood loss was such that he could not be saved.Judge:\nHmm... I suppose the victim's condition could have been much worse, considering.Crime Photo added to the Court Record.Klavier:\n...Two shots were fired. One shot missed, the other penetrated and passed through the victim's shoulder. Both bullets were found in the wall at the scene. Observe the diagram... ...This is where the bullets hit.Judge:\nI see... The court accepts this evidence.Diagram added to the Court Record.Judge:\nIf we're talking about a 45-caliber revolver... ...we must assume that the killer was adept at the weapon's use.Trucy:\nReally?Apollo:\nYeah, apparently, weapons that size have a powerful kickback. If, say, the judge tried to fire one, it'd break every bone in his body.Judge:\nThe defense will take more care in choosing examples!Klavier:\n...As I was saying, the victim was shot backstage, in a dressing room. This dressing room has only one entrance: this door.Judge:\nThat does seem to be the case, yes.Klavier:\nHowever, there were witnesses who heard the gunshots.Trucy:\nHe's talking about you and Ema, huh.Klavier:\nYet when the witnesses entered the room... ...it was empty, save for the victim's body, of course.Judge:\nB-But that's... That's impossible!Klavier:\nExactly. This murder was impossible. ...For all but one person.Judge:\nOne person?Klavier:\nThat is, of course... ...the defendant, Machi Tobaye.Judge:\nOnly this defendant could have committed the crime? But how?Klavier:\nIt's quite simple. The circumstances of the crime scene make it clear.Judge:\nVery well, I assume you have testimony to back up this claim. Please show the witness to the stand! (Changed from [Let the witness please take the stand!] in the original release)Klavier:\nYour name and profession, please.Ema:\nEma Skye, I'm a detective for the police department. I was on security detail at the concert forum that night.Apollo:\n(Ema seems... tired, somehow.)Judge:\nHmm... Security at the concert, you say?Ema:\nSome security I was. Couldn't even stop a murder... ......Judge:\nNow, don't blame yourself! Things like this happen! I've made even bigger mistakes in my career, you know!Apollo:\n(I'm sure that makes her feel much better.)Trucy:\nI want to hear about these bigger mistakes!Klavier:\nIn any case... Because you were on security detail, the crime was quickly discovered. And, we were able to identify the killer.Ema:\n......Klavier:\nYou may give the court your testimony, if you would. Describe the circumstances of that day, and your discovery of the crime, please.Ema:\n...Alright.Witness Testimony-- Murderous Circumstances --Ema:\nThe night of the murder, I was on security backstage, at Prosecutor Gavin's request.\nOnly people involved with the concert in some way were allowed backstage.\nAt the beginning of the third set... I heard shots.\nI went into the room, filled with blaring rock music, and found the body.\nI examined the scene and determined that only the defendant could have done it.Judge:\nHmm... It was lucky that a detective was the first on the scene.Trucy:\nBut that door was the only way out of the room, right?Apollo:\nYeah, pretty much.Trucy:\nThen I don't get it. How can they say that Machi did it?Apollo:\nLooks like we need a bit more information.Judge:\nVery well, the defense may begin the cross-examination.Cross ExaminationCross Examination-- Murderous Circumstances --Ema:\nThe night of the murder, I was on security backstage, at Prosecutor Gavin's request.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThe night of the murder was the night of the concert, yes?\nEma:\nThat's right.\nApollo:\nWhat was a detective doing on security detail, might I ask? ...If it was only a concert?\nEma:\nMy thoughts exactly. But, orders are orders. Even when they come from rock gods.\nApollo:\nProsecutor Gavin...?\nKlavier:\nYes, allow me to explain. I smelled something that day, you might say. The stench... of conspiracy. That day, at the concert hall.\nApollo:\nConspiracy...?\nKlavier:\nWell, isn't it obvious!? My keys! That whole morning, no, the whole day was ruined! And it's all because someone stole my keys! I couldn't ride my hog to the show, I couldn't open my guitar case...\nTrucy:\nThere he goes again.\nApollo:\nIsn't it possible he simply misplaced them?\nKlavier:\nMisplaced them!? Misplaced items don't just wander into a murder victim's hand on their own!\nJudge:\nWhat's this!? Prosecutor Gavin, if your keys were in the victim's hand... That makes you a prime suspect!\nKlavier:\n...\"Love, slow-acting and new. Atroquinine... is waiting for you...\"\nTrucy:\nHe's singing something.\nApollo:\nDoes everything with this guy have to be so over-the-top?\nKlavier:\n...The killing happened in the middle of my concert. I was... like a sailor, adrift on a sea of sound. Anyway, I didn't want anything else stolen. So I put the detective with the most time on their hands on the task.\nJudge:\nI see. I can accept that.\nEma:\nWell I can't! What do you mean \"time on their hands\"!?\nJudge:\nPlease, the testimony.Ema:\nOnly people involved with the concert in some way were allowed backstage.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\n...We were let in, though.\nEma:\nI didn't know about that! I certainly didn't invite you.\nKlavier:\nI gave the Fräulein special permission to be there. ...I wanted to see her again.\nTrucy:\nOh boy! Did you hear that? We're officially involved now!\nApollo:\nGee, great.\nEma:\nSome other hangers-on tried to get backstage, but I drove them off.\nApollo:\n(So no other \"outsiders\" were there, then.)\nEma:\nAnd then...Ema:\nAt the beginning of the third set... I heard shots.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nI believe we were having a chat when we heard the shots.\nEma:\nYou were the one chatting. I was eating Snackoos.\nJudge:\nAh! Hey! No snacking in court!\nKlavier:\nAnd you're sure the shots came from Lamiroir's room?\nApollo:\nYes, absolutely.\nEma:\nHey, I'm the one being cross-examined here! Here, this'll keep you quiet!\n*ka-tonk*\nApollo:\nAh, thanks. So...MUNCH...how about it ...MUNCH...Ema?\nEma:\nWe were right...MUNCH...there. Hard to be mistaken about that...MUNCH.\nJudge:\nPlease, either talk, or eat. Not both at the same time!\nEma:\n...... *gulp* Right, so after that... ...me and Mr. Lawyer there opened the dressing room door.Ema:\nI went into the room, filled with blaring rock music, and found the body.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nRock?\nEma:\nBlaring, yes.\nJudge:\nWhen you say \"rock\", are you referring, perhaps... ...to this \"rock 'n' roll\" music that's so popular these days?\nApollo:\n(That's right, when we went into the dressing room... ...music was blaring over the speaker on the wall.)\nEma:\nThey pipe sound from the stage into the backstage through speakers. That way people in the back can hear when they're supposed to be on stage.\nApollo:\nDid it have to be so loud?\nKlavier:\nYou don't listen to the Gavinners with your ears. You feel it with your entire body and soul! I always have the backstage monitors at full volume.\nEma:\nWhen we walked in the room... ...the band was playing \"Guilty Love\", I believe. Making it easy to determine the time of the crime.\nJudge:\nHmm... If you could hear that music playing...\nKlavier:\n...Then everyone on stage for that song has an alibi. Including myself.\nEma:\nAnyway, I closed off the scene and started my investigation.Ema:\nI examined the scene and determined that only the defendant could have done it.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHow could you know something like that!?\nEma:\nAs I said, it was clear from the circumstances. Listen... We know there was only one exit from the room: that door. The small window only opened a tiny crack. And I was standing in front of that door. So, how could the killer have fled the scene? There's only one possibility: the air vent.\nJudge:\nAh...\nApollo:\n\nApollo:\nB-But that air vent was too small! Who could possibly...\nEma:\nExactly.\nApollo:\n...!\nEma:\nThere's certainly no way you could get through. Nor me. The only one who could fit through... was a child.\nApollo:\nA child...\nEma:\nRemember, access to those rooms was limited. Only those involved with the concert were allowed.\nKlavier:\nAnd of all the people involved with the concert... ...only one is small enough to be considered a \"child\".\nJudge:\nThe... The defendant!?\nKlavier:\nThe pixie of the arpeggio flitted up toward the sky... ...and disappeared from the scene of the crime.\nApollo:\n\nApollo:\nB-But that's just conjecture!\nKlavier:\nOh? There was no other way out of that room. You were there. You should know, Herr Forehead.\nApollo:\n...!\nEma:\nAnd... there is another vital piece of evidence.\nApollo:\nEvidence...? What!?\nEma:\nMarks were found on the air vent grill. Traces that it had recently been opened.\nApollo:\nWait, what...!?\nEma:\nAnd something else was found, quite clearly. The defendant, Machi Tobaye's fingerprints.\nApollo:\nWha... Whaaaaaaaaaaaaaaaaaat!?\nJudge:\nOrder! Order! Order!\nKlavier:\nThat air vent was the only way out of the room! The defendant's fingerprints were found on the grill! ...Well, Herr Forehead? What fairy tale does this suggest to you?\nApollo:\nUrk...!\nKlavier:\nOnly one could pass through that vent, that \"doorway to heaven\"... ...and that one is our pixie.\nApollo:\n......\nTrucy:\nWhy are you looking at me, Apollo? Hey! I was out whooping it up in the audience!\nApollo:\n(So this was his decisive evidence...)\nJudge:\nHmm... Quite decisive, indeed.Apollo:\n(I know the circumstances under which the body was found... I was there.)Trucy:\nAn examination of the crime scene was enough to nail down the killer?Apollo:\nI'm sure they have a good reason. (They must have had a good reason to arrest Machi... ...And I'm going to find out what it was!)",
      "testimonies": [
        {
          "testimony": "The night of the murder, I was on security backstage, at Prosecutor Gavin's request.",
          "person": "Ema",
          "present": []
        },
        {
          "testimony": "Only people involved with the concert in some way were allowed backstage.",
          "person": "Ema",
          "present": []
        },
        {
          "testimony": "At the beginning of the third set... I heard shots.",
          "person": "Ema",
          "present": []
        },
        {
          "testimony": "I went into the room, filled with blaring rock music, and found the body.",
          "person": "Ema",
          "present": []
        },
        {
          "testimony": "I examined the scene and determined that only the defendant could have done it.",
          "person": "Ema",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- Murderous Circumstances --Ema:\nThe night of the murder, I was on security backstage, at Prosecutor Gavin's request.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThe night of the murder was the night of the concert, yes?\nEma:\nThat's right.\nApollo:\nWhat was a detective doing on security detail, might I ask? ...If it was only a concert?\nEma:\nMy thoughts exactly. But, orders are orders. Even when they come from rock gods.\nApollo:\nProsecutor Gavin...?\nKlavier:\nYes, allow me to explain. I smelled something that day, you might say. The stench... of conspiracy. That day, at the concert hall.\nApollo:\nConspiracy...?\nKlavier:\nWell, isn't it obvious!? My keys! That whole morning, no, the whole day was ruined! And it's all because someone stole my keys! I couldn't ride my hog to the show, I couldn't open my guitar case...\nTrucy:\nThere he goes again.\nApollo:\nIsn't it possible he simply misplaced them?\nKlavier:\nMisplaced them!? Misplaced items don't just wander into a murder victim's hand on their own!\nJudge:\nWhat's this!? Prosecutor Gavin, if your keys were in the victim's hand... That makes you a prime suspect!\nKlavier:\n...\"Love, slow-acting and new. Atroquinine... is waiting for you...\"\nTrucy:\nHe's singing something.\nApollo:\nDoes everything with this guy have to be so over-the-top?\nKlavier:\n...The killing happened in the middle of my concert. I was... like a sailor, adrift on a sea of sound. Anyway, I didn't want anything else stolen. So I put the detective with the most time on their hands on the task.\nJudge:\nI see. I can accept that.\nEma:\nWell I can't! What do you mean \"time on their hands\"!?\nJudge:\nPlease, the testimony.Ema:\nOnly people involved with the concert in some way were allowed backstage.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\n...We were let in, though.\nEma:\nI didn't know about that! I certainly didn't invite you.\nKlavier:\nI gave the Fräulein special permission to be there. ...I wanted to see her again.\nTrucy:\nOh boy! Did you hear that? We're officially involved now!\nApollo:\nGee, great.\nEma:\nSome other hangers-on tried to get backstage, but I drove them off.\nApollo:\n(So no other \"outsiders\" were there, then.)\nEma:\nAnd then...Ema:\nAt the beginning of the third set... I heard shots.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nI believe we were having a chat when we heard the shots.\nEma:\nYou were the one chatting. I was eating Snackoos.\nJudge:\nAh! Hey! No snacking in court!\nKlavier:\nAnd you're sure the shots came from Lamiroir's room?\nApollo:\nYes, absolutely.\nEma:\nHey, I'm the one being cross-examined here! Here, this'll keep you quiet!\n*ka-tonk*\nApollo:\nAh, thanks. So...MUNCH...how about it ...MUNCH...Ema?\nEma:\nWe were right...MUNCH...there. Hard to be mistaken about that...MUNCH.\nJudge:\nPlease, either talk, or eat. Not both at the same time!\nEma:\n...... *gulp* Right, so after that... ...me and Mr. Lawyer there opened the dressing room door.Ema:\nI went into the room, filled with blaring rock music, and found the body.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nRock?\nEma:\nBlaring, yes.\nJudge:\nWhen you say \"rock\", are you referring, perhaps... ...to this \"rock 'n' roll\" music that's so popular these days?\nApollo:\n(That's right, when we went into the dressing room... ...music was blaring over the speaker on the wall.)\nEma:\nThey pipe sound from the stage into the backstage through speakers. That way people in the back can hear when they're supposed to be on stage.\nApollo:\nDid it have to be so loud?\nKlavier:\nYou don't listen to the Gavinners with your ears. You feel it with your entire body and soul! I always have the backstage monitors at full volume.\nEma:\nWhen we walked in the room... ...the band was playing \"Guilty Love\", I believe. Making it easy to determine the time of the crime.\nJudge:\nHmm... If you could hear that music playing...\nKlavier:\n...Then everyone on stage for that song has an alibi. Including myself.\nEma:\nAnyway, I closed off the scene and started my investigation.Ema:\nI examined the scene and determined that only the defendant could have done it.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHow could you know something like that!?\nEma:\nAs I said, it was clear from the circumstances. Listen... We know there was only one exit from the room: that door. The small window only opened a tiny crack. And I was standing in front of that door. So, how could the killer have fled the scene? There's only one possibility: the air vent.\nJudge:\nAh...\nApollo:\n\nApollo:\nB-But that air vent was too small! Who could possibly...\nEma:\nExactly.\nApollo:\n...!\nEma:\nThere's certainly no way you could get through. Nor me. The only one who could fit through... was a child.\nApollo:\nA child...\nEma:\nRemember, access to those rooms was limited. Only those involved with the concert were allowed.\nKlavier:\nAnd of all the people involved with the concert... ...only one is small enough to be considered a \"child\".\nJudge:\nThe... The defendant!?\nKlavier:\nThe pixie of the arpeggio flitted up toward the sky... ...and disappeared from the scene of the crime.\nApollo:\n\nApollo:\nB-But that's just conjecture!\nKlavier:\nOh? There was no other way out of that room. You were there. You should know, Herr Forehead.\nApollo:\n...!\nEma:\nAnd... there is another vital piece of evidence.\nApollo:\nEvidence...? What!?\nEma:\nMarks were found on the air vent grill. Traces that it had recently been opened.\nApollo:\nWait, what...!?\nEma:\nAnd something else was found, quite clearly. The defendant, Machi Tobaye's fingerprints.\nApollo:\nWha... Whaaaaaaaaaaaaaaaaaat!?\nJudge:\nOrder! Order! Order!\nKlavier:\nThat air vent was the only way out of the room! The defendant's fingerprints were found on the grill! ...Well, Herr Forehead? What fairy tale does this suggest to you?\nApollo:\nUrk...!\nKlavier:\nOnly one could pass through that vent, that \"doorway to heaven\"... ...and that one is our pixie.\nApollo:\n......\nTrucy:\nWhy are you looking at me, Apollo? Hey! I was out whooping it up in the audience!\nApollo:\n(So this was his decisive evidence...)\nJudge:\nHmm... Quite decisive, indeed.Apollo:\n(I know the circumstances under which the body was found... I was there.)Trucy:\nAn examination of the crime scene was enough to nail down the killer?Apollo:\nI'm sure they have a good reason. (They must have had a good reason to arrest Machi... ...And I'm going to find out what it was!)After pressing first, fourth, and fifth statements:Judge:\nI believe that's enough of that.Apollo:\n!Judge:\nThe prosecution has a rather convincing case. The only way in and out of the crime scene was watched. Making the defendant the only one who could possibly leave the scene. Simple, and decisive.Apollo:\nUgh...Judge:\nI believe we've heard enough to determine our verdict. Even if I wasn't in a hurry to make a hospital visit.Klavier:\nI'm sure the Chief Justice will appreciate the gesture. Unfortunately, we have no direct witnesses. Fortunately, the criminal left decisive evidence for us. That will have to be enough.Apollo:\n(Argh! It can't be over already!)Judge:\nVery well, I believe this trial is finished. If the defense has no contradicting evidence...?Klavier:\nThe prosecution has presented our proof, clear and plain. If you have contradicting evidence... ...it'd better be clear and plain.Trucy:\nAck, Apollo! They've got us on the ropes already! We'd better come up with something quick!Apollo:\nI know! I know! (Think! What can get us out of this!? We need evidence, or a witness, that can prove Machi is innocent beyond a doubt. Without that... *gulp*)Judge:\nMr. Justice? Do you have contradicting proof that can overturn the prosecution's case? If you do, you'd better tell us about it now.Apollo:\n(This is it... and so soon! If I mess this one up, it's all over...!) The court wants contradicting proof?Present evidence\n\n\n\n\n\n\n\nApollo:\nThe defense is prepared to show contradicting evidence!\nKlavier:\nThis should be interesting! What sort of evidence?\nJudge:\nYes, what sort of evidence, Mr. Justice? Show us evidence contradicting the prosecution's claims!\n\n\n\nPresent anything\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThis evidence does more than contradict, it flips the whole case on its head!\nJudge:\n......\nKlavier:\nThank you for presenting evidence that is both clear and plain, as requested.\nJudge:\nYes... Clearly and plainly wrong! I'm afraid the only thing flipped on its head here was you as a child, Mr. Justice.\nApollo:\n(Ugh... I guess that wasn't it.)\nKlavier:\nMy claim is clear: the only person who could have fled the scene was the defendant.\nJudge:\nAnd there were no witnesses, either.\nKlavier:\nI fear the defense's options are limited, Mr. Justice.\nApollo:\n(Grr! There's only one way out of this... Evidence, or a witness, that can prove Machi's innocence beyond a doubt.)\nJudge:\nLet's ask the defense once again.\nLeads back to:\n\"Do you have contradicting proof that can overturn the prosecution's case?\"Call a witness\n\n\n\n\n\n\n\nLeads to:\n\"Prosecutor Gavin, you claim that there were no witnesses to this crime.\"I don't have proof\n\n\n\n\n\n\n\nApollo:\nI... don't have contradicting proof, actually.\nJudge:\nToo bad. Very well, this court finds the defendant...\n???:\n\nTrucy:\nW-Waaait!\nJudge:\nWh-What for?\nTrucy:\nWe have, uh, what was it called? Contradictual proof? Anyway, whatever it is, we've got it!\nJudge:\nIs this true?\nTrucy:\nOf course it's true! Show 'em, Apollo!\nApollo:\nWhat the heck are you talking about!?\nTrucy:\nLook, we give up now, Machi's really done for!\nApollo:\n(She's right... If we give up here, we're finished. I need proof or a witness... I must have something...!)\nJudge:\nAlright, we'll give you another chance, then.\nLeads back to:\n\"Do you have contradicting proof that can overturn the prosecution's case?\"Apollo:\nProsecutor Gavin, you claim that there were no witnesses to this crime. Are you absolutely sure?Klavier:\nAbsolutely. I'd swear it on my career as a prosecutor... And on my million-seller hit song \"Atroquinine, My Love\".Trucy:\n...There he goes again.Apollo:\nThat's too bad, because there was a witness.Judge:\nHo ho! Really now? But how did you come to possess knowledge the prosecution clearly does not?Apollo:\nBecause I am the only one in the world who knows this.Apollo:\n(...What's going on? I just talked to him, and now...)LeTouse:\n......Nnnh......Apollo:\n...! (He... He's alive!) Mr. LeTouse! Can you hear me!?LeTouse:\n...Cold... so cold... Witness...Apollo:\nYou're cold? D-Don't worry, you're going to be fine! Help is on the way!LeTouse:\n...Can't s...see...Apollo:\nHang in there, Mr. LeTouse! Tell me, who was the witness?LeTouse:\nThe wi...witness...is ...si...si...ren...Judge:\nWhaaat!? The victim said this before he died!?Klavier:\nPerhaps he did... and perhaps he did not.Apollo:\nWhat do you mean by that?Klavier:\nAll we know is what Herr Forehead says he said. It's no testimony, especially since it comes from the defense attorney himself.Apollo:Apollo:\nBut it's the truth! He said it! I even told you about it! But apparently, you ignored me completely.Klavier:\nIt's my policy to fully investigate everything I deem relevant. Clearly this rookie lawyer thinks he can tell me how to do my job.Judge:\n...That's enough! Mr. Justice, we need clear contradictory proof from you. This witness of yours, unknown to the prosecution... ...I hope you're right. Failure carries a stiff penalty.Klavier:\nPerhaps... A stiffer penalty than usual is called for?Apollo:\n(Urk! There's no backing out now!)Judge:\nLet's hear the name of your witness, Mr. Justice.Present Lamiroir profile\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Lamiroir...?\"Present anyone else\n\n\n\n\n\n\n\nApollo:\n\nJudge:\nAnd you claim that they witnessed the murder?\nKlavier:\nThis is a bit unexpected. And you have proof?\nApollo:\nWell, actually... (Uh oh. I can't think of anything.)\nJudge:\nI know that look, Mr. Justice. It's the look of a man who's about to be penalized.\nKlavier:\nI doubted there was a witness in the first place. No one had time! They were far too busy rocking to our wild sounds!\nTrucy:\nMy heart was handcuffed to the stage, I know that!\nEma:\nI felt nothing.\nKlavier:\n...It's sad but true. Some people will never appreciate true art.\nApollo:\n(Why's he pointing at me!? Think, how can I get him to accept there was a witness? I need some kind of proof...)\nJudge:\nLet's start over, shall we?\nLeads back to:\n\"Let's hear the name of your witness, Mr. Justice.\"Judge:\nLamiroir...?Apollo:\nRecall Mr. LeTouse's last words.LeTouse:\nThe wi...witness...is ...si...si...ren...Judge:\nThe siren... Ah ha! He meant the \"Siren\"!Apollo:\nThat's right. The \"Siren of the Ballad\"... Lamiroir! Lamiroir was only on stage for the second set... ...and she had access to the backstage area. She could have been a witness!Judge:\nI see... Well, Prosecutor Gavin?Klavier:\nMy claim still stands. There was no witness to this crime!Judge:\nVery well! Let's hear it from the horse's mouth then, shall we? We will now take a break from Detective Ema Skye's cross-examination. ...Please show Lamiroir to the witness stand.Apollo:\n(Lamiroir would say nothing the night of the murder... Not today, though. Today we'll drag that story out of her no matter what it is!)Klavier:\n......Klavier:\nIt is my distinct honor to welcome the Siren of the Ballad to our courtroom...Lamiroir:\nYou are too kind.Judge:\nAh, y-you can speak English?Lamiroir:\nYes... Yes I can. Though I am not very good. ...There is much I do not know.Judge:\nYou speak so well! Have you spent time here before?Lamiroir:\nActually, I do not know how I came by my knowledge of your language. Nor where I studied it...Apollo:\n...? (What does she mean, she doesn't know...?)Klavier:\nI, too, thought to call her as a witness. But I did not. I had a reason, of course.Apollo:\nWhat's that?Klavier:\nLamiroir... suffers from amnesia.Judge:\nAmnesia...?Lamiroir:\nLamiroir... is not my true name. Yet I remember nothing of the time before I was given it. ...Nothing of the time before I started singing on stage.Trucy:\nWhoa! She's even more mysterious than I thought!Klavier:\nAs lauded singer Lamiroir, she lives a good life. There are little difficulties for her, thanks to her success. Yet... I did not wish to subject her to unnecessary stress.Judge:\nHmm... I see. I care surprisingly little about people's pasts. You have nothing to fear in this court, Lamiroir.Lamiroir:\n...Thank you. Yet there is something I do not understand. I am being called as a witness? What might I say? No one will tell me anything of what happened...Klavier:\nLamiroir, let me be frank. I did not want to ask you up here to testify. Yet, that young gentleman with the wide forehead over there was adamant that you stand.Lamiroir:\nOh my...Trucy:\nCongratulations, Apollo. You're the bad guy!Apollo:\nUgh...Judge:\nWell, now that you're here, please give us your testimony. ...If nothing else, the sound of your voice is welcome. Tell us what you saw the night of the crime!Witness Testimony-- What I Saw --Lamiroir:\nAs for what I saw... I saw nothing.\nThat night, I was invited to sing on stage, and this I did.\nI did not return backstage after the second set.\nThen I was led by the police to Mr. Gavin's dressing room, and told to wait there.\nThat was where I learned that something had happened... But I wasn't told the details.Judge:\nHmm... I must say, you sound wonderful just testifying.Apollo:\n(I hope he was too distracted to hear what she was actually saying...)Klavier:\nThere you have it. She saw nothing that night. Now we can only pray that the defense has the sense to admit defeat. ...And refrain from detaining her here longer than need be.Trucy:\nWow, you just got badder, Apollo! Way to go!Apollo:\nGrr...Judge:\nVery well, Mr. Justice. Keep it short and sweet!Apollo:\n(Lamiroir wouldn't talk to me the night of the crime. She must know something, and I've got to find out what!)Cross ExaminationCross Examination-- What I Saw --Lamiroir:\nAs for what I saw... I saw nothing.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nBut you must have seen something! Mr. LeTouse named you!\nLamiroir:\nMr. LeTouse... ...How can I tell you what I don't know?\nApollo:\nLamiroir! He said you were a witness with his dying words!\nLamiroir:\nI do not know what he meant to say, but that night...Lamiroir:\nThat night, I was invited to sing on stage, and this I did.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nIt... It was a great concert.\nLamiroir:\nYou heard me sing? Thank you.\nApollo:\nI was hoping to get an autograph later, actually...\nLamiroir:\nOf course.\nJudge:\nMr. Justice! This is a cross-examination! You're out of line! ...If anyone deserves an autograph here, it's me. One on my gavel would be nice.\nKlavier:\nHerr Judge.\nJudge:\nWh-What's this?\nKlavier:\nIt's my autograph. Now keep this trial moving.\nJudge:\nWh-What!?\nJudge:\nOh, my grandchild will be so happy!\nApollo:\n(Apparently his grandson is a big fan...)\nKlavier:\nLet us continue, shall we? If you would, Lamiroir... ...Tell us what you did after your stellar performance.Lamiroir:\nI did not return backstage after the second set.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou did not return backstage once? Where were you then? What were you doing?\nLamiroir:\nI was cleaning up on stage. There are many things I must do for a performance other than simply sing.\nApollo:\nAnd was Machi with you at the time?\nLamiroir:\nUnfortunately, I do not know where he was...\nApollo:\n(So much for an alibi for Machi...)Present Brooch\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nI'm sorry Lamiroir, but I'm having trouble believing you.\nLamiroir:\n......\nApollo:\nYou remember this brooch, do you not?\nKlavier:\nWhy that's Lamiroir's. She was wearing it for her song.\nApollo:\n...Care to add that to the testimony, Prosecutor Gavin?\nKlavier:\nWh-What...?\nApollo:\nThis brooch was found after the murder took place. ...At the very scene of the crime!\nKlavier:\nWhat...!?\nApollo:\n...Lamiroir. How did your brooch get backstage if you did not go there yourself? And, as Prosecutor Gavin has just told us... ...you had been wearing it during your performance that night!\nLamiroir:\n...!\nJudge:\nWhat is the meaning of this? Lamiroir, please explain!\nLamiroir:\n......\nApollo:\nLamiroir...?\nLamiroir:\n............ [Foreign text]....\nKlavier:\n...She says, \"English is quite difficult.\"\nApollo:\nThat trick's not going to work here!\nLamiroir:\n[Foreign text]....\nKlavier:\n\"Your forehead may be large, but you are a lawyer, truly. But... you have missed one important fact.\"\nApollo:\nWhat now?\nLamiroir:\n[Foreign text]....\nKlavier:\n\"In fact, at the time of the incident... ...I went backstage, but only for a moment.\"\nApollo:\nWh-Whaat!?\nLamiroir:\n[Foreign text]....\nKlavier:\n\"Think back to the moment of the crime. You know whereof I speak.\"\nApollo:\n(Is she really saying all that?)\nTrucy:\nWhat's she talking about, Apollo?\nApollo:\nRight when the incident occurred... Ah! (Is she talking about that!?)\n\n\nEma:\nWatch this room for me. I have to call for backup!\nApollo:\nR-Right, understood. You want me to make sure no one comes in, right? Mr. LeTouse! Can you hear me!?\nLeTouse:\n...Cold...so cold... Witness...\nApollo:\nYou're cold? D-Don't worry, you're going to be fine! Help is on the way!\nLeTouse:\nThe wi...witness...is ...si...si...ren...\nApollo:\n(...\"Siren\"? How can a siren witness anything...?) Yipes! Ema!? (What was that!?) Wh-Who's there!?\nEma:\nWhat's wrong?\nApollo:\nEma! Did you see anyone just now!?\nEma:\nHuh? No...\nApollo:\n(I could have sworn I heard a door close...)\n\n\nLamiroir:\nI... looked into the room. Just a glance, mind you.\nKlavier:\nSo this was when your brooch dropped? That explains that.\nLamiroir:\nIt does. There was no other time I could have dropped it.\nApollo:\nBut that's ridiculous! You only looked in for an instant, but you dropped your brooch?\nKlavier:\n...Herr Forehead.\nApollo:\n!\nKlavier:\nShe has raised a possibility. The only thing that can counter that... is evidence.\nJudge:\nHmm... So she looked in at the crime scene.\nLamiroir:\nActually, I intended to go into the dressing room. I knew nothing of what had happened, of course. But the moment I opened the door, I heard a horrible voice.\nKlavier:\nHerr Forehead shouting, \"Who's there!\" no doubt. A horrible voice indeed...\nApollo:\nUgh...\nLamiroir:\nI closed the door immediately.\nJudge:\nWell, that explains the brooch. Let's return to your testimony.\nApollo:\n(That's too convenient... She's hiding something!) Lamiroir! You did look into the room though, right?\nLamiroir:\nY-Yes...\nApollo:\nTestify as to what you saw!\nLamiroir:\nVery well. Though it was only the briefest of glimpses...\nChanges statement from \"I did not return backstage after the second set.\" to \"When my performance was finished, I went backstage for just a moment...\"\nAdds statement \"I saw nothing. The late Mr. LeTouse's body was behind a wall.\"Lamiroir:\nWhen my performance was finished, I went backstage for just a moment...Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhat did you see in that brief glimpse?\nLamiroir:\nI had only opened the door slightly when I heard that horrible voice...\nJudge:\n...And shut the door.\nKlavier:\nI have always wondered, Herr Forehead. Does that voice of yours lack a volume knob?\nApollo:\n(It's my Chords of Steel, man. Just back off!)Lamiroir:\nI saw nothing. The late Mr. LeTouse's body was behind a wall.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nA wall...? Was there a wall there?\nLamiroir:\n\"[Foreign text]\" is what in English?\nKlavier:\nA \"division\" or \"partition\", I believe. It was a large dressing room, divided into two halves.\nApollo:\n(And the murder took place in the inside half. I guess that partition might have hidden the body...)Perceive swallowing on \"The late Mr. LeTouse's body\"\n\n\n\n\n\n\n\nApollo:\n\nApollo:\n\"The late Mr. LeTouse's body\", you say?\nLamiroir:\nYes...?\nApollo:\nYou know something more about Mr. LeTouse's death than you are saying.\nLamiroir:\nWhat...?\nApollo:\nI could see you trying not to remember... But the effort made you swallow! ...You can't fool my eyes.\nLamiroir:\n! ...It is true. It was so terrible, after all. Why did Mr. LeTouse have to be shot?\nApollo:\nOne moment, Lamiroir.\nLamiroir:\nYes...?\nApollo:\nWhat was that you just said? \"Why did Mr. LeTouse have to be shot?\"\nLamiroir:\nYes...?\nApollo:\n(She was hiding something, I knew it!) Lamiroir, I'm afraid you haven't realized it, but... ...your words just now contradict your testimony!\nLamiroir:\nEh? How could that be!?\nApollo:\n(...Take this! Lamiroir contradicted her own testimony, and I have the evidence to prove it!)\n\n\n\nPresent Investigation Request\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Tell me, Lamiroir...\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nApollo:\n\nLamiroir:\nIf I do not misunderstand the meaning of \"contradiction\"... ...it is you who contradict, Mr. Justice.\nApollo:\nHuh?\nLamiroir:\nYour evidence... is meaningless.\nApollo:\n(Ack! Wrong evidence! Gotta think this over... What did she say again? \"Why did Mr. LeTouse have to be shot\"? That's right... That totally contradicts her testimony!)\nLeads back to:\n\"...Take this!\"\n\n\nApollo:\nTell me, Lamiroir... How did you know he had been shot?\nLamiroir:\nEh. Well, I...\nApollo:\nImmediately following the incident, a gag order was placed on the scene. This is the document proving that. In your testimony, you told the court... \"No one told me anything about the incident.\"\nLamiroir:\nAh...\nApollo:\nFurthermore, you testified that you had \"seen nothing\".\nLamiroir:\n...!\nApollo:\nYet you knew that Mr. LeTouse had been shot! How could you have known!?\nLamiroir:\n...! Yeeeeeeeeeeeeeoooooooowrk!\n\n\nJudge:\nLamiroir! You aren't hiding something from this court, I hope!\nLamiroir:\n......\nApollo:\n(That sweet song of hers was sounding a little too sweet!)\nLamiroir:\nAh, now I remember. Please... allow me to add to my testimony.\nKlavier:\n...Of course. All we want to know... is the truth.\nTrucy:\nShe looks kind of pale, huh?\nApollo:\nShe saw something, I know it. Even the victim said so!\nChanges statement from \"I saw nothing. The late Mr. LeTouse's body was behind a wall.\" to \"I saw bullet holes in the wall, and knew Mr. LeTouse had been shot...\"Lamiroir:\nI saw bullet holes in the wall, and knew Mr. LeTouse had been shot...Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nOnly a glimpse, yet you knew they were bullet holes?\nLamiroir:\nYes. I recognized them immediately. I have seen bullet holes before, you know.\nKlavier:\nYou have traveled the world as a singer... You must have sung in places far more dangerous than our country.\nLamiroir:\nI go wherever my voice is needed. Those places... are many, these days.\nTrucy:\nThat's really cool! I hope I get to travel like Lamiroir some day.\nKlavier:\nI plan on recording my next album overseas. Their studios have a different sound, you know.\nApollo:\n(Hmm. Maybe I should go on a Chords of Steel tour, too.)Present Diagram\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Lamiroir. They call you the Siren of the Ballad...\"Lamiroir:\nThen I was led by the police to Mr. Gavin's dressing room, and told to wait there.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWith Machi, correct? How was he then?\nLamiroir:\nHe seemed as he always does. Though I believe he was shocked by the news of Mr. LeTouse's death. Yet... He is not the type to show much emotion.\nKlavier:\nYes. He's given the police no end of headaches. He answers most questions with silence... and those glinting frames speak nothing. The questioning hasn't gotten very far.\nLamiroir:\nWe sat there, waiting...Lamiroir:\nThat was where I learned that something had happened... But I wasn't told the details.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHow was the incident explained to you?\nLamiroir:\nI was told nothing in detail. Only that Mr. LeTouse died.\nJudge:\nOf course, investigations require some security.\nLamiroir:\nBut Mr. LeTouse was my manager! I wanted to know more. I should have been told. Both Machi and I were beside ourselves with concern.\nKlavier:\n...Allow me to apologize. But please understand... ...keeping you in the dark was as painful for me as it was for you.\nLamiroir:\nYes, I understand.Apollo:\n(Think, what doesn't ring true about her testimony?)Trucy:\n...It's hard to imagine Lamiroir lying...Apollo:\nShe might not be lying, but she's hiding something... (What wouldn't she tell me the night of the murder?)",
      "testimonies": [
        {
          "testimony": "As for what I saw... I saw nothing.",
          "person": "Lamiroir",
          "present": []
        },
        {
          "testimony": "That night, I was invited to sing on stage, and this I did.",
          "person": "Lamiroir",
          "present": []
        },
        {
          "testimony": "I did not return backstage after the second set.",
          "person": "Lamiroir",
          "present": []
        },
        {
          "testimony": "When my performance was finished, I went backstage for just a moment...",
          "person": "Lamiroir",
          "present": []
        },
        {
          "testimony": "I saw nothing. The late Mr. LeTouse's body was behind a wall.",
          "person": "Lamiroir",
          "present": []
        },
        {
          "testimony": "I saw bullet holes in the wall, and knew Mr. LeTouse had been shot...",
          "person": "Lamiroir",
          "present": [
            "Diagram"
          ],
          "source": {
            "evidence_span": "Two bullet holes were found on the wall where the door was.",
            "testimony_span": "I saw bullet holes in the wall",
            "explanation": "One cannot see the wall where the door was from outside the room.",
            "is_self_contained": "no",
            "context_span": "I... looked into the room. Just a glance, mind you.",
            "isMultimodal": true
          }
        },
        {
          "testimony": "Then I was led by the police to Mr. Gavin's dressing room, and told to wait there.",
          "person": "Lamiroir",
          "present": []
        },
        {
          "testimony": "That was where I learned that something had happened... But I wasn't told the details.",
          "person": "Lamiroir",
          "present": []
        }
      ],
      "noPresent": false,
      "summarized_context": "The witness Lamiroir describes what she saw at in the room at the backstage when she took a peek from the entrance door.",
      "labels": [
        "spatial"
      ],
      "reasoning": [
        "Fact 1: The witness claims she saw bullet holes in the wall.",
        "Fact 2: The evidence suggests the bullet holes were on the same wall as the door.",
        "Fact 3: The context suggests the witness only glanced into the room from outside the door.",
        "Prop 1: If a person is outside the room, they cannot see the inner side of the wall where the door is installed"
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- What I Saw --Lamiroir:\nAs for what I saw... I saw nothing.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nBut you must have seen something! Mr. LeTouse named you!\nLamiroir:\nMr. LeTouse... ...How can I tell you what I don't know?\nApollo:\nLamiroir! He said you were a witness with his dying words!\nLamiroir:\nI do not know what he meant to say, but that night...Lamiroir:\nThat night, I was invited to sing on stage, and this I did.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nIt... It was a great concert.\nLamiroir:\nYou heard me sing? Thank you.\nApollo:\nI was hoping to get an autograph later, actually...\nLamiroir:\nOf course.\nJudge:\nMr. Justice! This is a cross-examination! You're out of line! ...If anyone deserves an autograph here, it's me. One on my gavel would be nice.\nKlavier:\nHerr Judge.\nJudge:\nWh-What's this?\nKlavier:\nIt's my autograph. Now keep this trial moving.\nJudge:\nWh-What!?\nJudge:\nOh, my grandchild will be so happy!\nApollo:\n(Apparently his grandson is a big fan...)\nKlavier:\nLet us continue, shall we? If you would, Lamiroir... ...Tell us what you did after your stellar performance.Lamiroir:\nI did not return backstage after the second set.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou did not return backstage once? Where were you then? What were you doing?\nLamiroir:\nI was cleaning up on stage. There are many things I must do for a performance other than simply sing.\nApollo:\nAnd was Machi with you at the time?\nLamiroir:\nUnfortunately, I do not know where he was...\nApollo:\n(So much for an alibi for Machi...)Present Brooch\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nI'm sorry Lamiroir, but I'm having trouble believing you.\nLamiroir:\n......\nApollo:\nYou remember this brooch, do you not?\nKlavier:\nWhy that's Lamiroir's. She was wearing it for her song.\nApollo:\n...Care to add that to the testimony, Prosecutor Gavin?\nKlavier:\nWh-What...?\nApollo:\nThis brooch was found after the murder took place. ...At the very scene of the crime!\nKlavier:\nWhat...!?\nApollo:\n...Lamiroir. How did your brooch get backstage if you did not go there yourself? And, as Prosecutor Gavin has just told us... ...you had been wearing it during your performance that night!\nLamiroir:\n...!\nJudge:\nWhat is the meaning of this? Lamiroir, please explain!\nLamiroir:\n......\nApollo:\nLamiroir...?\nLamiroir:\n............ [Foreign text]....\nKlavier:\n...She says, \"English is quite difficult.\"\nApollo:\nThat trick's not going to work here!\nLamiroir:\n[Foreign text]....\nKlavier:\n\"Your forehead may be large, but you are a lawyer, truly. But... you have missed one important fact.\"\nApollo:\nWhat now?\nLamiroir:\n[Foreign text]....\nKlavier:\n\"In fact, at the time of the incident... ...I went backstage, but only for a moment.\"\nApollo:\nWh-Whaat!?\nLamiroir:\n[Foreign text]....\nKlavier:\n\"Think back to the moment of the crime. You know whereof I speak.\"\nApollo:\n(Is she really saying all that?)\nTrucy:\nWhat's she talking about, Apollo?\nApollo:\nRight when the incident occurred... Ah! (Is she talking about that!?)\n\n\nEma:\nWatch this room for me. I have to call for backup!\nApollo:\nR-Right, understood. You want me to make sure no one comes in, right? Mr. LeTouse! Can you hear me!?\nLeTouse:\n...Cold...so cold... Witness...\nApollo:\nYou're cold? D-Don't worry, you're going to be fine! Help is on the way!\nLeTouse:\nThe wi...witness...is ...si...si...ren...\nApollo:\n(...\"Siren\"? How can a siren witness anything...?) Yipes! Ema!? (What was that!?) Wh-Who's there!?\nEma:\nWhat's wrong?\nApollo:\nEma! Did you see anyone just now!?\nEma:\nHuh? No...\nApollo:\n(I could have sworn I heard a door close...)\n\n\nLamiroir:\nI... looked into the room. Just a glance, mind you.\nKlavier:\nSo this was when your brooch dropped? That explains that.\nLamiroir:\nIt does. There was no other time I could have dropped it.\nApollo:\nBut that's ridiculous! You only looked in for an instant, but you dropped your brooch?\nKlavier:\n...Herr Forehead.\nApollo:\n!\nKlavier:\nShe has raised a possibility. The only thing that can counter that... is evidence.\nJudge:\nHmm... So she looked in at the crime scene.\nLamiroir:\nActually, I intended to go into the dressing room. I knew nothing of what had happened, of course. But the moment I opened the door, I heard a horrible voice.\nKlavier:\nHerr Forehead shouting, \"Who's there!\" no doubt. A horrible voice indeed...\nApollo:\nUgh...\nLamiroir:\nI closed the door immediately.\nJudge:\nWell, that explains the brooch. Let's return to your testimony.\nApollo:\n(That's too convenient... She's hiding something!) Lamiroir! You did look into the room though, right?\nLamiroir:\nY-Yes...\nApollo:\nTestify as to what you saw!\nLamiroir:\nVery well. Though it was only the briefest of glimpses...\nChanges statement from \"I did not return backstage after the second set.\" to \"When my performance was finished, I went backstage for just a moment...\"\nAdds statement \"I saw nothing. The late Mr. LeTouse's body was behind a wall.\"Lamiroir:\nWhen my performance was finished, I went backstage for just a moment...Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhat did you see in that brief glimpse?\nLamiroir:\nI had only opened the door slightly when I heard that horrible voice...\nJudge:\n...And shut the door.\nKlavier:\nI have always wondered, Herr Forehead. Does that voice of yours lack a volume knob?\nApollo:\n(It's my Chords of Steel, man. Just back off!)Lamiroir:\nI saw nothing. The late Mr. LeTouse's body was behind a wall.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nA wall...? Was there a wall there?\nLamiroir:\n\"[Foreign text]\" is what in English?\nKlavier:\nA \"division\" or \"partition\", I believe. It was a large dressing room, divided into two halves.\nApollo:\n(And the murder took place in the inside half. I guess that partition might have hidden the body...)Perceive swallowing on \"The late Mr. LeTouse's body\"\n\n\n\n\n\n\n\nApollo:\n\nApollo:\n\"The late Mr. LeTouse's body\", you say?\nLamiroir:\nYes...?\nApollo:\nYou know something more about Mr. LeTouse's death than you are saying.\nLamiroir:\nWhat...?\nApollo:\nI could see you trying not to remember... But the effort made you swallow! ...You can't fool my eyes.\nLamiroir:\n! ...It is true. It was so terrible, after all. Why did Mr. LeTouse have to be shot?\nApollo:\nOne moment, Lamiroir.\nLamiroir:\nYes...?\nApollo:\nWhat was that you just said? \"Why did Mr. LeTouse have to be shot?\"\nLamiroir:\nYes...?\nApollo:\n(She was hiding something, I knew it!) Lamiroir, I'm afraid you haven't realized it, but... ...your words just now contradict your testimony!\nLamiroir:\nEh? How could that be!?\nApollo:\n(...Take this! Lamiroir contradicted her own testimony, and I have the evidence to prove it!)\n\n\n\nPresent Investigation Request\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Tell me, Lamiroir...\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nApollo:\n\nLamiroir:\nIf I do not misunderstand the meaning of \"contradiction\"... ...it is you who contradict, Mr. Justice.\nApollo:\nHuh?\nLamiroir:\nYour evidence... is meaningless.\nApollo:\n(Ack! Wrong evidence! Gotta think this over... What did she say again? \"Why did Mr. LeTouse have to be shot\"? That's right... That totally contradicts her testimony!)\nLeads back to:\n\"...Take this!\"\n\n\nApollo:\nTell me, Lamiroir... How did you know he had been shot?\nLamiroir:\nEh. Well, I...\nApollo:\nImmediately following the incident, a gag order was placed on the scene. This is the document proving that. In your testimony, you told the court... \"No one told me anything about the incident.\"\nLamiroir:\nAh...\nApollo:\nFurthermore, you testified that you had \"seen nothing\".\nLamiroir:\n...!\nApollo:\nYet you knew that Mr. LeTouse had been shot! How could you have known!?\nLamiroir:\n...! Yeeeeeeeeeeeeeoooooooowrk!\n\n\nJudge:\nLamiroir! You aren't hiding something from this court, I hope!\nLamiroir:\n......\nApollo:\n(That sweet song of hers was sounding a little too sweet!)\nLamiroir:\nAh, now I remember. Please... allow me to add to my testimony.\nKlavier:\n...Of course. All we want to know... is the truth.\nTrucy:\nShe looks kind of pale, huh?\nApollo:\nShe saw something, I know it. Even the victim said so!\nChanges statement from \"I saw nothing. The late Mr. LeTouse's body was behind a wall.\" to \"I saw bullet holes in the wall, and knew Mr. LeTouse had been shot...\"Lamiroir:\nI saw bullet holes in the wall, and knew Mr. LeTouse had been shot...Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nOnly a glimpse, yet you knew they were bullet holes?\nLamiroir:\nYes. I recognized them immediately. I have seen bullet holes before, you know.\nKlavier:\nYou have traveled the world as a singer... You must have sung in places far more dangerous than our country.\nLamiroir:\nI go wherever my voice is needed. Those places... are many, these days.\nTrucy:\nThat's really cool! I hope I get to travel like Lamiroir some day.\nKlavier:\nI plan on recording my next album overseas. Their studios have a different sound, you know.\nApollo:\n(Hmm. Maybe I should go on a Chords of Steel tour, too.)Present Diagram\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Lamiroir. They call you the Siren of the Ballad...\"Lamiroir:\nThen I was led by the police to Mr. Gavin's dressing room, and told to wait there.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWith Machi, correct? How was he then?\nLamiroir:\nHe seemed as he always does. Though I believe he was shocked by the news of Mr. LeTouse's death. Yet... He is not the type to show much emotion.\nKlavier:\nYes. He's given the police no end of headaches. He answers most questions with silence... and those glinting frames speak nothing. The questioning hasn't gotten very far.\nLamiroir:\nWe sat there, waiting...Lamiroir:\nThat was where I learned that something had happened... But I wasn't told the details.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHow was the incident explained to you?\nLamiroir:\nI was told nothing in detail. Only that Mr. LeTouse died.\nJudge:\nOf course, investigations require some security.\nLamiroir:\nBut Mr. LeTouse was my manager! I wanted to know more. I should have been told. Both Machi and I were beside ourselves with concern.\nKlavier:\n...Allow me to apologize. But please understand... ...keeping you in the dark was as painful for me as it was for you.\nLamiroir:\nYes, I understand.Apollo:\n(Think, what doesn't ring true about her testimony?)Trucy:\n...It's hard to imagine Lamiroir lying...Apollo:\nShe might not be lying, but she's hiding something... (What wouldn't she tell me the night of the murder?)Apollo:\nLamiroir. They call you the Siren of the Ballad... ...but lies are hardly becoming of such a creature.Judge:\n...A put-down worthy of our prosecutor, Mr. Justice.Trucy:\n...Such put-downs are hardly becoming of you, Apollo.Klavier:\n...Stop polishing your forehead and start polishing your character, ja?Apollo:\n(C'mon, can't I be cool for once!?) Observe the diagram! Lamiroir, you looked in from the door for just a moment. Correct?Lamiroir:\nY-Yes, that is so.Apollo:\nThere were bullet holes in the room, yes. But they were in the wall the door is on!Lamiroir:\nEh...Apollo:\nYou see? Assuming you merely glanced into the room... ...you couldn't have seen those bullet holes!Lamiroir:\nYeeeeeeeeeeeeeooowrk!Judge:\n...... Lamiroir.Lamiroir:\n...Yes.Judge:\nI'm afraid the defense has raised a good point. It appears you have been holding back something.Lamiroir:\n...And I must tell you? I must tell you what it is that I saw?Judge:\nYes. The happenings in this trial are being recorded. And I'm certain it will be on the news in Borginia. You understand your reputation is at stake. It falls to you to avoid tarnishing it.Klavier:\nPersonally speaking... I still believe that cross-examining her will yield us absolutely nothing.Apollo:\nBut she knew how Mr. LeTouse died! And he named her as a witness! You must have seen something, Lamiroir!Judge:\n...Very well. Lamiroir... Please continue your testimony.Lamiroir:\n... Very well, I shall.Witness Testimony-- What I Saw 2 --Lamiroir:\nI was on my way from the stage to the backstage exit.\nThere was something like a little window there... That's how I saw it.\nThere were two shots... I couldn't do anything to stop it.\nBut it wasn't Machi!\nIt was a grown person! ...I know it was!Judge:\nSo you did witness the crime! And the killer was... a grown person, you say?Klavier:\nAch. This is my first time hearing this, I assure you. Nice play, Herr Forehead.Apollo:\n......Judge:\nVery well, Herr... er, Mr. Justice. You may begin your cross-examination!Trucy:\nGreat going, Apollo! You were right about Lamiroir. ...What's wrong? You don't look too happy.Apollo:\n(This whole thing smells fishy... That's what's wrong.)Trucy:\n...?Cross ExaminationCross Examination-- What I Saw 2 --Lamiroir:\nI was on my way from the stage to the backstage exit.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo you were heading toward the dressing room?\nLamiroir:\nYes.\nApollo:\n(So this is a little before she opened the dressing room door and dropped her brooch. ...About the same time Ema and I heard those shots.)\nLamiroir:\nI was on my way back...Lamiroir:\nThere was something like a little window there... That's how I saw it.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nUm, what exactly is something like a little window?\nLamiroir:\nYes, well... \"Window\" is the best word I know in English. I think this is how it is said, yes.\nKlavier:\nYou need not worry, Lamiroir. Your choice of words is impeccable. There is a small window in the dressing room in question. Perhaps the defense remembers this detail?\nApollo:\n(That little window on the wall...)\nLamiroir:\nI, er, saw the crime from there.Lamiroir:\nThere were two shots... I couldn't do anything to stop it.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou are certain you heard two shots fired?\nLamiroir:\nYes, quite certain. I was on my way to the backstage exit. This was when I heard a faint sound... like a gunshot. Wondering what it had been, I peered through the window. That is when I heard the second gunshot, much closer.\nApollo:\n(And there were two bullet holes at the scene... no contradictions so far.)\nLamiroir:\n...It all happened on the other side of that window. There was nothing I could do.Lamiroir:\nBut it wasn't Machi!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nIt wasn't Machi who shot... Are you sure?\nLamiroir:\nYes, quite certain.\nKlavier:\nAh ha ha... It amuses me that you would question her testimony. It is testimony in your favor! Isn't it my job to object?\nTrucy:\nYeah, Apollo, what were you thinking!?\nApollo:\nTrucy... Let's just listen to what Lamiroir has to say. Can you tell me how you were so sure?\nLamiroir:\nYes, of course. You see...Lamiroir:\nIt was a grown person! ...I know it was!Press\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"A \"grown person\"... That's a little vague.\"Trucy:\nYou can't ask for a better testimony than that!Apollo:\nI'm not so sure it's all that simple, Trucy. (There's a critical flaw in this testimony... And I have to point it out, even if it isn't good for our case...)",
      "testimonies": [
        {
          "testimony": "I was on my way from the stage to the backstage exit.",
          "person": "Lamiroir",
          "present": []
        },
        {
          "testimony": "There was something like a little window there... That's how I saw it.",
          "person": "Lamiroir",
          "present": []
        },
        {
          "testimony": "There were two shots... I couldn't do anything to stop it.",
          "person": "Lamiroir",
          "present": []
        },
        {
          "testimony": "But it wasn't Machi!",
          "person": "Lamiroir",
          "present": []
        },
        {
          "testimony": "It was a grown person! ...I know it was!",
          "person": "Lamiroir",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "-- What I Saw 2 --Lamiroir:\nI was on my way from the stage to the backstage exit.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo you were heading toward the dressing room?\nLamiroir:\nYes.\nApollo:\n(So this is a little before she opened the dressing room door and dropped her brooch. ...About the same time Ema and I heard those shots.)\nLamiroir:\nI was on my way back...Lamiroir:\nThere was something like a little window there... That's how I saw it.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nUm, what exactly is something like a little window?\nLamiroir:\nYes, well... \"Window\" is the best word I know in English. I think this is how it is said, yes.\nKlavier:\nYou need not worry, Lamiroir. Your choice of words is impeccable. There is a small window in the dressing room in question. Perhaps the defense remembers this detail?\nApollo:\n(That little window on the wall...)\nLamiroir:\nI, er, saw the crime from there.Lamiroir:\nThere were two shots... I couldn't do anything to stop it.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou are certain you heard two shots fired?\nLamiroir:\nYes, quite certain. I was on my way to the backstage exit. This was when I heard a faint sound... like a gunshot. Wondering what it had been, I peered through the window. That is when I heard the second gunshot, much closer.\nApollo:\n(And there were two bullet holes at the scene... no contradictions so far.)\nLamiroir:\n...It all happened on the other side of that window. There was nothing I could do.Lamiroir:\nBut it wasn't Machi!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nIt wasn't Machi who shot... Are you sure?\nLamiroir:\nYes, quite certain.\nKlavier:\nAh ha ha... It amuses me that you would question her testimony. It is testimony in your favor! Isn't it my job to object?\nTrucy:\nYeah, Apollo, what were you thinking!?\nApollo:\nTrucy... Let's just listen to what Lamiroir has to say. Can you tell me how you were so sure?\nLamiroir:\nYes, of course. You see...Lamiroir:\nIt was a grown person! ...I know it was!Press\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"A \"grown person\"... That's a little vague.\"Trucy:\nYou can't ask for a better testimony than that!Apollo:\nI'm not so sure it's all that simple, Trucy. (There's a critical flaw in this testimony... And I have to point it out, even if it isn't good for our case...)Apollo:\nA \"grown person\"... That's a little vague.Lamiroir:\nI am sorry. My skill with your language is... lacking, I know.Judge:\nCertainly you could at least see whether the shooter was male or female?Lamiroir:\n...... It was a man. A young man.Judge:\nAnd you're sure of that?Lamiroir:\nYes, his voice was quite clear.Apollo:\nVoice...?Judge:\nHmm... Looking at this diagram, it seems the dressing room was quite cluttered. It does seem likely that you wouldn't have had a clear view of the shooter.Lamiroir:\nAs a singer, I rely more on my ears than my eyes. When I hear a voice, I do not forget it. That voice... was the voice of a man.Klavier:\nSo you heard a voice. But wait... ...Couldn't that have been the victim, Mr. LeTouse?Lamiroir:\nAbsolutely not. Did I not just say that I do not forget a voice? If it was Mr. LeTouse who spoke, I would have known.Judge:\nHmm... Indeed. So you were at the window, and you heard the shooter's voice, the voice of a young man.Trucy:\nApollo! This is a good testimony! That proves it wasn't Machi!Apollo:\n......Judge:\nIndeed... If this turns out to be true, it would cast this case in a considerably different light. What is the defense's opinion of this testimony...?It's pretty good\n\n\n\n\n\n\n\nApollo:\n...Well, I'd have to say it's pretty good. Vital, even. This shows that the shooter wasn't Machi...\nKlavier:\nHah!\nApollo:\n...!\nKlavier:\nSurely you can't be serious, Herr Forehead.\nApollo:\nWh-Why not!?\nLeads to:\n\"Lamiroir.\"It's contradictory\n\n\n\n\n\n\n\nApollo:\nThough it pains me to say this... ...There's something about Lamiroir's testimony that rings false.\nLamiroir:\n...!\nKlavier:\nHeh. Bravo, Herr Forehead. You're colder than I thought.\nApollo:\n(I'm sure you remember what the problem is as well as I do, Gavin.) As has been established... No grown man could pass through that air vent. He couldn't have fled the scene of the crime.\nLamiroir:\n......\nTrucy:\nB-But that means Lamiroir has to be lying!\nApollo:\nI know, and I know it's bad for our case, but I can't shut my eyes to this. (Believe me, the idea was tempting...)\nKlavier:\nIt is as Herr Forehead says. Yet, this is not the only contradiction within her testimony.\nApollo:\nWh-What next!? (What's he talking about?)\nLeads to:\n\"Lamiroir.\"Klavier:\nLamiroir. I understand why you would want to protect Machi. Yet remember, you are the Siren of the Ballad... ...And lies do not become such a creature.Judge:\nWhat does the prosecution mean!?Trucy:\nApollo! What's he talking about!?Apollo:\n(How come no one bats an eye when he says stuff like that?)Klavier:\nI recall the state of the crime scene quite well.Apollo:\nThe state of the room...?Klavier:\nYes, and when the murder took place... ...that window was closed. I find it hard to believe you could hear a voice through it.Lamiroir:\nWhat!? B-But I... I'm sure...Klavier:\n...Lamiroir. I have nothing but the highest regard for your musical sense. ...But my opinion of you as a witness is somewhat lesser.Apollo:Apollo:\nB-But she's the only eye-witness we have!Klavier:Klavier:\nSo you say. And the victim named her, the \"Siren\" as the witness?Apollo:\nTh-That's right! That's what Mr. LeTouse...Klavier:\nWe heard your claim. We even entertained the possibility. And it brought us to this. Herr Judge!Judge:\nYes?Klavier:\nThe prosecution requests that the witness... be excused. Please.Judge:\nHmm... I'm afraid I must honor the prosecution's request. There is indeed a question of the witness's credibility.Apollo:\nB-But if Lamiroir can't testify...Trucy:\nThen we don't have a chance of proving Machi's innocence.Judge:\nThis cross-examination is over! ...Prosecutor Gavin. You may continue making your case.Klavier:\n...Danke. Now where were we? Ah yes, I would like to hear from Fräulein Detective again.Apollo:Apollo:\nWait! Let me hear Lamiroir's testimony one last time...Judge:\nBut the cross-examination is already over. Until such a time as a need arises... ...this witness may leave the stand.Lamiroir:\n...... I'm sorry I could not be of more assistance.Klavier:\n......Klavier:\nAt last, back to the real trial. Ready, Herr Forehead?Apollo:\n(Grr... I hope I didn't just miss my only chance.)Klavier:\nFräulein Detective, how far had we gotten until we were so rudely interrupted?Ema:\nDon't ask me!Klavier:\nI dislike saying the same thing twice. And I never repeat a song for an encore.Judge:\n...If you would, Ms. Skye.Ema:\n...Hmph. I believe I was saying that the only way Mr. LeTouse's killer could have escaped... ...was through that air vent on the ceiling.Judge:\nAh, yes, there was only one door in the room. And a witness, you, was standing in front of it.Ema:\nThat air vent isn't very big, see. Kind of limits the people who could possibly get through.Judge:\nI certainly would have a difficult time.Ema:\nYou sure would. Not that you would have been there in the first place, though. Remember, the whole backstage area was off-limits to people not involved with the concert. The only one who meets the conditions for our killer... is the defendant.Klavier:\n...A virtuoso performance! I couldn't have put it better myself.Judge:\nHmm. She does state a clear case. Though, reading the report, something caught my eye.Klavier:\nOh? What's that?Judge:\nThe circumstances of the defendant's arrest.Apollo:\nThe circumstances...? (Again...?)Trucy:\nHey, that's right, Apollo! Remember when we found Machi? That was bizarre!Apollo:\n(She's right... Why did Mr. LeTouse's body disappear from the room... ...and end up on top of that stage tower? ...Holding a guitar, no less.)Klavier:\n...A perceptive observation, Herr Judge.Judge:\nAh, er, thanks! It was kind of an accident, really. But you work in this job long enough... ...you get a nose for things. Eh he he.Trucy:\nThe judge sure seems pleased with himself!Klavier:\nVery good, Fräulein Detective. Perhaps you can tie it all together for us. Why was the body moved? And how does that lead us to the killer!?Witness Testimony-- The Missing Body --Ema:\nI believe Machi stole the body because of some lyrics.\nHe moved the body to match Lamiroir's song.\nNo one in this country had a motive to kill the victim.\nAnd, Machi practically left his signature at the scene.\nAll of the evidence clearly points to the defendant.Apollo:\nLamiroir's... song?Klavier:\nYes... \"The Guitar's Serenade\". You noticed its \"code\" too, did you not?Apollo:\nIts \"code\"...?Klavier:\nAll the events that day followed the lyrics to our song. First, the keys my \"heart\" held on to so tightly were stolen.Apollo:\nThen Prosecutor Gavin's guitar burst into flames on stage. Mr. LeTouse's life was taken by a bullet...Klavier:\nThe rest hardly needs explanation... \"Guitar, Guitar... Up together to the sky.\"Judge:\nTh-That's mad! It's like a story out of some fairy tale!Apollo:\n(I admit, I'd forgotten about the song... But there it is now, waiting for me... the grand finale, as it were.)Trucy:\nHey! You know I was the one who first noticed that!Judge:\nI've heard of jumping rope to songs, and counting to songs... ...But killing!?Klavier:\nIt's a wild world out there, Herr Judge.Judge:\nVery well! We've heard one song and dance, let's get on to the next: the cross-examination!Apollo:\n(I'm not so sure I'm going to be doing much singing...)Cross ExaminationCross Examination-- The Missing Body --Ema:\nI believe Machi stole the body because of some lyrics.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWho would steal a body just to match some lyrics!?\nEma:\nI didn't believe it myself. But it can't just be a coincidence.\nKlavier:\nIt is as Fräulein Detective says. Let us begin with the first verse. If you would, Fräulein Detective.\nEma:\nWhat? You want me to sing it?\nKlavier:\nYou are the witness, ja? Or did you want me to sing? I warn you, my fee as vocalist is not trivial.\nEma:\nFine, fine! Er, ahem. Let's look at the first part of the lyrics, shall we? \"When you stole away the keys my heart held on to so tight.\"\nKlavier:\nIndeed, my favorite heart-shaped key ring was stolen that morning.\nEma:\nNext, we go to the right page of the lyrics sheet. Where we find... \"Burning on in my heart. Fire. Burn my love away. All away.\" As we know, Prosecutor Gavin's guitar burst into flame. \"Like a bullet of love. Fire. Take my life away. All away.\" Mr. LeTouse's life was taken by a bullet.\nKlavier:\nBravo, Fräulein Detective. Your singing... it's not bad. Now, for the finale! \"Guitar, Guitar... Up together to the sky.\" As it says in the lyrics, Mr. LeTouse... ...was found with a guitar, high in the \"sky\" over the stage. No series of coincidences could be so well conceived!\nEma:\nHe's right. ...Scientifically speaking.\nApollo:\n(What would Wocky have said? ...\"That concert was wack.\")\nTrucy:\nIt's hard to argue when she pours her heart into it like that.\nEma:\nAh, er, ahem! Anyway, the shooter...Ema:\nHe moved the body to match Lamiroir's song.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nDoes the prosecution have any idea why he'd do all this?\nEma:\nYou want my scientific opinion? \"No clue.\" But, he clearly had a reason to go through all that trouble. Some deep reason.\nApollo:\nA deep reason?\nKlavier:\nNot only did he steal my keys, he torched my guitar! ...Unforgivable acts even if he had a reason... and worse if he had none!\nEma:\nThe diva's complaints aside, I can't imagine someone doing this on \"just a whim\".\nKlavier:\nFräulein Detective! I take offense at that description...\nJudge:\nIndeed, it does seem too well rehearsed, shall we say.\nEma:\nYes. This crime was planned for sure.Ema:\nNo one in this country had a motive to kill the victim.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nBut... Mr. LeTouse spoke English! He may have come to this country before!\nEma:\nI looked into that, I assure you.\nApollo:\nOh.\nEma:\n...It was his first time in the country, it seems. Apparently, he learned English on his own.\nApollo:\n(Great...)\nKlavier:\nYou see? No one here had a motive to kill him, and certainly not in such an elaborate fashion.\nJudge:\nHmm... It does seem difficult to imagine.\nEma:\nUnless our famous prosecutor did it as a publicity stunt.\nKlavier:\nWh-What did you say!?\nJudge:\nProsecutor Gavin! You did this to promote your song!?\nKlavier:\n...... Of course not, and I am quite dismayed by the ludicrous nature of her claim. Why would I need promotion? Everyone already listens to my music.\nTrucy:\nThey're even in my textbook at school.\nApollo:\n(And I'd never heard of them. What does that say about me?)\nEma:\nI was just kidding! Don't get all worked up, glimmer-boy.Ema:\nAnd, Machi practically left his signature at the scene.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhat do you mean by his \"signature\"?\nEma:\nThe bullet holes in the wall, of course.\nApollo:\nThe bullet holes...?\nEma:\nThe revolver was fired twice. One shot missed, and left a hole in the wall.\nJudge:\nAnd that means what, exactly?\nEma:\nThat dressing room isn't exactly spacious. Picture the shooter facing off with the victim in there. They can't have been more than five feet apart. It would be difficult, almost impossible to miss at that range.\nJudge:\nDifficult to miss, you say?\nEma:\nVery. Assuming the shooter could properly aim.\nApollo:\nNo! Y-You can't be serious...\nTrucy:\nMachi! He can't see... ...That's why he missed?\nEma:\nIt's the only explanation that makes sense. He used sound and other senses to fire the gun... ...poorly.\nKlavier:\nThat reminds me, the monitor in that room was blaring at the time, ja? Hardly ideal conditions for tracking by sound.\nJudge:\nA blind shooter... No wonder he missed!\nApollo:\n(I knew those bullet holes would come back to haunt me. Think Justice, what do I do now!?)\n\n\n\nRaise an objection\n\n\n\n\n\n\n\nApollo:\nSure, there were bullet holes left in the wall... ...but that doesn't prove the shooter couldn't see!\nKlavier:\nOh? How so?\nApollo:\nWell, there could have been a struggle with the victim.\nJudge:\nHmm, that's certainly possible.\nApollo:\nAnd... it might have been the revolver's fault.\nJudge:\nThe revolver...?\nApollo:\nThe revolver was a very large caliber, correct?\nJudge:\nIf the shooter wasn't used to firing such a large weapon... Why, it could dislocate their shoulder.\nApollo:\n...Exactly. The defendant, Machi Tobaye, is, as you can see, tiny. It's not so hard to picture him firing the gun and missing entirely! The kickback alone would throw off his aim.\nJudge:\n......\nKlavier:\n......\nEma:\n......\nJudge:\nA convincing argument, to be sure.\nApollo:\n(Ha ha! Take that, smug prosecution!)\nTrucy:\nUm, Apollo?\nApollo:\nHuh? What?\nTrucy:\nThat bit about Machi being tiny... ...and the gun throwing off his aim? Um, aren't you kind of, um... ...admitting that he did it?\nApollo:\n......Oh.\nKlavier:\nIt does not matter why he missed. What matters is that the shooter was, without a doubt, the defendant. Even the defense seems to agree on that point.\nApollo:\nYurk! Uhh... (Cripes! I really put my foot in it this time!)\nKlavier:\nBut, let's get the facts of the matter on the record. If you would, Fräulein Detective.\nJudge:\nVery well. The witness will add this to her testimony.\nEma:\nRight.\nChanges statement from \"All of the evidence clearly points to the defendant.\" to \"From the state of the crime scene, I conclude the shooter was blind.\"\n\n\n\n\nSit back and watch\n\n\n\n\n\n\n\nApollo:\n(He couldn't see, so the first shot missed... ...As explanations go, it's airtight.)\nJudge:\nHmm... It appears the shooter did leave his signature. I'm afraid this is looking bad for our young defendant. The witness may continue with her testimony.\nEma:\nYou got it.\nLeads back to cross-examinationPress (after adding statement)\n\n\n\n\n\n\n\nApollo:\nBy \"signature\", you mean the bullet holes in the wall?\nEma:\nThat's right. Allow me to explain it... scientifically. The murder weapon was fired twice. The shot that missed left a hole in the wall. Furthermore, there was no more than five feet between shooter and victim. Hard to miss at that distance.\nTrucy:\nBut, Machi can't see...\nEma:\nHe would have had to use sound and other senses to aim... ...and miss.\nKlavier:\nAnd our music was blaring over the room monitor. Not the best circumstances for aiming by sound.\nEma:\nWhich makes it very likely that the shooter was blind.\nKlavier:\nThus the prosecution's position.\nEma:\nAhh! Nothing like a scientific explanation to get the blood pumping!\nApollo:\n(Why's mine frozen in my veins, then...?)Ema:\nAll of the evidence clearly points to the defendant.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nBut, but you can't say that for sure!\nEma:\nPlease, none of those non-scientific objections. They're bad for my complexion.\nApollo:\nWhat's so scientific about a murder to lyrics!?\nEma:\nLyrics can be explained scientifically! ...Never underestimate the power of science!\nApollo:\n(Put that bottle of finger-printing powder down before you hurt someone, like me!) OK, then explain it! Scientifically!\nEma:\n...... I require more data.\nApollo:\n(Hah! Likely story...)Ema:\nFrom the state of the crime scene, I conclude the shooter was blind.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou can't say he was blind just because of those bullet holes in the wall! I think I've proven that!\nEma:\n...I wouldn't call it \"proof\", per se.\nApollo:\nHuh?\nKlavier:\nYou've merely raised a \"possibility\".\nApollo:\n...!\nKlavier:\nFräulein Detective has made a most logical conjecture based upon the evidence. Of course, there is more evidence than just bullet holes. The defendant was the only one who could have escaped through the air vent.\nApollo:\n\nApollo:\nBut wait! If he was blind... ...how would he know about the air vent in the first place?\nKlavier:\n...Ah, a very good point. Well, Fräulein Detective? If you would care to explain?\nApollo:\n(He certainly seems sure of himself...)\nEma:\nRecall the crime scene, if you would. There was a stepladder below the air vent. As it happens, maintenance was scheduled for that day. Custodial staff went around checking all the air vents.\nApollo:\nI don't believe it.\nEma:\nEveryone backstage was told about the maintenance. ...Including Machi Tobaye. He would have known that there would be a way out at the top of that stepladder.\nApollo:\nBut that's... Why is this the first time I'm hearing about this!?\nKlavier:\nYou could have figured it out for yourself. You only needed to consider what that stepladder was doing there.\nJudge:\n...Looks like the defense's objection has been squished by a stepladder.\nKlavier:\nWell, Herr Forehead? Out of ammunition, perhaps?\nApollo:\n(I've never seen Prosecutor Gavin so... so aggressive! Maybe he's caught the scent of blood...)\nTrucy:\nApollo! Don't you have something? Anything? You know what we need... We need something to prove the killer could see! That'll put him in his place!\nKlavier:\n......\nApollo:\n(Proving the shooter was sighted would do it. That would take down one of their central points... Do I have any evidence that can prove that though...?)\n\n\n\nPresent evidence\n\n\n\n\n\n\n\nApollo:\nFine... I accept the prosecution's challenge.\nKlavier:\nAs I knew you would, Herr Forehead.\nApollo:\n(What exactly am I up against here...? The prosecution is saying the shooter missed because he or she couldn't see... Therefore, Machi, who's blind, did it.)\nJudge:\nThe defense will please present their evidence. ...Evidence that overturns the prosecution's claim that the shooter couldn't see!\n\n\n\nPresent Crime Photo\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"This is that evidence!\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nApollo:\n\nJudge:\n...... I'm not sure that overturns anything, Mr. Justice.\nApollo:\n(Ugh. Wrong evidence, I'm guessing...)\nKlavier:\nApparently both love... and Justice are blind.\nApollo:\n(I have to think! There must be something... anything!)\nLeads back to cross-examination\n\n\n\n\n\nNo need\n\n\n\n\n\n\n\nApollo:\n(I can't think of anything that proves the shooter could see!)\nKlavier:\nYour face does not exactly project... confidence.\nEma:\nMaybe you should just accept it and move on?\nTrucy:\nApollo! Grow a backbone!\nJudge:\nVery well. The witness may continue her testimony.\nApollo:\n(I couldn't even get a word in edgewise...)\nLeads back to cross-examinationPresent Crime Photo\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThe prosecution holds that the \"shooter couldn't see\".\nEma:\nA scientific conclusion based on a thorough examination of the crime scene, yes.\nApollo:\nApparently not thorough enough. I have a certain piece of evidence that completely overturns your claim!\nEma:\nWh-What!?\nKlavier:\n......\nLeads to:\n\"This is that evidence!\"Trucy:\nThis doesn't look so good, does it, Apollo?Apollo:\nNo, it doesn't.Trucy:\n...... What do we do!?Apollo:\n(First, we don't panic. Even though Machi's case is leaking water by the gallon. Gavin's on a roll, and it's up to me to stop him!)",
      "testimonies": [
        {
          "testimony": "I believe Machi stole the body because of some lyrics.",
          "person": "Ema",
          "present": []
        },
        {
          "testimony": "He moved the body to match Lamiroir's song.",
          "person": "Ema",
          "present": []
        },
        {
          "testimony": "No one in this country had a motive to kill the victim.",
          "person": "Ema",
          "present": []
        },
        {
          "testimony": "And, Machi practically left his signature at the scene.",
          "person": "Ema",
          "present": []
        },
        {
          "testimony": "All of the evidence clearly points to the defendant.",
          "person": "Ema",
          "present": []
        },
        {
          "testimony": "From the state of the crime scene, I conclude the shooter was blind.",
          "person": "Ema",
          "present": [
            "Crime Photo"
          ],
          "source": {
            "evidence_span": "There is smeared writing in blood on the floor",
            "testimony_span": "the shooter was blind",
            "explanation": "The smeared blood writing suggests that the shooter tried to erase it, indicating he was sighted.",
            "is_self_contained": "yes",
            "context_span": "",
            "isMultimodal": true
          }
        }
      ],
      "noPresent": false,
      "summarized_context": "The witness Detective Ema is describing the crime scene.",
      "labels": [
        "object property",
        "behavior"
      ],
      "reasoning": [
        "Fact 1: The witness claims the shooter was blind.",
        "Fact 2: The evidence suggests there is smeared writing in blood.",
        "Prop 1: If there is smeared writing in blood, then the shooter tried to erase it.",
        "Prop 2: If a person tries to erase something, then they must be sighted."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "-- The Missing Body --Ema:\nI believe Machi stole the body because of some lyrics.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWho would steal a body just to match some lyrics!?\nEma:\nI didn't believe it myself. But it can't just be a coincidence.\nKlavier:\nIt is as Fräulein Detective says. Let us begin with the first verse. If you would, Fräulein Detective.\nEma:\nWhat? You want me to sing it?\nKlavier:\nYou are the witness, ja? Or did you want me to sing? I warn you, my fee as vocalist is not trivial.\nEma:\nFine, fine! Er, ahem. Let's look at the first part of the lyrics, shall we? \"When you stole away the keys my heart held on to so tight.\"\nKlavier:\nIndeed, my favorite heart-shaped key ring was stolen that morning.\nEma:\nNext, we go to the right page of the lyrics sheet. Where we find... \"Burning on in my heart. Fire. Burn my love away. All away.\" As we know, Prosecutor Gavin's guitar burst into flame. \"Like a bullet of love. Fire. Take my life away. All away.\" Mr. LeTouse's life was taken by a bullet.\nKlavier:\nBravo, Fräulein Detective. Your singing... it's not bad. Now, for the finale! \"Guitar, Guitar... Up together to the sky.\" As it says in the lyrics, Mr. LeTouse... ...was found with a guitar, high in the \"sky\" over the stage. No series of coincidences could be so well conceived!\nEma:\nHe's right. ...Scientifically speaking.\nApollo:\n(What would Wocky have said? ...\"That concert was wack.\")\nTrucy:\nIt's hard to argue when she pours her heart into it like that.\nEma:\nAh, er, ahem! Anyway, the shooter...Ema:\nHe moved the body to match Lamiroir's song.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nDoes the prosecution have any idea why he'd do all this?\nEma:\nYou want my scientific opinion? \"No clue.\" But, he clearly had a reason to go through all that trouble. Some deep reason.\nApollo:\nA deep reason?\nKlavier:\nNot only did he steal my keys, he torched my guitar! ...Unforgivable acts even if he had a reason... and worse if he had none!\nEma:\nThe diva's complaints aside, I can't imagine someone doing this on \"just a whim\".\nKlavier:\nFräulein Detective! I take offense at that description...\nJudge:\nIndeed, it does seem too well rehearsed, shall we say.\nEma:\nYes. This crime was planned for sure.Ema:\nNo one in this country had a motive to kill the victim.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nBut... Mr. LeTouse spoke English! He may have come to this country before!\nEma:\nI looked into that, I assure you.\nApollo:\nOh.\nEma:\n...It was his first time in the country, it seems. Apparently, he learned English on his own.\nApollo:\n(Great...)\nKlavier:\nYou see? No one here had a motive to kill him, and certainly not in such an elaborate fashion.\nJudge:\nHmm... It does seem difficult to imagine.\nEma:\nUnless our famous prosecutor did it as a publicity stunt.\nKlavier:\nWh-What did you say!?\nJudge:\nProsecutor Gavin! You did this to promote your song!?\nKlavier:\n...... Of course not, and I am quite dismayed by the ludicrous nature of her claim. Why would I need promotion? Everyone already listens to my music.\nTrucy:\nThey're even in my textbook at school.\nApollo:\n(And I'd never heard of them. What does that say about me?)\nEma:\nI was just kidding! Don't get all worked up, glimmer-boy.Ema:\nAnd, Machi practically left his signature at the scene.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhat do you mean by his \"signature\"?\nEma:\nThe bullet holes in the wall, of course.\nApollo:\nThe bullet holes...?\nEma:\nThe revolver was fired twice. One shot missed, and left a hole in the wall.\nJudge:\nAnd that means what, exactly?\nEma:\nThat dressing room isn't exactly spacious. Picture the shooter facing off with the victim in there. They can't have been more than five feet apart. It would be difficult, almost impossible to miss at that range.\nJudge:\nDifficult to miss, you say?\nEma:\nVery. Assuming the shooter could properly aim.\nApollo:\nNo! Y-You can't be serious...\nTrucy:\nMachi! He can't see... ...That's why he missed?\nEma:\nIt's the only explanation that makes sense. He used sound and other senses to fire the gun... ...poorly.\nKlavier:\nThat reminds me, the monitor in that room was blaring at the time, ja? Hardly ideal conditions for tracking by sound.\nJudge:\nA blind shooter... No wonder he missed!\nApollo:\n(I knew those bullet holes would come back to haunt me. Think Justice, what do I do now!?)\n\n\n\nRaise an objection\n\n\n\n\n\n\n\nApollo:\nSure, there were bullet holes left in the wall... ...but that doesn't prove the shooter couldn't see!\nKlavier:\nOh? How so?\nApollo:\nWell, there could have been a struggle with the victim.\nJudge:\nHmm, that's certainly possible.\nApollo:\nAnd... it might have been the revolver's fault.\nJudge:\nThe revolver...?\nApollo:\nThe revolver was a very large caliber, correct?\nJudge:\nIf the shooter wasn't used to firing such a large weapon... Why, it could dislocate their shoulder.\nApollo:\n...Exactly. The defendant, Machi Tobaye, is, as you can see, tiny. It's not so hard to picture him firing the gun and missing entirely! The kickback alone would throw off his aim.\nJudge:\n......\nKlavier:\n......\nEma:\n......\nJudge:\nA convincing argument, to be sure.\nApollo:\n(Ha ha! Take that, smug prosecution!)\nTrucy:\nUm, Apollo?\nApollo:\nHuh? What?\nTrucy:\nThat bit about Machi being tiny... ...and the gun throwing off his aim? Um, aren't you kind of, um... ...admitting that he did it?\nApollo:\n......Oh.\nKlavier:\nIt does not matter why he missed. What matters is that the shooter was, without a doubt, the defendant. Even the defense seems to agree on that point.\nApollo:\nYurk! Uhh... (Cripes! I really put my foot in it this time!)\nKlavier:\nBut, let's get the facts of the matter on the record. If you would, Fräulein Detective.\nJudge:\nVery well. The witness will add this to her testimony.\nEma:\nRight.\nChanges statement from \"All of the evidence clearly points to the defendant.\" to \"From the state of the crime scene, I conclude the shooter was blind.\"\n\n\n\n\nSit back and watch\n\n\n\n\n\n\n\nApollo:\n(He couldn't see, so the first shot missed... ...As explanations go, it's airtight.)\nJudge:\nHmm... It appears the shooter did leave his signature. I'm afraid this is looking bad for our young defendant. The witness may continue with her testimony.\nEma:\nYou got it.\nLeads back to cross-examinationPress (after adding statement)\n\n\n\n\n\n\n\nApollo:\nBy \"signature\", you mean the bullet holes in the wall?\nEma:\nThat's right. Allow me to explain it... scientifically. The murder weapon was fired twice. The shot that missed left a hole in the wall. Furthermore, there was no more than five feet between shooter and victim. Hard to miss at that distance.\nTrucy:\nBut, Machi can't see...\nEma:\nHe would have had to use sound and other senses to aim... ...and miss.\nKlavier:\nAnd our music was blaring over the room monitor. Not the best circumstances for aiming by sound.\nEma:\nWhich makes it very likely that the shooter was blind.\nKlavier:\nThus the prosecution's position.\nEma:\nAhh! Nothing like a scientific explanation to get the blood pumping!\nApollo:\n(Why's mine frozen in my veins, then...?)Ema:\nAll of the evidence clearly points to the defendant.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nBut, but you can't say that for sure!\nEma:\nPlease, none of those non-scientific objections. They're bad for my complexion.\nApollo:\nWhat's so scientific about a murder to lyrics!?\nEma:\nLyrics can be explained scientifically! ...Never underestimate the power of science!\nApollo:\n(Put that bottle of finger-printing powder down before you hurt someone, like me!) OK, then explain it! Scientifically!\nEma:\n...... I require more data.\nApollo:\n(Hah! Likely story...)Ema:\nFrom the state of the crime scene, I conclude the shooter was blind.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou can't say he was blind just because of those bullet holes in the wall! I think I've proven that!\nEma:\n...I wouldn't call it \"proof\", per se.\nApollo:\nHuh?\nKlavier:\nYou've merely raised a \"possibility\".\nApollo:\n...!\nKlavier:\nFräulein Detective has made a most logical conjecture based upon the evidence. Of course, there is more evidence than just bullet holes. The defendant was the only one who could have escaped through the air vent.\nApollo:\n\nApollo:\nBut wait! If he was blind... ...how would he know about the air vent in the first place?\nKlavier:\n...Ah, a very good point. Well, Fräulein Detective? If you would care to explain?\nApollo:\n(He certainly seems sure of himself...)\nEma:\nRecall the crime scene, if you would. There was a stepladder below the air vent. As it happens, maintenance was scheduled for that day. Custodial staff went around checking all the air vents.\nApollo:\nI don't believe it.\nEma:\nEveryone backstage was told about the maintenance. ...Including Machi Tobaye. He would have known that there would be a way out at the top of that stepladder.\nApollo:\nBut that's... Why is this the first time I'm hearing about this!?\nKlavier:\nYou could have figured it out for yourself. You only needed to consider what that stepladder was doing there.\nJudge:\n...Looks like the defense's objection has been squished by a stepladder.\nKlavier:\nWell, Herr Forehead? Out of ammunition, perhaps?\nApollo:\n(I've never seen Prosecutor Gavin so... so aggressive! Maybe he's caught the scent of blood...)\nTrucy:\nApollo! Don't you have something? Anything? You know what we need... We need something to prove the killer could see! That'll put him in his place!\nKlavier:\n......\nApollo:\n(Proving the shooter was sighted would do it. That would take down one of their central points... Do I have any evidence that can prove that though...?)\n\n\n\nPresent evidence\n\n\n\n\n\n\n\nApollo:\nFine... I accept the prosecution's challenge.\nKlavier:\nAs I knew you would, Herr Forehead.\nApollo:\n(What exactly am I up against here...? The prosecution is saying the shooter missed because he or she couldn't see... Therefore, Machi, who's blind, did it.)\nJudge:\nThe defense will please present their evidence. ...Evidence that overturns the prosecution's claim that the shooter couldn't see!\n\n\n\nPresent Crime Photo\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"This is that evidence!\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nApollo:\n\nJudge:\n...... I'm not sure that overturns anything, Mr. Justice.\nApollo:\n(Ugh. Wrong evidence, I'm guessing...)\nKlavier:\nApparently both love... and Justice are blind.\nApollo:\n(I have to think! There must be something... anything!)\nLeads back to cross-examination\n\n\n\n\n\nNo need\n\n\n\n\n\n\n\nApollo:\n(I can't think of anything that proves the shooter could see!)\nKlavier:\nYour face does not exactly project... confidence.\nEma:\nMaybe you should just accept it and move on?\nTrucy:\nApollo! Grow a backbone!\nJudge:\nVery well. The witness may continue her testimony.\nApollo:\n(I couldn't even get a word in edgewise...)\nLeads back to cross-examinationPresent Crime Photo\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThe prosecution holds that the \"shooter couldn't see\".\nEma:\nA scientific conclusion based on a thorough examination of the crime scene, yes.\nApollo:\nApparently not thorough enough. I have a certain piece of evidence that completely overturns your claim!\nEma:\nWh-What!?\nKlavier:\n......\nLeads to:\n\"This is that evidence!\"Trucy:\nThis doesn't look so good, does it, Apollo?Apollo:\nNo, it doesn't.Trucy:\n...... What do we do!?Apollo:\n(First, we don't panic. Even though Machi's case is leaking water by the gallon. Gavin's on a roll, and it's up to me to stop him!)Apollo:\nThis is that evidence!Judge:\nThe photograph of the crime scene...?Apollo:\n(I don't care much for the smirk on Prosecutor Gavin's face... But this is no time to think twice... Time to press on!) Yes, Your Honor, the crime scene. There is something in here that decisively contradicts the prosecution's point!Klavier:\nThen perhaps you'd best show us this \"something\". Get your finger out of the breeze and put it to good use, ja?Judge:\nVery well, show us what you're talking about, Mr. Justice! The contradiction at the scene of the crime is...Present smeared blood\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"The contradiction is right here!\"Present anywhere else\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nLook! The contradiction's right there! Plain as day!\nJudge:\n...... Your finger has a force of weight... ...that I'm afraid your argument lacks, Mr. Justice. I see nothing!\nApollo:\n(Ugh... What a time to mess up.)\nKlavier:\nI believe all he has added to our understanding of this photo... is his fingerprint. I would hope you could refrain from soiling the evidence, Herr Forehead.\nJudge:\nPerhaps Mr. Justice would care to try again?\nLeads back to:\n\"The contradiction at the scene of the crime is...\"Apollo:\nThe contradiction is right here!Ema:\nThe smeared blood stains...!Judge:\nHmm... I thought it was just my blurry vision. But it really was blurry! The way the victim's hand is raised above his head... ...Much like a gesture I have seen many times in this court.Ema:\nIt's almost as if he wrote something...?Trucy:\nAh ha! I get it! At least, I think I get it!Klavier:\nGet what, Fräulein?Trucy:\nWhen Mr. LeTouse was shot, he tried to write something! And what would he write but the shooter's name? And what would he write it in but his own blood? Pretty good, huh?Apollo:\n(Thanks for making my point for me...) Yes, in fact, that's what I think happened here.Judge:\nHmm... That does seem to be a distinct possibility.Ema:\nThe victim wrote the killer's name... ...It's certainly a logical conclusion.Trucy:\nDrat! I just wish it wasn't all rubbed out like that.Judge:\nOf course it's rubbed out. Why, if I were a killer... ...I certainly wouldn't want to leave my own name behind!Klavier:\nNeither would I.Ema:\n......Klavier:\n......Judge:\n......Apollo:\nUm... No one has anything else to say?Judge:\n...About what?Apollo:\nSo the prosecution accepts this? You agree this was the victim making an attempt to record the name of the killer? ...And that the killer tried to rub the name out?Ema:\nWhat's your point?Apollo:\nWhat's my point!? Let me ask you this: How did the killer know the victim was writing their name?Ema:\nWell, Mr. LeTouse was writing something in blood. Once the killer saw what it was... ...Wait.Judge:\nOnce he \"saw\" what it was...?Apollo:\nBut what did you just testify about the shooter?Ema:\nI said... they were blind. Ack!!!Apollo:\nYet the crime scene itself contradicts that! The killer had to have been able to see! Why would they rub out the name in blood otherwise?Ema:\nAh... ahh...Apollo:\nMay I remind the court that the defendant, Machi Tobaye, is blind! He couldn't have been the shooter!Ema:\nUrk... Immmmmmmmposssssibbleee!Judge:\nOrder! Order! Order!!! P-Prosecutor Gavin! Please explain to me what all this means!?Klavier:\n......Judge:\nI mean, looking at this photo... It seems quite clear that the shooter could see! Yet, up until now...Klavier:\n...It seems I owe the court an apology.Judge:\nHmm!?Klavier:\nThe Gavinners are a band with law enforcement ties, yet a murder occurred... ...during our concert! Apparently, this caused some confusion over jurisdiction. As a result, some reports were not filed in an entirely timely manner.Apollo:\n(I... I'm not sure I like the vibe I'm getting here.)Trucy:\nHey Apollo, look at him. Why is Prosecutor Gavin all relaxed and smiling like that? Like he knows something we don't... and he's about to tell us.Klavier:\nHeh heh heh. I've got an idea... Let's rock! ...With these documents. But before that. I have a question for the Fräulein Detective. If I may?Ema:\nWh-What?Klavier:\nTell me... Why do you think that Machi Tobaye is blind?Ema:\nHuh...?Apollo:\nWh-What did he say?Ema:\nWhat are you saying? Of course he's blind!Klavier:\nOf course...?Ema:\nH-He's the blind pianist, right? So... So he's... Doesn't Lamiroir lead him around by the hand all the time?Apollo:\n(No way...)Klavier:\nI have a report here on the defendant, Machi Tobaye. According to this, Machi Tobaye... ...can see perfectly well.Ema:\nWhat...?Klavier:\nHis blindness was merely a publicity ploy by those clever Borginians. He can see quite well.Apollo:Apollo:\nB-But you said...Klavier:\n...What did I say, exactly?Apollo:\n!Klavier:\nHerr Forehead, not once in the course of this trial... ...have I claimed the defendant was blind. The only one who did was Fräulein Detective.Apollo:\nBu-But that's...Klavier:\n...A significant fact, yes! Consider: Machi Tobaye sees. And he was the only one who could have fled through the air vent. I see no problems with this.Ema:\nBut what about the bullet holes in the wall?Klavier:\nYes, the bullet holes. I believe Herr Forehead neatly explained those for us. He didn't miss because he couldn't see. It was the kickback from the 45-caliber revolver. A simple accident, in other words.Apollo:\nAck...!Klavier:\nHow's that? I'm afraid your \"objection\" has just flown off for brighter skies...Apollo:\nUrk...Klavier:\nThis is where the real fun begins, Herr Forehead!Apollo:\nYeeeeaaaaaaaarrrrrrrrrggh!Klavier:\nI knew you didn't have what it took.Ema:\nYou... You jerk! Just what was I in here for? Comic relief!?Trucy:\nYeah! Apologize!Klavier:\nAh ha ha. Oh, sorry!Trucy:\nThat's no way to apologize!Apollo:\n(He's angered the Trucy now. Look out...)Judge:\nAhem. If we can please end the bickering. Now.Ema:\nWhatever! I'm not leaving! I can't leave like this. I'll come up with some clue to solving this case if it kills me!Judge:\nBut your testimony has already given us enough to convict the defendant...Apollo:\n(Ugh, don't say that...)Ema:\nAh! Ah ha!Apollo:\n\"Ah ha\" what?Ema:\nThis blood stain... The criminal tried to wipe it off, right?Apollo:\nThat seems to be what happened, yes.Ema:\nWe might be able to find out what was really written here!Apollo:\n...! Really...? You can do that?Ema:\nThat's right, with this! It's called Luminol! Maybe you know of it? It's a chemical that reacts to blood.Klavier:\nAh yes, have we done those tests yet...?Ema:\nHah! As if I'm going to tell you!Klavier:\nThe blood stains covered a section of the carpet. In order to perform blood tests, that section was removed and submitted. Perhaps we should request it here in court now.Ema:\nRight! Go for it, Apollo!Apollo:\nHuh? I have to do the test?Ema:\nYou just have to spray the luminol on it! Simple!Apollo:\n(A chemical that reacts to blood... I've heard of this somewhere.)Judge:\n...Yes, I believe an analysis is called for. Have at it!Ema:\nRight, ready? It's easy as pie! Just press [A / Space] to spray an area. (Changed from [Just touch the screen to spray an area.] in the original release) Here! Give it a try!Apollo:\n(...The eyes of the entire court are focused on me!)Trucy:\nApollo! Your hand's shaking!Apollo:\n(Ugh... Grrrah! Let's do this!)Spray smeared writing\n\n\n\n\n\n\n\nLeads to:\n\"Wow... it really works!\"Apollo:\n(Wow... it really works!)Trucy:\nThis must be... this must be the power of science!Ema:\nIt says... \"IPXX314206\"... ...Is that the killer's name?Judge:\nHmm. Maybe it is... if the killer was a robot!Klavier:\nAh hah! I have it!Apollo:\n...So what is it?Klavier:\nI thought those letters \"IPXX\" looked familiar. This is an Interpol ID number.Ema:\nI-Interpol? You mean the international police agency?Klavier:\nYes. Most are undercover agents working to solve international crimes. But why would he write that number...?Apollo:\nWhy would Mr. LeTouse even know a number like that!?Klavier:\nGood show, Fräulein Detective. Rock on.Ema:\nEh?Klavier:\nYour Honor! We can verify this number immediately. ...Daryan, are you there? Come up to the witness stand!Klavier:\nDaryan... you heard what we need. Go check into this Interpol ID number.Daryan:\nSure thing. Gimme 30 minutes. No... Gimme 27.Judge:\nHmm... I'm not sure what to think of all this. The prosecution's case is airtight, or so it seems. Yet if this number is really that of an Interpol agent...Ema:\nOh, wait, I know... What if Machi Tobaye's really an undercover Interpol agent?Klavier:\nThat would be a possibility.Judge:\nA possibility, yes. And one that would mark him as the killer for certain.Apollo:\n(Why did LeTouse know an Interpol ID number...? That's what I want to know.)Klavier:\nWell, we have some time while we await Daryan's report. Let's work on unraveling another mystery, shall we? A curious mystery concerning Machi Tobaye.Apollo:\n...What are you talking about?Klavier:\nFräulein Detective, please accept my apologies. I received word that the defendant could, in fact, see, just before the trial began. It seemed too much of a bother to tell you.Ema:\n...You had me until that last bit.Klavier:\nDoes this not raise a rather straightforward question?Ema:\nWell, sure... Why did Machi pretend he couldn't see?Klavier:\nExactly... It makes little sense. What do you think, Herr Forehead?Apollo:\nHuh? Me?Klavier:\nMachi Tobaye pretended he was blind... ...Do you know why?Ema:\nHow could he know!?Trucy:\nWait... Prosecutor Gavin knows why, doesn't he...Apollo:\n(He's known from the start of the trial. He's been leading us on the whole time!)Klavier:\nHmm? Something wrong? Do you think, perhaps, this is all some kind of game? Know that the moment I heard that report... ...I knew why.Judge:\nHmm... I suppose people who have sold over a million records really are something else.Apollo:\n(What does that have to do with anything!?)Klavier:\nThere was a reason why Machi Tobaye pretended to be blind. But it wasn't for his own sake. ...Getting the picture now?Apollo:\nIt wasn't for himself...!?Judge:\nWell, Mr. Justice? Can you present evidence that shows us why the defendant had to feign blindness?Show evidence\n\n\n\n\n\n\n\nApollo:\n(Machi had no reason to pretend he couldn't see... Which means... No. It couldn't be!)\nKlavier:\n...Good show, Herr Forehead. It seems you've thought of something.\nApollo:\n(Grr... Why can't I figure these things out on my own? I hate having to take my cues from this guy.) ...Very well. Look at this. This is why he was pretending he couldn't see!\n\n\n\nPresent Postcard\n\n\n\n\n\n\n\nApollo:\n\nJudge:\nThat is... Lamiroir?\nApollo:\nLamiroir and Machi Tobaye. Recall their relationship. In particular, their unique arrangement over the years before visiting our country.\nEma:\nLamiroir and her pianist... They would always walk together, she leading him by the hand. Even when they got on stage, she would lead him to the piano. She would walk all the way over there with him!\nApollo:\nThat's right. Because he was \"blind\". She led him at all times, never letting him go.\nJudge:\nAll times... Hmm.\nApollo:\nYet, we have just learned something that makes their arrangement peculiar indeed. Machi could see! Why did they have to keep up this act the whole time?\nJudge:\nWell, wasn't it part of their, er, performance?\nApollo:\nI think there's a simpler explanation. Machi did not need to be led by the hand at all. That can only mean one thing.\nEma:\nAh! Aaaaaaaaaaa... Really!?\nApollo:\nReally. It was all the other way around. The one who needed to be led by the hand... ...was Lamiroir!\nJudge:\nWh-What's this...? S-So you mean to say that Lamiroir is... she's...\nApollo:\nYes, Your Honor. Lamiroir is blind.\nEma:\nWha... Whaaaaaaaaaaaaaaaaat!?\nJudge:\nOrder! Order! Order!!! This is crazy, Prosecutor Gavin!\nKlavier:\nIs it now?\nJudge:\nPlease... Please shed some sanity on this madness! The defense has made an outrageous claim...\nKlavier:\nThe only thing outrageous I see about the defense is his vast forehead... ...Yet I see it is not vast in vain. This time. He's quite correct.\nJudge:\nB-But that makes no sense!\nLeads to:\n\"Yeah! Wasn't she supposed to be the \"landscape painter in sound\" or something?\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nApollo:\n\nJudge:\nWhat... is that supposed to mean? I don't see how it relates to the defendant's vision or lack thereof.\nApollo:\nWell, see, it... (...is the wrong piece of evidence.)\nJudge:\nI do see how your lack of an answer relates to this penalty, however!\nKlavier:\nAh ha ha ha. Herr Forehead, I'm disappointed in you. Unless you're merely \"feigning\" stupidity? Ja?\nApollo:\n(Keep it up wise guy...)\nKlavier:\nRecall the relationship of Lamiroir and Machi Tobaye. In particular, their arrangement over the years before visiting our country.\nEma:\nLamiroir and her pianist... They would always walk together, she leading him by the hand. Even when they got on stage, she would lead him to the piano. She would walk all the way over there with him!\nKlavier:\nThat's right. Because he was \"blind\". Or so we thought... She led him at all times. All times.\nJudge:\nAll times... Hmm.\nKlavier:\nYet we now know that Machi could see perfectly well. Why keep up the charade?\nJudge:\nWell, wasn't it part of their, er, performance?\nKlavier:\nThere is a simpler explanation, Herr Judge. Machi did not need to be led by the hand at all. Which means...\nApollo:\nAaaaah! You don't mean---!?\nKlavier:\nI do. It was the other way around! The one who needed to be led by the hand... ...was Lamiroir!\nJudge:\nWh-What's this...?\nJudge:\nS-So you mean to say that Lamiroir is... she's...\nKlavier:\nBlind as a bat, Herr Judge.\nEma:\nWha... Whaaaaaaaaaaaaaaaaat!?\nJudge:\nOrder! Order! Order!!! This is crazy, Prosecutor Gavin!\nLeads to:\n\"Yeah! Wasn't she supposed to be the \"landscape painter in sound\" or something?\"I haven't a clue\n\n\n\n\n\n\n\nApollo:\n...... (I have no idea!)\nKlavier:\nAh ha ha ha. Herr Forehead, I'm disappointed in you. Unless you're merely \"feigning\" stupidity? Ja?\nApollo:\n(Keep it up wise guy...)\nKlavier:\nRecall the relationship of Lamiroir and Machi Tobaye. In particular, their arrangement over the years before visiting our country.\nEma:\nLamiroir and her pianist... They would always walk together, she leading him by the hand. Even when they got on stage, she would lead him to the piano. She would walk all the way over there with him!\nKlavier:\nThat's right. Because he was \"blind\". Or so we thought... She led him at all times. All times.\nJudge:\nAll times... Hmm.\nKlavier:\nYet we now know that Machi could see perfectly well. Why keep up the charade?\nJudge:\nWell, wasn't it part of their, er, performance?\nKlavier:\nThere is a simpler explanation, Herr Judge. Machi did not need to be led by the hand at all. Which means...\nApollo:\nAaaaah! You don't mean---!?\nKlavier:\nI do. It was the other way around! The one who needed to be led by the hand... ...was Lamiroir!\nJudge:\nWh-What's this...?\nJudge:\nS-So you mean to say that Lamiroir is... she's...\nKlavier:\nBlind as a bat, Herr Judge.\nEma:\nWha... Whaaaaaaaaaaaaaaaaat!?\nJudge:\nOrder! Order! Order!!! This is crazy, Prosecutor Gavin!\nLeads to:\n\"Yeah! Wasn't she supposed to be the \"landscape painter in sound\" or something?\"Ema:\nYeah! Wasn't she supposed to be the \"landscape painter in sound\" or something?Klavier:\nWell, since we have her here...Ema:\n!Klavier:\n...Why not ask Lamiroir herself? I believe she is still in the witness waiting room.Trucy:\nA-Apollo, what does this mean for our case!?Apollo:\nDon't ask me! I had no idea she couldn't see... I hadn't even imagined it until now!Judge:\nBailiff! Bring in Lamiroir!Klavier:\n...Lamiroir. It pains me deeply to call you before us again in this way. And yet I must.Lamiroir:\nPlease, do not be concerned on my behalf.Apollo:\n(Those eyes... She really can't see? Really?)Lamiroir:\n...... It is true.Apollo:\n...!Lamiroir:\nHow funny it is that a tiny lie born in the Borginian countryside... ...would one day grow to entangle the entire world.Judge:\nSo... So you are...!?Lamiroir:\nYes. As I mentioned before... ...I have no memory of the time before I became Lamiroir. Know too that my memories begin in darkness. The word \"light\" has no meaning for Lamiroir.Judge:\nI see...Klavier:\nYou may recall me saying something toward the beginning of this trial, Herr Forehead.Apollo:\n...? What's that?Klavier:\nI believe I said it was unfortunate this crime had no \"direct\" witnesses.Apollo:\nAh...Klavier:\nNow, Lamiroir, I must ask you to stand once more. Will you testify to the court about your eyes?Lamiroir:\nOf course. It was never my intent to deceive any of you. May I begin, Your Honor?Judge:\nUh, yes, yes of course... Though I admit, I'm a little lost here.Apollo:\nI think we're all a bit lost here, Your Honor.Witness Testimony-- Lamiroir's Eyes --Lamiroir:\nI have no memory of the \"light\".\nI debuted in a world of darkness and sound...\nMy producer came up with my PR line before he knew this.\nSo, silly as it may sound, I had to pretend I could see.\nEveryone on my staff knew, of course, but no others.Judge:\nBut... this is a murder trial!Lamiroir:\nI apologize. It was part of my contract, you see. I was to keep my blindness a secret, no matter what. Music is everything for me. I never imagined something like this would...Klavier:\nShe told us the truth in the beginning. When she said she \"saw nothing\".Judge:\nVery well. Does the defense have anything to add?Apollo:\n...... I'd like to cross-examine.Trucy:\nBut, what is there left to ask!?Apollo:\nThere was one thing in her testimony that bothered me.Klavier:\nPerhaps it is best we let you get it out of your system. Someday you'll come to understand... ...the importance of thinking for yourself.Judge:\nVery well. The defense may proceed. However... Be aware this court will not tolerate any questions deemed too stressful to the witness.Apollo:\n...OK. (There was only one part that bothered me... Just let me ask about that and I'll be happy.)Cross ExaminationCross Examination-- Lamiroir's Eyes --Lamiroir:\nI have no memory of the \"light\".Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo, you don't know why you went blind?\nLamiroir:\n...I do not. I may have been born this way, in fact.\nKlavier:\n...It's fruitless to attempt to pry into her past. And, I might add, it's a delicate subject.\nJudge:\nI'm not sure we can reasonably expect Mr. Justice to do anything delicately.\nApollo:\n(Hey! Why I oughta... take a deep breath and calm down.)\nLamiroir:\nWhat I am now is all that I have. It is enough, I think.Lamiroir:\nI debuted in a world of darkness and sound...Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWeren't you nervous to hit the stage in your condition?\nLamiroir:\nNo, not at all, surprisingly. It felt natural, singing in front of everyone.\nJudge:\nIt's not something just anyone can do.\nKlavier:\nShe has talent, that much is quite clear. You might even say she is beloved by the gods of music.\nLamiroir:\nEven without light, I live perfectly happy in my world of sound. If that is a talent, as you say, then I thank the gods responsible.\nApollo:\nWhat about your PR motto?Lamiroir:\nMy producer came up with my PR line before he knew this.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nPerhaps your music reminded him of the Borginian scenery?\nLamiroir:\nAh ha ha. No, it was quite the opposite.\nApollo:\nThe opposite?\nLamiroir:\nAccording to my producer... ...my music has a certain \"global\" quality.\nJudge:\nGlobal?\nLamiroir:\nMulticultural, if you will. Hard to pin to one region. When people listen to it, they picture the country closest to their hearts. Which is why my music has reached so many.\nTrucy:\nWhat a lovely story!\nKlavier:\nIt sounds like this producer might have known what he was doing after all.\nLamiroir:\nMy songs are nothing more than a white canvas. To me, the real landscape painter [sic] are the listeners. When I think of that, I do not mind how I am represented to the world so much. Yet, one thing quickly led to another...Lamiroir:\nSo, silly as it may sound, I had to pretend I could see.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWas that to protect your image as the \"landscape painter in sound\"?\nLamiroir:\nThat does not matter so much to me, really. But the label is quite concerned about it, I think.\nTrucy:\nA landscape painter who can't see... that's like a pianist who can't play, huh.\nApollo:\nI'm not sure you can compare your father to Lamiroir.\nLamiroir:\nThe world of commercial music is filled with these little white lies. Nothing is sacred when it comes to publicity...Lamiroir:\nEveryone on my staff knew, of course, but no others.Press\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"When you say your staff, do you include Mr. LeTouse?\"Apollo:\n(I suppose that's her confession, of sorts. There's just one part that bothers me... ...And I'm going to get to the bottom of it.)",
      "testimonies": [
        {
          "testimony": "I have no memory of the \"light\".",
          "person": "Lamiroir",
          "present": []
        },
        {
          "testimony": "I debuted in a world of darkness and sound...",
          "person": "Lamiroir",
          "present": []
        },
        {
          "testimony": "My producer came up with my PR line before he knew this.",
          "person": "Lamiroir",
          "present": []
        },
        {
          "testimony": "So, silly as it may sound, I had to pretend I could see.",
          "person": "Lamiroir",
          "present": []
        },
        {
          "testimony": "Everyone on my staff knew, of course, but no others.",
          "person": "Lamiroir",
          "present": []
        }
      ],
      "noPresent": true
    }
  ]
}