{
  "previousContext": "The Monstrous Turnabout\nImage Gallery\nTranscript\nPart 1\nPart 2\nPart 3\nPart 4\nEpisode 2The Monstrous Turnabout\nAnime cutscene\nLong, long, ago, the Nine-Tailed Fox defeated the evil Tenma Taro, and sealed the fallen demon away. To this day, it is said that he slumbers even still within the Forbidden Chamber.\nMan:\nNight, night, alderman... Sweet dreams! At long last... The revival of Tenma Taro is at hand.\nA few months prior to the courthouse bombing...\nApril 17, 12:13 PMWright Anything Agency\nApollo:\nHm. Guess I'm a little early.\nTrucy:\nOh, hey, Apollo! Getting an early start today?\nApollo:\nYeah! This is the first job I've had in a while after all!\nTrucy:\nWell, aren't we all fired up!\nApollo:\nWell, it's not every day I get a call from Mr. Wright. What kind of work is it anyway? Mr. Wright didn't mention any details.\nTrucy:\nWork? Is that how he put it?\nApollo:\n(Don't tell me he just wants me to clean the toilet again.)\nTrucy:\nYou've really become a fixture around here, Apollo.\nApollo:\n(Come to think of it, it's been almost a year since I was hired. A lot's happened since then... ...But I've settled in nicely despite a few bumps in the road.)\nApollo:\nMy name is Apollo Justice. I've been practicing law for about a year, but I still have a lot to learn. This is the Wright Anything Agency, and it's where I work. Don't let the name fool you -- it's definitely a law agency.\nTrucy:\nBut don't forget that this place is a \"talent agency\" too, Polly!\nApollo:\nUhh, it's the \"law agency\" part of this office that's usually forgotten... This is Trucy Wright, a budding magician... ...and adopted daughter of the agency's owner, Phoenix Wright. She sometimes makes me help with her magic tricks.\nTrucy:\nAnd what's wrong with that? You're one of the agency's \"talents\" as well!\nApollo:\nI was under the impression that I was a lawyer...\nTrucy:\nOh, we'd better hurry. Doesn't look Daddy's going to make it, so let's get going.\nApollo:\nHuh? Where are we going? What about the job he mentioned?\nTrucy:\nThis IS the job, Polly! You're supposed to keep me company today! Now, come on!\nApollo:\nAnother day of not being a lawyer. Should've seen this coming.\nTrucy:\nWell, this is the \"Wright ANYTHING Agency,\" y'know. And there's no law-related work at the moment, so...\nApollo:\n(Tell me again why I chose to \"work\" here?) Where is Mr. Wright, anyway?\nTrucy:\nDaddy said something about going to meet an acquaintance. But don't worry. Just focus on your job, and I'll tell you exactly what you need to know. Well, let's go. We don't have all day!\nApollo:\nWait a second! (*sigh* And another day of \"anything goes\" begins at the Wright Anything Agency...)\nApril 17, 1:30 PMNine-Tails Vale - Yokai Lane\nApollo:\nWhew... So, what are we doing way up here in the mountains?\nTrucy:\nThis is Nine-Tails Vale. Everyone's been talking about the yokai craze here.\nApollo:\nYokai? Oh, you mean Japanese monsters? Guess that explains all these weird things... Speaking of which, wasn't Nine-Tails Vale founded by Japanese immigrants?\nTrucy:\nYeah. They're holding a festival to boost tourism over at the alderman's manor. My friend who works there invited us. That's why we're here!\nApollo:\nIn other words, I'm your chaperon because your dad was too busy.\nTrucy:\nDaddy said that with those horns of yours, you'd make a great addition to their festival. I mean, you look just like a Japanese demon! Wasn't that so thoughtful of him, Polly?!\nApollo:\nI could do without thoughtfulness like that.\nTrucy:\nOh, it's almost time! Come on, Polly! The festival grounds are this way.\nApollo:\n(Alright, I guess it's time to move to the \"Kyubi Manor's Garden\"...)\nTalk\nThe monster craze\nApollo:\nThis monster craze... Come to think of it, I think I heard about it on TV. It's supposedly how Nine-Tails Vale made a comeback from the brink of fiscal disaster.\nTrucy:\nHmm... Our agency could sure use something positive like that. Oh, I know! Let's jump on board the monster craze! You and daddy would be a perfect comedy duo! You could call yourselves Agni & Rudra, Demon Kings of Comedy! Daddy sets them up, and you knock 'em down! Hey, I think we hit the jackpot with this idea!\nApollo:\nUm... Sorry, but I plan on staying a lawyer.\nTrucy:\nYou do?!\nApollo:\n(You don't have to act so surprised by that.)\nWhat to do\nApollo:\nHey, Trucy? Have you seen my attorney's badge?\nTrucy:\nHow could you lose something so important? Sometimes I really wonder about you, Apollo.\nApollo:\nThis is so weird. I wonder if I dropped it somewhere.\nTrucy:\nOh, look! What are these panties doing here?\nApollo:\nForget about panties. I'm looking for my badge.\nTrucy:\n3, 2, 1... Ta-dah! Did you forget? These are my magic panties!\nApollo:\n......Hey! That's my attorney's badge! Wow! How'd you do that?\nTrucy:\nI set it all up while we were back at the office.\nApollo:\nWow, I didn't even-- Wait, you took my badge?!\nPresent\nAttorney's Badge\nApollo:\nCheck it out.\nTrucy:\nYou're so lucky, Apollo. Everyone can see what you do with just a flash of your badge.\nApollo:\nWhat about you, Trucy? People can tell you're a magician by the way you're dressed.\nTrucy:\nYeah, but I can't always dress like this. Like when I'm at school and stuff.\nApollo:\nYou could always show you're a magician by making things appear or disappear.\nTrucy:\nYou mean like this? 3, 2, 1... Ta-dah!\nApollo:\nUmm, magic or no, aren't you a little old to be showing those things in public?\nTrucy:\nHmm... Then maybe I'll become a lawyer, too.\nApollo:\nYou're abandoning your dream just like that?!\nApril 17, 2:05 PMKyubi Manor - Garden\nApollo:\nWow, this place is really something.\nTrucy:\nIt definitely feels like a different world here.\n???:\nTrucy.\nTrucy:\nJinxie!\nApollo:\nAnd this is?\nTrucy:\nMy friend, Jinxie Tenma. She's the one who invited us. She just happens to be the maid here.\nJinxie:\n...Two horns. A love of red. Are you a demon?\nApollo:\nNo, ha ha. I'm Apollo Justice! Nice to meet you!\nJinxie:\nEeeeeek! He IS a demon!\nApollo:\nWhat the--!\nJinxie:\nBe gone, foul beast!\nTrucy:\nHee hee! You look great, Polly. Fills in some of that space on your forehead!\nApollo:\nArgh... What is this thing?\nTrucy:\nIt's a warding charm. Jinxie puts them on all the monsters she finds.\nApollo:\nUm, but I'm not a monster.\nTrucy:\nMaybe I should have told her you're a good demon.\nApollo:\nOr you could just say I'm human.\nJinxie:\n*shiver* The red demon, emissary of the Underworld.\nApollo:\n(I got up early to do my hair for this?) Um, can I take this off now?\nJinxie:\nSo you can eat me?\nApollo:\nI'm not going to eat you!\nJinxie:\nEek! Forgive me, O terrible one!\nTrucy:\nTone down your Chords of Steel, Apollo. You're scaring her out of her wits!\nApollo:\nUm, don't worry. I'm already full.\nJinxie:\nPlease stay that way.\nApollo:\n(Great, now I'm playing along, too.)\nTalk\nNine-Tails Vale\nApollo:\nUm, so I wanted to ask you about Nine-Tails Vale...\nJinxie:\nEeeeeek!\nApollo:\nAaaaugh!\nJinxie:\nBe gone, foul demon!\nTrucy:\nLooks like you've been demonized, Polly, literally!\nApollo:\nI'm starting to wonder if I really am a demon myself. Um...\nJinxie:\nEek! Please don't eat me. I have food if you're hungry.\nApollo:\nThis isn't working. We won't get anything out of her until we set the record straight.\nTrucy:\nHmmm... If only we had some way to prove you're not as scary as you look.\nApollo:\n(Ouch, unnecessary roughness... Looks like I have to present some proof. Proof that I'm one hundred percent human! (Changed from [Proof that I'm 100% human!] in the original release))\nPresent\nAttorney's Badge\nApollo:\nWould you mind taking a look at this?\nJinxie:\nEeeeek! No, thank you! Be gone, foul demon!\nApollo:\nAck, banished again.\nTrucy:\nThat's what you get when you flash a girl like that -- even if it was just your badge.\nApollo:\nSheesh, you make it sound like I'm some kind of creep.\nAttorney's Badge (after clearing \"Nine-Tails Vale\" Talk option)\nLeads to:\n\"Um, I wanted to show you this.\"\nApollo:\nUm, I wanted to show you this.\nJinxie:\nEek! What is it?!\nApollo:\nIt's my attorney's badge. You see? I'm not a demon, I'm a lawyer.\nJinxie:\nReally?! ...You're a lawyer?\nApollo:\n(Whew... Maybe now she'll stop calling me a demon.)\nJinxie:\nDoes it protect you from Enma Dai-O's judgment?\nApollo:\nWho's Enma Dai-O?\nTrucy:\nI read somewhere that he's the demon lord who punishes the dead for their sins. (Changed from [I read somewhere that's [sic] he's the demon lord who punishes the dead for their sins.] in the original release) Uh-oh! I think now she thinks you're a demon lawyer from hell, Polly!\nApollo:\nCan I go back to being just a normal demon?!\nJinxie:\nPlease... Please don't boil me in a scalding cauldron. I'd prefer a Turkish bath if possible.\nApollo:\n(A Turkish bath? Isn't that more sauna than bath?)\nTrucy:\nDon't worry, Jinxie, he's a good demon. He'll save you if you ever go astray!\nJinxie:\nEek! Please, Mr. Demon Lawyer, sir, have mercy on my soul!\nApollo:\nArgh! I told you, I'm not a demon! And Trucy, you're just making things wors--! (Ack!) Umm... You just leave that Enma Dai-O to me.\nTrucy:\nIsn't that great, Jinxie?!\nJinxie:\nUh-huh. I'm no longer scared to cross into the afterlife.\nApollo:\n(Will someone tell these two I'm human, already!)\nTalk\nNine-Tails Vale\nTrucy:\nSo, Jinxie, I hear this village is the epicenter of the monster craze.\nJinxie:\nUh-huh. Barely anyone had even heard of it before, but now it's packed with tourists.\nApollo:\nReally? So, the monster craze is the reason behind today's festival?\nJinxie:\nIt was the alderman's idea. But I'd be careful if I were you. There are lots and lots of yokai prowling about Nine-Tails Vale.\nApollo:\nProwling about? You mean like wild animals or something?\nJinxie:\nUh-huh. And they're hungry, too.\nApollo:\nMan-eating monsters?! And they're all over the place?\nJinxie:\nUh-huh. In fact, there was one at the manor yesterday. I heard the doorbell ring, but when I opened the door, nobody was there. It was the Ding-Dong Demon! How else could you explain it?\nApollo:\nWell... When I was a kid, my friends used to play this prank called Ding-Dong Ditch.\nJinxie:\nWell, that doesn't prove yokai aren't real. There's even one here at the manor. The demon Tenma Taro -- he's imprisoned in the Forbidden Chamber.\nApollo:\nTenma... Taro? The Forbidden Chamber?\nTenma Taro (appears after \"Nine-Tails Vale\")\nLeads to:\n\"Um, about that yokai you said was imprisoned here at the manor. Is it true?\"\nPresent\nAttorney's Badge\nJinxie:\nSo you really are a demon lawyer. Ummm... So, then, you must know Enma Dai-O, the Appraiser of Souls. What's he like?\nApollo:\nWhat's he like?! Well, uh... he's um... He's bald, has a white beard, and...\nJinxie:\nA-A-And what?\nApollo:\nHe shouts, \"Guilty!\" and \"Order!\", while banging his gavel. I call him \"The Judge.\"\nJinxie:\nOh, wow, he's as scary as I thought.\nApollo:\nNah, he's just an old man who's wiser than you might think.\nApollo:\nUm, about that yokai you said was imprisoned here at the manor. Is it true?\nJinxie:\nUh-huh. He's a super evil demon named Tenma Taro. Here, take a look at this scroll. Tenma Taro's the dark demon you see here. He's super evil and super scary.\nApollo:\nSo that's the yokai imprisoned in the Forbidden Chamber?\nJinxie:\nUh-huh. He was defeated by the village guardian yokai, the Nine-Tailed Fox... ...and locked away forever.\nApollo:\nSo... you're saying Tenma Taro is still trapped inside the Forbidden Chamber?\nJinxie:\nUh-huh. But he's just biding his time until he can escape. Still, we should be perfectly safe! Because there's a reeeally powerful sealing charm on the door keeping it shut tight!\nApollo:\n(What a... charming security system.)\nJinxie:\nYou can keep the scroll if you want. The alderman gave me this, but just holding it gives me the chills, so...\nApollo:\nAh, uh, thanks, Jinxie. (Maybe I'll give this to Mr. Wright.)\nYokai Legend Scroll added to the Court Record.\nApollo:\nSo... I was wondering... Are those things on your forehead also warding charms, Jinxie?\nJinxie:\nYes, they're to prevent evil things from getting inside me. Papa told me to wear them.\nApollo:\nEvil things?\nTrucy:\nApollo, don't you dare take those charms off her forehead! They HAVE to stay there... forever! Got it?!\nApollo:\n(I wonder what would happen if I did take them off...?)\nJinxie:\nIt's time for me to get back to work.\nTrucy:\nThanks for inviting us, Jinxie!\nJinxie:\nYou're welcome. Oh, and before I forget... There's going to be a surprise event today. Even I don't know what's to expect, but it's sure to be fun.\nApollo:\n(Better not be a yokai parade. She'd probably drop dead from fright.)\nJinxie:\n.........Hm? .........Eeeeek!\nApollo:\nAhhh! D-D-Demon! (Oh, wait... It's just someone in a suit... right?)\nJinxie:\nT-T-Tenma T-Taro!\nApollo:\nTenma Taro? (The demon from the Forbidden Chamber?)\nJinxie:\nEeeeeek! Please don't hurt me! Be gone! Be gone! Be gone!\nTenma Taro:\nHissssssss! Better watch out little girl, or I'll snatch you away!\nJinxie:\nEek! Charm charm charm...! Where's that \"Die and Go To Heaven\" charm?!\nTrucy:\nOh, she put it on her own forehead this time!\nApollo:\n...She sure gives up quick. (Huh? Why's everyone hiding their faces?)\nVillager:\nHey, you there! You mustn't stare at Tenma Taro like that! Lower your eyes! He'll steal your soul if you're not careful!\nApollo:\nHuh? (Steal my soul? Seriously?)\n???:\nYour devilry stops here and now, Tenma Taro!\nApollo:\nNow what?!\nTrucy:\nLook, Apollo! There's somebody up on the roof!\n???:\nAh-ha ha ha ha ha!\nVillager:\nThat booming laugh! Could it be...!\n???:\nMy nine golden tails are proof of my unassailable righteousness! With my band of one hundred minions, I vanquish evil from the land! (Changed from [With my band of 100 minions, I vanquish evil from the land!] in the original release) I am the wrestler of righteousness! Ya-ha!\nWrestler:\nThe golden lord of yokai, The Amazing Nine-Tails, is here! Fear not, good little boys and girls! For I shall defeat Tenma Taro! Ah-ha ha ha ha ha! Ah-ha ha ha ha ha ha ha ha!\nVillager:\nHurray! Hurray! It's The Amazing Nine-Tails!\nWrestler:\nUp to your no good tricks again, eh, Tenma Taro?! Well, not on my watch!\nTenma Taro:\nAaaaaaaaaaaah!\nWrestler:\nA-ha ha ha ha ha ha! There's nothing to fear now, my child! I have banished Tenma Taro! You and your people can now live in peace!\nJinxie:\nTh-Thank you, Mr. Amazing Nine-Tails, sir!\nWrestler:\nNow, I must be off! Another match and another foe to vanquish, await!\nApollo:\nW-What was that all about? Did that wrestler just chase off a yokai? Looked like he came out of the alderman's manor.\nJinxie:\nThat was The Amazing Nine-Tails! He's a pro wrestler from right here in Nine-Tails Vale. But no one knows his true identity!\nApollo:\n(Jinxie sure seems chipper all of a sudden.) What was all that about him banishing Tenma Taro?\nJinxie:\nThat was a yokai exorcism. It's an annual ritual where Tenma Taro is released, to remind us of his wickedness. In the end, the Nine-Tailed Fox drives Tenma Taro out, and purifies our village. But The Amazing Nine-Tails did the honors this year!\nApollo:\n(So that was the big surprise, huh? The Amazing Nine-Tails and Tenma Taro, huh... Well, whatever floats her boat.)\nJinxie:\nOh, would you look at the time. I'd better get back to work. Please excuse me.\nApollo:\nShe's a strange one, all right.\nTrucy:\nI think she's sweet in her own special way. (Changed from [I think she's sweet in own her [sic] special way.] in the original release)\nApollo:\n(Knowing Trucy, she probably has lots of friends who are \"sweet\" in their own way.)\nTrucy:\nWell, we still have some time to kill. Might as well see the rest of Nine-Tails Vale while we're here.\nApollo:\nThe fun never stops, does it?\n.............................. ..............................\nApril 17, 3:40 PMKyubi Manor - Garden\nTrucy:\nI think I bought nearly every yokai souvenir that was for sale.\nApollo:\nI know, because my wallet's running on empty.\nTrucy:\nHm? What's with all the commotion over there?\nApollo:\nHuh? Hey, isn't that your friend Jinxie?! I hope everything's okay.\nJinxie:\nI-I-It's t-t-terrible! Th-Th-Thththth...! The--! The--!\nTrucy:\nCalm down, Jinxie! Tell us what happened.\nJinxie:\nTh-Th-The demon T-Tenma T-Taro... ...He killed Alderman Kyubi!\nApollo:\nWhaaaaaat?!\nTrucy:\nWait, killed as in dead?\nJinxie:\nYes. And Tenma Taro did it!\nApollo:\nTenma Taro?! You stay here while I go have a look.\nJinxie:\nP-Please, wait!\nApollo:\nHuh...? Ack!\nJinxie:\nIt's a... Tenma Taro Warding Charm. It should protect you, but please... be careful. The alderman's in the Fox Chamber at the top of the main staircase.\nApollo:\nOkay, got it!\nTenma Taro Warding Charm slipped into pocket.\nApril 17Kyubi Manor - Fox Chamber\nAnime cutscene\nApollo:\nA-Are you all right?!\nMan:\nWh-Who are you...?\nApollo:\nH-Help! Someone call an ambulance!\nApollo:\nThe police arrived soon after that, at which point I returned to the festival grounds. Apparently, the man impaled by the spear was already dead. But there was one other person there, and he was immediately rushed to the hospital.\nApril 17Kyubi Manor - Garden\nApollo:\nThank goodness the other man's going to be fine. Sounds like he'd only been unconscious.\nTrucy:\nYou think Jinxie's going to be okay?\nApollo:\nI'm sure she'll be back to her old self in no time. At least she's calm enough for the police to question her for now. (And I'd sure love to know what crazy animal left those feathers and tracks...)\nTrucy:\nOh, look, here comes Jinxie.\nJinxie:\n...Hi, Trucy. ...Hi, Mr. Demon Lawyer.\nApollo:\nHeya... Feeling any better? ...I was wondering if you're up to filling us in on what happened...\nTalk\nAbout what happened\nApollo:\nSo, the man with the spear in his chest was already dead?\nJinxie:\nUh-huh. It was Alderman Kyubi. When I found him, he was already...\nApollo:\n(So the victim was the village alderman...) And the one who was found alive? Who was he?\nJinxie:\nDamian Tenma. He's the mayor of the neighboring city, Tenma Town. They arrested him. *sob*\nApollo:\nSo... he's the killer? Ack!\nJinxie:\nNuh-uh! Papa didn't kill anyone!\nApollo:\nPapa? As in... your father?\nTrucy:\nThat's right. Jinxie's dad is mayor of Tenma Town.\nApollo:\nNo way!\nJinxie:\nErrr... Yes, way, but he's innocent.\nApollo:\n(This just got way more complicated. The victim was the alderman of Nine-Tails Vale. And Jinxie's father, the mayor of Tenma Town, was arrested for the crime. Sounds like we have some investigating to do.)\nTrucy:\nI know this is difficult, Jinxie, but you need to hang in there!\nJinxie:\nI know. I'll try my best.\nApollo:\nWould you mind telling me a little more about the victim?\nThe alderman (appears after \"About what happened\")\nLeads to:\n\"So the victim was the village alderman? What can you tell me about him?\"\nPresent\nYokai Legend Scroll\nJinxie:\nThey sell those at the village souvenir shop.\nApollo:\nThey really went all out, making it look like a real scroll and all.\nJinxie:\nBy rolling it up like that, you can't see Tenma Taro's picture. It's so you don't lose your soul if you accidentally gazed upon him. Even if it is a souvenir, no one in this village wants to accidentally see what's inside!\nApollo:\nI've heard of losing or selling your soul for many things, but for the price of a souvenir?\nJinxie:\nI wonder how many innocent shop girls have fallen victim. *shivers*\nApollo:\nWouldn't it be better not to sell them at all?\nTenma Taro Warding Charm\nJinxie:\nThat warding charm is my supernatural security system. It protects me from yokai -- ghosts, demons, and other things that go bump in the night! Just the other day, I was chased down by a demented camera demon. But I drove him back with my trusty warding charm!\nApollo:\n(Camera demon? Sounds more like an overexcited tourist.)\nJinxie:\nStill, I suppose it's not nice to repel every yokai I meet. I mean, there are some that aren't all bad. I learned that today.\nApollo:\n(Um... Why is she staring at me like that?)\nApollo:\nSo the victim was the village alderman? What can you tell me about him?\nJinxie:\nHis name was Rex Kyubi. They say his family has ties to the legendary Nine-Tailed Fox. He was really kind, and he always looked out for me. He was a former pro wrestler, and I even heard he knew The Amazing Nine-Tails.\nApollo:\n(A former pro wrestler, huh... Hmm... That's something to keep in mind.) With your father being mayor and all, I guess you're originally from Tenma Town, huh? So then, why did you come work here?\nTrucy:\nIt was to overcome your fears, right, Jinxie?\nJinxie:\nUh-huh. Plus, Mama was from Nine-Tails Vale, though she's no longer with us. She loved these flowers. I always wanted to live where Nine-Tails flowers grew.\nTrucy:\nWow, what a beautiful flower. And with exactly nine petals, too!\nJinxie:\nJust looking at them gives me courage, even when I'm scared of yokai.\nNine-Tails Flower added to the Court Record.\nApollo:\nJinxie, when you first told us what happened, you said the killer was a demon.\nJinxie:\nUh-huh. The warding charm on the Forbidden Chamber's door... It's been... removed.\nApollo:\n(The Forbidden Chamber's door? That big door that was barred shut? There wasn't a charm on it when I checked it out, so I guess it was removed by someone...)\nJinxie:\nThat's how Tenma Taro escaped! Ooh... Ooooooh! But when... when I try and remember what happened, it all goes... fuzzy.\nTrucy:\nJinxie, you should do get some rest. You've been through a lot today.\nApollo:\n(Between the warding charm being removed, and the black feathers and weird tracks... ...I could see how a superstitious person might think a demon was the killer.)\nTrucy:\nApollo! Maybe this is your chance.\nApollo:\nChance for what?\nTrucy:\nTo do the right thing and defend Jinxie's dad in court!\nApollo:\nWho, me? Wouldn't a man like Mayor Tenma have access to more experienced lawyers?\nJinxie:\nUmm... You wanna know what the detectives said? They doubted there was a lawyer who could get a not-guilty verdict in this one.\nApollo:\n(Sounds like they're expecting an open and shut case.)\nTrucy:\nDon't worry, Jinxie! If anyone can prove your dad's innocence, it's Polly!\nApollo:\nWha--?!\nTrucy:\nYou'll accept the case, won't you, Polly!\nJinxie:\nOoh... It's all over, isn't it? I'll... I'll be all alone... for the rest of my life.\nApollo:\n(Oh, right... Jinxie already lost her mother.) ...All right. Jinxie, leave your father's defense to me!\nTrucy:\nAtta boy, Polly!\nJinxie:\nYou're going to help Papa, Mr. Demon Lawyer?\nApollo:\nYep, because that's what lawyers do. (Plus, no toilet cleaning for a while!) I'll do whatever it takes to make sure your father walks away a free man!\nJinxie:\nTh-Thank you, Mr. Demon Lawyer! I can tell you're one of the good ones. Red Demons are usually so mean.\nApollo:\n(It's been awhile, but I'll be fine! Ready or not, here comes Justice! Guess I oughta go and meet my new client.) Ah, but before I forget... (Better jot this down in my notebook.)\nTrucy:\nHey, Apollo, what's the notebook for?\nApollo:\nOh, I just thought I should jot down some stuff about the case. And so I don't misplace them, I'm putting my Notes in the Court Record. I guess it's what you would call a \"To-Do\" list.\nTrucy:\nOh? Sounds handy.\nApollo:\n(To read my notes, I just open the Court Record with [R / RB / E]. Then I can switch between the tabs using [L / LB / Q] and [R / RB / E].)\nTrucy:\nOh, I almost forgot! So, about Jinxie's father... No matter how scary he seems, promise me you'll resist the urge to run away!\nApollo:\nWait, what?\nJinxie:\nHis angry glare can paralyze you with fear.\nTrucy:\nAnd some claim he can even shoot laser beams from his eyes.\nJinxie:\nWell, maybe Papa isn't really THAT scary...\nApollo:\n(A paralyzing stare... Laser beams from his eyes... He sounds like some kind of monster.)\nTrucy:\nHm, I think it's about time I see Jinxie off. I'll head back to the office after I'm done.\nApollo:\nOkay, thanks.\nApril 17Detention Center - Visitor's Room\nApollo:\nAh, visiting hours. Perfect timing. (Hope he's not as scary as he sounds...)\n???:\n...Who are you?\nApollo:\n(Yikes!) S-So you're Damian Tenma, r-right?! I'm, uhh... I'm Apollo Justice, attorney-at-law! I'm here to, uhh... I'm here to help! Huh? Aaaaaaaaaaah! (Lemme outta here!) S-Sorry, sorry! I get a little loud sometimes!\nTenma:\nHow... incredibly... RUDE!\nApollo:\nUmm, sorry. Did I do something to offend you?\nTenma:\nA visitor when all others shun me like a common criminal! And here I am with nothing to offer! I am the epitome of rude!\nApollo:\n(.........Wait, so he wasn't mad at me?)\nTenma:\nUnworthy as I am, I, Damian Tenma, shall breach these walls... ...so that I may treat my benefactor to some tea, and maybe some cookies, too.\nApollo:\nNo, wait! We can do tea and cookies after we prove your innocence! How about you start by telling me what happened?\nTenma:\nHrmmm... I see. So tea and cookies can wait, can they?\nApollo:\n(Whew, that was close. We don't need \"jailbreak\" added to the list of charges. Seems like a good guy, but with a face like that, I can see why he's misunderstood.)\nTalk\nReason for arrest\nApollo:\nMayor Tenma. Do you mind if I ask why you were arrested?\nTenma:\n! Grrrrrr!\nApollo:\nWhoa! S-Sorry! I guess some things are better left unsaid!\nTenma:\nBah!\nApollo:\nExcuse me?\nTenma:\nTo think a public paragon such as I could be treated like this! This arrest should have never happened!\nApollo:\nGo on...\nTenma:\nI fear the ill effects it will have on our youth! Now I've but one choice. I must leave here at once, if only to protect the moral fiber of our youth!\nApollo:\nNo, wait! You can protect the moral fiber of our youth after you've been declared not guilty!\nTenma:\nHrmmm... I suppose you're right.\nApollo:\n(Phew... Our youth just came this close to quite a scare.)\nTenma:\nMy fingerprints were on the spear that killed Alderman Kyubi. That's why I was arrested.\nApollo:\nYour prints were on the murder weapon? That's never good. Any idea how they got there?\nTenma:\nNone. For I hardly remember a thing, you see. I was fast asleep at the time. Someone must have slipped me a sleeping pill or something. What's worse, somebody clobbered me on the head.\nApollo:\nI see... A drug induced slumber, and a blow to the head. No wonder you hardly remember a thing.\nTenma:\n............Ho.\nApollo:\n(Huh? Was that some kind of strange laugh?) Well, I think we can safely assume your prints were planted while you were unconscious.\nMotive\nApollo:\nWhat do the police have on you as far as a motive is concerned?\nTenma:\nTruth be told, there's been a bit of trouble between the alderman and I as of late.\nApollo:\nOh? Was it personal in nature?\nTenma:\nNothing like that. It's a long story... ...but suffice to say, I've been pushing to merge Nine-Tails Vale with Tenma Town. Surrender Nine-Tails Vale to Tenma Town now!!!\nApollo:\nYikes!\nTenma:\n...That's what I told him.\nApollo:\n(I'd like to tell YOU to stop shouting like that, but I'm too scared!) So, um, that's the motive the police have established for the alderman's murder?\nTenma:\nIndeed it is. After all, Alderman Kyubi was dead set against a municipal merger.\nApollo:\nAnd that's why they think you killed him, he was in your way.\nTenma:\nArrrrrrgh! Cuuuurrrrssseeees!\nApollo:\nUm, M-Mayor Tenma? Are you okay...?\nTenma:\nJinxie! Forgive me! I never meant to worry you like this!\nApollo:\nIt'll work out fine! Just leave it to me! (If only it really were that easy. I don't even know where to start...)\nPresent\nAttorney's Badge\nTenma:\n......Thank you for agreeing to defend me.\nApollo:\nOh, no thanks required. Just doing my job.\nTenma:\n............ ............\nApollo:\n(He's even scarier when he's not saying anything.) Um... Nice day today, huh?\nTenma:\n............Hrmmm.\nApollo:\nI, um, love nice days like these. It's, uh, perfect lawyering weather, heh heh heh!\nTenma:\nThe trial......... is tomorrow.\nApollo:\nYes, right, the trial! (Why do I keep blabbering on like that?)\nTenma Taro Warding Charm\nApollo:\nThose charms on your head... They're the same as this one, correct?\nTenma:\nIndeed they are. Jinxie applied them after the murder. She said they would keep Tenma Taro from possessing me.\nApollo:\nOh, right! (So it's not some creepy fashion statement.) Still, there are an awful lot of them.\nTenma:\nThat there are. Truth be told, my head's feeling a bit... itchy.\nApollo:\nCan't you just peel them off?\nTenma:\nJinxie did this for me. I could not hurt her feelings like that.\nApollo:\n(He really cares for his daughter.)\nAnything else\nApollo:\nI wanted to show you this.\nTenma:\n!\nApollo:\nAaagh! Sorry!\nTenma:\n...............\nApollo:\n(I hate when he clams up like this.)\nAfter clearing all Talk options:\nApollo:\nThank you for meeting with me, Mayor Tenma.\nTenma:\nPlease, wait. My daughter, Jinxie...\nApollo:\nYes?\nTenma:\nShe... she already lost her mother. And now with me being held in here, I fear she'll be terribly lonely. I hesitate to ask, but......... I beg you, be a friend to her in her time of need.\nApollo:\nLeave it to me! Trucy and I will look out for your daughter!\nTenma:\nI shall rest a little easier, then. You know, you remind me of some of the new friends Jinxie has been talking about.\nApollo:\nNew... friends?\nTenma:\nYes. It seems she's made some new friends since she started working in Nine-Tails Vale. They're quite the unusual bunch, too. There's a lady with an exceptionally long neck... ...a young lad with an incredibly long tongue, and many other interesting characters.\nApollo:\n(Friends? Sounds more like a bunch of monsters to me!)\nTenma:\nNow, if you would excuse me. It appears my time is up.\nApollo:\n(Whew... Why am I so tired? I must've been more tense than I thought... Still, I'm glad he didn't turn out to be as scary as he looks!) A call? ...Oh, it's Mr. Wright. Justice here.\nPhoenix:\nApollo, is that you?\nApollo:\nHi, Mr. Wright. What can I do for you?\nPhoenix:\nTrucy told me you've taken on a new case.\nApollo:\nOh, that. It was kinda spur of the moment. (He's actually calling ME about a case?)\nPhoenix:\nThat's fine, but I have a favor to ask.\nApollo:\nSure. What is it?\nPhoenix:\nI'm at the airport right now. There was someone I had to meet. A new addition to the agency, actually. Her name's Athena Cykes, and she just passed the bar.\nApollo:\n(That's right. I remember hearing about her coming to join us. Guess that was today.)\nPhoenix:\nShe took off as soon as I told her you needed help with a case. It was like there was no stopping her.\nApollo:\nWait... Whaaaaaat! Where is she now?\nPhoenix:\nProbably somewhere in Nine-Tails Vale by now. That's where that favor I mentioned comes in. I need you to go find her.\nApollo:\nBut I've never even met her before. What does she look like?\nPhoenix:\nShe'll be the girl in the yellow suit sporting an attorney's badge.\nApollo:\nOkay, I'll find her. A new addition to the agency... (Well, I'd better get back to Nine-Tails Vale quick.)\nWright Anything Agency\nTalk\nAny ideas?\nApollo:\nTrucy, I'd like to hear your thoughts on what happened.\nTrucy:\nYou do? Does that mean I can join the investigation?\nApollo:\nI could sure use your help, but remember what Mr. Wright said? \"Trucy, you're in high school now, so you need to focus.\"\nTrucy:\nRight... I guess I better pull it together. It's time to forget everything else and just focus on my magic tricks!\nApollo:\nWait, no! He was talking about your schoolwork!\nWhat to do\nTrucy:\nWelcome to Trucy's Two Cents! Go ahead, ask me anything!\nApollo:\nOh, um, okay... Jinxie's always plastering charms on my forehead. What should I do?\nTrucy:\nThat's an easy one, Apollo. Just do this... 3, 2, 1... Ta-dah!\nApollo:\nDo what...? ......Ack!\nTrucy:\nSee! She won't be able to stick any more on if there's already one there. Problem solved!\nApollo:\nHow's that a solution? Either way, I still have a charm plastered on my forehead!\nPresent\nAttorney's Badge\nApollo:\nCheck it out.\nTrucy:\nYou're so lucky, Apollo. Everyone can see what you do with just a flash of your badge.\nApollo:\nWhat about you, Trucy? People can tell you're a magician by the way you're dressed.\nTrucy:\nYeah, but I can't always dress like this. Like when I'm at school and stuff.\nApollo:\nYou could always show you're a magician by making things appear or disappear.\nTrucy:\nYou mean like this? 3, 2, 1... Ta-dah!\nApollo:\nUmm, magic or no, aren't you a little old to be showing those things in public?\nTrucy:\nHmm... Then maybe I'll become a lawyer, too.\nApollo:\nYou're abandoning your dream just like that?!\nTenma Taro Warding Charm\nTrucy:\nJinxie's warding charms... Hm, what if I incorporated it into my act? Might be fun.\nApollo:\nYou mean like having charms come out of your magic panties?\nTrucy:\nExactly! And then I'd have them fly off and stick to audience members' foreheads!\nApollo:\nSomehow, I don't think that would go over so well.\nTrucy:\nThen how 'bout I have them stick on my assistant? That would be you, Polly!\nApollo:\nHow does that make it any better?! And I'm not your assistant!\nTrucy:\nWhat?! But I could've sworn you were.\nApollo:\nWhere in the world did you get that idea?\nAnything else\nTrucy:\nOkay! Watch me make that disappear!\nApollo:\nNo, wait! That's crucial evidence!\nTrucy:\nBut I wanted to show you my new disappearing trick! Oh, I know! If it's really so important, how about I make more of it appear!\nApollo:\nFabricating evidence is even worse than making it disappear!\nTrucy:\nOh, well. Too bad.\nApril 17Nine-Tails Vale - Yokai Lane\n???:\nI. Already. Told. You! I'm a lawyer assigned to the case! I need to study the crime scene, so if you would please tell me where Kyubi Manor is...!\nPoliceman:\nYou can't fool me! You're just some delinquent high school student playing hooky!\n???:\nYou stupid, pig-headed...! This attorney's badge isn't just for show, you know!\nApollo:\n(Looks like I just found Ms. Athena Cykes.)\nAthena:\nTsk! Why won't you believe me?! Don't expect me to defend you in court if you ever get arrested!\nPoliceman:\nWell, I'm the one who usually does the arresting, so... Say, shouldn't you be getting back to school?\nAthena:\nI already told you, I'm a lawyer, not a student!\nPoliceman:\nThat's it! Enough of your lies! You're coming with me!\nAthena:\nAaah! Get your hands off of me!\nAnime cutscene\nApollo:\n.........Urnngh... Think you can watch out for the bystanders next time...?\nAthena:\nWhoops! Are you okay?\nApollo:\nI think so. (But that police officer's out cold.)\nAthena:\nI am SO sorry! I do that when people suddenly grab me. It's like a reflex or something.\nApollo:\n(Reflex? Sounds more like a felony!) You're Athena Cykes, I take it?\nAthena:\nThat would be me. And you are?\nApollo:\nI'm Apollo Justice. I work at the Wright Anything Agency.\nAthena:\nThe Wright Anything Agency? What a fishy sounding name.\nApollo:\n...It's a long story, but it IS a law office, among other things. Didn't Mr. Wright explain it to you?\nAthena:\nOh, right, THAT Wright! So then, you must be...! Where have you been?! I've been looking all over for you!\nApollo:\n(I could say the same thing to you.) Well, here I am. Now how about telling me a little bit about yourself. Mr. Wright didn't really tell me much... as always.\nAthena:\n.........Ah, of course! Feel free to ask away!\nTalk\nAthena Cykes\nApollo:\nSo, Athena, I hear you just passed the bar.\nAthena:\nThat's right! And here's my shiny new badge to prove it. Isn't it beautiful?\nApollo:\nOh, so you must be a bit younger than me.\nAthena:\nHeh heh heh. A bit more than you might think, in fact! I'm only eighteen!\nApollo:\nE-Eighteen? How in the world did you become a lawyer at that age?\nAthena:\nI skipped a few grades while I was an exchange student in Europe. And I got my license to practice law while I was over there.\nApollo:\nAll I can say is, wow... (She must be a genius or something.)\nAthena:\nI also studied analytical psychology! Thought it might help me be a better lawyer.\nApollo:\n(Psychology helps her be a better lawyer? How exactly does that work?)\nThe client\nAthena:\nSo, tell me about our client. What are they like?\nApollo:\nOh, right, you haven't met him yet. Well...\nApollo:\n...And that about sums it up.\nAthena:\nHe's more worried about his daughter than himself. What a wonderful father. *sniffle*\nApollo:\nWait, are you crying?\nAthena:\nI'm not cr-crying! There was something in my eye!\nApollo:\n(Um, they're called \"tears\"...)\nAthena:\nMoving right along... Let's get down to business! Helping our client is priority number one!\nPsychology (appears after \"Athena Cykes\")\nApollo:\nSo, Athena, you mentioned studying psychology.\nAthena:\nThat's right! I've always wanted to bring analytical psychology into the courtroom. The power of psychology will bring a breath of fresh air to the legal system.\nApollo:\nOh, really? So how do you plan on using it to defend our client?\nAthena:\n...Um, well, for example, I can try to listen in on a witness's inner voice... ...and then analyze their psychological state with the help of my trusty partner Widget!\nApollo:\nWidget...?\nAthena:\nThis device around my neck here! Say hi, Widget!\nWidget:\nHi Widget!\nApollo:\nIT TALKS?!\nAthena:\nWhoa, you need a volume knob! Anyway, the little guy will sometimes say what I'm feeling.\nWidget:\nAwk-ward...\nAthena:\nDon't worry, you'll get used to it.\nApollo:\nNow THAT I seriously doubt.\nPresent\nAttorney's Badge\nAthena:\nYep! That's your attorney's badge, all right! Its dull, grimy look makes me think of all the courtroom battles you've faced so far! I hope mine will look like that someday! Look out legal world, Athena Cykes is psyched and ready to go!\nApollo:\n......... (Actually, I just haven't polished it lately... Maybe I should keep that to myself. No need to deflate her dreams about \"work\" just yet.)\nYokai Legend Scroll\nAthena:\nWhat an interesting picture! It looks like a one-on-one monster smack down! It must've been quite a battle. Which yokai do you think is stronger?\nApollo:\nSeems to me Tenma Taro's ability to fly would give him an edge over the Nine-Tailed Fox.\nAthena:\nBut the Fox has powerful legs. He'd pounce before Tenma Taro knew what hit him!\nApollo:\nHe won't be pouncing on anyone after he's dropped from way up in the sky!\nAthena:\nErrr... B-But the Nine-Tailed Fox is gold-colored! Gold is way better than black, so I'm sure he'd win!\nApollo:\nWhat do colors have to do with anything? (Besides, everyone knows red is the best.)\nAnything else\nAthena:\n*sigh* Sorry, Apollo. Nothing's coming to mind. But give me an hour and I'll have it analyzed Cykes style! I'll get started on it right now!\nApollo:\nNo need for that! I was just wondering.\nAfter clearing all Talk options:\nAthena:\n...Oh, I almost forgot. I have something you might be interested in. I got in on my way here. Think it might have something to do with our case?\nApollo:\nA special edition covering our case? That was quick.\nAthena:\nThat's the whole point of special editions, isn't it? To be the first to get the scoop? ¡Rápido! (Changed from [That's the whole point of special editions, isn't it? To be the first to get the scoop? Rapido!] in the original release)\nApollo:\nRight... Well, let's see what it says here... (What's the deal with the Spanish?) Tenma Taro was seen.... wha--? He was seen flying through the sky?!\nAthena:\nYeah, somebody happened to snap that photo near Nine-Tails Vale. The article goes on to say it might be connected to our case. Apparently, that photo was shot right after the murder occurred.\nApollo:\nWell, there were black feathers and strange tracks at the crime scene. I'm not surprised the locals think a yokai was involved.\nAthena:\nWait a second... Yokai as in one of those Japanese monsters? Mein Gott! You don't actually think it was a supernatural murder, do you?\nApollo:\nHa ha ha, n-no, of course not. (Now German? Why not plain old English?)\nSpecial Edition Paper added to the Court Record.\nAthena:\n¡Ándale, Apollo! Let's get cracking on that crime scene already! (Changed from [Andale, Apollo! Let's get cracking on that crime scene already!] in the original release)\nTalk\nThe investigation\nApollo:\nOkay, what's next on the list?\nAthena:\nInvestigating the crime scene, what else?! Well, what are we waiting for?! Last one there is a rotten egg!\nApollo:\nWe don't have to run all the way there.\nAthena:\nOkay... Then how about speed walking?!\nApollo:\n(Why does this have to be a competition at all?)\nPresent\nSpecial Edition Paper\nAthena:\nLooks like this paper doesn't shy away from stories on strange creatures.\nApollo:\nReally? What does it say?\nAthena:\nThey claim to have produced photos of Gourdy and a Kappa water sprite thingie. And just the other day, they got one of Konaki Jiji crying his poor old eyes out... ...followed by that infamous shot of Tenma Taro.\nApollo:\nI don't know about a Kappa, but I bet the Konaki Jiji... ...is just a shot of someone's grandpa lost and crying up in the mountains.\nAthena:\nThat's not very nice! They should have helped him instead of publishing his picture!\nApril 17Kyubi Manor - Foyer\nAthena:\nDo you hear that? It sounds like a TV or something. Oh, look! There's a TV in that little room in the corner.\nTV:\nIn other news... The mysterious masked wrestler The Amazing Nine-Tails... ...has been confirmed missing according to sources close to the wrestler. It appears he disappeared sometime after the special event held in Nine-Tails Vale today. He also failed to appear at a match today where he was scheduled to defend his title. Local villagers say his disappearance may be connected with Tenma Taro's recent escape.\nApollo:\nSo, that wrestler's gone missing.\n???:\nHey, you two! You don't belong in here!\nAthena:\nEek!\nApollo:\nDon't worry, there's nothing suspicious--\n???:\nWhat about them there horns o' yours? They look mighty suspicious if ya ask me!\nApollo:\nHorns?! That's my hair...! Anyway, we're lawyers, and we're here to--\n???:\nAh! You're them lawyers come to defend Mayor Tenma, ain't ya?! Eh heh heh. Shoulda reckoned what with that expensive-looking bracelet ya got there. The name's Phineas Filch.\nFilch:\nI'm the caretaker here. Pleased to meetcha, eh heh heh.\nApollo:\nUm, same here.\nAthena:\nWow, talk about a quick change of heart.\nFilch:\nSo, tell me, Demon Lawyer! Betcha use them demonic horns of yours to scare the bejeebers outta witnesses, huh? Come here, ya lil' horned demon, you!\nApollo:\nYouch! These horns, er... I mean, my hair isn't meant to threaten anyone!\nFilch:\nThey ain't? Seems a mighty big waste o' perfectly good horns if ya ask me. Then again, ain't none o' my business, so...\nApollo:\n*sigh* (That was fast. Guess he's done with me.)\nFilch:\nWell, I'd best get back to work!\nAthena:\nAthena:\nHalt! Stop right there!\nFilch:\nHuh? Me?\nAthena:\nApollo, your bracelet's gone!\nApollo:\nAh!\nFilch:\nDon't ya worry, Mr. Lawyer, sir! I'll check the lost 'n' found later!\nApollo:\n.........Somehow, I don't think that will be necessary. Just check your wrist right now.\nFilch:\nArrrrrrrrrgh! The cat's outta the bag!\nApollo:\n(It was barely in the bag in the first place!)\nAthena:\nThat was a pretty pathetic attempt.\nFilch:\nS-S-Sorry! I'm sooooo sooooo sorry! Just couldn't control myself! Please, forgive me! I'm beggin' ya!\nApollo:\n(Sheesh, I almost feel sorry for him now.)\nAthena:\nWhat should we do about him, Apollo?\nApollo:\nWell, I got my bracelet back, and he seems sorry enough, so...\nFilch:\nI knew ya'd understand, Mr. Lawyer, sir! Ya obviously got a big heart! As big as the wad o' cash in your wallet, I hope, eh heh heh!\nApollo:\nYou leave my wallet out of this.\nFilch:\nHo HO!\nAthena:\nHey! Didn't you just finish apologizing for stealing from us?!\nFilch:\nRun away, run away! Head for the hills!\nAthena:\nGet back here, you!\nApollo:\n(Talk about a quick escape.) ...Hm? Looks like he dropped a few things. Looks like a pair of diagrams. This one's of the crime scene, and here's one of the foyer.\nAthena:\nHe left his shoes behind, too.\nApollo:\nThe guy's the living definition of a bumbling thief.\nAthena:\nLet's hang on to his shoes. We can give them back next time we see him. As for the diagrams, I say we keep them!\nApollo:\nThey look like something the police might draw. Wonder where the caretaker got them?\nCrime Scene Diagram added to the Court Record.\nFoyer Diagram added to the Court Record.\nApollo:\nNow then, as I recall... ...the Fox Chamber should be at the top of those stairs.\nApril 17Kyubi Manor - Fox Chamber\nAthena:\nWhoa! Where'd all these black feathers and weird tracks come from?!\nApollo:\nThe popular opinion seems to be that they're from Tenma Taro.\nAthena:\nYou mean the great evil has returned?\nApollo:\nEven if he did, I'd be laughed out of the courthouse trying to indict him.\n???:\nHey, who are you and what are you doing here? This is a crime scene!\nApollo:\nAnd who are YOU? Are you with the police?\n???:\nI asked first! Who are YOU and what are you doing here?! On second thought... I'm placing you under arrest for disturbing a crime scene!\nApollo:\nAck! Under arrest?! B-B-But...\n???:\nSave it for the boys back at HQ! Now, come quietly or else! I don't want to be late for lunch!\nApollo:\nP-Please, wait! We're Mayor Tenma's lawyers!\n???:\nWell why didn't you just say so! So you're the lawyers I heard about. Ha ha ha! I almost took you two in! You two sure were suspicious, though!\nAthena:\nI don't know how many more times I can take being called suspicious in one day...\nApollo:\nSorry, we didn't catch your name.\nFulbright:\nMy name? I'm Bobby Fulbright! The heroic detective who defends our good citizens from evil! The champion of justice who comes running whenever you're in need! And my catchphrase? It's \"In justice we trust!\"\nApollo:\nHoo boy... (This guy's a story and a half...)\nFulbright:\nSo! What can I do for you?\nTalk\nInvestigating the scene\nApollo:\nSo, would it be okay if we had a look around?\nFulbright:\nCertainly not! No unauthorized personnel allowed!\nApollo:\nCouldn't you make an exception?\nFulbright:\nCease and desist at once, or you'll have to deal with my little friend here!\nApollo:\nAck! (Yikes! Is he reaching for his...?!)\nFulbright:\nIn justice we trust!\nApollo:\n...! (Phew, it's just his badge.)\nFulbright:\nYou may be Mayor Tenma's attorneys, but you still need authorization to cross a police line!\nAthena:\nApollo, let's see if we can't change his mind!\nApollo:\nGood luck! Let me know how it goes! (I bet he's as dense as heroes come...)\nPersuasion (appears after \"Investigating the scene\")\nLeads to:\n\"You're wasting your time and mine! Nobody's crossing this line without authorization!\"\nPresent\nAnything\nFulbright:\nJustice need backup sometimes, too! So I don't mind you asking for help, but you should start by thinking things over yourself. After all, the road to justice starts with your own first step! Ha ha ha!\nApollo:\nIf you don't have any information to offer, you could just say so.\nFulbright:\nYou're wasting your time and mine! Nobody's crossing this line without authorization! I'm a wall of justice keeping injustice -- that would be you -- at bay!\nApollo:\n*sigh* I knew it. Look, there's just us and you here, right?\nFulbright:\nJustice and me, you say?\nApollo:\nTh-That's right...?\nFulbright:\nAre you trying to say that justice and I aren't enough to keep you out?!\nApollo:\nUm, what?\nAthena:\n...! No, silly! We're saying that you're an inspiration in our quest for justice!\nFulbright:\nNo!!! It can't beeeee!!!\nApollo:\nYou have him on the ropes now, Athena!\nAthena:\nUm, if we were on the side of justice, would you let us through?\nFulbright:\nB-B-But, guarding the crime scene is a part of justice, too!\nAthena:\nSure... but only a bad guy would stand in the way of justice, right?\nFulbright:\nAaaaargh! Whose justice is the most just here?\nApollo:\nWell, we can't have a fair and just trial without a thorough investigation, so...\nFulbright:\nHrmmm... Oh, Lady Justice...! What would you have me dooooo?!\nAthena:\nI think we really got to him.\nApollo:\nYeah, he seems pretty neurotic as far as champions of justice go. (Changed from [Yeah, he's [sic] seems pretty neurotic as far as champions of justice go.] in the original release)\nAthena:\nOur pleas for justice must've had a huge impact. It's tying him up in knots! Now's our chance to start looking around.\nApollo:\n(After all that about authorized personnel only... this was surprisingly easy.)\nFulbright:\nHrmmm... Should I stop them or let them through? Whose justice is more just?\nAthena:\nWell, let's get to work! We're supposed to be finding clues related to the crime, right? (Changed from [We're supposed to being [sic] finding clues related to the crime, right?] in the original release)\nApollo:\nRight. A search of the crime scene should turn up some evidence we can use at the trial. Let's try viewing the crime scene from different angles.\nAthena:\nYou never know what's hiding just around the corner, right? So we move the cursor with [left analog stick / WASD]... (Changed from [Wait, but how do we go about changing our perspective?] in the original release)\nApollo:\nAnd change our perspective with [right analog stick left/right / left/right arrow keys]. (Changed from [Touch the arrows on the bottom screen or press left or right on [D-Pad].] in the original release) If there's a particular spot you want to examine, just give it a tap.\nAthena:\nOkay, let's leave no stone unturned! Nous allons commencer! Let's get started!\nExamine\nForbidden Chamber door\nApollo:\nThe Forbidden Chamber... They say the demon Tenma Taro was imprisoned in there before his \"escape.\"\nAthena:\nThink we could get this door open?\nApollo:\nIt's worth a try. Hrrrgh! ...No good. It's shut tight! I don't even see a key hole. Seems pretty hopeless.\nFulbright:\nIn justice we trust!\nApollo:\nYikes!\nFulbright:\nDid I just hear the voice of someone in need?! Allow me to fill you in! This door simply will not open! We've tried and tried, but it won't budge! It's an essential part of the culture found in this manor, so we can't blow it up either!\nApollo:\n(So, an unopenable door. Right.)\nFulbright:\nAccording to Ms. Jinxie Tenma, it was shut tight when she came across the crime scene.\nAthena:\nThanks for the tip, Detective Fulbright. We didn't expect you to be so helpful.\nFulbright:\nAaaaaaaaaaargh! Forget I just said that!\nApollo:\n(So, the Forbidden Chamber was shut tight at the time of the murder. Sounds like something I'd better keep in mind.)\nOutline on table\nApollo:\nSo, this is where Alderman Kyubi's body was found.\nAthena:\nApparently, the murder weapon -- a spear -- had Mayor Tenma's prints on it.\nApollo:\nThat's not good.\nFulbright:\nNever fear, Detective Fulbright is here!\nApollo:\nYikes!\nFulbright:\nOf course, I can't offer you any information on my investigation, so... In the name of justice, I must say goodbye!\nApollo:\nUmm... What was that all about?\nArmchair on right\nAthena:\nWow! This is a pricy-looking chair!\nApollo:\nApparently, the mayor was found drugged and unconcious in it.\nAthena:\nReally?!\nApollo:\nYeah, and when he came to, he was arrested for murder. Talk about your rude awakenings.\nAthena:\nSo, he's the prime suspect in a crime he knows nothing about?!\nWidget:\nThat stinks!\nAthena:\nOh, poor Mr. Tenma. *sniffle* He must be feeling so scared and confused. Apollo, it's up to us to save him!\nApollo:\n(It's like she's on her own emotional roller coaster.)\nFox statues\nAthena:\nLook! This statue only has one tail.\nApollo:\nMaybe it's the Nine-Tailed Fox's sidekick. I bet the number of tails represents a yokai's power.\nAthena:\nSo... if you had two, Apollo, I'd only have one?\nApollo:\nWait. What?\nAthena:\n...Not that it means you're better than me, got it?!\nApollo:\nLike I said, what?\nArmchair on left\nApollo:\nThere's something wedged under this chair. Let's see if we can't lift it up and...\nFulbright:\nFreeze!\nApollo:\nYikes!\nFulbright:\nNo disturbing crime scene evidence! Even if you ARE the mayor's lawyers.\nApollo:\n(He does have a point there.)\nAthena:\nHey Detective Fulbright, did you hear about the attack over on Yokai Lane? I hear an elderly woman was assaulted by a strange yokai shaped like a roll of cloth!\nFulbright:\nAnd you waited till now to tell me?! I better get over there at once. In justice we trust!\nAthena:\n...That was surprisingly easy. Okay, Apollo, now's our chance to look around some more.\nApollo:\n(The more I get to know her, the scarier she gets. Hope she never finds MY weakness.)\nCloth under armchair\nApollo:\nWhatever this is, it's stuck on tight.\nAthena:\nLooks like a large bloodstained cloth.\nApollo:\nThe blood's probably the alderman's, but it's pretty far from his body. Wonder how it got here... (And why does this seem important?)\nBack of folding screen\nApollo:\n(Nothing much to see on this side. Maybe I should go check the other side.)\nWeapons\nAthena:\nThis one's a spear, but what about this one? It looks like a giant pair of pliers.\nApollo:\nLooks like something a demon might use. Saw something like that in a manga once.\nAthena:\nReally? What are they used for?\nApollo:\nOh, things like pinching through cheeks...\nAthena:\nEeeuuuw!\nApollo:\nPulling out tongues...\nWidget:\nStop, stop!\nApollo:\nOh, and you should see what they can do to a person's eyes--\nAthena:\nOkay, okay, I get the idea! But I'm sure THIS thing is just a simple can opener or something like that!\nApollo:\nDemons eat canned food? I always wondered what they are besides people.\nFeathers and tracks\nApollo:\nThese weird tracks must've been made when someone stepped in the alderman's blood.\nAthena:\nMaybe the killer inadvertently made them when they were fleeing? They're pretty big tracks, almost bird-like. The feathers also point to a bird.\nApollo:\nThen it must be one big bird! And not one of the friendly yellow type, either!\nAthena:\nMaybe it's some mutant bird creature!\nApollo:\nSo, your theory is a giant mutant bird murdered Alderman Kyubi with a spear?\nAthena:\nIt's more plausible than saying a monster or yokai did it.\nApollo:\nSorry to burst your bubble, but a giant spear-wielding bird is by definition a monster!\nFront of folding screen\nAthena:\nIt's a folding screen. I wonder what they were using it for.\nApollo:\nI read that the Japanese used to use these in drafty rooms, but now they're just for show.\nAthena:\nYou mean like... like my attorney's badge. *sniffle*\nWidget:\nPoor Athena...\nApollo:\n(That cop treating her like a child must've really bothered her.)\nClock above door\nAthena:\nApollo, what words come to mind when you watch that pendulum in there?\nApollo:\nHmm... Unsteady and umm... restless.\nAthena:\nThat's a direct representation of your current state of mind.\nApollo:\nWait! That was some kind of psychological test?!\nAthena:\nMy diagnosis? This strange case has made you anxious, causing you to lose your cool.\nApollo:\nYou're actually not that far off the mark.\nBroken statue behind door\nApollo:\nHm? There's something behind the door. Whatever it is, it looks like it's broken. Probably broke when the door was opened. Why would anybody put something there?\nAthena:\nYeah, that wasn't very smart.\nApollo:\nMaybe it was Jinxie. She was the first one to discover the body. She must have heard the screams and come running in here in a panic.\nAthena:\nWell, look at you, Apollo! Now you're using analytical psychology, too!\nApollo:\nI am?\nAthena:\nWow, you really learn quick! But I guess I shouldn't be surprised. You're the ace attorney of Wright Anything Agency!\nApollo:\n(I can't tell whether she's serious or not. Now, if Trucy said something like that, I'd immediately know she was messing with me.)\nIntact statue behind door\nAthena:\nDoesn't this tanuki statue remind you of the manor's caretaker, Phineas Filch?\nApollo:\nThis raccoon-looking thing? Yeah, it does look like him!\nAthena:\nOoh, I just got the best idea! We should knock it over! It might transform back into Mr. Filch!\nApollo:\nMr. Filch is mischievous, but he's not magical, you know.\nAthena:\nWay to waste a brilliant idea, Apollo.\nAir vent\nApollo:\nHuh, that looks like an air vent. It's pretty high up there.\nAthena:\nWhat if you got a running start and jumped?\nApollo:\nI doubt even a high-jumper could make it.\nAthena:\nArgh! Don't rule it out before you try it! Besides, I'm an excellent jumper.\nApollo:\nEven so, that must be about nine feet high.\nAthena:\nLike I said, you don't know until you try, Monsieur Justice!\nApollo:\n(She doesn't know when to give up and when to stop using foreign words.)\nTrophies\nAthena:\nLook, trophies! Ooh! This one was awarded to Alderman Kyubi! \"The Amazing Nine-Tails, Yokai Div. Winner, Tenma Town Pro Wrestling Tournament.\"\nApollo:\nYokai Division? I didn't know you could have a division of one.\nAthena:\nApollo, you should enter the tournament next time! And I have the perfect name for you! The Mysterious Firebrand! A mild-mannered masked lawyer by day... demonic masked wrestler by night!\nApollo:\nNo one's going to hire a masked lawyer, Athena.\nWindow\nApollo:\nHey, this window opens. And outside... we have ourselves a steep cliff.\nAthena:\nThe window only opens about six inches -- not wide enough for anyone to get in or out. Look, Apollo! There's something caught in the window frame! It looks like gold fur. What a pretty color! It must be from some kind of animal!\nApollo:\nWonder what it's doing here. Did Alderman Kyubi have a pet fox?\nGolden Fur added to the Court Record.\nWindow (subsequent times)\nApollo:\nWhat's this gold fur caught in the window frame here? Could it be from some rare gold-colored fox found only in Nine-Tails Vale?\nAthena:\nYou think a fox squeezed out of this window?\nApollo:\nNothing's getting out that way. There's a steep cliff on the other side.\nAthena:\nHmm... It's one mystery after another.\nStatue next to armchair\nApollo:\nHmm... What do we have here? Looks like a statue of the Nine-Tailed Fox and Tenma Taro battling it out.\nAthena:\nEek! Careful, Apollo, it's got blood on it!\nApollo:\nReally? ...Hey, you're right. Wonder if it's the alderman's blood?\nAthena:\nHow can you remain so calm after seeing all this blood?\nApollo:\nWell, this isn't the first time I've seen something like this, so...\nAthena:\nYou're no fun at all! At least act surprised or grossed out or something for my first case!\nApollo:\nI'm already a lawyer. You want me to be an actor, too?\nFox and Demon Statue added to the Court Record.\nStatue next to armchair (subsequent times)\nApollo:\nHmm... What do we have here? Looks like a statue of the Nine-Tailed Fox and Tenma Taro battling it out.\nAthena:\nEek! Careful, Apollo, it's got blood on it!\nApollo:\nReally? ...Hey, you're right. Wonder if it's the alderman's blood?\nAthena:\nHow can you remain so calm after seeing all this blood?\nApollo:\nWell, this isn't the first time I've seen something like this, so...\nAthena:\nYou're no fun at all! At least act surprised or grossed out or something for my first case!\nApollo:\nI'm already a lawyer. You want me to be an actor, too?\nYokai figurines left of the window\nAthena:\nLook! A cat with two tails!\nApollo:\nNo such thing.\nAthena:\nOh, and this lady has a really long neck! Ha ha ha! How funny is that!\nApollo:\nThere's no way a creature like that could ever exist. She'd have a tough time swallowing.\nAthena:\nApollo... I bet you were one of those kids who didn't believe in Santa Claus.\nApollo:\nWhat's that got to do with anything?\nAfter examining Forbidden Chamber door, outline on table, cloth under armchair, window, and statue next to armchair:\nApollo:\n(Guess that about wraps it up.) Now if only we could get that detective to tell us what he knows...\nAthena:\nHey, Apollo... Do you hear something?\nApollo:\nHm? .........I don't hear anything.\nAthena:\nOh, right. Your hearing must not be as sensitive as mine.\nApollo:\nUm, what are you talking about?\nAthena:\nA whooshing sound, like wind rushing through a narrow strait. And the echo of someone's voice... \"In... In...\"\nFulbright:\nIN JUSTICE WE TRUST!\nAthena:\nAaaaaaaaah!\nFulbright:\nHa ha ha! Someone's got a sharp set of ears! That was the sound of my righteous voice reverberating through the air duct!\nAthena:\nI heard it through the air ducts?\nFulbright:\nYeah, check it out.\nApollo:\nBut why would she hear you through there?\nFulbright:\nWhy don't we go to the diagram? As you can see, that vent is connected to an air duct that leads out into the hallway! The wind must've rushed through there... ...and carried my monologue with it straight to your ears!\nAthena:\nAnd what a... unique monologue it was. I was just thinking... Maybe the killer made their escape through the air duct or something!\nFulbright:\nHeh heh heh, a cute theory, but I don't think so. The air duct in the hallway is low enough to climb into, that much is true. But as you can see, the vent in the ceiling is very high. Nine feet high, in fact. (Changed from [9 feet high, in fact.] in the original release) I highly doubt that there's any way to get up there without a ladder or something. And I don't see anything of the sort in this room, do you?\nAthena:\nHmm... I guess you're right.\nApollo:\nSpeaking of things in this room...\nFulbright:\nYeah?\nApollo:\nCan you tell us what you guys turned up, Detective Fulbright?\nFulbright:\nNot on my watch, buddy! In the name of justice, I cannot reveal facts pertaining to the prosecution's case!\nApollo:\nAw, come on, throw us a bone here.\nAthena:\nExcuse me, Detective Fulbright, but I recall you saying earlier... ...that you would come running whenever we were in need.\nFulbright:\nYurk! I suppose I did say that! Helping those in need is what justice is all about, but... But keeping information out of enemy hands is also a form of justice! Hmm... Aaaaargh! Which justice is the most just? Why is this always so hard!\nAthena:\nHmm......... Well, how about this? Let's do a little give and take. I mean, serving the public is part of justice, too, right? You know, like the police motto? \"To serve and protect.\"\nApollo:\n(I doubt leaking information to the defense team falls under that motto.)\nFulbright:\nYes, of course! I must serve as well as protect! (Changed from [Yes, of course! I must serve and [sic] well as protect!] in the original release) Okay, I will share some information. ...In the name of justice!\nAthena:\nWe did it, Apollo!\nApollo:\nYeah, we did it, all right. (But I'm not sure that was entirely ethical...)\nTalk\nDetails of the case\nApollo:\nWas it Ms. Jinxie Tenma who first discovered the crime scene?\nFulbright:\nThat's right. And this photo shows what she saw when she opened the door. Ms. Tenma had a key, allowing her immediate access.\nApollo:\nA key? So, then, the Fox Chamber was locked?\nFulbright:\nYes, and Ms. Tenma had the only key to its door.\nApollo:\nReally? So, Alderman Kyubi didn't have a key to the Fox Chamber?\nFulbright:\nActually, he had a master key for most of the doors in the manor, but... It disappeared after his murder.\nAthena:\nDisappeared? You think the killer took it?!\nFulbright:\nIt could very well be connected to the murder. We're looking into the possibility now. But it's the timing of Ms. Tenma's discovery that I think is most important. Of course, I'm not going to share that information with you, ha ha ha!\nAthena:\nYou think you're some kind of champion of justice, but you're just plain old mean!\nFulbright:\nI won't fall for that, you shameless rascal! I only help good little boys and girls!\nAthena:\nShameless rascal? Who even says that?\nApollo:\nWell, I wouldn't exactly call you a good little girl, either.\nCrime Photo added to the Court Record.\nDetails of the case (subsequent times)\nApollo:\nWas it Ms. Jinxie Tenma who first discovered the crime scene?\nFulbright:\nThat's right. And this photo shows what she saw when she opened the door. Ms. Tenma had a key, allowing her immediate access.\nApollo:\nA key? So, then, the Fox Chamber was locked?\nFulbright:\nYes, and Ms. Tenma had the only key to its door.\nApollo:\nReally? So, Alderman Kyubi didn't have a key to the Fox Chamber?\nFulbright:\nActually, he had a master key for most of the doors in the manor, but... It disappeared after his murder.\nAthena:\nDisappeared? You think the killer took it?!\nFulbright:\nIt could very well be connected to the murder. We're looking into the possibility now. But it's the timing of Ms. Tenma's discovery that I think is most important. Of course, I'm not going to share that information with you, ha ha ha!\nAthena:\nYou think you're some kind of champion of justice, but you're just plain old mean!\nFulbright:\nI won't fall for that, you shameless rascal! I only help good little boys and girls!\nAthena:\nShameless rascal? Who even says that?\nApollo:\nWell, I wouldn't exactly call you a good little girl, either.\nFeathers and tracks\nApollo:\nThose feathers and tracks look like something a yokai might leave behind.\nFulbright:\nYou don't actually think the murderer was some sort of monster, do you?\nAthena:\nWhat's the name of that creature in the Forbidden Chamber? Tenma... something... Because from the black feathers and big tracks, it looks like that creature did it.\nFulbright:\nOur prime suspect would, no doubt, love to pin the blame on some imaginary creature.\nAthena:\nCan Tenma whatchamacallit even be made a victim of slander?\nApollo:\n(I doubt the mayor would do something as childish as blaming a boogieman.)\nAthena:\nSo, the most likely scenario so far is... ...that Tenma guy left the feathers and tracks behind... ...to make it look like yokai Tenma was the killer.\nApollo:\n...Wait, what? Now I'm as confused as you! (At any rate, I doubt Mayor Tenma would plant evidence like that.)\nSuspects\nApollo:\nSo, Mayor Tenma is your only suspect?\nFulbright:\nThat's right. Even his name, Damian Tenma, makes him sound like a villain. And he's really scary looking, too.\nApollo:\nWait, are you telling me that's why he was arrested?\nFulbright:\nHa ha ha! Don't be ridiculous! He was the only one without an alibi.\nApollo:\nOh, is that so?\nFulbright:\nYup. Other than the victim, the suspect, and Ms. Tenma, the only others around were... ...Mr. Filch and Mayor Tenma's aide, and the two of them were together at the time.\nApollo:\n(Filch... The guy who tried to steal my bracelet. Just living up to his name, I guess. We should go talk to him again when we have a chance.) What about Jinxie? She's not being suspected at all?\nFulbright:\nShe may have no alibi whatsoever... but she also has no motive. It's unfathomable that she would murder the alderman, and pin the crime on her father. Besides, do you really think a little girl could lift up this huge spear?\nApollo:\nTrue enough. That spear looks even bigger than her.\nPresent\nAttorney's Badge\nApollo:\nUm, so this is my attorney's badge.\nFulbright:\nNo, no! Present it with more confidence and conviction! Like this... In justice we trust!\nApollo:\nOkay, um, how's this... Apollo Justice, attorney at law! H-Here comes Justice!\nFulbright:\nThat was amazing! But you know what they say, practice makes perfect. Let's see you do it ten more times!\nApollo:\nOkay, I'll try my best!\nAthena:\nUm, Apollo? What are you doing?\nApollo:\n(Ack! How'd he talk me into this?!)\nAnything else\nFulbright:\nJustice need backup sometimes, too! So I don't mind you asking for help, but you should start by thinking things over yourself. After all, the road to justice starts with your own first step! Ha ha ha!\nApollo:\nIf you don't have any information to offer, you could just say so.\nAfter clearing all Talk options:\nFulbright:\nThat's about all I can reveal at this time. Well? You must admit, Damian Tenma appears to be the most likely suspect.\nApollo:\n(I admit it looks bad, but I'm still not buying it.)\nFulbright:\nOh, and one more thing... I must warn you about the prosecutor.\nApollo:\nThe prosecutor assigned to Mayor Tenma's trial?\nFulbright:\nThat's the one. He's -- how shall I put it -- not what you'd expect. That is unless you've faced a convicted killer serving hard time as a prosecutor before.\nApollo:\nWhat the--?! Is this some kind of joke?\nTalk\nThe prosecution\nLeads to:\n\"Can I ask why a man imprisoned for murder is serving as prosecutor?\"\nApollo:\nCan I ask why a man imprisoned for murder is serving as prosecutor?\nFulbright:\nBecause he's mastered the use of psychology in courtroom battles. Everyone's talking about how this murder was the work of some strange creature. But yokai are nothing more than a figment of the imagination. They're baloney! Who better to prove that than a master of psychology? He's the best man for the job.\nApollo:\nBut he's a convicted murderer! No matter how you look at it, that's just insane!\nFulbright:\nWell, the chief prosecutor personally assigned him, so... ...none of us are in a position to question the matter, ha ha ha!\nApollo:\n(This really is the dark age of the law.)\nAthena:\nThis prosecutor... He wouldn't happen to go by the name \"Blackquill,\" would he?\nFulbright:\nBingo! Simon Blackquill. So, you HAVE heard of him?\nAthena:\n...You could say that.\nApollo:\n(What's that supposed to mean?)\nFulbright:\nWell, I bet you don't know his unofficial title. Ever heard of the \"Twisted Samurai\"? That's Prosecutor Blackquill!\nApollo:\nThe \"Twisted Samurai\"...? Is that because he's a criminal?\nFulbright:\nWell... Yes and no. You could say it also has to do with the effect his crime had on things.\nApollo:\nHow so...?\nFulbright:\nHis conviction is what twisted and warped the legal world into this dark age of the law.\nApollo:\nWhat?! And HE of all people is going to stand in court tomorrow?!\nFulbright:\nHa ha ha! Never fear! I myself will be there to protect you!\nApollo:\n......... (That's reassuring, I guess...)\nFulbright:\nWell, you kids knock yourselves out! Can't wait to see how you do tomorrow!\nAthena:\nWait, Detective Fulbright. I've been meaning to ask you something. Um... Why are you barefoot? This doesn't look like the sort of place where you need to take your shoes off...\nFulbright:\nHm? Ah! Ahhhhhh! I hadn't even noticed. Why AM I barefoot?\nApollo:\n(You honestly hadn't noticed until just now?!) .........Wait a second. Those shoes we found earlier... Excuse me, Detective Fulbright. These wouldn't happen to be your shoes, would they?\nFulbright:\nYes! Yes they are! My favorite pair, in fact! Thank you for bringing them to me. You must truly be on the side of justice!\nApollo:\n(Don't tell me Mr. Filch actually stole from a detective?)\nAthena:\nStealing shoes right off of someone's feet... That's pretty amazing.\nApollo:\nI find it more amazing that Detective Fulbright didn't notice. (Well, looks like we've gotten all we can out of the detective, so let's see... Maybe we should go have a word with Mr. Filch. I want to hear what his \"alibi\" is.)\nApril 17Kyubi Manor - Foyer\nFilch:\nThis is just awful! T-Terrible, I say! S-Somebody, help!\nAthena:\nOh, look, it's mister-- what was it again? Finch?\nFilch:\nNo, no, no! The name's Filch, Phineas Filch!\nApollo:\n(Keep on pilfering and you may wind up a jail bird instead.) So what seems to be the problem, Mr. Filch?\nFilch:\nOh, it's just terrible! Terrible, I tell ya! Come quick!\nApollo:\nO-Okay...? (What's the deal with him all of a sudden?)\nApollo:\nLooks like some kind of mask.\nFilch:\nI-It's The Amazing Nine-Tails's mask!\nApollo:\nThe Amazing Nine-Tails...? (Oh, right -- the wrestler who appeared during the festival's special event...) What's his mask doing here?\nFilch:\nHe'd never take off his mask like this! Someone musta killed 'im!\nApollo:\nWhaaa--?! Wh-Who would do such a thing?\nAthena:\nLet's go talk over there in private.\nApollo:\nHm? Look... There's some white hair caught up inside this mask...\nAmazing Nine-Tails Mask added to the Court Record.\nApollo:\nSo, what makes you believe that The Amazing Nine-Tails has been murdered?\nFilch:\nYa really wanna know, eh? You're a studious one, ain't ya! Eh heh he!\nApollo:\nYes, I mean, no. Er, I mean, just tell me, please.\nFilch:\nWell, it's like this. I'd dreamed o' becoming a wrassler myself! Hey, how 'bout ya join me in the quest for the champion's belt?! Whadda team! Me in my bandit's mask and you in that demon mask of yours!\nApollo:\nDemon mask? Heh heh. Wonder if I could make it big.\nAthena:\nApollo, let's save your pro wrestling debut until after the trial.\nApollo:\nHuh?! Oh, no no! I wasn't actually... (Argh! Why did I let him pull me off topic like that?!)\nAthena:\nCome on, Apollo -- ask him about The Amazing Nine-Tails's murder already!\nTalk\nThe Amazing Nine-Tails\nFilch:\nThe Amazing Nine-Tails is our village's savior, and don't ya forget it! His trademark's a gold cape made to look like nine fox tails! He whirls through the ring, smacking down Tenma Town wrestlers left 'n' right! He sparked the monster craze, revitalizing Nine-Tales [sic] Vale in the blink of an eye. Yep, saved our village from becoming a ghost town. Now it's a yokai town, eh heh heh.\nApollo:\nHuh, The Amazing Nine-Tails really does sound, well... amazing.\nFilch:\nYeah, pretty amazing, huh? That's why he's worshipped like a hero 'round here! I'm proud to be from the same village as him.\nAthena:\nCome to think of it, you look kind of monster-like yourself, Mr. Filch. Guess it makes sense since you're from the same village as The Amazing Nine-Tails!\nFilch:\nEh heh heh... I know! A lot o' people have told me I look like a yokai.\nApollo:\n(Since when was that a compliment?) Ouch! What's the big idea!\nFilch:\nEh heh heh... Check your pocket.\nApollo:\nHey, how'd you do that?!\nFilch:\nKeep it. I got lots more.\nAmazing Nine-Tails Glossy added to the Court Record.\nApollo:\nSo, you keep saying that the Amazing Nine-Tails was killed. What's the story behind that?\nThe Amazing Nine-Tails (subsequent times)\nFilch:\nThe Amazing Nine-Tails is our village's savior, and don't ya forget it! His trademark's a gold cape made to look like nine fox tails! He whirls through the ring, smacking down Tenma Town wrestlers left 'n' right! He sparked the monster craze, revitalizing Nine-Tales [sic] Vale in the blink of an eye. Yep, saved our village from becoming a ghost town. Now it's a yokai town, eh heh heh.\nApollo:\nHuh, The Amazing Nine-Tails really does sound, well... amazing.\nFilch:\nYeah, pretty amazing, huh? That's why he's worshipped like a hero 'round here! I'm proud to be from the same village as him.\nAthena:\nCome to think of it, you look kind of monster-like yourself, Mr. Filch. Guess it makes sense since you're from the same village as The Amazing Nine-Tails!\nFilch:\nEh heh heh... I know! A lot o' people have told me I look like a yokai.\nApollo:\n(Since when was that a compliment?)\nAmazing Nine-Tails's Death (appears after \"The Amazing Nine-Tails\")\nApollo:\nAre you saying he was murdered because his mask washed up along the river outside?\nFilch:\nThat's only part o' it. The main reason is no one's seen 'im since the special event. The word 'round Nine-Tails Vale is he was killed by Tenma Taro.\nApollo:\nYou villagers really are superstitious, aren't you?\nFilch:\nThat we are. We love conspiracy theories, too, like the mayor's diabolical plot.\nApollo:\nThe mayor? Of Tenma Town? What is he plotting?\nFilch:\nRumor has it he's planning on releasing Tenma Taro. That's why he wants the merger. He'll open the Forbidden Chamber once he's in control.\nApollo:\nThat's quite a tale.\nFilch:\nAin't finished yet! There was only one person who could stop the mayor. Our hero, The Amazing Nine-Tails! He vowed to battle the mayor of Tenma Town and stop the municipal merger!\nApollo:\n......... (I couldn't make this stuff up if I tried.)\nAthena:\nApollo! We still have to ask him about the alderman's murder, remember?\nAbout the alderman's murder (appears after \"Amazing Nine-Tails's Death\")\nApollo:\nMr. Filch, would you mind telling us what you were doing at the time of the murder?\nFilch:\nI was in the caretaker's office guarding the entrance like Mr. Kyubi said I should. And I made double sure no one came in. I have a clear view of the foyer from where I work.\nApollo:\n(He must be talking about this small room in the upper right. It definitely looks like you can keep track of the comings and goings from there.) And you have an alibi to back your statement up, Mr. Filch?\nFilch:\nEh heh heh. I do, indeed! I was with Mayor Tenma's aide. Florent L'Belle's his name.\nApollo:\nSo, the two of you were together... That's a pretty sound alibi, all right. And nobody came in or out of the manor around the time of the murder?\nFilch:\nKept watch here the whole time. Didn't see a soul pass by. And if anyone did, that there security camera woulda spotted 'em.\nApollo:\n(So no one came in or out around the time of the murder... That means we're dealing with someone who was already inside when it happened.) So, do you think this mask is the real deal?\nFilch:\nWithout a doubt. This here's the mask worn by The Amazing Nine-Tails.\nApollo:\nWhat about that white hair I found inside the mask?\nAthena:\nWait! I just thought of something! Remember the golden animal fur we found at the crime scene? Could it have come from this mask? Look! There's even a spot where some fur is missing.\nApollo:\nHmm... Then this places this mask at the crime scene at some point in time. Which means......... (What does this mean? Someone with white hair who is linked with the murder and is against the merger? No way...! Could The Amazing Nine-Tails and the alderman actually be...?!)\nAthena:\nSomething wrong, Apollo? You should see the look on your face!\nApollo:\nOh, no, it's n-nothing. (Maybe Jinxie could tell us something, since she works here...)\nGolden Fur reattached to The Amazing Nine-Tails's mask.\nAbout the alderman's murder (subsequent times)\nApollo:\nMr. Filch, would you mind telling us what you were doing at the time of the murder?\nFilch:\nI was in the caretaker's office guarding the entrance like Mr. Kyubi said I should. And I made double sure no one came in. I have a clear view of the foyer from where I work.\nApollo:\n(He must be talking about this small room in the upper right. It definitely looks like you can keep track of the comings and goings from there.) And you have an alibi to back your statement up, Mr. Filch?\nFilch:\nEh heh heh. I do, indeed! I was with Mayor Tenma's aide. Florent L'Belle's his name.\nApollo:\nSo, the two of you were together... That's a pretty sound alibi, all right. And nobody came in or out of the manor around the time of the murder?\nFilch:\nKept watch here the whole time. Didn't see a soul pass by. And if anyone did, that there security camera woulda spotted 'em.\nApollo:\n(So no one came in or out around the time of the murder... That means we're dealing with someone who was already inside when it happened.)\nPresent\nAmazing Nine-Tails's Mask\nFilch:\nHey, that there's The Amazing Nine-Tails's mask! Yer aiming to sell it, aint ya?! Why you sneaky, lily-livered--\nApollo:\nNo, I'm not trying to sell it. It could be a key piece of evidence.\nFilch:\nAw, too bad. Thought I'd hook ya up with this buyer I know.\nApollo:\nWait, you WANT me to sell it?!\nAnything else\nApollo:\nYou mind if I ask you about this?\nFilch:\nHm? Oh, that... Right, right...\nApollo:\nWell, does it ring a bell?\nFilch:\nEh heh heh heh... Oh, it's ringing, all right. Ya wanna thank me for all my hard work, and I humbly accept!\nApollo:\nNo, this isn't a gift! (Should've known this was a dead end.)\nKyubi Manor Garden or Detention Center\nTalk\nAny ideas?\nApollo:\nCome up with anything yet?\nAthena:\nOh! O-Of course I have! But it's not quite ready for primetime.\nApollo:\nHuh?\nAthena:\nThe truth will only be revealed once we've dotted all our i's and crossed all our t's. In other words, it's still just a theory, so I don't think I should say anything yet. It's the dilemma any great detective must face!\nWidget:\nWhatever!\nAthena:\nTsk! Widget!\nApollo:\n(So basically, you have no ideas. Thanks for nothing.)\nAbout the murder\nApollo:\nWhat are your thoughts on the case so far?\nAthena:\nWell... I think our killer is most likely highly intelligent and stone-cold cool. I mean, just look how they killed the alderman: one decisive thrust, no hesitation.\nApollo:\nAnd you know this how? Psychology?\nAthena:\nThat's right! I've profiled the killer based on the evidence we found at the scene! I can almost picture the killer in my mind... A terrifying face twisted from hatred toward the victim... Big, bulging eyes full of murderous intent... A horrible gash-like mouth from ear to ear... And... wings, black and sinister.\nApollo:\nWings? That sounds like Tenma Taro!\nAthena:\nOn second thought, scratch psychology. That last part was just my imagination.\nApollo:\nYou think?!\nPresent\nAmazing Nine-Tails's Mask\nAthena:\nSo who do you think is the man behind The Amazing Nine-Tails mask?\nApollo:\nWell, there was that white hair we found inside the mask. I have a feeling it's going to be a valuable clue.\nAthena:\nWe should run a DNA test on it. Ooh! And what if the results show that the hair's not human? Don't you think it's fun to fantasize about stuff like that?\nApollo:\nSure, as long as you're prepared to have that fantasy shattered by the results, too.\nAthena:\nIn that case, let's forget about the DNA testing!\nAfter clearing \"About the alderman's murder\" Talk option in Kyubi Manor - Foyer:\nApril 17Nine-Tails Vale - Yokai Lane\nApollo:\nOh, look, there's Jinxie.\nJinxie:\nMilk, cheese, yogurt, ice cream, and...\nApollo:\n(Sounds like she's out grocery shopping. She must really like dairy products.)\nJinxie:\n...a charm to make a better milkshake and another to cure my lactose intolerance.\nApollo:\n(Maybe she should just stick to soy milk.) Jinxie! Hey, it's me!\nJinxie:\nEek! It's th-th-the demon lawyer!\nApollo:\nAck! (Not another warding charm... *sigh*)\nAthena:\nUm, Apollo? Who is she?\nApollo:\nOh, right. This is your first time meeting each other. This is Jinxie, Mayor Tenma's daughter. She was the first to discover the crime scene.\nAthena:\nOh, so she's the one who--! Um, hello. My name's Athena Cykes. I'll be helping Apollo defend your father at his trial. Pleased to meet you!\nJinxie:\nP-Pleased to meet you, too. Uhh... Um, where's Trucy?\nApollo:\nShe went back to the office ahead of us. But don't worry. Athena and I are on the case!\nJinxie:\nW-W-Wait, how do I know you didn't...! ...That you d-d-didn't gobble her up alive!\nApollo:\nRelax, I didn't eat her up! And I wouldn't do such a thing in the first place!\nJinxie:\nOh, poor little Trucy! *sniffle*\nApollo:\n(I'm about ready for some tears of frustration myself.)\nAthena:\nShe's quite an, um, interesting character, huh, Apollo...\nTalk\nThe incident\nApollo:\nJinxie, do you remember any more of what happened?\nJinxie:\nNot much. ...At least not yet.\nApollo:\nBut you do think Tenma Taro was the killer, right? That yokai we saw at the festival?\nJinxie:\nI don't know anything about that!\nApollo:\nHuh? But you said Tenma Taro murdered the alderman. ...It's okay, Jinxie. You can tell me-- Yikes! What was that for?!\nJinxie:\nPeople see things when they don't get enough sleep. There's no such thing as monsters.\nApollo:\nHuh?! (What's gotten into her?) So, if there are no monsters, you admit I'm human?\nJinxie:\nNo, you're still a demon!\nApollo:\n............ Oh, I give up.\nAthena:\nIt seems like Jinxie doesn't want to talk about Tenma Taro for some reason.\nApollo:\nBut that's precisely what we need to know more about... Besides, she definitely thought there was a yokai there in the Fox Chamber. Jinxie, about this charm...\nJinxie:\nAh! That's...!\nApollo:\nYou gave me this when I was heading off to the scene of the crime. You thought Tenma Taro was the murderer. That's why you gave this to me, right?\nJinxie:\nErrr... That's true, but...\nApollo:\nIf there's anything else you could tell us, it would really help. And it will help your father, too!\nJinxie:\nUmm... All right, then.\nTenma Taro did it? (appears after \"The incident\")\nApollo:\nWhy do you think Tenma Taro's the killer?\nJinxie:\nI saw him. Saw him with my own eyes. Tenma Taro was right there in the manor! He escaped his prison... ...and ran right by me!\nAthena:\nWhaaaaaat?!\nApollo:\nJinxie, tell us everything you saw!\nJinxie:\nI called the police after I stumbled on the scene. I was just about to head back to the festival grounds when... ...I saw Tenma Taro. It was right around here. He was running right at me! I was... I was paralyzed with fear. But there was no one around to help me. *shiver* The foul beast raced right by me toward the foyer.\nApollo:\nToward the foyer?\nAthena:\nMr. Filch and Mr. L'Belle were supposedly in the foyer at the time. That means they would've seen Tenma Taro, too.\nApollo:\nSounds like we'd better get their statements. (Considering Jinxie's mental state, her eyes could've been playing tricks on her.)\nAthena:\nUm... Apollo? Remember the picture in this paper? Someone caught Tenma Taro flying through the air. I wonder if it's the same Tenma Taro Jinxie says she saw.\nApollo:\n...Don't be ridiculous!\nJinxie:\n*shiver* Tenma Taro IS the killer. And he can fly, too.\nThe Amazing Nine-Tails\nApollo:\n(Jinxie works at the alderman's manor, so maybe she can shed some light on this.) So, no one knows The Amazing Nine-Tails's true identity?\nJinxie:\nUh-huh. They say no one's ever seen him without his mask.\nApollo:\nDoesn't that make you want to know even more?\nJinxie:\nUh-huh. That's why matches where wrestlers try to expose their opponent are so popular.\nApollo:\nWait... you mean expose, as in strip them naked?\nJinxie:\nEek! You even think like a demon! ...The only thing the winner removes is the loser's mask. To have your mask torn off is the worst humiliation a wrestler could suffer! That's why their masks are more important to them than life itself. So you see, these unmasking matches are life and death battles for the wrestlers.\nApollo:\n(That means this mask didn't just happen to wash up along the riverbank. There's got to be a story behind it.)\nJinxie:\nNo one can stop The Amazing Nine-Tails!\nApollo:\n(Bet she'd be shocked to find out he's really the alderman.)\nThe Tenma Taro you saw (appears after \"Tenma Taro did it?\")\nApollo:\nAbout the yokai you saw at the scene of the crime... Anything else stand out?\nJinxie:\nActually, I heard this strange jangly sound.\nAthena:\nA jangly sound? Can you be a little more specific?\nJinxie:\nMy memory's kind of fuzzy... But I vaguely recall seeing Tenma Taro holding a staff or something like that. Maybe that's what was making the strange sound.\nApollo:\nDoes Tenma Taro usually carry a staff?\nJinxie:\nGood question. I've never heard anything like that and it's not shown on the scroll.\nApollo:\nHow about in other documents? Any of them show Tenma Taro with a staff?\nJinxie:\nThis is the only known document depicting Tenma Taro. After all, those who needlessly depict the demon are forever cursed. (Changed from [After all, those who needless [sic] depict the demon are forever cursed.] in the original release)\nApollo:\nThen what's the deal with the Tenma Taro you saw, Jinxie?\nYokai Legend Scroll updated in the Court Record.\nJinxie's Statement added to the Court Record.\nThe Tenma Taro you saw (subsequent times)\nApollo:\nAbout the yokai you saw at the scene of the crime... Anything else stand out?\nJinxie:\nActually, I heard this strange jangly sound.\nAthena:\nA jangly sound? Can you be a little more specific?\nJinxie:\nMy memory's kind of fuzzy... But I vaguely recall seeing Tenma Taro holding a staff or something like that. Maybe that's what was making the strange sound.\nApollo:\nDoes Tenma Taro usually carry a staff?\nJinxie:\nGood question. I've never heard anything like that and it's not shown on the scroll.\nApollo:\nHow about in other documents? Any of them show Tenma Taro with a staff?\nJinxie:\nThis is the only known document depicting Tenma Taro. After all, those who needlessly depict the demon are forever cursed. (Changed from [After all, those who needless [sic] depict the demon are forever cursed.] in the original release)\nApollo:\nThen what's the deal with the Tenma Taro you saw, Jinxie?\nPresent\nNine-Tails Flower\nJinxie:\nThe Nine-Tailed Fox is famous for imprisoning Tenma Taro, but legends say that he also... ...gave us the Nine-Tails Flower, and that he still watches over the village to this day.\nApollo:\nWow, coming here is like traveling to ancient Japan with all the strange beliefs and all. All those yokai, the Nine-Tails Flower, the Forbidden Chamber, and the list goes on.\nJinxie:\nUh-huh. It was like I should've been born here. Too bad the population is shrinking. But there's an effort underway to protect the yokai. It also helps the local economy.\nApollo:\nProtect the yokai? You mean like endangered species?\nJinxie:\nUh-huh. There're even plans to create a yokai wildlife park in the near future.\nApollo:\nNow I'm really starting to wonder about this place.\nCrime Photo\nApollo:\nJinxie, I wanted to show you this--\nAthena:\nWait, Apollo! You can't show that to her. Having her father arrested was bad enough.\nJinxie:\nHuh? Did you say something?\nApollo:\n(Maybe this wasn't such a good idea.) Oh, um, never mind.\nAmazing Nine-Tails's Mask\nApollo:\n(Wait, Jinxie's a huge fan of The Amazing Nine-Tails. She'd probably freak out if I showed her this mask without the guy in it.)\nAthena:\nWhat are you thinking?! It would crush her if she figured out her favorite wrestler is dead.\nApollo:\nGuess I'll spare her the grief, although she really could use a reality check.\nJinxie:\n?\nAmazing Nine-Tails Glossy\nJinxie:\nAh! Th-Th-That's The Amazing Nine-Tails! He... he lives in the mountains right outside the village. But he often comes to visit.\nApollo:\nReally? He doesn't sound very secret or reclusive to me.\nJinxie:\nNo, he's not. In fact, he visits the village bathhouse all the time.\nAthena:\nNo way! The Amazing Nine-Tails goes to public bathhouses?!\nJinxie:\nUh-huh. But like a true wrestling legend, he never takes his mask off.\nApollo:\nHe takes baths in his mask?\nJinxie:\nUh-huh. And he also has a towel that says, \"Wrestlers Wanted!\"\nApollo:\nIf I saw a naked guy in a mask and a message like that on his towel, I'd run the other way.\nJinxie's Statement\nJinxie:\nI saw... him... Tenma Taro. It nearly scared me to death.\nAthena:\nDo you see a lot of monsters, Jinxie?\nJinxie:\nUh-huh. *shivers* In fact, I encountered the Sunekosuri this morning. *shivers*\nApollo:\nSune... kosuri? You know, I don't know that one. Tell me about it.\nJinxie:\nIt's a mean little beast that trips you by bumping into your shins. I keep tripping all the time because of that pesky little thing! When it gets really bad, I stick Sunekosuri warding charms on my shins!\nApollo:\nUm, how about investing in some shin guards, and watching your step instead?\nAnything else\nJinxie:\nWhat's this? A Tsukumogami?\nApollo:\nTsukumo... gami?\nJinxie:\nA yokai that inhabits objects that have been used for a really long time. The Red Demon and a Tsukumogami... What a strange combination.\nApollo:\n(Is everything to her some supernatural phenomenon?)\nAfter clearing all Talk options:\nApollo:\nWhy didn't you tell me you saw Tenma Taro earlier?\nJinxie:\nActually... Mr. L'Belle told me not to tell.\nApollo:\nMr. L'Belle?\nJinxie:\nPapa's aide.\nApollo:\n(Oh, right. The other guy who was supposedly in the foyer at the time of the crime.) And what exactly did he tell you?\nJinxie:\n\"Keep the village superstitions in mind... ...before you go talking about seeing Tenma Taro at the time of the crime.\"\nApollo:\nVillage superstitions?\nJinxie:\nThey say you must not gaze upon Tenma Taro. But in the event that you do look... ...and then tell anyone what you saw, Tenma Taro will claim your soul.\nApollo:\nAnd that's something everyone here knows? (Sounds like a bunch of baloney to me.)\nJinxie:\nUh-huh. Everyone from babies to the village elders know about it. But I didn't because I'm not from around here.\nApollo:\nHey, come to think of it...\nApollo:\n(Huh? Why's everyone hiding their faces?)\nVillager:\nHey, you there! You mustn't stare at Tenma Taro like that! Lower your eyes! He'll steal your soul if you're not careful!\nApollo:\nHuh? (Steal my soul? Seriously?)\nApollo:\n(The guy at the special event thing said almost the exact same thing.)\nAthena:\nApollo, do you think this L'Belle guy actually believes in Tenma Taro?\nApollo:\nI seriously doubt it. He's not even from Nine-Tails Vale.\nAthena:\nThen why would he try to keep Jinxie from talking?\nApollo:\nGood question. I think we'd better go have a word with him.\nAthena:\nTime to unmask this monster of a mystery.\nJinxie:\nThe last time I saw Mr. L'Belle, he was relaxing in the foyer.\nAthena:\nBueno! Next stop, the manor foyer! With any luck, he'll be there waiting for us!\nApril 17Kyubi Manor - Foyer\nAthena:\nThere's no one here. Guess our luck isn't so good when it comes to Mr. L'Belle.\nApollo:\nMaybe he's out for a walk or something. (Hmm? Somebody left something on the sill of the caretaker's office window.) Oh, it's a TV program guide.\nAthena:\nLooks like someone circled a pro wrestling match.\nFilch:\nHey, whaddya think you're doing!\nAthena:\nEek! I-I-It's a...! Oh, Mr. Filch! Wh-What can we do for you?\nApollo:\n(I bet she was going to scream, \"Monster!\" which really isn't much of a stretch...)\nFilch:\nAin't nothing I need you to do for me. But what business do ya got with my TV listings?\nApollo:\nOh, no, it just caught my eye. Can I ask if you watched this pro wrestling program today?\nFilch:\nYep, 'twas a match between a couple o' rank amateurs, though. It was a complete disaster. I reckon even I coulda done better than that.\nApollo:\n(I seriously doubt that.)\nTV Listings added to the Court Record.\nApollo:\n(Almost forgot. There's something I wanted to ask him.) Mr. Filch, did you see anything unusual around the time of the murder? For example, Tenma Taro or something like that?\nFilch:\nHuh?! T-Tenma Taro?!\nApollo:\nSo you did see him?\nFilch:\nErrr... My, how clean and shiny your forehead is again today, Mr. Lawyer, sir! Bet ya shine it up every day real purty like. The ladies must love it, eh heh heh.\nApollo:\nDon't change the subject! And FYI, that was a seriously bad attempt at flattery. Jinxie said she saw Tenma Taro flee toward the foyer. So you must've seen him too if you were here!\nFilch:\nYi-Yi-Yiiiiiiiiipes!\nApollo:\n(Wow, I really pushed a button there!) Well, did you see anything or not?\n???:\n???:\nThat is quite enough. I must ask that you not pester my friend anymore.\nFilch:\nYipes! Forgive me for being pestered, sir!\nApollo:\nAnd you are?\n???:\nI am Florent L'Belle...\nL'Belle:\n...beau divine and PERSONAL aide to Mayor Damian Tenma.\nApollo:\n(Beau divine? More like yokai grotesque. This place is crawling with monsters.)\nL'Belle:\nOH! Excuse YOU!\nApollo:\nAck! Wh-What the heck was that for?!\nL'Belle:\nAh ha ha ha! It was just a little cologne. You had a look of stinky sweat about you. It's from my OWN original brand of cosmetics called \"Je suis L'Belle!\" *sniff sniff sniff* Oh, what a heavenly scent.\nApollo:\nUgh. I think you just paralyzed my olfactory receptors.\nL'Belle:\nAh ha ha ha! I suppose such a scent WOULD be difficult for a peasant to appreciate. I'll have you know, THAT is Brand No. 5 \"Bonjour.\" It's MY way of introducing myself. Enjoy!\nApollo:\n(Where's my bottle of \"Adieu\" so I can return the favor?) Enough about the cologne. Please tell us what you saw around the time of the murder.\nTalk\nKeeping Jinxie quiet\nApollo:\nI heard you're the one who told Jinxie not to mention that she saw Tenma Taro.\nL'Belle:\nWhy that little--! So, she told you she saw the demon, did she?\nAthena:\nMr. L'Belle, do you mind if I ask whether you believe in the village superstitions? (Changed from [Mr. L'Belle, do mind [sic] if I ask whether you believe in the village superstitions?] in the original release)\nL'Belle:\nAh ha ha ha! Oh, PU-LEASE! I was merely trying to keep with traditions. Nevertheless, I will say this... I wouldn't stick MY nose into this whole Tenma Taro business if I were you. Bad things happen to those who do. THAT much is true. He is one... scary... monster.\nApollo:\nThat's crazy! You really expect me to believe that monsters are real?\nL'Belle:\nAh ha ha ha! Well, YOU'RE real, and YOU sure look like a monster.\nApollo:\n(Look who's talking!) So, Mr. L'Belle, you didn't see Tenma Taro? Aaah!\nL'Belle:\nLittle Jinxie has an ACTIVE imagination. Isn't that right, Phineas?\nFilch:\nThat's right. I didn't see nothing, especially not Tenma Taro!\nL'Belle:\nAs for ME, I only see things of beauty. That's why I can barely see you. ...Pwh! Ah ha ha ha!\nApollo:\n(I've got two words for this guy: total freak.)\nYour alibi\nApollo:\nCould I ask you what you were doing at the time of the crime?\nL'Belle:\nIn other words, you'd like to hear MY alibi. Tsk, to think you'd suspect ME of all people!\nApollo:\nOh, no, it's just a formality. We ask everyone the same questions. Aaah!\nL'Belle:\nHow DARE you doubt me! That's an affront to beauty itself! You OBVIOUSLY can't see straight!\nApollo:\nUrnngh... Like that spritz really helped...!\nL'Belle:\nWhat were WE doing, you ask? Go ahead, Filchy, answer the question.\nFilch:\nErrr... At the time of the crime, we were... um... uh... in this here foyer!\nL'Belle:\nExactly! Good answer, Filchy, good answer!\nFilch:\nEh heh he. Just repeating whatcha told-- Youch!\nL'Belle:\nYou've said QUITE enough!\nApollo:\n(.........What is WITH these two? Great, now he's got me talking like that.)\nPresent\nTenma Taro Warding Charm\nL'Belle:\nYes? That's a warding charm, but why are YOU showing it to ME?\nApollo:\n............ (Guess it doesn't work on all monsters.) Yurk!\nL'Belle:\nShame on you, thinking THAT would work on ME!\nApollo:\nBlech!\nL'Belle:\nAh ha ha ha! You should be honored to be bathed in my beautiful scent, peasant!\nApollo:\nAck... (Now I really wish it would work.)\nAmazing Nine-Tails Glossy\nL'Belle:\nPffft, The Amazing Nine-Tails? What's so AMAZING about HIM? I mean, MY glossies are selling WAY better than his.\nApollo:\nYou sell glossies of yourself?\nL'Belle:\nThat's right. I have one for all seven of my hair colors!\nApollo:\n............ (Well, guess that's it. Civilization over.)\nL'Belle:\nTsk, if you WANT one, you need simply ask. I'll even let you choose the color yourself.\nApollo:\nNo, thank you!\nAnything else\nL'Belle:\nYes? Do you ALWAYS go around sticking your hand in OTHER people's faces?\nApollo:\nOh, no, I just wanted to show you this.\nL'Belle:\nAh, yes, you DO have something in that grimy paw of yours. But I only have eyes for things of beauty. Now, if you would excuse me.\nApollo:\n(Guess he'll only look at stuff that interests him.)\nAfter clearing all Talk options:\nL'Belle:\nAre we quite through here? I'm a VERY busy man, you know.\nApollo:\n...Right. Well, thanks for your help. (So, these two were in the foyer, but didn't see Tenma Taro.)\nL'Belle:\nCome along, Filchy.\nFilch:\nWhere we goin'? Oh, right! Gotta practice them statements for tomorrow! ...Yipes! My eyyyes!\nL'Belle:\nYou're going to dig your own grave with that big mouth of yours someday!\nApollo:\n......... (What does he mean, \"practice statements\"?)\nL'Belle:\nNow if you would excuse me, it's time to touch up my makeup. (Changed from [Now if would [sic] excuse me. It's time to touch up my makeup.] in the original release)\nAthena:\nApollo, I know this sounds strange... ...but Mr. L'Belle seems unusually preoccupied with Tenma Taro.\nApollo:\nReally? How can you tell?\nAthena:\nWell, it's kind of hard to explain. You see, I can read people's emotions from the tone of their voice.\nApollo:\nYou mean you have good ears?\nAthena:\nSomething like that. People's emotions are expressed in the tone of their voice. And my ears can pick up even the subtlest of tones for some reason.\nApollo:\nThat's an interesting skill... But what do you mean he's preoccupied with Tenma Taro?\nAthena:\nI'm not exactly sure, but it was like he was... obsessed with the thought of Tenma Taro... That's what I picked up from his voice, anyway.\nApollo:\nEverywhere we turn it's Tenma Taro this, Tenma Taro that. Hmm...\nAthena:\nWe should go talk to the mayor, too.\nApollo:\nSounds like a plan. (We need to get to the bottom of that rumor about him wanting to release Tenma Taro.)\nApril 17Detention Center - Visitor's Room\nAthena:\nSomething wrong, Apollo? Where did your enthusiasm go?\nApollo:\n(What am I doing asking the mayor if he has ever thought about releasing Tenma Taro?! At best, he'll think I'm an idiot. At worst... *shudder*)\nAthena:\nOh, he's here!\nTenma:\n.........\nAthena:\nIt's so nice to finally meet you! I'm Mr. Justice's partner, Athena Cykes! I'm looking forward to working with you, Mr. Tenma... Taro!\nTenma:\nHm?! ...Oh, yes. I look forward to working with you, too.\nApollo:\n(Eek! Glad he didn't mind Athena calling him by a completely wrong name!)\nAthena:\nApollo, he's just as kind and gentle-looking as I'd imagined!\nApollo:\n(Lucky for you, after that blunder you just made...) Um, there was something I wanted to talk to you about. There are rumors going around about how you want to or did set Tenma Taro free.\nTenma:\nWhat utter nonsense!\nApollo:\nYikes!\nTenma:\nThey always assume the worst of me because of the way I look! But those rumors don't have a shred of truth, I tell you!\nAthena:\nA little touchy about his appearance, isn't he?\nApollo:\n(What he really needs to work on are his people skills...)\nTalk\nTenma Taro's revival\nApollo:\nUm... So rumor has it that you want to push the merger through... ...in order to release Tenma Taro. Of course, that's a bunch of baloney, isn't it?\nTenma:\nGrrrrrr!\nApollo:\nAck! Sorry! Sorry! Sorry! Sorry if I offended you!\nTenma:\nSo, that's the talk around town, is it?!\nApollo:\nI can see how that would make you angry.\nTenma:\n.........What if Jinxie's schoolmates start teasing her about this?\nApollo:\nHuh?\nTenma:\nI must break out of here at once! Her tormentors must be taught a lesson!\nApollo:\nNo, wait! First, we have to get you a not-guilty verdict.\nTenma:\nDon't try to stop me! This is about a father's duty to his darling daughter. Hold tight, sweet Jinxie! Daddy's coming to save you!\nApollo:\nRelax! We'll look out for your daughter until we can get you free.\nTenma:\nHrmmm... Is that so? You don't need me to... go straighten things out myself?\nApollo:\n(Whoo boy... They'd probably call in the SWAT team if he showed up at her school. Oh, right. I ought to ask about the reason behind the merger.)\nWhy the merger? (appears after \"Tenma Taro's revival\")\nApollo:\nIt seems like you were rather forceful in pushing for the municipal merger. Did you really want Nine-Tails Vale that badly?\nTenma:\nYes, well, it's quite an attractive prize in terms of tourism.\nBRACELET THUMPS\nApollo:\n(Wait... Am I feeling what I think I'm feeling?)\nTenma:\nSure, I played a bit of hardball, but only when I deemed it necessary.\nApollo:\n(I knew it. My bracelet's reacting!)\nAthena:\nWhat is it, Apollo?\nApollo:\nMayor Tenma may not be telling the whole truth.\nAthena:\nReally? How can you tell?\nApollo:\nPeople invariably tense up when they lie. That's where my bracelet here comes in. I can sense when the person I'm talking to is feeling tense... ...because it begins to feel tight on my arm.\nAthena:\nNoooooo waaaaaay! You can do that?!\nApollo:\nWait, so you believe me? Just like that?\nAthena:\nSure. Each of us has our own special gifts.\nApollo:\n(Oh yeah. Athena has a gift, too: her special sense of hearing...)\nAthena:\nStill, what do you think the mayor's lying about?\nApollo:\nI don't know, but it's our job to find out. (It's been a while since my bracelet last reacted like this. Let's see if I still remember how to do this... First I touch my bracelet ([X / Y / R])... Right! Now let's give it a whirl!)\nPresent Bracelet\nYes, I remember this feeling of intense concentration! The ability to see the smallest twitch, the slightest frown that no one else can see... Now, Mayor Tenma was lying somewhere in that statement he just made. And when he lied, a certain \"habit\" made itself clear just under his right eye. I just have to shift my viewpoint up and focus on that area!\nPan to right eyelid\nLeads to:\n\"All right, I've got him now.\"\nApollo:\nAll right, I've got him now. His nervous tell should appear when he's trying to pull the wool over my eyes. (Changed from [His tic should appear when he's trying to pull the wool over my eyes.] in the original release) I've gotta pore over every word he says, and wait for it to appear. (Changed from [I've gotta pour [sic] over every word he says, and wait for his tic to appear.] in the original release) And when it does, I'll \"Perceive\" ([X / Y / R]) it!\nTenma:\nYes, well, it's quite an attractive prize in terms of tourism.\nPerceive right eyelid on \"in terms of tourism.\"\nApollo:\nLeads to:\n\"Mr. Mayor, please, you can trust us with the truth.\"\nPerceive wrong area\nApollo:\nApollo:\nSomething is upsetting you right now... Is that not correct?! I know because of that telltale habit of yours.\nTenma:\n.........\nApollo:\n.........Well? Ack!\nTenma:\n......... I get that often. Am I really that strange?\nApollo:\nOh, no, no. Th-That's not what I meant. I didn't mean to imply there was anything wrong with you!\nAthena:\nWell done, Apollo. Now both of you are upset!\nApollo:\n(Argh, let's try that again.)\nLeads back to presenting bracelet\nApollo:\nMr. Mayor, please, you can trust us with the truth.\nTenma:\nThe truth? I don't understand.\nApollo:\nWhen you mentioned tourism... ...the bottom of your right eye started twitching.\nTenma:\nWhat nonsense is this?! So what if it did?!\nApollo:\nPlease, tell us more about your merger bid.\nTenma:\nWhat more is there to tell?\nApollo:\nWhy were you really seeking to merge with Nine-Tails Vale?\nTenma:\nI already told you: tourism. The monster craze really revitalized the village, making it quite the prize.\nApollo:\nYou really don't trust us, do you?\nTenma:\nWhat are you talking about? The village has been hot property ever since the monster craze started, has it not?\nApollo:\nI think you've yet to realize that what you're saying contradicts the facts. You say that the monster craze really revitalized Nine-Tails Vale, so... ...you felt it would be an attractive prize for its tourism. But that would contradict this.\nPresent Amazing Nine-Tails Glossy\nApollo:\nLeads to:\n\"The monster craze in Nine-Tails Vale is a very recent phenomenon.\"\nPresent anything else\nApollo:\nApollo:\nThis evidence proves you're not being entirely truthful with us. Aaaack! S-Sorry, sorry! I take it all back!\nTenma:\n...Oh, forgive me. There was a fly that was driving me crazy.\nApollo:\nIf that's how he deals with flies, I'd hate to see him when he's really angry.\nTenma:\nSo, you think I'm not being entirely truthful?\nApollo:\nY-Yes... yes, sir. (This guy is seriously scary!)\nLeads back to:\n\"I think you've yet to realize that what you're saying contradicts the facts.\"\nApollo:\nThe monster craze in Nine-Tails Vale is a very recent phenomenon. It was sparked when The Amazing Nine-Tails rose up against the municipal merger. The village was practically a ghost town before then.\nTenma:\nArgh!\nApollo:\nSo, you see, you couldn't have possibly seen it as an attractive prize for its tourism. What's the REAL reason behind your push to merge Tenma Town with Nine-Tails Vale, huh?\nTenma:\nW-Well, umm... uhh... Ah... Ah... Arrrrrrrrrgh!\nWhy the merger? (after perceiving)\nApollo:\nAre you ready to tell me the truth now?\nTenma:\nHonesly, I never wanted to pursue the merger in the first place. But I had no choice if I wanted to protect my darling little Jinxie.\nApollo:\nProtect her from what?\nTenma:\nI received a threat. It said either I go through with the merger or my Jinxie dies.\nApollo:\nWhat?!\nAthena:\nHow awful! Who would do such a thing?\nTenma:\nI don't know. But whoever blackmailed me must be connected to the murder.\nApollo:\nWait, so you think the blackmailer and the killer could be one and the same?\nTenma:\nAlderman Kyubi was immensely popular, so you have to ask, who would want him dead? The blackmailer who wanted the merger at all costs had all the motive in the world.\nAthena:\nBut why go from blackmail to murder?! The merger protests won't disappear just because the alderman was killed.\nApollo:\nAh! (Could it be...!) What if there was another reason for the murder?\nAthena:\nLike what?\nApollo:\nMaybe the blackmailer discovered Alderman Kyubi's secret identity! And his secret identity was a threat to the blackmailer's merger scheme!\nAthena:\nWhat do secret identities have to do with anything, Apollo?\nApollo:\n(I have evidence revealing the alderman's secret identity. Maybe it's time to use it.)\nPresent\nCrime Photo\nApollo:\nUm... this is a photo of the crime scene. You didn't happen to see a yokai there, did you?\nTenma:\n...What in the world are you talking about?\nApollo:\nOh, no, I'm not saying I believe in monsters or anything, aha ha ha.\nTenma:\n.........\nApollo:\nI-I'm sorry!\nTenma:\n............... Hrmm...\nApollo:\nHeh heh... (Please, somebody let me out of here!) Ummm... so did you see one? You know, like, I don't know, Tenma Taro or... Never mind, just forget it, heh heh!\nTenma:\n............Huh... Huh huh... Huh.\nApollo:\n(Is he laughing at me, with me, or even laughing at all? It's kinda hard to tell.)\nAmazing Nine-Tails Mask (after clearing \"Why the merger?\" Talk option after perceiving)\nLeads to:\n\"Mayor Tenma, please take a look at this if you would.\"\nApollo:\nMayor Tenma, please take a look at this if you would.\nTenma:\nThat's...! That's The Amazing Nine-Tails's mask! What is the meaning of this?!\nApollo:\nThis mask was almost definitely at the crime scene. And there was some white hair inside.\nTenma:\nWhite hair... you say?\nApollo:\nThere was but one person with white hair in the manor that day.\nTenma:\nWha... What are you saying!?\nApollo:\nYou know which man I'm talking about, right? I'm talking about Rex Kyubi -- The Amazing Nine-Tails himself!\nAthena:\nNo way!\nTenma:\nThe alderman was--! Impossible!\nAthena:\nWait! Come to think of it, Alderman Kyubi WAS a former pro wrestler! So the blackmailer turned killer when he discovered the alderman's secret identity!\nApollo:\nUm, didn't I just say that? But yeah, The Amazing Nine-Tails was a threat to the blackmailer's scheme. He opposed the merger and as a result, single-handedly sparked the monster craze.\nAthena:\nEven so, what was the mask doing at the crime scene?\nApollo:\nThere had been an event at the manor... ...and maybe Alderman Kyubi had taken part in it... if you get my drift.\nTenma:\nThis is absurd!\nApollo:\nMr. Mayor, do you have proof of the threat that was made against you?\nTenma:\nYes, a blackmail letter. Unfortunately, it disappeared after the murder. I'd been carrying it around in my briefcase but now, it's suddenly vanished.\nApollo:\nThe blackmailer must've taken it with them after they killed the alderman. (Well, at least we've clearly established the killer's motive.) (Was not an inner monologue in the original release)\nGuard:\nMayor Tenma, visiting hours are over.\nTenma:\nIt would appear this meeting is adjourned.\nAthena:\n.........Apollo, do you really think the Tenma Taro that Jinxie saw is the killer?\nApollo:\nI don't know. All I know is there is no such thing as monsters.\nAthena:\nWhat about that newspaper article? Could the killer have purposely freed Tenma Taro to do their dirty work?\nApollo:\nOh, come on! There wasn't any Tenma Taro to release in the first place!\nAthena:\nYes, but the only suspects the police have right now are the mayor and a yokai.\nApollo:\n(We'll probably be arguing whether there was a yokai involved in court tomorrow.) *sigh* I can already see that look of disbelief on the judge's face.\nAthena:\nApollo? Are you all right?\nApollo:\nI'm fine! I'm fine! I'll, um... I'll think of something! (I'd better because I can't very well say a flying demon was the killer. At this point, the only thing I know for sure is tomorrow is going to be one doozy of a trial.)\nTo be continued (Changed from [To Be Continued] in the original release)\nNothing to examine during investigation\nApollo:\nNothing of particular interest here.\nArea already examined\nApollo:\n(We've already searched here, but it never hurts to take another look around.)",
  "characters": [
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Trucy Wright",
      "age": "• Age: 16",
      "description1": "An aspiring magician who Mr. Wright adopted when duty called."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Jinxie Tenma",
      "age": "• Age: 15",
      "description1": "The maid of Kyubi Manor and a friend of Trucy. She thinks I'm a demon."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "The Amazing Nine-Tails",
      "age": "• Age: ?",
      "description1": "A masked wrestler of unknown identity and origin. The nine-tailed cape he sports is the signature piece of his costume."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Damian Tenma",
      "age": "• Age: 45",
      "description1": "Jinxie's father and the mayor of Tenma Town. He was found unconscious at the scene of the crime."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Rex Kyubi",
      "age": "• Age: 46",
      "description1": "The deceased alderman of Nine-Tails Vale. His snow-white hair was particularly striking."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Athena Cykes",
      "age": "• Age: 18",
      "description1": "The latest lawyer to join our agency. She apparently studied psychology while she was in Europe!"
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Phineas Filch",
      "age": "• Age: 50",
      "description1": "The caretaker of Kyubi Manor. He says he was guarding the entrance at the time of the murder."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Bobby Fulbright",
      "age": "• Age: 33",
      "description1": "The detective investigating the murder in Nine-Tails Vale. He's a self-styled champion of justice and keeper of the peace."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Florent L'Belle",
      "age": "• Age: 33",
      "description1": "Mayor Tenma's aide. He was supposedly in the foyer with Filch at the time of the murder."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Phoenix Wright",
      "age": "• Age: 34",
      "description1": "A brilliant former defense attorney who is supposed to be in retirement..."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Simon Blackquill",
      "age": "• Age: 28",
      "description1": "A prosecutor and prison inmate. He has mastered the use of psychological manipulation in courtroom battles."
    }
  ],
  "evidences": [
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Attorney's Badge",
      "description1": "My cherished attorney's badge. Just putting it on makes me feel... ready."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Yokai Legend Scroll",
      "description1": "A scroll depicting the demon Tenma Taro and the Nine-Tailed Fox. [caption] Tenma Taro has black feathers, yellow talons. He does not wield any weapon.",
      "description2": "The sole document showing what Tenma Taro looks like. It seems those who foolishly choose to depict the demon are cursed."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Tenma Taro Warding Charm",
      "description1": "The Tenma Taro warding charm that Jinxie gave me when I set out for the scene of the crime."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Nine-Tails Flower",
      "description1": "A flower found only in Nine-Tails Vale. It boosts Jinxie's courage because it was her mother's favorite."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Special Edition Paper",
      "description1": "A newspaper with a photo of Tenma Taro soaring through the air."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Crime Scene Diagram",
      "description1": "A diagram showing the scene of the crime."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Foyer Diagram",
      "description1": "A diagram of the foyer, including the office used by the caretaker, Phineas Filch."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Fox and Demon Statue",
      "description1": "A statue that was at the crime scene. It depicts Tenma Taro and the Nine-Tailed Fox locked in battle.",
      "description2": "The weapon used to bludgeon the mayor. The mayor's blood was found on it, but no fingerprints could be lifted.",
      "description3": "The weapon used to bludgeon the mayor. Wrapped in a large cloth. (2 pages.)",
      "description4": "A token of goodwill made in secret. Jinxie is now the only one who knows what the original looked like."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Golden Fur",
      "description1": "Some fur that was found at the scene of the crime. It's long and soft, and appears to be from some animal."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Crime Photo",
      "description1": "A photo of the Fox Chamber. There are bloody footprints and black feathers scattered on top of the blood. [caption] The man in a beige suit is lying on a table with a spear inpaling him. The other man in a green suit is sitting in a sofa with blood on his head. Neither of them are wearing gloves."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Amazing Nine-Tails Mask",
      "description1": "A mask that washed up by the riverside. There's white hair inside.",
      "description2": "A mask found washed up by the riverside. It might have been at the crime scene. White hair inside."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Amazing Nine-Tails Glossy",
      "description1": "A photo of the hero who sparked the monster craze and saved Nine-Tails Vale from becoming a ghost town."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Jinxie's Statement",
      "description1": "Jinxie's eyewitness account of the demon in the hallway near the crime scene. She says it fled toward the foyer."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "TV Listings",
      "description1": "Filch's TV program guide. The afternoon wrestling match was a total disaster. [caption] At 3 PM, the program is \"Temma Town Pro Wrestling\". It is circled in red."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Kyubi's Autopsy Report",
      "description1": "Cause of death: Stabbed with a spear. Est. time of death: Around 3:20 PM. The victim had been in a drug-induced slumber."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Blackmail Letter",
      "description1": "A threatening letter discovered in one of Alderman Kyubi's pockets.",
      "description2": "The threatening letter sent to the mayor. It's highly likely that it was L'Belle who took it from the mayor's briefcase."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Village Superstitions",
      "description1": "Superstitions that have been handed down generation to generation in Nine-Tails Vale."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Forbidden Chamber Key",
      "description1": "The key that the mayor took from the killer and swallowed. No fingerprints could be lifted from it.",
      "description2": "The key that the mayor took from the killer and swallowed. There's only one of its kind."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Couleur Me L'Belle!",
      "description1": "Hair color that washes out with water. It's Florent L'Belle's own brand and isn't available to the general public."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Hand Cream",
      "description1": "An item that was dropped in the Forbidden Chamber. It bears the \"Je suis L'Belle\" logo."
    },
    {
      "currentChapter": "The Monstrous Turnabout",
      "name": "Forbidden Chamber Figure → Azuki Kozo Figure",
      "description1": "A figure that had been left inside the Tenma Taro statue. A thick layer of dust and dirt suggests it had been there for some time.",
      "description2": "A figure discovered inside the Tenma Taro statue. Apparently, it's something a certain thief leaves at the scene of a theft."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "Alderman Kyubi was murdered with a spear that had been on the wall.",
          "person": "Fulbright",
          "present": []
        },
        {
          "testimony": "The fingerprints of the defendant, Damian Tenma, were found on the murder weapon.",
          "person": "Fulbright",
          "present": []
        },
        {
          "testimony": "At the time, Alderman Kyubi was asleep from a drug he unwittingly ingested.",
          "person": "Fulbright",
          "present": []
        },
        {
          "testimony": "Mayor Tenma attacked his helpless victim, impaling him like a human shish kebob!",
          "person": "Fulbright",
          "present": []
        },
        {
          "testimony": "But the sudden pain jolted the victim awake, and he grabbed a statue and struck back!",
          "person": "Fulbright",
          "present": [
            "Fox and Demon Statue"
          ],
          "source": {
            "evidence_span": "but no fingerprints could be lifted",
            "testimony_span": "he grabbed a statue and struck back",
            "explanation": "Since ther was no footprint found on the statue and the alderman wasn't wearing gloves, he cannot have grabbed the statue.",
            "is_self_contained": "no",
            "context_span": "Neither of them are wearing gloves."
          }
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Fulbright is describing the murder where Alderman Kyubi was the victim and Mayor Tenma was the accused. We know from a photo of the crime scene that both men were injured, and none of them were wearing gloves.",
      "labels": [
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims the alderman grabbed a statue.",
        "Fact 2: The evidence suggests there was no fingerprint on the statue.",
        "Fact 3: The context suggests the alderman wasn't wearing gloves.",
        "Prop 1: If someone not wearing gloves grabs something, they leave fingerprints on it."
      ],
      "newContext": "The Monstrous Turnabout\n\n\n\n\n\n\n\n\n\nImage Gallery\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 4April 18, 9:15 AMDistrict Court - Defendant Lobby No. 3Apollo:\nYou okay, Athena? You've been really antsy ever since we got here.Athena:\nI-I'm just excited. This IS my first real court case after all!Apollo:\n(Yeaaah, a real ball of excitement she is... I know just what she needs.) ATHENA!!!Athena:\nEek! Didn't you ever learn about indoor and outdoor voices?Apollo:\nI'm just trying to show you the best way to relieve your pre-trial jitters.Athena:\nBy scaring the daylights out of me?Apollo:\nNo, I find that shouting \"I'm fine!\" in a loud voice really relieves stress. It's part of my \"Chords of Steel\" voice workout, and a must before every trial.Athena:\nY-You want me to shout? Here?Apollo:\nThat's right. Here, I'll go first, then you try. I'm Apollo Justice and I'm fine!!!Athena:\nAll right, um... I-I'm Athena Cykes... ...and I'm fine!!! ............Hmm... I think that actually worked!Apollo:\nI thought it might help. Always works for me. An old friend of mine from junior high and I say it all the time.Athena:\nI see... A proven remedy to calm the soul. I like it! Hey, how about we finish off with... ...a race around the courthouse!Apollo:\nThe point is to relieve stress, not get totally exhausted!Phoenix:\nWhat's with all the racket, you two?Apollo:\nAh, Mr. Wright. Heh heh, just a little voice workout. Hey, what's with the suit?Phoenix:\nOh, this? I was thinking about getting my attorney's badge back, that's all.Apollo:\nThat's all?! That's huge news! ...But why now?Phoenix:\nI have a feeling I'll be needed in the courtroom again sometime soon. But we can talk about that another time.Apollo:\n(No fair. Inquiring minds want to know. But wow... I'm so used to him in his usual laid-back clothes... That suit makes him look like a million dollars.)Phoenix:\nBy the way, have you heard about the prosecutor assigned to this case?Apollo:\nYeah, he's serving time, but before that, he was a prosecutor. He also uses psychology...?Phoenix:\nThat's right. I've heard the rumors about how he was back before his conviction. Using the power of suggestion, he could make even the most stalwart defendants confess.Apollo:\n(Psychology in the courtroom. Been hearing a lot about that lately.) So, he must be a pretty scary guy, considering he's a prison inmate and all.Phoenix:\nSo they say. They also say he'll cut you down if you talk too much.Apollo:\nAck! I knew he was gonna be bad news!Phoenix:\nHa ha ha, it's probably just hyperbole, at least I hope for your sake.Apollo:\nWait, so is it true or not?Phoenix:\nLet's just say you should be concise and choose your words carefully. ...If you'd like to keep that head of yours attached to the rest of your body, that is.Apollo:\nYikes! (Better tone down my Chords of Steel, too.)Phoenix:\nSo, are you all ready? It might be a good idea to check the Court Record again before stepping into the ring.Apollo:\n...Right, Mr. Wright! B-But I'm fine!Phoenix:\nI'll be watching from the gallery. Good luck!Apollo:\nThanks!Athena:\nOkay, let's do this!Apollo:\n(The odds of pulling this off are ridiculously low, but that's nothing new. Believe in our client. Seek the truth. That's all we can do. Hang in there, Mayor Tenma, here comes Justice!)April 18, 9:30 AMDistrict Court - Courtroom No. 4Day 1Court Is Now In SessionAll RiseJudge:\nCourt is now in session for the trial of Damian Tenma.Apollo:\nApollo Justice, defense team leader, is ready, Your Honor!Judge:\nI'd know that big, booming voice anywhere. As chipper as ever, eh, Mr. Justice? But who is the young lady next to you?Athena:\nI'm Athena Cykes, Mr. Justice's junior partner, and fresh out of law school!Judge:\nWell, now, full of beans, too, eh? Excellent! Makes an old man feel young again. Now for the prosecution. Hmm... It appears the prosecution is not ready yet.Fulbright:\nNever fear, for I shall explain! It's just a minor procedural complication, Your Honor. The prosecutor for this case is being escorted from prison as we speak.Judge:\nPrison? Oh, yes, of course. I almost forgot that he is currently serving time.Anime cutscene\nOfficer:\nYup, Prosecutor Blackquill's an inmate! But even a convicted murderer's still got a job to do and duties to perform.???:\n.........Apollo:\nUm... who's that with his back to us over there?Athena:\nThat's him. I'm sure of it. ...Prosecutor Blackquill.Judge:\n*ahem* Is the prosecution ready?Blackquill:\n...............Hmph. ......Enough jabbering. Get on with it already.Judge:\nAah! Of course, forgive me!Apollo:\n(Urngh! Why are all the people related to this case so scary?!)Judge:\nVery well, Prosecutor Blackquill. Your opening statement if you please. Aah! Wh-What's the matter?!Blackquill:\n......Must we continue to fritter away time like this? It is all right there in the indictment. An opening statement... would be pointless.Judge:\nPointless? Oh, um... well...Apollo:\nLooks like the cat -- or in this case, the prosecutor -- has the judge's tongue.Judge:\nBut, but... we need an opening statement as an overview of the case at hand.Blackquill:\nHmph. Well, then, Your Baldness, if it's so very important, why don't you do the honors?Judge:\nWho?! Me?!Blackquill:\nThere's a term for people who whine and fuss about how they need silly, useless things... ...and then decide they no longer want them once it's theirs: a selfish old fool.Judge:\nHuh?!Athena:\nWait, was that the prosecution's opening statement?Blackquill:\nHmph. Old dotards such as you are a plague upon the young. I pity your poor grandchildren, or is it great grandchildren?Judge:\n! All these years, I thought the opening statement was the prosecutor's job... ...but I suppose I could give it a try. Might be a nice change of pace. (Changed from [...but I suppose I could give it try. [sic] Might be a nice change of pace.] in the original release)Apollo:\nWhat?! (He actually fell for that?!)Athena:\nThat must've been the power of suggestion Mr. Wright was talking about.Judge:\n*ahem* The opening statement, huh... Hmm... Let's see here... The victim was one Rex Kyubi, alderman of Nine-Tails Vale. And the defendant, Damian Tenma, mayor of Tenma Town, is accused of his murder.Blackquill:\n...And why, pray tell, was the mayor arrested?Judge:\nHis prints were on the murder weapon. Plus, he had a motive: the elimination of the biggest roadblock to the municipal merger. The caretaker and the secretary, other potential suspects, both have alibis. And his daughter, who was also in the vicinity at the time of the incident, has no motive.Blackquill:\nSo, in a nutshell...?Judge:\nI'd have to say the charges against the defendant are incontrovertible.Blackquill:\nBravo, Your Baldness. Your years of experience shine bright like your head.Judge:\nHo ho ho. Flattery will get you everywhere.Athena:\nHe's playing Simon Says with the judge!Judge:\nMoving right along now, let's hear from our first witness for today, Detective Fulbright.Judge:\nWitness, please state your name and occupation.Fulbright:\nI am the detective assigned to this case, Bobby Fulbright! Oh, and I'll also be keeping tabs on old Blackquill here.Judge:\nI also heard you would provide protection if it ever came to that.Blackquill:\n............Hmph. It would seem that I have been sorely underestimated.Apollo:\n(Wait, who's protecting who from what?)Fulbright:\nStill, I truly believe anyone can turn their life around, even ol' Blackquill here.Blackquill:\nFool Bright! Save your platitudes for funerals. Get on with your statement.Fulbright:\nHa ha ha! That's the spirit! Justice must be swift and true. I see it in your eyes! There IS hope for your rehabilitation and return to society! I will never give up on you!Athena:\nProsecutor Blackquill doesn't seem to intimidate Detective Fulbright.Apollo:\nWell, you know what they say: ignorance is bliss.Athena:\nOh, so that's why Detective Fulbright was assigned to Blackquill. He's so oblivious!Judge:\nNow, let's have your first statement, Detective Fulbright.Fulbright:\nYou got it! But first, I'd like to say to the defense that justice will ultimately prevail!Witness Testimony-- About the Murder --Fulbright:\nAlderman Kyubi was murdered with a spear that had been on the wall.\nThe fingerprints of the defendant, Damian Tenma, were found on the murder weapon.\nAt the time, Alderman Kyubi was asleep from a drug he unwittingly ingested.\nMayor Tenma attacked his helpless victim, impaling him like a human shish kebob!\nBut the sudden pain jolted the victim awake, and he grabbed a statue and struck back!Apollo:\nAlderman Kyubi had been slipped some kind of sleep-inducing drug?Fulbright:\nThat's right. The accused was scared because the alderman was a former pro wrestler. So he slipped him a drug to make sure he'd be out cold and defenseless! Here's the autopsy report to prove it!Kyubi's Autopsy Report added to the Court Record.Judge:\nAnd the victim managed to attack his attacker, despite being impaled by a spear?! That sounds almost superhuman. Is it even possible?Fulbright:\nWell, he WAS a former pro wrestler, after all! That spear was probably nothing more than a mosquito bite to him!Apollo:Apollo:\nNot so fast! Don't try to brush it all off by saying the alderman had been a pro wrestler. Do you really expect us to believe he could fight back after being skewered by a spear?Blackquill:\nHmph. Never heard of the incredible feats of which man is capable of in a pinch, have you? Like the samurai of yore, wrestlers can battle through intense pain. It sharpens their senses. I used to talk about it with a former wrestler I met in the clink.Apollo:\nI dunno... It still sounds a little far-fetched.Blackquill:\nDoes it now? ......Then perhaps we should test the theory on you with the edge of my blade!Apollo:\n(I didn't sign up for this!)Blackquill:\n............Hmph. And so your life is spared... for now.Apollo:\n(Please let those shackles be made of titanium... I don't want to die.)Fulbright:\nHa ha! My investigations are as thorough as they are foolproof, or my name isn't Fulbright! I vow to resign immediately if I ever make a false arrest!Blackquill:\nThe accused's prints were on the weapon. And he's the one person without an alibi. Quite decisive evidence. Wouldn't you agree, Your Baldness?Judge:\nHmm... The defendant IS sounding guiltier by the minute.Apollo:\n(He has the judge leaning toward a guilty verdict, and the trial's just barely begun!)Blackquill:\nHmph. What's more, a curious rumor about the accused is making the rounds. They say he seeks the merger for the purpose of freeing Tenma Taro from his imprisonment. Truth be told, I can think of no real reason to show interest in that backwards burg. Perhaps he's a complete nutter and really does seek to release an imaginary demon. Either way, he is raving mad and more than capable of murdering the alderman.Man:That mayor is a strange one, all right. I heard he went to a blood drive, but instead of donating, he tried to make a withdrawal!Judge:\nOrder! There will be no gossiping in my court!Blackquill:\nYour Baldness. Please take a gander at those charms plastered around his cranium. I hear they're meant to keep him safe from possession by the demon Tenma Taro. Then again... Perhaps he's already under the demon's spell. Behold! The lunatic appears poised to lunge at you at any moment.Judge:\nEeeep!Athena:Athena:\nThe rumors and quirks of Mayor Tenma have no relevance to this case! Besides, those charms on his head... they're... they're just a fashion statement! ...I think.Judge:\nHmm... Come to think of it, such things don't seem relevant to the case, do they?Athena:\nThe prosecution will refrain from dragging our client's reputation through the mud!Blackquill:\nOh, what a dreadfully fearsome lass we have here.Apollo:\nWhew, thanks for that lifeline, Athena.Athena:\nCareful, Apollo. He has the judge dancing in the palm of his hand! The power of suggestion is one of the more powerful tools in Simon Blackquill's arsenal. He's trying to manipulate everyone's impressions to suit his objectives.Apollo:\n(This guy really is bad news.)Judge:\nIn any case, it seems the victim did manage to defend himself, despite being impaled. What sort of weapon did he used against his attacker?Fulbright:\nNone other than this statue right here!Judge:\nIt appears to be a statue of two strange creatures locked in battle.Blackquill:\nTwo yokai to be exact. On one side is the Nine-Tailed Fox and on the other Tenma Taro. Quite interesting if you think about it. It's as though this very case were rendered in art.Apollo:\nFox and Demon Statue updated in the Court Record.Judge:\nMr. Justice, you may proceed with your cross-examination.Cross ExaminationCross Examination-- About the Murder --Fulbright:\nAlderman Kyubi was murdered with a spear that had been on the wall.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo, those weapons on the wall of the Fox Chamber... I presume those are real? Don't you think keeping real weapons around like that is rather dangerous?\nFulbright:\nNo matter what he collected, the alderman insisted it be the real deal. For instance, he had a real demon's club in his possession. Apparently, one of his ancestors claimed it after defeating a demon in battle.\nApollo:\nWha--?! (That's got to be an old wives' tale.)\nFulbright:\nHa ha ha! The alderman had pure, unadulterated justice flowing in his veins! Whatever he did, he did it right! We've... lost a real champion of justice in his death!\nBlackquill:\nHmph. Nothing but claptrap and balderdash if you ask me. Now stop your bleating and tell us about the weapon.\nFulbright:\nYour wish is my command!Fulbright:\nThe fingerprints of the defendant, Damian Tenma, were found on the murder weapon.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nIt doesn't make sense, if you think about it. Prints could be easily wiped off.\nFulbright:\nHm. You do have a point there.\nBlackquill:\nI'd venture to say, he did NOT wipe off the prints because he COULD not.\nApollo:\nWhat do you mean?\nBlackquill:\n.........\nAthena:\nLooks like he wants YOU to figure it out. Well, don't just stand there! Show him who's boss!\nApollo:\n(I'm... totally lost... so why don't you just tell me the answer already?!)\nAthena:\nI don't think he saw that plea for help.\nFulbright:\nYou feeling all right, kid? Running a fever, perhaps?\nApollo:\n(I wish trials came with a reset button.)\nJudge:\nWell, the specifics may yet come to light. Please proceed, Detective Fulbright.Fulbright:\nAt the time, Alderman Kyubi was asleep from a drug he unwittingly ingested.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nCome to think of it, a coffee cup was found on the floor. Was the sedative in his coffee...?\nFulbright:\nBingo! We found traces of a sleeping agent all over the inside of the cup!\nBlackquill:\nAnd that is why he was out cold. That is until he leapt to his feet upon being impaled by the mayor.\nApollo:\nWhat an awful way to wake up.\nBlackquill:\nHeh. A rather stimulating eye opener if you ask me. I, too, would have risen to the attack, for to die in battle is the samurai way. Paradise awaits fallen heroes, but that hole in his stomach would make eating a challenge...\nFulbright:\nProsecutor Blackquill, please! Those morbid jokes of yours have no place in this court!\nBlackquill:\n............Hmph. Says the jester in detective's guise.\nFulbright:\nMoving right along...!Fulbright:\nMayor Tenma attacked his helpless victim, impaling him like a human shish kebob!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo, the alderman was drugged because he was really strong?\nFulbright:\nDid you see those rock hard muscles of his? I'm surprised the spear even managed to pierce that armor-like musculature! I admit, I'm completely jealous of that righteous body of his, ha ha ha!\nApollo:\nWell, he did look pretty buff, even in that suit he had on.\nBlackquill:\nQuite a difference when compared with a yellowbelly like you.\nApollo:\nYellowbelly? Who even says that anymore?\nAthena:\nYeah, and the color's all wrong, too......... Ooh, I know! How about a squishy red tomato!\nApollo:\nI move to strike both of your comments from the record!\nJudge:\nMr. Justice's character is not the issue here. Now, let's get back to what happened after the far more muscular alderman was impaled.\nFulbright:\nYes, well, your average person would likely have died on the spot.Fulbright:\nBut the sudden pain jolted the victim awake, and he grabbed a statue and struck back!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nCould he really have attacked his attacker after being impaled with that huge spear?\nFulbright:\nAbsolutely! After all, he was once a pro wrestler. The injustice of being drugged, then speared was answered with a righteous counterattack!\nApollo:\nBut does being a former pro wrestler make him superhuman?\nFulbright:\nAbsolutely! After all, he was one of the good guys, like a superhero on the side of justice. Even though he was retired, he could still don his superhero guise in times of need!\nApollo:\n\nApollo:\nYou need to lay off the comic books, detective! We're talking about real life here.\nBlackquill:\nSetting aside the halfwit's flights of fancy, the fact is this. The court-ordered post mortem concluded the victim moved after his skewering.\nApollo:\n(So, he found the strength somehow to attack his attacker, huh?)Present Fox and Demon Statue\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Did the alderman really strike the mayor?\"Athena:\nDetective Fulbright's testimony sounds airtight. No wonder he's so confident.Apollo:\nNo, he only thinks it's airtight. It's up to us to poke some holes in it. That part about the alderman fighting back sounds like a big hole waiting to be poked."
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "This entire case centers on one man's attempt to crush opposition to the municipal merger!",
          "person": "Fulbright",
          "present": []
        },
        {
          "testimony": "Mayor Tenma panicked when The Amazing Nine-Tails helped embolden the protestors.",
          "person": "Fulbright",
          "present": []
        },
        {
          "testimony": "So he stoked the villagers' fears by fabricating a monster!",
          "person": "Fulbright",
          "present": []
        },
        {
          "testimony": "The strange feathers and tracks he planted made it look like a yokai was the killer.",
          "person": "Fulbright",
          "present": []
        },
        {
          "testimony": "Mayor Tenma killed the sleeping alderman after planting the feathers and tracks.",
          "person": "Fulbright",
          "present": [
            "Crime Photo"
          ],
          "source": {
            "evidence_span": "black feathers scattered on top of the blood",
            "testimony_span": "Mayor Tenma killed the sleeping alderman after planting the feathers and tracks.",
            "explanation": "The feathers were found on top of the blood, so they must have been planted after.",
            "is_self_contained": "yes",
            "context_span": "",
            "isMultimodal": true
          }
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Fulbright is describing the murder where Alderman Kyubi was the victim and Mayor Tenma was the accused.",
      "labels": [
        "temporal",
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims the killing happened after the feathers were planted.",
        "Fact 2: The evidence suggests the feather is on top of the blood.",
        "Prop 1: If a solid is found on top of a liquid, the solid was placed after the liquid."
      ],
      "newContext": "-- About the Murder --Fulbright:\nAlderman Kyubi was murdered with a spear that had been on the wall.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo, those weapons on the wall of the Fox Chamber... I presume those are real? Don't you think keeping real weapons around like that is rather dangerous?\nFulbright:\nNo matter what he collected, the alderman insisted it be the real deal. For instance, he had a real demon's club in his possession. Apparently, one of his ancestors claimed it after defeating a demon in battle.\nApollo:\nWha--?! (That's got to be an old wives' tale.)\nFulbright:\nHa ha ha! The alderman had pure, unadulterated justice flowing in his veins! Whatever he did, he did it right! We've... lost a real champion of justice in his death!\nBlackquill:\nHmph. Nothing but claptrap and balderdash if you ask me. Now stop your bleating and tell us about the weapon.\nFulbright:\nYour wish is my command!Fulbright:\nThe fingerprints of the defendant, Damian Tenma, were found on the murder weapon.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nIt doesn't make sense, if you think about it. Prints could be easily wiped off.\nFulbright:\nHm. You do have a point there.\nBlackquill:\nI'd venture to say, he did NOT wipe off the prints because he COULD not.\nApollo:\nWhat do you mean?\nBlackquill:\n.........\nAthena:\nLooks like he wants YOU to figure it out. Well, don't just stand there! Show him who's boss!\nApollo:\n(I'm... totally lost... so why don't you just tell me the answer already?!)\nAthena:\nI don't think he saw that plea for help.\nFulbright:\nYou feeling all right, kid? Running a fever, perhaps?\nApollo:\n(I wish trials came with a reset button.)\nJudge:\nWell, the specifics may yet come to light. Please proceed, Detective Fulbright.Fulbright:\nAt the time, Alderman Kyubi was asleep from a drug he unwittingly ingested.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nCome to think of it, a coffee cup was found on the floor. Was the sedative in his coffee...?\nFulbright:\nBingo! We found traces of a sleeping agent all over the inside of the cup!\nBlackquill:\nAnd that is why he was out cold. That is until he leapt to his feet upon being impaled by the mayor.\nApollo:\nWhat an awful way to wake up.\nBlackquill:\nHeh. A rather stimulating eye opener if you ask me. I, too, would have risen to the attack, for to die in battle is the samurai way. Paradise awaits fallen heroes, but that hole in his stomach would make eating a challenge...\nFulbright:\nProsecutor Blackquill, please! Those morbid jokes of yours have no place in this court!\nBlackquill:\n............Hmph. Says the jester in detective's guise.\nFulbright:\nMoving right along...!Fulbright:\nMayor Tenma attacked his helpless victim, impaling him like a human shish kebob!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo, the alderman was drugged because he was really strong?\nFulbright:\nDid you see those rock hard muscles of his? I'm surprised the spear even managed to pierce that armor-like musculature! I admit, I'm completely jealous of that righteous body of his, ha ha ha!\nApollo:\nWell, he did look pretty buff, even in that suit he had on.\nBlackquill:\nQuite a difference when compared with a yellowbelly like you.\nApollo:\nYellowbelly? Who even says that anymore?\nAthena:\nYeah, and the color's all wrong, too......... Ooh, I know! How about a squishy red tomato!\nApollo:\nI move to strike both of your comments from the record!\nJudge:\nMr. Justice's character is not the issue here. Now, let's get back to what happened after the far more muscular alderman was impaled.\nFulbright:\nYes, well, your average person would likely have died on the spot.Fulbright:\nBut the sudden pain jolted the victim awake, and he grabbed a statue and struck back!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nCould he really have attacked his attacker after being impaled with that huge spear?\nFulbright:\nAbsolutely! After all, he was once a pro wrestler. The injustice of being drugged, then speared was answered with a righteous counterattack!\nApollo:\nBut does being a former pro wrestler make him superhuman?\nFulbright:\nAbsolutely! After all, he was one of the good guys, like a superhero on the side of justice. Even though he was retired, he could still don his superhero guise in times of need!\nApollo:\n\nApollo:\nYou need to lay off the comic books, detective! We're talking about real life here.\nBlackquill:\nSetting aside the halfwit's flights of fancy, the fact is this. The court-ordered post mortem concluded the victim moved after his skewering.\nApollo:\n(So, he found the strength somehow to attack his attacker, huh?)Present Fox and Demon Statue\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Did the alderman really strike the mayor?\"Athena:\nDetective Fulbright's testimony sounds airtight. No wonder he's so confident.Apollo:\nNo, he only thinks it's airtight. It's up to us to poke some holes in it. That part about the alderman fighting back sounds like a big hole waiting to be poked.Apollo:\nDid the alderman really strike the mayor?Fulbright:\nWhat?! Are you questioning my sense of justice?!Apollo:\nYour so-called \"justice\" need to find itself a pair of legs to stand on. You claim the alderman struck back after the mayor put a spear through him. But the statue he supposedly used to defend himself creates a major hole in your theory.Judge:\nIt would appear that the defense has a counter-argument. Very well, let's hear what the defense thinks is odd about the detective's statue theory.Kyubi fought unarmed\n\n\n\n\n\n\n\nApollo:\nWell, the alderman was a former pro wrestler, so why would he even use it as a weapon? He could've defended himself with his bare hands! I mean, that's what pro wrestlers do!\nBlackquill:\nHmph. You've a lot of nerve... ...but will you raise an objection in the face of swift punishment as solicitors are wont to do?\nApollo:\nUm... Well... Not if I deserve it...?\nJudge:\nAnd you do! The defense will look before they leap next time! Is that understood?\nApollo:\nSorry, Your Honor! Can I try that again?\nLeads back to:\n\"Very well, let's hear what the defense thinks is odd about the detective's statue theory.\"There are no fingerprints\n\n\n\n\n\n\n\nLeads to:\n\"There are no fingerprints on this supposedly crucial piece of evidence.\"It's not broken\n\n\n\n\n\n\n\nApollo:\nIf the statue really was used as a weapon, why are there no signs of breakage?\nAthena:\nUm, Apollo? When was the last time you had your eyes examined? The statue is clearly broken. See the area around their hands?\nApollo:\nAh! Eh heh heh, guess I missed that.\nJudge:\nI'm afraid I can't let that one slide without a penalty.\nApollo:\nPlease, let me try that again! (Detective Fulbright claims that the alderman used the statue to attack the mayor. But there's a hole in his theory!)\nLeads back to:\n\"Very well, let's hear what the defense thinks is odd about the detective's statue theory.\"Apollo:\nThere are no fingerprints on this supposedly crucial piece of evidence. And if you look at the crime scene photo... ...you'll notice that the alderman isn't wearing gloves.Judge:\nYes, I believe he is quite gloveless indeed.Apollo:\nIf he touched the statue with his bare hands, he should've left some fingerprints! Detective Fulbright, you DID take that into account during your investigation, didn't you?Fulbright:\nArrrrrrgh! This can't be happening! D-D-Did I arrest the wrong maaaaan?!Athena:\nYou did it, Apollo! You knocked Detective Fulbright off his high horse!Apollo:\nWell, it's just one point in our favor.Athena:\nWho do you suppose clubbed the mayor if it wasn't the alderman?Apollo:\nHmm... Well, if it wasn't the alderman... ...that means someone else must've clubbed the mayor.Athena:\nYou mean there was a third party there in the Fox Chamber?Apollo:\nExactly! And this could be the big break we've been looking for!Judge:\nHmm... There does seem to be a hole in the prosecution's argument. Prosecutor Blackquill, would you care to respond to the defense's assertion?Blackquill:\nHmph.Apollo:\n(The least you could do is look at me while being dismissive.)Blackquill:\nYour mind is as dull as an unhoned blade, Justice-dono.Apollo:\nJustice... dono? (He's been watching too many samurai flicks.)Blackquill:\nIt will take far more than that to cut down Simon Blackquill. A whelp such as you has no hope against my superior swordsmanship.Apollo:\nThis is a trial, not a swordfight, Prosecutor Blackquill!Blackquill:\nHmph. There is a perfectly good explanation for the lack of prints on the statue. You might recall that bloodstained cloth found at the scene of the crime. Well, it just so happens... that the blood was the mayor's.Apollo:\nSo, um... what are you getting at?Blackquill:\nHone your mind, boy! Why was there blood on that cloth? Solve that riddle and you shall see that the hole you thought you found is but an illusion.Apollo:\nNow let's see... How was that cloth used...? Was it used...By Kyubi as a head covering\n\n\n\n\n\n\n\nApollo:\nThe alderman was probably wearing it over his head.\nAthena:\nWha--?!\nBlackquill:\nDo you truly think the alderman would show up to a meeting over the fate of his village... ...wearing this ridiculous-looking cloth over his head?\nApollo:\nSure. They had a festival that day, didn't they? Who's to say he didn't party a little too hard and just forgot to take it off?!\nBlackquill:\n...............\nJudge:\n...............\nApollo:\nOkay, fine. So maybe he didn't do that... Can I try one more time?\nLeads back to:\n\"Now let's see... How was that cloth used...? Was it used...\"To wipe up blood\n\n\n\n\n\n\n\nApollo:\nMaybe the cloth was used to wipe as much of the mayor's blood as possible off the statue. And in the process, the culprit inadvertently erased the alderman's fingerprints as well.\nBlackquill:\n\nBlackquill:\nBut the mayor did not bother to wipe away his own fingerprints on the murder weapon. Why would he wipe down one weapon but not the other? Careful, now. Use what little brains you have left before you speak.\nApollo:\nGimme a do-over on that one! Please!\nLeads back to:\n\"Now let's see... How was that cloth used...? Was it used...\"To wrap the statue\n\n\n\n\n\n\n\nLeads to:\n\"Maybe the alderman wrapped the statue in the cloth.\"Apollo:\nMaybe the alderman wrapped the statue in the cloth. In short, he wasn't touching the statue directly when he used it to strike back at the mayor. Ah!Blackquill:\n...Precisely. Bully for you, boy.Apollo:\nAw, it was nothing.Athena:\nApollo, don't let him start manipulating you, too! You just closed the hole for the prosecution!Apollo:\nI did? ............Ack, I did!Blackquill:\nRight. That a statue wrapped in cloth would leave no fingerprints is as plain as day. But this also proves there are no holes in our theory of the alderman striking back.Apollo:\n.........Oops. Arrrrrrrrrgh!Fox and Demon Statue updated in the Court Record.Blackquill:\nNow do you see how dull your mind is?Apollo:\nI'll make sure to sharpen it next time.Blackquill:\nA particularly frightening inmate once told me that... ...he always tenderly honed his blades before he went to work, like the samurai of yore.Judge:\nSamurai? Sounds more like a homicidal maniac to me!Blackquill:\nActually, he was working in the prison kitchen at the time.Apollo:\n(Wait, so the inmate was a murdering samurai prison chef?)Judge:\nHmm... It would seem that the victim and his killer were the only ones there after all.Apollo:\n(I was kinda attached to that hole... Now what?)Athena:\nApollo, I just thought of something. If they didn't find anyone's fingerprints on the statue... ...who's to say someone other than the alderman didn't hit the mayor with it?Apollo:\nWhy didn't I think of that! Anybody could've NOT left prints on it!Blackquill:\nHmph. Then who, pray tell, struck the mayor with the statue? Please, illuminate us with your wisdom, young lady.Athena:\nThere's only one answer -- the real killer!Blackquill:\nProve the existence of this \"real killer\" then. What evidence have you?Athena:\nOh, I'll give you evidence, all right!Apollo:\nAthena, are you sure about this? (Changed from [Athena, are sure [sic] about this?] in the original release)Athena:\nTo borrow your words, Apollo, I'm fine! Take a look at this! Black feathers and tracks, allegedly from a yokai, were found at the scene. I believe they're from the third party who struck the mayor with that statue.Judge:\nIs the defense actually suggesting some sort of monster killed that alderman?!Athena:\nThat's exactly what I'm suggesting!Apollo:Apollo:\nNo, Athena! You just lost what little credibility we had left!Athena:\n.........Aah! Sorry, sorry! Guess I got carried away.Judge:\nMr. Justice, we've no time to deal with objections between members of the defense.Apollo:\nSorry, Your Honor. It's just, this kid's still, well, a kid...Athena:\nOuch... You meanie! I'm reporting this to Mr. Wright!Judge:\nSo, is this court to believe the feathers and tracks are from a \"yokai\" as you put it?Apollo:\nUhh, no, Your Honor. I believe they are a fabrication. The real killer wanted us to believe some sort of monster murdered the alderman.Judge:\nHmm, interesting. And why do you suppose the killer would do that?Apollo:\nUmm.... Why, indeed?Judge:\nMr. Justice, you seem as new to this as your partner is.Apollo:\nOuch... (This, I'm not reporting to Mr. Wright...)Blackquill:\nHoy, Fool Bright, explain to His Baldness what these brats are missing. You know, the who and why behind those feathers and tracks.Apollo:\nWha--?! (You mean you can explain all that?!)Fulbright:\nHa ha ha! Our investigative prowess is without equal!Apollo:\n(I'm starting to think I chose the wrong profession.)Judge:\nVery well, let's hear about these so-called yokai feathers and tracks.Witness Testimony-- Feathers and Tracks --Fulbright:\nThis entire case centers on one man's attempt to crush opposition to the municipal merger!\nMayor Tenma panicked when The Amazing Nine-Tails helped embolden the protestors.\nSo he stoked the villagers' fears by fabricating a monster!\nThe strange feathers and tracks he planted made it look like a yokai was the killer.Apollo:\nThose feathers and tracks stoked the villagers' fears? (Changed from [Those feathers and tracks stoked the villager's [sic] fears?] in the original release)Fulbright:\nAbsolutely! He knew exactly how to prey on their superstitious minds.Blackquill:\nThose feathers only gave weight to the idea that the alderman was slain by a demon. The accursed demon Tenma Taro, that is.Judge:\nTenma who?Blackquill:\nTenma Taro -- the legendary demon locked away in the village's Forbidden Chamber. From a young age, the villagers are taught to fear the great, black-feathered demon. And thus were they blinded to other, more plausible explanations.Apollo:Apollo:\nHold on for a second. Before we start letting our imaginations run wild... Isn't there someone else that could be considered a suspect?Judge:\nMr. Justice, please explain yourself.Apollo:\nOn the day of the incident, there was a special event held at Kyubi Manor. And as part of this event, there was someone dressed in the likeness of Tenma Taro. Obviously this person is a much more likely suspect than any legendary demon!Blackquill:Blackquill:\nDullard. You are playing right into the killer's mind games.Apollo:\nWhat?Blackquill:\nListen here. The feathers and tracks were merely red herrings. The villagers believe the murder to be the work of the real Tenma Taro. However, the police believe that the person in the Tenma Taro suit is the killer.Apollo:\nAhh!Blackquill:\nThe defendant sought to sow this confusion in order to deflect blame away from himself. However, he was knocked unconscious by the alderman... ...and thus our mentally deficient mayor was caught red-handed at the scene of the crime.Apollo:Apollo:\nDo you honestly believe Mayor Tenma would do something so stupid?!Blackquill:Blackquill:\nThe evidence speaks for itself. ...Fool Bright!Fulbright:\nRight. It was the mayor's last-ditch effort to stop the opposition before things got crazy. The Amazing Nine-Tails was fueling both the yokai craze and the anti-merger movement. Plus, he's one of the better-known masked wrestlers, and the hometown favorite. That's why the mayor panicked and set out on the path of injustice.Judge:\nBut do the people of Nine-Tails Vale really believe a yokai is behind the crime?Fulbright:\nYokai sightings are an everyday event there, so I wouldn't be surprised if they did.Judge:\nHmm... I must say... A crime that preys upon innocent, impressionable minds.Blackquill:\nJust so. A particularly silver-tongued inmate once had the following words for me. The innocent of heart are the easiest prey.Judge:\nYou don't say? Was this inmate a con artist?Blackquill:\n.........No. He was framed for the murder of his beloved. I actually felt sorry for the poor chap.Apollo:\n(Wait, so he wasn't the predator, but rather the prey?)Judge:\nYes, well... Now then, the defense may proceed with their cross-examination.Cross ExaminationCross Examination-- Feathers and Tracks --Fulbright:\nThis entire case centers on one man's attempt to crush opposition to the municipal merger!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nDetective Fulbright, is the anti-merger movement really that strong?\nFulbright:\nOh, absolutely! They parade around in yokai costumes shouting, \"Down with Mayor Tenma!\" And just the other day, they stormed Tenma City Hall, claiming it was a den of vipers!\nBlackquill:\nHmph. But when the accused showed his face... ...the angry mob scattered like leaves upon an autumn wind. For you see, lowly yokai are no match for Tenma Taro, the Dark Lord of their kind.\nAthena:\nWait, are the villagers scared of Mayor Tenma or Tenma Taro? I'm confused.\nApollo:\nI think he means Mayor Tenma. It's easy to get the wrong impression about the guy.\nJudge:\nDetective Fulbright, why do you suppose the defendant would commit such an act?Fulbright:\nMayor Tenma panicked when The Amazing Nine-Tails helped embolden the protestors.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThe Amazing Nine-Tails... No one knows his true identity, right?\nFulbright:\nThat's right. And he was a lone wolf, or in other words, he didn't belong to a wrestling federation. He appeared like a shooting star, defeating one Tenma Town wrestler after another. And before anyone knew it, he was a champion!\nBlackquill:\nLike the samurai of yore, surrounded thick with enemies, he cut them down one by one. It was a complete and utter loss of face for Tenma Town Pro Wrestling.\nFulbright:\nHe was amazing! If ever there was a real superhero, it would be him! I dream of becoming a true champion of justice like him someday!\nAthena:\nI bet Detective Fulbright would be a great pro wrestler. He could even team up with Prosecutor Blackquill.\nApollo:\nA police detective and a prisoner in chains? .........You know, I think people would actually pay to see that. I know I would.\nFulbright:\nHa ha ha. So you DO understand the greatness that is The Amazing Nine-Tails!Fulbright:\nSo he stoked the villagers' fears by fabricating a monster!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nDid the murder and yokai evidence really stoke the villagers' fears?\nFulbright:\nAbsolutely! It had an immediate effect! The presumed return of the dreaded Tenma Taro has them shaking in their boots!\nJudge:\nOh my, is it really that bad?!\nBlackquill:\nHmph, that superstitious lot? It's as if Jack the Ripper had been set loose in their village. The mere thought of that demon lurking about is enough to spark a mass exodus.\nJudge:\nI see... That's a very persuasive argument.\nApollo:\n(The mere thought of His Honor buying into Simon the Psycho-Slasher's words... ...makes me want to spark my own exodus out of the courtroom right about now.)\nFulbright:\nSo you see, there can be only one reason why anyone would plant those feathers and tracks!Fulbright:\nThe strange feathers and tracks he planted made it look like a yokai was the killer.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\n...But it doesn't add up. If what you say is true, why top it off with murder?\nFulbright:\nHm? What do you mean?\nApollo:\nYou claim that our client planted the yokai evidence to stoke the villagers' fears. If so, then why not stop there? Why murder Alderman Kyubi?\nJudge:\nHmm... Excellent point.\nApollo:\nIt is, isn't it! So, Your Honor agrees there was no reason for the murder, correct?!\nBlackquill:\n\nBlackquill:\nPerhaps the killing was on the spur of the moment. (Changed from [Perhaps the killing was spur of the moment.] in the original release)\nApollo:\nYou're saying it wasn't premeditated?\nBlackquill:\nFrom the outset, I had no intention of paying heed to any of your babble. However, the fact is, the mayor made a startling discovery.\nApollo:\nA startling discovery? (Why don't I like the sound of that?)\nBlackquill:\nAlderman Kyubi's secret identity.\nAthena:\nApollo... I think Prosecutor Blackquill has figured out the alderman's secret identity. But even if he has, why would it be a motive for the mayor to commit murder?\nApollo:\n(...This is not good!)\nBlackquill:\nThis patch of fur was discovered at the crime scene. It's from the mask worn by The Amazing Nine-Tails. Therefore, we can conclude that this mask was at the crime scene.\nJudge:\nOh, my. But why would it have been there?\nBlackquill:\nThe victim was a former pro wrestler and a member of the anti-merger movement. ...Need I say more?\nJudge:\nWell, um............ Ah! C-Could it really be?!\nBlackquill:\nHmph. Your Baldness has had an epiphany I see. Our victim, Rex Kyubi, was The Amazing Nine-Tails! And the mayor's discovery of such was his motive for murder!\nApollo:\nNoooooooooooooooooooooooooooooo!\nJudge:\nOrder! Order!!! What a shocking development. A motive clearer than crystal clear!\nAthena:\nWhat do we do now, Apollo?!\nApollo:\nI didn't think they'd tie the alderman's secret identity to the mayor's motive for murder!\nBlackquill:\nAt last we've reached my real point: why did the alderman have to forge a secret identity? Does it not pique your interest, Your Baldness?\nJudge:\nI admit it does... It IS odd that he had to create this other persona... ...just to secretly participate in the anti-merger movement.\nBlackquill:\nVery astute of you, Your Baldness.\nFulbright:\nRight, now take a look at this! If you value your dearest's life, you will merge Nine-Tails Vale with Tenma Town. This blackmail letter was found in Alderman Kyubi's pocket!\nApollo:\nWh-Wh-Whaaaaaat!!!\nBlackquill:\nAt present, the alderman's wife is in the hospital. And that letter is clear evidence the mayor was blackmailing him by threatening her life.\nAthena:\nWait, didn't the blackmail letter sent to Mayor Tenma go missing... ...right after the alderman's murder?\nApollo:\nYou think maybe the killer took the letter from the mayor after the murder... ...and planted it into the alderman's pocket?\nAthena:\nIt's possible... but we don't have any proof that that's what happened.\nApollo:\n(Talk about being up the creek without a paddle...)\nBlackmail Letter added to the Court Record.\nFulbright:\nMayor Tenma would've made a clean getaway if he'd just left after planting the yokai things. But he was knocked out cold by his sudden decision to kill The Amazing Nine-Tails!\nJudge:\nSo, it was The Amazing Nine-Tails's counterattack that brought the entire crime to light.\nApollo:\nWait a sec... (Fulbright's claiming that the mayor killed the alderman after planting the yokai evidence. And that the mayor was knocked out cold immediately after that?) Detective Fulbright, please add your previous statement to your testimony!\nAdds statement \"Mayor Tenma killed the sleeping alderman after planting the feathers and tracks.\"Press (subsequent times)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo, you're saying our client hadn't planned on killing the alderman?\nFulbright:\nThat's right. The motive only came after he discovered the alderman's secret identity!\nApollo:\nW-Well, I guess that does make sense.\nAthena:\nWhat do we do now, Apollo?!\nApollo:\nI didn't think they'd tie the alderman's secret identity to the mayor's motive for murder.\nFulbright:\nLet's get on with the testimony, shall we!Fulbright:\nMayor Tenma killed the sleeping alderman after planting the feathers and tracks.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo let me get this straight. You believe the mayor planted the yokai evidence before the murder, not after?\nFulbright:\nAbsolutely! And then he was knocked out cold by the alderman's last punch! He wouldn't have had a chance to plant the evidence after that!\nApollo:\n(Hmm... Something's not right here.)Present Crime Photo\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Detective Fulbright, your sense of justice is anything but fair!\"Apollo:\n(Hard to believe that a stiff, humorless man like the mayor could be behind such a stunt.)Athena:\nArgh... We have to do something, Apollo, before they pin it all on the mayor!Apollo:\nThen we're going to need to prove that Mayor Tenma didn't plant that yokai stuff.Athena:\nHow are we supposed to do that?"
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "At the time of the murder I was on guard duty in the foyer, just like Mr. Kyubi asked. (Changed from [At the time of the murder I was on guard duty in the foyer, just like Mr. Kyubi's [sic] asked.] in the original release)",
          "person": "Filch",
          "present": []
        },
        {
          "testimony": "I was making sure no one -- fair, foul, fishy, or otherwise -- could get to our guest.",
          "person": "Filch",
          "present": []
        },
        {
          "testimony": "I was still in my office keeping a good watch when the murder happened after 3 PM.",
          "person": "Filch",
          "present": [
            "TV Listings"
          ],
          "source": {
            "evidence_span": "At 3 PM, the program is \"Temma Town Pro Wrestling\".",
            "testimony_span": "I was still in my office keeping a good watch when the murder happened after 3 PM.",
            "explanation": "Since the witness watched the wrestling program at 3 PM, he could not have kept watch.",
            "is_self_contained": "no",
            "context_span": "Apollo:\nOh, no, it just caught my eye. Can I ask if you watched this pro wrestling program today?\nFilch:\nYep, 'twas a match between a couple o' rank amateurs, though. It was a complete disaster. I reckon even I coulda done better than that."
          }
        },
        {
          "testimony": "But I didn't see nothing outta the ordinary, no siree!",
          "person": "Filch",
          "present": []
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Filch describes his whereabouts at the time of the murder. Filch told Apollo that he watched the wrestling program at 3 PM and it was a complete disaster.",
      "labels": [
        "temporal",
        "behavioral"
      ],
      "reasoning": [
        "Fact 1: The witness claims he was keeping a good watch after 3 PM.",
        "Fact 2: The evidence suggests there is a wrestling program at 3 PM.",
        "Fact 3: The context suggests the witness watched the wrestling program at 3 PM.",
        "Prop 1: If a person is watching a TV program at some time, then they cannot be keeping watch at that time."
      ],
      "newContext": "-- Feathers and Tracks --Fulbright:\nThis entire case centers on one man's attempt to crush opposition to the municipal merger!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nDetective Fulbright, is the anti-merger movement really that strong?\nFulbright:\nOh, absolutely! They parade around in yokai costumes shouting, \"Down with Mayor Tenma!\" And just the other day, they stormed Tenma City Hall, claiming it was a den of vipers!\nBlackquill:\nHmph. But when the accused showed his face... ...the angry mob scattered like leaves upon an autumn wind. For you see, lowly yokai are no match for Tenma Taro, the Dark Lord of their kind.\nAthena:\nWait, are the villagers scared of Mayor Tenma or Tenma Taro? I'm confused.\nApollo:\nI think he means Mayor Tenma. It's easy to get the wrong impression about the guy.\nJudge:\nDetective Fulbright, why do you suppose the defendant would commit such an act?Fulbright:\nMayor Tenma panicked when The Amazing Nine-Tails helped embolden the protestors.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThe Amazing Nine-Tails... No one knows his true identity, right?\nFulbright:\nThat's right. And he was a lone wolf, or in other words, he didn't belong to a wrestling federation. He appeared like a shooting star, defeating one Tenma Town wrestler after another. And before anyone knew it, he was a champion!\nBlackquill:\nLike the samurai of yore, surrounded thick with enemies, he cut them down one by one. It was a complete and utter loss of face for Tenma Town Pro Wrestling.\nFulbright:\nHe was amazing! If ever there was a real superhero, it would be him! I dream of becoming a true champion of justice like him someday!\nAthena:\nI bet Detective Fulbright would be a great pro wrestler. He could even team up with Prosecutor Blackquill.\nApollo:\nA police detective and a prisoner in chains? .........You know, I think people would actually pay to see that. I know I would.\nFulbright:\nHa ha ha. So you DO understand the greatness that is The Amazing Nine-Tails!Fulbright:\nSo he stoked the villagers' fears by fabricating a monster!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nDid the murder and yokai evidence really stoke the villagers' fears?\nFulbright:\nAbsolutely! It had an immediate effect! The presumed return of the dreaded Tenma Taro has them shaking in their boots!\nJudge:\nOh my, is it really that bad?!\nBlackquill:\nHmph, that superstitious lot? It's as if Jack the Ripper had been set loose in their village. The mere thought of that demon lurking about is enough to spark a mass exodus.\nJudge:\nI see... That's a very persuasive argument.\nApollo:\n(The mere thought of His Honor buying into Simon the Psycho-Slasher's words... ...makes me want to spark my own exodus out of the courtroom right about now.)\nFulbright:\nSo you see, there can be only one reason why anyone would plant those feathers and tracks!Fulbright:\nThe strange feathers and tracks he planted made it look like a yokai was the killer.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\n...But it doesn't add up. If what you say is true, why top it off with murder?\nFulbright:\nHm? What do you mean?\nApollo:\nYou claim that our client planted the yokai evidence to stoke the villagers' fears. If so, then why not stop there? Why murder Alderman Kyubi?\nJudge:\nHmm... Excellent point.\nApollo:\nIt is, isn't it! So, Your Honor agrees there was no reason for the murder, correct?!\nBlackquill:\n\nBlackquill:\nPerhaps the killing was on the spur of the moment. (Changed from [Perhaps the killing was spur of the moment.] in the original release)\nApollo:\nYou're saying it wasn't premeditated?\nBlackquill:\nFrom the outset, I had no intention of paying heed to any of your babble. However, the fact is, the mayor made a startling discovery.\nApollo:\nA startling discovery? (Why don't I like the sound of that?)\nBlackquill:\nAlderman Kyubi's secret identity.\nAthena:\nApollo... I think Prosecutor Blackquill has figured out the alderman's secret identity. But even if he has, why would it be a motive for the mayor to commit murder?\nApollo:\n(...This is not good!)\nBlackquill:\nThis patch of fur was discovered at the crime scene. It's from the mask worn by The Amazing Nine-Tails. Therefore, we can conclude that this mask was at the crime scene.\nJudge:\nOh, my. But why would it have been there?\nBlackquill:\nThe victim was a former pro wrestler and a member of the anti-merger movement. ...Need I say more?\nJudge:\nWell, um............ Ah! C-Could it really be?!\nBlackquill:\nHmph. Your Baldness has had an epiphany I see. Our victim, Rex Kyubi, was The Amazing Nine-Tails! And the mayor's discovery of such was his motive for murder!\nApollo:\nNoooooooooooooooooooooooooooooo!\nJudge:\nOrder! Order!!! What a shocking development. A motive clearer than crystal clear!\nAthena:\nWhat do we do now, Apollo?!\nApollo:\nI didn't think they'd tie the alderman's secret identity to the mayor's motive for murder!\nBlackquill:\nAt last we've reached my real point: why did the alderman have to forge a secret identity? Does it not pique your interest, Your Baldness?\nJudge:\nI admit it does... It IS odd that he had to create this other persona... ...just to secretly participate in the anti-merger movement.\nBlackquill:\nVery astute of you, Your Baldness.\nFulbright:\nRight, now take a look at this! If you value your dearest's life, you will merge Nine-Tails Vale with Tenma Town. This blackmail letter was found in Alderman Kyubi's pocket!\nApollo:\nWh-Wh-Whaaaaaat!!!\nBlackquill:\nAt present, the alderman's wife is in the hospital. And that letter is clear evidence the mayor was blackmailing him by threatening her life.\nAthena:\nWait, didn't the blackmail letter sent to Mayor Tenma go missing... ...right after the alderman's murder?\nApollo:\nYou think maybe the killer took the letter from the mayor after the murder... ...and planted it into the alderman's pocket?\nAthena:\nIt's possible... but we don't have any proof that that's what happened.\nApollo:\n(Talk about being up the creek without a paddle...)\nBlackmail Letter added to the Court Record.\nFulbright:\nMayor Tenma would've made a clean getaway if he'd just left after planting the yokai things. But he was knocked out cold by his sudden decision to kill The Amazing Nine-Tails!\nJudge:\nSo, it was The Amazing Nine-Tails's counterattack that brought the entire crime to light.\nApollo:\nWait a sec... (Fulbright's claiming that the mayor killed the alderman after planting the yokai evidence. And that the mayor was knocked out cold immediately after that?) Detective Fulbright, please add your previous statement to your testimony!\nAdds statement \"Mayor Tenma killed the sleeping alderman after planting the feathers and tracks.\"Press (subsequent times)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo, you're saying our client hadn't planned on killing the alderman?\nFulbright:\nThat's right. The motive only came after he discovered the alderman's secret identity!\nApollo:\nW-Well, I guess that does make sense.\nAthena:\nWhat do we do now, Apollo?!\nApollo:\nI didn't think they'd tie the alderman's secret identity to the mayor's motive for murder.\nFulbright:\nLet's get on with the testimony, shall we!Fulbright:\nMayor Tenma killed the sleeping alderman after planting the feathers and tracks.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo let me get this straight. You believe the mayor planted the yokai evidence before the murder, not after?\nFulbright:\nAbsolutely! And then he was knocked out cold by the alderman's last punch! He wouldn't have had a chance to plant the evidence after that!\nApollo:\n(Hmm... Something's not right here.)Present Crime Photo\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Detective Fulbright, your sense of justice is anything but fair!\"Apollo:\n(Hard to believe that a stiff, humorless man like the mayor could be behind such a stunt.)Athena:\nArgh... We have to do something, Apollo, before they pin it all on the mayor!Apollo:\nThen we're going to need to prove that Mayor Tenma didn't plant that yokai stuff.Athena:\nHow are we supposed to do that?Apollo:\nDetective Fulbright, your sense of justice is anything but fair!Fulbright:\nWhat's this?! You are question my justice again?!Apollo:\nYes, and I'm going to prove it to you. Take a look at this photo.Judge:\nThis... is the crime scene photo. And just what does this prove?Apollo:\nIt proves when the feathers and tracks were planted.Fulbright:\nBut I already told you, they were planted before the murder! The defendant planted the yokai evidence, then was knocked out cold while killing his victim!Apollo:\nBut that would be impossible. If you look right here, it's clear when the feathers and tracks were left at the scene.Present tracks\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Aren't you just pointing to the yokai feathers and tracks, Mr. Justice?\"Present anywhere else\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThere's clearly something wrong... right around here.\nJudge:\nThe only thing clear to me is that the defense is barking up the wrong tree.\nBlackquill:\nHmph. Really up a tree now, aren't we?\nJudge:\nYes, and a stiff penalty should help you learn that correct assertions don't grow on them.\nApollo:\nUgh... I wonder if bandages do... (There is clearly something wrong with the assertion that... ...the feathers and tracks were there before the murder.)\nLeads back to:\n\"If you look right here, it's clear when the feathers and tracks were left at the scene.\"Judge:\nAren't you just pointing to the yokai feathers and tracks, Mr. Justice?Apollo:\nYes. See how the feathers are on top of the blood, and the tracks were made in blood? In other words, the yokai evidence could've only resulted AFTER the murder.Fulbright:\nTh-Then the mayor must've planted the evidence after killing the alderman!Apollo:\nBut you said it yourself, the mayor had been knocked unconscious thereafter. There would've been no time for him to plant any evidence at all! Therefore! There must've been someone else besides the mayor and the alderman at the crime scene!Fulbright:\nArrrrrrgh! There must be some mistake!Judge:\nOrder! Order!!!Fulbright:\nWh-Where's your evidence?! You can't possibly have any, can you?! Ha ha ha ha ha!Apollo:\nEvidence? Oh, I have evidence. In fact, I have an eye-witness's testimony for you.Fulbright:\nYou do?! But hooooow?! Was my vaunted sense of justice really just half-baked?Athena:\nHe's taking this really hard.Judge:\nHmm... Mr. Justice. What is this testimony regarding a third party that you claim to have?Apollo:\nI have it right here, Your Honor. It's the sworn testimony of Mr. Tenma's daughter. The witness, Jinxie Tenma, saw a yokai in the hallway after stumbling upon the scene. It was the demon Tenma Taro... He's the source of those feathers and tracks!Judge:\n.........Blackquill:\n.........Fulbright:\n..................Apollo:\n.........Will somebody please say something?Judge:\n...The defense will explain to the court exactly what he means.Fulbright:\nYou... You dare to mock this court and justice itself?! You're unfit to bear your name, boy!Blackquill:\nYou Baldness, it appears our defense attorney here is delirious from exhaustion.Athena:Athena:\nApollo! Think of something, quick, before you're held in contempt of court!Apollo:\nWhat do you think I'm trying to do?! Before you decide whether I should step down, please... hear me out...?Judge:\nVery well, Mr. Justice, I'm all ears. But you had better explain yourself well. What was this yokai you were talking about?Apollo:\nIt's all in this statement here -- Jinxie Tenma asserts that she saw Tenma Taro. After she discovered the crime scene and called the police... ...she came around a corner in the hall. It was around here... ...that she saw Tenma Taro fleeing toward the foyer! The defense asserts that whoever was impersonating this monster... ...is the one who left those feathers and tracks behind, intentionally or otherwise!Judge:\nWh-Whaaaaaat?!Fulbright:\nHow incredibly unjust! Why haven't I heard about this before?!Man:The defense just proved there was someone else!Woman:So the mayor isn't the killer?Man:Was it all just a set up? The prosecutor IS a convicted felon, after all.Athena:\nApollo! The momentum has shifted in our favor!Apollo:\nGood. Now let's keep it that way!Blackquill:Blackquill:\n............Hmph. Little do you realize... ...that though you are in the midst of a fray, your sword is broken.Apollo:\nMy sword? (I didn't know I had one to break.) Are you implying there's a problem with my claim?Blackquill:\nConsider this: if that yokai impersonator had indeed fled toward the foyer... ...that fool and that fop would have seen him.Apollo:\nFool and fop? Oh, you mean Filch and L'Belle. Hmm, now that you mention it...Blackquill:\nBoth Phineas Filch and Florent L'Belle were in the foyer at the time. But they haven't stated that they saw a yokai, have they? Did you ever consider that yokai was but a figment of a scared little girl's imagination?Apollo:\nArgh. Why DIDN'T those two see the Tenma Taro impersonator pass by?Athena:\nWhy don't we ask them ourselves?Apollo:\nI was just about to say that myself. No, really, I was! The defense would like to call Mr. Phineas Filch, caretaker of Kyubi Manor, to the stand! I just know he must have seen something!Judge:\nHmm... I suppose we can't ignore the fact that the little girl believes she saw a monster. I trust you have no objections to Mr. Justice's request, Prosecutor Blackquill? I understand that Mr. Filch is enjoying a nap out in the lobby.Blackquill:\nHmph. I knew that tanuki was a rare find. But when we captured him, I didn't think he'd end up a witness. Do with him as you will.Apollo:\n(D-Did he just say captured? No, wait. I don't want to know.)Judge:\nVery well, then. Bailiff, please go wake Mr. Filch and escort him to the witness stand.Judge:\nWill the witness state his name and occupation, please.Filch:\nThe name's Filch, Phineas Filch, caretaker of Kyubi Manor. Oh, and... This is for you, Your Lordship. Just a little something I though ya might like.Judge:\nOh, my, what a fabulous pair of shoes! And \"Your Honor\" will do just fine, Mr. Filch.Apollo:\n...Ah! It's those shoes again!Athena:\nUm... Don't they belong to Detective Fulbright?Apollo:\nDon't tell me Filch stole them again.Filch:\nThey're all yours, Your Honorship, sir.Judge:\nWhat?! But they seem awfully expensive.Filch:\nYep, too expensive for me, but I reckon they'd be perfect for someone like Your Honorship.Judge:\nHmm... It's a kind gesture, but legal ethics dictate I can't accept such gifts.Filch:\nAw, ethics smethics. Just take 'em if ya want 'em. Polished 'em up real nice for ya, too.Judge:\nI'm sorry about the shoes, Mr. Filch, but I WILL accept your testimony. The court would like to hear whether you saw Tenma Taro in the foyer after the murder.Witness Testimony-- Guarding the Foyer --Filch:\nAt the time of the murder I was on guard duty in the foyer, just like Mr. Kyubi asked. (Changed from [At the time of the murder I was on guard duty in the foyer, just like Mr. Kyubi's [sic] asked.] in the original release)\nI was making sure no one -- fair, foul, fishy, or otherwise -- could get to our guest.\nI was still in my office keeping a good watch when the murder happened after 3 PM.\nBut I didn't see nothing outta the ordinary, no siree!Blackquill:\nThat yokai you keep jabbering on about was but a phantom of a little girl's dreams.Apollo:\nSo, you're telling this court you never saw anyone dressed up like Tenma Taro?Filch:\nYep! Was guarding the whole time. That's the truth, the holy truth, 'n' nutter-butter the truth! And Tenma Taro? Bah, ya don't really believe in all that yokai mumbo jumbo, do ya? I certainly don't!BRACELET THUMPSApollo:\nHm? (My bracelet, it's...)Athena:\nSomething the matter, Apollo?Apollo:\nMy bracelet keeps squeezing my arm.Athena:\nReally? So you think Mr. Tanuki-- er, I mean, Filch has been lying to us?Apollo:\nI wouldn't rule it out. (Now, if I could just zero in on a tell -- some sort of nervous habit...)???:\n*Screech!*Apollo:\nA-Aaaaaaagh! What in the--?! (W-What's a hawk doing in here!?)Blackquill:\nAllow me to introduce my trusty cohort, Taka. He seems to have taken quite a liking to the courthouse. Made it his new home, in fact.Apollo:\n...He doesn't live with you... you know, in jail? (Who's ever heard of a courthouse bird?)Blackquill:\nTaka simply loathes trickery and fraud. And that queer power of yours seems to have offended my dear, bosom buzzard.Apollo:\nThis isn't some sort of trick or-- Aaaaaaaaaagh! (I won't be able to spot squat like this!)Filch:\nWh-What the heck's goin' on 'round here?! Run for the hills!Judge:\nN-No pets or other animals allowed in the courtroom!Taka:\n*Screech!*Judge:\nAck! Somebody help!Blackquill:\nOh, he's merely having a bit of sport. He won't harm you, save when truly famished.Judge:\nIn that case, Prosecutor Blackquill, you will ensure your feathered friend is properly fed.Athena:\nLooks like we have to do this the old-fashioned way.Apollo:\nWe'll be fine... I think. (If there was someone dressed as Tenma Taro there, Filch should've seen him. We'll just have to put our faith in Jinxie's statement for now.)Judge:\nMr. Justice, please proceed with your cross-examination.Cross ExaminationCross Examination-- Guarding the Foyer --Filch:\nAt the time of the murder I was on guard duty in the foyer, just like Mr. Kyubi asked. (Changed from [At the time of the murder I was on guard duty in the foyer, just like Mr. Kyubi's [sic] asked.] in the original release)Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nMr. Filch, why did Alderman Kyubi have you handle guard duty?\nFilch:\nEh-heh heh... 'Cause he trusts me. I AM the manor's caretaker, after all.\nApollo:\nSo, you took said guard duty seriously?\nFilch:\nEh-heh heh... Lemme tell ya something about me. I'm-- Yipes!\nBlackquill:\nListen here, you little tanuki. Get straight to the point and be quick about it. The court wishes to hear what you did or didn't see in the foyer, and naught else.\nFilch:\nY-Yes, of course, sir! Right away, sir!\nApollo:\n(Blackquill's got him completely under his thumb.)\nFilch:\nLike I said, I was guarding the foyer entrance that day!Filch:\nI was making sure no one -- fair, foul, fishy, or otherwise -- could get to our guest.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo no one could get to him... Sounds like security was pretty tight.\nFilch:\nThat's 'cause there's always lotsa sneaks 'n' thieves 'round festival time.\nApollo:\nAnd the solution was to entrust the manor's security to a thief? That's not even funny.\nAthena:\nMaybe it's a matter of stopping thieves by hiring one. After all, it takes one to know one.\nApollo:\nI dunno, it seems more like letting the fox guard the henhouse to me.\nJudge:\nHmm. So, the witness testifies that he took his guard duty seriously?\nFilch:\nYes, sir, Your Honorship, sir!Filch:\nI was still in my office keeping a good watch when the murder happened after 3 PM.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nDid you really keep an eye on the foyer the entire time?!\nFilch:\n*sigh* Poor old Filchy... Been working hard my whole life... ...only to be smeared by some greenhorn in his fancy-schmancy suit and silly haircut. Ah! Sorry, sorry, Mr. Blackquill, sir! Didn't mean to get off subject there!\nApollo:\n(Sheesh... Blackquill didn't even say anything.)\nFilch:\nTo answer your question, yes, I kept an eye -- no, both of 'em, in fact -- on the foyer!Present TV Listings\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Don't lie to the court like that, Mr. Filch.\"Filch:\nBut I didn't see nothing outta the ordinary, no siree!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nCould you describe to the court who you would consider fishy looking?\nFilch:\nSomeone all fidgety and shifty-like, you know, like they're about to steal something.\nApollo:\n(He......... just described himself.)Athena:\nI wonder why Mr. Filch didn't see Tenma Taro.Apollo:\nMaybe Jinxie only thinks she saw Tenma Taro. Or...Athena:\nMaybe Mr. Filch is lying.Apollo:\nAnd if he's lying, we might be able to spot a contradiction in his testimony."
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "It's true, I was watching a pro wrestling match on the office TV.",
          "person": "Filch",
          "present": []
        },
        {
          "testimony": "My eyes mighta been slacking off, but my ears? They were working overtime.",
          "person": "Filch",
          "present": []
        },
        {
          "testimony": "The floor there's all creaky squeaky-like. No way I woulda missed someone walking by.",
          "person": "Filch",
          "present": []
        },
        {
          "testimony": "If Tenma Taro was to pass by, his staff woulda gone jingle jangle.",
          "person": "Filch",
          "present": [
            "Yokai Legend Scroll"
          ],
          "source": {
            "evidence_span": ["He does not wield any weapon.", "The sole document showing what Tenma Taro looks like."],
            "testimony_span": "If Tenma Taro was to pass by, his staff woulda gone jingle jangle.",
            "explanation": "The only depiction of Tenma Taro shows he does not wield a weapon. Therefore, the witness would not have known that Tenma Taro wields a staff.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "So ya see, there weren't no Tenma Taro in the foyer.",
          "person": "Filch",
          "present": []
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Filch argues while he could not see the crime, he could hear it.",
      "labels": [
        "behavioral"
      ],
      "reasoning": [
        "Fact 1: The witness claims Tenma Taro had a staff.",
        "Fact 2: The evidence suggests based on the scroll, Tenma Taro does not have a staff.",
        "Fact 3: The evidence also suggests the scroll is the only depiction of Tenma Taro.",
        "Prop 1: If the only depiction of an entity shows an impression, then everyone should have that impression.",
        "Prop 2: If everyone is under some impression, then any particular person would not think otherwise."
      ],
      "newContext": "-- Guarding the Foyer --Filch:\nAt the time of the murder I was on guard duty in the foyer, just like Mr. Kyubi asked. (Changed from [At the time of the murder I was on guard duty in the foyer, just like Mr. Kyubi's [sic] asked.] in the original release)Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nMr. Filch, why did Alderman Kyubi have you handle guard duty?\nFilch:\nEh-heh heh... 'Cause he trusts me. I AM the manor's caretaker, after all.\nApollo:\nSo, you took said guard duty seriously?\nFilch:\nEh-heh heh... Lemme tell ya something about me. I'm-- Yipes!\nBlackquill:\nListen here, you little tanuki. Get straight to the point and be quick about it. The court wishes to hear what you did or didn't see in the foyer, and naught else.\nFilch:\nY-Yes, of course, sir! Right away, sir!\nApollo:\n(Blackquill's got him completely under his thumb.)\nFilch:\nLike I said, I was guarding the foyer entrance that day!Filch:\nI was making sure no one -- fair, foul, fishy, or otherwise -- could get to our guest.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo no one could get to him... Sounds like security was pretty tight.\nFilch:\nThat's 'cause there's always lotsa sneaks 'n' thieves 'round festival time.\nApollo:\nAnd the solution was to entrust the manor's security to a thief? That's not even funny.\nAthena:\nMaybe it's a matter of stopping thieves by hiring one. After all, it takes one to know one.\nApollo:\nI dunno, it seems more like letting the fox guard the henhouse to me.\nJudge:\nHmm. So, the witness testifies that he took his guard duty seriously?\nFilch:\nYes, sir, Your Honorship, sir!Filch:\nI was still in my office keeping a good watch when the murder happened after 3 PM.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nDid you really keep an eye on the foyer the entire time?!\nFilch:\n*sigh* Poor old Filchy... Been working hard my whole life... ...only to be smeared by some greenhorn in his fancy-schmancy suit and silly haircut. Ah! Sorry, sorry, Mr. Blackquill, sir! Didn't mean to get off subject there!\nApollo:\n(Sheesh... Blackquill didn't even say anything.)\nFilch:\nTo answer your question, yes, I kept an eye -- no, both of 'em, in fact -- on the foyer!Present TV Listings\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Don't lie to the court like that, Mr. Filch.\"Filch:\nBut I didn't see nothing outta the ordinary, no siree!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nCould you describe to the court who you would consider fishy looking?\nFilch:\nSomeone all fidgety and shifty-like, you know, like they're about to steal something.\nApollo:\n(He......... just described himself.)Athena:\nI wonder why Mr. Filch didn't see Tenma Taro.Apollo:\nMaybe Jinxie only thinks she saw Tenma Taro. Or...Athena:\nMaybe Mr. Filch is lying.Apollo:\nAnd if he's lying, we might be able to spot a contradiction in his testimony.Apollo:\nDon't lie to the court like that, Mr. Filch.Filch:\nHey, it ain't right to bushwhack a fella like that!Apollo:\nUnfortunately for you, I have evidence that proves you're lying. If you look at this TV listing here, you'll see that at the time of the crime... ...there was a pro wrestling match scheduled -- something you'd never miss.Filch:\nAck! I didn't watch that one, no siree! I was doing my job, just like I was s'pposed to!Apollo:\n(This guy doesn't know when to give up.) Mr. Filch. Someone even circled the match. It was you, right?Filch:\nYipes!Apollo:\nNot only that, you even told me you watched it. You said, and I quote: \"It was a complete disaster.\"Filch:\nHrrrgh!Apollo:\nSo, do you admit to slacking off?!Filch:\nY-Y-You can't trick me with your rudy poo lawyer talk! I'm one of them professional-types, too! I can do double-duty, watching TV and the foyer at the same time!Apollo:\n(The only thing Filch can claim to be a professional of is \"professional thief\"...)Judge:\nMr. Justice. You would have this court believe the witness was slacking off?Apollo:\nThat's correct. He claims to have been watching TV and the foyer at the same time. But that's nothing but a bald-faced lie!Judge:\nBald, you say? But I'M not the one who's lying! Perhaps you meant the witness, Mr. Justice? And in that case, let's see what evidence you can offer. You claim Mr. Filch is lying about watching TV and the foyer simultaneously. Now, prove it.Present Foyer Diagram\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Please take a look at the direction the TV is facing in this diagram.\"Present anything else\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThis piece of evidence here clearly exposes Mr. Filch's lie.\nJudge:\nHm? How does that prove anything?\nApollo:\nOh, it, um... (Whoops! Way off on that one!) Heh heh, sorry. Don't know what I was thinking.\nJudge:\nYes, well, I have moments like that myself.\nApollo:\n(Whew, looks like he'll let this one slide.)\nJudge:\nBut random guesses and speculation must be punished!\nApollo:\nYargh!\nAthena:\nApollo! We should think about how Mr. Filch was when he was watching TV!\nApollo:\nPlease, lemme try that one again!\nJudge:\nThe defense will look before they leap this time. So, what do you have for us, Mr. Justice?\nLeads back to:\n\"You claim Mr. Filch is lying about watching TV and the foyer simultaneously. Now, prove it.\"Apollo:\nPlease take a look at the direction the TV is facing in this diagram. Now, unless Mr. Filch has eyes where his right ear should be... ...I'd think it would be impossible to watch the foyer entrance and the TV at the same time.Judge:\nWhy, yes! Someone watching TV there couldn't possibly see the entrance!Apollo:\nExactly. And that means, Mr. Filch... ...you were slacking off and were NOT watching the foyer as you claim!Filch:\nYiiipes! The bag's outta the cat! Er, I mean, other way 'round!Judge:\nOrder! Order! Order!!! But Mr. Justice, is Mr. Filch's less-than-stellar work ethic relevant to this case?Apollo:\nIt's very relevant, because while he was slacking off watching TV... ...there really could've been a Tenma Taro impersonator in the foyer!Blackquill:Apollo:\nWhat now?!Blackquill:\nGranted, this tanuki was lax in his duties, but he still had the foyer entrance covered.Apollo:\nWhat are you talking about?Blackquill:\n.........This.Apollo:\nUm... I'm not a mind reader. Ack!Blackquill:\nAuditory sense. His eyes may have been slacking off, but his ears were still hard at work. Right, tanuki?Filch:\n...They were? ............Er, I mean, yes! Yes they were!Apollo:\nBut you already admitted to slacking off. Now you say you weren't?Filch:\nMy eyes might be lazy, but my ears ain't. I woulda heard anyone in the foyer, eh-heh. Ya see, the foyer floor and stairway get all creaky squeaky when someone walks on 'em! Creak, creak, creak! Loud enough to wake the dead, I reckon!Apollo:\nSo, you're saying you didn't hear anybody walk by?Filch:\nYep! My ears were working fulltime. So, who's the liar now, ya no-good shyster!Apollo:\nA lying thief calling me a shyster. This HAS to be the low point of my fledgling career...Filch:\nGotta hand it to ya, Mr. Blackquill, sir, ya really are something else, eh-heh heh! I mean, ya don't miss a thing. And them bags under yer eyes? They're darker than mine!Blackquill:\nFair warning, Mr. Filch. Taka is particularly fond of tanuki. Should you lie to this court again, you may suddenly find yourself on the menu.Filch:\nYiiiiiipes! Please don't eat me, Mr. Taka, sir!Judge:\nThe witness will henceforth testify truthfully under penalty of painful bird attacks! And with that in mind, the court requests that the witness revise his testimony accordingly.Witness Testimony-- Ears Working Overtime --Filch:\nIt's true, I was watching a pro wrestling match on the office TV.\nMy eyes mighta been slacking off, but my ears? They were working overtime.\nThe floor there's all creaky squeaky-like. No way I woulda missed someone walking by.\nSo ya see, there weren't no Tenma Taro in the foyer.Blackquill:\nSuperstition is the religion of feeble minds. Understand? A simple, rational explanation is best. Forget yokai, demons, and such. We must use common sense, for lacking that, our entire world would be but upside-down.Apollo:\n(Says the convict prosecutor who is totally a sign of the end times for the legal world.)Filch:\nAnd besides, if there were any yokai roaming about, I'd nab 'em 'n' sell 'em to the zoo!Athena:\nI wonder whether Jinxie was just seeing things.Apollo:\nThat seems to be the general consensus, but I'm sticking to my guns.Athena:\nBut if we can't prove she saw Tenma Taro, the mayor's sure to be convicted!Apollo:\nThen we'd better hope my guns fire bullets, not BBs...Judge:\nThe defense may cross-examine the witness.Cross ExaminationCross Examination-- Ears Working Overtime --Filch:\nIt's true, I was watching a pro wrestling match on the office TV.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou ARE paid for your work, aren't you? So, how do you justify watching TV on the job?\nFilch:\nA-A-Arrgghh! B-B-B-But...! It ain't easy being me! I mean, I can't watch TV when we have visitors and there's no way to record stuff!\nApollo:\n(Sorry, am I supposed to be consoling you over your first-world problems?)\nAthena:\nIf those are his only problems, he should consider himself lucky.\nApollo:\nI guess pro wrestling's serious business to Mr. Filch.Filch:\nMy eyes mighta been slacking off, but my ears? They were working overtime.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou lied earlier about taking your guard duty seriously, didn't you?\nFilch:\nOh, uh, that? Ain't no harm in bending the truth a little, right?\nBlackquill:\nListen to me, you little tanuki. Lie again and Taka shall feast upon that forked tongue of yours.\nTaka:\nScreech!\nFilch:\nYiiipes! Sorry! Just lemme keep my tongue!\nApollo:\n(At least leave it until we get the truth out of him, in any case.)\nBlackquill:\nYou were negligent in your duties, were you not?\nFilch:\nYes, sir, I was sir! But it ain't like that...Filch:\nThe floor there's all creaky squeaky-like. No way I woulda missed someone walking by.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo, you have pretty good ears, Mr. Filch?\nFilch:\nAs good as they come, I'd say. Ain't nothin' to hear a creaky floor. Plus, that Tenma Taro makes a sound when he goes by. It's like a jingle jangle.\nApollo:\nJingle jangle? How does he do that?\nFilch:\nIt's that staff o' his. That's what jingle jangles.\nAthena:\nWhat's he talking about, Apollo?\nApollo:\nBeats me, but I guess Tenma Taro has a staff that makes noise.\nAthena:\nCome to think of it, didn't Jinxie mention something like that, too? She said she saw Tenma Taro holding a staff-like object that made a jangly sound.\nApollo:\nI guess that's the source of the noise then...\nJudge:\nWell, Mr. Justice? Mr. Filch says Tenma Taro \"jingle jangles.\" Would you consider that vital information?\n\n\n\nVery important\n\n\n\n\n\n\n\nApollo:\nExtremely vital! I request that it be added to his testimony!\nAdds statement \"If Tenma Taro was to pass by, his staff woulda gone jingle jangle.\"\n\n\n\n\nNot so important\n\n\n\n\n\n\n\nApollo:\n(Doesn't seem particularly important to me.) No, Your Honor. I don't think it's of any importance.\nJudge:\nVery well. The witness may continue with his testimony.\nLeads back to cross-examinationPress (after adding statement)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nCould someone walk by without making a sound?\nFilch:\nNope, not even a ninja. That's 'cause even the tiniest mouse makes that floor creak, eh-heh. Real creaky squeaky, it is!\nBlackquill:\nI can vouch for the tanuki's keen ears. He came running from across the building the moment Fool Bright dropped his wallet. And true to his name, Filch filched it before Mr. Less-Than-Bright knew what happened.\nApollo:\nThat's some scary good hearing.\nFilch:\nWads o' cash or expensive shoes on the pavement... Sounds like that don't get by ol' Filch's ears. Got years o' practice, eh-heh heh.\nAthena:\nRemind me not to bring anything of value to the manor next time.\nApollo:\nThe sound of shoes makes sense, but wads of cash? What does that sound like? ...Anyway, it sounds like they need to hire somebody to take care of their caretaker.Filch:\nIf Tenma Taro was to pass by, his staff woulda gone jingle jangle.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo, Tenma Taro's staff makes a distinctive sound?\nFilch:\nYep, like a jingle and a jangle.\nAthena:\nWait, Jinxie said something like that. Something about Tenma Taro making a jangly sound.\nApollo:\nHmmm... I think we're missing something here, but I can't quite put a finger on it. (Perhaps I should take a look at the Court Record again...)Present Yokai Legend Scroll\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Tenma Taro's staff would make a jangly sound, you say?\"Filch:\nSo ya see, there weren't no Tenma Taro in the foyer.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nPlease tell the court, what did Jinxie see if not Tenma Taro?\nFilch:\nShe's always going on about seeing this yokai or that. Just an active imagination, I reckon. She won't even come near me 'cause she thinks I'm some sorta tanuki monster!\nAthena:\nCan't say I blame her.\nApollo:\nSo, Mr. Filch, you'd chalk it up to a child's active imagination?\nFilch:\nYep. No Tenma Taro or anyone else got in or outta Kyubi Manor on my watch.Athena:\nApollo, what could this mean? Do you think Jinxie was just seeing things?Apollo:\nWell, if that's the case, the details she provided were pretty impressive. But if we're to continue believing Jinxie's statement...Athena:\nWe'll have to uncover Filch's lie?Apollo:\nRight, or.... find out why he can't tell the truth."
    }
  ]
}