{
  "previousContext": "Turnabout Academy\nImage Gallery\nTranscript\nPart 1\nPart 2\nPart 3\nPart 4\nEpisode 3Turnabout Academy\nAnime cutscene\nThemis Legal Academy -- a prestigious high school with alumni in the highest echelons of the legal world.\nOctober 24, 1:25 PMThemis Legal Academy\nAthena:\nOh, no! I'm gonna be late! *huff* *puff* Whew, finally. So, this is it... the illustrious Themis Legal Academy. (This is the place where many distinguished lawyers and prosecutors got their start. When news spread that Mr. Wright had gotten his attorney's badge back... ...he received a call from this school, asking him to pay a visit. Mr. Wright brought us along, hoping we'd learn something from the experience. But no, I had to go and blow it by getting here thirty minutes late. At least it's not all business today! After all, today's their school festival!)\nOctober 24, 1:29 PMThemis Legal Academy - 1F Hallway\nAthena:\n(Wow! This place has school festival written all over it... literally! But why all the cold stares? Is it because everyone's in a school uniform except me? Well, I like the way I dress! Wonder where Mr. Wright and Apollo are?)\nYour attention please. This is an announcement from the Mock Trial Committee. The mock trial will begin shortly. All students and faculty please proceed at once to the Lecture Hall. Thank you.\nAthena:\n(Sounds like a mock trial is about to start, but where's this Lecture Hall? Looks like all the students and faculty are heading that way. Might as well join them. Maybe I'll find Mr. Wright and Apollo there!)\nOctober 24, 1:33 PMThemis Legal Academy - 3F Lecture Hall\nAthena:\n(This must be the Lecture Hall. Wow, they spent some serious money on this place. The District Court can't even compete.)\nHey, Athena! Over here!\nAthena:\nAh, Mr. Wright! Apollo! I've been looking for you two. I'm so sorry I'm late.\nPhoenix:\nIt's okay. Sorry we couldn't wait for you. But we didn't want to be late for our meeting.\nApollo:\nLucky for you, the person we're supposed to meet also seems to be running late.\n???:\nMr. Wright, Mr. Justice, it seems Prof. Courte has yet to arrive. How un-professorial of her to keep visitors to our esteemed institution waiting like this! I shall make her write \"I will not--\" ...Oh, who do we have here?\nPhoenix:\nOh, right. You haven't been introduced yet.\n???:\nAh, yes. You must be the young lady Mr. Wright was telling me about. I am Aristotle Means, a professor at this hallowed hall of learning.\nMeans:\nI oversee the lawyer course here. It is a pleasure to meet you.\nAthena:\nI'm Athena Cykes! I just recently got my attorney's badge myself! It's nice to meet you, too!\nMeans:\nHow wonderful! So vigorous and vivacious. You just earned yourself a gold star.\nAthena:\nWow, thanks! (That big smile of his is kinda scary, though.)\nApollo:\nLooks like the mock trial's about to begin. What are we going to do about our meeting?\nAthena:\nOh, speaking of the mock trial, do either of you know what it's about?\nMeans:\nOh, but I thought we had sent a pamphlet to your office.\nPhoenix:\nRight, the pamphlet... Whatever happened to that?\nAthena:\nYou won't be seeing it again. Trucy used it for the old rip-it-up-and-restore-it trick. ...Unfortunately, it didn't work as advertised.\nMeans:\nWell, it seems I had better explain the situation, then.\nPhoenix:\nThank you, Professor.\nTalk\nThemis Legal Academy\nMeans:\nNow, does anyone have any questions?\nAthena:\nI do, professor! Could you tell me all about your school?!\nMeans:\nWhat an excellent question. Here's a gold star for asking! Our academy has three courses to choose from. Students seeking to be lawyers take the lawyer course. Likewise... ...budding prosecutors take the prosecutor course, and future judges, the judge course.\nAthena:\nWow, you have everything here for someone who wants to seriously pursue a career in law!\nMeans:\nYes, well, that's what makes our school special, and today even more so. After all, we are to be treated to a lecture by the legendary attorney Phoenix Wright. We can't wait to hear all about his return to the legal profession.\nAthena:\nYou're giving a lecture, Mr. Wright? But you're not even a professor.\nPhoenix:\nAh ha ha. Yeah, well I'm just giving them what they want.\nToday's plans (appears after \"Themis Legal Academy\")\nAthena:\nUh, did you even know you were meant to be giving a lecture here today?\nPhoenix:\nYeah, sort of. But I came early because I was supposed to have a meeting... ...with the head of the judge course, Constance Courte.\nApollo:\nIt's been a whirlwind of a morning. Let's leave it at that.\nMeans:\nProf. Courte... She is a wonderful instructor, but quite unpunctual.\nAthena:\n(Oh, so that's who's late.)\nMeans:\nFrom what I've heard, our esteemed Mr. Wright here... ...is scheduled to hold a training seminar tomorrow, in addition to today's lecture.\nAthena:\nA training seminar? For lawyers? What exactly does that involve?\nMeans:\nWhy, it involves the very skills that make a lawyer, a lawyer! The arm angle when shouting, \"Objection!\" The proper way to strike the podium... How to project one's voice... And most importantly, how to bluff your way to victory!\nPhoenix:\nHuh? Um, who exactly do you want me to teach stuff like that to again?\nMeans:\nWhat a wonderful question. You just earned yourself a gold star! The great honor of taking a seminar by a famous lawyer and a famous prosecutor... That is what is at stake in this mock trial, the crown jewel of the school festival.\nThe mock trial (appears after \"Today's plans\")\nLeads to:\n\"The mock trial in question is a prestigious event that every student aspires to win.\"\nPresent\nAnything\nMeans:\nWhat magnificent presentation technique! Both your timing and speed were impeccable.\nAthena:\nSpeed?! You mean speed's important when presenting evidence, too?\nMeans:\nAbsolutely! The speed and approach angle theorems are the first things we teach here! I believe Mr. Wright and others like him already make extensive use of them.\nAthena:\nYou do, Boss?!\nPhoenix:\nWell... to some degree, I guess, ah ha ha.\nAthena:\nIt never even crossed my mind. (This lawyer thing is deeper than I thought!)\nMeans:\nThe mock trial in question is a prestigious event that every student aspires to win. The top student in the lawyer course and the top student in the prosecutor course... ...face off in a simulated court case set in this very school! As for the case itself... ...we select the best script written by a judge course student and base our case on that!\nAthena:\nOoh! A one-on-one battle?! How thrilling!\nPhoenix:\nSo, if the student studying to be a lawyer wins, they get to take my training seminar? But what if the other student wins? I'm not a prosecutor, so...\nMeans:\nThere's no cause for alarm. We have a famous prosecutor ready for just such a case. But exactly who it is, well, that is a special surprise!\nAthena:\nA famous prosecutor? (No, it can't be...)\n???:\n...Prof. Means, forgive me for interrupting you and your guests. I'm Juniper Woods, a senior in the judge course. (Changed from [I'm Juniper Woods, a third year in the judge course.] in the original release)\nWoods:\nProfessor, the trial will begin shortly. Since you'll be delivering the pre-trial speech... ...would you mind waiting up in the balcony until we're ready for you?\nMeans:\nMy, how very organized you are, Juniper. You just earned yourself a gold star, too. But what about Prof. Courte... Well, I suppose she'll eventually arrive. Now then, I trust you will look after our visitors, Juniper?\nWoods:\nYes, of course, Prof. Means.\nAthena:\nJuniper? Juniper Woods? Is that you?\nWoods:\nHm? ...Then-- Athena?! I almost didn't recognize you. I didn't know you were back from Europe.\nPhoenix:\nWait, you two know each other? Now that's a coincidence.\nAthena:\nWe've known each other since we were kids. We're like best friends, right, Junie?!\nWoods:\nYes... Well, we lived close to each other, so we used to play in the forest together.\nAthena:\nYeah, like a lot a lot. (Why won't she look at me? I guess I shouldn't be surprised since we haven't seen each other in a long time.)\nApollo:\nAnyway... we're supposed to go wait in the waiting room, right? Not that I wouldn't mind taking in the mock trial you're putting on today.\nWoods:\nUnfortunately, the mock trial is only for students and faculty. There is one seat reserved for Mr. Wright, but no other exceptions are allowed.\nMeans:\nYes, I'm very sorry, but it is part of the student curriculum, after all. I hope you won't mind remaining in the waiting room until the trial concludes.\nApollo:\nOh, that's too bad. I was hoping to learn something new today.\nPhoenix:\n...I'll tell you what, Apollo. Why don't you take my place?\nApollo:\nWhat? Really?\nPhoenix:\nSure. Besides, I'd like to meet with Prof. Courte as soon as she gets here.\nAthena:\nAw, no fair! I wanna see the mock trial, too!\nPhoenix:\nSorry, I'm going to let Apollo pull what little rank he has. ...If it's okay with Prof. Means.\nMeans:\nBut of course, Mr. Wright, if that is what you wish.\nPhoenix:\nIt's settled, then. We'll expect a full and detailed report, Apollo, so pay attention!\nAthena:\nTsk, being the new kid sure stinks.\nWoods:\nIf you would please follow me. I'll escort you down to the waiting room on the first floor.\nOctober 24, 2:15 PMThemis Legal Academy - 1F Waiting Room\nAthena:\n(Still no Prof. Courte... It's been over thirty minutes. And Mr. Wright's snoozing away on the sofa. This is so boring. I should've hid in the Lecture Hall and spied on the mock trial.)\n*crash*\nAthena:\nEek! Wh-What was that?!\nOctober 24Themis Legal Academy - 1F Hallway\nPhoenix:\n*yawn* ...Athena. I could've sworn I just heard something fall down and break. If you go running now, they'll think it was you.\nAthena:\nW-Well it wasn't me. I think it came from somewhere outside.\nPhoenix:\nOh. Well, we better go have a look, seeing as everyone else is in the Lecture Hall.\nAthena:\nOkay!\nOctober 24Themis Legal Academy - Outdoor Stage\nAthena:\nIs this stage for some sort of concert? It kinda reminds me of a courtroom.\nPhoenix:\nWait, Athena. Behind the witness stand!\nAthena:\nWhat? Eeeeeeeeek!\nPhoenix:\nProf. Courte! Can you hear me?! Professor!\nAthena:\nWait, that's... that's who we were supposed to be meeting with?!\nPhoenix:\n......... It looks like our meeting's been canceled for us.\nAthena:\nNo way! This... This can't be real...!\nAthena:\nI called the police. They should be here soon. ...I'll go tell everyone in the Lecture Hall, too.\nPhoenix:\nNo, wait. They'll find out soon enough once the police get here. Let's do our own crime scene investigation before it gets too crowded around here.\nAthena:\nHuh?! Are we even allowed to do that?\nPhoenix:\nIt's no big deal, as long as we leave it exactly like we found it. Plus... No, never mind. Anyway, we should look around while the scene's still fresh.\nAthena:\nBut...... Okay, you're the boss.\nExamine\n\"67th School Festival\" sign, backdrop, defense bench, prosecution bench, judge bench, witness stand, or piles of rubble\nAthena:\nWe should start by studying the body. Hmm, I wonder what's the best angle for this?\nConstance Courte's body\nAthena:\n(Ugh. I guess I really do have to examine the body... Well, guess I'd better get used to stuff like this if I want to be a full-fledged lawyer!)\nArrow\nAthena:\nUgh... There's an arrow stuck in her side. Gunshot wounds and stab wounds are pretty common, but arrow wounds?\nPhoenix:\nThis is a homicide any way you slice it. In other words, we have a murder on our hands.\nAthena:\n(A murder?! Here?!) S-So, that makes this arrow the murder weapon. Well, that and the bow that shot it.\nPhoenix:\nRight, but where could the killer have shot her from? The stage is a sea of obstructions? I'm no expert on archery, but it can't be easy to hit a target with this much stuff around.\nAthena:\nWould it be possible to kill someone by stabbing them with an arrow?\nPhoenix:\nI'm not sure. Guess we better do some more investigating before jumping to conclusions.\nArrow added to the Court Record.\nArrow (subsequent times)\nAthena:\nUgh... There's an arrow stuck in her side. Gunshot wounds and stab wounds are pretty common, but arrow wounds?\nPhoenix:\nThis is a homicide any way you slice it. In other words, we have a murder on our hands.\nAthena:\n(A murder?! Here?!) S-So, that makes this arrow the murder weapon. Well, that and the bow that shot it.\nPhoenix:\nRight, but where could the killer have shot her from? The stage is a sea of obstructions? I'm no expert on archery, but it can't be easy to hit a target with this much stuff around.\nAthena:\nWould it be possible to kill someone by stabbing them with an arrow?\nPhoenix:\nI'm not sure. Guess we better do some more investigating before jumping to conclusions.\nPlanner\nPhoenix:\nWhat do we have here...? A book? I'm guessing it fell out of her chest pocket.\nAthena:\nWait! What if it's her diary?! That's the most private thing a girl has!\nPhoenix:\nTrue, but considering the situation at hand, my apologies to the late Prof. Courte.\nAthena:\nNo, don't!\nPhoenix:\nHmm, looks more like a planner than a diary. Every page seems to have the same sword mark printed on it at that.\nAthena:\nI still think a girl deserves her privacy, but this may help us solve the case.\nCourte's Planner added to the Court Record.\nPlanner (subsequent times)\nPhoenix:\nWhat do we have here...? A book? I'm guessing it fell out of her chest pocket.\nAthena:\nWait! What if it's her diary?! That's the most private thing a girl has!\nPhoenix:\nTrue, but considering the situation at hand, my apologies to the late Prof. Courte.\nAthena:\nNo, don't!\nPhoenix:\nHmm, looks more like a planner than a diary. Every page seems to have the same sword mark printed on it at that.\nAthena:\nI still think a girl deserves her privacy, but this may help us solve the case.\nBody\nPhoenix:\nNotice anything strange about the body? Take a deep breath, and then take a good look.\nAthena:\nUm... well, now that you mentioned it, there's no blood around it.\nPhoenix:\nYet the victim's body is cold and rigor mortis has already started to dissipate. It would appear that quite some time has passed since Prof. Courte was murdered. Thing is, the quad was packed with students up until the start of the mock trial.\nAthena:\nWait, then doesn't that mean she was killed at a different location? Ooh, I know! The killer moved the body here while everyone was in the Lecture Hall!\nPhoenix:\nThat's a definite possibility. Notice anything else?\nAthena:\nUmm... Her arms are raised over her head and there are dark bruises around her wrists.\nPhoenix:\nYeah. The professor was probably tied up with something.\nAthena:\nEventually, her wrists were unbound, and as she reached up to stretch, she was killed? ...Actually, I'm not so sure about this theory...\nPhoenix:\nUm... Well, there's not exactly a lot to go on...\nTalk\nAny ideas?\nPhoenix:\nIn addition to checking the body, we should also check the area around it. But we don't have much time, check only what you can. ...Nervous, Athena?\nAthena:\nY-Yes! I mean, n-no! (Apollo didn't bat an eye at the alderman's body during that case in Nine-Tails Vale... I can't let him show me up. I can do this. Just take a deep breath and focus!)\nAbout the murder\nAthena:\nSo, Prof. Courte was...\nPhoenix:\nYep, the professor I was here to meet with. Turns out, she wasn't running late after all.\nAthena:\n(How awful. Here she was lying dead and we thought she was late.) What was that you were saying before, Boss? You never finished.\nPhoenix:\nHm? Oh, that. Don't worry, I'll fill you in... later. But right now, let's focus on the investigation, okay?\nAthena:\nO-Okay, sure. (Ugh, the suspense is killing me.)\nPresent\nAttorney's Badge\nPhoenix:\nOh, a shiny new attorney's badge. Brings back memories...\nAthena:\nI've heard that countless people live in dread of your pointer finger. Were you really that scary back then, Mr. Wright?\nPhoenix:\nAh ha ha. Strike one. I've always been just as you see me here.\nAthena:\nA harmless sheep in wolf's clothing?\nPhoenix:\nStrike two.\nAthena:\nDo you have an old picture of yourself? Wait, never mind! I'm not sure I want to see it!\nPhoenix:\nStrike three, you're out.\nAnything else\nPhoenix:\nListen, Athena. There's a certain amount of etiquette involved in presenting evidence. You're free to shove this or that into my face, but... ...at least get my attention first or give me some sort of a warning.\nAthena:\n(In other words, do as I say, not as I do.)\nAfter examining arrow, planner, and body:\nAthena:\nI think that's about all we're going to find out from the body for now.\nPhoenix:\nNice work, Athena. Your face only turned five shades of pale. I was expecting fifty. We should probably take a picture of the crime scene, just in case.\nAthena:\nOkay, I'm on it! Say cheese!\nPhoenix:\nCheese? And I thought I was the one with the twisted sense of humor.\nAthena:\nI think that should do it.\nPhoenix:\nAll right, let's take a better look around the area while we wait for the police to arrive.\nAthena:\nThis pile of rubble sticks out like a sore thumb. Looks like broken pottery or plaster. Maybe this is the source of that noise we heard.\nPhoenix:\nHmm, there were supposedly two statues on this stage. I seem to recall hearing that a coed from the Fine Art Club had made them.\nAthena:\nThere were two? Then that thing over there is the remains of another statue?\nPhoenix:\nThis could be related to the case. Let's take a closer look.\nExamine\n\"67th School Festival\" sign, backdrop, defense bench, prosecution bench, judge bench, or witness stand\nAthena:\nThere's definitely something here, but there are other pressing issues to take care of. Like doing a careful search of the area around that broken statue.\nPile of rubble near prosecution bench\nBroken statue\nAthena:\nWonder what this was a statue of. Whatever it was, it was reddish-purple in color.\nPhoenix:\nWhen Apollo and I first got here, both statues were already here, but they were covered up. I bet they were waiting to unveil them when the school festival moved here to this stage.\nAthena:\nYou mean this duffle bag-looking thing was actually being used to cover the statues? I guess that just leaves the question, were they broken by accident or on purpose? Hmm... What a puzzle this is.\nNewspaper\nAthena:\nThere's something buried in the rubble. ...The Themis Herald?\nPhoenix:\nWait, we shouldn't disturb it. Let's just read what we can.\nAthena:\n\"Final Act in Torrid Love Triangle Centered on Campus She-Devil Juniper Woods\" \"Level-headed lawyer course genius and hot-blooded prosecutor course student... ...will go head to head in a mock trial battle for the she-devil's black heart! Hugh O'Conner has declared that he will confess to her if he wins!\" Wait, whaaaaaaaaat?! I seriously wish I hadn't read that!\nPhoenix:\nYou find that more shocking than discovering a murder victim's body?\nAthena:\nB-B-But, we're talking about my friend Junie here! She'd never lead guys on like that!\nPhoenix:\nAthena, you don't believe everything you read, do you? This article is clearly written with malicious intent. I'm not buying a word of it.\nAthena:\nY-You're right. But it's still disturbing, even if it's third-rate tabloid material.\nThemis Herald added to the Court Record.\nNewspaper (subsequent times)\nAthena:\nThere's something buried in the rubble. ...The Themis Herald?\nPhoenix:\nWait, we shouldn't disturb it. Let's just read what we can.\nAthena:\n\"Final Act in Torrid Love Triangle Centered on Campus She-Devil Juniper Woods\" \"Level-headed lawyer course genius and hot-blooded prosecutor course student... ...will go head to head in a mock trial battle for the she-devil's black heart! Hugh O'Conner has declared that he will confess to her if he wins!\" Wait, whaaaaaaaaat?! I seriously wish I hadn't read that!\nPhoenix:\nYou find that more shocking than discovering a murder victim's body?\nAthena:\nB-B-But, we're talking about my friend Junie here! She'd never lead guys on like that!\nPhoenix:\nAthena, you don't believe everything you read, do you? This article is clearly written with malicious intent. I'm not buying a word of it.\nAthena:\nY-You're right. But it's still disturbing, even if it's third-rate tabloid material.\nAfter examining broken statue and newspaper:\n???:\nMr. Wright! Athena!\nAthena:\nOh, here comes Apollo! I've never seen anyone move so fast!\nApollo:\n*huff*... *huff*... Listen! Something big's happened! I was at the mock trial when the police announced a body had been found on campus!\nPhoenix:\nThat's right. And we're the ones who phoned it in. We found Prof. Courte dead behind the witness stand over there.\nApollo:\nWH-WHAAAT?! Can you show me?! ...What the--?!\nAthena:\nWe've already had a quick look at the body. It's definitely a homicide. Once the police get here--\nApollo:\nNo, I know it's a homicide! I'm shocked because it's the same! Exactly the same!\nPhoenix:\nWhoa there, Apollo. Take a deep breath and explain what you mean.\nApollo:\nIt's the same! The body, that is! It's just like it was in the mock trial!\nAthena:\nWhat? It's like the mock trial?\nApollo:\nI know! It sounds crazy, b-but... The body's location and position, the murder weapon, the lack of pooling blood... It's all exactly like the mock trial!\nAthena:\nYou're kidding, right? It can't really all be the same... can it...?\nOctober 24Themis Legal Academy - 3F Lecture Hall\nPhoenix:\nThe whole school's in an uproar. There won't be any more classes today.\nApollo:\nA murder on campus... That's the last thing I expected at a legal academy.\nPhoenix:\nI'll go tell Prof. Means what we observed when we discovered the body. You two wait here until you've spoken with the police.\nAthena:\nYes, Boss!\nApollo:\n*sigh* I can't believe this is happening.\nAthena:\nI can't believe we have to wait around here. I can't stay still at times like these. (I hope Junie hasn't fainted from the shock of this whole thing.)\nWoods:\nAh! Thena... er, I mean, Athena. There you are.\nAthena:\nJunie! Am I glad to see you! I was worried that--\nWoods:\nDon't worry about me. I am Student Council President, after all. I need to be strong.\nAthena:\nStudent Council President? Wow, I'm impressed. (She's really changed. She used to be kind of sickly and shy.)\nApollo:\nJuniper was it? You mind if we ask you a few questions?\nAthena:\nYeah, we're stuck here waiting for the police. And there's really not much to do.\nWoods:\nSure, what would you like to know?\nTalk\nJuniper Woods\nAthena:\nI haven't seen you in ages, Junie! What's it been, seven years or so?\nWoods:\nYes, and I remember how you were always there for me, Athena.\nAthena:\nUm, maybe it's just me, but I wanted to ask why you seem so distant. Remember how you used to call me \"Thena\"? I liked it better that way. It felt like we were sisters, you know?\nWoods:\nYes, but I'm Student Council President now. And as the student representative of Themis Legal Academy, I have to act properly.\nAthena:\n(She was never this stiff and formal before.) I knew you wanted to be a judge, but I didn't expect this. It's such a prestigious school. And you're in the judge course to boot.\nWoods:\nYes. And Prof. Courte had been in charge of it until... well, you know.\nAthena:\n(Oh, right. Prof. Courte was the professor in charge of Junie's course...)\nConstance Courte (appears after \"Juniper Woods\")\nApollo:\nWhat sort of teacher was Prof. Courte?\nWoods:\nIf I had to sum her up in a single word, I'd say she was \"amazing.\" \"A judge must always seek the truth.\" That was her mantra, and she used it in trying to... ...fix what was wrong with our school. She was a beacon of hope in this dark age of the law.\nAthena:\nWhat's wrong with your school? What did you mean by that?\nWoods:\nOh, uh, nothing! Never mind.\nAthena:\n(Am I imagining things or did I just detect something in Junie's voice?)\nWoods:\nProf. Courte chose my script for the mock trial.\nAthena:\nOh? You mean all of the students in the judge course had to submit a script? And yours was the one she selected? Wow, that's amazing, Junie!\nWoods:\nOh, th-thank you. But now, Prof. Courte is... Who would do such a thing? Just yesterday we were working together, trying to get things ready... *cough* *cough* *cough* Excuse me.\nAthena:\nAre you all right, Junie? Maybe you should take it easy for a while. (So she's still got that cough... Guess she's not as strong as she pretends to be.)\nThe mock trial (appears after \"Constance Courte\")\nLeads to:\n\"Why do you need a script in a showdown between a lawyer and a prosecutor?\"\nPresent\nAttorney's Badge\nWoods:\nThat's your attorney's badge, isn't it! I really envy you, you know. That gold sunflower really suits you.\nAthena:\nThanks. But I know you'll make a fabulous judge someday, Junie.\nWoods:\nTh-Thank you... But... Even if I become a judge, I'll never have one of those sunflower badges.\nAthena:\n(Wait, so she only envies me for the badge?)\nThemis Herald\nWoods:\nOh, th-that's...\nAthena:\nHeh heh. Sorry, but I couldn't help reading it. You always were popular with the guys.\nWoods:\nTh-That's not true! I... I was never...!\nAthena:\nYou just didn't realize it. But that made you even more irresistible. It's been seven years, but I still remember how all the boys wanted to be near you.\nApollo:\nI bet you used to get all excited when a guy handed you a love letter... ...and then got really bummed out when he'd say, \"Could you give this to Juniper for me?\"\nAthena:\nAgh! (How'd he know?! I'm sure it was just a lucky guess, but why'd it have to be Apollo of all people?!)\nAnything else\nWoods:\nAthena, you know it's against school rules for you to have such things in your possession. As Student Council President, I'm afraid I'll have to confiscate that. Hand it over, please.\nAthena:\nBut this is important evidence.\nWoods:\n...Oh, well, then I suppose we can make an exception just this once.\nAthena:\n(Wow, she's one tough law-and-order type president, all right.)\nAthena:\nWhy do you need a script in a showdown between a lawyer and a prosecutor?\nWoods:\nWell, we were simulating a trial, so we needed a script as a framework. All the details about the incident and the people involved are included in the script. We also prepared a crime scene, photos, a murder weapon, and other kinds of evidence.\nApollo:\nWow, you guys think of everything. Must be hard getting all that ready.\nWoods:\nYes, well... it was only Prof. Courte and I. After all, we didn't want the script or other elements of the mock trial to get leaked. We were the only ones in the entire school who knew all of the details.\nAthena:\nMust've been a big pain in the-- er, I mean, that must've been really difficult.\nWoods:\nI wrote the script so that the case could go either way. That way, the defense and the prosecution both had an equal chance of winning.\n???:\nHeh, if you think that's all she's capable of, you've got another thing coming.\nAthena:\nHuh? Who said that?\n???:\nJuniper's genius doesn't stop at her brilliant script.\n???:\nYEAAAAAH! She gave an award-winning performance as the defendant, maaaaaan!!!\nApollo:\nUm, I think I found a rival to my Chords of Steel.\nWoods:\nHugh, Robin, aren't you going to introduce yourselves to our guests? As Student Council President, I won't have you treating them rudely.\n???:\nHeh, you're right. I heard Mr. Wright was bringing a couple of guests with him. That would be you two? Apollo Justice and Athena Cykes?\nAthena:\nYep! I'm Athena Cykes!\nApollo:\nAnd I'm Apollo Justice. Nice to meet you.\n???:\n...I'll pass on the handshake.\nO'Conner:\nI'm studying to be a lawyer. The name's Hugh O'Conner. ...But some call me Mr. Perfect because I never score less than one hundred percent on tests. (Changed from [...But some call me Mr. Perfect because I never score less than 100% on tests.] in the original release)\nAthena:\n(Ugh. Most... pretentious... introduction... EVER. And what's with his hand? Is it glued to the inside of his pocket or what? Yeesh.)\n???:\nLemme be the first to apologize for Hugh's totally rude introduction! SORRRRRY!!!\nNewman:\nNow, here's my intro! I'm Robin Newman!!! I'm studying to be a prosecutor! Like the really cool kind that nails the bad guys! NOOOOOO!!! Where's the sincerity?!\nAthena:\n(So he makes pottery, too? And what's that brace-like contraption for...? Junie sure has made some... unusual friends.)\nWoods:\nThese two were the lawyer and the prosecutor in today's mock trial. And even though I wrote the script, I also played the part of the defendant.\nAthena:\n\"Final Act in Torrid Love Triangle Centered on Campus She-Devil Juniper Woods\" \"Level-headed lawyer course genius and hot-blooded prosecutor course student... ...will go head to head in a mock trial battle for the she-devil's black heart!\"\nAthena:\n(Wait, THESE two are the guys who supposedly have a thing for Junie?)\nO'Conner:\nHeh. Juniper, come on. Your role's way beyond just that.\nNewman:\nThat's riiiiiight! The mock trial's just the start! She's also in the school festival's main event! Live on stage, Juniper Woods! And the crowd goes bananas! WOOOOO!!!\nWoods:\n......... I'm... I'm supposed to sing at the school festival. All of the other girls were too embarrassed to try out, so...\nAthena:\nMy Junie singing? On a stage in front of people? (Wow, she really HAS changed.)\nTalk\nYour performance\nWoods:\nI was responsible for making everyone's stage costumes. And this is what I'll be wearing.\nAthena:\nThat's amazing, Junie, but then again, you were always good at that kind of thing. These constellations in particular are really something.\nWoods:\nOh! Um, thank you. One of my favorite things to do is to look up at the stars in the middle of the forest.\nApollo:\nHuh, so you're a fan of the night sky then?\nAthena:\nWow Apollo, didn't know you were such a romantic.\nApollo:\nI-It's not like that! I have this friend -- he and I go way back -- who got me really interested in space.\nAthena:\nWait, you had friends when you were young? Color me surprised!\nWoods:\nAs Student Council President, I cannot allow such mean-spirited teasing to continue.\nAthena:\nEep.... (I think she's angry.)\nStage Costume added to the Court Record.\nWoods:\nThe costumes were no problem, but as for singing, I'm not sure I--\nNewman:\nNOOOOO! YOU CAN DOOOOOO IIIIIIT!!!\nO'Conner:\nThat's right. And anyone who says otherwise will have to answer to me.\nAthena:\n(It's like a chivalrous love triangle -- a damsel in distress and two knights in shining armor. Maybe that Themis Herald article wasn't too far from the truth. Speaking of the latest news, I wonder how the mock trial turned out.)\nYour performance (subsequent times)\nWoods:\nI was responsible for making everyone's stage costumes. And this is what I'll be wearing.\nAthena:\nThat's amazing, Junie, but then again, you were always good at that kind of thing. These constellations in particular are really something.\nWoods:\nOh! Um, thank you. One of my favorite things to do is to look up at the stars in the middle of the forest.\nApollo:\nHuh, so you're a fan of the night sky then?\nAthena:\nWow Apollo, didn't know you were such a romantic.\nApollo:\nI-It's not like that! I have this friend -- he and I go way back -- who got me really interested in space.\nAthena:\nWait, you had friends when you were young? Color me surprised!\nWoods:\nAs Student Council President, I cannot allow such mean-spirited teasing to continue.\nAthena:\nEep.... (I think she's angry.)\nWoods:\nThe costumes were no problem, but as for singing, I'm not sure I--\nNewman:\nNOOOOO! YOU CAN DOOOOOO IIIIIIT!!!\nO'Conner:\nThat's right. And anyone who says otherwise will have to answer to me.\nAthena:\n(It's like a chivalrous love triangle -- a damsel in distress and two knights in shining armor. Maybe that Themis Herald article wasn't too far from the truth. Speaking of the latest news, I wonder how the mock trial turned out.)\nSo, who won? (appears after \"Your performance\")\nLeads to:\n\"So, how did the mock trial end?\"\nAthena:\nSo, how did the mock trial end?\nWoods:\nWe were just about to reach a verdict when the police arrived. Now we'll never know how it would've turned out.\nApollo:\nI guess that's what happens when there's a real murder during a fake murder trial.\nAthena:\nIt ended right before the verdict? Talk about bad timing...\nO'Conner:\n.........\nNewman:\nI was THIS close, maaan! I bet I woulda won!!!\nApollo:\nBut I bet the defense wasn't doing too badly either, right?\nO'Conner:\nWe'll settle this some other time. And I assure you, I WILL win when that time comes.\nNewman:\nLike I'm gonna let that happen! I DON'T THINK SO!!!\nAthena:\nI hope they don't end up hurting each other.\nWoods:\nOh, don't worry. The three of us have been good friends since we enrolled here.\nO'Conner:\nHeh. We even have proof of our friendship.\nAthena:\nProof? Like physical evidence, proof?\nWoods:\nYes. We're studying for a career in law, and in the legal world, evidence is everything.\nNewman:\nYeaaaaaah!!! As long as our friendship lasts! You can bet we'll be carrying them around!\nAthena:\nAh, the famed \"Themis Legal Academy ingenuity\" at work! So, what exactly is this \"proof of friendship,\" anyway?\nWoods:\n.........Well... It's a secret. And if I show you, it would be bad luck.\nAthena:\nOh, okay... (I knew it. There's definitely some discord in Junie's voice.)\nO'Conner:\nOur friendship is sacred and inviolable. It's not something to be put cheaply on display.\nNewman:\nProof?! We don't need no stinkin' proof! Us three are friends foreveeeeeer!!!\nAthena:\n(I can hear discord in their voices, too! But they're talking about their friendship. What's going on here?)\nApollo:\nSomething wrong, Athena?\nAthena:\nNo, it's... it's nothing.\nApollo:\nOh... All right, then... Hey, isn't that--!\n???:\nEveryone, stay right where you are! Don't move a muscle!\nAthena:\nD-Detective Fulbright? Is something wrong?\nFulbright:\nWhy, if it isn't my little lawyer friends! Sorry, but the small talk will have to wait. Juniper Woods, you're under arrest for the murder of Constance Courte!\nWoods:\n...I'm what?\nAthena:\nW-Wait a second! What's going on here?! Why are you arresting Junie?!\nApollo:\nPlease, Detective Fulbright. We're involved in this case, too.\nFulbright:\nAh-ha! So, you're the lawyers the dispatch said were first on scene! I can't tell you everything, but I will say this. There are two major reasons for her arrest. Number one! The suspect led someone to where the body was.\nWoods:\nI-I didn't--!\nFulbright:\nAnd number two! The crime scene is exactly how the suspect portrayed it in her script!\nAthena:\nBut...! You can't arrest her on just those grounds!\nFulbright:\nTrue. But there's more! However, Prosecutor Blackquill specifically told me to say no more than that!\nAthena:\n(So Blackquill's the prosecuting attorney on this one, too...?)\nPoliceman:\nDetective Fulbright! We found this in the suspect's pocket!\nFulbright:\nHm? Wh-Why there's...! There's blood on this!\nWoods:\nTh-That's evidence we made for the mock trial!\nFulbright:\nA mock... trial? Never heard of such a thing, but it sounds fishy to me! Real fishy! Now, if you would, officers.\nPoliceman:\nYes, sir!\nWoods:\nB-But... *cough, cough* I... *cough*\nAthena:\nJunie! (I have to do something! I... I can't let them take her away like this!)\nFulbright:\nNow, if you'll excuse me, I have work to do.\nAthena:\n............\nAthena:\nAnime cutscene\nAthena:\nHold it! I refuse to believe that she's the killer! ...Junie! I've decided... I'm going to defend you! I'll fight with everything I've got!\nWoods:\nTh-Thena...!\nAthena:\nJunie! It's good to hear you say that name again.\nFulbright:\nHate to interrupt your bonding time, but... Aren't you rather new to all this? You're barely even a lawyer!\nAthena:\nWell, I don't have much experience, and I may need Apollo and Mr. Wright's help at times... ...but nobody believes in Junie as much as I do!\nApollo:\nI'll help you, too, Juniper. There's no way you murdered your professor.\nWoods:\nThena... *cough* Apollo... Thank *cough* you both. I'm counting on you! *cough, cough*\nAthena:\nWe've got your back, Junie!\nFulbright:\nGuess things worked out after all. Now that you have your lawyers, Ms. Woods, it's time for us to head back to the station.\nAthena:\n(I can't believe Junie's been arrested for murder. And I can't believe I accepted her case without asking Mr. Wright!)\nApollo:\nTake a deep breath and relax, Athena. I'm here to help with whatever you need, so let's get right on the case!\nAthena:\nRight!\nO'Conner:\nHeh. I won't have this case left in the hands of rank amateurs. If anyone's going to solve this case, it'll be me. Time to investigate.\nAthena:\nWhy that smug little--! (He hasn't even finished law school!)\nNewman:\nHUUUUUUGH!!! That was totally ruuude!!! And you're not the only one on the case, maaaaaan!!! I'm in, too! Big time! JUUUUUUUUUNIPER WOOOOOOODS!!! I'm gonna save yooooooooou!!!\nApollo:\nNow that those two are gone, let's get back to what I was talking about in front of the stage. ...About the mock trial, that is.\nAthena:\nOh, right! You said the victim's location, position, and so on were just like in the script!\nApollo:\nExactly. But without the script or any props, it's kind of hard to explain.\n???:\nPerhaps I could help... Herr Forehead.\nApollo:\nP-Prosecutor Gavin! What are you doing here?\nAthena:\nYou two seem to know each other. Is someone going to introduce me?\nKlavier:\nWhy, I do believe we have a fresh face here. Greetings, Fräulein. I am Klavier Gavin. Some know me as a prosecutor, but I'm most famous for my former rock band. We were quite popular you know, but regrettably, the band went kaput. Perhaps you've heard of us? The Gavinners? I was the lead vocalist.\nAthena:\nNever heard of your band. Then again, I was out of the country till only recently. But... can I get your autograph?!\nApollo:\nYou just met him like three seconds ago and you want his autograph?\nKlavier:\nForgive me Fräulein, but I've retired from the music biz. But I'd be happy to offer my autograph as rock star prosecutor, Klavier Gavin.\nAthena:\nOh, okay. That one, then!\nKlavier:\nShe's a lively one, eh, Herr Forehead? Didn't know she was your type.\nApollo:\n.........She's the newest member of Wright Anything Agency, that's all.\nAthena:\nNice to meet you! I'm Athena Cykes!\nKlavier:\nA pleasure to meet you too, Athena Cykes. Now that the intros are out of the way... ...I'm sure you have some questions for me, ja, Herr Forehead?\nTalk\nWhy are you here?\nApollo:\nSo, what are you doing here, Prosecutor Gavin?\nKlavier:\nI'm here for the same reason as your boss -- to give a lecture and a training seminar.\nAthena:\n(So HE'S the famous prosecutor they invited!)\nKlavier:\nAnd... I have another crucial role to play. The Gavinners are getting back together for a one-time special performance.\nApollo:\nEven though you guys disbanded? ...Which was a shame, by the way. Really.\nKlavier:\nJa, I know how much you... adored our music, Herr Forehead. Anyway, I studied abroad in Germany to get my badge early, but I did graduate from here.\nAthena:\nWait, so that performance Junie mentioned...\nKlavier:\nI see you've already heard about that. One student representative was selected to sing with us onstage. And the stage was supposed to look like this tomorrow. Two big banners and a pair of wicked statues. This is just an illustration, but it's not half bad.\nAthena:\nWicked statues...? Wait are these supposed to be you and Mr. Wright?\nKlavier:\nBingo, Fräulein. And they were so big and magnificent, too! What a terrible waste. But the worst part of this whole thing is... ...my long-awaited reunion with my mentor never came to pass.\nAthena:\nWait, don't tell me your mentor was--!\nKlavier:\nProf. Courte. She was the one who taught me how to think about the law.\nConstance Courte (appears after \"Why are you here?\")\nLeads to:\n\"So, Constance Courte was your professor here at the academy...\"\nPresent\nAttorney's Badge\nKlavier:\nMay I ask why you people present your attorney's badges like that? It seems like Herr Forehead and Mr. Wright always want to show theirs off, too.\nAthena:\nWell, let me ask you, Prosecutor Gavin. Why do you play air guitar?\nKlavier:\nAh!\nAthena:\nIt would seem the answer we seek can be found in much the same place.\nApollo:\nI never gave it that much thought, actually. I always just whip it out.\nThemis Herald\nKlavier:\nDid I ever mention I'm a graduate of this fine institution? The mock trials... They sure bring back memories. So many unforgettable battles.\nAthena:\nReally? So, you stood on that stage, too?\nKlavier:\nJa, I waited on my air guitar, rocked out to the beat, and exposed crimes for all to see. You could say this is where my hard-rocking prosecutorial style made its debut.\nAthena:\nHard-rocking prosecutorial style? How did your mock trial turn out?\nKlavier:\nAchtung, baby! I brought the house down and had the crowd on its feet! Ever since, the academy has held a live concert in conjunction with the mock trial.\nAthena:\n(All I wanted to know was how the trials turned out...)\nAnything else\nKlavier:\nWhy, Fräulein, what a wonderful piece of evidence you have there. But I imagine no matter what you present... ...it would be impossible for it to be more persuasive than your beauty.\nAthena:\n(Too bad it doesn't work that way in court, too...)\nAthena:\nSo, Constance Courte was your professor here at the academy...\nKlavier:\nShe may have taught the judge course, but she had a huge impact on me. She was fond of saying, \"The end is only justified through proper means.\" She wouldn't tolerate dishonesty and always revered what was right beyond all else.\nAthena:\n(I can feel Prosecutor Gavin's sadness. Oh, no, I think I'm gonna cry... *sniffle*)\nApollo:\nAthena? Are you tearing up? Though I can't blame you... Prosecutor Gavin owes a lot of who he is to Prof. Courte.\nKlavier:\nExactly. So, as you can see, we are both joined in purpose, so to speak, ja? Now, let's rock this place hard!\nApollo:\nHuh? I don't follow. Let's rock what?\nKlavier:\nForget already, Herr Forehead? I said I'd help you explain the mock trial. We're going to reprise it right here in the Lecture Hall! It might help us catch her killer!\nOctober 24Themis Legal Academy - 3F Lecture Hall\nMock Trial ReenactmentAll Rise\nKlavier:\nRight. the stage is ready. And you, Herr Forehead? Ready to rock?!\nApollo:\nUm, no, the defense is not ready to rock.\nKlavier:\nYou saw the actual mock trial earlier, right? Just relax, you'll do fine. Besides, we have the script right here.\nAthena:\nJunie's masterpiece?! The one everyone's been talking about?!\nKlavier:\nJa, and there's only one in existence. I \"borrowed\" it, if you will. Now, Fräulein, we'll need you to play the part of defendant and judge as per the script.\nAthena:\nOkay, got it!\nKlavier:\nI've only read the case outline so far. I don't know how it actually turns out, so I'll treat this like I'm prosecuting a real case. You, Herr Forehead, will play the part of a fledgling lawyer, a role you were born to play. All the evidence is also here with us. We have everything we need to reprise the mock trial.\nAthena:\nTrès bien! Let's get started. Defendant-slash-judge Athena Cykes, is psyched and ready to rock! Court is now in session for our reenactment of the mock trial... ...or what I'd like to call the mock mock trial!\nKlavier:\nJa, a double mockery, perhaps, but a trial is still a trial. Achtung, baby! It's no holds barred! Let's rock!\nApollo:\nAw, can't we take it easy today?\nAthena:\nAthena:\nIt may just be a mock of a mock, but there's only one way to compete! You play to win! So remember, each time I catch you slacking off, I'm holding you in contempt of court!\nApollo:\nGreat... A judge that voices her own objections AND abuses her judicial powers.\nTalk\nSummary of the facts\nAthena:\nNow, then, Prosecutor Gavin, your opening statement if you please.\nKlavier:\nYou got it, Fräulein Judge! Our case is set in a school very much like this one. The victim -- a professor, female. The defendant -- an Archery Club member, also female.\nAthena:\nOh me, oh my... I'm innocent! Innocent I tell you!\nKlavier:\nThat's some seriously bad acting, Fräulein. Anyway, the victim's body was discovered in the middle of the quad. Here's a shot of the crime scene. Ironically, it was Prof. Courte who posed as the corpse. Herr Forehead, how did the mock trial participants react to this photo?\nApollo:\nMr. Newman was surprised by what Prof. Courte was wearing. He reacted with, \"Oh, the green sweat suit.\"\nAthena:\n(That's not exactly what I would pick to focus on, so why would he care about that?)\nKlavier:\nAh, too much of a fledgling to know what's important, that one. In any case... ...both in the mock trial and the actual case, Prof. Courte was wearing a sweat suit. Moving right along--\nApollo:\nApollo:\nHey, wait a sec! The body was discovered in the same area as the mock case, although there was a stage. Plus, the murder weapon, an arrow, and the lack of blood are also the same!\nKlavier:\nThat's right. And therein lies the significance of this mock mock trial. So let's keep rockin' it hard, just like that!\nDefense's argument (appears after \"Summary of the facts\")\nKlavier:\nBefore the crime occurred, the defendant was to meet the victim in the quad.\nAthena:\nUm, ahem... Let's see here... \"When I arrived at our meeting place, I found the professor with an arrow in her stomach! But... it wasn't me! I didn't kill her!\"\nApollo:\nYou don't have to ham it up like that, Athena.\nKlavier:\nIt's called getting into character, Herr Forehead. Don't be such a wet blanket.\nApollo:\nRight... Um, let's see... Oh yeah, then Hugh said... \"A frail coed used her bare hands to stab her professor with an arrow? I don't think so. At the time of the murder, a male student was seen... ...holding a bow in the Archery Club room, which has a clear view of the quad. He shot the arrow into the victim before my client even got there!\"\nKlavier:\nNein nein, Herr Forehead. That feigned swagger does not suit you in the least.\nAthena:\nOrder! Order!!! ORDER!!! Especially you, Mr. Justice!\nApollo:\nMe?! But I was just trying to get into it like Mr. Euro Rocker said.\nProsecution's rebuttal (appears after \"Defense's argument\")\nAthena:\nSo, the victim was shot from the Archery Club room before the meeting even took place. Hence, the defendant could not be the killer. That seems to be the defense's assertion. Prosecutor Gavin, do you have any objections?\nKlavier:\nThe autopsy report notes that the edges of the victim's wound were unusually ragged. Could such physical trauma possibly result from an arrow shot from a bow? Nein! I believe the victim was impaled with the arrow by hand... postmortem. In short, the real murder weapon was not the arrow at all.\nApollo:\nWhen Robin was prosecutor, he had a tough time determining the real murder weapon.\nKlavier:\nWell, he's just a student, a warm-up act, while I am the real deal, the headliner, so to speak. The true murder weapon was most likely the awl that was left in the art room.\nAthena:\nAn awl, what's that? Er, I mean... Hmm... An awl, you say? What might that be?\nKlavier:\nIt's a kind of tool used for poking holes in paper, wood, and other materials. It's kind of like an ice pick. I have a photo here if you're interested.\nAthena:\nGross.. It's all bloody up to the handle. Please tell me it's just paint.\nKlavier:\nMost likely, Fräulein. Pretty realistic, ja? Let's pretend it's real blood for now. The defendant's prints were lifted from the murder weapon. Furthermore, traces of the victim's blood were discovered in the art room. That's where I believe the murder actually took place.\nAthena:\nSo, the question now is, how did the body get from the art room to the stage?\nHow the body was moved (appears after \"Prosecution's rebuttal\")\nLeads to:\n\"The murder took place in the third floor art room, but the body was found in the quad.\"\nKlavier:\nThe murder took place in the third floor art room, but the body was found in the quad.\nAthena:\nIt must've been quite a chore moving the body all that way.\nKlavier:\nNot at all. There's a maintenance area and storehouse right outside the art room. And a cart used to carry balls around was found there.\nAthena:\nOh, I think I've seen one of those before. But that's a pretty big one.\nKlavier:\nA jumbo, ja? Big enough to fit a person -- or a body -- in it. The defendant dropped the body from the art room window, then moved it with the cart. That is how a high-school girl could easily move a body all by herself!\nAthena:\nY-You don't saaaaaaaaaaay!\nApollo:\nApollo:\n\"A body dropped from three stories up would show signs of massive blunt force trauma!\"\nKlavier:\nKlavier:\nThat may be true, but... ...you failed to account for the large high jump mat in the storehouse. A body dropped onto such a mat would show no signs of blunt force trauma.\nApollo:\nYikes... It's almost scary how similar this whole case is to the mock trial proceedings.\nKlavier:\nQuite the crafty killer. In an attempt to case suspicion on the Archery Club... ...they moved the body to the quad where it would be an easy shot from the clubroom. Then the killer faked the murder weapon by inserting an arrow into the awl's stab wound.\nAthena:\n(Sounds like he has only high praise for Junie's script.)\nKlavier:\nWere there any further arguments from the defense?\nApollo:\nNope. It seemed like the teacher who was playing the judge was satisfied, too.\nKlavier:\nTime for the finale, then. Your verdict if you please, Fräulein Judge!\nAthena:\nHuh? Oh, right, that's me! Very well, this court finds the defendant, Juniper Woods-- Wait a second. Even if this is just a mock trial of a mock trial... ...I don't want to declare Junie guilty!\nKlavier:\nYeah, perhaps that's not such a good idea. Let's end our mock mock trial here. Besides, it's about time I get back to my investigation.\nAthena:\nThanks, you two! That little run-through of the mock trial cleared up quite a few things!\nMock Trial Script added to the Court Record.\nKlavier:\nAchtung, baby! The prosecution's already got a witness sized up, too.\nAthena:\nThat was quick. (Prosecutor Blackquill's almost too good...)\nApollo:\nYou're in such a helpful mood today, Prosecutor Gavin...\nKlavier:\nWell, like I said, I just want to catch whoever killed Prof. Courte. And there's no reason for me to start butting heads with you two. Anyway, I won't say goodbye, as I'm sure I'll be seeing you later.\nAthena:\nI always thought prosecutors were all a rather scary bunch. But Prosecutor Gavin seems pretty nice.\nApollo:\nYeah, he's not so bad as prosecutors go. We should get back to investigating, too. We don't have nearly enough information yet.\nAthena:\nAnd we also have to tell Mr. Wright that we accepted Junie's case.\nApollo:\nRight. Looks like we have our work cut out for us!\nTalk\nAny ideas?\nApollo:\nThe most prominent feature of this case is how closely it resembles the script. That makes it a tough one because we have to have a firm understanding of them both.\nAthena:\nNo sweat! We can reenact the mock trial as many times as we want by reading the script! I'll check it out in the Court Record and commit it to memory later!\nApollo:\nGood. I bet the script and the mock trial are going to be the centerpiece of the real trial. Make sure you know them inside and out.\nAthena:\nYes, sir, Mr. Justice!\nApollo:\nMr. Justice? Careful, I could get used to that.\nThe investigation\nAthena:\nApollo, any advice on how to investigate this case?!\nApollo:\nOh, uh... Start by interviewing people about the basic facts.\nAthena:\nInterview people! Got it! Hey, you there! What can you tell me about the--\nApollo:\nWhoa, hold on, Athena! The trial's tomorrow, so try to limit it to people with some relation to the case.\nAthena:\nOkay, got it! Limit the interview pool!\nApollo:\nRight... You might also want to take it down a notch, otherwise you'll be dead by tomorrow.\nAthena:\n(He wants me to calm down?! At a time like this?! Junie's fate rests in my hands. I just HAVE TO win this one...!)\nPresent\nAttorney's Badge\nApollo:\nOh, nice. Your attorney's badge! That's the first thing you want to present when you meet someone new. I heard that's what all lawyers do.\nAthena:\nYou heard that? From whom?\nApollo:\nWho else, Mr. Wright. Just remember, your badge comes first! See, Athena! Check it out! This is my attorney's badge!\nAthena:\n(Ooh! That's so intense! I want to present mine like that, too!)\nThemis Herald\nApollo:\nA torrid love triangle? Juniper sure is popular with the guys.\nAthena:\nOf course she is. She's pretty, plus she has such a sweet and caring personality.\nApollo:\n.........\nAthena:\nI know what you're thinking. Why can't Athena be more like that, right?\nApollo:\nArgh! N-No, no! The thought never crossed my mind!\nAthena:\n(Let's see... Panic... Sorrow... Yep, that's exactly what crossed his mind. *sigh*)\nMock Trial Script\nApollo:\nThe mock trial was quite the heated battle.\nAthena:\nTsk, Mr. Wright didn't even hear me when I said I wanted to see it. That was so unfair. We should've done rock, paper, scissors to decide who got to watch. I know I would've totally beaten you.\nApollo:\nHow could you know that? The game's totally random.\nAthena:\nNo, I can tell you favor scissors. I mean, the proof's sticking right out of your head.\nApollo:\nHuh? What're you talking about?\nAthena:\n(Like I said, it's right there on your head!)\nAnything else\nApollo:\nYes! Nice one, Athena. Keep it up! I don't care if it's totally unrelated to the case or just plain annoying or even embarrassing. Just keep presenting evidence without any regard for others! That's the first step towards becoming a successful trial lawyer!\nAthena:\nLeave it to me! I'll one piece after another, and then another!\nOutdoor Stage (before clearing \"Rumor about the academy\" Talk option in Themis Legal Academy - 1F Hallway)\nPoliceman:\nHey, what do you think you're doing? The crime scene is off-limits to students.\nAthena:\nTsk, I'm no student. I'm a lawyer!\nPoliceman:\nYeah, right! Just because you're in law school doesn't mean you're a lawyer!\nApollo:\nYou should see what she did to the last cop who said something like that her.\nPoliceman:\nWhy you--! Are you threatening an officer of the law?!\nApollo:\nYikes! N-N-No, it's not a threat! It's more like a friendly warning!\nAthena:\n(...*sigh* Guess we should go before I get myself arrested for assaulting an officer.)\nWright Anything Agency\nTalk\nAny ideas?\nTrucy:\nA school festival? Why didn't you take me with you?\nAthena:\nOh, um... Only Mr. Wright was officially invited. Apollo and I are just tagging along, but we ARE lawyers, after all.\nTrucy:\nWell, my magic act would've made a great warm up for the mock trial. They'd have seen how even the most crucial evidence could vanish in the blink of an eye!\nAthena:\n(That's probably precisely why Mr. Wright didn't invite you.)\nThe academy\nTrucy:\nAthena, don't you think the Wright Anything Agency has about run its course?\nAthena:\nWh-What do you mean?\nTrucy:\nIsn't it obvious? It's time for the Wright Anything Academy! And you, Athena, I want you to be the head of our Psychology Department.\nAthena:\nOh... What other departments will we have?\nTrucy:\nWell, I'll be the head of the Magic Department... ...and we'll have a Chords of Steel Department and a Bluffing Department!\nAthena:\n(But then who'll be the head of the Toilet Cleaning Department?)\nPresent\nAttorney's Badge\nTrucy:\nHey, that's an attorney's badge!\nAthena:\nPromise me you won't make it disappear.\nTrucy:\nAh! What a mean thing to say! Do I look like someone who'd do something like that?\nAthena:\nNo, I didn't mean it like that. Anyway, I hear they reissue badges that get lost, so...\nTrucy:\nHey, isn't that great! That means you have nothing to worry about!\nAthena:\nYeah! ...But seriously, please don't make mine disappear. I wouldn't want to have to explain.\nThemis Herald\nTrucy:\nHey, is that the morning paper?\nAthena:\nSomething like that. It's a school paper. I was thinking, your magic tricks would make a great article.\nTrucy:\nReally?! A newspaper article about my tricks? That would be so cool! The moment the interview starts, I'd suddenly disappear, shocking the interviewer! Without an actual interview, they could call the article, \"The Interview that Vanished\"!\nAthena:\n(I'll just leave it at that.)\nAnything else\nTrucy:\nWow, thanks, Athena! That'll make a great new prop for my magic act!\nAthena:\nHuh? But that's--\nTrucy:\nSo, what kind of trick should I do with it? Make it disappear? Burn it? Rip it in two?\nAthena:\nHa ha ha. Let's just save that fun little detail for later.\nTrucy:\nAww, you're no fun.\nOctober 24Themis Legal Academy - 1F Hallway\nAthena:\nAh, Mr. Wright!\nPhoenix:\nI heard they arrested your friend Juniper.\nApollo:\nYeah, Detective Fulbright just took her in.\nMeans:\nI refuse to believe that one of our students is capable of murder. We must prove her innocent by any means necessary! The end justifies the means!\nAthena:\nWhat do you mean, the end justifies the means?\nMeans:\nI, Prof. Means, always say what I mean, and mean what I say by all means! Here at our esteemed academy, we train our students to produce meaningful results. You believe in Juniper's innocence, do you not?\nAthena:\nOf course, I do! Junie wouldn't even hurt a fly!\nMeans:\nPrecisely. We have justice on our side. The only other thing we need are results. It is the height of folly to endanger your client by failing to pursue all means possible!\nAthena:\nUm... sure I want to prove her innocence, but... (I don't like the sound of that \"end justifies the means\" part.)\nMeans:\nWell, you are still young and idealistic. It's no wonder you fail to see the wisdom therein. There is but one thing to do now. I must personally take up Juniper's defense.\nPhoenix:\nYou're going to take her case, Prof. Means?\nMeans:\nI may be a professor, but I am still licensed to practice law. In fact, I have even battle Prof. Courte in... well... in court!\nApollo:\nNo kidding?! So you guys were rivals or something?\nMeans:\nNo, nothing of the sort. She was an esteemed colleague at the academy and in court. You see, both Prof. Courte and I graduated from this academy at the top of our class.\nAthena:\n(Wow, I bet they both used to really bring it.)\nMeans:\nNow, if you would excuse me, I had best go discuss the case with Juniper.\nAthena:\nProf. Means, please, wait! I didn't want to say anything, but Apollo and I already agreed to take her case.\nApollo:\nIt's true. Juniper is counting on us to prove her innocence.\nMeans:\nReally now? You two?\nPhoenix:\nAnd when were you planning on telling me?\nAthena:\nS-Sorry, Boss. I know we should've asked first, but...\nPhoenix:\nAh ha ha. Relax. Your friend was just hauled away in front of your eyes. Sometimes you just have to make snap decisions. And I think you made the right one.\nMeans:\nHow wonderful! Very well, Athena Cykes, let me ask you just one thing. As a lawyer, what is it that you treasure beyond all else?\nAthena:\nHeh heh! That's an easy one, Professor! Seeking justice for my clients! (Changed from [Heh heh! That's any [sic] easy one, Professor! Seeking justice for my clients!] in the original release)\nMeans:\nWhat a wonderful answer. Juniper must be overjoyed to have a friend such as you. As her professor, I too, shall do whatever I may to help her. And if you decide to take the-end-justifies-the-means strategy, come see me at once!\nAthena:\n(Let's hope it never comes to that.)\nMeans:\nNow, if you would excuse me.\nPhoenix:\nWell, time's a wasting. You better start investigating and fast. But first, how about I tell you everything I know so far?\nAthena:\nYes, please!\nTalk\nAbout the murder\nAthena:\nHave you learned anything new about the case?\nPhoenix:\nActually, I ran into Prosecutor Gavin, and he told me something interesting. Seems the murder took place in the art room. There's traces of a large pool of blood there. So the police believe the body was moved from there to the stage.\nAthena:\nWhat? Really?! (Just like the mock trial again!)\nPhoenix:\nThe police are searching the art room, but whether they'll find anything, well...\nAthena:\nWell what? (Come to think of it...)\nPhoenix:\nLet's do our own crime scene investigation before it gets too crowded around here.\nAthena:\nHuh?! Are we even allowed to do that?\nPhoenix:\nIt's no big deal, as long as we leave it exactly like we found it. Plus... No, never mind.\nAthena:\n(Now, where was I again?)\nPhoenix:\nBut there's really no need to talk about it right here, right now. I want you two to find out for yourselves.\nRumor about the academy (appears after \"About the murder\")\nPhoenix:\nSo, were you shocked by your conversation with Prof. Means?\nAthena:\nOh, umm, I guess so. (Actually, that was pretty shocking.)\nPhoenix:\nThe dark age of the law... I'm sure you've heard those words before.\nAthena:\nSure, a number of times. Prosecutors file false charges and lawyers fight back by fabricating evidence. There's a lot of that going around these days.\nApollo:\nBut the question is, how is it related to the case at hand?\nPhoenix:\nTraining students to produce results... That is the school's policy.\nAthena:\nWell, that in and of itself isn't a bad thing.\nPhoenix:\nRight. ...As long as those results come by fair and honest means.\nAthena:\nOh, but what was it that Prof. Means said?! \"The end justifies the means\"?\nPhoenix:\nTo survive the dark age of the law, you must use any means necessary. Fabrication of evidence and false charges are unavoidable in the quest for results. That's what they're preaching here at Themis Legal Academy.\nAthena:\nB-But... What'll happen to our legal system if results are all that matter anymore?!\nPhoenix:\nAh ha ha, relax. It's just a rumor. I'd take it with a grain of salt if I were you.\nAthena:\nOh, that's a relief. (He had me going there for a minute. Wait a second! What if Mr. Wright examined the victim's body for a reason! Maybe he was worried someone might actually tamper with the evidence!)\nPhoenix:\nI think that about wraps up what I know so far. The fact that this case closely resembles Ms. Woods's script is obviously important. Knowing that, you should probably try and identify what's the same and what's different.\nAthena:\nOkay! I'll try talking to as many people as I can on campus!\nRumor about the academy (subsequent times)\nPhoenix:\nSo, were you shocked by your conversation with Prof. Means?\nAthena:\nOh, umm, I guess so. (Actually, that was pretty shocking.)\nPhoenix:\nThe dark age of the law... I'm sure you've heard those words before.\nAthena:\nSure, a number of times. Prosecutors file false charges and lawyers fight back by fabricating evidence. There's a lot of that going around these days.\nApollo:\nBut the question is, how is it related to the case at hand?\nPhoenix:\nTraining students to produce results... That is the school's policy.\nAthena:\nWell, that in and of itself isn't a bad thing.\nPhoenix:\nRight. ...As long as those results come by fair and honest means.\nAthena:\nOh, but what was it that Prof. Means said?! \"The end justifies the means\"?\nPhoenix:\nTo survive the dark age of the law, you must use any means necessary. Fabrication of evidence and false charges are unavoidable in the quest for results. That's what they're preaching here at Themis Legal Academy.\nAthena:\nB-But... What'll happen to our legal system if results are all that matter anymore?!\nPhoenix:\nAh ha ha, relax. It's just a rumor. I'd take it with a grain of salt if I were you.\nAthena:\nOh, that's a relief. (He had me going there for a minute. Wait a second! What if Mr. Wright examined the victim's body for a reason! Maybe he was worried someone might actually tamper with the evidence!)\nPresent\nThemis Herald or Mock Trial Script\nPhoenix:\nThings like that sure scream out \"school days,\" don't they?\nAthena:\nWere you involved in any extracurricular activities like school papers or mock trials?\nPhoenix:\nNah, that wasn't my thing. I was an art major.\nAthena:\nAn art major? Then how did you become a famous attorney?\nPhoenix:\nIt's kind of complicated. And when I say, kind of, I mean really, really complicated.\nAthena:\nOh... (...He must really mean it. I'm picking up a lot of complex emotions in his voice.)\nAfter clearing \"Rumor about the academy\" Talk option in Themis Legal Academy - 1F Hallway:\nOctober 24Themis Legal Academy - 3F Lecture Hall\nAthena:\nLook, there's Hugh! Hey, Huuuuugh!\nO'Conner:\nOh, it's you two. Do you want something?\nApollo:\nDid you find anything? You said you were going to do some investigating of your own.\nO'Conner:\nNope, nothing yet. I'm afraid it's not looking very good for Juniper.\nApollo:\nYou don't really think Juniper could have done something like this, do you?\nO'Conner:\nOnly the author and the victim knew the contents of the script. Both the stage and the art room were in the exact same state as described therein. Nobody could mimic the crime like that unless they'd already read the script... or... wrote it.\nAthena:\nB-But!\nO'Conner:\nLook, Prof. Means is better able to handle this than you two, so just leave it to him!\nAthena:\n(There it is again. I'm picking up some discord in Hugh's voice.)\nTalk\nHugh O'Conner\nAthena:\nHugh, would you mind telling me a bit about yourself?\nO'Conner:\nHeh, whatever. I'm 6'1\" and under this uniform, I'm one hundred percent lean muscle. My grades are outstanding and I'm the ace of the Archery Club. Needless to say... ...I never miss my mark. Oh, and I'm incredibly humble, too.\nAthena:\n(How can he even say that with a straight face?)\nO'Conner:\nThose around me call me a genius, but I pay them no mind. But when it comes to tests... I always get a hundred percent, so I suppose it's only natural for them to say I'm a genius. But, as I said before, I pay them no mind.\nAthena:\n(I heard you the first time.)\nApollo:\nBut what about the mock trial? It sounded like you were about to lose to Robin.\nO'Conner:\nHeh. There's a very good reason for that. You see, right before the mock trial started... I saw the body.\nAthena:\nY-You saw the body?!\nO'Conner:\nRight, and I was so distraught that I basically handed Robin a victory.\nApollo:\nHugh, would you mind telling us a little more about that?\nDiscovering the body (appears after \"Hugh O'Conner\")\nO'Conner:\nRight before the mock trial, the campus was empty. Everyone was here in the Lecture Hall.\nYour attention please. This is an announcement from the Mock Trial Committee. The mock trial will begin shortly. All students and faculty please proceed at once to the Lecture Hall.\nAthena:\n(That's right... There was that announcement and the everyone came in here.)\nO'Conner:\nThe only exceptions were the mock trial participants. Juniper, Robin and I were in our personal dressing rooms next door.\nApollo:\nWow, your own personal dressing rooms? That's total VIP treatment.\nO'Conner:\nActually, they're for student-teacher meetings. They don't even have windows. The other two waited patiently in their rooms, but that's not my style. So, I headed over to the archery range on the other side of the quad. I did some meditation while I waited. That's the best way to relax. Then, just before the mock trial was about to start, I headed back toward the main building. As I walked across the quad, I passed in front of the stage.\nAthena:\nSo, that's when you saw the body?\nO'Conner:\nRight. It was quite a shock. As much as I hate to admit it, my legs were shaking. I could've easily beaten Robin if it hadn't been for that.\nApollo:\nWait, hold it right there. You went through with the mock trial even though you had just discovered a body? Why didn't you tell anyone? I mean, we're talking about someone getting killed here!\nAthena:\nI think I know why... Was it because of this?\nO'Conner:\nAh! Where'd you get that?!\nAthena:\nSo, this article in the Themis Herald IS true. The winner of the mock trial would get to make his confession to Junie.\nO'Conner:\nRight. But if I reported the body I'd found, the whole thing would be called off.\nAthena:\n(He really wanted to win that bad? Bad enough to ignore a dead body? Sorry, but that's not normal. ...Or could their love for Junie really be that strong?)\nApollo:\nThanks for sharing that important piece of information with us. It may prove useful at tomorrow's trial.\nO'Conner:\nGood. Because that's all I have to say about the matter.\nAthena:\nThanks. And don't worry, we'll prove Juniper's innocence, you'll see.\nO'Conner:\nHeh, I can't say you two inspire much confidence.\nApollo:\nOkay, Athena, what next?\nDiscovering the body (subsequent times)\nO'Conner:\nRight before the mock trial, the campus was empty. Everyone was here in the Lecture Hall.\nYour attention please. This is an announcement from the Mock Trial Committee. The mock trial will begin shortly. All students and faculty please proceed at once to the Lecture Hall.\nAthena:\n(That's right... There was that announcement and the everyone came in here.)\nO'Conner:\nThe only exceptions were the mock trial participants. Juniper, Robin and I were in our personal dressing rooms next door.\nApollo:\nWow, your own personal dressing rooms? That's total VIP treatment.\nO'Conner:\nActually, they're for student-teacher meetings. They don't even have windows. The other two waited patiently in their rooms, but that's not my style. So, I headed over to the archery range on the other side of the quad. I did some meditation while I waited. That's the best way to relax. Then, just before the mock trial was about to start, I headed back toward the main building. As I walked across the quad, I passed in front of the stage.\nAthena:\nSo, that's when you saw the body?\nO'Conner:\nRight. It was quite a shock. As much as I hate to admit it, my legs were shaking. I could've easily beaten Robin if it hadn't been for that.\nApollo:\nWait, hold it right there. You went through with the mock trial even though you had just discovered a body? Why didn't you tell anyone? I mean, we're talking about someone getting killed here!\nAthena:\nI think I know why... Was it because of this?\nO'Conner:\nAh! Where'd you get that?!\nAthena:\nSo, this article in the Themis Herald IS true. The winner of the mock trial would get to make his confession to Junie.\nO'Conner:\nRight. But if I reported the body I'd found, the whole thing would be called off.\nAthena:\n(He really wanted to win that bad? Bad enough to ignore a dead body? Sorry, but that's not normal. ...Or could their love for Junie really be that strong?)\nPresent\nAttorney's Badge\nO'Conner:\nHeh. Your attorney's badge? Looks brand new. That just shows how inexperienced and useless you are.\nAthena:\nWell, when you get your badge, it will be new and shiny, too!\nO'Conner:\nHeh. You mouth-breathers just don't get it, do you? My badge will be a symbol of my genius. From the moment I get it... It will be chipped, bent, and worn as if it's been through a thousand courtroom battles.\nAthena:\n(He's like some hipster doofus.)\nArrow\nO'Conner:\nThat's from the Archery Club. We let the school use it for the mock trial. Never figured it would end up being used like it was.\nAthena:\nOf course, the real murder weapon isn't an arrow at all.\nO'Conner:\nI know. But the fact remains that it was used in this whole insidious plot. But a mouth-breather like you couldn't possibly understand. You see, archery is a sport that demands advanced mental focus. And the killer's actions have done harm to its image.\nAthena:\nI know exactly what you mean, except for that mouth-breather remark.\nO'Conner:\nWell, let's hope that someday you will because it couldn't be any more self-evident.\nAthena:\n(I like him less and less every time he opens his mouth.)\nCourte's Planner\nAthena:\nIs it just me or is this your name here?\nO'Conner:\nHeh, that's my name, but how should I know what it's doing there? But being that the whole campus looks up to me... ...I'm not surprised to find my name mentioned here and there.\nAthena:\n(And I'm not surprised he said that, being the narcissist he is.)\nThemis Herald or Themis Herald Extra\nAthena:\nSo, you really declared that you'd confess to Junie if you won the mock trial? (Because he's definitely not the shy type.)\nO'Conner:\nHeh. Yeah, well, that's just the genius that is me. My thoughts and actions are on a whole other level from you mouth-breathers.\nAthena:\n(No, it's your vanity that's on a whole other level.)\nMock Trial Script\nO'Conner:\n...I get it. This is your way of mocking my defeat. You like shoving people's shame in their faces. That's your modus operandi.\nAthena:\nNo, that wasn't my intention. Besides, you were never actually defeated.\nO'Conner:\nOh, I suppose you're right. ...Or is this a trick intended to provoke me.\nAthena:\nThat wasn't my intention, either!\nO'Conner:\nThen what WAS your intention?! I know! You're trying to toy with my emotions!\nAthena:\n(Wow, this guy can't take being humbled, old country style.)\nAnything else\nO'Conner:\nRandom junk from some mouth-breather? What makes you think I'd want to see that? Heh. The least you could do is make it more interesting, like by telling me how cool I am.\nAthena:\n(Who does this guy think he is?!)\nAfter clearing \"Rumor about the academy\" Talk option in Themis Legal Academy - 1F Hallway:\nOctober 24Themis Legal Academy - Maintenance Area\nAthena:\nSo this is the maintenance area. Let's see... During the mock mock trial, Prosecutor Gavin said... ...that the art room is right above here on the third floor... ...and that they body was dropped from there onto a high jump mat from the storehouse.\nApollo:\nRight. And then he claimed that the body was transported to the stage in a ball cart. And then... Hm? There's someone else here...\nAthena:\nHey, it's Robin!\nNewman:\nWhoooooooooa! You scared the crud outta meeeeee!!!\nAthena:\nYikes! Right back at you! ...So, what are you doing out here?\nNewman:\nI'm working out so that I can become strong enough to save Juniper! But I'm so worked up... my training brace is almost breaking at the seams!\nAthena:\nOh, right... The girl you like got arrested, so you're psyching yourself up to rescue her?\nNewman:\nYes! Because! I'm the manliest of manly men! ...That's why I work out with my manly brace!\nAthena:\n(Except that I hear some discord in that manliest of men's voice of yours...)\nApollo:\nI don't mean to be rude, but can't you talk without shouting?\nNewman:\nSorry! I'll try not to shout so much! If at all possible, that is!!!\nAthena:\n(...Which is \"not at all possible\" by the sound of it.) Um, so do you mind if I ask you some questions as Junie's lawyer?\nNewman:\nNo problem! Ask away! Keep 'em coming, maaaaaan!!!\nAthena:\n(Ouch... My ears ache already.)\nTalk\nRobin Newman\nAthena:\nRobin, could you tell me a little more about yourself?\nNewman:\nYou wanna know about meee?! I'm a second-rate member of the Fine Arts Cluuub!!!\nAthena:\nThe Fine Arts Club?\nAthena:\nLooks like broken pottery or plaster. Maybe this is the source of that noise we heard.\nPhoenix:\nHmm, there were supposedly two statues on this stage. I seem to recall hearing that a coed from the Fine Art Club had made them.\nKlavier:\nTwo big banners and a pair of wicked statues. This is just an illustration, but it's not half-bad.\nAthena:\nWicked statues...? Wait are these supposed to be you and Mr. Wright?\nKlavier:\nBingo, Fräulein. And they were so big and magnificent, too! What a terrible waste.\nAthena:\nSay... Did you create those stage statues by any chance?\nNewman:\nYou bet I did! Both of 'em! Put my blood, sweat, and tears into those things, maaan!\nApollo:\nIt must've been terrible seeing them all smashed up like that.\nNewman:\nNah! I couldn't face Prof. Courte if I let something like that get me down!!!\nAthena:\nWhat do you mean?\nNewman:\nProf. Courte was the Fine Arts Club advisor! She was all about truth and beauty, maaan!!! She always said, \"The only good result is the truth\"! That and... ...\"Only lawyers who seek the truth through legitimate means produce worthwhile results\"!\nAthena:\nYeees! I'm totally on your guy side! She must have been an incredible woman!!!\nApollo:\nYeesh, and you call ME loud when I practice my Chords of Steel...\nAbout the murder\nNewman:\nAw, maaaaaaaaan! Why'd I have to take the prosecutor course! I mean, how am I supposed to save Juniper if I'm studying to be a prosecutor?!\nAthena:\nDon't worry. I'll clear Junie's name, you'll see.\nNewman:\nThe three of us had a dream! We swore we'd make it happen TOGETHER!!! Prosecutor! Lawyer! Judge! The three of us would hold fair and honest trials! The dark age of the law? Ha! We were gonna put a nail in its coffin, maaaaaan!\nApollo:\nWow, you guys swore to do that?\nNewman:\nBut, noooo! That stupid school rule had to ruin it!\nAthena:\nSchool rule? Which one?\nNewman:\nAnyone with a prior conviction, no matter how minor the offense, they won't...! They won't be allowed to graduate from this stupid, holier-than-thou schoooool!!!\nApollo:\nA tough legal academy, with even tougher rules...\nAthena:\n(Junie will never become a judge unless I can prove her innocence. And if I fail, the three of them will never realize their dream. ...It's like someone put pressure on my pressure.)\nPresent\nAttorney's Badge\nNewman:\nWhooooooa! Check out your badge!\nAthena:\nWhat do you think? Nice and shiny, huh?\nNewman:\nYeah! It's AWESOME!!! If the plating ever starts to peel or it gets all bent up, lemme fix it up for you!!!\nAthena:\nReally?! Thanks!\nNewman:\nNo problemo! I'll have some primo clay and glaze at the ready, just in case!!!\nAthena:\n(Wait, what does clay have to do with my badge?)\nThemis Herald\nNewman:\nAh! That paper!!!\nAthena:\nSo, Robin, is this article true?\nNewman:\nThe author of that article has been gunning for the three of us for some reason! It's been nothing but trashy articles like this as long as I can remember!\nAthena:\nHmm... Maybe the author just wants your attention?\nNewman:\nNo waaaaaaay, maaan! The venom in those articles is waaay beyond that!!!\nAthena:\n(Hmm, I wonder...)\nMock Trial Script or Themis Herald Extra\nNewman:\nWhoooa! Déjà vu, maaaaaan! It's like I can almost taste my near victory again! But noooooo!!! The final showdown was canceled because of that murder!\nAthena:\nThis topic sure seems to strike a raw nerve. I hope it doesn't come between you guys.\nNewman:\nYou kidding?! Our friendship...! It's like a diamond, only tougher!!! It's like a powder keg before a spark!!! It's like the calm before the storm!!!\nAthena:\n(In other words, it's under a lot of pressure and ready to blow at any moment...?)\nAnything else\nNewman:\nWhooooooa! Did you make that?! Lemme fire it in the kiln for you! Just give it to me and I'll take care of the rest!\nAthena:\nI think I'll pass on the kiln firing this time. (Phew, dodged a bullet there!)\nAfter clearing \"Rumor about the academy\" Talk option in Themis Legal Academy - 1F Hallway:\nOctober 24Themis Legal Academy - Outdoor Stage\nApollo:\nI thought the area was cordoned off. Hey, the police are discussing something over there.\nAthena:\nOoh, I know! I'll just quietly sneak over for a listen. Here goes...\nApollo:\nAh! Athena, watch where you're--!\nAthena:\nHuh? Eeeeeeeeek! Ouch! Who put this stupid box here? Wait............ Eek! A-A-Apollo! This box, there's...!\nApollo:\nWh-What now?\nAthena:\nTh-Th-There's! There's someone or... *gulp* something inside!\nApollo:\nDon't let it be a SNAAAAAAAAAAAAKE!\n???:\n............Sss, sss, sss. You morons just blew my cover.\nApollo:\nWhat the--? There really is someone inside...\n???:\nSss, sss, sss, sss, sss! That someone is me, Myriam Scuttlebutt.\nScuttlebutt:\nAnd I'm a senior in the judge course.\nAthena:\nWh-What's with the box?\nScuttlebutt:\nSss, sss, sss. It's the fate of we who live in the shadows. There's a very good reason why none may see my face by the light of day!\nApollo:\nWait, if you're taking the judge course, did you write a mock trial script, too?\nScuttlebutt:\nSss, sss, sss. You really want to see my script that bad? Well, you better watch out. Read it without my permission and you'll wish you hadn't!\nAthena:\n(Who cares? I'm sure it was rejected for a good reason.)\nTalk\nMyriam Scuttlebutt\nAthena:\nOh, so you're studying to be a judge, too? You must be classmates with Juniper. Are you a friend of hers?\nScuttlebutt:\nJuniper? Sss, sss, sss. Sure, she's my friend. That's why I'm gathering info. Now, tell me all you know. You know, for tomorrow's trial.\nAthena:\nFor tomorrow's trial? What are you talking about?\nScuttlebutt:\nSss, sss, sss. I'm going to take the stand, naturally.\nAthena:\nSo, the witness for the prosecution is... some weirdo in a cardboard box?\nScuttlebutt:\nKahk-kahk! This disguise is how I get my scoops! ...But you're right. It's me. So tell me everything you know for Juniper's sake!\nApollo:\nW-Wait a second, Myriam. Repeat what you just said.\nScuttlebutt:\nA lawyer with brains as bad as his ears. Poor Juniper! I'm taking the stand tomorrow. Tell me everything you know for Juniper's sake. Clear enough for you this time?\nBRACELET THUMPS\nApollo:\nI thought so. Athena, my bracelet's reacting.\nAthena:\nReally?! That means...! (A lie, already? That was quick!)\nPresent Bracelet\nScuttlebutt:\nI'm taking the stand tomorrow. Tell me everything you know for Juniper's sake.\nPerceive tightening grip on box on \"for Juniper's sake.\"\nApollo:\nApollo:\nThat's strange. You suddenly tightened your grip when you said, \"for Juniper's sake.\" It's like you subconsciously tensed up because you're lying.\nScuttlebutt:\nKahk-kahk! Wh-What're you talking about?! When did I ever lie?!\nAthena:\nOkay, then let me ask you this... Why were you selected as a witness?\nScuttlebutt:\nSss, sss, sss. That's an easy one. I'm the editor-in-chief of the Themis Herald. I know everything there is to know around campus, even the darkest of secrets.\nApollo:\nEditor-in-chief, huh? Pretty impressive.\nScuttlebutt:\nSss, sss, yeah well, it's a lonely, one-woman operation. I do it all myself, from reporting, to editing, to publishing. Still impressed? I'm a perfect storm of journalism because I bring it all to the table, sss, sss, sss, sss! ...And this is the evidence. Here! An extra edition of the Themis Herald, published to coincide with the mock trial!\nThemis Herald Extra added to the Court Record.\nAthena:\nThanks, Myriam. You've revealed who you truly are: Someone who's never had Junie's best interests in mind. (Changed from [As someone who's never had Junie's best interest in mind.] in the original release)\nScuttlebutt:\nWhat?! Are you questioning our friendship?!\nAthena:\nLook, you may want answers, but... No can do, because what you're saying conflicts with this piece of evidence.\nPresent Themis Herald\nAthena:\nLeads to:\n\"That's the Themis Herald, the paper I publish. What about it?\"\nPresent anything else\nAthena:\nScuttlebutt:\nSss, sss, sss! You just gave me an idea for an extra addition headline! Extra, Extra! \"Juniper Woods Headed for Conviction? Scatterbrained Attorney to Blame.\"\nAthena:\nScatterbrained? If I'm wrong, just say so.\nApollo:\nThere's nothing iffy about it. You're way wrong.\nAthena:\nUgh!\nScuttlebutt:\nSss, sss! Scatterbrained, scatterbrained! Sss, sss, sss, sss, sss! Now, out with it! Tell me everything you know for Juniper's sake!\nLeads back to:\n\"No can do, because what you're saying conflicts with this piece of evidence.\"\nScuttlebutt:\nThat's the Themis Herald, the paper I publish. What about it?\nAthena:\n...Are you really that dense? This article is full of malicious lies about Junie! It's definitely not something a true friend of hers would write!\nScuttlebutt:\nKahk-kahk! Y-You got it all wrong! Another staff member wrote that one!\nAthena:\nI don't think so, Myriam. You even said it yourself just a moment ago. \"It's a one-woman operation.\" Or did you forget already?\nScuttlebutt:\nKaaahk kahk-kahk-kahk! If you'd just give me the info you have--! Stupid pawn! Juniper's just using you!\nLeads back to Talk options\nPerceive wrong area\nApollo:\nApollo:\nMyriam, your unease is betrayed by a little habit of yours.\nScuttlebutt:\nSss, sss, sss! Think you can see through me with your silly little guesses? You're wasting your time! My box is impenetrable! Nobody sees the real me!\nApollo:\nGah... I blew that one.\nAthena:\nYou're completely boxed in now, Myriam! And Apollo's power is like a box cutter with x-ray vision! Prepare to be exposed!\nApollo:\nDon't exaggerate, Athena. I'm a lawyer, not a superhero.\nLeads back to Talk options\nMyriam Scuttlebutt (after perceiving)\nAthena:\nNow, I want the truth, Myriam! You hide in your box in order to collect gossip for your sleazy paper, isn't that right?!\nApollo:\nYou're not really friends with Juniper, are you?\nScuttlebutt:\nSss, sss, sss. No duh! She's the target of my scoops, and my readers demand dirt! Extra, extra! \"The Dirty Little Secret of the Squeaky Clean Student Council President!\"\nAthena:\nDirty little secret...? All right, what are you planning to say in court, huh?\nScuttlebutt:\nI'm a witness to her part in the crime. I'm going to tell it all in a shocking exposé! The end justifies the means. That's my brand of tell-all journalism!\nAthena:\n(The end justifies the means? Wait a second!)\n\"End justifies the means\" (appears after \"Myriam Scuttlebutt\")\nScuttlebutt:\nIn this dark age of the law, many of us embrace Prof. Means's methods, even future judges. I've even adopted an end-justifies-the-means brand of journalism, which includes... ...tape recorders secretly hidden all over our campus... ...secretly recording every last word without anyone being any the wiser!\nAthena:\n(Doesn't she realize that's totally illegal?!)\nScuttlebutt:\nAnd one of them was at the scene of the crime -- the art room!\nApollo:\nYou put a tape recorder in the art room? What did it record?\nScuttlebutt:\nSss, sss, sss. You wanna know? You really wanna know?\nAthena:\nYes, please! That's so nice of you to--\nScuttlebutt:\nSss, sss, sss! Like I'd really tell you now! The big scoop comes out in court tomorrow!\nAthena:\nTsk! You're so mean, Myriam!\nScuttlebutt:\nAccording to my evidence, a fatal fissure had opened between the three of them.\nAthena:\nWho? Junie, Hugh, and Robin? And what do you mean by fatal fissure?\nA rift in the trio (appears after \"\"End justifies the means\"\")\nScuttlebutt:\nJuniper, Hugh, and Robin used to be the best of friends.\nAthena:\nUsed to be? They still seem to get along fine to me. (I did sense some discord, though.)\nScuttlebutt:\nSss, sss, sss. You don't know anything. Prof. Means has his followers and Prof. Courte had hers. Their influence is inescapable!\nAthena:\nAre you implying that one of them adheres to that extreme idea you and Prof. Means have? (But why would anyone follow that philosophy?)\nScuttlebutt:\nSss, sss, sss. How could you possibly understand. You're new around here.\nApollo:\nMyriam, wouldn't you feel better if you came out of the dark and into the light?\nScuttlebutt:\nSss, sss, sss. I can see fine in here. You'll be the ones seeing the light in court tomorrow. (Changed from [Sss, sss, sss. I can see fine in here. You'll be the one's [sic] seeing the light in court tomorrow.] in the original release) Then you'll realize how guilty Juniper Woods really is! Sss, sss, sss! Sss, sss, sss, sss, sss!\nAthena:\nUgh. We're going to have to cross-examine her tomorrow, but I don't know where to start. (Changed from [Ugh. We're going to have cross-examine [sic] her tomorrow, but I don't know where to start.] in the original release)\nApollo:\nWell, let's at least take care of whatever we can today.\nAthena:\nYou're right. Let's see what else we can find out!\nA rift in the trio (subsequent times)\nScuttlebutt:\nJuniper, Hugh, and Robin used to be the best of friends.\nAthena:\nUsed to be? They still seem to get along fine to me. (I did sense some discord, though.)\nScuttlebutt:\nSss, sss, sss. You don't know anything. Prof. Means has his followers and Prof. Courte had hers. Their influence is inescapable!\nAthena:\nAre you implying that one of them adheres to that extreme idea you and Prof. Means have? (But why would anyone follow that philosophy?)\nScuttlebutt:\nSss, sss, sss. How could you possibly understand. You're new around here.\nApollo:\nMyriam, wouldn't you feel better if you came out of the dark and into the light?\nScuttlebutt:\nSss, sss, sss. I can see fine in here. You'll be the ones seeing the light in court tomorrow. (Changed from [Sss, sss, sss. I can see fine in here. You'll be the one's [sic] seeing the light in court tomorrow.] in the original release) Then you'll realize how guilty Juniper Woods really is! Sss, sss, sss! Sss, sss, sss, sss, sss!\nPresent\nThemis Herald\nScuttlebutt:\nSss, sss, sss! I love this newspaper! The paper quality, the printing method, the smell of the ink... Could it be more perfect?!\nAthena:\nUmm... Is it really that amazing?\nScuttlebutt:\nMeh! You just don't get it, do you?! Toilet paper, hamster cage lining, window wiper! My paper is so awesomely versatile!\nAthena:\n(Am I to understand that the contents run the entire spectrum of fecal matter as well...?)\nMock Trial Script\nScuttlebutt:\nMy script was way more popular than Juniper's.\nAthena:\nReally? Wow, was that the majority opinion?\nScuttlebutt:\nYep. My behind-the-scenes maneuvers, threats, and deceptions worked like a charm.\nAthena:\nMyriam, this may come as a surprise to you, but that's called \"cheating.\"\nScuttlebutt:\nSss, sss, sss. Says you. I didn't break the law. Besides, the end justifies the means. That's what they teach us here.\nApollo:\nApparently, some people are already thriving in the dark age of the law.\nAnything else\nScuttlebutt:\nSss, sss, sss! If you wanna give me a present, slip it through a hole in my box. Or if it's too big, you can open the top and gimme it that way! So, which way is it gonna be? Sss, sss, sss!\nAthena:\n(Either way creeps me out.)\nAfter clearing \"Discovering the body\" Talk option in Themis Legal Academy - 3F Lecture Hall, clearing all Talk options in Themis Legal Academy - Maintenance Area, and clearing \"A rift in the trio\" Talk option in Themis Legal Academy - Outdoor Stage:\nAthena:\nWell, I think I've talked to everyone who is somehow linked to the case.\nApollo:\nOkay, maybe it's about time we wrapped up our investigation.\nAthena:\n...Oh, wait. We haven't met with Junie yet.\nApollo:\nYeah, you're right.\nAthena:\nLet's head over to the detention center.\nOctober 24Detention Center - Visitor's Room\nWoods:\nTh-Thena. Thank you so much for coming.\nAthena:\n(She called me \"Thena,\" like she used to. Maybe she's finally letting her guard down.)\nTalk\nThe script\nAthena:\nJunie, the crime's unfolding exactly like your script. Any idea what's going on here?\nWoods:\nWe wanted to make it fair, so the script was kept secret until the day of the mock trial. And the only people who knew the details were Prof. Courte and I.\nAthena:\n(Hmm... Nothing we haven't heard already so far.)\nWoods:\nHowever...\nAthena:\nYes?! What is it, Junie?\nWoods:\nWell, there was this one article in the school paper.\nApollo:\nYou mean this one? It's more like a tabloid piece than a newspaper article, if you ask me.\nWoods:\nI've... been worried that the trial would wreck the friendship between Robin, Hugh and me.\nAthena:\n(She wants to stay friends, but both of the guys are hoping to take it to the next level. Oh, the passion of high school drama...! Wish I could've experienced it...)\nWoods:\nAnd I know I shouldn't have, but... I revised the script to favor the prosecution. But Prof. Courte noticed it immediately and changed it back.\nAthena:\n(Ahh, so if Robin had won, Hugh wouldn't have been able to confess his love to Junie. That would've kept the trio's relationship the same. Never knew Junie could be so devious.)\nWoods:\nSorry. I guess my personal problems won't be of any help in court, huh?\nApollo:\nYou never know. Help often comes from the most unexpected places. Thanks, Juniper.\nThe awl\nAthena:\nI was wondering about that awl you had on you when you were arrested.\nPoliceman:\nDetective Fulbright! We found this in the suspect's pocket!\nFulbright:\nHm? Wh-Why there's...! There's blood on this!\nWoods:\nTh-That's evidence we made for the mock trial!\nFulbright:\nA mock... trial? Never heard of such a thing, but it sounds fishy to me! Real fishy!\nWoods:\nIt was the murder weapon from the mock trial. Prof. Courte and I were prepping it in the art room until the day before the trial. I didn't even realize I still had it on me until I was arrested.\nApollo:\nThen we've nothing to worry about. There shouldn't be any way to link it to the crime.\nWoods:\nStill, that blood-red color on the awl bothers me.\nAthena:\nWasn't it just paint or something? I mean, I was looking at it from pretty far away, but...\nWoods:\nIt probably was just paint, but that's what bothers me. It wasn't on the awl when we were prepping it yesterday.\nApollo:\nIt wasn't? Then how and when did it get there?\nWoods:\nWell, before the mock trial began, I showed Thena and Mr. Wright to the waiting room... ...then I went back to my dressing room to get the trial props we were going to use. That's when I found the art room key and the awl with what looked like blood on it.\nAthena:\nA key... and the awl?\nWoods:\nProf. Courte normally has the art room key since she's the Fine Arts Club's advisor. And since that key was there in the dressing room... ...I thought she was the one who had painted the awl to look like it had blood on it. After all, she always insisted that the props should be realistic, so...\nAthena:\nThe awl suddenly shows up on the day of the trial with what looks like blood on it? I have a really bad feeling about this.\nApollo:\nMe, too. But let's not jump the gun on this.\nMock trial prep work (appears after \"The script\" and \"The awl\")\nLeads to:\n\"You and Prof. Courte were busy preparing for the mock trial together yesterday, right?\"\nPresent\nStage Costume\nWoods:\nUm... I'd appreciate it if you wouldn't go around showing that to everyone.\nAthena:\nHow come? I mean, it's so well made. Aren't you going to wear it when you sing?\nWoods:\n*sigh*... Yes, unfortunately, I've been chosen to sing. But I don't think I'm up to the task.\nAthena:\n...Reminds me of the old Junie when you talk like that. Makes me want to protect you.\nWoods:\nI can't let you do that. After all, I'm Student Council President! It's my job to look after our entire student body.\nAthena:\nSo what if you took that can-do spirit and applied it to your singing?\nWoods:\n*sigh*... But we're talking about me singing in front of a huge crowd.\nAthena:\n(Maybe she is in over her head.)\nMock Trial Script or Themis Herald Extra\nWoods:\nI wish the mock trial had ended better than it did...\nAthena:\nYeah, but to have three good friends all play leading roles? It's pretty amazing if you think about it.\nWoods:\nThat's true. And it's thanks to the strength of our friendship. There's nothing we can't do if we help and support each other.\nAthena:\nI don't know... Is that really the issue here? (But whenever I bring it up...)\nWoods:\nYes, that's what it's all about! The friendship between the three of us is absolute!\nApollo:\nAthena, it's obvious that they're friends, so let's leave it at that.\nAthena:\nYes, I know that, but... (Her words seem kind of forced.)\nAthena:\nYou and Prof. Courte were busy preparing for the mock trial together yesterday, right? Was that the last time you saw her?\nWoods:\n...Yes. I left school at around 6:00 PM.\nApollo:\nDid you notice anything different about her?\nWoods:\nNo, I didn't notice anything out of the ordinary. She looked and acted the same as always. I would've never guessed she'd end up like this. It looks like we're about out of time. Thank you for coming to see me.\nAthena:\nWe'll do everything we can to prove you innocent tomorrow.\nWoods:\nI know. And I believe in you, Thena. Well, I should go now. Bye.\nApollo:\nIs she gonna be all right? She's like a shadow of the girl we met back at the academy.\nAthena:\nThe Junie I knew was always like that -- a little weak and sickly. But the fact that she's lifted her façade shows that she trusts us. Even still...\nApollo:\nWhat is it?\nAthena:\nWell, when Junie and her two friends were talking about their friendship... ...I sensed some discord in their hearts.\nApollo:\nSeriously?\nAthena:\nYeah, but it was really faint. I might've been mistaken. (There's no reason to doubt their friendship... is there?)\nApollo:\nDon't worry, everything will be fine! You and Juniper are friends, right? You know that friend I mentioned to you earlier? Well, get this. Whenever something's troubling one of us, the other can just feel it. That's real friendship.\nAthena:\nI suppose you're right... Might as well forget about that and concentrate on the trial!\nApollo:\nYup! Tomorrow's the big day. Let's sort out what we know so far.\nAthena:\nOkay! The victim Prof. Constance Courte was murdered in the art room on the third floor. Then, her body was moved to the outdoor stage in the quad. Also, the location where we found the body was just as the mock trial script described.\nApollo:\nI wish those were the only similarities they shared.\nAthena:\nWhat do you mean?\nApollo:\nWhat I mean is the script and this case are exactly the same in almost every respect. So it follows that the actual trial may very well unfold just like the mock trial did!\nAthena:\nOh, no! (The mock trial ended right before the prosecution was about to win! Well, that's not gonna happen! This time, Junie WILL be declared \"not guilty\"! Of course, I intend to get our results the honest way. We can do this! We'll be fine! After all, I have Apollo and he's the king of being fine.)\nTo be continued\nNothing to examine during investigation\nAthena:\nThere's really not much of interest here. At least, that's what my intuition tells me.",
  "characters": [
    {
      "currentChapter": "Turnabout Academy",
      "name": "Apollo Justice",
      "age": "• Age: 23",
      "description1": "A lawyer who's been at the agency since before I joined. He has an amazing ability to spot lies through people's tells."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Phoenix Wright",
      "age": "• Age: 34",
      "description1": "The lawyer who owns the agency. I owe him for giving me the chance to become a full-fledged lawyer."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Trucy Wright",
      "age": "• Age: 16",
      "description1": "Mr. Wright's darling daughter. She wants to be a famous magician someday."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Aristotle Means",
      "age": "• Age: 45",
      "description1": "A lawyer course professor at the academy. His smile is somewhat scary.",
      "description2": "A lawyer course professor at the academy. His smile is somewhat scary, as is his educational policy."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Constance Courte",
      "age": "• Age: 47",
      "description1": "The professor who invited Mr. Wright to the academy. She is a judge course teacher, but she's not very punctual.",
      "description2": "The professor who invited Mr. Wright here. She was a judge course teacher until she became the victim of this case."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Juniper Woods",
      "age": "• Age: 18",
      "description1": "A senior in the judge course. She's a good friend, and I've known her since childhood."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Hugh O'Conner",
      "age": "• Age: 18 → 25",
      "description1": "A senior in the lawyer course who served as the defense in the mock trial. He seems like kind of a jerk.",
      "description2": "A senior in the lawyer course who served as the defense in the mock trial. He took seven years off from school at one point."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Robin Newman",
      "age": "• Age: 18",
      "description1": "A senior in the prosecutor course who served as the prosecution in the mock trial. He tends to shout at people.",
      "description2": "A senior in the prosecutor course who served as the prosecution in the mock trial. \"He\" is really a \"she\" who'd rather be an artist."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Bobby Fulbright",
      "age": "• Age: 33",
      "description1": "The lively detective in charge of this case. He makes you wonder what justice is really all about."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Simon Blackquill",
      "age": "• Age: 28",
      "description1": "A prosecutor and prison inmate. He has mastered the use of psychological manipulation in courtroom battles."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Klavier Gavin",
      "age": "• Age: 25",
      "description1": "Mr. Rock Star Prosecutor himself, he was the leader and vocalist of the Gavinners."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Myriam Scuttlebutt",
      "age": "• Age: 17",
      "description1": "A senior in the judge course. She is the aloof editor-in-chief of the school paper who walks around with a box over her head."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Academy",
      "name": "Attorney's Badge",
      "description1": "My brand-new, shiny badge. It shows that I'm a lawyer."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Arrow",
      "description1": "The arrow that pierced the victim's side. It's stained with blood."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Courte's Planner",
      "description1": "Constance Courte's planner. A sword emblem is printed on the cover and on each page."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Themis Herald",
      "description1": "A school paper with a malicious scoop on an alleged love triangle involving Junie."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Stage Costume",
      "description1": "A costume Junie was supposed to wear. It has a glowing star pattern. (With notes, 2 pages.)"
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Mock Trial Script",
      "description1": "A top secret script written by Junie. There's only one copy. (4 pages.)"
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Themis Herald Extra",
      "description1": "An extra edition of the school paper that covers the mock trial."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Awl",
      "description1": "The weapon used to murder Constance Courte. Her blood was found on it along with Junie's fingerprints."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Courte's Autopsy Report",
      "description1": "Est. time of death: Between 6 and 8 PM. Cause of death: Blood loss from a deep stab wound in the victim's side."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Tape Recorder",
      "description1": "Used by Myriam to secretly record the conversation in the art room. A woman can be heard shouting, \"You're a goner!\"",
      "description2": "A woman can be heard shouting, \"You're a goner!\" Recorded in the art room at 7:10 PM on the 23rd.",
      "description3": "The voice on the tape says \"You're a goner!\" just like in Junie's script. It may be a fake.",
      "description4": "The voice on the tape says \"You're a goner!\" just like in Junie's script. It's been identified as a fake.",
      "description5": "Identified as a fake. Prof. Means used Hugh to pass it on to the police."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Glowing Costume Photo",
      "description1": "A photo of the stage costume taken in a dark room. A coat of fluorescent paint made it glow."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "School Camera Photo",
      "description1": "A photo of the art room while preparations were being made. Taken on the day of the murder."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "School Banner",
      "description1": "A large banner that was hung by a wire between the stage and art room. A trace amount of blood was found on it."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Purple Fragment → Purple Fragments",
      "description1": "A purple fragment from a broken statue. It was found all alone in the strangest of places.",
      "description2": "Two purple fragments of a broken statue. Going to search for more.",
      "description3": "Three purple fragments of a broken statue that originally stood on a pedestal onstage."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "White Fragment → White Fragments",
      "description1": "A large, white fragment. It has a distinctive shape that could be described as angular.",
      "description2": "Two large, white fragments. It looks like it would feel good to break them."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Lady Justice",
      "description1": "This and the statue of Klavier were broken at the same time, but have been repaired. No one knows where it came from.",
      "description2": "It was found broken onstage. Professor Courte had remade it into a completely different-looking statue the day before the mock trial."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "\"Hugh\" Scrap",
      "description1": "Discovered onstage, it appears to be a piece of paper torn from a notebook. The name \"Hugh\" is written on it."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Burnt Fragments",
      "description1": "The burnt remnants of the Gavinners banner that was tossed into the incinerator and later found by Myriam."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Stage Set Up Photos",
      "description1": "The last two of Myriam's photos. They show the students setting up the stage's backdrop on the night of the murder. (2 photos.)"
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Voiceprint Analysis",
      "description1": "The results of the voice analysis performed on the tape recording."
    },
    {
      "currentChapter": "Turnabout Academy",
      "name": "Lecture Hall Diagram",
      "description1": "A diagram of the lecture hall where the mock trial took place."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "The murder happened exactly like Juniper's mock trial script.",
          "person": "Scuttlebutt",
          "present": []
        },
        {
          "testimony": "Up until the mock trial began, only Prof. Courte and Juniper knew the script's content.",
          "person": "Scuttlebutt",
          "present": []
        },
        {
          "testimony": "But Prof. Courte's sudden decision not to use the script sparked Juniper's murderous rage.",
          "person": "Scuttlebutt",
          "present": []
        },
        {
          "testimony": "Juniper has to be the killer. She has a motive and the murder is just like her script.",
          "person": "Scuttlebutt",
          "present": []
        }
      ],
      "noPresent": true,
      "newContext": "Turnabout Academy\n\n\n\n\n\n\n\n\n\nImage Gallery\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 4October 25, 9:47 AMDistrict Court - Defendant Lobby No. 3Athena:\n(Ugh. My butterflies have butterflies in their stomach.)Apollo:\nSo, what's it like to have your very own case for the first time?Athena:\nMy heart hasn't raced this fast since I ran that full marathon last year.Apollo:\nIf it keeps up, you might get a lawyer's high -- you know like a runner's high?Phoenix:\nRelax, everyone's nervous their first time.Means:\nSo my fears weren't unfounded. After all, today's prosecutor is so terribly brutal... ...and willing to use any means necessary to win a conviction.Athena:\n(There's that the-end-justifies-the-means concept again.)Means:\nNow that it has come to this... ...we have no choice but to fight fire with fire. The end justifies the means.Athena:\n(I wish he'd stop saying that.) That's your method, Professor. I'm going to defend Juniper in my own way.Means:\nBut, Ms. Cykes. Just yesterday you told me...Means:\nAs a lawyer, what is it that you treasure beyond all else?Athena:\nHeh heh! That's an easy one, Professor! Seeking justice for my clients!Means:\nBut if this trial proceeds in the same manner and ends in the same way as the mock trial... ...would you not lose everything you've worked so hard to gain?Athena:\nWell, I'll just have to make sure that doesn't happen, then, won't I!Means:\nMy, but aren't you a stubborn one. Well, I suppose you will have to learn of your own inefficacy the hard way.Athena:\n(Grrrrrrr...)Apollo:\nForgive me, Prof. Means, but can we just leave it at that?Means:\nOh, dear, please forgive me. It's just, I wish to protect Juniper by any means I can.Athena:\n(I do, too, but...)Means:\nNow, if you would excuse me...Athena:\nUgh! Thanks to him, I'm feeling even more pressure than before.Apollo:\nDon't let it get to you, Athena. And don't forget to keep smiling.Athena:\nI'll be fine! And I haven't forgotten what Mr. Wright said! \"The worst of times are when lawyers have to force their biggest smiles.\"Bailiff:\nThe trial is about to begin. I'll show you to the courtroom if you please.Phoenix:\n...Apollo, I'm counting on you to support Athena this time.Apollo:\nOkay, Mr. Wright! Leave it to me!Athena:\n(That's right. I have Apollo to back me up. Junie's fate rests in my hands. I won't rest until she walks free!)October 25, 10:00 AMDistrict Court - Courtroom No. 4Day 1Court Is Now In SessionAll RiseJudge:\nCourt is now in session for the trial of Juniper Woods.Athena:\nA-Athena Cykes, d-defense team leader, is ready, Your Honor!Apollo:\nThat didn't sound very confident. You sure you're okay?Athena:\nI'll... I'll be fine!Blackquill:\n...Your Baldness.Judge:\nI know, I know. As usual, you want me to deliver the opening statement. Agh!Blackquill:\nThis case is crystal clear. I see no need to explicate it any further. ...Now, summon the witness.Judge:\n.........Blackquill:\n.........Is there something the matter? Please do share, Your Baldness.Judge:\nWh-Whatever gave you that idea?! Bailiff, please call our first witness!Athena:\n(And now we don't even get an opening statement...?)Athena:\n(Detective Fulbright... He and Prosecutor Blackquill have become quite the team.)Blackquill:\n.........Fulbright:\nOh, right! The case brief! Leave it to me! Yes, let the detective in charge, everyone's favorite friend of justice, explain!Apollo:\nWhat was THAT just now...? It's like he and Blackquill are totally in sync.Athena:\nWell, I don't think they're capable of mind melding, if that's what you're thinking.Judge:\nAll right, Detective Fulbright. Would you please explain the case to the court?Fulbright:\nProf. Courte's body was discovered on October 24th at approximately 2:30 PM. She was murdered with this awl I have here! The victim's blood and the defendant's prints were both discovered on it!Awl added to the Court Record.Athena:\nEEEK!Courte's Autopsy Report added to the Court Record.Apollo:\nWow, that bird can deliver evidence, too? Blackquill has trained him well.Athena:\nMaybe Blackquill should train it not to mess up people's hair while he's at it.Fulbright:\nMoving right along! The body was discovered on the outdoor stage, although no blood was found there! However, we detected traces of a massive amount of blood in the third floor art room. In short, the murder took place in the art room!Judge:\nSo, then the body had been moved from the art room to the stage?Fulbright:\nPrecisely! And there is one more piece of irrefutable evidence! A recording made by a tape recorder that a school paper reporter hid in the art room! It captured a female voice screaming, \"You're a goner!\"Judge:\nWhat's this?! You have such a recording?!Apollo:\nMust be from that tape recorder Myriam mentioned.Athena:\n(But why is this the first we've heard of a death threat at the moment of the murder?)Fulbright:\nShhhhhh! Silence, please! I would like to play the tape for you now..................................... ...You're a goner!Judge:\nHmm... It is quite hard to hear.Athena:\n(But the voice does sound female...)Tape Recorder added to the Court Record.Fulbright:\nThe noise and low volume of the voice have made voiceprint analysis all but impossible.Judge:\nThen, you haven't identified the voice as belonging to the defendant.Fulbright:\nNot so fast. After all, voiceprint analysis isn't everything! The victim was killed at night, then discovered in the afternoon the next day. The question is... when was the body moved!Judge:\n............Oh, oh! I know! It could've been moved in the middle of the night when no one was around!Fulbright:\nSorry, but no! The campus was full of students that morning. However, no one reported seeing a body. That means the body was moved sometime before the mock trial when all the students... ...and faculty were gathered in the Lecture Hall and the rest of the campus was empty! It was during this time Hugh O'Conner, one of the mock trial participants, found the body.Athena:\n(So the prosecution heard about Hugh seeing the body...)Judge:\nWait one moment. If all of the students and faculty were gathered in the Lecture Hall... ...then there wouldn't have been anyone who could've moved the body!Fulbright:\nHa ha ha! Have no fear, for there is always an exception.Judge:\nAn exception?Fulbright:\nThe three mock trial participants were standing by in individual dressing rooms. They were the only ones who had free access to the deserted campus before the mock trial.Judge:\nWhat?! Then that would mean...! ...What would that mean?Fulbright:\nThose three students were the only ones who could've moved the body! In justice we trust!Apollo:\nI don't like where this is headed, Athena.Athena:\nMe neither...Fulbright:\nAnd by those three, I mean... ...Hugh O'Conner, Robin Newman and Juniper Woods.Athena:\nI knew it... (Please, Detective Fulbright... Don't say what I think you're about to say...)Fulbright:\nIn justice we trust! I take it EVERYONE understands now! The voice believed to be that of the murderer was female! And out of the three people who could've moved the body, just one is a girl. That leaves the defendant Juniper Woods as the only possibility!Athena:\nNoooooooooooooooo!Apollo:\nImpressive. He has you on the ropes even before any cross-examinations.Athena:\n(You could at least pretend to be upset for me.)Blackquill:\nA splendid job, Fool Bright. That could not be any clearer. Feel free to anticipate a salary raise next month.Fulbright:\nHa ha ha ha! I don't do this for the money. It's all about justice! In justice we trust!Blackquill:\nHmph. Not only a halfwit, but a perennial stick-in-the-mud you are.Athena:\n(I guess neither the carrot nor the stick works on Detective Fulbright.)Judge:\nNow, Bailiff, please bring our next witness to the stand.Scuttlebutt:\n.........Judge:\nSo... our first witness... is a cardboard box?Scuttlebutt:\n......... Kaaahk! Sss, sss, sss, sss, sss...! Stealth mode deactivated!Judge:\nOh, my! The box has hands!Scuttlebutt:\nSmile, Your Honor. Sss, sss, sss, sss, sss, sss!Judge:\nWhat the dickens?! I've just had my picture taken!Scuttlebutt:\nMyriam Scuttlebutt. Senior at the legal academy. I'm a reporter on the judge course. Juniper's been a bad, bad girl. I'll tell you all about her crime, sss, sss, sss!Judge:\n...Umm, might I ask whether you could come out of that box?Scuttlebutt:\nHow will I get any more scoops if I blow my cover? So, the answer is no. After all, covert action is an undercover reporter's bread and butter!Judge:\nHmm... But testimony from a faceless witness is highly irregular.Blackquill:\nA former ninja I met in the clink said that exposing those who work in the shadows... ...is to pass the death sentence upon them.Judge:\nOh, my! I had never thought of it that way. Very well, if it would spare a life, I'll make a special exception this time.Athena:\n(A former ninja in prison? Holy shinto! How can the judge believe this load of crock?!)Judge:\nNow, your testimony please. Oh, but take care not to reveal your face.Witness Testimony-- The Similarity of the Case and the Script --Scuttlebutt:\nThe murder happened exactly like Juniper's mock trial script.\nUp until the mock trial began, only Prof. Courte and Juniper knew the script's content.\nBut Prof. Courte's sudden decision not to use the script sparked Juniper's murderous rage.\nJuniper has to be the killer. She has a motive and the murder is just like her script.Judge:\nThe murder is just like her script?! Could such a thing be true?!Scuttlebutt:\nCompare her script with the murder case and crime scene photos. Then you'll see!Blackquill:\nThis is so simple, even an ape posing as a decrepit old judge could understand. Only the victim and the defendant were privy to the script. Ergo, the defendant is the killer. Furthermore, in the art room where the crime supposedly occurred, this witness's script... ...along with an envelope on which \"Use\" was written were found. This proves that the accused's script had been rejected the day before the mock trial. She pressed the victim to use her script, an argument ensued, and then the fatal stabbing.Athena:\n*gulp* (That makes perfect sense. What now?!)Apollo:\nProsecutor Blackquill has all his ducks lined up in a row. He's really on a roll now.Athena:\nUgh. He's like a pit bull once it sinks its teeth into you.Scuttlebutt:\nHow dare she! My script had it all! A bum rap and phony evidence! Grudges and betrayals!Judge:\nHmm... I trust the defense is ready to cross-examine the witness?Athena:\nN-No problem! I-I mean, yes I'm ready... I think... (Time to find a hole in her testimony, and unbox the truth! I've seen it done over and over. I know I can do this!)Cross ExaminationCross Examination-- The Similarity of the Case and the Script --Scuttlebutt:\nThe murder happened exactly like Juniper's mock trial script.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThere must be places where the script and the case diverge!\nScuttlebutt:\nKahk-kahk! Don't sweat the details! That kind of stress will give you wrinkles!\nAthena:\n\nAthena:\nI'm not worried. My skin is as fair as silk.\nBlackquill:\n\nBlackquill:\n...Hmph. Indeed, you are quite fair -- fairly desperate!\nAthena:\n\nAthena:\nWh-What did you just say?!\nApollo:\nHa ha ha. Blackquill really turned that one around on you.\nAthena:\nTsk, whose side are you on?! Hurry up and think of a clever comeback!\nApollo:\nWhoa, easy there, Athena.\nBlackquill:\nNow you listen to me. The two cases do, indeed, have their differences. For one, the stage hadn't yet been erected in the mock trial script. And in the actual case, there were signs indicating the victim's wrists had been bound. But such differences pale in comparison to the host of similarities. In any event, replicating the crime without knowledge of the script is an impossibility.\nAthena:\nHmmm... (Looks like I won't be passing this off as a coincidence.)\nScuttlebutt:\nSss, sss, sss! What a total burn! Try again, why dontcha, Pawn of Woods?Scuttlebutt:\nUp until the mock trial began, only Prof. Courte and Juniper knew the script's content.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSomebody could've stolen a peek beforehand!\nScuttlebutt:\nSss, sss, sss! I don't think so. I mean, I tried any number of times.\nAthena:\n(Shame on you, Myriam!)\nScuttlebutt:\nBut that crafty she-devil Juniper has eyes in the back of her head! What chance does your average person have if an undercover reporter like me failed?!\nAthena:\n(Interesting point. Still...) Ms. Scuttlebutt, won't you get in trouble later for admitting to such underhanded tactics?\nScuttlebutt:\nWhy, you...! I plead entrapment!\nAthena:\n(How is you blurting out your own crime entrapment?!)\nScuttlebutt:\nKahk-kahk... But you haven't scooped me yet! They were all set to use Juniper's script...Scuttlebutt:\nBut Prof. Courte's sudden decision not to use the script sparked Juniper's murderous rage.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nHow do you know that Professor Courte wasn't going to use her script?\nBlackquill:\nHmph. There in the art room where the heinous crime took place... ...an envelope marked \"Use\" and Myriam Scuttlebutt's script were found. Evidently, the script that was going to be used belonged to the girl in the box over there.\nScuttlebutt:\nSss, sss, sss! It's only natural that my script would be accepted and hers rejected. I introduced all sorts of brand-new concepts, including bribery and fake evidence! It was a cutting-edge script portraying a courtroom battle in the dark age of the law!\nAthena:\n(I can't help but feel Prof. Courte went out of her way NOT to use it.)\nScuttlebutt:\nBut Juniper... She used some devious, underhanded tactics to get her script chosen. That's why her script, and not my masterpiece, was used in the mock trial! How's that for an explanation?Scuttlebutt:\nJuniper has to be the killer. She has a motive and the murder is just like her script.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nAnyone who saw the mock trial could have recreated the crime! After they saw the mock trial, they could've easily staged the body just like the script.\nBlackquill:\n\nBlackquill:\n.........Hmph. Weary is the trial which pits hawk against canary.\nAthena:\n\nAthena:\nWh-Wh-What did you just say?!\nApollo:\nHa ha ha. If he's so weary, he should try hmph-ing less. I bet that'd save some energy.\nAthena:\nThis is no time for jokes, Apollo! He just called me a canary!\nApollo:\nDon't let him get to you. At least canaries pick up on things quickly, just like you.\nBlackquill:\nI shan't repeat myself, so listen carefully, Cykes-dono. Hugh O'Conner discovered the body before the mock trial even began. How could one stage the body as it is in the script before anyone knew its contents?\nAthena:\nGah... That's right...\nBlackquill:\nDo you even fathom the intricacies that go into staging a crime scene? No, I think not. You have the rudimentary mind of an elementary school child.\nAthena:\nElementary school?!\nScuttlebutt:\n\"Reporter's Testimony Throws Attorney Athena Cykes for Loop!\" The perfect caption!\nJudge:\nHow marvelous! A photo in the newspaper is just the thing to boost your brand.\nAthena:\n(In a school paper? Seriously?)Athena:\n(Anyone can see the similarities between the script and this case. But that doesn't mean Junie's the killer!)Apollo:\nI know it's frustrating, Athena, but we don't have much to go on at this point. All you can do is relentlessly press the witness and hope you find a hole.Athena:\nOkay, got it! (Press relentlessly! Right!)"
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "I snuck into Juniper's dressing room while everyone was in the Lecture Hall.",
          "person": "Scuttlebutt",
          "present": []
        },
        {
          "testimony": "Juniper had changed into her stage costume. I asked her, \"What're you doing?\"",
          "person": "Scuttlebutt",
          "present": []
        },
        {
          "testimony": "When suddenly, she fled into the hallway, as if she wanted me to follow her.",
          "person": "Scuttlebutt",
          "present": []
        },
        {
          "testimony": "I followed her all the way to Prof. Courte's body! She led me right to it!",
          "person": "Scuttlebutt",
          "present": []
        },
        {
          "testimony": "I'm positive it was Juniper because she was wearing the costume that she had made!",
          "person": "Scuttlebutt",
          "present": [
            "Stage Costume"
          ]
        }
      ],
      "noPresent": false,
      "newContext": "-- The Similarity of the Case and the Script --Scuttlebutt:\nThe murder happened exactly like Juniper's mock trial script.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThere must be places where the script and the case diverge!\nScuttlebutt:\nKahk-kahk! Don't sweat the details! That kind of stress will give you wrinkles!\nAthena:\n\nAthena:\nI'm not worried. My skin is as fair as silk.\nBlackquill:\n\nBlackquill:\n...Hmph. Indeed, you are quite fair -- fairly desperate!\nAthena:\n\nAthena:\nWh-What did you just say?!\nApollo:\nHa ha ha. Blackquill really turned that one around on you.\nAthena:\nTsk, whose side are you on?! Hurry up and think of a clever comeback!\nApollo:\nWhoa, easy there, Athena.\nBlackquill:\nNow you listen to me. The two cases do, indeed, have their differences. For one, the stage hadn't yet been erected in the mock trial script. And in the actual case, there were signs indicating the victim's wrists had been bound. But such differences pale in comparison to the host of similarities. In any event, replicating the crime without knowledge of the script is an impossibility.\nAthena:\nHmmm... (Looks like I won't be passing this off as a coincidence.)\nScuttlebutt:\nSss, sss, sss! What a total burn! Try again, why dontcha, Pawn of Woods?Scuttlebutt:\nUp until the mock trial began, only Prof. Courte and Juniper knew the script's content.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSomebody could've stolen a peek beforehand!\nScuttlebutt:\nSss, sss, sss! I don't think so. I mean, I tried any number of times.\nAthena:\n(Shame on you, Myriam!)\nScuttlebutt:\nBut that crafty she-devil Juniper has eyes in the back of her head! What chance does your average person have if an undercover reporter like me failed?!\nAthena:\n(Interesting point. Still...) Ms. Scuttlebutt, won't you get in trouble later for admitting to such underhanded tactics?\nScuttlebutt:\nWhy, you...! I plead entrapment!\nAthena:\n(How is you blurting out your own crime entrapment?!)\nScuttlebutt:\nKahk-kahk... But you haven't scooped me yet! They were all set to use Juniper's script...Scuttlebutt:\nBut Prof. Courte's sudden decision not to use the script sparked Juniper's murderous rage.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nHow do you know that Professor Courte wasn't going to use her script?\nBlackquill:\nHmph. There in the art room where the heinous crime took place... ...an envelope marked \"Use\" and Myriam Scuttlebutt's script were found. Evidently, the script that was going to be used belonged to the girl in the box over there.\nScuttlebutt:\nSss, sss, sss! It's only natural that my script would be accepted and hers rejected. I introduced all sorts of brand-new concepts, including bribery and fake evidence! It was a cutting-edge script portraying a courtroom battle in the dark age of the law!\nAthena:\n(I can't help but feel Prof. Courte went out of her way NOT to use it.)\nScuttlebutt:\nBut Juniper... She used some devious, underhanded tactics to get her script chosen. That's why her script, and not my masterpiece, was used in the mock trial! How's that for an explanation?Scuttlebutt:\nJuniper has to be the killer. She has a motive and the murder is just like her script.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nAnyone who saw the mock trial could have recreated the crime! After they saw the mock trial, they could've easily staged the body just like the script.\nBlackquill:\n\nBlackquill:\n.........Hmph. Weary is the trial which pits hawk against canary.\nAthena:\n\nAthena:\nWh-Wh-What did you just say?!\nApollo:\nHa ha ha. If he's so weary, he should try hmph-ing less. I bet that'd save some energy.\nAthena:\nThis is no time for jokes, Apollo! He just called me a canary!\nApollo:\nDon't let him get to you. At least canaries pick up on things quickly, just like you.\nBlackquill:\nI shan't repeat myself, so listen carefully, Cykes-dono. Hugh O'Conner discovered the body before the mock trial even began. How could one stage the body as it is in the script before anyone knew its contents?\nAthena:\nGah... That's right...\nBlackquill:\nDo you even fathom the intricacies that go into staging a crime scene? No, I think not. You have the rudimentary mind of an elementary school child.\nAthena:\nElementary school?!\nScuttlebutt:\n\"Reporter's Testimony Throws Attorney Athena Cykes for Loop!\" The perfect caption!\nJudge:\nHow marvelous! A photo in the newspaper is just the thing to boost your brand.\nAthena:\n(In a school paper? Seriously?)Athena:\n(Anyone can see the similarities between the script and this case. But that doesn't mean Junie's the killer!)Apollo:\nI know it's frustrating, Athena, but we don't have much to go on at this point. All you can do is relentlessly press the witness and hope you find a hole.Athena:\nOkay, got it! (Press relentlessly! Right!)After pressing first and fourth statements:Judge:\nI believe you've pressed the witness more than enough, Ms. Cykes.Blackquill:\nHmph. Now do you see how clear-cut my case is? Take it now, and in that fair, desperate mind of yours... ...etch it deep so you may never forget!Athena:\nN-No... Nooooooooooooooo! (Even my arguments get thrown back in my face. It wasn't supposed to be like this. What am I going to do?)Apollo:\n...Athena. You should just about have all the answers you've been looking for now.Athena:\nHuh?Apollo:\nThink about it this way: If the killer knew the details of the mock trial... ...would they really commit the crime in the exact same way?Athena:\nI don't follow.Apollo:\nTry to place yourself in the killer's shoes. I bet you'll discover an inconsistency if you do.Athena:\n.........Ah! I get it! Thanks, Apollo! Ms. Scuttlebutt! Just so we're clear, you're claiming... ...that the killer INTENTIONALLY made the crime scene just as it was in the script... ...and that it is beyond the shadow of a doubt NOT a coincidence. Is that correct?Scuttlebutt:\nNo duh! After all, it's just more evidence of Juniper's evil she-devil ways.Athena:Scuttlebutt:\nKahk-kahk! Wh-What'd I say, what'd I say?!Athena:\nOur client made the crime scene look just like the script, something known only to her? That would be not just foolhardy, but completely irrational!Scuttlebutt:\nWh-What do you mean?Judge:\nYes, Ms. Cykes. Please tell this court what you mean by \"irrational.\"Athena:\n(It wouldn't make any sense for Junie to mimic her own script on purpose because it would...)Mean leaking the script\n\n\n\n\n\n\n\nAthena:\nIntentionally making the crime scene look like the script... ...would expose the secret script for all to see!\nScuttlebutt:\nSo?! Juniper's a ruthless she-devil! She'd easily do that and a lot more to achieve her evil designs!\nJudge:\nHmm... Does the defense care to offer a counter-argument?\nAthena:\nNo, I'm good. Moving right along...\nJudge:\nJust one moment. Here in court, we have a special gift for intentionally evasive lawyers.\nAthena:\nI want a refuuuund! (Ugh. There's something obviously wrong with this whole set-up.)\nLeads back to:\n\"It wouldn't make any sense for Junie to mimic her own script on purpose because it would...\"Make her the culprit\n\n\n\n\n\n\n\nLeads to:\n\"The murder scene was the same as it was in the mock trial script.\"Not be possible\n\n\n\n\n\n\n\nAthena:\nHere's the thing. The mock trial details were kept secret. In short, there was no way our client could've known what was in the script!\nBlackquill:\n\nBlackquill:\nHmph. Have you forgotten who penned the script?\nAthena:\nOf course I didn't forget! Our client wrote--! Er... whoops.\nJudge:\nTo say that the script's own author didn't know the details is quite a stretch, Ms. Cykes.\nAthena:\nEeeeeek! (Ugh. I think I need to find an explanation that actually makes sense.)\nLeads back to:\n\"It wouldn't make any sense for Junie to mimic her own script on purpose because it would...\"Athena:\nThe murder scene was the same as it was in the mock trial script. That in and of itself is irrational!Scuttlebutt:\nKahk-kahk-kahk! What's wrong with them being the same?!Judge:\nYes, Ms. Cykes. Care to explain what you mean?Athena:\nOkay, let's say for argument's sake, that Ms. Woods is the killer. If so, then... ...what reason would she have to intentionally make the actual murder mimic her own script?Scuttlebutt:\nThat's easy! She was admitting that she was the-- Ah!Athena:\nThat's right. If she had really done that... ...it would've been like proclaiming to the world that she was the killer! So, what we ACTUALLY have here is evidence of someone trying to frame our client!Scuttlebutt:\nKahk... Kaaahk kahk-kahk!Athena:\nThe body was found on the day of the mock trial, in short, the day the details were revealed. So it would be completely inconceivable for the murder to go exactly like the script!Scuttlebutt:\nKahk-kahk-kahk! Don't let it go to your head just yet!Blackquill:Blackquill:\n...Hmph. It would seem Justice-dono's comrade in arms has finally drawn her sword. However, the blade is dull, and it shall remain so until you master its use.Athena:\nE-Enough with the stupid sword metaphors, already!Blackquill:\nThere is a perfectly good reason for the inconsistency of which you speak.Athena:\nR-Reason? What reason?Blackquill:\nMust I spell out everything? Hmph, you are what people today call \"high maintenance.\" The accused had intended to stop the mock trial. And in that event... ...nary a soul would have been the wiser to the similarities of the case and script.Athena:Athena:\nNo! The mock trial was only stopped after the body was accidentally discovered! (Changed from [No! The mock trial was only stopped after the body was accidently [sic] discovered!] in the original release)Blackquill:Blackquill:\nHmph. Our witness here had also discovered the body. In fact, she was led to our dearly departed professor by the accused herself.Athena:\nWh-What?! Ms. Scuttlebutt saw the body, too?!Blackquill:\nPrecisely. And with the discovery of the body, the mock trial ought to have been canceled.Athena:\nWait, so you didn't call the police?!Scuttlebutt:\nNope! I kept it secret for my big scoop!Athena:\nY-You can't do that!Blackquill:\nHmph. I made her pay long and hard penance for her sin. Did I not, my little box top?Scuttlebutt:\nKahk-kahk! Compared to the work of a war correspondent, the sheer terror of that was-- Aaaaaaaaagh!Apollo:\nJeez, I wonder what the Twisted Samurai did to her.Athena:\n...Block off all the holes in her box... ...and spin her like a top while Detective Fulbright cackled in delight?Apollo:\n...That sounds more nauseating than scary.Blackquill:\nEnough jabbering. Witness! Continue your testimony!Scuttlebutt:\nSss, sss, sss, sss... Sure, Mr. Samurai. I'm ready to finish off that she-devil!Witness Testimony-- What Scuttlebutt Saw --Scuttlebutt:\nI snuck into Juniper's dressing room while everyone was in the Lecture Hall.\nJuniper had changed into her stage costume. I asked her, \"What are you doing?\"\nWhen suddenly, she fled into the hallway, as if she wanted me to follow her.\nI followed her all the way to Prof. Courte's body! She led me right to it!\nI'm positive it was Juniper because she was wearing the costume that she had made!Athena:Athena:\nWhy did you withhold such key testimony?!Scuttlebutt:\nKaaahk! Wh-What's that supposed to mean?!Apollo:\nA-Athena! You haven't even started your cross-examination.Athena:\nI know, but her testimony points to her as being a potential suspect!Apollo:\nWell, I don't think Prosecutor Blackquill is-- No, wait, I bet he's already thought of that.Athena:\nThe witness left the Lecture Hall to sneak into Ms. Woods's room before the mock trial. That means she, too, could have moved the victim's body!Scuttlebutt:\nKaaaaaahk!Athena:\nThe prosecution's claim no longer has any ground to stand on! Heeeeeelp!Blackquill:\nNow, now, no need to ruffle your own feathers so. When you squeak like a little brat, it agitates Taka. Do you want him to peck your eyes out?Widget:\nNo, thanks!Blackquill:\nYou listen here. The witness has a perfectly good alibi.Scuttlebutt:\nOh, yeah, I do! Around the estimated time of death... ...I was at undercover reporter class. It's right near my home!Athena:\n(Undercover reporter class?)Blackquill:\nThe proverbial rug has been pulled from under you. The witness could not be the killer.Judge:\nThe defense must look before leaping -- or at least make sure the rug's secured to the floor.Apollo:\nI tried to warn you.Athena:\nOooh...Blackquill:\nWell, there ends the cross-examination. Let's allow the witness to step down.Athena:\nHuh? N-No, wait a minute...Blackquill:\nThe defense has no right to cross-examine the witness after that little spectacle. For whatever a man is sowing, this he will also reap.Athena:\nUgh. (Why can't he say, \"You reap what you sow\"?)Judge:\nHmm... Very well, if the cross-examination is over, I suppose the witness may go home. Perhaps spend some time in her lovely box and recover from today's stressful events.Scuttlebutt:\nSss, sss, sss! Don't you worry about me, Your Honor! There's no rest for the wicked... or journalists, either! My third eye's always eyeing a scoop!Apollo:\nShe's always eyeing a scoop...?Scuttlebutt:\nSss, sss, sss! Well, back to the trenches! Buh-bye!Apollo:Apollo:\nNot so fast, Ms. Scuttlebutt!Athena:\nA-Apollo?Apollo:\nThere's... just one thing I'd like to ask. Did you take a picture of the victim's body, and if not, why not?Scuttlebutt:\nI, well... that is... No... I-I didn't take one.Apollo:\nWell, that's strange... Why wouldn't you take a picture if you're always eyeing a scoop?Scuttlebutt:\nKahk-kahk!Apollo:\nDid you or didn't you really see the victim's body?!Scuttlebutt:\nKahk-kahk! Er... it's not like I, uh... actually SAW it, saw it, but...Blackquill:\nWhat the devil?!Apollo:\nDid you hear that, Your Honor? The witness didn't actually see the body! That completely overturns the prosecution's claim that the witness was led to it!Blackquill:\nJustice-dono! You dare bare steel at me again?!Scuttlebutt:Scuttlebutt:\nSss, sss, sss, sss! Nice try, boy wonder! So what if I didn't see the body? The fact remains that Juniper led me there. Feast your eyes on this!Apollo:\nWhat exactly am I looking at here?Scuttlebutt:\nSss, sss, sss! It's a crucial moment forever frozen in time by my third eye. A photo clearly showing Juniper Woods! Kaaaaaahk!Blackquill:\n...Why did you not tell me of this?Scuttlebutt:\nSss, sss, sss. It's a shocking scoop I was saving for just the right moment. And that would be now, right here in court. Surprise! Sss, sss, sss, sss, sss. Kaaaaaaaaaaaahk! What'd I do, what'd I do?! All journalists keep their scoops secret until the right moment!Apollo:\nShe's pretty brave hiding it from Blackquill like that.Athena:\nOr pretty stupid. ...Well, this is an unexpected turn.Apollo:\n...Um, Athena? About this picture... See how it only shows the back of the subject?Athena:\nAh! So, then...!Apollo:\nRight, who knows whether this photo Juniper in the first place!Blackquill:Blackquill:\nHmph. A completely irrelevant point. What IS relevant here is... ...there was someone who did try to lead the witness to the body. Take a gander at this -- the route by which the accused escaped. The witness pursued the accused this way, after she fled the dressing room. The accused descended to the first floor and exited to the quad. Then what, Carton Cretin?Scuttlebutt:\nThen I... tripped and fell. Caught my knee on my own box.Athena:\n(She stayed under the box, even while running after someone? Sounds difficult...)Blackquill:\nRecall that the body was already there, for Hugh O'Conner had already seen it. She was trying to show someone the body because she wanted to stop the mock trial!Athena:\nHrgh!Apollo:Apollo:\nBut if the facts have changed, that's all the more reason to cross-examine the witness!Judge:\nHmm... The defense has a point there. Very well, you may proceed with your cross-examination.Blackquill:\nHmph! It seems Justice-dono has saved your pretty little hide, missy. ...For now, at least.Apollo:\n...Whew. Guess I pulled that off somehow.Athena:\nThanks, Apollo. You're a lifesaver.Blackquill:\nIncidentally, my compliments to the witness for her very fine box.Scuttlebutt:\nSss, sss, sss, sss! It's primo cardboard, lovingly selected from among many-- Kahk!Blackquill:\nTell another lie or hide another fact from me... ...and I shall put it to the torch!Scuttlebutt:\nKahk... Kaaaaaahk! P-P-Please, anything but that!Judge:\nI think it would be more eco-friendly to recycle it, but that's just me. All right, Ms. Cykes. You may cross-examine the witness.Cross ExaminationCross Examination-- What Scuttlebutt Saw --Scuttlebutt:\nI snuck into Juniper's dressing room while everyone was in the Lecture Hall.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nYou said you snuck in, but why would you do something like that?!\nScuttlebutt:\nBecause if I got a big scoop on Juniper, club membership would go through the roof! Right now, the Newspaper Club only has one member, me. The club's history once I'm gone. So, the Themis Herald's brand recognition is a matter of life and death!\nApollo:\nHer means may be questionable, but her motive is surprisingly sound.\nScuttlebutt:\nExtra, extra! \"Students seeking the Thrills and Chills of Exposé Journalism, Report to the Clubroom!\" This has been a paid advertisement. Anyway, where was I...?\nAthena:\n(Huh. Never took Myriam for such a go-getter.)Scuttlebutt:\nJuniper had changed into her stage costume. I asked her, \"What're you doing?\"Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nWhy would she change into that costume? The mock trial was about to begin.\nScuttlebutt:\nHow should I know? But if you don't believe me, take a look at this photo! I captured this critical moment like the gonzo journalistic pro that I am.\nAthena:\nBut, this only shows the back of whoever was fleeing.\nScuttlebutt:\nYou expect me to shoot her face when she's running away from me?\nAthena:\nI guess you're right, but... (This doesn't seem to be getting me anywhere.)\nScuttlebutt:\nAt any rate, as this photo shows, Juniper was in her stage costume.Scuttlebutt:\nWhen suddenly, she fled into the hallway, as if she wanted me to follow her.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThat doesn't mean you had to chase her.\nScuttlebutt:\nSss, sss, sss! Call it a journalist's instinct! I see something fishy, I go after it!\nAthena:\nBut you never did catch up to her, did you?\nScuttlebutt:\nSss, sss! A true undercover journalist gets up and dusts herself off when she stumbles!\nAthena:\nThat reminds me. Didn't you fall during the chase? When you tripped on your box?\nScuttlebutt:\nSss, sss, sss! A true undercover journalist is always ready to stumble over a great story!\nAthena:\nSure are a lot of holes in your story. Or is that just the Scuttlebutt brand of journalism?\nScuttlebutt:\nKahk-kahk-kahk! A true undercover journalist always prevails against her adversaries!Scuttlebutt:\nI followed her all the way to Prof. Courte's body! She led me right to it!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nWhat would our client have to gain from leading you there?\nBlackquill:\nThe accused had employed her self-penned script as a manual for murder. Ergo, she had to stop the mock trial before the script's details became public. And that accounts for her desperate attempt to lead our carton cretin here to the body.\nAthena:\n\nAthena:\nBut, as we all know, Ms. Scuttlebutt didn't alert the authorities. And as a result, the mock trial began as scheduled!\nBlackquill:\n\nBlackquill:\nThe issue here is not whether it was, in fact, halted. The fact remains that the accused was trying to lead the witness to the body. Does that not show clear intent to halt the mock trial?\nAthena:\nArrrgh!Scuttlebutt:\nI'm positive it was Juniper because she was wearing the costume that she had made!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nYou say it was our client because the figure you witnessed was wearing her costume. Isn't that a bit simplistic?\nScuttlebutt:\nSss, sss, sss! It's only as simple and clear-cut as a good piece of journalism should be!\nAthena:\n......... (Sure it's simple, but I'd hardly call it clear-cut.)\nScuttlebutt:\nThat's why I chased her, sss, sss, sss, sss!Present Stage Costume\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Ms. Scuttlebutt's sole basis for identifying our client as the figure in this photo...\"Athena:\nShe keeps saying that it was Junie, but she didn't even actually see the body.Apollo:\nYeah, but Blackquill's assertion takes that into account.Athena:\nSo, even if I press her on never seeing the body... ...I won't be able to overturn this testimony.Apollo:\nWell, whoever it was that was fleeing, Myriam never did see their face. So, I'm wondering why she thought it was Juniper. Try thinking along that line and see what you can come up with."
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "To get mentally prepared for the mock trial, I meditated at the archery range till 7:00 PM.",
          "person": "O'Conner",
          "present": []
        },
        {
          "testimony": "At around 7:15, I went to the main building before going home. That's when I saw Juniper.",
          "person": "O'Conner",
          "present": []
        },
        {
          "testimony": "We didn't say much as we passed by each other. She seemed her usual self.",
          "person": "O'Conner",
          "present": []
        },
        {
          "testimony": "Oh, let me add I never went to the art room. There was no reason for me to be there.",
          "person": "O'Conner",
          "present": []
        },
        {
          "testimony": "The final bell had rung ten, fifteen minutes earlier. No biggie.",
          "person": "O'Conner",
          "present": []
        },
        {
          "testimony": "I didn't talk to anyone until the final bell. I'd been meditating alone at the archery range.",
          "person": "O'Conner",
          "present": [
            "Courte's Planner"
          ]
        },
        {
          "testimony": "That's it. Anything else you'd like to ask?",
          "person": "O'Conner",
          "present": []
        }
      ],
      "noPresent": false,
      "newContext": "-- What Scuttlebutt Saw --Scuttlebutt:\nI snuck into Juniper's dressing room while everyone was in the Lecture Hall.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nYou said you snuck in, but why would you do something like that?!\nScuttlebutt:\nBecause if I got a big scoop on Juniper, club membership would go through the roof! Right now, the Newspaper Club only has one member, me. The club's history once I'm gone. So, the Themis Herald's brand recognition is a matter of life and death!\nApollo:\nHer means may be questionable, but her motive is surprisingly sound.\nScuttlebutt:\nExtra, extra! \"Students seeking the Thrills and Chills of Exposé Journalism, Report to the Clubroom!\" This has been a paid advertisement. Anyway, where was I...?\nAthena:\n(Huh. Never took Myriam for such a go-getter.)Scuttlebutt:\nJuniper had changed into her stage costume. I asked her, \"What're you doing?\"Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nWhy would she change into that costume? The mock trial was about to begin.\nScuttlebutt:\nHow should I know? But if you don't believe me, take a look at this photo! I captured this critical moment like the gonzo journalistic pro that I am.\nAthena:\nBut, this only shows the back of whoever was fleeing.\nScuttlebutt:\nYou expect me to shoot her face when she's running away from me?\nAthena:\nI guess you're right, but... (This doesn't seem to be getting me anywhere.)\nScuttlebutt:\nAt any rate, as this photo shows, Juniper was in her stage costume.Scuttlebutt:\nWhen suddenly, she fled into the hallway, as if she wanted me to follow her.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThat doesn't mean you had to chase her.\nScuttlebutt:\nSss, sss, sss! Call it a journalist's instinct! I see something fishy, I go after it!\nAthena:\nBut you never did catch up to her, did you?\nScuttlebutt:\nSss, sss! A true undercover journalist gets up and dusts herself off when she stumbles!\nAthena:\nThat reminds me. Didn't you fall during the chase? When you tripped on your box?\nScuttlebutt:\nSss, sss, sss! A true undercover journalist is always ready to stumble over a great story!\nAthena:\nSure are a lot of holes in your story. Or is that just the Scuttlebutt brand of journalism?\nScuttlebutt:\nKahk-kahk-kahk! A true undercover journalist always prevails against her adversaries!Scuttlebutt:\nI followed her all the way to Prof. Courte's body! She led me right to it!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nWhat would our client have to gain from leading you there?\nBlackquill:\nThe accused had employed her self-penned script as a manual for murder. Ergo, she had to stop the mock trial before the script's details became public. And that accounts for her desperate attempt to lead our carton cretin here to the body.\nAthena:\n\nAthena:\nBut, as we all know, Ms. Scuttlebutt didn't alert the authorities. And as a result, the mock trial began as scheduled!\nBlackquill:\n\nBlackquill:\nThe issue here is not whether it was, in fact, halted. The fact remains that the accused was trying to lead the witness to the body. Does that not show clear intent to halt the mock trial?\nAthena:\nArrrgh!Scuttlebutt:\nI'm positive it was Juniper because she was wearing the costume that she had made!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nYou say it was our client because the figure you witnessed was wearing her costume. Isn't that a bit simplistic?\nScuttlebutt:\nSss, sss, sss! It's only as simple and clear-cut as a good piece of journalism should be!\nAthena:\n......... (Sure it's simple, but I'd hardly call it clear-cut.)\nScuttlebutt:\nThat's why I chased her, sss, sss, sss, sss!Present Stage Costume\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Ms. Scuttlebutt's sole basis for identifying our client as the figure in this photo...\"Athena:\nShe keeps saying that it was Junie, but she didn't even actually see the body.Apollo:\nYeah, but Blackquill's assertion takes that into account.Athena:\nSo, even if I press her on never seeing the body... ...I won't be able to overturn this testimony.Apollo:\nWell, whoever it was that was fleeing, Myriam never did see their face. So, I'm wondering why she thought it was Juniper. Try thinking along that line and see what you can come up with.Athena:\nMs. Scuttlebutt's sole basis for identifying our client as the figure in this photo... ...is the fact that it shows someone in Ms. Woods's stage costume.Scuttlebutt:\nSss, sss, sss. Well, it IS Juniper's costume. So that must be Juniper in it. It's clear-cut.Athena:\nNo, that's where you're completely mistaken!Scuttlebutt:\nWhaaat?!Athena:\nThis is a design drawing of our client's stage costume.Judge:\nOh, my, what a wonderful creation! The constellations are extraordinary.Athena:\nI'm glad you noticed, because those stars are precisely what's important here. In the drawing, there are constellations all over the outside of the costume. But there's not a single star on the costume in the photo!Judge:\nO-Oh, then that means... Uh... What exactly?Athena:\nYour Honor, there were no other blue costumes at the scene. Which leads me to believe... ...that the figure in the photo was wearing our client's costume inside out.Judge:\nHmm... But why would Ms. Woods make a mistake like that?Athena:\nWell, it's not really a matter of why... ...but rather, who made the mistake of putting it on inside out.Scuttlebutt:\nKahk-kahk... W-Wait, you're not suggesting...!Athena:\nThat's right. I'm glad you're catching on. The costume's designer wouldn't put her own costume on inside out!Scuttlebutt:\nKahk-kahk-kahk-kahk-kahk! Kaaaaaaaaaahk!Athena:\nSorry, Ms. Scuttlebutt, but... ...doesn't believing you had a scoop when you really didn't make you a failure as a reporter?Scuttlebutt:\nA f-failure as a r-reporter?! Kahk-kahk-kahk. Kaaahk kahk-kahk-kahk-kahk-kahk! Ack! ...Ah!!!Athena:\nWhy hello, Ms. Scuttlebutt! So nice to meet the woman beneath the box!Scuttlebutt:\nKahk-kahk-kahk-kahk-kahk-kahk-kahk-kahk! Y-- You didn't see nothing!Blackquill:Blackquill:\nNow, I would have you stop right there, Cykes-dono. For it is the why of the matter upon which I would have this court focus.Athena:\nWhat do you mean?Blackquill:\nMs. Juniper Woods!Woods:\nYes?!Blackquill:\nWhat were you doing on the morning of the mock trial?Woods:\nI was in my dressing room, *cough* painting my costume in fluorescent paint.Athena:\nFluorescent... paint?Woods:\nMy design drawing shows twinkling stars on the costume. *cough* *cough* I was going to make the costume shimmer like that by painting the inside fluorescent.Judge:\nFluor... what was that again? Fluoride? Did your costume have cavities?Woods:\nNot fluoride -- fluorescent, as in glowing. The paint would make it glow in the dark. *cough*Blackquill:\nYes, yes, so you applied that to the inside of the costume. And then?Woods:\nI let it dry for a while because I heard it takes a long time. So I put the costume on my mannequin inside out.Athena:\nInside out...? So, then...Blackquill:\nThis is a photograph of the inside-out costume taken in the dark. As you can see, there is a heavy layer of paint over the entire inside surface. If someone were to properly don this costume in this state... ...the wet paint would get all over their body.Judge:\n...Why, yes! I believe it would!Blackquill:\nIndeed. Ergo, the costume was worn the way it was, not by anyone's mistake... ...but because this was the way it was on the mannequin -- inside out!Athena:\nGah!Glowing Costume Photo added to the Court Record.Apollo:\nFigures he would have a photo.Athena:\nUgh. Did we just fall into his trap?Apollo:\nYeah, I bet Blackquill had it all planned out. Still, I think you should give this photo a nice, long look.Athena:\nOh, please tell me you found something that doesn't add up.Apollo:\nCheck out the chest area. It kinda looks like handprints to me. (Changed from [Check out the chest area. It kinda looks like a hand print to me.] in the original release)Athena:\nHey, you're right! But Junie would know better than to touch it while the paint was still wet.Blackquill:Blackquill:\nI believe the term to describe your thought process is wishful thinking. After all, if master painters make mistakes, why not a rank amateur such as the accused?Athena:Athena:\nSo basically... you're saying, my claim requires evidence to back it up?Apollo:\nEvidence? That shouldn't be a problem, right? After all, you've come this far.Athena:\nJust because I've come this far, that doesn't mean I've thought everything through, though...Apollo:\nWhat?! You mean you've just been bluffing?!Athena:\nWhat did you expect me to do?! I'm sick of losing to this guy! But you're right... There's only one thing left to do at this point! And that's to present some evidence! Pronto!Blackquill:\n............A showdown, is it? I gladly accept!Athena:\n(The fluorescent paint must have stuck to the hands of whoever touched the costume. And that paint should glow in dark places... So, I just need to carefully check every last piece of evidence!) This piece of evidence shows who touched the costume!Present Themis Herald Extra\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"A school newspaper?\"Present anything else\n\n\n\n\n\n\n\nAthena:\n\nBlackquill:\n.........\nJudge:\nIt seems Prosecutor Blackquill is not too pleased with your off-target evidence.\nAthena:\n\nAthena:\nOr is it so on target that it's rendered him speechless?!\nJudge:\nHmm... Let's ask him what he thinks. Prosecutor Blackquill?\nBlackquill:\n.........\nJudge:\nAs I thought. My initial suspicion was correct.\nAthena:\nGah hah! (Now I'M speechless...) Please! I think I've got it this time!\nLeads back to:\n\"The fluorescent paint must have stuck to the hands of whoever touched the costume.\"Judge:\nA school newspaper?Blackquill:\n...Interesting.Athena:\nTake a look at the photo where the lights are dimmed and the spotlight is on Ms. Woods. Observe Mr. Newman's hand in that photo as he stands at the prosecutor's bench. As you can see, it's glowing, just like Ms. Woods's fluorescent paint.Judge:\nHmm... It is glowing -- quite brightly I might add.Athena:\nBut why would he put fluorescent paint on his hand for the mock trial, you may ask? The answer is he wouldn't -- not on purpose. It got there when he put the costume on.Judge:\nOh...? I mean, oh! That means...! ......What again?Athena:\nIt means the figure photographed in the costume was not our client Juniper Woods. It was her classmate, Robin Newman!Judge:\nWHAAAAAAAAAT?!Apollo:\n...To think you were actually able to prove that...Athena:\nWell, you never know what's going to happen next. That's the thrill of the courtroom!Apollo:\nHmm... So, then... ...does that mean that Robin is our man...?Athena:\nHmm... Well... That's certainly how it looks...Blackquill:\nHmph. Very well, Robin Newman it is! He is here in the gallery, I trust? Show yourself! I challenge you to a duel!Judge:\nWill the witness please state his name and occupation.Newman:\nIIIIIIIIIII'M ROBIIIIIIIN NEWMAAAAAAAAN!!! I want to become a great artist! I practice day and night!!! YEAAAAAAH! NOOOOOO! That's not it! Art's gotta be sincere, maaaaaan!!!Judge:\nSo, for occupation, should we put down ...budding artist?Newman:\nNOOOOOO! Themis Legal Academy! Senior! PROSECUTOR COOOURSE! This brace is proof of my masculinity! I've been training to be a prosecutor for eighteen years! (Changed from [This brace is proof of my masculinity! I've been training to be a prosecutor for 18 years!] in the original release)Judge:\n*ahem* I assume you will be cleaning up the pottery you smashed before you leave today.Newman:\n.........Aaaaaaaaagh! AWWW, MAAAAAAAAAN!!! Aaaaaaaaagh! Aaagh...Judge:\nHmm... It seems the witness has finally settled down.Athena:\n(I guess nothing fazes the judge after all these years.)Judge:\nYou may proceed with your testimony, Mr. Newman. Specifically, the court wishes to hear why you had fluorescent paint on your hand.Witness Testimony-- Why I Touched the Costume --Newman:\nI went to see Juniper in her dressing room! BUT SHE WASN'T THERE!\nWhen I walked by that frilly costume, I was like, whoaaaaaa!!!\nThe mannequin it was on! IT WAS ABOUT TO FALL ON ME!!!\nI got that paint on me when I caught it!\nBut I never put it on! That's just STUUUPID!!!Athena:Athena:\nYour Honor! I recommend a short therapy session for the witness.Judge:\nWell, Mr. Newman does seem particularly agitated, but...Newman:\nAgh! ...Arrrgh! Aaaaaaaaagh! Nooooooooooooooo!Apollo:\nNot again. What's his problem?Athena:\nI sensed it the moment Robin took the stand. ...The discord in his heart!Apollo:\nSo, you think he might be hiding something?Athena:\nProbably! You ready, Mr. Newman? Let's see what the Mood Matrix can do for you!Newman:\nI went to see Juniper in her waiting room!Newman:\nBUT SHE WASN'T THERE!Newman:\nWhen I walked by that frilly costume, I was like, whoaaaaaa!Pinpoint Happy marker\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"When you mentioned the stage costume...\"Newman:\nThe mannequin it was on! IT WAS ABOUT TO FALL OVER!!!Newman:\nI got the paint on me when I caught it!Newman:\nI never put it on! That's just STUUUPID!Athena:\nHe had to catch the mannequin as it suddenly started to fall over?Apollo:\nEven I can guess this one. The most natural response would be surprise.Athena:\n(Apollo's right, so maybe I should try focusing on some other emotion.)Athena:\nWhen you mentioned the stage costume... ...I sensed a sudden, powerful feeling of joy. Would you care to explain, Mr. Newman?Newman:\nW-W-Wait?! WHAAAAAAT?! Wh-Why would a frilly scarf-thing and a long skirt make me feel like that?!Athena:\nI don't know, but you seem awfully interested in that costume for some reason. You didn't happen to put it on, did you?Newman:\nL-Like I'd be into that kinda thing! I'm a dude! And I'm into braces! (Changed from [L-Like I'd be into that kinda thing! I'm a dude! I'm into braces, not dresses!] in the original release)Apollo:\nYou don't think... Robin's actually got a thing for Juniper's outfit... do you? (Changed from [You don't think... Robin likes girls' clothes... do you?] in the original release)Athena:\nOh, come on! Isn't it obvious?!Apollo:\n...You're enjoying this a bit too much, Athena.Newman:\nNO WAY, MAAAAAAAAAAAAAAAAAN! The mannequin came falling toward me, so I stuck out my hands to stop it! End of story!!!Athena:\nThat's a new piece of information! Time to run an update! (Hmm... Even after that update, something just doesn't feel right here. Do I have anything that could prove his statement contradicts what really happened?)Present Glowing Costume Photo\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"You said the mannequin came falling toward you, so you stuck your hands out to stop it.\"Present anything else\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThis piece of evidence clearly shows the contradiction in your statement!\nNewman:\nNo way, maaaaaan! The only contradiction that thing shows... ...is your existeeeeeeeeeeeeence!!!\nAthena:\nUgh! (I-I object to that statement! Okay, so... Maybe I should compare when he caught the mannequin against the evidence.)\nLeads back to:\n\"Do I have anything that could prove his statement contradicts what really happened?\"Athena:\nYou said the mannequin came falling toward you, so you stuck your hands out to stop it. If so, then then fingers of your hands would've been pointing outward like this. But that's not what the handprints show. In fact, this looks more like just your thumbs and the base of your palms.Newman:\nWh-Why in the world would I leave such weird handprints?Athena:\nYou know why! You left them when you went to adjust the scarf after putting it on. Just like the model in this drawing!Newman:\nWHOOOOOOA!Athena:\nWhy don't you admit it, Mr. Newman? You DID put the stage costume on, didn't you? And you really DO like Ms. Woods's clothes, don't you? (Changed from [And you really DO like frilly clothes, don't you?] in the original release)Newman:\nFine! I admit to putting the costume on! BUUUUUUT! I DON'T LIKE GIRLY CLOTHES, MAAAN!!!NOISE LEVEL90%Athena:\nYes! New information to plug in! Time for another update!Newman:\nI snuck in, knowing the costume was in there!Newman:\nMy heart was pounding, even though I'm a guy.Newman:\nThen I saw it! It was even more amazing than I'd imagined!Newman:\nI was like, WHOAAA! I'm a guy, but I got all excited!Pinpoint Sad marker\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"There! Another emotion that doesn't fit.\"Newman:\nIt's true! I did put on girly clothes!Pinpoint Sad marker\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"There! Another emotion that doesn't fit.\"Newman:\nBut it was strictly for artistic purposes!Athena:\nHopefully, we can figure out what Robin's hiding based on this new information.Apollo:\nJust hope it's not more than we bargained for, although that usually seems to be the case.Athena:\nThere! Another emotion that doesn't fit.Newman:\nSo what?! You're really starting to get on my nerves, maaaaaan!Athena:\nMr. Newman, you got excited when you put the costume on... ...but you also felt sad.Newman:\nWho cares if I felt sad?! It's no big deaaaaaal!Athena:\nOkay, Mr. Newman, out with it! Why did you feel sad?! You're hiding something, aren't you?!Newman:\nOoh! Nooooooooo!Athena:\nYou're not fooling anyone anymore. Now, tell us why you were sad!Newman:\nOKAAAAAY, FIIINE! If you're gonna be that way, I'll tell you!!! The reason I felt sad is... is... is...!!! No matter how much I dress up, I'll never be as pretty as Juniper!!!Apollo:\nWell, no offense, but his habit of shouting at the top of his lungs... doesn't exactly help... (Changed from [Well, no offense, but for one thing, he's a guy -- and a real hothead at that.] in the original release)Newman:\nNOOOOOOOOOOOO! THAT'S NOT IIIIIIIIIIT! I totally owned those girly clothes! I should've been totally pretty!!! BUT! BUT! THERE'S SOMETHING THAT KEEPS GETTING IN MY WAAAAAAY!!!Athena:\nWow! That's a whole lot of anger and raw emotion right there! His heart is crying out in pain -- his emotions are out of control!Apollo:\nOut-of-control emotions...! We saw those during the Nine-Tails Vale incident. (Changed from [Out-of-control emotions...! We saw those during the Nine-Tales [sic] Vale incident.] in the original release) So, all we have to do is find the source of his uncontrollable anger, right?Athena:\nRight. Help me look for a conflict between his statements and the images we see. If we can find that we can wrestle him away from whatever's tormenting him. (Mr. Newman said that there's something \"getting in the way\" of him being pretty. Something that doesn't go with \"girly clothes\"... But what could it be?)Newman:\nFINE! I'LL TESTIFY, MAAAAAAN!!!NOISE LEVEL85%Newman:\nI snuck in, knowing the costume was in there!Newman:\nMy heart was pounding, even though I'm a guy.Newman:\nIt's true! I felt a powerful feeling when I saw that long frilly scarf.Newman:\nI admit it! I wore girly clothes!Newman:\nI felt like a diva when I pulled the hood over my head!Probe Brace\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Mr. Newman, you feel a great deal of anger toward your brace, don't you?\"Newman:\nIt felt so right I was totally dressed up like a girl!Probe Brace\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Mr. Newman, you feel a great deal of anger toward your brace, don't you?\"Apollo:\nSo, we're looking for the source of his anger?Athena:\nRight. The conflict in his testimony will most likely arise from his emotional repression. Let's compare the images to his testimony! We might find the problem that way!Athena:\nMr. Newman, you feel a great deal of anger toward your brace, don't you? Is that what you feel is holding you back from being as pretty as you think you should be?Newman:\nHuh? Wh-Wh-Wh-WHAAAAAAT?!Athena:\nMr. Newman! The truth is, you really want to take that brace off, don't you?Newman:\nNo way maaan! This is a symbol of masculinity! I could never take it off!!!Athena:\nIs it that you can't take it off, or that you don't want to take it off?Newman:\nAw, maaaaaaaaaaaan! I shoulda kept my big mouth shut!!!Athena:\n......... (This is really weird. He exhibits intense anger toward his brace, which he calls a \"symbol of masculinity\"... ...but he can't take it off, not even when he's trying to look pretty. (Changed from [...but he can't take it off, even when dressing like a girl.] in the original release) What could be at the root of his complicated relationship with his brace? (Changed from [And why is he so interested in girls' clothes in the first place?] in the original release) I have a feeling we're on the verge of uncovering an earth-shattering secret.)Apollo:\nAthena? You okay?Athena:\nIt seems Robin is still hiding a secret. A big one.Apollo:\nBigger than the fact that he's secretly jealous of Juniper's looks? (Changed from [Bigger than the fact that he likes to wear girls' clothes?] in the original release)Athena:\nYes, at least I think so. ! (No, it can't be! I just thought of something, but it's totally insane!) Mr. Newman!Newman:\nWh-What?!Athena:\nI'm on to your little secret. And if I'm correct, it's not very little at all. It's huge! This sounds completely insane, but it's the only possibility left.You want to be pretty like a girl (Changed from [You like girls' clothing] in the original release)\n\n\n\n\n\n\n\nAthena:\nRobin Newman! You want to be as pretty as you feel! (Changed from [Mr. Newman! You like to dress like a girl!] in the original release)\nNewman:\nThat's right! And I'm never gonna change! I'll show you how real men cross-dress!!!\nAthena:\nYou will? (Now???)\nApollo:\nAthena, we already know he likes to cross-dress. This line of discussion is a dead end.\nAthena:\n(And yet, he can't take that \"symbol of masculinity\" off... (Changed from [But if he really likes to dress like a girl, you'd think he'd want to...] in the original release) ...even when it clashes with his ideal self-image. Wait, could this mean...? (Changed from [...take that 'symbol of masculinity' off when he does it. Wait, could this mean...?] in the original release))\nLeads back to:\n\"This sounds completely insane, but it's the only possibility left.\"You hate girls\n\n\n\n\n\n\n\nAthena:\nYou don't like girls, do you?\nNewman:\nWhat?! Whaaaaaat?! WHAT GAVE YOU THAT IDEA?!\nAthena:\nOh... Then, what? You like girls?\nNewman:\nI-I-I! I refuse to answer thaaaat!\nApollo:\nAthena, you're not asking just of curiosity, are you?\nAthena:\nWhat? N-No, of course not! (Better try something else.)\nLeads back to:\n\"This sounds completely insane, but it's the only possibility left.\"You're a girl\n\n\n\n\n\n\n\nLeads to:\n\"Mr. Newman, or should I say... Ms. Newman...\"Athena:\nMr. Newman, or should I say... Ms. Newman... You are and always have been a girl!Apollo:\nWhat?! Have you lost the plot, Athena?!Athena:\nNo, I'm completely serious. I don't have any direct evidence. But that's what Robin's heart is shouting out, loud and clear!Apollo:Apollo:\nI still think you've totally lost it! I mean, Robin reeks of testosterone! How could he possibly be a she?! I, for one, have never seen a girl who shouts like a maniac all the time!Newman:\nOoh. Ooh hoo hoo. Ooooooh.Judge:\nI've seen plenty of witnesses in my day... ...but if he's a she, then she's the most convincing actress I have ever encountered. Therefore, let me pronounce my verdict. Robin Newman is without question... a man!Newman:\nOoh. Ooh hoo hoo. Ooooooh. Ooh hoo hoo.........Blackquill:\nYou are now truly Justice-dono's equal in one area. You are just as equally insane! Never in the history of this planet has there been a finer specimen of the masculine spirit.Newman:Newman:\nOooh... AAAAAAAAAAAAGH! IF YOU GUYS ARE DONE TALKING ABOUT MEEEEEEEEEEE!!! AAAAAAAAAAAAGH! I'M...! I'M...!.................. ............Heh... Ha ha! Ah ha ha ha ha ha! Ah ha ha ha ha ha ha ha ha ha ha ha!Athena:\nAhhhhhhh! The brace! It's...!Newman:\nMs. Cykes... No, allow me to call you \"Athena.\" I wanted to keep this a secret at all costs! But noooo!Apollo:\nWh-- No waaaaaaaaaaaay!Blackquill:\nGnnnaaaaaaaaaaaaaaaaaah! .........S-Surely this must be some kind of jest?Newman:\nEh heh heh, nope, it's for real. I'm a girl, body and soul. If you don't believe me, I'll give you a P-E-E-K.Blackquill:\nAaaaaaagh!Newman:\nAs if! Ah ha ha ha ha!Athena:\n(What an amazing transformation.) Well, all the discord is gone. The image is now complete!NOISE LEVEL0%BYE BYENewman:\nI was raised as a boy since I was little, and I studied law just as my parents wanted. But now, this living lie that had me pinned to the ground, it's...! Aaaaaagh! *huff* *puff* It's been blown to smithereens by you, Athena! Now I can stop pretending I want to be a prosecutor! I'm gonna be an artist! Yaaaaaaaaaaaay!!!Judge:\nOrder! Order!!! What a shocking development. He really DID turn out to be she!Newman:\nEek! Why's everyone looking at me like that?! Tee hee! I feel like a movie star or something! But no paparazzi please! I value my privacy, O-K-A-Y? RAAAAAAAAAWH! No pics or you'll regret it, maaaaaaaaaan!!!Apollo:\nAm I just imagining things, or is Robin even more hyper now than when she was a he?Athena:\nI don't know. Maybe it's because she finally got her troubles off her chest, literally.Judge:\nThis is all well and good, but does he being a she actually change anything?Athena:\nThe fact that the witness is a girl does change things. Because there is now a piece of evidence that we must re-evaluate!Judge:\nHmm... Very well, let's see what the defense has for us now. What piece of evidence must we reconsider now that we know that the witness is a girl?Present Tape Recorder\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"This is what I'd like the court to reconsider.\"Present anything else\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThis piece of evidence must be reconsidered because Mr. Newman is really Ms. Newman!\nJudge:\nHmm... Please do explain.\nAthena:\nYes, Your Honor. You see, I feel that if you have a sharp eye and an open mind... ...you can discover something completely new in the most obvious of places!\nJudge:\nHmm... Yet, the defense's statement reflects anything but those two admirable traits.\nAthena:\nEeek! (Guess that won't fly! But I know we have some sort of evidence that could be seen differently based on sex.)\nLeads back to:\n\"What piece of evidence must we reconsider now that we know that the witness is a girl?\"Athena:\nThis is what I'd like the court to reconsider.Judge:\nOh, the tape recorder -- the one that recorded the threat, \"You're a goner!\"Athena:\nThat's right. And we have already established that it's a female voice in the recording. Of all the students who could've moved the body before the mock was to start... ...our client was the only female if you exclude Ms. Scuttlebutt because of her alibi. And that is why the tape recorder made our client the prime suspect.Judge:\nAh... So then...!Athena:\nThat's right! The witness just revealed that she's a girl! Therefore! If we are using the voice in this recording as the basis for hurling accusations... ...this witness must be labeled a suspect, too!Newman:\nOh... Oh, noooooo!Apollo:\nWow... Talk about a sudden turn of events. You've done it. You've found a hole in one of the prosecution's key pieces of evidence.Athena:\nYeah... But, wow, that was a lot of work for a single one.Blackquill:Blackquill:\nNot so hasty, now. You're forgetting that only one person here was privy to the script. Ergo, Ms. Juniper Woods is still the prime suspect!Athena:Athena:\nBut Ms. Newman hid the fact that she was a girl, both at the crime scene and in court! I'd say that puts her in Camp Suspicious!Newman:\nEek! That's not nice, Athena! How can you accuse me of being a killer? I mean, I'm just a weak, innocent little girl! Just thinking about murder makes me--Blackquill:Blackquill:\nHmph! Suspicious is as suspicious does. Undoubtedly, the witness does have some sort of connection to this crime. Perhaps our newfound lady is merely feigning ignorance. We can surmise that she lent support to the principal offender, Juniper Woods. By leading Ms. Scuttlebutt to the body, that would make her an accessory to the crime.Newman:\nHow can you say that?! I'm not an accessory to any crime, Mr. Birdman!Blackquill:Blackquill:\n...B-Birdman...? In any event, with the witness as an accessory, it explains quite a bit, does it not?Athena:Athena:\n............Argh! (He made it all make sense somehow! And he'll keep accusing Junie unless we can show someone else knew the script's details. But how could someone have gotten their hands on that kind of info? The only way they could've known what was in the script was if they...)Saw the mock trial\n\n\n\n\n\n\n\nAthena:\nNothing could be more simple. All anyone had to do was watch the mock trial.\nBlackquill:\n.........\nApollo:\nBut Athena, the murder took place before the mock trial even began.\nAthena:\nOof, that's right.\nBlackquill:\n.........\nJudge:\nI believe Prosecutor Blackquill wishes to penalize you, Ms. Cykes.\nAthena:\nYeowch! (What is this, Athena the Piñata Day?)\nLeads back to:\n\"The only way they could've known what was in the script was if they...\"Heard it from Junie\n\n\n\n\n\n\n\nLeads to:\n\"Sorry, Junie, but...\"Had penned the script\n\n\n\n\n\n\n\nAthena:\nI've got it! All anyone has to do is write their own script! In a completely stream-of-thought, devil-may-care way!\nJudge:\nI'm not even going to ask how such a Frankenstein could resemble the actual script!\nAthena:\nNoooooo! (Oh, well, if at first you don't succeed...)\nLeads back to:\n\"The only way they could've known what was in the script was if they...\"Athena:\n(Sorry, Junie, but... You're not going to like this.) Our client may have leaked the script's details to someone.Blackquill:\n...What the devil?Woods:\nAnd I know I shouldn't have, but... I revised the script to favor the prosecution. But Prof. Courte noticed it immediately and changed it back.Athena:\nMs. Woods did not want Hugh O'Conner to win the mock trial. That's why I believe she leaked the details to the witness, Robin Newman.Apollo:\nI get it. If Robin won, Hugh wouldn't be able to confess to Juniper.Athena:\nRight. Junie was probably trying to keep their friendship from becoming awkward.Newman:Newman:\n*sob* *sniffle* How could you, Thena! WHADDA BUNCH O' BULL! I...! I...! I NEVER HEARD A WORD ABOUT THE SCRIPT FROM JUNIPER. NEVER EVEEEEEER!Athena:Athena:\nYou sure?! Can you look me in the eye and swear you didn't?Newman:\nB-A-D Athena... YOU DON'T HAVE ANY EVIDEEEEEEEENCE!Athena:\nGrr...Apollo:\n.........Actually, we might have just the thing.Athena:\nReally?Apollo:\nYeah, one of Robin's lines I read when we were reenacting the mock trial.Klavier:\nHere's a shot of the crime scene. Ironically, it was Prof. Courte who posed as the corpse. Herr Forehead, how did the mock trial participants react to this photo?Apollo:\nMr. Newman was surprised by what Prof. Courte was wearing.Apollo:\nRobin said, \"Oh, the green sweat suit.\"Newman:\nS-U-R-E, I might have said that. But... SO WHHAAATTT?!Apollo:\nWell, think of it this way, Athena.Athena:\nY-Yeah. Uh, which way, exactly?Apollo:\nIf I told you that I'd be wearing a blue suit today... ...but then showed up wearing what I've got on now, what would you say?Athena:\nUmm... \"Oh, the red suit.\" Ah! (I-I think I've got it...!) Your Honor! We have evidence proving that Ms. Newman knew the contents of the script. The defense moves to present said evidence to the court!Judge:\nVery well, Ms. Cykes. Present away.Athena:\nThis evidence proves that Ms. Newman had prior knowledge of the script's contents.Present Mock Trial Script\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"...The mock trial's script?\"Present anything else\n\n\n\n\n\n\n\nAthena:\n\nJudge:\nHmm... And on what are you basing your assertion?\nNewman:\nI don't understand! Why are you just making stuff up? Oh, Athena! Shame on Y-O-U!\nJudge:\nYes, that's R-I-G-H-T!\nAthena:\nS-O-R-R-Y!\nNewman:\nOh my gawd, you two! That was so C-U-T-E!\nJudge:\nWhy, thank you! Erhm, but I'm afraid I must award Ms. Cykes a penalty.\nAthena:\n(When Robin commented about the body in the mock trial... ...it was like she was saying Prof. Courte was wearing the sweat suit she always wore. That's not something you'd expect her to say, unless...!)\nLeads back to:\n\"This evidence proves that Ms. Newman had prior knowledge of the script's contents.\"Judge:\n...The mock trial's script?Athena:\nMs. Newman, during the mock trial, you were shown a photo of the victim's body... ...and reportedly, you reacted by saying, \"Oh, the green sweat suit.\"Newman:\nOh, um... Yes, I said that. What's your point?Athena:\nYou seemed to have some issue with the green sweat suit, and I think I know why. The proof is in the script, specifically on the \"Things to Prepare\" page. \"Sweat suit: Victim's outfit will be a red one from the prosecutor course.\"Newman:\nAh!Athena:\nYou were surprised because the sweat suit in the photo was green. But, if you didn't know about the script's content... Then that shouldn't have surprised you!Newman:\n...N-- Noooooooooooooooooo! I thought we were friends, Athena! How could I have been so bliiiiiiiiind!Athena:\nIn light of her privileged knowledge, I move to declare Ms. Newman a suspect, Your Honor!Judge:\nYou whaaaaaat?!Newman:Newman:\nIf knowing script details makes me a suspect... ...then there must be others besides me! I mean, someone else could've also seen Prof. Courte's note!Athena:\nNote...? What note?Newman:\nThe professor and Juniper were working together to prepare for the mock trial. But only one copy of the script was made to prevent it from being leaked. But that gets kind of inconvenient, right?Athena:\nYou're not seriously going to suggest...!Newman:\nEek! But it's the truth! Prof. Courte did do exactly what you're thinking! She didn't write down any of the proceedings or the truth behind the case... But she did write a note to herself about the props and details about the victim's B-O-D-Y!Athena:\n...Is this really true, Ms. Newman?Newman:\nIf you don't believe me, send the police over to my house! Tell them to check the pictures on my camera. I thought it might give me an advantage... ...so I took a picture of the note!Apollo:\n.........I'd say she's telling the truth.Athena:\n(...Wait a sec!) If there's a note with details about the body, then that means... ...there are others who could have made the murder look like our client's script!Judge:\nYes, I believe you're right!Blackquill:\n...Hmph!Athena:\nApparently, this case isn't as clear-cut as Prosecutor Blackquill would have us believe. This new revelation blasts a big fat hole in the prosecution's case!Judge:\nO-hoooooooooo!Blackquill:Blackquill:\nBully for you, missy. But don't think this spells victory.Athena:\nAnd why not?!Blackquill:\nThe battle is still young. And my blade is now fully drawn. Between it and my next witness, your life will be forfeit. So, put away your wooden sword... ...and show me what you are truly capable of if you wish to live!Athena:\n(You want it? Don't worry, I'm gonna bring it!)O'Conner:\n......... I already said I want nothing to do with this trial.Blackquill:\nHow juvenile. It is not a matter of what you want, for you WILL cooperate, Hugh O'Conner.Judge:\nProsecutor Blackquill. Why have you called this witness?Blackquill:\nYou will recall that the day before the mock trial -- in short, the day of the murder... ...the accused testified that she left for home at around 6:00 PM.Judge:\nYes. My notes here do confirm that fact.Athena:\nRight. Our client wasn't at school at the estimated time of death, so she couldn't be--Blackquill:Blackquill:\nYet, that was but a felicitous lie. Or am I mistaken, Golden Boy?O'Conner:\n...I've no intention of saying anything more. Now, if you'll excuse me.Blackquill:\nHold! I am not through with you yet.O'Conner:\nHeh. It seems the rogue prosecutor has it out for me.Blackquill:\nLeave, and we just might discuss you-know-what.O'Conner:\nAck! N-No, wait!Athena:\n(One little statement and Mr. Cool loses it? What's that all about?)O'Conner:\nI changed my mind. ...I'll stay and testify.Judge:\nHmm... Are you sure, Mr. O'Conner?O'Conner:\nHeh. The word of a genius is as good as gold. Let's get on with this. Hugh O'Conner. A senior at Themis Legal Academy, lawyer course. How's that?Judge:\nJ-Just fine. Your testimony, then... If you please.Apollo:\nYou're up against the top of the class now. I'd be careful if I were you.Athena:\nI know Junie would never lie like that! That pompous schoolboy won't know what hit him!Witness Testimony-- Around the Time of the Murder --O'Conner:\nTo get mentally prepared for the mock trial, I meditated at the archery range till 7:00 PM.\nAt around 7:15, I went to the main building before going home. That's when I saw Juniper.\nWe didn't say much as we passed by each other. She seemed her usual self.\nThat's it. Anything else you'd like to ask?Blackquill:\nThat is quite enough. Well done, Golden Boy.O'Conner:\n...Heh.Blackquill:\nThe final bell rings at 7:00 PM, at which point, the campus is a desolate place. Now, you will recall the tape recorder. We know the time of the voice recording. It was 7:10 PM, the day before the mock trial. That was the dark hour of this heinous crime.Athena:\nD-Do you have any proof of that?!Blackquill:\nAs its final bell, this school plays a special broadcast when the clock strikes seven. The female voice on the tape appears ten minutes after that broadcast. The killer waited until the school was empty to spring her devious and deadly trap.Tape Recorder updated in the Court Record.Judge:\nSo, when the witness saw the defendant, that would've been...!Blackquill:\nIndeed. It was five minutes after the voice was captured on tape in the art room. Ergo, we know that the accused was still in the main building, even after the killing.Judge:\nHmm... So the time of the murder and the time of when the body was moved...Athena:\n(Great... Another inconvenient testimony.)Judge:\nMs. Cykes, your cross-examination, please.Cross ExaminationCross Examination-- Around the Time of the Murder --O'Conner:\nTo get mentally prepared for the mock trial, I meditated at the archery range till 7:00 PM.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSo, um... do you meditate often?\nO'Conner:\nHeh. Don't tell me you're going to start pestering me, too.\nAthena:\nWhat's that supposed to mean?\nO'Conner:\nNo need to play dumb with me. All the girls want to know about my private life.\nAthena:\nWha--?!\nJudge:\nI will remind the defense this is a court of law, not a pick-up spot.\nBlackquill:\nHmph. It seems miss fancy-pants lawyer is smitten with the witness.\nAthena:\n\nAthena:\nObjection! Objection!!! OBJECTIIIIOOOOON!!! I'm just trying to establish the witness's--\nO'Conner:\nIf you must know, I never go a day without meditating. Satisfied now, stalker girl?\nAthena:\nThat's it! You'd better take that--!\nApollo:\nWhoa, whoa, there, tiger. Just take a deep breath and relax.\nO'Conner:\nHeh. I'll just continue my testimony now, if you don't mind.O'Conner:\nAt around 7:15, I went to the main building before going home. That's when I saw Juniper.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nOur client has stated she went home at 6:00 PM!\n\n\nAthena:\nYou and Prof. Courte were busy preparing for the mock trial together yesterday, right? Was that the last time you saw her?\nWoods:\n...Yes. I left school at around 6:00 PM.\n\n\nO'Conner:\n...No, wrong. I don't know what she was doing, but Juniper was definitely at school after 7:00 PM. But I suppose neither side can prove one way or the other.\nAthena:\nUgh. (But if Junie was there, that means she's lying.)\nO'Conner:\nTruth be told, I only saw her for the briefest of moments.O'Conner:\nWe didn't say much as we passed by each other. She seemed her usual self.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSo you just walked past a good friend, barely saying a word?\nO'Conner:\nThe final bell had already rung. They get mad when you stand around chatting. Then again, we're not like you people, talking endlessly in those annoyingly loud voices.\nAthena:\n\nAthena:\nAnnoyingly loud voices?! I'd like it if you refrained from insulting my partner like that!\nApollo:\nNormally, I'd shout, \"Objection!\" right about now, but I'll take this one for the team.\nO'Conner:\nHeh. Anyway, I think that's about all I have to say.O'Conner:\nOh, let me add I never went to the art room. There was no reason for me to be there.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nYou had no reason to be in the art room... Really?\nO'Conner:\nThe lawyer course I'm in is supervised by Prof. Means. Plus, I'm not a member of Prof. Courte's Art Club, so why would I even go there?\nAthena:\nWhat about art class?\nO'Conner:\nHeh. Nice try, but Seniors don't take art class.\nAthena:\nAll right, then let me ask you--\nO'Conner:\nWait. I just remembered something important!\nAthena:\nYou did?\nO'Conner:\nI scored only a hundred percent on all the art tests I took through Junior year. (Changed from [I scored only 100% on all the art tests I took through Junior year.] in the original release) ...That's it.\nAthena:\n(Riiight... Always happy to indulge in some ego-stroking. Anyway, what to ask next...)\n\n\n\nHow did you prep for the mock trial?\n\n\n\n\n\n\n\nAthena:\nPlease tell the court what you were dong on October 23rd, the day before the mock trial.\nO'Conner:\nHeh. That's an easy one -- nothing in particular.\nAthena:\nNothing at all? You didn't help with the preparations?\nO'Conner:\nYou don't get it, do you? I was merely playing the role assigned to me. I left the preparations and the like to others. My job was to be mentally prepared.\nAthena:\n(Junie put her heart and soul into getting things ready, while he just sat on his behind?)\nO'Conner:\nJust to reiterate, I spent most of the 23rd meditating at the archery range. I didn't talk to anyone until the school closed at 7:00 PM. I supposed a few Archery Club members did come and go while I was there.\nAthena:\nBut you didn't talk to anyone? Not a single soul?\nO'Conner:\nThat's right. I didn't say a word to anyone till the final bell at 7:00 PM.\nAthena:\nI see... This is crucial information. Please add it to your testimony.\nO'Conner:\nI don't know if you're bluffing, but if you are, you have a pretty good poker face.\nChanges statement from \"Oh, let me add I never went to the art room. There was no reason for me to be there.\" to \"I didn't talk to anyone until the final bell. I'd been meditating alone at the archery range.\"\n\n\n\n\nWhy did you stay past the last bell?\n\n\n\n\n\n\n\nAthena:\nWhy would an honor student like you ignore the last bell?\nO'Conner:\nI wouldn't say I ignored it. I was simply running a little late.\nAthena:\nDo you remember exactly how late?\nO'Conner:\nHeh. You're a stickler for details, lady. But if I had to say, it was maybe about ten, fifteen minutes. If you think that's important, I'll add it to my testimony.\nAthena:\nI was hoping you'd say that.\nChanges statement from \"Oh, let me add I never went to the art room. There was no reason for me to be there.\" to \"The final bell had rung ten, fifteen minutes earlier. No biggie.\"\n\n\n\n\nNo further questions\n\n\n\n\n\n\n\nAthena:\nActually, never mind. I've got all the info I need.\nO'Conner:\nHeh. My, don't we seem confident.\nLeads back to cross-examinationO'Conner:\nThe final bell had rung ten, fifteen minutes earlier. No biggie.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nYou ignored the last bell for no reason? Shame on you!\nO'Conner:\nNo, shame on YOU! Pressing me for no reason...\nAthena:\nGrrr...!\nApollo:\nWell, people do run late sometimes. Like you on the day this whole case began.\nAthena:\nArrrgh!\nJudge:\nIt appears we have a culprit in the case of \"The Pot Calling The Kettle Black.\"\nAthena:\nEt tu, Your Honor...?! (Hmmm... Now what? Ask another question?)\n\n\n\nDid you go to the art room?\n\n\n\n\n\n\n\nAthena:\nDid you stop by the art room, or as it's now known, the scene of the crime?\nO'Conner:\nNo, I didn't.\nAthena:\nCan you prove it?\nO'Conner:\nAs much as I'd like to say I could, I can't. But let me ask you, can YOU prove that I did?\nAthena:\nAs much as I'd like to say I could, I can't. But I will ask how often do you visit there?\nO'Conner:\nHardly ever. There's no reason for me to be there, anyway.\nAthena:\nThere's no reason for you to be there?\nO'Conner:\nIs there an echo in here? If something's bothering you, I'll just add it to my testimony.\nAthena:\nHow considerate. Thank you for noticing. Let's add your statement to your testimony.\nChanges statement from \"The final bell had rung ten, fifteen minutes earlier. No biggie.\" to \"Oh, let me add I never went to the art room. There was no reason for me to be there.\"\n\n\n\n\nHow did you prep for the mock trial?\n\n\n\n\n\n\n\nAthena:\nPlease tell the court what you were dong on October 23rd, the day before the mock trial.\nO'Conner:\nHeh. That's an easy one -- nothing in particular.\nAthena:\nNothing at all? You didn't help with the preparations?\nO'Conner:\nYou don't get it, do you? I was merely playing the role assigned to me. I left the preparations and the like to others. My job was to be mentally prepared.\nAthena:\n(Junie put her heart and soul into getting things ready, while he just sat on his behind?)\nO'Conner:\nJust to reiterate, I spent most of the 23rd meditating at the archery range. I didn't talk to anyone until the school closed at 7:00 PM. I supposed a few Archery Club members did come and go while I was there.\nAthena:\nBut you didn't talk to anyone? Not a single soul?\nO'Conner:\nThat's right. I didn't say a word to anyone till the final bell at 7:00 PM.\nAthena:\nI see... This is crucial information. Please add it to your testimony.\nO'Conner:\nI don't know if you're bluffing, but if you are, you have a pretty good poker face.\nChanges statement from \"The final bell had rung ten, fifteen minutes earlier. No biggie.\" to \"I didn't talk to anyone until the final bell. I'd been meditating alone at the archery range.\"\n\n\n\n\nNo further questions\n\n\n\n\n\n\n\nAthena:\nActually, never mind. I've got all the info I need.\nO'Conner:\nHeh. My, don't we seem confident.\nLeads back to cross-examinationO'Conner:\nI didn't talk to anyone until the final bell. I'd been meditating alone at the archery range.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nYou really didn't talk to anyone?\nO'Conner:\nWell, I did exchange a few greetings. But what does that matter?\nAthena:\n(So, he didn't have any conversations? The entire day? Me thinks that claim needs a little more scrutiny. But what should I do? Is there anything I should ask about in more detail?)\n\n\n\nDid you go to the art room?\n\n\n\n\n\n\n\nAthena:\nDid you stop by the art room, or as it's now known, the scene of the crime?\nO'Conner:\nNo, I didn't.\nAthena:\nCan you prove it?\nO'Conner:\nAs much as I'd like to say I could, I can't. But let me ask you, can YOU prove that I did?\nAthena:\nAs much as I'd like to say I could, I can't. But I will ask how often do you visit there?\nO'Conner:\nHardly ever. There's no reason for me to be there, anyway.\nAthena:\nThere's no reason for you to be there?\nO'Conner:\nIs there an echo in here? If something's bothering you, I'll just add it to my testimony.\nAthena:\nHow considerate. Thank you for noticing. Let's add your statement to your testimony.\nChanges statement from \"I didn't talk to anyone until the final bell. I'd been meditating alone at the archery range.\" to \"Oh, let me add I never went to the art room. There was no reason for me to be there.\"\n\n\n\n\nWhy did you stay past the last bell?\n\n\n\n\n\n\n\nAthena:\nWhy would an honor student like you ignore the last bell?\nO'Conner:\nI wouldn't say I ignored it. I was simply running a little late.\nAthena:\nDo you remember exactly how late?\nO'Conner:\nHeh. You're a stickler for details, lady. But if I had to say, it was maybe about ten, fifteen minutes. If you think that's important, I'll add it to my testimony.\nAthena:\nI was hoping you'd say that.\nChanges statement from \"I didn't talk to anyone until the final bell. I'd been meditating alone at the archery range.\" to \"The final bell had rung ten, fifteen minutes earlier. No biggie.\"\n\n\n\n\nNo further questions\n\n\n\n\n\n\n\nAthena:\nActually, never mind. I've got all the info I need.\nO'Conner:\nHeh. My, don't we seem confident.\nLeads back to cross-examinationPresent Courte's Planner\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"So, you didn't talk to anybody on October 23rd? Are you sure about that?\"O'Conner:\nThat's it. Anything else you'd like to ask?Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nAll right, I'll take you up on your kind offer!\nO'Conner:\nI expected as much. So, go ahead, ask away.\nAthena:\nUmm, Mr. O'Conner, I want to ask you...\n\n\n\nDid you go to the art room?\n\n\n\n\n\n\n\nAthena:\nDid you stop by the art room, or as it's now known, the scene of the crime?\nO'Conner:\nNo, I didn't.\nAthena:\nCan you prove it?\nO'Conner:\nAs much as I'd like to say I could, I can't. But let me ask you, can YOU prove that I did?\nAthena:\nAs much as I'd like to say I could, I can't. But I will ask how often do you visit there?\nO'Conner:\nHardly ever. There's no reason for me to be there, anyway.\nAthena:\nThere's no reason for you to be there?\nO'Conner:\nIs there an echo in here? If something's bothering you, I'll just add it to my testimony.\nAthena:\nHow considerate. Thank you for noticing. Let's add your statement to your testimony.\nAdds statement \"Oh, let me add I never went to the art room. There was no reason for me to be there.\" if not already added, or changes statement from \"The final bell had rung ten, fifteen minutes earlier. No biggie.\" or \"I didn't talk to anyone until the final bell. I'd been meditating alone at the archery range.\" to \"Oh, let me add I never went to the art room. There was no reason for me to be there.\"\n\n\n\n\nWhy did you stay past the last bell?\n\n\n\n\n\n\n\nAthena:\nWhy would an honor student like you ignore the last bell?\nO'Conner:\nI wouldn't say I ignored it. I was simply running a little late.\nAthena:\nDo you remember exactly how late?\nO'Conner:\nHeh. You're a stickler for details, lady. But if I had to say, it was maybe about ten, fifteen minutes. If you think that's important, I'll add it to my testimony.\nAthena:\nI was hoping you'd say that.\nAdds statement \"The final bell had rung ten, fifteen minutes earlier. No biggie.\" if not already added, or changes statement from \"Oh, let me add I never went to the art room. There was no reason for me to be there.\" or \"I didn't talk to anyone until the final bell. I'd been meditating alone at the archery range.\" to \"The final bell had rung ten, fifteen minutes earlier. No biggie.\"\n\n\n\n\nHow did you prep for the mock trial?\n\n\n\n\n\n\n\nAthena:\nPlease tell the court what you were dong on October 23rd, the day before the mock trial.\nO'Conner:\nHeh. That's an easy one -- nothing in particular.\nAthena:\nNothing at all? You didn't help with the preparations?\nO'Conner:\nHeh. You don't get it, do you? I was merely playing the role assigned to me. I left the preparations and the like to others. My job was to be mentally prepared.\nAthena:\n(Junie put her heart and soul into getting things ready, while he just sat on his behind?)\nO'Conner:\nJust to reiterate, I spent most of the 23rd meditating at the archery range. I didn't talk to anyone until the school closed at 7:00 PM. I suppose a few Archery Club members did come and go while I was there.\nAthena:\nBut you didn't talk to anyone? Not a single soul?\nO'Conner:\nThat's right. I didn't say a word to anyone till the final bell at 7:00 PM.\nAthena:\nI see... This is crucial information. Please add it to your testimony.\nO'Conner:\nI don't know if you're bluffing, but if you are, you have a pretty good poker face.\nAdds statement \"I didn't talk to anyone until the final bell. I'd been meditating alone at the archery range.\" if not already added, or changes statement from \"Oh, let me add I never went to the art room. There was no reason for me to be there.\" or \"The final bell had rung ten, fifteen minutes earlier. No biggie.\" to \"I didn't talk to anyone until the final bell. I'd been meditating alone at the archery range.\"Athena:\nWow, is that the confidence and composure that comes from being a genius?Apollo:\nAthena, it doesn't matter who's on the stand. Our job is still the same.Athena:\n(Sure, but if Junie was really still at school after 6:00 PM... Ugh. I didn't spot any inconsistencies in Hugh's testimony, either. What am I supposed to do now?)"
    }
  ]
}