{
  "previousContext": "",
  "characters": [
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Athena Cykes",
      "age": "• Age: 18",
      "description1": "The latest lawyer to join our agency. She lived in Europe for a time, where she studied psychology."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Phoenix Wright",
      "age": "• Age: 34",
      "description1": "The head of our office. He was retired once, but made his return to the legal world a few months ago."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Apollo Justice",
      "age": "• Age: 23",
      "description1": "The lawyer at my agency who was attacked during the court bombing trial. He's currently recovering at the hospital.",
      "description2": "Currently working on his own. He says he wants to bring his friend's killer to justice, but I wonder if that's all."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Trucy Wright",
      "age": "• Age: 16",
      "description1": "An aspiring magician who Mr. Wright adopted when duty called."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Clay Terran",
      "age": "• Age: 23",
      "description1": "The victim in this case. He was a HAT-2 crew member and a close friend of mine."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Juniper Woods",
      "age": "• Age: 18",
      "description1": "Athena's childhood friend. Talented singer and Student Council President, she is studying to be a judge."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Solomon Starbuck",
      "age": "• Age: 33",
      "description1": "The defendant in this case. He was a HAT-2 crew member and a mentor to the victim."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Simon Blackquill",
      "age": "• Age: 28",
      "description1": "A prosecutor and prison inmate. He can manipulate witnesses through the power of suggestion.",
      "description2": "Convicted of the murder at the Space Center seven years ago. He's chasing a phantom he saw back then."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Bobby Fulbright",
      "age": "• Age: 33",
      "description1": "The detective assigned to this case. He led the evacuation effort at the Space Center after the bombing incident."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Candice Arme",
      "age": "• Age: 27",
      "description1": "A detective who specialized in bomb cases. Was on detail at the Space Center. One of the first to find the body."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Yuri Cosmos",
      "age": "• Age: 62",
      "description1": "The director of the Space Center and one of the first people to discover the body. He seems exceedingly full of himself."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Ponco",
      "age": "• Age: ?",
      "description1": "A guide robot at the Space Center. She can provide information on the Center and show people around."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Aura Blackquill",
      "age": "• Age: 37",
      "description1": "A researcher who's developing robots at the Space Center. She is Prosecutor Blackquill's older sister."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Clonco",
      "age": "• Age: ?",
      "description1": "One of the robots developed by Aura, who refers to him as \"Hunk of Junk\"."
    }
  ],
  "evidences": [
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Attorney's Badge",
      "description1": "My cherished attorney's badge. Just putting it on makes me feel... ready.* (when playing as Apollo Justice)",
      "description2": "It's my all-important badge. Proof of my profession.* (when playing as Phoenix Wright)"
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Terran's Autopsy Report",
      "description1": "Cause of death: Stabbing. The victim was discovered in the third-floor boarding lounge in the main building."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Space Center Diagram",
      "description1": "A cross-section view of the main building of the Space Center and Launch Pad 1. The two sections are connected by a passage between the mid level of Launch Pad 1 and the 3rd-floor lounge of the main building. Launch Pad 1 consists of three levels: upper, mid, and lower. There are two ways to descend from the upper to the mid level—via an elevator or a ladder. The main building has a total of six floors."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Utility Knife",
      "description1": "The victim's blood was found on its blade, but no fingerprints could be lifted.",
      "description2": "It has the victim's blood on it. From a set of utility tools used by Space Center techs."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Bombing Report",
      "description1": "The explosions sparked a fire on the second floor of the main building and the middle level of the launch pad near the elevator."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Evacuation Report",
      "description1": "The bombs went off despite tight security. Police officers and riot police who had been standing by gave the evacuation instructions."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Launch Pad 1 Door Lock",
      "description1": "A biometric door lock operated by fingerprint recognition. Only the defendant, the victim, and the Space Center director had access.",
      "description2": "Starbuck's prints were found on this door lock. Also see photo taken after the incident. (2 pages.)"
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Security Camera Video",
      "description1": "Video showing the defendant and victim's escape from the corridor to the boarding lounge.",
      "description2": "Video showing the defendant and victim's escape from the corridor. The video ends immediately after this scene."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Oxygen Tank Data",
      "description1": "The victim's tank was ruptured, with 0% left. The defendant's had 80%. Remaining oxygen is displayed on left shoulder.",
      "description2": "The victim's oxygen tank was struck by a bullet."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Space Center Pamphlet",
      "description1": "A pamphlet for visitors to the Space Center. It includes a diagram of the boarding lounge.",
      "description2": "It includes a diagram of the boarding lounge and a cross-section view of the Space Center. (3 pages.)"
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Bullet Hole",
      "description1": "A single bullet hole was found in the boarding lounge. The bullet itself is missing.",
      "description2": "The only bullet hole found in the boarding lounge. It was made by a bullet fired from a .38-caliber gun."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Control Room Door Lock",
      "description1": "The door lock to the east. It can only be operated by the director. Backup power lets it function even when the power goes out."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Bullet",
      "description1": "Discovered in a gutter that runs along the south wall of the boarding lounge. It was fired from a .10 caliber handgun."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "\"Hope\" Capsule",
      "description1": "Found in the victim's possession. It recently returned from a seven-year mission and contains asteroid samples."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Aura's Statement",
      "description1": "The perp held a lighter with an Earth emblem on it in their left hand, and a knife in their right."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Bullet from Arme's Gun",
      "description1": "The bullet found near the victim's oxygen tank. It was fired from a .38 caliber handgun."
    },
    {
      "currentChapter": "The Cosmic Turnabout",
      "name": "Lighter",
      "description1": "The lighter found on the floor of the Space Museum. The true culprit's fingerprints are on it in the victim's blood.",
      "description2": "Evidence found by Detective Fulbright. It has Athena's prints on it in the victim's blood."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "Just before the rocket was set to launch, two bombs went off. BOOM! BOOM!",
          "person": "Fulbright",
          "present": []
        },
        {
          "testimony": "One on the second floor of the Space Center's main building and one in Launch Pad 1.",
          "person": "Fulbright",
          "present": []
        },
        {
          "testimony": "Thankfully, only the two astronauts were in Launch Pad 1 at the time.",
          "person": "Fulbright",
          "present": []
        },
        {
          "testimony": "The two of them managed to make it back as far as the boarding lounge...",
          "person": "Fulbright",
          "present": []
        },
        {
          "testimony": "...but after the escape, one of the two was found stabbed to death!",
          "person": "Fulbright",
          "present": []
        }
      ],
      "noPresent": true,
      "newContext": "The Cosmic TurnaboutImage GalleryTranscriptPart 1Part 2Part 3Apollo:The courtroom bombing incident -- a terrible attack launched by the will of a madman. That incident perfectly symbolized the state of the legal world in this dark age of the law. Mr. Wright brought it to a resolution... of sorts. Ted Tonate was discovered to be the one responsible for the bombing. ............If only it were that simple. Somehow, I can't help but think... ...that there's a darker influence at work -- one that's lurking in the shadows, waiting... That's why I want to review the trial that was taking place when the bombing occurred. After all, I've got more than a few personal stakes in it...Episode 4The Cosmic TurnaboutAnime cutsceneOperator:One hour remaining until launch. Please begin your final equipment check.Astronaut:Check complete! Everything's A-OK. We're ready here whenever you are!Operator:Come in HAT-2! Come in! Do you copy?!December 16, 9:12 AMDistrict Court - Defendant Lobby No. 5Apollo:(Time for another trial to begin... But this one is different.) ............???:Umm.. Sorry to bother you, but...Woods:Are you all right, Apollo?Apollo:(Ack! Was I making a scary face just now?!) Oh, hi, Juniper! Yes, I'm fine! I was just doing my Chords of Steel exercises. Now I'm all ready to go!Woods:Yes, knowing you, I'm sure you will be just fine! Oh! I brought you a present from my garden.Apollo:Is this... a lotus root?Woods:That's right. My grandma says lotus root is good for your eyes. She says that if you look through the holes, it can help you see into the future! It's for good luck! Maybe later, you can cook it and--Apollo:Thanks for this! I'm gonna have some right now!Woods:Oh, my!Apollo:............Mmm. *crunch* Kinda tough, though...Woods:Hee hee! You can't eat it raw! But... thank you for the enthusiastic try.Apollo:(Oops! If she didn't think me weird before, she will now! I've gotta calm down!)Athena:Apollo! I'm sorry I'm late!Woods:Hi, Thena!Athena:Junie! I didn't know you were coming today. Did you come to cheer Apollo on? Oh, I get it. You sly little thing, you! Ha ha ha!Woods:Th-Thena, stop!Apollo:Quit kidding around, Athena. The trial's about to start any second. Is everything all set?Athena:Oh, Apollo, Apollo... When will you ever figure it out?Apollo:Figure out what????:............Haaaaaaaaaaaaaaaaaaaaaaaaangh...Apollo:(Wow. That was the longest sigh I've ever heard.)???:Haaaaangh... This is it. It's all over for me... They're gonna find me guilty.Apollo:(This is our client, one Mr. Solomon \"Sol\" Starbuck. He's a very famous astronaut, who happens to be an acquaintance of mine. You wouldn't know it right now, but he's usually a very upbeat and driven person. The scene of the crime this time happened to be the Cosmos Space Center. Back in high school, my best friend and I went there almost a little too much... ...but that's where we met Mr. Starbuck. We'd ask about space travel and he'd launch into story after story with so much passion... Back in those days, the man was one hundred percent my hero.)Starbuck:Are... you sure you're okay with being my lawyer, Apollo...?Apollo:Of course I'm sure. I know you, Mr. Starbuck. I know you're not the type to commit murder.Starbuck:Thanks, but......... Haaaaaaaaaaaaaaaangh... I was supposed to be in space right about now... Haaaaaaaaaaaaaaaangh... Haaaaaaaaaaaaaaaangh...Apollo:(He's so depressed, it almost seems like an act. The launch getting called off must've been a huge shock.)Starbuck:I'll probably never get the chance to go into space again.Apollo:Don't say that! Don't stop believing! Besides, you just have to go into space again!Starbuck:Yeah... I don't think I could face Clay in the afterlife if I just rotted away in a cell.Athena:Clay Terran... I can't believe he was murdered. I mean, he was such a promising astronaut under your command...Starbuck:Yeah... He was a good guy -- always there to pick me up when I was down. No one loved life as much as him, that's for sure. He was always so full of energy, telling me, \"You're fine, Mr. Starbuck!\"... ...Haaaaaaaaaaaaaaaaaaaaaaaaangh... How could something like this happen to a guy like him, huh?Apollo:(I've never seen Mr. Starbuck so down...)Starbuck:...Haaaaaaaaaaaaaaaaaaaaaaaaangh... Clay's gone, and I'm going to prison... I wish I could burn up like a shooting star right now.Apollo:...Mr. Starbuck! You'll be fine!Starbuck:Ah! Wh-What is it?! What's with the yelling?!Apollo:I'll get to the bottom of this today! You'll see! And in exchange, I want you to go back into space for you and Clay! Promise?!Starbuck:...Does that mean you have lots of evidence to prove my innocence?Apollo:Oh! Umm... Well... About that... We... didn't get to investigate the area as much as I'd have liked, thanks to the police.Starbuck:............I'm done for. I'm a goner. Everybody thinks I did it. Thought I was gonna soar like a comet, but I'm just gonna crash like a meteorite.Apollo:No, don't say that, Mr. Starbuck!Athena:Don't count yourself out yet!Apollo:I know it's hard to lose a teammate, but you've got to keep going.Athena:............And what about you, Apollo?Apollo:What about me?Athena:I was just thinking, wasn't Clay your best friend?Apollo:.........We need to focus on the trial right now. Are you all ready to go?Athena:Apollo...Bailiff:The trial is about to begin. If the defense would please proceed into the courtroom!Athena:O-Okay! Here we go!Apollo:(This is it. This is one trial I can't afford to lose! For Clay's sake and our client's, I WILL find Clay's killer!)December 16, 9:55 AMDistrict Court - Courtroom No. 4Day 1Court Is Now In SessionAll RiseJudge:Court is now in session for the trial of Solomon Starbuck.Apollo:The defense is ready, Your Honor.Judge:............Excuse me, Mr. Justice?Apollo:Yes, Your Honor?Judge:What happened to your eye?Apollo:...I'm fine! The defense is ready, Your Honor!Judge:............Are you sure? I don't--Apollo:I'm fine, Your Honor! The defense is ready!Athena:I'm sorry, Your Honor. He's been like this since yesterday. He keeps insisting it's just a sty.Judge:Hmm... I suppose it's something he doesn't want to discuss. Maybe he's entering a touchy age...Apollo:............Judge:Very well. And the prosecution...?Blackquill:............Judge:The prosecution appears to be ready as well.Blackquill:Blackquill:............ ............... ...Not yet. I'm... not quite ready yet.Judge:Hmm?Blackquill:Ngh... Graaaaaaagh!Judge:Aaaaaaaaaaaaaaaaaaaaaaaagh!Blackquill:The prosecution... is now ready.Athena:Well, it didn't take him long this time.Apollo:............ (What's up with Blackquill?)Judge:N-N-Now, then. I-I-I shall give the opening statement...Blackquill:Judge:............Blackquill:I'll do it.Judge:You will? Wh-What an unexpected surprise!Blackquill:This time, I can't leave it to anyone else.Judge:I-I see... Hmm... Something is off with the two of you today. You both seem different somehow.Athena:............Judge:Very well, Prosecutor Blackquill. Your opening statement, if you would.Blackquill:It was just yesterday. The crimes in question occurred at the Cosmos Space Center.Judge:Ah, that famous federal research facility of all things related to astrology, right?Blackquill:Astronomy. It's astronomy. Anyway, a rocket was set to launch from there... ...but at 9:28 AM, before they could even move the rocket to the launch site... ...two explosive devices were detonated, and the launch was canceled.Judge:My word! Two bombs? How dreadful...Blackquill:The defendant in today's trial is charged with both the bombing and with murder... One Mr. Solomon Starbuck. For whatever inane reason, he detonated a bomb on the rocket he himself would be in.Judge:Solomon Starbuck? I recognize that name. Isn't he that famous astronaut?!Blackquill:Correct, Your Baldness. Mr. Starbuck was the pilot of the HAT-1 rocket seven years ago. As you may recall, despite some interstellar trouble, his mission was a success. Some say it was a miracle he returned alive. I suppose you could say he's a living legend.Judge:Oh, I remember now. He's become something of an international celebrity, right? They even turned that incident into a movie and everything! We've got a real space pioneer in court today!Blackquill:Hmph. But even heroes tumble from their lofty heights. Returning to the subject at hand...Judge:Ah, yes. The victim was one Mr. Clay Terran, a subordinate of the defendant.Blackquill:Indeed. A loyal disciple brutally stabbed to death by his mentor.Judge:Stabbed to death, you say? You mean his death wasn't a result of the bombing?Blackquill:Correct. Despite his lofty dreams, the victim was seen as an interloper by the defendant. And so, he was sent not into space, but to the universe which we mortals can not see.Apollo:(Clay...)Judge:I think I've heard enough. The case seems pretty clear-cut at this point. However, there is one thing I'm curious about. That metal box next to the witness stand... What purpose does it serve, exactly?Blackquill:Since you asked so nicely... It's your coffin.Judge:Aaaaaaaaaaaaaaaaaaaaaaaagh! Have mercy on meeeeeeeeeeee!Blackquill:............I jest. It's evidence. Due to its immense size, we've little choice but to lay it where it rests now. We shall get to the contents of the box in due time.Judge:Phew... I feel like I just lost fifty years off of my life.Athena:...Does he even HAVE fifty years left?Apollo:Inner monologue, Athena! Inner monologue!Blackquill:Enough jabbering.Fulbright:Bobby Fulbright's the name! In justice we trust!Judge:Ah, Detective Fulbright! Very well, them. Please explain the details of this incident to the court, if you would.Fulbright:On it! First, take a look at this pamphlet from the Cosmos Space Center! In it, you'll find a diagram outlining the overall layout of the Space Center. Ah, here we are. For a more detailed look at what's on the left side of this building... ...take a look at this cross-section that we the police have created. See the launch pad and the main building?Judge:The launch pad is the square building, and the rounded structure is the main building, right?Fulbright:You got it. The incidents took place in Launch Pad 1 and in the main building's Lounge. I'll be using this diagram during my testimony -- it'll make it easier to understand!Space Center Diagram added to the Court Record.Witness Testimony-- Details of the Case --Fulbright:Just before the rocket was set to launch, two bombs went off. BOOM! BOOM!One on the second floor of the Space Center's main building and one in Launch Pad 1.Thankfully, only the two astronauts were in Launch Pad 1 at the time.The two of them managed to make it back as far as the boarding lounge......but after the escape, one of the two was found stabbed to death!Judge:Hmm... A murder on top of a bombing...? Detective, the victim was already dead by the time you arrived at the lounge, correct?Fulbright:Yup. Thinking he'd sabotage the bombing, the defendant killed him right there in the rocket. (Changed from [Yup. Thinking he'd sabotage the bombing, the defendant attacked and killed the victim.] in the original release) Just look at this tragic photo!Judge:Oh, my! I-Is that a knife in the victim's chest?!Fulbright:Yes, Your Honor, it's the knife that cruelly ended this young man's dreams! We couldn't get any prints off of it, though, because the defendant was in his space suit.Utility Knife added to the Court Record.Judge:By the way, Detective Fulbright... Why are the victim's helmet and right glove absent in this photograph?Fulbright:We had to remove them to identify him, Your Honor. I personally removed his glove during the investigation. We had to get his fingerprints to confirm his identity, after all.Judge:Hmm... Yes, it would be very difficult to identify him without a face or fingerprints. Now, there's just one more thing I'd like to inquire about... What is this round thing next to the victim in this photo?Blackquill:Something so important to the victim he took it with him as he escaped the launch pad. A capsule that apparently contains asteroid samples. While obviously valuable for research purposes, it has no relation to this case.Judge:Hmm... I see.Apollo:So... we know that the bomb in the main building was on the second floor... ...but where was the bomb that was in Launch Pad 1 located?Fulbright:Heh. That one was on the rocket itself. It was situated around the central part of the rocket. Apparently, the area around the launch pad's elevator was a sea of flames. I would like to submit this diagram and report into the record!Bombing Report added to the Court Record.Athena:The trial's just started and we're already in a bind.Apollo:You get used to it. Besides, that's what cross-examination is for, right? (What the two astronauts were doing during the bombing... That'll be the key!)Cross ExaminationCross Examination-- Details of the Case --Fulbright:Just before the rocket was set to launch, two bombs went off. BOOM! BOOM!PressApollo:Apollo:How powerful were the explosions?Fulbright:Well, the one in the main building wasn't strong enough to bring the place down... ...but the room it went off in was burned black! Thankfully, nobody was hurt. Due in large part, of course, to me stepping up to lead the evacuation!Apollo:Wait. What were you doing there in the first place, Detective Fulbright?Fulbright:Ha ha ha! I'm Bobby Fulbright, hero of justice! I'll be there, wherever and whenever people need my help! I'd go to the other side of the world, or even the edge of the universe!Apollo:(I'm not sure he knows how far that actually is... But I guess I'll leave that one alone.)Blackquill:Admirable decision, Justice-dono.Fulbright:Huh? What'd he decide...?Apollo:Anyway, could you describe what it was like at the Space Center at that time?Fulbright:The bomb cut the power to the central bank of elevators and the third floor lounge. It was pitch black in there, I tell you. However, the security cameras and whatnot were running on emergency backup.Apollo:And how did the evacuation go?Fulbright:I immediately and heroically whisked people down to the Space Center's basement shelter!Judge:The basement shelter?Fulbright:Yes, there's an emergency shelter beneath the Space Center!Athena:An emergency shelter, huh? Oh, here it is! It's at the bottom of the diagram. The Space Center's pretty impressive to have its own shelter!Evacuation Report added to the Court Record.Apollo:(Hmm... The power outage and evacuation seem unrelated to the murder at this point. I guess I'll leave that aside for now.) So there were two explosions in total, correct?Fulbright:Yup. That's right!Press (subsequent times)Apollo:Apollo:How powerful were the explosions?Fulbright:Well, the one in the main building wasn't strong enough to bring the place down... ...but the room it went off in was burned black! Thankfully, nobody was hurt. Due in large part, of course, to me stepping up to lead the evacuation!Apollo:Wait. What were you doing there in the first place, Detective Fulbright?Fulbright:Ha ha ha! I'm Bobby Fulbright, hero of justice! I'll be there, wherever and whenever people need my help! I'd go to the other side of the world, or even the edge of the universe!Apollo:(I'm not sure he knows how far that actually is... But I guess I'll leave that one alone.)Blackquill:Admirable decision, Justice-dono.Fulbright:Huh? What'd he decide...?Apollo:Anyway, could you describe what it was like at the Space Center at that time?Fulbright:The bomb cut the power to the central bank of elevators and the third floor lounge. It was pitch black in there, I tell you. However, the security cameras and whatnot were running on emergency backup.Apollo:And how did the evacuation go?Fulbright:I immediately and heroically whisked people down to the Space Center's basement shelter!Judge:The basement shelter?Fulbright:Yes, there's an emergency shelter beneath the Space Center!Athena:An emergency shelter, huh? Oh, here it is! It's at the bottom of the diagram. The Space Center's pretty impressive to have its own shelter!Apollo:(Hmm... The power outage and evacuation seem unrelated to the murder at this point. I guess I'll leave that aside for now.) So there were two explosions in total, correct?Fulbright:Yup. That's right!Fulbright:One on the second floor of the Space Center's main building and one in Launch Pad 1.PressApollo:Apollo:Let me get this straight... Mr. Starbuck rigged a rocket he was going to board with explosives?Fulbright:Huh? What are you talking about?Apollo:If the defendant really did plant the bomb on his own rocket... ...he'd get caught in the explosion as well!Judge:Oh! I hadn't thought of that!Blackquill:...Hmph. Fine. A simpleton for a simpleton. Fool Bright. The motive.Fulbright:Understood! The defendant actually had astrophobia.Apollo:A... Astrophobia? What's that?Fulbright:A fear of space, naturally. Just the thought of space can cause the afflicted to freeze up. And so, in his terror, the defendant found a way to stop the launch at the last minute!Apollo:Th-That's absurd!Fulbright:Unfortunately for you, we have evidence! Take a look at these!Apollo:...What are they?Fulbright:These anti-anxiety tablets were found among the defendant's possessions! Apparently, he was taking them in secret to quell his fears.Blackquill:There were a multitude of problems with the rocket Mr. Starbuck rode seven years ago. Rumor has it, it threatened to crash a number of times as well. That was, of course, very traumatic for Mr. Starbuck.Apollo:Apollo:But that doesn't mean he'd go so far as to blow up his own ship!Blackquill:Blackquill:The defendant couldn't bear to mar his good name, now could he? No, not after the media had branded him \"Sol Starbuck: space pioneer extraordinaire.\" Given these conditions, the defendant could hardly run away like some base mutt.Apollo:What, so THAT'S why you think he resorted to the bombing?Blackquill:Naturally. He constructed this act of sabotage in an attempt to blow up the Space Center... ...which would effectively abort the launch, but spare his reputation.Apollo:............Urgh!Fulbright:Now I'm sure you understand why we have to bring justice down on this atrocious criminal!Fulbright:Thankfully, only the two astronauts were in Launch Pad 1 at the time.PressApollo:Apollo:Are you sure it was only the two of them?!Fulbright:It was before the spaceship was set to launch, so of course it was only those two!Apollo:Ungh... Well, there could've been somebody else inside that rocket!Blackquill:Blackquill:The notion of a third party in Launch Pad 1 is utterly absurd. Just to enter the area from the lounge... ...one must pass through a door guarded by a fingerprint recognition device. And allow me to state up front that there are precious few with the clearance to do so.Judge:A fingerprint recognition device? It sounds as futuristic and complex as a space center!Fulbright:Actually, it's not as amazing as you think, Your Honor. Take a look at this photo! This is the door in the lounge with the fingerprint lock. Only personnel whose fingerprints are registered can pass through.Judge:Hmm, I see... That is very different from what I had in mind. And is there a record of the number of people that passed through that door yesterday?Fulbright:Yes, there were only three: the defendant, the victim, and... ...the director of the Space Center, Yuri Cosmos.Apollo:Then doesn't that mean it's possible that the director is the one who did it?Blackquill:Not a chance. He was in the main building when the bombs exploded at 9:28... ...doing his job directing the launch. Besides having an alibi, he has no motive for committing these senseless acts.Apollo:(He has a point... I guess the director can't be considered a suspect then.)Launch Pad 1 Door Lock added to the Court Record.Press (subsequent times)Apollo:Apollo:Are you sure it was only the two of them?!Fulbright:It was before the spaceship was set to launch, so of course it was only those two!Apollo:Ungh... Well, there could've been somebody else inside that rocket!Blackquill:Blackquill:The notion of a third party in Launch Pad 1 is utterly absurd. Just to enter the area from the lounge... ...one must pass through a door guarded by a fingerprint recognition device. And allow me to state up front that there are precious few with the clearance to do so.Judge:A fingerprint recognition device? It sounds as futuristic and complex as a space center!Fulbright:Actually, it's not as amazing as you think, Your Honor. Take a look at this photo! This is the door in the lounge with the fingerprint lock. Only personnel whose fingerprints are registered can pass through.Judge:Hmm, I see... That is very different from what I had in mind. And is there a record of the number of people that passed through that door yesterday?Fulbright:Yes, there were only three: the defendant, the victim, and... ...the director of the Space Center, Yuri Cosmos.Apollo:Then doesn't that mean it's possible that the director is the one who did it?Blackquill:Not a chance. He was in the main building when the bombs exploded at 9:28... ...doing his job directing the launch. Besides having an alibi, he has no motive for committing these senseless acts.Apollo:(He has a point... I guess the director can't be considered a suspect then.)Fulbright:The two of them managed to make it back as far as the boarding lounge...PressApollo:Apollo:So, while it would appear that the pair barely escaped with their lives, in actuality... ...one of them had already been murdered inside the rocket. That's the angle the prosecution wants to push, correct?Fulbright:You got it! In fact, that's what I've been trying to say this whole time! If the victim had been alive, he would've for sure tried to stop the bombing.Apollo:Is there any chance Mr. Terran could have been killed before he boarded the rocket?Fulbright:They were both alive and well at boarding time, and embarked under their own power! Their hearts full of hopes and dreams of space!Apollo:(And then both of their hopes and dreams were dashed...)Fulbright:If I may continue my explanation! After the evacuation order was given... ...the defendant made his escape, carrying the victim to make it look like a rescue.Fulbright:...but after the escape, one of the two was found stabbed to death!PressApollo:Apollo:And who was the first to find the victim?Fulbright:Actually, there were two of them!Blackquill:The Space Center director... ...Yuri Cosmos... ...and Detective Candice Arme.Judge:One of them was a detective?!Fulbright:Yup. Detective Arme specializes in bombings, you see. She and the director were ordering the evacuation following the explosions. They were also worried about the astronauts, so they hurried over to the boarding lounge. That's when they discovered the victim along with the defendant!Apollo:(Two witnesses, huh? And one of them is a detective! I doubt either one would have anything to say that would help me...)Athena:Hmm... It's like he's trying to give us as little information as possible.Apollo:Maybe Prosecutor Blackquill's got his tongue...Athena:Well, don't let that hold you back. Keep pressing until we get what we need!"
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "All I did was support Clay over my shoulder and get us out of the rocket!",
          "person": "Starbuck",
          "present": []
        },
        {
          "testimony": "Like always, I took the elevator down to the middle level and headed for the corridor.",
          "person": "Starbuck",
          "present": [
            "Bombing Report"
          ],
          "source": {
            "evidence_span": "The explosions sparked a fire on the second floor of the main building and the middle level of the launch pad near the elevator.",
            "testimony_span": "I took the elevator down to the middle level and headed for the corridor.",
            "explanation": "The fire near the elevator blocks access to the corridor.",
            "is_self_contained": "yes",
            "context_span": "",
            "isMultimodal": true
          }
        },
        {
          "testimony": "Clay had passed out by the time we got the order to evacuate.",
          "person": "Starbuck",
          "present": []
        },
        {
          "testimony": "I didn't kill Clay! I was trying to save him!",
          "person": "Starbuck",
          "present": []
        }
      ],
      "noPresent": false,
      "summarized_context": "",
      "labels": [
        "spatial",
        "behavior"
      ],
      "reasoning": [
        "Fact 1: Starbuck claims he took the elevator down to the middle level and headed for the corridor.",
        "Fact 2: The evidence shows the path to corridor from the elevator was blocked by fire.",
        "Prop 1: If a path is blocked by fire, then it is impossible to take that path."
      ],
      "newContext": "-- Details of the Case --Fulbright:Just before the rocket was set to launch, two bombs went off. BOOM! BOOM!PressApollo:Apollo:How powerful were the explosions?Fulbright:Well, the one in the main building wasn't strong enough to bring the place down... ...but the room it went off in was burned black! Thankfully, nobody was hurt. Due in large part, of course, to me stepping up to lead the evacuation!Apollo:Wait. What were you doing there in the first place, Detective Fulbright?Fulbright:Ha ha ha! I'm Bobby Fulbright, hero of justice! I'll be there, wherever and whenever people need my help! I'd go to the other side of the world, or even the edge of the universe!Apollo:(I'm not sure he knows how far that actually is... But I guess I'll leave that one alone.)Blackquill:Admirable decision, Justice-dono.Fulbright:Huh? What'd he decide...?Apollo:Anyway, could you describe what it was like at the Space Center at that time?Fulbright:The bomb cut the power to the central bank of elevators and the third floor lounge. It was pitch black in there, I tell you. However, the security cameras and whatnot were running on emergency backup.Apollo:And how did the evacuation go?Fulbright:I immediately and heroically whisked people down to the Space Center's basement shelter!Judge:The basement shelter?Fulbright:Yes, there's an emergency shelter beneath the Space Center!Athena:An emergency shelter, huh? Oh, here it is! It's at the bottom of the diagram. The Space Center's pretty impressive to have its own shelter!Evacuation Report added to the Court Record.Apollo:(Hmm... The power outage and evacuation seem unrelated to the murder at this point. I guess I'll leave that aside for now.) So there were two explosions in total, correct?Fulbright:Yup. That's right!Press (subsequent times)Apollo:Apollo:How powerful were the explosions?Fulbright:Well, the one in the main building wasn't strong enough to bring the place down... ...but the room it went off in was burned black! Thankfully, nobody was hurt. Due in large part, of course, to me stepping up to lead the evacuation!Apollo:Wait. What were you doing there in the first place, Detective Fulbright?Fulbright:Ha ha ha! I'm Bobby Fulbright, hero of justice! I'll be there, wherever and whenever people need my help! I'd go to the other side of the world, or even the edge of the universe!Apollo:(I'm not sure he knows how far that actually is... But I guess I'll leave that one alone.)Blackquill:Admirable decision, Justice-dono.Fulbright:Huh? What'd he decide...?Apollo:Anyway, could you describe what it was like at the Space Center at that time?Fulbright:The bomb cut the power to the central bank of elevators and the third floor lounge. It was pitch black in there, I tell you. However, the security cameras and whatnot were running on emergency backup.Apollo:And how did the evacuation go?Fulbright:I immediately and heroically whisked people down to the Space Center's basement shelter!Judge:The basement shelter?Fulbright:Yes, there's an emergency shelter beneath the Space Center!Athena:An emergency shelter, huh? Oh, here it is! It's at the bottom of the diagram. The Space Center's pretty impressive to have its own shelter!Apollo:(Hmm... The power outage and evacuation seem unrelated to the murder at this point. I guess I'll leave that aside for now.) So there were two explosions in total, correct?Fulbright:Yup. That's right!Fulbright:One on the second floor of the Space Center's main building and one in Launch Pad 1.PressApollo:Apollo:Let me get this straight... Mr. Starbuck rigged a rocket he was going to board with explosives?Fulbright:Huh? What are you talking about?Apollo:If the defendant really did plant the bomb on his own rocket... ...he'd get caught in the explosion as well!Judge:Oh! I hadn't thought of that!Blackquill:...Hmph. Fine. A simpleton for a simpleton. Fool Bright. The motive.Fulbright:Understood! The defendant actually had astrophobia.Apollo:A... Astrophobia? What's that?Fulbright:A fear of space, naturally. Just the thought of space can cause the afflicted to freeze up. And so, in his terror, the defendant found a way to stop the launch at the last minute!Apollo:Th-That's absurd!Fulbright:Unfortunately for you, we have evidence! Take a look at these!Apollo:...What are they?Fulbright:These anti-anxiety tablets were found among the defendant's possessions! Apparently, he was taking them in secret to quell his fears.Blackquill:There were a multitude of problems with the rocket Mr. Starbuck rode seven years ago. Rumor has it, it threatened to crash a number of times as well. That was, of course, very traumatic for Mr. Starbuck.Apollo:Apollo:But that doesn't mean he'd go so far as to blow up his own ship!Blackquill:Blackquill:The defendant couldn't bear to mar his good name, now could he? No, not after the media had branded him \"Sol Starbuck: space pioneer extraordinaire.\" Given these conditions, the defendant could hardly run away like some base mutt.Apollo:What, so THAT'S why you think he resorted to the bombing?Blackquill:Naturally. He constructed this act of sabotage in an attempt to blow up the Space Center... ...which would effectively abort the launch, but spare his reputation.Apollo:............Urgh!Fulbright:Now I'm sure you understand why we have to bring justice down on this atrocious criminal!Fulbright:Thankfully, only the two astronauts were in Launch Pad 1 at the time.PressApollo:Apollo:Are you sure it was only the two of them?!Fulbright:It was before the spaceship was set to launch, so of course it was only those two!Apollo:Ungh... Well, there could've been somebody else inside that rocket!Blackquill:Blackquill:The notion of a third party in Launch Pad 1 is utterly absurd. Just to enter the area from the lounge... ...one must pass through a door guarded by a fingerprint recognition device. And allow me to state up front that there are precious few with the clearance to do so.Judge:A fingerprint recognition device? It sounds as futuristic and complex as a space center!Fulbright:Actually, it's not as amazing as you think, Your Honor. Take a look at this photo! This is the door in the lounge with the fingerprint lock. Only personnel whose fingerprints are registered can pass through.Judge:Hmm, I see... That is very different from what I had in mind. And is there a record of the number of people that passed through that door yesterday?Fulbright:Yes, there were only three: the defendant, the victim, and... ...the director of the Space Center, Yuri Cosmos.Apollo:Then doesn't that mean it's possible that the director is the one who did it?Blackquill:Not a chance. He was in the main building when the bombs exploded at 9:28... ...doing his job directing the launch. Besides having an alibi, he has no motive for committing these senseless acts.Apollo:(He has a point... I guess the director can't be considered a suspect then.)Launch Pad 1 Door Lock added to the Court Record.Press (subsequent times)Apollo:Apollo:Are you sure it was only the two of them?!Fulbright:It was before the spaceship was set to launch, so of course it was only those two!Apollo:Ungh... Well, there could've been somebody else inside that rocket!Blackquill:Blackquill:The notion of a third party in Launch Pad 1 is utterly absurd. Just to enter the area from the lounge... ...one must pass through a door guarded by a fingerprint recognition device. And allow me to state up front that there are precious few with the clearance to do so.Judge:A fingerprint recognition device? It sounds as futuristic and complex as a space center!Fulbright:Actually, it's not as amazing as you think, Your Honor. Take a look at this photo! This is the door in the lounge with the fingerprint lock. Only personnel whose fingerprints are registered can pass through.Judge:Hmm, I see... That is very different from what I had in mind. And is there a record of the number of people that passed through that door yesterday?Fulbright:Yes, there were only three: the defendant, the victim, and... ...the director of the Space Center, Yuri Cosmos.Apollo:Then doesn't that mean it's possible that the director is the one who did it?Blackquill:Not a chance. He was in the main building when the bombs exploded at 9:28... ...doing his job directing the launch. Besides having an alibi, he has no motive for committing these senseless acts.Apollo:(He has a point... I guess the director can't be considered a suspect then.)Fulbright:The two of them managed to make it back as far as the boarding lounge...PressApollo:Apollo:So, while it would appear that the pair barely escaped with their lives, in actuality... ...one of them had already been murdered inside the rocket. That's the angle the prosecution wants to push, correct?Fulbright:You got it! In fact, that's what I've been trying to say this whole time! If the victim had been alive, he would've for sure tried to stop the bombing.Apollo:Is there any chance Mr. Terran could have been killed before he boarded the rocket?Fulbright:They were both alive and well at boarding time, and embarked under their own power! Their hearts full of hopes and dreams of space!Apollo:(And then both of their hopes and dreams were dashed...)Fulbright:If I may continue my explanation! After the evacuation order was given... ...the defendant made his escape, carrying the victim to make it look like a rescue.Fulbright:...but after the escape, one of the two was found stabbed to death!PressApollo:Apollo:And who was the first to find the victim?Fulbright:Actually, there were two of them!Blackquill:The Space Center director... ...Yuri Cosmos... ...and Detective Candice Arme.Judge:One of them was a detective?!Fulbright:Yup. Detective Arme specializes in bombings, you see. She and the director were ordering the evacuation following the explosions. They were also worried about the astronauts, so they hurried over to the boarding lounge. That's when they discovered the victim along with the defendant!Apollo:(Two witnesses, huh? And one of them is a detective! I doubt either one would have anything to say that would help me...)Athena:Hmm... It's like he's trying to give us as little information as possible.Apollo:Maybe Prosecutor Blackquill's got his tongue...Athena:Well, don't let that hold you back. Keep pressing until we get what we need!After pressing first, second, third, and fifth statements:Judge:I think that pretty much covers the details of the case. Only the victim and the defendant were on the launch pad when the former was killed. If this is the truth, then only Mr. Starbuck could have carried out this crime.Apollo:(What little I could get out of him only hurt my case.)Blackquill:Hmph. Justice-dono, foolish is the warrior who rushes headlong into battle. Preparation is an essential element of battle, so I advise you to take a gander at this.Apollo:What is it...?Blackquill:Footage from a security camera. As the two astronauts emerged from the bowels of the Launch Pad 1 Corridor... ... the boarding lounge security camera captured their desperate escape. Now, I would direct your attention to what the defendant is shouldering... ...which you can see, is none other than... the lifeless body of the victim.Apollo:Wh..... Whaaaaaaaat?!Judge:Order! Order I say! This... This lines up exactly with what the prosecution has been asserting!Apollo:I should've known Blackquill would have something like this ready.Security Camera Video added to the Court Record.Athena:Um, Apollo...? How exactly did they determine that Clay was... already gone in that footage?Apollo:.........Ah, I see what you mean! Whether Clay was still alive at that point IS pretty crucial. Your Honor! Please take another look at the footage. Isn't it possible that Mr. Terran was still alive here and that Mr. Starbuck was helping him?!Judge:Why, I believe you're right. One man carrying the other to safety... What a beautiful expression of friendship...Blackquill:Blackquill:Hmph. Perhaps that's what it looks like to a one-eyed hothead and a dotard... But it only makes sense if it's the victim's dead body.Apollo:What do you mean?Blackquill:...Fool Bright, explain it to Justice-dono.Fulbright:You got it! Ready, kid? If the murder had occurred in the lounge, someone could've spotted it. Anyone can enter the lounge, after all. But doing it while they were alone in the spaceship? That's a horse of a different color!Apollo:Apollo:But you can't deny that there's a possibility the murder could've happened in the lounge! All that video shows is a man helping his fellow astronaut out!Blackquill:Blackquill:Your assertion... is based on emotion. It's based in your belief that Mr. Starbuck would surely help his own disciple. But you have no logical explanation as to why the victim could still be alive.Apollo:Urk!Judge:Unfortunately, Mr. Justice, the prosecution is right. Your argument is lacking in sound logic.Apollo:(But it sounded perfectly logical to me...)Judge:Well, Mr. Justice? If you have no further objections... ...I believe it's time to bring this cross-examination to a close.Apollo:Objections...? Well, I, uh...Athena:Athena:Your Honor! The defense requests a little time to think and regroup.Judge:Hmm... Given the facts, I'm not sure I see the need...Apollo:What is it, Athena?Athena:It's just... There's something that's been bothering me.Blackquill:Hmph. If it isn't the defense stalling for time, as always. ............Very well, I'm feeling generous. You may have a small measure of time.Athena:Yes!Blackquill:You have......... five seconds.Athena:F-FIVE SECONDS?!Blackquill:After that, I declare this cross-examination to be closed, and a verdict to be rendered. Your Baldness! Raise your gavel high. It's time for a countdown!Judge:Oh... OH!Blackquill:Ready?Apollo:We don't have time! Spit it out, Athena!Judge:Only three more seconds!Athena:Ack! L-Look! I don't think the prosecution's explanation is very complete.Apollo:Meaning?!Athena:Meaning there's something missing -- like they conveniently left it unexplained...Apollo:Something they didn't explain... Something they didn't explain... .........Ah! You're right! I think I know what you're talking about!Judge:Your five seconds are up, Mr. Justice. Is there anything about the prosecution's argument that you'd like to rebut?Apollo:Y-Yes, Your Honor! Actually, there is! There is something the prosecution has yet to make clear to this court!Judge:Hmm... Well, if you put it that way... What is it that the prosecution has failed to explain?The motive for murderApollo:The prosecution hasn't explained the defendant's motive yet, have they?Judge:Hm? But didn't they just explain... ...that Mr. Terran was a threat to the success of the bombing, so he had to be disposed of?Apollo:Ah! No, wait! Time out, Your Honor!Judge:\"Time out,\" Mr. Justice? This is hardly a sporting event.Apollo:Ack. (That didn't score me any points... Time to put my game face on.)Leads back to:\"What is it that the prosecution has failed to explain?\"Why the body was movedLeads to:\"They have failed to explain why Mr. Starbuck would bother bringing the body back at all.\"Apollo:They have failed to explain why Mr. Starbuck would bother bringing the body back at all. If the defendant wanted to kill the victim, why didn't he just leave the body in the rocket? Why go  through the trouble of bringing him all the way back to the boarding lounge?Judge:Oh! That's true! I don't think we've heard the prosecution's thoughts on that yet.Apollo:That's because they have none, Your Honor. After all, how does one explain something so illogical?Blackquill:............Apollo:The prosecution is claiming that the defendant moved the victim's dead body. But what if the entire premise of that argument is wrong?Judge:Then let's hear your theory, Mr. Justice.Apollo:The defense proposes that the defendant didn't kill the victim! He was helping him! Aaaaack!Blackquill:Fool Bright. Explain it for our sad friend here before I nod off to his monotone monologue. Inform him exactly why Space Boy moved the victim.Apollo:Huh? (They've gotta be joking...)Fulbright:It's simple! Mr. Starbuck did what he did to direct suspicion away from himself! He wanted to create the impression he heroically risked his life to save his partner! That's why he made sure to make it to the security camera so there'd be a record!Blackquill:At the very least, he appears to have achieved success with you and the old man.Apollo:Ah!Judge:One man carrying the other to safety... What a beautiful expression of friendship...Blackquill:The average person wearing a space suit weighs easily over two hundred pounds. (Changed from [The average person wearing a space suit weighs easily over 200 pounds.] in the original release) Saving the life of a partner who weighs as much, while trying to escape deadly flames... What a dramatic sob story fit for the silver screen.Judge:Indeed. I was completely taken in by the humanity of the story.Blackquill:You see? Yet the true ending is that all traces of his hammy act were meant to be blown up. Yes, and now we arrive at the thrilling conclusion: the third explosion!Athena:Athena:What are you talking about? There was no third explosion!Blackquill:Blackquill:Indeed, you are correct. But that is thanks to Detective Arme. It was she who identified and secured the bomb. However, it doesn't change the fact that the third bomb was discovered in the lounge. The steel coffin beside the witness stand. That would be... a bomb transport case. We used that to transport the deactivated bomb here. It was found in the lounge... A bomb in the form of a most distasteful toy.Athena:WHAAAAAAAAAAAAAAAAAAAAAAT?!Blackquill:One on the second floor of the main building, one on the launch pad, and one in the lounge. The defendant planned to set off three firework displays. Fortunately, the third one was discovered before it could be detonated, for had it not... ...the victim's body and other vital evidence would surely have been immolated.Apollo:Apollo:Gaaagh!Blackquill:Before you utter a word, know that the evidence supports me.Apollo:(Ugh... It's like he's reading my mind...)Blackquill:As it is still undergoing forensic investigation, I do not have the evidence on hand. However, know that a peculiar item was found in one of Mr. Starbuck's pockets. Specifically, a bomb detonation switch...Apollo:You found whaaaaaaaaaaaaaat?!Blackquill:I suspect the defendant had no time to destroy such damning evidence... ...when the Space Center director and Detective Arme stumbled across the murder. So he thought to hide it in his pocket... feeble-brained that he is.Apollo:Aaaaaaagh... No! Mr. Starbuck would never do anything like that! AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAGH!Blackquill:Justice-dono, open your eyes and see the truth.Judge:Hmm, this appears to be irrefutable evidence that the accused set off the explosions.Apollo:(No! There has to be some kind of mistake! This can't be the \"truth\"!)Blackquill:Still can't accept it? You'll believe in your client, come what may? ............Then why don't you cross-examine the defendant himself?Apollo:(......This has got to be a trap.)Athena:It's like Blackquill's controlling the entire game.Apollo:Yeah. It seemed like he was waiting for me to bring up the body moving issue.Athena:Why do you say that?Apollo:Because he had just the right argument when I pointed it out... ...and to really rub it in, he had a decisive piece of evidence up his sleeve, too. He was trying to shake my faith in Mr. Starbuck and break me down!Athena:Then, making you cross-examine Mr. Starbuck at this point was part of his plan, too...? Totally underhanded, but I wouldn't expect anything less from him.Blackquill:Now, let us hear from the archvillain, the fiendish murderer himself. Famed astronaut, Solomon Starbuck!Judge:Witness, your name and occupation, please.Starbuck:Solomon Starbuck. Astronaut... Haaaaaaaaaaaaaaaangh... How did this happen?Judge:Mr. Starbuck, you aren't looking very well. Will you be able to give testimony?Starbuck:Haaaaaaaaaaaaaaaangh............ No.Judge:............Well, unfortunately, \"no\" is not an option. You are being accused of the Space Center bombing and the murder of Clay Terran. Please testify to these allegations.Starbuck:Haaaaaaaaaaaaaaaangh... Umm... Mind if I take this suit off? It's getting really heavy...Blackquill:Blackquill:It's not the weight of the suit that you feel, but of your sins. Prepare to carry that weight for the rest of your life...Starbuck:............Banish me to the moon... I don't care anymore...Athena:Wow... That was super-negative... Is he going to be all right up there?Apollo:H-He'll be fine! I think... (As long as he doesn't totally give up and say he did it, that is.)Witness Testimony-- I Didn't Kill Him --Starbuck:All I did was support Clay over my shoulder and get us out of the rocket!Like always, I took the elevator down to the middle level and headed for the corridor.Clay had passed out by the time we got the order to evacuate.I didn't kill Clay! I was trying to save him!Judge:Hmm... So you assert you didn't set off the bombs or murder the victim?Starbuck:Ha ha. Ha ha ha... But I bet you think I'm lying, right?Judge:I reserve all judgment until after I've heard your full testimony.Starbuck:Haaaaaaaaaaaaaaaangh... I'm sure you don't believe me. I bet you don't even believe I'm an astronaut.Apollo:(I don't think the judge doubts THAT!)Athena:Who'd wear a suit like that EXCEPT an astronaut...Judge:Hmm... I will say that when I saw you in that movie... ...you appeared quite courageous, though I suppose reality never quite lives up to fantasy.Starbuck:Haaaaaaaaaaaaaaaangh... I guess I'm just a big disappointment... Ha ha. Ha ha ha. Ha ha... I really don't care what happens anymore. Ha ha ha...Apollo:(Oh, no! He's completely give up!)???:Haaaaaaaaaaaaaaaangh...Blackquill:Hmph. What a depressing fellow. If you were to join me in the clink... ...I imagine that annoying sighing of yours would rub off on the other inmates.Athena:Like how it rubbed off on Prosecutor Blackquill a second ago?Apollo:(Huh? That was Blackquill sighing? Mr. Starbuck's testimony contains a glaring contradiction. The question is, what does it mean? Even if Mr. Starbuck is my client, I can't be gun-shy now! It's time to find out the truth!)Cross ExaminationCross Examination-- I Didn't Kill Him --Starbuck:All I did was support Clay over my shoulder and get us out of the rocket!PressApollo:Apollo:So what you're saying is that the victim was still alive at that time?Starbuck:Of course! He was alive and well!Blackquill:Blackquill:If so, then you took a man who was alive and well... ...and silenced him permanently with this?Starbuck:What?! No! Aaaaagh! Black hole confirmed, dead ahead. Aaaaaaaaaaaaah! It's no good, captain! I'm getting sucked iiiiiiiiiiiiiiinnnnnnnnnn!Apollo:Apollo:M-Mr. Starbuck! You are not in space! Please give your testimony seriously!Starbuck:I-It was just nerves, but maybe I shouldn't have said he was \"alive and well.\" It was more like he was slumped over.Apollo:(Those are complete opposite ends of the spectrum!)Starbuck:Like always, I took the elevator down to the middle level and headed for the corridor.PressApollo:Apollo:Is that the elevator inside the launch pad area?Starbuck:That's right. We always use it to get to and from the cockpit.Athena:That makes sense. So he was just using the route he always used.Apollo:In spite of the fact that there had just been an explosion...?Athena:...Huh?Apollo:(I think Mr. Starbuck is hiding something. Something pretty big...)Present Bombing ReportApollo:Leads to:\"Mr. Starbuck, I need your testimony to be as accurate as possible.\"Starbuck:Clay had passed out by the time we got the order to evacuate.PressApollo:Apollo:Passed out? Why was he passed out?Starbuck:Probably because of the explosion. The noise and vibration were incredible. It's little wonder a person would pass out, right?Apollo:I-I guess...? (Not that I'd know...)Starbuck:Aaaaagh! I've been hit by space debris! The main engine's on fire! It's gonna blow! Aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaah!Apollo:Y-Yes, I see... I guess it does make sense that someone would pass out... (Especially if the person in question is Mr. Starbuck...)Starbuck:A-Anyway!Starbuck:I didn't kill Clay! I was trying to save him!PressApollo:Apollo:Don't worry! I understand. I'll make sure everything turns out all right!Starbuck:............But everyone's glaring at me like I did it.Athena:Apollo, you have to reassure him better than that!Apollo:And how am I supposed to do that?!Athena:Try to imagine how he's feeling, and use that to figure out how to boost his confidence.Apollo:Mr. Starbuck, think back to what Clay used to always say. It's times like these when he would repeat, \"I'm fine!\" to himself.Starbuck:\"I'm fine\"...? Yeah, I guess he did say that a lot... Haaaaaaaaaaaaaaaangh... But even if I shout it, Clay will still be dead. Haaangh... What's the use...?Apollo:............Haaaaaaaaaaaaaaaangh... (Could somebody please reassure me now?)Athena:Apollo, there's something strange about Mr. Starbuck's testimony.Apollo:Yeah, I was thinking the same thing. There's a glaring contradiction. I just wonder why it's there and what it means for our case.Athena:Well, it doesn't look like he's lying, at least...Apollo:............ (Guess I'll have to show some evidence.)"
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "Let's see... Uh, my escape route... What I said before was a mistake.",
          "person": "Starbuck",
          "present": []
        },
        {
          "testimony": "I, uh, I remember now! I took a different route... Maybe... Probably...",
          "person": "Starbuck",
          "present": []
        },
        {
          "testimony": "With the capsule and Clay in my arms, I made my way down from the upper level.",
          "person": "Starbuck",
          "present": [
            "Space Center Diagram"
          ],
          "source": {
            "evidence_span": "There are two ways to descend from the upper to the mid level—via an elevator or a ladder.",
            "testimony_span": "With the capsule and Clay in my arms, I made my way down from the upper level.",
            "explanation": "One cannot carry another person and a large capsule in arms while climbing down a ladder.",
            "is_self_contained": "yes",
            "context_span": "",
            "isMultimodal": true
          }
        }
      ],
      "summarized_context": "Starbuck describes his escape route after the explosion. He initially states that he took the elevator down to the middle level, but later admits that he might have taken a different route. He also mentions carrying Clay and the capsule with him.",
      "labels": [
        "behavior"
      ],
      "reasoning": [
        "Fact 1: Starbuck claims he was carrying Clay and the capsule.",
        "Fact 2: The evidence shows Starbuck must used the ladder to escape",
        "Prop 1: If a person is carrying another human and a large capsule in arms, they would not be able to climb the ladder down."
      ],
      "noPresent": false,
      "newContext": "-- I Didn't Kill Him --Starbuck:All I did was support Clay over my shoulder and get us out of the rocket!PressApollo:Apollo:So what you're saying is that the victim was still alive at that time?Starbuck:Of course! He was alive and well!Blackquill:Blackquill:If so, then you took a man who was alive and well... ...and silenced him permanently with this?Starbuck:What?! No! Aaaaagh! Black hole confirmed, dead ahead. Aaaaaaaaaaaaah! It's no good, captain! I'm getting sucked iiiiiiiiiiiiiiinnnnnnnnnn!Apollo:Apollo:M-Mr. Starbuck! You are not in space! Please give your testimony seriously!Starbuck:I-It was just nerves, but maybe I shouldn't have said he was \"alive and well.\" It was more like he was slumped over.Apollo:(Those are complete opposite ends of the spectrum!)Starbuck:Like always, I took the elevator down to the middle level and headed for the corridor.PressApollo:Apollo:Is that the elevator inside the launch pad area?Starbuck:That's right. We always use it to get to and from the cockpit.Athena:That makes sense. So he was just using the route he always used.Apollo:In spite of the fact that there had just been an explosion...?Athena:...Huh?Apollo:(I think Mr. Starbuck is hiding something. Something pretty big...)Present Bombing ReportApollo:Leads to:\"Mr. Starbuck, I need your testimony to be as accurate as possible.\"Starbuck:Clay had passed out by the time we got the order to evacuate.PressApollo:Apollo:Passed out? Why was he passed out?Starbuck:Probably because of the explosion. The noise and vibration were incredible. It's little wonder a person would pass out, right?Apollo:I-I guess...? (Not that I'd know...)Starbuck:Aaaaagh! I've been hit by space debris! The main engine's on fire! It's gonna blow! Aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaah!Apollo:Y-Yes, I see... I guess it does make sense that someone would pass out... (Especially if the person in question is Mr. Starbuck...)Starbuck:A-Anyway!Starbuck:I didn't kill Clay! I was trying to save him!PressApollo:Apollo:Don't worry! I understand. I'll make sure everything turns out all right!Starbuck:............But everyone's glaring at me like I did it.Athena:Apollo, you have to reassure him better than that!Apollo:And how am I supposed to do that?!Athena:Try to imagine how he's feeling, and use that to figure out how to boost his confidence.Apollo:Mr. Starbuck, think back to what Clay used to always say. It's times like these when he would repeat, \"I'm fine!\" to himself.Starbuck:\"I'm fine\"...? Yeah, I guess he did say that a lot... Haaaaaaaaaaaaaaaangh... But even if I shout it, Clay will still be dead. Haaangh... What's the use...?Apollo:............Haaaaaaaaaaaaaaaangh... (Could somebody please reassure me now?)Athena:Apollo, there's something strange about Mr. Starbuck's testimony.Apollo:Yeah, I was thinking the same thing. There's a glaring contradiction. I just wonder why it's there and what it means for our case.Athena:Well, it doesn't look like he's lying, at least...Apollo:............ (Guess I'll have to show some evidence.)Apollo:Mr. Starbuck, I need your testimony to be as accurate as possible.Starbuck:W-Was I not being accurate?Apollo:No, because it's impossible for you to have taken the elevator down to the middle level.Judge:What makes you say that, Mr. Justice?Apollo:Please recall where the bomb went off in Launch Pad 1. Also recall that after the explosion, the middle level elevator was engulfed in flames.Judge:Oh! You're right. Which means...Apollo:Exactly. The launch pad's elevator would've been unusable. In other words... ...Mr. Starbuck, your statement is decidedly inconsistent with the facts! Wh-What's with the helmet?Starbuck:Aaaaaagh! Mission command! Mission command! Do you read me?! Come in, please!Apollo:Apollo:This is mission command... I order you to PAY ATTENTION! Stop this nonsense and answer my questions, Mr. Starbuck!Starbuck:Aaaaagh! M-My helmet! Ah! My oxygen taaaaaaaaaaaaaaaaaaank! Oxygen concentration and body temperature declining! Requesting medical assistance! Gaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaagh!Judge:M-Mr. Starbuck! We are not in space right now! Please stop pretending you have lost consciousness and stand back up!Starbuck:I-I apologize, Your Honor. I forgot I was still on Earth.Athena:I feel like we all just got a real glimpse of Solomon Starbuck the astronaut.Apollo:Yeah, he seemed more like an astronaut now than when he was doing all that sighing. Mr. Starbuck, could you please explain the inconsistency in your statement? About how you used the middle level elevator?Starbuck:I, uh... was nervous, and I said the wrong thing! I'm sorry! I actually, uh, took a different route, I think.Apollo:A different route?Blackquill:............I hope you're able to deliver a straight story this time.Starbuck:Ack! I-I-I'll get it right this time! Maybe. No, I mean, probably!Blackquill:Probably...?Judge:It's understandable to be nervous, but let me remind you that accuracy is paramount in court.Witness Testimony-- My Escape Route --Starbuck:Let's see... Uh, my escape route... What I said before was a mistake.I, uh, I remember now! I took a different route... Maybe... Probably...With the capsule and Clay in my arms, I made my way down from the upper level.Apollo:So you're saying you escaped without using the elevator?Starbuck:Th-That's right! There's a ladder that spans the upper and middle levels. I used that ladder to get to the middle level. Luckily, the fire hadn't reached the ladder, so we could make our escape that way.Apollo:And the capsule you mentioned... I suppose you mean the thing next to Mr. Terran here? Was the capsule that important that you'd risk your life to take it with you?Starbuck:It almost goes without saying, but yeah! That capsule contains asteroid samples. Therefore it's invaluable as research material. With his space suit on, Clay weighed a ton, but securing the capsule was also important.Apollo:I need you to answer to the best of your ability! Mr. Starbuck! Please remember that your verdict is riding on your testimony!Starbuck:Ha ha... ha ha ha... Haaaaaaaaaaaaaaaangh... Maybe I am guilty after all. I wonder if you can see the stars in prison? Bet it's more comfortable than a spaceship.Cross ExaminationCross Examination-- My Escape Route --Starbuck:Let's see... Uh, my escape route... What I said before was a mistake.PressApollo:Apollo:How could you mistake such a basic fact?!Starbuck:Hey, everybody makes mistakes, but try thinking about the vastness of space instead. From Earth, it takes four light-years to travel to our nearest neighboring star. So you see? Compared to the vast expanse of space, human error is insignificant.Apollo:(I wish he'd consider it just a little more significant than zero...)Blackquill:Enough jabbering. Get on with your testimony.Starbuck:Ungh...Starbuck:I, uh, I remember now! I took a different route... Maybe... Probably...PressApollo:Apollo:\"Maybe\"? \"Probably\"? Did I hear you right, Mr. Starbuck?!Starbuck:I-I didn't say either of those things! Aaaaagh! Mission control! Come in, please! An error has occurred in the sound system! Activate the emergency tin can telephone! Oh, nooooooo! Tin can telephones are ineffective in the vacuum of space!Blackquill:Blackquill:Stop this nonsense or I will sever you AND your tin can telephone.Starbuck:All right! I'm begging you! I'll tell the truth! Just don't sever anything!Athena:Apollo, is he going to be all right?Apollo:I'm... starting to think he's not...Starbuck:Um, let's see... So about when we were running away...Starbuck:With the capsule and Clay in my arms, I made my way down from the upper level.PressApollo:Apollo:The upper level of the launch pad area...?Starbuck:Th-That's right! That's what I said, isn't it?!Apollo:(Granted, that route does exist...) So, to recap, you had Clay over your right shoulder and the capsule in your left hand?Starbuck:Yeah! It's really important, so I couldn't let it get burned up. So, even though Clay was really heavy, I couldn't afford to carry him with both hands. I did the best I could with him over one shoulder and the capsule in my other hand.Apollo:(............I don't think the meaning of what he just said has hit him yet...)Blackquill:...Hmph. You know what you have to do with that statement, Justice-dono!Apollo:Y-Yes, I know! (Well, I've come this far. No turning back now. It's time to present some evidence!)Present Space Center DiagramApollo:Leads to:\"Mr. Starbuck, why don't you just tell the truth?\"Athena:So Mr. Starbuck escaped with Clay and the capsule, which means... ...it's just like in the footage. I can see why he couldn't run, though.Apollo:He must've weighed over two hundred pounds just by himself. (Changed from [He must've weighed over 200 pounds just by himself.] in the original release)Athena:Yeah, and he had to support Clay, who was another two hundred pounds. (Changed from [Yeah, and he had to support Clay, who was another 200 pounds.] in the original release) Plus, he had to ensure the safety of that capsule. I don't think I could've even walked under those circumstances.Apollo:(Walking straight forward is probably about all I would've been able to manage...)"
    }
  ]
}