{
  "previousContext": "",
  "characters": [
    {
      "currentChapter": "Turnabout Storyteller",
      "name": "Simon Blackquill",
      "age": "• Age: 29",
      "description1": "A prosecutor who excels at psychological manipulation. As far as psychology goes, he's kind of like my senior, I guess."
    },
    {
      "currentChapter": "Turnabout Storyteller",
      "name": "Taifu Toneido",
      "age": "• Age: 70",
      "description1": "A rakugo storyteller of fifty-five years who is famous for his soba-based routines. He has two disciples under him in his troupe."
    },
    {
      "currentChapter": "Turnabout Storyteller",
      "name": "Bucky Whet",
      "age": "• Age: 20",
      "description1": "My client for this case, and the fourth head of Whet Soba. He's still got a lot to learn about noodle making."
    },
    {
      "currentChapter": "Turnabout Storyteller",
      "name": "Nahyuta Sahdmadhi",
      "age": "• Age: 25",
      "description1": "A prosecutor from the Kingdom of Khura'in. He's also known as the \"Last Rites Prosecutor.\""
    },
    {
      "currentChapter": "Turnabout Storyteller",
      "name": "Geiru Toneido",
      "age": "• Age: 34",
      "description1": "Balloon artist and her master's senior disciple. She has twelve years of performance under her belt."
    },
    {
      "currentChapter": "Turnabout Storyteller",
      "name": "Uendo Toneido",
      "age": "• Age: 28",
      "description1": "A rakugo storyteller and junior disciple after Geiru. He has less experience than Geiru, yet he's become higher ranked than her."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Storyteller",
      "name": "Attorney's Badge",
      "description1": "My attorney's badge. It's lost that \"brand-new\" shine, but that just shows how far I've come."
    },
    {
      "currentChapter": "Turnabout Storyteller",
      "name": "Backstage Diagram",
      "description1": "Diagram of the backstage area showing the location of the stage, the dressing room, and the yard."
    },
    {
      "currentChapter": "Turnabout Storyteller",
      "name": "Crime Scene Report",
      "description1": "The crime scene took place in the theater dressing room. Master Toneido was found with his face thrust into a large soba bowl.",
      "description2": "Contains photos of the crime scene. The victim's dying message is clearly visible in them. Includes additional info."
    },
    {
      "currentChapter": "Turnabout Storyteller",
      "name": "Taifu's Autopsy Report",
      "description1": "The time of death is between 2 PM and 5 PM. The cause of death is suffocation."
    },
    {
      "currentChapter": "Turnabout Storyteller",
      "name": "Whet Soba Deed",
      "description1": "Found in the victim's possession. It's the deed to the soba shop. The deed holder is Bucky Whet."
    },
    {
      "currentChapter": "Turnabout Storyteller",
      "name": "Invitation",
      "description1": "The invitation Simon received from Master Toneido to the show commemorating Uendo's name succession and promotion."
    },
    {
      "currentChapter": "Turnabout Storyteller",
      "name": "Simon's Statement",
      "description1": "Simon's eyewitness account of the time of the incident.",
      "description2": "Simon's eyewitness account of the time of the incident. Includes additional info."
    },
    {
      "currentChapter": "Turnabout Storyteller",
      "name": "Karuta Cards",
      "description1": "Karuta cards in the victim's dressing room. They spell out \"WHET NO 4.\"",
      "description2": "Karuta cards in the victim's dressing room. They originally spelt out \"OWEN 4TH\" as shown."
    },
    {
      "currentChapter": "Turnabout Storyteller",
      "name": "Taifu's Note",
      "description1": "A note thought to have been written by the victim before his death."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "I went to the theater yesterday, and arrived at... approximately 4 PM.",
          "person": "Blackquill",
          "present": []
        },
        {
          "testimony": "I went straight to Master Toneido's dressing room to say hello.",
          "person": "Blackquill",
          "present": []
        },
        {
          "testimony": "Bucky went into the dressing room thereafter, only to come storming out a while later.",
          "person": "Blackquill",
          "present": []
        },
        {
          "testimony": "Master Toneido's junior disciple, Uendo, apparently then entered the room soon after.",
          "person": "Blackquill",
          "present": []
        },
        {
          "testimony": "That's when Uendo discovered Master Toneido's body.",
          "person": "Blackquill",
          "present": []
        }
      ],
      "noPresent": true,
      "newContext": "Turnabout Storyteller\n\n\n\n\n\n\n\n\n\nImage Gallery\n\nTranscriptEpisode 4Turnabout StorytellerAnime cutscene\n\"Shisho\":\n...three, four, five, six, seven, eight... What time is it? It's nine! Ten, eleven...???:\nSh-Shisho's dead...? No... D-Do you think... HE did it????:\nOh, no! I-If he did... then wh-what do we do?!???:\nHey, pull yourself together!???:\nDon't worry. I have an idea...May 13, 9:45 AMDistrict Court- Defendant Lobby No. 6Athena:\n(What the heck! Who brings a defendant to his own trial late?! Plus, the request was so last-minute, I didn't even have a chance to talk with my client!)Widget:\nHe's late, he's late, for a very important date!Athena:\nMy name is Athena Cykes. Armed with analytical psychology, and a full arsenal of legal know-how... I'm a fully-competent defender of the Wright Anything Agency! Though I wish my client would show up already -- the trial's about to start...???:\nHeh. It appears we made it just in time.Athena:\nWhere have you BEEN?! The trial's about to start, Simon!Blackquill:\nYou needn't get so worked up, Athena. His Baldness can wait.Athena:\nThere's no way he'd wait for me! And besides, why would I want to start off on the wrong foot with him right out of the gate?!Blackquill:\nDealing with such matters is part of being a lawyer, if I'm not mistaken.Athena:\nYeah, well, covering for your lateness is not!Blackquill:\nHmph. Still but a rank amateur, I see...Athena:\nThis is Simon Blackquill. He might not look it, but he's actually a prosecutor, and a psychology specialist. He and I go way back... As for our shared specialization in psychology... ...we're both disciples of the same person so to speak, but he's kinda my senior, I guess. But twisted sense of humor or no, I wish he'd stop treating me like a child all the time.Blackquill:\nSo, where are Wright-dono and Justice-dono?Athena:\nMr. Wright is abroad, and Apollo is helping Trucy with her magic show. Didn't I tell you?Blackquill:\nThey're what? So neither one of them are here? ...Leaving you to take this on alone?Athena:\nYup!Blackquill:\nYe gods... Call Wright-dono back. It's not too late.Athena:\nOh no, not too late at all! He would only need to know how to teleport.Blackquill:\nTsk. Very well... Then I will settle for Justice-dono. Go grab him by the horns and drag him here!Athena:\nApollo is literally in the middle of a show, Simon! You may not want to admit it, but I've got what it takes to take on this case! Just leave this to me and go watch from the gallery!Blackquill:\n...As your defense derails in a spectacular fashion?Athena:\nNo... As I win the heck out of this trial!Blackquill:\n..........Athena:\nI'll be okay -- promise! So wipe that look off your face already, will you? Anyway, I take it the guy behind you is...?Blackquill:\nYes, he's your... ......Tsk, he's asleep again. Hoy, Bucky! Wake up!???:\nGiyaaaaaaaaaaah!Bucky:\nOwwwww... Whadja do DAT for, Simey...? *hic* ..........Hrrnhhh...? Who's dis yeller chickadee?Blackquill:\nShe is your lawyer, such as it were. I'd say she's more \"green\" than \"yellow\" however.Bucky:\nLawyer? She sure duzen't look it, dush she...? Is she, like, yer fellow apprentice or sumfin'...?Blackquill:\n...Heh, something like that. I've known her longer than I've known you. You could say we're bound to one another.Bucky:\nOhhhh, m'kay... Well den. Geussh I better call 'er MIZ chickadee, den.Athena:\nSimon... This guy's not only rude, but he's three sheets to the wind at his own trial...Bucky:\nEh heh heh, heh... *hic*Athena:\nI know we just met, but... I'm about ready to give him a piece of my mind!Blackquill:\nDo as you will. Just save it for after the trial.Bucky:\nMiz Chickadee...Athena:\n(Don't call me that!)Bucky:\nHow'd y'da...? Simey here'sh an old frienda mine... I'm the fourth-generation head chef o'\"Whet Soba.\" \"Whet Noodle No. 4,\" Bucky Whet! Nice to meetcha!Athena:\nI-It's... nice to meet you, too, Mr. Whet. (So he CAN pull himself together when he wants to! Grr... If only the trial wasn't starting in a few minutes...)Blackquill:\nHaving been accused of a murder that only occurred yesterday... ...I'm afraid it's taken a toll on the poor boy.Athena:\nAnd you happened to be there at the theater where it all happened, too, right? They said they found a rakugo storyteller murdered in his dressing room.Blackquill:\nIndeed. The victim, master storyteller Taifu Toneido, was a long time patron of Whet Soba. Master Toneido had been looking after Bucky ever since Whet Noodle No. 3 passed away.Athena:\nI see. So the victim was kind of like a father to the defendant, huh.Bucky:\nDat shtupid ol' fart... Like a father...?! Naw way! He was alwaysh disshing my soba...Blackquill:\nHow dare you speak ill of him? Running your mouth like that is why they suspected you of his murder in the first place! Now, pull yourself together. No. 3 must be rolling in his grave.Bucky:\n...B-B-But Siiiiimey... *hic* Da police... None o' dem believesh me... Dey won' lishen t'me... *sniffle*Athena:\n(It looks like he's still in shock from the whole ordeal...) Don't worry, Mr. Whet. Everything's gonna be all right! I'm going to defend you with everything I've got. You're in good hands now!Bucky:\nY'mean... you believe me, ma'am...?Athena:\nOf course! No matter what, I'll believe in you to the very end!Bucky:\nGee whiz, Miz Chickadee...Athena:\nNow c'mon, I need you to shape up -- just like those al dente noodles of yours!Bucky:\nYesh, ma'am...! My soba ish the freshesht... *urp*Athena:\nM-Mr. Whet!Blackquill:\n*sigh* Bucky, you great, big pillock.Athena:\nSo, uh, how exactly do you know this guy?Blackquill:\nI used to frequent Whet Soba -- and still do, in fact -- so I've known him since he was a lad. That's why his father and Master Toneido were always so good to me.Athena:\n...I didn't know you liked soba so much, Simon.Blackquill:\nI wouldn't expect one such as you, who eats meat slapped between slabs of bread... ...to understand the delicate taste, and the subtle textures imparted by buckwheat flour.Athena:\nHey, that's just rude!Blackquill:\nBut I digress.Athena:\n(Hmph! I'm all about flavor and subtlety and stuff!)Blackquill:\nIf I let Whet Soba end like this... ...I'll never be able to face No. 3 or Master Toneido in the next life.Athena:\nAh, I see... And that's why you came to me! You wanted someone you could trust!Blackquill:\nIt was never my intention to ask YOU.Athena:\nGrrrrr... (I'll show him! I'll show him I can handle it just fine!)Blackquill:\nWell, I believe it's just about time.Athena:\nWhat?! But we haven't even properly discussed the case yet!Blackquill:\nWhat's the matter? You look nervous, Athena. Don't tell me you're \"chickadee\"-ing out.Athena:\nI-I'm just trembling with the excitement of battle -- that's all! Auf geht's! Let's do this! Come on, Mr. Whet! Get up off the floor -- we've got a case to win!Bucky:\nYesh, Miz Chickadee... I'm gonna do my besht... *hic*Whet Soba! Whet Soba! Whet Soba! Whet Soba! Whet Soba!Bucky:\nYello! Two bowls of noodles...? Sorry sir, no can do... Kinda busy at the courthouse... Huh? Dey, dey hung up... Eh heh. Okay! Let'sh do dish... *hic*Athena:\n...He's not going to do himself or his case any favors like this, Simon. Maybe we should let him go get some rest somewhere...?Bucky:\nLemme resht? Hah! Mehbee if I were a lump o' regular flour dough fer udon noodles! But I'm fresh, like my soba! 'N y'don't let soba dough resht... 'S all about the \"three freshes\"! Grind da buckwheat seeds fresh, cut da dough fresh, and boil da noodles fre-- *urp*Blackquill:\nH-He's blacked out!Athena:\n(Oh, boy. I just KNEW something like this would happen.) Simon, what are these \"three freshes\" of soba he was talking about?Blackquill:\nFirst, buckwheat seeds, or \"groats,\" are ground to make buckwheat flour. Then dough made with the flour is cut with a large, rectangular knife into noodles. And, finally, the buckwheat noodles are boiled. Each step is done immediately, one after the other, so that the soba is fresh when eaten.Athena:\nOh, so that's what he meant. (I wouldn't want him to make me any soba right now, though, that's for sure.)Blackquill:\nAthena, this is no time for idle chatter. You need to get into the courtroom, now. Just remember: as a prosecutor, I will be unable to lend you a hand. So don't expect any help from my quarter.Athena:\nThere you go, treating me like I'm incompetent again! For your information, I wasn't planning on asking you for help anyway! {{Color|#0070C0|(Grrr! Just you wait, Simon! I'll show you! (Mr. Wright and Apollo may not be here... ...but that's all right. I can do this on my own!)May 13, 9:50 AMDistrict Court - Courtroom No. 4Day 1Court Is Now In SessionAll RiseJudge:\nCourt is now in session for the trial of Bucky Whet.Athena:\nThe defense is ready, Your Honor!Nahyuta:\nThe prosecution is fully prepared, Your Honor.Judge:\nWhat's this? No prayer this time, Prosecutor Sahdmadhi?Nahyuta:\nThat is correct, Your Honor. To expedite these proceedings, I completed them beforehand in the lobby.Judge:\nHow very thoughtful of you. By the way, what brings you back to this country?Nahyuta:\nChief Prosecutor Edgeworth himself called on me to handle this case. Besides, I have a debt to repay. And though my opponent is yet a callow thing... ...I have no qualms with sending her down to hell.Athena:Athena:\nIf you have a score to settle, it's with Apollo, not me! But more importantly... I am not a \"callow thing.\" I'm a qualified and capable attorney!Nahyuta:\nThen what is that yellow attire, if not proof of your immaturity, you small, spring chick? Now, cease your shrill chirping.Judge:\nNow, now, Prosecutor Sahdmadhi. She is still only a teenager. Please go easy on her.Athena:\n(Great! Now even the judge is giving me the kid treatment!)Nahyuta:\nVery well. Shall we begin, Your Honor?Judge:\nHmm, I suppose we should. Now then, Prosecutor Sahdmadhi, please give your opening statement.Athena:\n(I'll show them what I can do! They'll be sorry they underestimated me!)Nahyuta:\nCertainly. Let the last rites of the victim commence. The incident is believed to have occurred at around 4 PM yesterday, May 12... ...at a storytellers' theater called \"Kurukuru Tei.\" The victim was a great master of the Toneido school of \"rakugo,\" or \"comedic storytelling.\" His name was Taifu Toneido. The scene of the murder was the theater's dressing room. It is accessible via the stall entrance hallway, and has an inner and outer sliding door.Backstage Diagram added to the Court Record.Nahyuta:\nThe estimated time of death is between 2 PM and 5 PM. The cause of death is suffocation, though how the victim suffocated is yet to be determined. The autopsy report found nothing unusual in his lungs or stomach, and there is no murder weapon. I will now submit the incident report to the court.Crime Scene Report added to the Court Record.Taifu's Autopsy Report added to the Court Record.Athena:\nProsecutor Sahdmadhi! How can you name Mr. Whet as the culprit... ...when you don't know how the victim was killed -- or even with what?!Nahyuta:\nWhile it is true that the weapon and precise method are, as yet, unknown... ...the accused is the only one who had the opportunity to commit the murder. I will explain this assertion in further detail as we continue.Athena:\n(Ugh. I guess this means he has some kind of evidence to present...)Nahyuta:\nNow, would the accused care to plead his case?Judge:\nCome to think of it, where IS the defendant, Ms. Cykes?Athena:\nS-Sorry, Your Honor. But I'm afraid Mr. Whet isn't feeling very well, and is resting in the infirmary.Nahyuta:\nSurely it is the lack of a clear conscience that impedes him from facing this court.Athena:\n(Great. Starting off on the wrong foot already...)Nahyuta:\nMr. Whet is the head chef of a soba shop frequented by the victim. On the day of the incident, Mr. Whet went to the theater at the victim's request. Taifu Toneido was a connoisseur of soba. As you can see in these photographs... ...he was apparently making soba himself in his dressing room that very day. The soba found at the scene is likely the soba he himself made there.Athena:\n(Liking soba is one thing, but making it in a theater dressing room's a bit much, non?)Judge:\nMaster Toneido truly had a passion for soba, didn't he? For a man like that to be murder by a soba chef is simply unthinkable.Nahyuta:\nAnd yet, the accused had ample motive. For in the victim's safe, we discovered the deed to the accused's shop. Mr. Whet was to inherit Whet Soba when he lost his father recently. However, it's believed the victim stole the shop's deed during the transfer process. The prosecution believes the accused killed the victim in order to get the deed back.Whet Soba Deed added to the Court Record.Judge:\nHmm... A murder over the deed to a shop... That does sound like a plausible motive.Athena:\n(So THAT'S what this case is about... I wish Simon had filled me in a little better... I could've contributed more than just a thousand buckets of cold sweat if he had...)Nahyuta:\nDefense. From your demeanor, I gather you know very little about the details of this case.Athena:\nW-Well, you see...Nahyuta:Nahyuta:\nYou are dishonoring the soul of the victim by appearing in the courtroom unprepared. You are an embarrassment to your profession, you putrid egg yolk!Athena:\nEeeeeek! I-I'm sorry! (Apollo's a \"red pepper,\" and now, I'm an \"egg yolk\"?! We've only just started and I've already been demoted from \"spring chick\"...)Nahyuta:\nI am ready to call my witness, Your Honor. Let us listen to the words of one who was present when the crime was discovered.Athena:\n(Someone who was there when the victim's body was found?)Judge:\nVery well. Witness, please take the stand.Nahyuta:\nWitness, please state your name and occupation.Blackquill:\nSimon Blackquill... Prosecutor.Athena:\nP-Prosecutor Blackquill! You didn't tell me you were going to take the stand!Blackquill:\nThere simply wasn't time.Nahyuta:\nWhat a shame, Prosecutor Blackquill. Had you shared the damning scene you witnessed beforehand with the defense... ...we could've moved this trial along, and saved the victim's soul that much faster.Athena:\n(\"D-Damning scene\"...? What in the world did Simon see?)Blackquill:\nProsecutor Sahdmadhi, was it? Before I give my testimony, there's something I'd like to confirm.Nahyuta:\nBy all means.Blackquill:\nThis case involves \"rakugo,\" a very traditional form of Japanese comedic storytelling. Do you have enough knowledge of this art form to handle the case competently?Nahyuta:\nAre you implying that I am not qualified for this case?Blackquill:\nNot yet -- I am simply trying to ascertain your familiarity with the topic... for now.Nahyuta:\nIt is the prosecutor's duty to learn the background of any case he takes on. I did some rakugo last night, and have grasped the overall idea of it.Blackquill:\nHmph. How much could you possibly grasp in a single night?Nahyuta:\nRakugo is a form of entertaining storytelling that originated in the land of Japan. In it, the storyteller sits alone on the stage, with only a fan and a towel as...Nahyuta:\n...and the rakugo artist tells long, whimsical stories, giving each character a distinct voice. This traditional art was originally invented by monks to make sermons more interesting. Are you satisfied? If not, I could explain the twelve types of endings to such stories... ...or shall I perform the famous story of Jugemu instead?Blackquill:\nAugh! I-It appears you have put in a bit of study...Nahyuta:\nYour acknowledgement is most welcome, Prosecutor Blackquill.Judge:\nI can see why you are know for being quite thorough in your research, Prosecutor. Now, I would love to see you perform that story you mentioned, if you don't mind.Nahyuta:\nIf that is Your Honor's request... Jugemu, Jugemu--Athena:Athena:\nYour Honor! Could we please get back to the trial?!Judge:\nOh, right! Of course. I nearly forgot!Athena:\nSeriously? Of all the things for you to forget...Judge:\nAhem! Now then, back to the case. Prosecutor Blackquill. Please tell the court what you witnessed.Witness Testimony-- What Simon Saw --Blackquill:\nI went to the theater yesterday, and arrived at... approximately 4 PM.\nI went straight to Master Toneido's dressing room to say hello.\nBucky went into the dressing room thereafter, only to come storming out a while later.\nMaster Toneido's junior disciple, Uendo, apparently then entered the room soon after.\nThat's when Uendo discovered Master Toniedo's body.Athena:\nN-Now, wait just a minute here, Prosecutor Blackquill! W-With a testimony like that... ...you're practically accusing Mr. Whet of the crime!Blackquill:\nAll I can do is state what I saw. I can't help how it appears. But a \"qualified and capable attorney\" such as you should be able to dispatch with it, right?Athena:\nW-Well, yeah, duh! (A-All right. I guess I'd better start by getting all the info out of him that I can.)Cross ExaminationCross Examination-- What Simon Saw --Blackquill:\nI went to the theater yesterday, and arrived at... approximately 4 PM.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nProsecutor Blackquill, what did you go to the theater for in the first place?\nBlackquill:\nI went because I had received an invitation from Master Toneido. Here, see for yourself. It was a special show commemorating his junior disciple Uendo's promotion. It was also an occasion to announce the boy's succession to the stage name of \"Uendo II.\"\nAthena:\nUm, so what exactly does it mean to \"succeed to a stage name\"?\nBlackquill:\nHmph. You really don't know, do you? In the performing arts, a name succession is when an artist inherits a predecessor's name.\nAthena:\nI see. So there was another \"Uendo\" rakugo artist before, and this disciple succeeded him, huh. And what did your invitation say?\nBlackquill:\nIt contained a simple letter of salutations, and an outline of the show's program.\nJudge:\n...Oh! It appears Taifu Toneido was going to perform \"Tokisoba,\" or \"Time Soba.\" He's famous for his masterful pantomime of eating soba, using only his fan as a prop. And Uendo was to peform \"Soba Sei,\" or \"Soba Glutton.\" A soba-themed show, I see!\nBlackquill:\nIt seems you know a thing or two about rakugo yourself, Your Baldness. The first to perform was the senior disciple, Geiru, followed by Uendo... ...and, lastly, Master Toneido.\nInvitation added to Court Record.\nAthena:\nI see. So that's why you happened to be at the storytellers' theater yesterday. So what happened after you arrived?Press (subsequent times)\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nProsecutor Blackquill, what did you go to the theater for in the first place?\nBlackquill:\nI went because I had received an invitation from Master Toneido. Here, see for yourself. It was a special show commemorating his junior disciple Uendo's promotion. It was also an occasion to announce the boy's succession to the stage name of \"Uendo II.\"\nAthena:\nUm, so what exactly does it mean to \"succeed to a stage name\"?\nBlackquill:\nHmph. You really don't know, do you? In the performing arts, a name succession is when an artist inherits a predecessor's name.\nAthena:\nI see. So there was another \"Uendo\" rakugo artist before, and this disciple succeeded him, huh. And what did your invitation say?\nBlackquill:\nIt contained a simple letter of salutations, and an outline of the show's program.\nJudge:\n...Oh! It appears Taifu Toneido was going to perform \"Tokisoba,\" or \"Time Soba.\" He's famous for his masterful pantomime of eating soba, using only his fan as a prop. And Uendo was to peform \"Soba Sei,\" or \"Soba Glutton.\" A soba-themed show, I see!\nBlackquill:\nIt seems you know a thing or two about rakugo yourself, Your Baldness. The first to perform was the senior disciple, Geiru, followed by Uendo... ...and, lastly, Master Toneido.\nAthena:\nI see. So that's why you happened to be at the storytellers' theater yesterday. So what happened after you arrived?Blackquill:\nI went straight to Master Toneido's dressing room to say hello.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nAnd how did Master Toneido appear when you said hello to him?\nBlackquill:\nI went with the intention of greeting him, but ultimately, we didn't actually meet.\nAthena:\nY-You didn't see him? Why not?\nBlackquill:\nGeiru escorted me to the dressing room... ...but we heard the sound of rakugo being performed from within. Thinking the master was rehearsing, we decided to wait in the hall until he was done.\nAthena:\nYou heard rakugo being performed in the dressing room?\nBlackquill:\nYes. Not just me, but Geiru as well.\nNahyuta:\nIn other words, you can confirm that the victim was still alive at around 4 PM?\nBlackquill:\nCorrect. I couldn't hear him clearly through the doors, but I'm sure it was Master Toneido. I could tell because it was the \"Time Soba\" routine being performed in there.\nAthena:\n(Hmm... So that means the victim was killed sometime after that...)Blackquill:\nBucky went into the dressing room thereafter, only to come storming out a while later.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nPlease tell us in detail how Mr. Whet appeared at the time.\nBlackquill:\nGeriu and I were waiting in the hallway for Master Toneido to finish practicing... when Bucky appeared and entered the dressing room with his things.\nAthena:\nWhat happened after that?\nBlackquill:\nWe heard what sounded like Bucky shouting inside the room. About ten minutes later, Bucky came back out of the dressing room looking rather irate.\nNahyura:\nThis is most likely when the murder was committed. The victim was an elderly man. It would've been entirely possible to kill within the span of ten minutes.\nAthena:\n(Arngh...! I'd better come up with some kind of counterargument, and fast!)Blackquill:\nMaster Toneido's junior disciple, Uendo, apparently then entered the room soon after.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nWhat do you mean by \"apparently\"? Didn't you see him go in?\nBlackquill:\nNo, I couldn't. I wasn't able to see the dressing room door from where I was standing at the time. But Geiru was right in front of it, so I'm sure she saw it all.\nAthena:\nI-I see. And why do you suppose Uendo went to the dressing room anyway?\nBlackquill:\nHe had just finished his routine, so he was making a courtesy call. A disciple is to pay their master respect tight before and after each performance.\nAthena:\nAnd all disciples are expected to do this?\nBlackquill:\nYes, it's common courtesy among rakugo artists.\nAthena:\nI see. Could you tell us what happened after Uendo went into the dressing room?\nBlackquill:\nCertainly.Blackquill:\nThat's when Uendo discovered Master Toneido's body.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nAnd how did Uendo act at the time?\nBlackquill:\nAfter Uendo had been in the dressing for two or three minutes... ...we heard a scream from inside the room, and Uendo came flying out.\nAthena:\nDid you hear any signs of a struggle at that time?\nBlackquill:\nNo, just Uendo's woeful scream.\nAthena:\nI-I see...Athena:\n(Simon has no reason to lie, but I also don't have much to go on. I'd better ask all the questions I can.)"
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "From 4 PM to a little after 4:20 PM, when Shisho's body was found...",
          "person": "Geiru",
          "present": []
        },
        {
          "testimony": "...Simon and I were standing in the hallway in front of the dressing room.",
          "person": "Geiru",
          "present": []
        },
        {
          "testimony": "Before Uendo discovered the body, the only person who had gone in there was Bucky.",
          "person": "Geiru",
          "present": []
        },
        {
          "testimony": "Come to think of it, a little while before Bucky showed up, Jugemu was barking like mad!",
          "person": "Geiru",
          "present": []
        },
        {
          "testimony": "I was in the yard, but the door was wide open, so I could keep watch on the dressing room.",
          "person": "Geiru",
          "present": [
            "Backstage Diagram"
          ]
        }
      ],
      "noPresent": false,
      "newContext": "-- What Simon Saw --Blackquill:\nI went to the theater yesterday, and arrived at... approximately 4 PM.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nProsecutor Blackquill, what did you go to the theater for in the first place?\nBlackquill:\nI went because I had received an invitation from Master Toneido. Here, see for yourself. It was a special show commemorating his junior disciple Uendo's promotion. It was also an occasion to announce the boy's succession to the stage name of \"Uendo II.\"\nAthena:\nUm, so what exactly does it mean to \"succeed to a stage name\"?\nBlackquill:\nHmph. You really don't know, do you? In the performing arts, a name succession is when an artist inherits a predecessor's name.\nAthena:\nI see. So there was another \"Uendo\" rakugo artist before, and this disciple succeeded him, huh. And what did your invitation say?\nBlackquill:\nIt contained a simple letter of salutations, and an outline of the show's program.\nJudge:\n...Oh! It appears Taifu Toneido was going to perform \"Tokisoba,\" or \"Time Soba.\" He's famous for his masterful pantomime of eating soba, using only his fan as a prop. And Uendo was to peform \"Soba Sei,\" or \"Soba Glutton.\" A soba-themed show, I see!\nBlackquill:\nIt seems you know a thing or two about rakugo yourself, Your Baldness. The first to perform was the senior disciple, Geiru, followed by Uendo... ...and, lastly, Master Toneido.\nInvitation added to Court Record.\nAthena:\nI see. So that's why you happened to be at the storytellers' theater yesterday. So what happened after you arrived?Press (subsequent times)\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nProsecutor Blackquill, what did you go to the theater for in the first place?\nBlackquill:\nI went because I had received an invitation from Master Toneido. Here, see for yourself. It was a special show commemorating his junior disciple Uendo's promotion. It was also an occasion to announce the boy's succession to the stage name of \"Uendo II.\"\nAthena:\nUm, so what exactly does it mean to \"succeed to a stage name\"?\nBlackquill:\nHmph. You really don't know, do you? In the performing arts, a name succession is when an artist inherits a predecessor's name.\nAthena:\nI see. So there was another \"Uendo\" rakugo artist before, and this disciple succeeded him, huh. And what did your invitation say?\nBlackquill:\nIt contained a simple letter of salutations, and an outline of the show's program.\nJudge:\n...Oh! It appears Taifu Toneido was going to perform \"Tokisoba,\" or \"Time Soba.\" He's famous for his masterful pantomime of eating soba, using only his fan as a prop. And Uendo was to peform \"Soba Sei,\" or \"Soba Glutton.\" A soba-themed show, I see!\nBlackquill:\nIt seems you know a thing or two about rakugo yourself, Your Baldness. The first to perform was the senior disciple, Geiru, followed by Uendo... ...and, lastly, Master Toneido.\nAthena:\nI see. So that's why you happened to be at the storytellers' theater yesterday. So what happened after you arrived?Blackquill:\nI went straight to Master Toneido's dressing room to say hello.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nAnd how did Master Toneido appear when you said hello to him?\nBlackquill:\nI went with the intention of greeting him, but ultimately, we didn't actually meet.\nAthena:\nY-You didn't see him? Why not?\nBlackquill:\nGeiru escorted me to the dressing room... ...but we heard the sound of rakugo being performed from within. Thinking the master was rehearsing, we decided to wait in the hall until he was done.\nAthena:\nYou heard rakugo being performed in the dressing room?\nBlackquill:\nYes. Not just me, but Geiru as well.\nNahyuta:\nIn other words, you can confirm that the victim was still alive at around 4 PM?\nBlackquill:\nCorrect. I couldn't hear him clearly through the doors, but I'm sure it was Master Toneido. I could tell because it was the \"Time Soba\" routine being performed in there.\nAthena:\n(Hmm... So that means the victim was killed sometime after that...)Blackquill:\nBucky went into the dressing room thereafter, only to come storming out a while later.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nPlease tell us in detail how Mr. Whet appeared at the time.\nBlackquill:\nGeriu and I were waiting in the hallway for Master Toneido to finish practicing... when Bucky appeared and entered the dressing room with his things.\nAthena:\nWhat happened after that?\nBlackquill:\nWe heard what sounded like Bucky shouting inside the room. About ten minutes later, Bucky came back out of the dressing room looking rather irate.\nNahyura:\nThis is most likely when the murder was committed. The victim was an elderly man. It would've been entirely possible to kill within the span of ten minutes.\nAthena:\n(Arngh...! I'd better come up with some kind of counterargument, and fast!)Blackquill:\nMaster Toneido's junior disciple, Uendo, apparently then entered the room soon after.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nWhat do you mean by \"apparently\"? Didn't you see him go in?\nBlackquill:\nNo, I couldn't. I wasn't able to see the dressing room door from where I was standing at the time. But Geiru was right in front of it, so I'm sure she saw it all.\nAthena:\nI-I see. And why do you suppose Uendo went to the dressing room anyway?\nBlackquill:\nHe had just finished his routine, so he was making a courtesy call. A disciple is to pay their master respect tight before and after each performance.\nAthena:\nAnd all disciples are expected to do this?\nBlackquill:\nYes, it's common courtesy among rakugo artists.\nAthena:\nI see. Could you tell us what happened after Uendo went into the dressing room?\nBlackquill:\nCertainly.Blackquill:\nThat's when Uendo discovered Master Toneido's body.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nAnd how did Uendo act at the time?\nBlackquill:\nAfter Uendo had been in the dressing for two or three minutes... ...we heard a scream from inside the room, and Uendo came flying out.\nAthena:\nDid you hear any signs of a struggle at that time?\nBlackquill:\nNo, just Uendo's woeful scream.\nAthena:\nI-I see...Athena:\n(Simon has no reason to lie, but I also don't have much to go on. I'd better ask all the questions I can.)After pressing all statements:Judge:\nHmm... Well done, Prosecutor Blackquill. Your testimony has given us quite a glimpse into the sequence of events.Nahyuta:\nThank you, Prosecutor Blackquill. And now, please allow me to summairze your testimony. While Prosecutor Blackquill and Geiru were in the hallway waiting for Master Toneido... ...the accused came along and entered the dressing room with some items in tow. He was heard shouting for a time inside the dressing room. About ten minutes later, he came back out of the room, seeming rather angry. A short time after the accused had come and gone, Uendo Toneido went into the room. A few minutes later, after having discovered the victim's body, Uendo gave a scream... ...and came running out into the hallway from within. Prosecutor Blackquill and Geiru then ran into the room and saw the body for themselves. From the circumstances, it is quite clear that the accused murdered the victim.Judge:\nHmm... This is crucial testimony indeed.Simon's Statement added to the Court Record.Nahyuta:\nDefense. An eyewitness has given conclusive testimony. Why not let it all go now, and allow the victim his last rites?Athena:\nNot on your life! If Uendo went into the dressing, too, and was the first to discover the body... then who's to say HE didn't commit the crime!Nahyuta:\nUendo was in the dressing room for a mere two, perhaps three minutes. He could not have possibly committed the murder in that time, nor without making any noise.Athena:\n(Ooh, Simon! Why did you have to give that awful testimony!) Prosecutor Blackquill! Can't you give me something a little better to work with here?!Blackquill:\nIsn't it up to you to ask the right questions? I am certainly willing to tell you all that I know. So, if you are truly capable as you claim, then draw out what you need yourself!Athena:\nThis is no time for your twisted games, Prosecutor Blackquill! Just admit that you don't remember it all that well!Nahyuta:Nahyuta:\n\nProsecutor Blackquill... Watching you collude with the defense like this, I see that you are no prosecutor. Be gone, witness! You shall haunt this sacred hall no more!Blackquill:\nHmph. How dare you treat me like some evil spirit to be exorcised. I'll remember this, you blackguard...Athena:\nDon't worry, Prosecutor Blackquill. I've got this!Nahyuta:\nWould I have my way, he would not be the only one here to step down... you half-boiled, putrid egg yolk!Athena:\n(Eww... I object to the notion that I'm a gooey, smelly mess!)Nahyuta:\nProsecutor Blackquill's testimony was like the lowly opening act of a rakugo show. He may hold the title \"prosecutor,\" but this time, he stood on the side of the defense. To restore balance to this trial, I would like to present an actual witness for the prosecution.Judge:\nAnd who is this witness?Nahyuta:\nThe person who was with Prosecutor Blackquill when the body was discovered. She is another entertainer of the Toneido School: Ms. Geiru Toneido.Judge:\nPlease state your name and occupation, witness.Geiru:\nHello, everyone! I'm here to represent the Toneido School with a twisty, twist, twiiist! And BLOOOON! There you have it! A stunning balloon hat! It's me! The balloon artist you all know and love, Geeeiru Toneidoooo! Just call me Geiru, sweetie! One, two... BLOOOON!Judge:\nWh-What a way to capture your audience's attention! I daresay I can't take my eyes off those balloons!Athena:\nPlease tell me you're talking about the hat, Your Honor...Geiru:\nOh Mister Judgey! I'm so glad you liked my performance! Would you consider joining my fan club? Pwetty pwease?Judge:\nOh, absolutely!Athena:\nAnd please save your fanboying for after the trial, Your Honor... Anyway, Geiru... I can't help but notice, you seem awfully cheerful for having just lost your master.Geiru:\nOf course I'm sad... But Shisho would scold me if I didn't put on a big smile. Never show sadness! Smile, smile, smile! With a twisty, twist, twiiist! And BLOOOON! There you have it! One gorgeous cake!Athena:\nI-I see. I guess an entertainer's gotta do what an entertain's gotta do... (Her balloon art's worse than a Rorschach test. All I saw was a severed monster head...) Geiru, you're obviously a balloon artist. So how did you come to be a member of a rakugo school?Geiru:\nWell, my father -- my late father, that is -- was a rakugo artist, you see... So I joined the Toneido School to be just like my daddy someday!Athena:\nI see.Geiru:\nMy father and I owe so much to Shisho, our master! But that Bucky Whet... Oooooh, how could he?! I want to see him pay for what he's done as quickly as possible!Judge:\nYour distress is entirely understandable. And my condolences for your loss.Geiru:\nAnd, and, not only that, but he...Athena:\nY-You have more to say about Mr. Whet?Geiru:\nEvery time he comes to deliver soba to us, he yells at me! He always tells me to \"get away!\"Athena:\nIs there any reason why he would say such a thing to you?Geiru:\nHe says the smell of my perfume will get into his soba and ruin it! Like, how can he say that?! This is a greaaaat scent!Judge:\nHmph! How very rude of him. I don't blame you for being upset.Athena:\nExcuse me, Your Honor! But please don't let Geiru's \"balloons\" bias your judgement! Mr. Whet hasn't been proven guilty yet, remember?!Nahyuta:\nHmph. It will be interesting to see how long that fire of yours will last, defense. Now, then, Geiru. Please share the truth with this court.Judge:\nYes, Geiru. Your testimony please.Witness Testimony-- Before the Murder Was Discovered --Geiru:\nFrom 4 PM to a little after 4:20 PM, when Shisho's body was found...\n...Simon and I were standing in the hallway in front of the dressing room.\nBefore Uendo discovered the body, the only person who had gone in there was Bucky.\nCome to think of it, a little while before Bucky showed up, Jugemu was barking like mad!Nahyuta:\nProsecutor Blackquill, do you have any objections to this witnesses's testimony?Blackquill:\n........No. Tsk! Make up your bloody mind, Sad Monk Sahdmadhi. First you exorcise me, now this.Nahyuta:\nHmph. You only do as you are instructed by this humble servant of the Holy Mother. As there are no objections, Your Honor, let us move on to the salvation of the victim's soul.Athena:Athena:\nHey! I'M the defense attorney here, Prosecutor Sahdmadhi! And I might have an objection or two once I ACTUALLY cross-examine the witness! So what are you asking Prosecutor Blackquill for?! I'M the one you should be checking with!Nahyuta:\nThere is a passage in the sacred scriptures of Khura'inism. \"To stir the wind is beyond the power of a spring chick.\" In other words, the inexperienced are useless. With that in mind, it seemed more judicious to consult with Prosecutor Blackquill.Blackquill:\nHa ha ha! He doesn't even see you as an adversary, Cykes-dono!Athena:\nWell, I won't let either one of you insult me! I'll show you I'm no inexperienced \"spring chick\"! Your Honor! I'm ready to cross-examine the witness!Judge:\nHmm... I hope you can make Prosecutor Sahdmadhi see you as a worthy adversary, Ms. Cykes. I'll allow your cross-examination, so you'd better strike while the iron is hot!Cross ExaminationCross Examination-- Before the Murder Was Discovered --Geiru:\nFrom 4 PM to a little after 4:20 PM, when Shisho's body was found...Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSo the murder must've happened sometime in those twenty minutes, correct? But twenty minutes isn't a lot of time, is it?\nGeiru:\nI don't know... I mean, what do you want me to saaay? That's what happened, y'know? Isn't that right, Simon?\nBlackquill:\nYes. Geiru and I can both confirm that Master Toneido still lived at around 4 PM.\nAthena:\nOh, yeah... You can, can't you?\nGeiru:\nSeeeee!Geiru:\n...Simon and I were standing in the hallway in front of the dressing room.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThe fact that the two of you were there in front of the dressing room... ...means you were able to see everyone who went in and out, right?\nGeiru:\nOf course! O-Or are you insinuating... ...that I was daydreaming or sleeping while standing up or something?\nAthena:\nNo, of course not...\nGeiru:\nI saw everything, I tell you!\nAthena:\nF-Fine. (So you say, anyway. But did you really?)Geiru:\nBefore Uendo discovered the body, the only person who had gone in there was Bucky.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nOnly the defendant and Uendo entered around the time of the murder?\nGeiru:\nThat's right! That's why it must've been Bucky who... who killed poor Shishooo...!\nAthena:\nUm, let's take a deep breath, okay, Geiru? So not a single person set foot into the dressing room during that time?\nGeiru:\nI already told you over and over, didn't I? There was nobody else.\nNahyuta:\nI must apologize on the lawyer's behalf. Even her memory is that of a spring chick's. Please overlook her transgression as best you can.\nGeriu:\nOh, I see... Poor thing! Hang in there, sweetie!\nAthena:\n(Hey! Who are you calling a birdbrain, buddy!)Geiru:\nCome to think of it, a little while before Bucky showed up, Jugemu was barking like mad!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\n\"Jugemu\"?\nGeiru:\nThats my doggie! I keep him at the theater. Let's see... With a twisty, twist, twiiist! And BLOOOON! There you have it! My cute widdle Judgemu!\nAthena:\nHe's... kinda creepy looking...\nGeiru:\nOh, but he's a really, really good boy!\nAthena:\nA-And why was Jugemu barking? Do you think it's because he saw someone suspicious? If so, then we'd have a new suspect in this case.\nGeiru:\nHmm... Now, why was he barking again...? Oh, I remember! Because it was time for me to feed him! So I went into his yard and gave him some food.\nAthena: \nCouldn't somebody have slipped into the dressing room while you were doing that?\nGeiru:\nNope, the door out into the yard was wiiide open. I would've seen if anybody went into the dressing room.\nAthena:\nProsecutor Blackquill, come down to the stand for a sec... please!\nBlackquill:\nHmph. How many times must I do this?\nAthena:\nYou saw what Geiru was talking about, right? So why didn't you mention it before?!\nBlackquill:\nHmph! I can't be expected to remember every minute detail!\nAthena:\nWell, remember them now -- please! Did Geiru go out into the yard?\nBlackquill:\nYes. I remember now that she went to feed Jugemu. And I saw her looking towards the dressing room quite frequently as well.\nAthena:\nDo you recall anything else?\nBlackquill:\nIt looked as though she were feeding the dog a great quantity of dumplings or something. Jugemu couldn't finish them all, so he buried the rest in a corner of the yard. That's about all I can remember.\nSimon's Statement updated in the Court Record.\nAthena:\n(Hmm... It looks like Geiru was telling the truth.) Your Honor, I'd like Geiru's last statement added to her testimony.\nJudge:\nAs you wish, defense.\nChanges statement from \"Come to think of it, a little while before Bucky showed up, Jugemu was barking like mad!\" to \"I was in the yard, but the door was wide open, so I could keep watch on the dressing room.\"Geiru:\nI was in the yard, but the door was wide open, so I could keep watch on the dressing room.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nYou know what this means, right, Geiru? You weren't in the hallway the entire time after all, were you?\nGeiru:\nWell, okay, so I did go out into the yard, but it was just for a second. And the yard door was wide open, so I could still see the dressing room the whole time.\nAthena:\n(The door was open, so she could still see the dressing room?) Prosecutor Blackquill, I need you on the stand again -- please!\nBlackquill:\nWhat am I, your lady-in-waiting?\nAthena:\nDo you remember anything about the time Geiru was in the yard?\nBlackquill:\nSimply that Jugemu buried the food he couldn't finish in a corner of the yard. That's about all I can remember.\nAthena:\nThank you. (I didn't really need to her about the dog again, though...)\nGeiru:\nWhen I finished feeding Jugemu, I returned to the hallway. And then, I saw Bucky go into the dressing room! No question about it!Present Backstage Diagram\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"So, you were able to keep an eye on the dressing room while you were out in the yard.\"Athena:\n(Okay, so, around the time of the murder... Geiru and Simon were hanging out just outside the dressing room. Guess I'm going to have to find a flaw in there somehow if I want to get anywhere.)"
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "I noticed Shisho's dying message right away.",
          "person": "Uendo",
          "present": []
        },
        {
          "testimony": "The stiff cards were right next to the stiff, you see?",
          "person": "Uendo",
          "present": []
        },
        {
          "testimony": "Hey now, enough with the silly puns already! Hee hee!",
          "person": "Uendo",
          "present": []
        },
        {
          "testimony": "Anyway, I got the meaning right away. I knew it must've been talking about Bucky!",
          "person": "Uendo",
          "present": []
        },
        {
          "testimony": "That was the master's final message, left as he was drowning in soba broth.",
          "person": "Uendo",
          "present": [
            "Taifu's Autopsy Report"
          ]
        },
        {
          "testimony": "It's so like Shisho not to write Bucky's name outright. \"Plain and simple\" wasn't his style.",
          "person": "Uendo",
          "present": []
        }
      ],
      "noPresent": false,
      "newContext": "-- Before the Murder Was Discovered --Geiru:\nFrom 4 PM to a little after 4:20 PM, when Shisho's body was found...Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSo the murder must've happened sometime in those twenty minutes, correct? But twenty minutes isn't a lot of time, is it?\nGeiru:\nI don't know... I mean, what do you want me to saaay? That's what happened, y'know? Isn't that right, Simon?\nBlackquill:\nYes. Geiru and I can both confirm that Master Toneido still lived at around 4 PM.\nAthena:\nOh, yeah... You can, can't you?\nGeiru:\nSeeeee!Geiru:\n...Simon and I were standing in the hallway in front of the dressing room.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThe fact that the two of you were there in front of the dressing room... ...means you were able to see everyone who went in and out, right?\nGeiru:\nOf course! O-Or are you insinuating... ...that I was daydreaming or sleeping while standing up or something?\nAthena:\nNo, of course not...\nGeiru:\nI saw everything, I tell you!\nAthena:\nF-Fine. (So you say, anyway. But did you really?)Geiru:\nBefore Uendo discovered the body, the only person who had gone in there was Bucky.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nOnly the defendant and Uendo entered around the time of the murder?\nGeiru:\nThat's right! That's why it must've been Bucky who... who killed poor Shishooo...!\nAthena:\nUm, let's take a deep breath, okay, Geiru? So not a single person set foot into the dressing room during that time?\nGeiru:\nI already told you over and over, didn't I? There was nobody else.\nNahyuta:\nI must apologize on the lawyer's behalf. Even her memory is that of a spring chick's. Please overlook her transgression as best you can.\nGeriu:\nOh, I see... Poor thing! Hang in there, sweetie!\nAthena:\n(Hey! Who are you calling a birdbrain, buddy!)Geiru:\nCome to think of it, a little while before Bucky showed up, Jugemu was barking like mad!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\n\"Jugemu\"?\nGeiru:\nThats my doggie! I keep him at the theater. Let's see... With a twisty, twist, twiiist! And BLOOOON! There you have it! My cute widdle Judgemu!\nAthena:\nHe's... kinda creepy looking...\nGeiru:\nOh, but he's a really, really good boy!\nAthena:\nA-And why was Jugemu barking? Do you think it's because he saw someone suspicious? If so, then we'd have a new suspect in this case.\nGeiru:\nHmm... Now, why was he barking again...? Oh, I remember! Because it was time for me to feed him! So I went into his yard and gave him some food.\nAthena: \nCouldn't somebody have slipped into the dressing room while you were doing that?\nGeiru:\nNope, the door out into the yard was wiiide open. I would've seen if anybody went into the dressing room.\nAthena:\nProsecutor Blackquill, come down to the stand for a sec... please!\nBlackquill:\nHmph. How many times must I do this?\nAthena:\nYou saw what Geiru was talking about, right? So why didn't you mention it before?!\nBlackquill:\nHmph! I can't be expected to remember every minute detail!\nAthena:\nWell, remember them now -- please! Did Geiru go out into the yard?\nBlackquill:\nYes. I remember now that she went to feed Jugemu. And I saw her looking towards the dressing room quite frequently as well.\nAthena:\nDo you recall anything else?\nBlackquill:\nIt looked as though she were feeding the dog a great quantity of dumplings or something. Jugemu couldn't finish them all, so he buried the rest in a corner of the yard. That's about all I can remember.\nSimon's Statement updated in the Court Record.\nAthena:\n(Hmm... It looks like Geiru was telling the truth.) Your Honor, I'd like Geiru's last statement added to her testimony.\nJudge:\nAs you wish, defense.\nChanges statement from \"Come to think of it, a little while before Bucky showed up, Jugemu was barking like mad!\" to \"I was in the yard, but the door was wide open, so I could keep watch on the dressing room.\"Geiru:\nI was in the yard, but the door was wide open, so I could keep watch on the dressing room.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nYou know what this means, right, Geiru? You weren't in the hallway the entire time after all, were you?\nGeiru:\nWell, okay, so I did go out into the yard, but it was just for a second. And the yard door was wide open, so I could still see the dressing room the whole time.\nAthena:\n(The door was open, so she could still see the dressing room?) Prosecutor Blackquill, I need you on the stand again -- please!\nBlackquill:\nWhat am I, your lady-in-waiting?\nAthena:\nDo you remember anything about the time Geiru was in the yard?\nBlackquill:\nSimply that Jugemu buried the food he couldn't finish in a corner of the yard. That's about all I can remember.\nAthena:\nThank you. (I didn't really need to her about the dog again, though...)\nGeiru:\nWhen I finished feeding Jugemu, I returned to the hallway. And then, I saw Bucky go into the dressing room! No question about it!Present Backstage Diagram\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"So, you were able to keep an eye on the dressing room while you were out in the yard.\"Athena:\n(Okay, so, around the time of the murder... Geiru and Simon were hanging out just outside the dressing room. Guess I'm going to have to find a flaw in there somehow if I want to get anywhere.)Athena:\nSo, you were able to keep an eye on the dressing room while you were out in the yard. Is that correct?Geiru:\nThat's right. The door out into the yard was wide open.Athena:\nSorry, but that makes zero sense. Take a look at this diagram of the backstage area. There is a clear contradiction between this diagram and the witnesses's testimony!Judge:\nOh...? I'm afraid I don't understand, Ms. Cykes. Please point out what contradicts the witness's testimony.Present doorway in yard\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Geiru was in the yard near the doghouse. Prosecutor Blackquill even saw her there.\"Present anywhere else\n\n\n\n\n\n\n\nAthena:\n\nGeiru:\nUm... Difficult ideas make my head hurt... ...but it's easy to see your head must be as light and empty as this balloon!\nJudge:\nHmm... I'm afraid I don't see anything contradictory about that spot, either. A heavy penalty for lightweight thinking!\nAthena:\nUrk. I-I promise to point out the contradiction this time, Your Honor!\nJudge:\nVery well. Now then...\nLeads back to:\n\"Please point out what contradicts the witness's testimony.\"Athena:\nGeiru was in the yard near the doghouse. Prosecutor Blackquill even saw her there. And while she was out there, the door to the yard had been left open.Judge:\nAh! I see!Athena:\nYes, if the door to the yard was \"wide open,\" as Geiru said... ...it would've blocked her view, making it impossible for her to see the dressing room!Geiru:\nWhat?! No waaay!Nahyuta:\nBut even if there were admittedly a few moments Geiru was not keeping watch... ...how much would that really affect this case?Athena:\nIt would greatly affect the case! From the spot Prosecutor Blackquill stood, he couldn't see the dressing room door, either. Anyone could have entered the dressing room during that time without being seen!Geiru:\nEeeeeek!Athena:\nGeiru, why did you try to hide the fact that you weren't watching the dressing room?Geiru:\nWhat? I-I-I...Nahyuta:Nahyuta:\n\"Hide the fact\"? You speak as though you think she had something to do with the murder. Rather than a deliberate deception, it was more likely a simple oversight. Right, witness?Geiru:\nWell... I... I was so shocked by what happened I was just confused, that's all.Nahyuta:\nEven though she is trying to keep up a brave front as an entertainer... ...the truth is that she is being torn apart by grief. For her mind to be in turmoil is hardly unexpected.Judge:\nYes, it must be very difficult, indeed.Nahyuta:\nTo a disciple, one's master is akin to a real parent. Surely, her shock is immense. The way this lawyer tries to pin the blame on this poor soul at first opportunity... All I can say is... defense attorneys are heartless creatures indeed.Athena:\nBut I wasn't...! That was't what I was trying to do...!Nahyuta:\nIs it beyond your comprehension, defense? Your unskilled argument is scarring this witness even further. And if we ask the people of this courtroom, I am sure they would agree.Athena:\nWhat?! The gallery doesn't get a say in this!Nahyuta:\nAre you afraid to find out that they think ill of you? Or perhaps you are in the wrong? Listen to them now with that keen sense of hearing you are so proud of.Gallery:He's right. That was harsh. She didn't have to go that far!I feel kind of sorry for the witness... And why is the lawyer's outfit so yellow?Athena:\nN-No... I was just trying... to find the truth... (Why is the whole gallery siding with Prosecutor Sahdmadhi?)Nahyuta:\nThe people understand... They know what is right, and what is wrong.Gallery:That lawyer's still in training, isn't she? Why is she all by herself?Athena:\n(I hear the voices of the gallery... I can hear the voices of their hearts...! It's so intense... I feel so alone up here, fighting by myself...)Nahyuta:\nAre you afraid, child? It is ludicrous to come to a trial with such paltry preparation of the soul! I command you to leave this courtroom at once!Athena:\n(B-But I can't give up... I have to... I have to... keep pressing on...) As long as there was a moment when nobody was watching the dressing room door... ...the defendant can't be convicted solely on Prosecutor Blackquill and Geiru's testimonies!Nahyuta:\nHmph. Even now, you would continue to resist? You are childish in defeat as well, I see.Athena:\nI'm not out for the count yet, buster! I'm just getting started!Nahyuta:\nDespite your posturing, is it not true that your resolve could crumble at any moment? With a little push, you would surely succumb to despair. A little push such as with this piece of conclusive evidence.Athena:\n\"C-conclusive evidence,\" huh?Nahyuta:\nThat is correct. We found a critical piece of evidence at the scene of the crime: The victim's dying message, which clearly implicates the accused, Bucky Whet! Look at these Japanese playing cards -- known as \"karuta\" -- lined up on the table. These special English-version karuta cards spell out a message. That message: \"WHET NO 4.\"Athena:\n\"WHET NO 4\"...? Y-You mean, \"Whet Noodle No. 4\"?!Nahyuta:\nYes, \"Whet Noodle No. 4,\" as the fourth head chef of Whet Soba is also known. The message points to none other than the accused, Bucky Whet!Athena:\nNoooooooooooo!Judge:\nTh-That makes perfect sense, doesn't it!Geiru:\nWow! Great job, Mr. Prosecutor!Athena:\n(Oh, no! This is really, really bad! What do I do, what do I do?!)Crime Scene Report updated in the Court Record.Nahyuta:\nWould you still carry on your futile fight in the face of this irrefutable evidence?Athena:\nY-You can say whatever you want, but we won't know until we--Nahyuta:Nahyuta:\nIt is cruel to give the accused false hope. You will only compound his suffering. Wise people of the courtroom, do you not agree?Gallery:He's right. It's cruel to make him suffer when there's conclusive evidence.What an incompetent newb! I feel bad for the victim AND the defendant!Athena:\n(Wh-What?! But I'm trying to prove Mr. Whet's innocence here!)Nahyuta:\nI know you can hear them, defense. Their voice implore you to save the accused's soul. It is time for you to let it go, and move on, you inexperienced lawyer. You lack the competence with which to accomplish anything meaningful here!Athena:\n(I-Is he right? Is this too much for me to handle on my own?)Gallery:What good is she doing anybody? She should just quit right now!Athena:\n(Grrnngh...)Nahyuta:\nNow, defense. Leave everything to this humble servant of the Holy Mother.???:Blackquill:\nHe's trying to use your keen sense of hearing against you to manipulate the trial, Athena. What a cheap trick for a supposedly holy man.Athena:\nS-Simon...!Blackquill:\nAnd you fopdoodles in the gallery! Can't a man watch a trial in peace?! This inexperienced amateur is about to turn the trial around!Gallery:Does that prosecutor really think she can turn things around...?Athena:\n(The mood in this courtroom is starting to change!)Judge:\nProsecutor Blackquill! What are you doing at the defense's bench?!Blackquill:\nHmph. I grew bored of watching from the gallery. Besides, if I were to leave this trial to this spring chick... ...and lose my favorite soba shop in the process, I will be quite cross.Nahyuta:\nYou voluntarily stand on the side of impurity and sin? Truly, what a fool you are.Blackquill:\nTo think, you were so easily manipulated by his parlor tricks... What happened to \"qualified and capable,\" Athena?Athena:\nI-I just let my guard down a little bit! But it won't happen again!Blackquill:\nHmph. Then gird up your loins, and steel yourself for battle!Athena:\nI'm not girding up anything in this skirt! But I AM ready to get serious!Nahyuta:Nahyuta:\nIt seems there is now yet another soul I must cast down into hell...Blackquill:\nI was in prison for a long time. And \"hell\" sounds no worse than \"cell,\" to be honest.Nahyuta:\nAh, but the fires of hell will not be the end of your suffering. For the sin you have just committed, you shall surely be reborn as a panda in your next life. A white and black, reverse panda, that is. And you shall be put in a zoo, to be exposed to public ridicule.Athena:\nA threat like that won't work on Prosecutor Blackquill! After all, he's already used to looking like a panda in THIS life!Blackquill:\nWho are you calling a panda?!Athena:\nS-Sorry!Nahyuta:\nI see that you are both prepared to face the fires of damnation. Geiru, thank you for your service. You may step down now.Geiru:\nOkey-dokey! Bye-bye-ballooooon!Athena:\n(Does EVERYTHING have to be about balloons with her...?)Nahyuta:\nNow, then. I have a witness prepared to testify about the karuta cards.Judge:\nAnd who is the witness this time?Nahyuta:\nThe first to discover the body, and someone who witnessed the crime scene firsthand. Mr. Uendo Toneido. The time has come for that ponytailed pair over there to finally let it go, and move on.Judge:\nVery well. Let's bring in this witness, then.Judge:\nWitness, please state your name and occupation.Uendo:\nI am the rakugo storyteller Uendo Toneido. Even if my performance isn't worth watching, I will certainly watch my words. I wouldn't want to say anything thoughtless and get arrested. After all, that'd be... a \"raku-no-no\"! Hee hee! Thank you, everybody! Good night!Athena:Athena:\nYou can't leave yet! You've only just introduced yourself!Uendo:\nOh, my, my! Are you a fan of mine, miss? Would you like my autograph? One moment...Athena:\nOw! What do you think you're doing?!Uendo:\nNo need to stand on ceremony! My fan deserves a fan, after all. A \"fan\" for a \"fan\"! Nice one! Hee hee! Oh, why if it isn't Simon! How are you on this fine day, sir? Quite a dilly of a pickle we've found ourselves in, wouldn't you say?Blackquill:\nI don't believe I've ever seen you talk quite so much, Uendo.Uendo:\nNever performed in a place like this, y'know. I got butterflies here, can't you see? Hee hee!Athena:\n(Why do I always get the weird ones?)Judge:\nPardon me, witness. As much as I enjoy your banter, I believe we had better return to the case at hand.Uendo:\nAh, I suppose you're right. In that \"case\"... I was promoted to \"futatsume\" yesterday, and received the stage name of \"Uendo.\" The show was our way of celebrating my new name and \"middle rank\" standing! Hee! And then THAT happened... Haah... I never dreamed something like that'd happen, not in a million years. And just as I got my chance to start repaying my debt to Shisho, too... Yeah... Plus, I'm worried about Geiru... The way she clung to Shisho... Poor thing. I told her to keep a stiff upper lip... Stiff like rigor mortis... Keep telling those lame jokes, and Shisho'll come scold you from the grave! I wouldn't mind getting yelled at, you know, if it meant seeing him again.Athena:\nUendo, please... As charming as your various characters are, this isn't a rakugo stage.Nahyuta:\nLet us hear your testimony now, witness. Tell the court about the evidence left at the scene -- the proof of the accused's guilt.Witness Testimony-- Shisho's Dying Message --Uendo:\nI noticed Shisho's dying message right away.\nThe stiff cards were right next to the stiff, you see.\nHey now, enough with the silly puns already! Hee hee!\nAnyway, I got the meaning right away. I knew it must've been talking about Bucky!\nThat was the master's final message, left as he was drowning in soba broth.\nIt's so like Shisho not to write Bucky's name outright. \"Plain and simple\" wasn't his style.Judge:\nWell! That was certainly a more entertaining testimony than usual. The variety of characters performed by the witness was absolutely splendid!Athena:\nBut he shouldn't be performing any characters in the first place, Your Honor! And, Uendo! The murder weapon hasn't been determined yet! So how can you say that the victim was drowned in soba broth?!Uendo:\nIt's obvious. All you have to do is look at the crime scene. He was found with his face shoved in a bowl. It's only natural to assume he was drowned in the broth for the noodles!Athena:\nExcept we're not here to assume things, Uendo, so please stick to just the facts!Uendo:\nMy, my! It's so like a soba chef to kill someone this way, wouldn't you say? And with the karuta message he left behind, it's clear Bucky Whet did it!Judge:\nHmm... Setting aside the issue of the murder weapon for now... that dying message certainly does seem to be irrefutable evidence.Nahyuta:\nIndeed. It proves the absolute guilt of the accused.Athena:\nUrgh... Even I've gotta admit that I can't see how that message could mean anything else...Uendo:\nBucky used soba for the deed, all to get back the soba shop deed.Athena:\nNngh! (This testimony makes Mr. Whet look super guilty. I have to do something!)Blackquill:\nHmph. That's his \"conclusive evidence\"? What a farce!Athena:\nWhat do you mean, Simon?Blackquill:\nWhat's this? I thought you said you weren't planning on asking me for help?Athena:\nArngh...! I did, and I won't, thank you very much! (Simon must've found an inconsistency in the testimony. I'd better listen carefully, and try to see what he found!)Cross ExaminationCross Examination-- Shisho's Dying Message --Uendo:\nI noticed Shisho's dying message right away.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nUendo, when you saw the cards on the table... what made you think they were Master Toneido's dying message?\nUendo:\nWell, it was a coded message right there next to the body. I'm sure anybody would've thought that they were there to name his killer. I love murder mysteries, and often watch them on TV.\nAthena:\nO-Oh? I see.\nUendo:\nI saw a similar scene during a murder mystery marathon last Tuesday. That's what made me think, \"This must be a dying message!\"Uendo:\nThe stiff cards were right next to the stiff, you see?Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThe cards were on the table next to your master's body was slumped over, right? You must've been surprisingly calm to notice them at the time.\nUendo:\nAs I said, the stiff cards were right there next to the stiff, so they were hard to miss.\nAthena:\nBut wouldn't it have been more natural to notice the victim rather than the cards?\nUendo:\nThe message just caught my eye, because the stiff cards were right next to the stiff.\nAthena:\nYes, but the fact hardly seems significant enough to make a person take not of them.\nUendo:\nStiff cards... next to the stiff...\nAthena:\nSo basically, there was no real reason for them to catch your eye, was there?\nUendo:\n*sigh*...Uendo:\nHey now, enough with the silly puns already! Hee hee!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThat's right! I need you to give your testimony, not perform a scene! Please remember you're on the witness stand, not the stage!\nUendo:\nBut look at all these wonderful people in the audience! It's only natural for an entertainer to want them to have some fun! Hee hee! I guess we can let a few jokes slide, right?\nJudge:\nAh, the inevitable bleeding of your work into other areas of your life. I know how that is. I find myself being unwittingly judgemental in my personal life, too.\nUendo:\nRight, right! That's exactly what I'm talking about! Well done, Your Honor! Guess you can't judge a judge by his cover!\nJudge:\nHo ho ho. I advise the defense not to be so critical of the witness.\nAthena:\nY-Yes, Your Honor.\nUendo:\nMuch obliged! Hee hee!Uendo:\nAnyway, I got the meaning right away. I knew it must've been talking about Bucky!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThe cards DO spell out \"WHET NO 4\"... which COULD be interpenetrated as \"Whet Noodle No. 4,\" I guess... I suppose you took this to mean Bucky Whet?\nUendo:\nThere's only one \"Whet Noodle\" around here, and you've seen that giant \"4\" on his back. It's the only interpenetration that makes sense!\nAthena:\nYeah, I guess so... But wait a minute!\nUendo:\nWh-What is it?!\nAthena:\nWhat if there's another \"Whet Noodle\" in the area! Wh-What? Did I say something strange?\nBlackquill:\nBucky is the sole heir to the shop. So enough with the ludicrous straw grasping!\nAthena:\nH-Hey! How was I supposed to know...?\nBlackquill:\nJust listen to the testimony again, and find the glaring inconsistency.Uendo:\nThat was the master's final message, left as he was drowning in soba broth.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSo the victim lined up those cards in his final moments? How can you be so certain that's how it went down?!\nUendo:\nI know Shisho. He would never let someone get the last word on him, even in death. With his face in soba broth, and his consciousness fading away... ...he left a message that pointed toward Bucky as he left this world. It's the only way it could've happened!\nAthena:\nWait! \"The only way\"?! Now you're just speculating!\nUendo:\nLook, a dying message is something you leave as you're dying, right? I saw a scene like that in a detective show.\nNahyuta:\n\nNahyuta:\nUendo, we have a saying in my country: \"Silence is more precious than diamonds.\" Please do not speak any more than is necessary.\nUendo:\nBut talking is my livelihood, you know. I talk all the time. This and that, truths and untruths... I can't stop myself from talking!\nAthena:\n(Hopefully, he'll stick to \"truths\" without any of those \"untruths\"...)Present Taifu's Autopsy Report\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"There's a contradiction in Uendo's testimony!\"Uendo:\nIt's so like Shisho not to write Bucky's name outright. \"Plain and simple\" wasn't his style.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nBut don't you think it's strange? Could a dying person... ...really leave such a convoluted message...?\nUendo:\nEven in the throes of death, it was in Shisho's nature to throw in a twist somehow. Truly the consummate entertainer till the very end, don't you think?\nAthena:\nWas he really that great of a man, Simon?\nBlackquill:\nIt would've been no easy task, to be sure. But who knows? He wasn't an entertainer for fifty-five years for nothing.\nUendo:\nIf I ever bite the big one like that... ...I wanna leave a dying message as good as Shisho's! Hee hee!\nAthena:\nWell, let's hope it never comes to that...Athena:\nS-Simon, are all rakugo artists like this?Blackquill:\nHmph. It's hard to say. It could simply be the eccentricity of an entertainer, or perhaps he's hiding something.Athena:\n(Well, he doesn't have to entertain people in a court of law. And if he IS trying to hide something, maybe it'll show up as a contradiction or something.)"
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "I was onstage until just moments before I went into the dressing room.",
          "person": "Uendo",
          "present": []
        },
        {
          "testimony": "The entire audience was my witness.",
          "person": "Kisegawa",
          "present": []
        },
        {
          "testimony": "But my performance was a huge bust. Not a single soul laughed!",
          "person": "Patches",
          "present": []
        },
        {
          "testimony": "I'll never be able to live down how terribly I bombed during that very important show.",
          "person": "Uendo",
          "present": []
        },
        {
          "testimony": "I think there must have been fifty, maybe sixty people in the audience.",
          "person": "Uendo",
          "present": []
        },
        {
          "testimony": "The story I performed is called \"Tokisoba\" -- otherwise known as \"Time Soba.\"",
          "person": "Uendo",
          "present": [
            "Invitation"
          ]
        }
      ],
      "noPresent": false,
      "newContext": "-- Shisho's Dying Message --Uendo:\nI noticed Shisho's dying message right away.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nUendo, when you saw the cards on the table... what made you think they were Master Toneido's dying message?\nUendo:\nWell, it was a coded message right there next to the body. I'm sure anybody would've thought that they were there to name his killer. I love murder mysteries, and often watch them on TV.\nAthena:\nO-Oh? I see.\nUendo:\nI saw a similar scene during a murder mystery marathon last Tuesday. That's what made me think, \"This must be a dying message!\"Uendo:\nThe stiff cards were right next to the stiff, you see?Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThe cards were on the table next to your master's body was slumped over, right? You must've been surprisingly calm to notice them at the time.\nUendo:\nAs I said, the stiff cards were right there next to the stiff, so they were hard to miss.\nAthena:\nBut wouldn't it have been more natural to notice the victim rather than the cards?\nUendo:\nThe message just caught my eye, because the stiff cards were right next to the stiff.\nAthena:\nYes, but the fact hardly seems significant enough to make a person take not of them.\nUendo:\nStiff cards... next to the stiff...\nAthena:\nSo basically, there was no real reason for them to catch your eye, was there?\nUendo:\n*sigh*...Uendo:\nHey now, enough with the silly puns already! Hee hee!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThat's right! I need you to give your testimony, not perform a scene! Please remember you're on the witness stand, not the stage!\nUendo:\nBut look at all these wonderful people in the audience! It's only natural for an entertainer to want them to have some fun! Hee hee! I guess we can let a few jokes slide, right?\nJudge:\nAh, the inevitable bleeding of your work into other areas of your life. I know how that is. I find myself being unwittingly judgemental in my personal life, too.\nUendo:\nRight, right! That's exactly what I'm talking about! Well done, Your Honor! Guess you can't judge a judge by his cover!\nJudge:\nHo ho ho. I advise the defense not to be so critical of the witness.\nAthena:\nY-Yes, Your Honor.\nUendo:\nMuch obliged! Hee hee!Uendo:\nAnyway, I got the meaning right away. I knew it must've been talking about Bucky!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThe cards DO spell out \"WHET NO 4\"... which COULD be interpenetrated as \"Whet Noodle No. 4,\" I guess... I suppose you took this to mean Bucky Whet?\nUendo:\nThere's only one \"Whet Noodle\" around here, and you've seen that giant \"4\" on his back. It's the only interpenetration that makes sense!\nAthena:\nYeah, I guess so... But wait a minute!\nUendo:\nWh-What is it?!\nAthena:\nWhat if there's another \"Whet Noodle\" in the area! Wh-What? Did I say something strange?\nBlackquill:\nBucky is the sole heir to the shop. So enough with the ludicrous straw grasping!\nAthena:\nH-Hey! How was I supposed to know...?\nBlackquill:\nJust listen to the testimony again, and find the glaring inconsistency.Uendo:\nThat was the master's final message, left as he was drowning in soba broth.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSo the victim lined up those cards in his final moments? How can you be so certain that's how it went down?!\nUendo:\nI know Shisho. He would never let someone get the last word on him, even in death. With his face in soba broth, and his consciousness fading away... ...he left a message that pointed toward Bucky as he left this world. It's the only way it could've happened!\nAthena:\nWait! \"The only way\"?! Now you're just speculating!\nUendo:\nLook, a dying message is something you leave as you're dying, right? I saw a scene like that in a detective show.\nNahyuta:\n\nNahyuta:\nUendo, we have a saying in my country: \"Silence is more precious than diamonds.\" Please do not speak any more than is necessary.\nUendo:\nBut talking is my livelihood, you know. I talk all the time. This and that, truths and untruths... I can't stop myself from talking!\nAthena:\n(Hopefully, he'll stick to \"truths\" without any of those \"untruths\"...)Present Taifu's Autopsy Report\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"There's a contradiction in Uendo's testimony!\"Uendo:\nIt's so like Shisho not to write Bucky's name outright. \"Plain and simple\" wasn't his style.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nBut don't you think it's strange? Could a dying person... ...really leave such a convoluted message...?\nUendo:\nEven in the throes of death, it was in Shisho's nature to throw in a twist somehow. Truly the consummate entertainer till the very end, don't you think?\nAthena:\nWas he really that great of a man, Simon?\nBlackquill:\nIt would've been no easy task, to be sure. But who knows? He wasn't an entertainer for fifty-five years for nothing.\nUendo:\nIf I ever bite the big one like that... ...I wanna leave a dying message as good as Shisho's! Hee hee!\nAthena:\nWell, let's hope it never comes to that...Athena:\nS-Simon, are all rakugo artists like this?Blackquill:\nHmph. It's hard to say. It could simply be the eccentricity of an entertainer, or perhaps he's hiding something.Athena:\n(Well, he doesn't have to entertain people in a court of law. And if he IS trying to hide something, maybe it'll show up as a contradiction or something.)Athena:\nThere's a contradiction in Uendo's testimony!Judge:\nAnd would you care to explain where, Ms. Cykes?Athena:\nCertainly, Your Honor. According to the autopsy report, nothing unusual was found in the victim's lungs.Judge:\nAh, yes. It does say that, doesn't it?Uendo:\n.........Athena:\nIf he HAD drowned in a bowl of soba, then there should've been soba broth in his lungs! But since there wasn't any... ...it means the victim was suffocated with something other than soba broth!Uendo:\nPyoooooo!Judge:\nWh-What?!Athena:\nThis is the contradiction you noticed, isn't it, Simon?Blackquill:\nHeh. Not bad. Not bad at all.Athena:\nHeh heh heh. I guess I showed you!Judge:\nHmm... But if drowning in the soba broth WASN'T the cause of death... ...then when was the victim's face thrust into that bowl?Athena:\nTaifu Toneido's face was thrust into the bowl...Before his murder\n\n\n\n\n\n\n\nAthena:\nThe culprit first shoved the victim's face into the bowl, and then murdered him.\nNahyuta:\n...And for what reason, may I ask?\nAthena:\nUhh, well... they did it on a whim!\nNahyuta:\nAnd you have proof of this?\nAthena:\nUmm... Well... it's certainly not impossible!\nJudge:\nEnough of the runaround, defense!\nAthena:\n(Argh... Well, if it wasn't BEFORE the murder, then...)\nLeads back to:\n\"Taifu Toneido's face was thrust into the bowl...\"During his murder\n\n\n\n\n\n\n\nAthena:\nThe culprit killed the victim... while holding the victim's face in the bowl!\nNahyuta:\nYou just claimed the victim was \"suffocated with something other than soba broth.\" And yet, he could only have suffocated from the broth had his face been in the bowl.\nAthena:\nHuh? Now I'm all confused...\nJudge:\n\"I'm all confused\"?! is that all you have to say for yourself?\nAthena:\n(Well, that cleared my mind right up... Okay, if it wasn't DURING the murder then...)\nLeads back to:\n\"Taifu Toneido's face was thrust into the bowl...After his murder\n\n\n\n\n\n\n\nLeads to:\n\"Because no soba broth was discovered in the victim's lungs...\"Athena:\nBecause no soba broth was discovered in the victim's lungs... ...his head would've been placed into the bowl AFTER he was killed! And that's when the soba broth must've been spilled onto the karuta cards. In other words, the victim could NOT have lined up the cards as he was drowning!Judge:\nHmm... I see. So it was done AFTER he was already dead... But why would the culprit do such a thing?Athena:\nUmm... I'm afraid I don't know yet.Nahyuta:Nahyuta:\nHeh... You boast of psychological expertise, yet you cannot determine such a simple motive? My sides are liable to split at the absurdity.Athena:\nWhat, and I suppose YOU know why?!Nahyuta:\nOf course. Desecrating the body in that manner... ...indicates a strong sense of enmity on the part of the perpetrator.Judge:\nYes, that does make sense... It certainly paints a clear picture of the culprits intense feelings toward the victim.Nahyuta:\nFeelings of resentment over the theft of the soba shop's deed, no doubt.Athena:\n(Just great. Now the judge has an even more unfavorable impression of Bucky!)Blackquill:Blackquill:\nMust you come undone at every juncture? If the culprit had time enough to set up Master Toneido's body... ...do you think they would've honestly failed to notice the dying message?Athena:\nGood point... The cards WERE right in front of his body, after all... Rationally speaking, there's no way the culprit could've missed that, huh.Nahyuta:Nahyuta:\nAh, but was the accused rational at the time, given the way he stormed out of that room?Blackquill:Blackquill:\nNever mind that. I have something more important to ask Uendo.Uendo:\nM-Me?!Blackquill:\nYou saw the karuta cards firsthand, did you not? Would you care to tell us about them in a bit more detail? Those tiny crime scene photos show us precious little of what I wish to know.Uendo:\nWell, those cards are from Shisho's special \"Soba Scenes of Tokyo Past\" set. Each card is related in some way to soba.Blackquill:\nSpare me the history lesson! Just tell me how the cards looked at the scene, and no more!Uendo:\nWell, uh, there was soba broth spilled all over them...Judge:\nHmm... That's not much help, I'm afraid. Prosecutor Sahdmadhi, do you have a photo that shows the cards more clearly?Nahyuta:\n............I do. Please accept this meager offering, Your Honor.Judge:\nOh, my. What delightful-looking cards!Blackquill:\n......Well, well. Tearing Prosecutor Sad Monk's \"conclusive evidence\" apart should be a breeze with this.Athena:\nHuh?Blackquill:\nDon't tell me you haven't noticed.Athena:\nD-Don't be silly! O-Of course I have! (...Not noticed anything. But I can't exactly say that now, can I...?)Karuta Cards added to the Court Record.Judge:\nMs. Cykes, do you really see a problem with the prosecution's claim about these cards?Blackquill:\nWell, go on, then.Athena:\nA-All right... (It's do or die...! All I have to do is study the picture and...) These cards...Were rearranged\n\n\n\n\n\n\n\nLeads to:\n\"These cards were rearranged!\"Contain a contradiction\n\n\n\n\n\n\n\nAthena:\nThese cards contain a contradiction!\nNahyuta:\nDo they? And what exactly is this \"contradiction\" you speak of?\nAthena:\nHuh? Oh... Well... You know... Stuuuuuuuff...\nJudge:\nMaybe this will stuff some knowledge in that noggin of yours!\nNahyuta:\nI may have said that the accused was not rational at the time of the crime... ...but it appears that the defense is rational at no time whatsoever.\nAthena:\nArngh... Please let me try again.\nLeads back to:\n\"These cards...\"Are a kind of riddle\n\n\n\n\n\n\n\nAthena:\nThese cards are a kind of riddle revolving around the number four. \"Knock, knock. Who's there? Four. four who?\"\nNahyuta:\nI do hope there is a punch line.\nAthena:\n\"Four goodness sake, open the door!\"\nJudge:\nHmm... Not bad, defense. But please allow me these four words.\nAthena:\nCertainly, Your Honor. What are they?\nJudge:\nWhat's that riddle \"four\"?!\nAthena:\nArngh... Please let me try again.\nLeads back to:\n\"These cards...\"Athena:\nThese cards were rearranged!Judge:\nBut how can you tell?Athena:\nPlease take a good look at these cards, Your Honor. The answer is right in front of us.Judge:\nWhere exactly should we be looking, Ms. Cykes?The pictures on the cards\n\n\n\n\n\n\n\nAthena:\nEach and every picture is related to soba in some way. This can't be mere coincidence!\nNahyuta:\n*sigh* As was stated by Uendo... ...this set is called \"Soba Scenes of Tokyo Past,\" and was designed by the victim. So it is quite natural that each card would be related to soba in some way.\nJudge:\nYou'd better believe this penalty is not \"mere coincidence,\" either, defense.\nAthena:\nYikes! (How are these cards natural in any way?!) Fine. Let's take another look at these cards then, shall we?\nLeads back to:\n\"Where exactly should we be looking, Ms. Cykes?\"The soba broth stains\n\n\n\n\n\n\n\nLeads to:\n\"Please focus your attention on the soba broth stains on these cards.\"The size of the cards\n\n\n\n\n\n\n\nAthena:\nLook, all these cards are... exactly the same size, aren't they?\nJudge:\nYes. Yes, they are. And I have to wonder, defense, if your brain is the same size as these cards?\nAthena:\nNo, Your Honor. Let's just take another look at these cards, okay?\nLeads back to:\n\"Where exactly should be looking, Ms. Cykes?\"Athena:\nPlease focus your attention on the soba broth stains on these cards. The outline of these stains don't match up with the larger stain on the table.Judge:\nOh, would you look at that! You're absolutely right! And...?Athena:\nPlease recall that the soba broth was spilled and got on the cards AFTER the murder... ...when the victim's face was placed in the bowl.Judge:\nYes, go on.Athena:\nBy the stains, we can see that the culprit deliberately rearranged the cards after that. In other words... ...this message was altered in order to pin the crime on my client!Judge:\nWh-What?! Th-Then, if we put the cards back in their original positions...?Athena:\nWe can restore the evidence, and see who the cards were really pointing toward!Judge:\nTh-That's true!Nahyuta:\n...Pohlkun--!Athena:\nThen what are we waiting for?! Let's do this! (All I have to do is rearrange the cards so that the stains match up!) Let's see. Where was this \"W\" card originally?Present second space from left on top row\n\n\n\n\n\n\n\nLeads to:\n\"Perfect! Okay. The \"H\" card is next.\"Present anywhere else\n\n\n\n\n\n\n\nBlackquill:\n......Hmph. The stains don't match up if you place that card there. How can you not see that? Are those ridiculous bangs obscuring your vision?\nAthena:\nHey, you don't have to be so rude about it! Ugh, whatever. I'll try again...\nLeads back to:\n\"Let's see. Where was this \"W\" card originally?\"Athena:\nPerfect! Okay. The \"H\" card is next. Let's see. Where was this \"H\" card originally?Present third space from left on bottom row\n\n\n\n\n\n\n\nLeads to:\n\"Yes! Now the \"E\" card!\"Present anywhere else\n\n\n\n\n\n\n\nBlackquill:\n......Hmph. The stains don't match up if you place that card there. How can you not see that? Are those ridiculous bangs obscuring your vision?\nAthena:\nHey, you don't have to be so rude about it! Ugh, whatever. I'll try again...\nLeads back to:\n\"Let's see. Where was this \"H\" card originally?\"Athena:\nYes! Now the \"E\" card! Let's see. Where was this \"E\" card originally?Present third space from left on top row\n\n\n\n\n\n\n\nLeads to:\n\"A perfect match! Next up is the \"T\" card.\"Present anywhere else\n\n\n\n\n\n\n\nBlackquill:\n......Hmph. The stains don't match up if you place that card there. How can you not see that? Are those ridiculous bangs obscuring your vision?\nAthena:\nHey, you don't have to be so rude about it! Ugh, whatever. I'll try again...\nLeads back to:\n\"Let's see. Where was this \"E\" card originally?\"Athena:\nA perfect match! Next up is the \"T\" card. Let's see. Where was this \"T\" card originally?Present second space from left on bottom row\n\n\n\n\n\n\n\nLeads to:\n\"Great! That fits right in there! Now the \"N\" card!\"Present anywhere else\n\n\n\n\n\n\n\nBlackquill:\n......Hmph. The stains don't match up if you place that card there. How can you not see that? Are those ridiculous bangs obscuring your vision?\nAthena:\nHey, you don't have to be so rude about it! Ugh, whatever. I'll try again...\nLeads back to:\n\"Let's see. Where was this \"T\" card originally?\"Athena:\nGreat! That fits right in there! Now the \"N\" card. Let's see. Where was this \"N\" card originally?Present fourth space from left on top row\n\n\n\n\n\n\n\nLeads to:\n\"There! That looks good. Now \"O\"!\"Present anywhere else\n\n\n\n\n\n\n\nBlackquill:\n......Hmph. The stains don't match up if you place that card there. How can you not see that? Are those ridiculous bangs obscuring your vision?\nAthena:\nHey, you don't have to be so rude about it! Ugh, whatever. I'll try again...\nLeads back to:\n\"Let's see. Where was this \"N\" card originally?\"Athena:\nThere! That looks good. Now \"O\"! Let's see. Where was this \"O\" card originally?Present first space from left on top row\n\n\n\n\n\n\n\nLeads to:\n\"Nice! Almost done now! The last card is \"4.\"\"Present anywhere else\n\n\n\n\n\n\n\nBlackquill:\n......Hmph. The stains don't match up if you place that card there. How can you not see that? Are those ridiculous bangs obscuring your vision?\nAthena:\nHey, you don't have to be so rude about it! Ugh, whatever. I'll try again...\nLeads back to:\n\"Let's see. Where was this \"O\" card originally?\"Athena:\nNice! Almost done now! The last card is \"4.\" Let's see. Where was this \"4\" card originally?Present first space from left on bottom row\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"So the message \"WHET NO 4\"...\"Present anywhere else\n\n\n\n\n\n\n\nBlackquill:\n......Hmph. The stains don't match up if you place that card there. How can you not see that? Are those ridiculous bangs obscuring your vision?\nAthena:\nHey, you don't have to be so rude about it! Ugh, whatever. I'll try again...\nLeads back to:\n\"Let's see. Where was this \"4\" card originally?\"Athena:\nSo the message \"WHET NO 4\"... ...was originally supposed to say \"OWEN 4TH\"! And this original message is our clue to the identity of the true culprit!Judge:\nWHAAAAAAAAAAAAT?!Blackquill:\nHeh! That indignant look on Prosecutor Sad Monk's face is positively priceless!Nahyuta:\nThis is absurd!Gallery:So it was originally \"OWEN 4TH\"...?It wasn't \"WHET NO 4\"? Maybe the lawyer is smarter than we thought!Judge:\nOrder! Order in the court! Well! I never would've imagined that there was more to these cards than meets the eye!Karuta Cards updated in the Court Record.Judge:\nSo now that that's settled... what does this \"OWEN 4TH\" mean?!Athena:\n............Wait. Am I...?Blackquill:\nWho else do you suppose is to provide an explanation?! Of course it's you!Athena:\nB-But I hadn't thought that far yet...Nahyuta:\nChange the cards around all you'd like, but if you cannot explain what the message means... ...then it is as worthless as you are, defense!Athena:\nN-Nooooooooooooooo!Nahyuta:\nAnd so the spring chick that fancies itself as a graceful swan is brought back down to Earth.Athena:\n(I have to do something! But what?!)Blackquill:\nStill your thoughts for a second. There's a perfectly good witness to question over there.Athena:\nOh! Right! That's a good idea! (Come on, Athena! Get a hold of yourself!) Uendo, does the phrase \"OWEN 4TH\" mean anything to you?Uendo:\nNo. There's no one named \"Owen\" in the Toneido family, or our circle of friends. Go ahead, ask anybody you'd like!Athena:\nYou can't be serious...Nahyuta:\nHaving rummaged through you empty mind, I see you have, as expected, turned up nothing.Blackquill:Blackquill:\nHmph. I'm afraid I have no idea who the devil this \"OWEN 4TH\" is, either. But the fact remains that the cards were rearranged to pin the blame on Mr. Whet. That in itself proves that the defendant isn't the real culprit.Athena: \nProsecutor Blackquill is right! Besides, the important question here is not... ...\"Who does the message point to?\" but rather... ...\"Who rearranged the cards?\"Blackquil:\nTsk. Why didn't you point that out eariler if you already knew?Athena:\nS-Sorry... In any case, there were two opportunities for someone to rearrange the cards. The first was when Mr. Whet entered the dressing room... ...and the second was when Uendo discovered the body.Uendo:\nAre you accusing me of rearranging the cards? ME, who came to testify out of the goodness of my heart?!Blackquill:\nWell, you didn't exactly come running out screaming straight away, did you? Even a mere two to three minutes is more than enough time to get up to some devilry. So what exactly were you doing in there, Uendo?Uendo:\n*sip* *sip*Blackquill:\nPut down the tea, and spit out your answer!Uendo:\nEep! M-Mr. Prosecutor! What's a guy supposed to do at a time like this?Nahyuta:\n\"Silence is more precious than diamonds,\" witness. Therefore, you need only remain silent. The defense is devious. They are waiting for you to make a slip of the tongue.Uendo:\nOh, I see. So that's what you're after, is it? In that case...Your Honor, I've decided not to say another word.Nahyuta:\nVery good. After all, your right to remain silent is protected by law.Athena:\nWell, Prosecutor Blackquill? Any other brilliant ideas you'd like to share?Blackquill:\nHeh heh heh... Ha ha ha ha ha! Did you hear that, Cykes-dono? A rakugo artist who's afraid to speak! Who's ever heard of such a thing!Nahyuta:\nAre you trying to taunt him into talking? Such a petty trick will never work.Uendo:\nThat's right. I'm not going to fall for it.Blackquill:\nI'm only asking to hear your story. Besides, is it not your job to tell tales if there is an audience to listen?Uendo:\nE-Even so, I have a right to refuse to answer.Blackquill:\nThe more you keep quiet, the more we want you to talk. That's simply human nature. Isn't that right, people of the gallery?!Uendo:\n...........Blackquil:\nEven with this wonderful audience in front of you, you still refuse to talk? If so, then perhaps you chose the wrong line of work, my friend!Uendo:\nAre you saying I should quit?! Because I'm not afraid to speak my mind, I'm have you know. Oh, no! Never mind what I just said! It IS scary to talk! It's absolutely terrifying! But, no! As a rakugo artist, I must talk! If I don't, how can I ever show my face on stage again?! Your Honor, I'm ready to testify!Athena:\n(H-He did it! He managed to convince Uendo with the power of suggestion technique!)Blackquill:\nBully for you, Uendo! That's as a REAL rakugo artist should be!Judge:\nA-All right... If the witness wishes to testify, then by all means, please do.Nahyuta:\nTo be turned by such an obvious ploy... What a man of weak spirit.Witness Testimony-- In The Dressing Room --Uendo:\nAfter my performance, I went to visit Shisho.\nI called to him from outside the room... but he didn't reply.\nWhen I entered the dressing room, I saw Shisho slumped over the table, motionless!Nahyuta:\nFrom what I can tell, there do not appear to be any inconsistencies in the testimony.Uendo:\nOf course there aren't any. Because I'm not trying to hide anything.Athena:\n(Prosecutor Sahdmadhi's right. I don't see anything inconsistent, either. But I did pick up on some faint discord in Uendo's heart.)Nahyuta:\nHmph. Ponder all you would like, defense, but it is pointless. Your Honor. I believe there is no need for further deliberation...Athena:Athena:\nI disagree, Your Honor! I detected discord in the voice of the witness's heart! That's a clear indication that Uendo is facing some sort of inner turmoil!Judge:\nHmm... Are you saying... what I think you're saying, Ms. Cykes?Athena:\nYes, Your Honor! The defense would like to conduct a quick therapy session on this witness!Nahyuta:Nahyuta:\nUendo, there is no need for you to submit to this so-called \"therapy\".Uendo:\nIt's fine by me! I have nothing to hide. Bring it on!Nahyuta:\nImpetuous fool! Why will you not listen to the guidance of this humble servant of the Holy Mother?!Judge:\nIf the witness wishes to proceed, I see no problem, Prosecutor.Blackquill:\nHeh heh heh. In one ear and out the other. It seems this performer has no need for your so-called \"guidance,\" Prosecutor Sad Monk.Nahyuta:\nJust know this Uendo: Your folly will surely earn you divine retribution.Athena:\nThanks, Simon! I'm going to make the most of this opportunity you created for me!Blackquill:\nHeh. Just keep your wits about you.Athena:\nI will! Uendo, could you tell us again about what happened in the dressing room?Uendo:\nAfter my performance, I went to visit Shisho.Uendo:\nI called to him from outside the room...Uendo:\n...but he didn't reply.Uendo:\nWhen I entered the dressing room, I saw Shisho slumped over the table, motionless!Pinpoint Surprised marker\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Uendo, I'm noticing something strange with these emotions.\"Athena:\nHmm... I didn't really notice any unexpected emotions in that testimony...Blackquill:\nBut it isn't always a question of the presence of an emotional response, but the absence.Athena:\nYou know... You're right. (It's not always the emotions I do see. Sometimes, it's a matter of what I don't, but would expect so see... I'd better carefully compare Uendo's statements to his emotions again!)Athena:\nUendo, I'm noticing something strange with these emotions.Uendo:\n\"Some thin stranger with cheesy toe skin,\" you say?Athena:\nNo! \"Something strange with these emotions\"! How could you have heard \"some thin stranger with cheesy toe skin\"?!Uendo:\nI don't know. Maybe it's me who's got some cheese in my ears...Athena:\n(Did he will the floor to open up and swallow his cushions out of shame for that bad joke?) The point I'm trying to make is that I noticed something unexpected in your emotions! Now stop hiding and come out where we can see you!Judge:\nBailiff, please bring the witness a few replacement cushions.Uendo:\nSo what was this unexpected thing you noticed?Athena:\nOh, come on! His Honor said a few cushions -- not a few dozen!Judge:\nNow that we've all had a good laugh, please continue, Ms. Cykes.Athena:\n(Who's laughing?! Argh! Focus, Athena! Don't let yourself get rattled!) When you entered the room and saw your master slumped motionless over the table... ...you weren't the least bit shocked, Uendo. Don't you think that's a little odd?Uendo:\nI-Is it, though?Athena:\nThe lack of surprise means you were prepared for what you saw. (And I think I know why... The reason Uendo wasn't shaken when he saw his master's dead body is because...)He was zoned out\n\n\n\n\n\n\n\nAthena:\nMaybe you weren't shaken because you were zoned out!\nUendo:\nYeah, you got me! I'm a total space case! Ha ha ha! Well, get your head out of the clouds and go do some work for a change! Don't worry, honey! I found a wallet the other day. We have plenty of money to live in now!\nAthena:\nCorrect me if I'm wrong, Simon, but did he just start doing a routine?\nBlackquill:\nYes. I believe he's telling the famous \"Shibahama Fishmonger\" story. It seems your answer lulled him into such a sense of security that he's zoning YOU out.\nJudge:\nA penalty for our spacey defense attorney!\nAthena\n(There must've been some other reason Uendo wasn't shaken...)\nLeads back to:\n\"The reason Uendo wasn't shaken when he saw his master's dead body is because...\"He has an entertainer's guts\n\n\n\n\n\n\n\nAthena:\nMaybe you weren't shaken because you are an entertainer. Entertainers gotta have guts!\nUendo:\nSadly, I busted a gut laughing at Shisho's bits last week. Now I'm practically gutless... Does my tale of woe pluck at your gutstrings?\nAthena:\nUh, don't you mean heartstrings?\nUendo:\nSorry, I was just trying to match... ...the level of nonsense coming out of your mouth, lady! Hee hee! If you don't like it, just say so! Go on, spill your guts!\nJudge:\nThe witness has a point. You have a lot of guts wasting this court's time!\nAthena:\n(There must've been some other reason Uendo wasn't shaken...)\nLeads back to:\n\"The reason Uendo wasn't shaken when he saw his master's dead body is because...\"He knew about his master's death\n\n\n\n\n\n\n\nLeads to\n\"Uendo, I think maybe the reason you weren't shaken was because...\"Athena:\nUendo, I think maybe the reason you weren't shaken was because... ...you already knew you would find your master dead!Uendo:\nPyooooooooooo! Wh-Whaaat?! What kind of a thing is that to say?! You've got it all wrong...! O-Oh, right! I just remembered something! I thought Shisho was just sleeping when I first saw him! Hee hee!NOISE LEVEL50%Athena:\nYou thought he was sleeping? (It sounds plausible, but...) What made you think he was asleep?Uendo:\nWell, he had his head and arms up on the table, as if he were taking a nap. Oh, and one other thing! There was that note, too!Athena:\nA note? What note?Nahyuta:\nAh, he must be talking about this. It appears to have been written by the victim. Allow me to read it. \"Resting. Do not disturb.\"Uendo:\nYes! That's the note I saw! After reading that, who wouldn't think Shisho was napping?!Judge:\nHmm... That is a pretty reasonable assumption.Athena:\n(Y-You've gotta be kidding me...)Taifu's Note added to the Court Record.Uendo:\nThat's right. I saw this note, so that's why I thought Shisho was asleep. I want to change my testimony to include that statement!Athena:\nAll right. I'll run an update.Uendo:\nAfter my performance, I went to visit Shisho.Uendo:\nI called to him from outside the room...Uendo:\n...but he didn't reply.Uendo:\nWhen I opened the door, I thought he was sleeping.Uendo:\nBut something seemed off, so I rushed over to him.Pinpoint Angry marker\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Uendo, I noticed something funny in your emotions again.\"Uendo:\nI was shocked to find him dead! I couldn't believe my eyes!Athena:\n(There was one emotion that seemed out of place given Uendo's action's and statments. I wonder why he felt that particuar emotion then?)Blackquill:\nIf you've noticed something, then hurry up and point it out already.Athena:\nI know! I'm just trying to be thorough, that's all!Blackquill:\nHmph. It looked to me like you were being timid.Athena:\nI was not! You just watch me pinpoint the heck out of his emotions!Athena:\nUendo, I noticed something funny in your emotions again.Uendo:\n\"Funny,\" you say?! I guess an entertainer of my caliber can make people laugh, even with my emotions!Athena:\nI didn't mean that kind of \"funny\"! Quite the opposite, actually! When you entered the dressing room, I see that you suddenly felt anger. What I want to know is, what made you feel angry all of a sudden?Uendo:\nWhat? Hmm... Let's see... Oh yeah! Now I remember! As I was going in, I whacked my little piggy on something. I was annoyed at my own clumsiness! Hee hee!Athena:\nWait, you mean you stubbed your pinky toe?Uendo:\nJ-Just a little bump on my little piggy. N-N-No big deal... I-It's embarrassing, really...Athena:\n(Sounds more like he's hiding something. I'd better dig a bit deeper.) No need to be embarrassed, Uendo, but I'm afraid it's something we need to look into. Hmm... I don't really see anything you could've stubbed your toe on... ...in the area around the dressing room door in this picture. (But maybe there WAS something there at the time...?) Uendo, what exactly did you stub your toe on?Nahyuta:Nahyuta:\nWhat an irrelevant question. You dishonor the soul of the victim with these unnecassary delays.Uendo:\nYou tell her. Really, who doesn't stub their toe every once in a while? You really gotta fuss over every small detail like this?Athena:\nUm, well... The thing is...Blackquill:\n............Athena:\nE-Even the most subtle of fluctuations in a person's psyche can clue us in to the truth. That's why it's important to get to the bottom of this question! (Plus, if we back down now, who knows what new insult Simon will hurl my way... Is there really no trace of what Uendo stubbed his toe on by the door? What in the world might've been there then, but is not there now?)Present TV or flour track on floor\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Please take a good look at this photo of the crime scene.\"Present table leg indentation on floor\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nUendo, did you stub your toe on this table?\nBlackquill:\nWait a minute... While it does appear that something hit the table and moved it... ...Uendo said he stubbed his toe as he was entering the dressing room.\nAthena:\nYeah... And the table looks pretty far from the door. (Could what bumped into the table also be a clue as to what Uendo stubbed his toe on?)\nBlackquill:\nCareless answers will only hurt us here. So think carefully before you speak again.\nAthena:\nR-Right! (Is there really no trace left of what Uendo stubbed his toe on by the door?)\nLeads back to:\n\"What in the world might've been there then, but is not there now?\"Present anywhere else\n\n\n\n\n\n\n\nAthena:\n\nAthena\nUendo, is this what you stubbed your toe on? \nUendo:\nOh, I could never stub my toe on that! That would really be starting things out on the wrong foot! Right, Mr. Golden-Ager?\nJudge:\n\"Golden-Ager\"? Don't you dare send me off to the retirement home yet, sonny! Anyway, I hope Ms. Cykes didn't stub her toes on her teeth as her foot entered her mouth.\nNahyuta:\nWell, defense? Are you ready to let it go, and move on now?\nAthena:\nOf course not. What Uendo stubbed his little toe on... ...is a vitally important question! (I think. Is there really no trace left of what Uendo stubbed his toe on by the door?)\nLeads back to:\n\"What in the world might've been there then, but is not there now?\"Athena:\nPlease take a good look at this photo of the crime scene. Do you see it? This long track that goes from the door, all the way across the room?Judge:\nHmm... Now that you mention it, I DO see traces of something getting dragged.Athena:\nAnd the drag mark ends... there at the TV. This implies that the TV was originally by the door. I'm convinced that this TV is the object the witness stubbed his toe on. Well, Uendo! How about it?!Uendo:\nY-Yes you're right... It was the TV!NOISE LEVEL10%Athena:\n(There! The noise level dropped again!)Uendo:\nY-Yes, I stubbed my pinky toe on the TV. B-B-But what of it? Why is this so important to you?Athena:\n(So the noise went down, but it hasn't completely dissapeared yet. Which means he's still hiding something... Okay, let's try this tactic instead.) Uendo, why was the TV moved there?Uendo:\nShisho must've moved it so he could watch my routine. But what a place to put it! Right in the middle of the doorway like that! I didn't want to bump into it again, so I put it back where it belonged.Athena:\nPerformances onstage can be viewed in the dressing room using that TV?Uendo:\nThat's right. It's a closed-circuit monitor that shows the stage.Crime Scene Report updated in the Court Record.Athena:\nI-I see. (Now what? I can't find anything else out of place. And I still haven't gotten the noise level down to zero yet...) Simon... I'm still getting noise here, but... ...I don't see anything else fishy.Blackquill:\nHmph. This is precisely why amateurs are such a bother.Athena:\nS-Sorry...Blackquill:\nI'm in no mood to play nursemaid here, but if that's what it takes to save the soba shop... Hoy, Uendo. Here's a curiosity for you. This table master Toneido is slumped over looks like it was moved. Did you happen to bump into it while you were moving the TV back?Uendo:\nO-Oh my! Yes, you're right! The TV hit the table, and Shisho's body moved with a jolt... That's when I first realized that Shisho was dead! Oh! But how scared I was!Blackquill:\nI see. Thank you. We're finally getting a more precise picture of how the body was discovered. But I'd wager you need to put the spurs to Uendo just a trifle longer.Athena:\nR-Right! (I can't keep asking Simon to bail me out like this! It's time for me to regain my footing and really stand on my own!) Uendo, what you said now about discovering you master's death... Could you please describe all of that again for the court in detail?Uendo\nA-All right.Athena:\nBut, before you do, let me plug in the latest information...Uendo:\nAfter my performance, I went to visit Shisho.Uendo:\nI called to him from outside the room...Uendo:\n...but he didn't reply.Uendo:\nWhen I opened the door, I thought he was sleeping.Uendo:\nI tried to enter the dressing room, but stubbed my toe on the TV.Uendo:\nWhen I put the TV back in its normal spot, I realized that Shisho was dead!Uendo:\nSeeing him slumped over that cluttered table... *sniff*... Oh, Shisho...Pinpoint Surprised marker\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"That's odd...\"Athena:\nHmm... I'm not really seeing any emotions I'd consider out of place. How about you, Simon?Blackquill:\nHow many times are you going to come running to me?Athena\nNo, um... I was just looking for... a second opinion!Blackquill:\nTsk. Well, take another good look at the flow of emotions. Don't just look for simple inconsistencies. Look at the intensity of his emotion, too.Athena:\nI see... Thanks, Simon!Athena:\nThat's odd... After the initial shock of finding the victim dead, you reacted with surprise again! What was it that surprised you, Uendo, besides your master's death?Uendo:\nWh-What do you mean?Athena:\nWhat's more, you were even MORE surprised the second time than the first! What could've surprised you more than finding your late master?!Uendo:\nS-Search me. Your little thingy must've made a mistake!Blackquill:Blackquill:\nThe girl is as sharp as a trout to be sure... but her ability to hear people's emotions is absolute. Now, get to remembering, Uendo! What was it that surprised you?!Athena:\n(That... was a compliment, right...?)Uendo:\nWell, I... Er...NOISE LEVEL100%Athena:\nNo! We've pushed him too hard, and he's mentally all over the place! His emotions are completely out of control!Blackquill:\n\"Out of control\"? Care to explain how that's relevant?Athena:\nYou know how normally, I listen for the hidden emotions in a witness's voice, right? From there, I look for inconsistencies between their testimony and these emotions. But sometimes a person's feelings can run too high, making it hard to get proper readings.Blackquill:\nSo that's how your matrix program works. Fascinating!Athena:\nOrdinarily, it's just one emotion that runs out of control... But it seems there's nothing ordinary about this time!Uendo:\nNnnngh... I... I-I...!Uendo:\nAfter my performance, I went to visit Shisho.Uendo:\nI called to him from outside the room...Uendo:\n...but he didn't reply.Uendo:\nWhen I opened the door, I thought he was sleeping.Uendo:\nI tried to enter the dressing room, but stubbed my toe on the TV.Uendo:\nWhen I put the TV back in its normal spot, I realized that Shisho was dead!Uendo:\nSeeing him slumped over that cluttered table... *sniff*... Oh, Shisho...Athena:\nI knew it...!Blackquill:\nHmph. What's got your knickers all in a bunch now?Athena:\nUendo has multiple emotions running out of control at the same time! I've never seen anything like this! Ever!Blackuill:\nSo how does one bring a situation like this under control?Athena:\nI'll have to find the root cause of this tangled mess before I can treat him. If I can identify what is causing this emotional rampage... ...then I can \"Probe\" ([L / LB / Q]) to dive in further. (Changed from [...then I can touch 'Probe' (L) to dive in further.] in the original release) I'll need to point to what I think is the root cause, and hit \"Probe\" ([X / Y / R]) again. (Changed from [I'll need to point to what I think is the root cause, and touch 'Probe' (X) again.] in the original release) Through this process, I can identify exactly what's causing Uendo so much distress!Blackquill:\nAnd that will help bring his emotions back under control? In that case, let's get started, shall we?Athena:\nAll right! I can't guarantee success, but it's definitely worth a shot! (Time to look for the root cause of Uendo's rampaging emotions!)Uendo:\nAfter my performance, I went to visit Shisho.Uendo:\nI called to him from outside the room...Uendo:\n...but he didn't reply.Uendo:\nWhen I opened the door, I thought he was sleeping.Uendo:\nI tried to enter the dressing room, but stubbed my toe on the TV.Uendo:\nWhen I put the TV back in its normal spot, I realized that Shisho was dead!Uendo:\nSeeing him slumped over that cluttered table... *sniff*... Oh, Shisho...Probe Karuta Cards\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"I get it now... The cards were the root of it all.\"Athena:\n(What could be the root cause of his out-of-control emotions...?)Blackquill:\nHmph. Having trouble, are we?Athena:\nDuh! I can't find the cause of his distress!Blackquill:\nIsn't it obvious?! It's that bloody question you asked -- that's what pushed him over the edge, remember?Athena:\nHey, you're right...!Athena:\nI get it now... The cards were the root of it all.Uendo:\nI, er...Athena:\nDon't try to deny it! You can't hide your feelings from me! The dying message that was left at the scene of the crime... ...is what was causing your distress!Uendo:\n............Athena:\nAnd if the dying message was the cause of all those feelings... then that means the phrase \"OWEN 4TH\" must mean something to you!Uendo:\nNnngh!NOISE LEVEL0%BYE BYEAthena:\nThere! Noise level, zero! Finally!Nahyuta:Nahyuta:\nThe dying message consists of two words: \"OWEN\" and \"4TH.\" But neither of these two words have anything to do with this witness. This topic warrants no further argument.Athena:\nSure, there may not seem to be any direct connection... ...between Uendo and the message... ...for now. But why don't you wait and decide what's necessary AFTER you hear my theory?Blackquill:\nHeh. I trust you've hit upon something, Athena?Athena:\nYup! If my theory is right... ...we can finally solve te case of \"Uendo and the Mysterious OWEN 4TH\"!Blackquill:\nHeh. Well, go on, then!Judge:\nI can already tell this promises to be interesting. Now, please share your theory with the court, Ms. Cykes.Athena:\nThere was something puzzling to me about Uendo's out-of-control emotions just now. Namely, that there were three distinct reactions present. I had never seen that before, and I wondered how it could be possible.Nahyuta:\n...Is there a conclusion to this meandering musing of yours?Athena:\nHold your horses, I'm getting there. So, could a person flip between three distinct emotions of such intensity like a switch? In the end, I concluded that it just wasn't possible.Blackquill:\nHa ha ha! So that's it, is it?! A bit unconventional, but I'll grant that it's possible within the realm of psychology.Judge:\nWithin the realm of psycology...? I'm afraid you'll have to explain it for the old man up here on the bench.Athena:\nYour Honor, my theory is that Uendo...Is a robot\n\n\n\n\n\n\n\nAthena:\nYou'll be surprised to hear that Uendo is actually a robot! Why not show your true self now, Uendo? Give us an old \"beep boop boop\"!\nU.3.N.D.0:\nYOU. ARE. CORRECT. I. AM. A. ROBOT. BEEP BOOP BOOP!\nUendo:\nHah! What a space cadet!\nJudge:\nOh, very nice! What a good sport the witness is for playing along! With the defense's joke of a theory, that is!\nAthena:\nOkay... So he's not a robot...\nWidget:\nBeep boop booooop...\nLeads back to:\n\"Your Honor, my theory is that Uendo...\"Has supernatural powers\n\n\n\n\n\n\n\nAthena:\nMaybe Uendo has supernatural powers?\nUendo:\nOh, yes! I make these butterflies dance in the air with psychokinesis. Hee hee! NOT! They're floating on the breeze from my fan, that's all. I'm very sad to say I don't have any supernatural powers.\nJudge:\nAh, you switch between funny and serious characters so seamlessly! Marvelous! If only the defense's conjecturing was as well-practiced.\nAthena:\nAll right... So no supernatural powers...\nLeads back to:\n\"Your Honor, my theory is that Uendo...\"Has multiple personalities\n\n\n\n\n\n\n\nLeads to:\n\"With so many distinct personas, it's clear to me that...\"Athena:\nWith so many distinct personas, it's clear to me that... ...Uendo has dissociative identity disorder!Uendo:\nPYOOOOOOOOOOOO!Judge:\nWh-Wh-Wh-What does that even mean?!Nahyuta:\n............ Your Honor, the defense would treat this trial as a child's jest. Multiple personality disorder? A preposterous proposition indeed. Would you not agree, witness?Uendo:\nH-H-How did she know? How did she figure it out?!Nahyuta:\nP-P-Pohlkunkaaaa!Athena:\nI can't believe it... I-I did it! I did it, Simon! I've read papers on it before... ...but to think I'd see a case of it for myself...!Blackquill:\nBlimey. Rakugo artists tell stories as different characters, but as different personalities?Uendo:\nHey, you! Lawyer girl! You got a problem with us?! Huh?!Athena:\nN-No... No problem at all...Judge:\nThis is all very hard to believe... ...but now that we've established that the witness has multiple personalities... ...could each of them please introduce themselves to this court?Uendo:\nUendo Toneido. I'm a rakugo storyteller, as you know.Patches:\nHello everybody! Patches, the friendly jester here! Hee hee!Kisegawa:\nHmph. Kisegawa. Courtesan.Athena:\nAnd is that all of you?Uendo:\nYes, that's all of us.Athena:\nSo there are three personalities in total: Uendo, Patches, and Kisegawa, huh. Well, Simon! What do you think now?!Blackquill:\nHmph. That you're one lucky duck. Just be glad they were dense enough to help you out.Athena:\nArgh! Can't you straight up say I did great for a change?Blackquill:\nHeh.Nahyuta:\nYou appear to be quite proud of yourself, defense... ...but all you have done is infringe upon the privacy of the witness.Athena:\nI couldn't disagree more, Prosecutor! Now that we know there are three personalities... ...a new way for us to interpret the meaning of a certain piece of evidence has arisen.Nahyuta:\nA new interpretation?Judge:\nOoh, now I'm very curious. What is this piece of evidence you're talking about, Ms. Cykes?Athena:\nKnowing what we know about Uendo and his personalities, this now makes perfect sense.Present Karuta Cards\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"The karuta cards?\"Present anything else\n\n\n\n\n\n\n\nAthena:\n\nPatches:\nWow! You are amazingly heedless, Aren't you!\nAthena:\n\"Amazingly heedless\"? Why, Patches! Was that a compliment?\nBlackquill:\nFool! \"Heedless\" means \"careless.\" In other words, you guessed wrong.\nAthena:\nOh...\nJudge:\nA needless mistake by a heedless attorney.\nAthena:\nPlease let me try again, Your Honor.\nLeads back to:\n\"Knowing what we know about Uendo and his personalities, this now makes perfect sense.\"Judge:\nThe karuta cards?Athena:\nThat's right, Your Honor. Recall the original dying message left at the scene. We didn't have a clue as to what \"OWEN 4TH\" could've possibly meant. But now, with this new information about Uendo and his personalities... ...isn't it possible that \"OWEN 4TH\" actually means... ...a secret fourth personality of Uendo's -- a personality named \"Owen\"?!Judge:\nWHAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAT?!Nahyuta:\nPohlkunka!Athena:\nUendo must have kept his dissociative identity disorder from us because... ...he didn't want to be associated in any way with that dying message!Uendo:\nN-No! That's not why! We kept our disorder a secret for a diffrent reason altogether.Patches:\nWe've been taking advantage of our affliction to act out various rakugo characters. If word of this got out, well...Kisegawa:\n...our reputation as a rakugo artist would be tarnished, as would the Toneido name.Uendo:\nThat's why we kept it a secret from everyone except members of the Toneido School. But really, there is no \"fourth personality.\" It's just the three of us in here.Blackquill:\nA plausible-enough sounding story... ...but it doesn't prove you didn't rearrange the cards, does it?Uendo:\nB-But...!Nahyuta:Nahyuta:\nI will concede that it is highly likely that the witness rearranged the cards.Athena:\n(Is Prosecutor Sahdmadhi... actually agreeing with us...?)Nahyuta:\nHowever, is it not also possible... ...that the accused killed Master Toneido... ...and then left that message in order to frame the witness?Athena:\nUrngh!Nahyuta:\nAnd upon noticing the cards when he found the victim's body, Uendo rearranged them.Blackquill:Blackquill:\nA fantastic tale, but a tale nonetheless. No one outside the Toneido School knew about Uendo's multiple personalities. Uendo just finished saying so himself.Nahyuta:\nAh, that is a true, but ultimately meaningless point. The witness was only in the dressing room for two to three minutes. That's far too little time to commit murder, wouldn't you say?Athena:Athena:\nThen who's to say he couldn't have done it before his \"discovery\"?Nahyuta:Nahyuta:\nAh, that spring chick memory of yours. Have you already forgotten Prosecutor Blackquill's testimony?Athena:\n(Simon's testimony? ............Oh!)Blackquill:\nGeiru escorted me to the dressing room... ...but we heard the sound of rakugo being performed from within. Thinking the master was rehearsing, we decided to wait in the hall until he was done.Nahyuta:\nThat's right. Until a few moments before Uendo entered the dressing room... ...Taifu Toneido was confirmed to still be alive!Blackquill:\nArnngh!Athena:\nNooooooooooooooooon!Nahyuta:\nNot only that, but Uendo was on stage until just before he discovered the body. A bulletproof alibi that I have already confirmed with several audience members.Athena:\nOh, noooooooooooo...!Nahyuta:\nI also heard that his rakugo performance that day was \"a steaming pile of...\" Well, you get the picture.Patches:\nY-Yes, I'm afraid so! Really stunk up the stage, I did! Hee hee!Uendo:\nAnd yet, I have a perfect alibi!Nahyuta:\nIndeed. Why not land the coup de grâce on the defense by describing your alibi, witness?Patches:\nOkey-dokey-smokey!Witness Testimony-- Uendo's Alibi --Uendo:\nI was onstage until just moments before I went into the dressing room.Kisegawa:\nThe entire audience was my witness.Patches:\nBut my performance was a huge bust. Not a single soul laughed!Uendo:\nI'll never be able to live down how terribly I bombed during that very important show.Nahyuta:\nUendo was onstage before he found the body, so he could not have committed this crime. It is time to let it all go, defense, and move on.Athena:\nNgrrr...! Well, get this, Prosecutor Sahdmadhi! The Wright Anything Agency NEVER gives up! We fight to the bitter end!Nahyuta:\nFeh! Allow me to say this once more... Let it go, and move on.Athena:\nAnd allow ME to say once more, I'm never giving up!Nahyuta:\nLet it go, and...Athena;\nNever!Nahyuta:\n............... This is pointless. You should have taken advantage of this opportunity while you could, you foolish child! Your worthless convictions only serve to prolong the accused's suffering. If words will not sway you, then perhaps pain will.Athena:\nOh, no! A-Anything but this!Nahyuta:\n\nHrnh!Athena:\nEeeeeeek! Nnnngyaaaaaaaaaaaaaaaaaaaaaaaaaagh! What's the big idea, Prosecutor Sahdmadhi?!Nahyuta:\nThat was but a small dose of punishment for your misguided convictions. Are you now a bit more inclined to give up, as instructed?Athena:\nAs if!Nahyuta:\nIn that case, you must require another dose!Blackquill:\nNot bloody likely!Nahyuta:\nNrgh!Blackquill:\nI don't give two flips about your beliefs. But if Cykes-dono were to submit to you here, I won't be able to eat good soba anymore.Athena:\nTh-That's right! For Mr. Whet's future, and Prosecutor Blackquill's stomach... ...I will NEVER give up!Nahyuta:\nYou will rue those words, defense. Of that, I can assure you.Cross ExaminationCross Examination-- Uendo's Alibi --Uendo:\nI was onstage until just moments before I went into the dressing room.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nHow can you be sure it was you who was on that stage?\nUendo:\nAre you asking whether it could've been some imposter?\nAthena:\nI-I guess so.\nUendo:\nUnlike a big arena, a rakugo theater is a cozy, little place. It would be hard to fool an audience in such an intimate setting, don't you think?\nAthena:\nYeah, I guess you're right.\nUendo:\nGood. I'm glad we could clear that up, because I guess you could say...Kisegawa:\nThe entire audience was my witness.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nWas there anything special about the stage or your performance that you can tell me? For example, were the lights dimmer than usual? Were there any problems or accidents?\nKisegawa:\nNot a thing. Everything was the same as always. Mr. Prosecutor, you questioned the audience, didn't you?\nNahyuta:\nYes, of course. Apparently, nothing seemed amiss to them except, well... one small thing.\nAthena:\nOne small thing?\nPatches:\nOh... it's so embarrassing! I tried my best! Really, I did...Patches:\nBut my performance was a huge bust. Not a single soul laughed!Press\n\n\n\n\n\n\n\nAthena:\n \nAthena:\nDo you have any idea what went wrong?\nKisegawa:\nHmm... I'm not sure if it was my performance, or if it was just that particular audience... Or maybe it was the story I picked. But every entertainer knows that this kind of thing happens from time to time.\nAthena:\nI guess that makes sense... (Still, I wonder how he could've flopped at his own commemorative show? Hmm... Maybe I should dig into things a bit more...)\n\n\n\nThe number of audience members\n\n\n\n\n\n\n\nAthena:\nHow many people were there in the audience when you were onstage?\nKisegawa:\nWell, let's see. We drew a full house, so... I think there must have been fifty, maybe sixty people in the audience.\nAthena:\nThat's quite a lot, isn't it?\nPatches:\nExactly! I dropped a big, stinky bomb in front of all those people. It was a catastrophe, I tell you! I was sweating buckets from start to finish!\nAthena:\n(That sounds exactly like how Apollo performs in court sometimes...) I-I see. Thank you. As for that statement, Your Honor, I'd like to...\n\n\n\nHave it added\n\n\n\n\n\n\n\nAthena:\nYour Honor, could I please have that last statement added to Uendo's testimony?\nJudge:\nHmm... very well.\nAdds statement \"I think there must have been fifty, maybe sixty people in the audience.\" if not already added, or changes statement from \"The story I performed is called \"Tokisoba\" -- otherwise known as \"Time Soba.\"\" to \"I think there must have been fifty, maybe sixty people in the audience.\"\n\n\n\n\nLeave it out\n\n\n\n\n\n\n\nAthena: \n(I guess it doesn't really matter how many audience members there were.) Never mind, Your Honor. There's no need to add that statement to Uendo's testimony.\nJudge:\nAll right.\nLeads back to cross-examination\n\n\n\n\n\nWhat Uendo performed\n\n\n\n\n\n\n\nAthena:\nCan you tell me which rakugo story you performed?\nUendo:\nI could, but I'm not sure if it would mean anything to the uninitiated.\nAthena:\nW-Well, even if I might not get it... ...can't you at least try me?\nUendo:\nAll right. If you insist... The story I performed is called \"Tokisoba\" -- otherwise known as \"Time Soba.\"\nAthena:\n\"Time Soba,\" huh? (Maybe Uendo's right... He's only said the name of the routine, and I'm already lost.)\nNahyuta:\nAh... So you performed \"Time Soba,\" did you?\nAthena:\nWhat?! You know it, Prosecutor Sahdmadhi?!\nNahyuta:\nIn the course of my studies last night, I became familiar with a number of stories. I must say, defense, you would do well to prepare yourself better for your next trial.\nAthena:\nNnrrgh... Simon, what's \"Time Soba\" about?\nBlackquill:\nHmph. Look it up yourself.\nNahyuta:\nAllow me to give an overview. The story takes place on a winter's night. A man orders a bowl of soba at a street stall. \"How ya doin', sir? What can I get for ya?\" \"I see you've got seaweed-topped hanamaki soba, and mixed topping shippoku soba.\" \"I'll have a bowl of shippoku, my good man. It sure is cold tonight, isn't it?\" \"But there's nothing like a hot bowl of noodles and soup to warm the soul!\" \"Ya know it, sir! One skippoku, comin' right up!\" \"So, how's business?\" \"Not so great, sir.\" \"Is that so? Well, that's great, because things can only get better from here, right?\"\nJudge:\nWow, Prosecutor!\nNahyuta:\nThe customer talks on and on like this. Finally, when he is done eating, he goes to pay for his soba. \"So how much do I owe you?\" \"That'll be sixteen mon, sir.\" \"I see... Sorry, but I only have small change on me.\" \"I'll count the coins into your palm, so could you hold out your hand for me?\" \"One, two, three, four, five, six, seven, eight...\" \"Hey, what time is it?\" \"It's nine, sir.\" \"...Ten, eleven, twelve, thirteen, fourteen, fifteen, sixteen. Thanks, and bye!\"\nJudge:\nHa ha ha ha ha! very well done, Prosecutor Sahdmaadhi! That was excellent!\nAthena:\nHuh? I don't get it! What was so funny about that?\nBlackquill:\nTsk. Don't you see? The customer paid with coins, counting them out one by one. Then, just after counting \"eight\", he asked about the time... ...and the soba vendor answered with \"nine.\"\nAthena:\nOh! Now I get it! He made the vendor say \"nine,\" and then he continued counting from \"ten\"!\nBlackquill:\nExactly. He cheated the soba vendor out of one mon with his smooth talking. The story continues with another man who saw the whole things and tries to do the same. But he bungles up the trick, and ends up paying more than sixteen mon for his soba. The story ends on that as the punch line. You can look up the rest of the details yourself. Or, I'm sure Prosecutor Sad Monk over there would love to perform it for you after court.\nAthena:\nSo, basically, it's a story about a man cheating on his soba bill! That's kind of petty, isn't it?\nNahyuta:\nHmph. Is that really ALL you have to say about this classic story? \"Time Soba\" is such a well-known staple of rakugo that the skill of the artist is critical in--\nBlackquill:\n\nBlackquill:\nFine. So you studied a lot. But we haven't the time for a lecture detour right now, Prosecutor Sad Monk!\nJudge:\nAww... I wanted to hear a bit more... But, I suppose it is off-topic. Getting back to the matter at hand, Ms. Cykes, the witness stated that... \"The story I performed is called 'Tokisoba' -- otherwise known as 'Time Soba.'\" Would you like to add this statement to his testimony?\nAthena: \nHmm, should I have that statement added to the testimony?\n\n\n\nHave it added\n\n\n\n\n\n\n\nAthena:\nYes, Your Honor. I'd like to have it added.\nJudge:\nVery well.\nAdds statement \"The story I performed is called \"Tokisoba\" -- otherwise known as \"Time Soba.\"\" if not already added, or changes statement from \"I think there must have been fifty, maybe sixty people in the audience.\" to \"The story I performed is called \"Tokisoba\" -- otherwise known as \"Time Soba.\"\"\n\n\n\n\nLeave it out\n\n\n\n\n\n\n\nAthena:\n(The show's program doesn't seem all that relevant to this case...) I don't need it to be added at this time, Your Honor.\nJudge:\nI see. Very well.\nLeads back to cross-examinationUendo:\nI'll never be able to live down how terribly I bombed during that very important show.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nExcuse me for asking, but... do you bomb like that on a regular basis?\nKisegawa:\nWell, aren't YOU a regular rude daisy?! Do you really think a rakugo artist who regularly bombs would get promoted? In fact, I'm known as the Toneido School's \"Whirl-Uendo of Laughter,\" I'll have you know!\nAthena:\nI-Is that really true, Simon?\nBlackquill:\nThat nickname is a bit of a travesty, if you ask me. But his rakugo is solid and well-received, yes.\nAthena:\nI see... But, yeah. \"Whirl-Uendo of Laughter\" IS a big ol' stink bomb of a name, isn't it? Whew! What a relief! I thought it was just me!\nUendo:\n............\nAthena:\nI-I mean uh, \"Whirl-Uendo of Laughter\" is great! Funny stuff!\nPatches:\nHee hee. I'm glad you like it!Uendo:\nI think there must have been fifty, maybe sixty people in the audience.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSo there were about fifty to sixty people at the theater listening to your rakugo... ...and not one of them laughed?\nUendo:\nThat's right. Everybody was just staring in silence at me. It was simply awful.\nAthena:\n(Yikes. That does sound awful!) But with an audience of that size... ...is it even possible for not even one person to laugh?\nKisegawa:\nWhat are you trying to say?\nAthena:\nI'm saying, are you sure there were even people in the audience?! After all, no one would be laughing if there was no one there to begin with. \nPatches:\nO-Of course here were people in the audience! It was a full house, I tell you! Lots of regular. Want me to ask 'em all to come here? \nAthena:\nN-No... That's all right...\nBlackquill:\nDon't just press him on every statement at random. You have to put some thought into it! Use your head, Athena!\nAthena:\nEeeeek! (Simon's right. I have to be more careful with the testimony I draw out.)Uendo:\nThe story I performed is called \"Tokisoba\" -- otherwise known as \"Time Soba.\"Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThe story where a man cheats on his soba bill, right? Why do you think it didn't go over well?\nKisegawa:\nWell... I suppose I was a little nervous... It's a lot of pressure when you're the star of such an important show, you know?\nAthena:\nYou? Nervous? I thought you'd be all calm and collected, but I guess even you can get stage fright, huh.\nUendo:\nI wanted so badly to live up to the great name of \"Uendo\" that I inherited... ...that I guess I overperformed a little this time.\nAthena:\nWait, \"Uendo\" was the stage name of a former member of the Toneido School, right?\nUendo:\nThat's right. The name belonged to one of Shisho's former disciples who died of illness at a young age.\nAthena:\nWith the weight of a new name like that to carry on your shoulders... ...I can see why you were feeling the heat -- just like me! I'm carrying the weight of my entire agency on my shoulders right now!\nUendo:\nIn that case, can I count on your sympathy, and have you go a little easier on me?Present Invitation\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Uendo, isn't there something odd about the routine you performed?\"Athena:\nWith the audience as his witness... ...Uendo has a pretty unshakable alibi, doesn't he?Blackquill:\nYou're not giving up, are you? Where's that \"never-say-die\" spirit you displayed earlier?Athena:\nOf course I'm not giving up, Simon! I just KNOW Uendo has something to do with this case!Blackquill:\nBut how will you connect him to the crime when he has an alibi as strong as that?Athena:\nI-I don't know just yet... But I'm going to press his testimony and keep an eye out for contradictions!"
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "I've never met any personality named \"Owen.\"",
          "person": "Uendo",
          "present": []
        },
        {
          "testimony": "Patches was just blurting out nonsense in a panic.",
          "person": "Kisegawa",
          "present": []
        },
        {
          "testimony": "We're always aware, so we'd definitely notice if a personality like that showed up!",
          "person": "Patches",
          "present": []
        },
        {
          "testimony": "How dare you treat me like a criminal based on mere conjecture?!",
          "person": "Kisegawa",
          "present": []
        },
        {
          "testimony": "I had a sweet manju bun, but I didn't drink any saké.",
          "person": "Uendo",
          "present": [
            "Taifu's Note"
          ]
        }
      ],
      "noPresent": false,
      "newContext": "-- Uendo's Alibi --Uendo:\nI was onstage until just moments before I went into the dressing room.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nHow can you be sure it was you who was on that stage?\nUendo:\nAre you asking whether it could've been some imposter?\nAthena:\nI-I guess so.\nUendo:\nUnlike a big arena, a rakugo theater is a cozy, little place. It would be hard to fool an audience in such an intimate setting, don't you think?\nAthena:\nYeah, I guess you're right.\nUendo:\nGood. I'm glad we could clear that up, because I guess you could say...Kisegawa:\nThe entire audience was my witness.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nWas there anything special about the stage or your performance that you can tell me? For example, were the lights dimmer than usual? Were there any problems or accidents?\nKisegawa:\nNot a thing. Everything was the same as always. Mr. Prosecutor, you questioned the audience, didn't you?\nNahyuta:\nYes, of course. Apparently, nothing seemed amiss to them except, well... one small thing.\nAthena:\nOne small thing?\nPatches:\nOh... it's so embarrassing! I tried my best! Really, I did...Patches:\nBut my performance was a huge bust. Not a single soul laughed!Press\n\n\n\n\n\n\n\nAthena:\n \nAthena:\nDo you have any idea what went wrong?\nKisegawa:\nHmm... I'm not sure if it was my performance, or if it was just that particular audience... Or maybe it was the story I picked. But every entertainer knows that this kind of thing happens from time to time.\nAthena:\nI guess that makes sense... (Still, I wonder how he could've flopped at his own commemorative show? Hmm... Maybe I should dig into things a bit more...)\n\n\n\nThe number of audience members\n\n\n\n\n\n\n\nAthena:\nHow many people were there in the audience when you were onstage?\nKisegawa:\nWell, let's see. We drew a full house, so... I think there must have been fifty, maybe sixty people in the audience.\nAthena:\nThat's quite a lot, isn't it?\nPatches:\nExactly! I dropped a big, stinky bomb in front of all those people. It was a catastrophe, I tell you! I was sweating buckets from start to finish!\nAthena:\n(That sounds exactly like how Apollo performs in court sometimes...) I-I see. Thank you. As for that statement, Your Honor, I'd like to...\n\n\n\nHave it added\n\n\n\n\n\n\n\nAthena:\nYour Honor, could I please have that last statement added to Uendo's testimony?\nJudge:\nHmm... very well.\nAdds statement \"I think there must have been fifty, maybe sixty people in the audience.\" if not already added, or changes statement from \"The story I performed is called \"Tokisoba\" -- otherwise known as \"Time Soba.\"\" to \"I think there must have been fifty, maybe sixty people in the audience.\"\n\n\n\n\nLeave it out\n\n\n\n\n\n\n\nAthena: \n(I guess it doesn't really matter how many audience members there were.) Never mind, Your Honor. There's no need to add that statement to Uendo's testimony.\nJudge:\nAll right.\nLeads back to cross-examination\n\n\n\n\n\nWhat Uendo performed\n\n\n\n\n\n\n\nAthena:\nCan you tell me which rakugo story you performed?\nUendo:\nI could, but I'm not sure if it would mean anything to the uninitiated.\nAthena:\nW-Well, even if I might not get it... ...can't you at least try me?\nUendo:\nAll right. If you insist... The story I performed is called \"Tokisoba\" -- otherwise known as \"Time Soba.\"\nAthena:\n\"Time Soba,\" huh? (Maybe Uendo's right... He's only said the name of the routine, and I'm already lost.)\nNahyuta:\nAh... So you performed \"Time Soba,\" did you?\nAthena:\nWhat?! You know it, Prosecutor Sahdmadhi?!\nNahyuta:\nIn the course of my studies last night, I became familiar with a number of stories. I must say, defense, you would do well to prepare yourself better for your next trial.\nAthena:\nNnrrgh... Simon, what's \"Time Soba\" about?\nBlackquill:\nHmph. Look it up yourself.\nNahyuta:\nAllow me to give an overview. The story takes place on a winter's night. A man orders a bowl of soba at a street stall. \"How ya doin', sir? What can I get for ya?\" \"I see you've got seaweed-topped hanamaki soba, and mixed topping shippoku soba.\" \"I'll have a bowl of shippoku, my good man. It sure is cold tonight, isn't it?\" \"But there's nothing like a hot bowl of noodles and soup to warm the soul!\" \"Ya know it, sir! One skippoku, comin' right up!\" \"So, how's business?\" \"Not so great, sir.\" \"Is that so? Well, that's great, because things can only get better from here, right?\"\nJudge:\nWow, Prosecutor!\nNahyuta:\nThe customer talks on and on like this. Finally, when he is done eating, he goes to pay for his soba. \"So how much do I owe you?\" \"That'll be sixteen mon, sir.\" \"I see... Sorry, but I only have small change on me.\" \"I'll count the coins into your palm, so could you hold out your hand for me?\" \"One, two, three, four, five, six, seven, eight...\" \"Hey, what time is it?\" \"It's nine, sir.\" \"...Ten, eleven, twelve, thirteen, fourteen, fifteen, sixteen. Thanks, and bye!\"\nJudge:\nHa ha ha ha ha! very well done, Prosecutor Sahdmaadhi! That was excellent!\nAthena:\nHuh? I don't get it! What was so funny about that?\nBlackquill:\nTsk. Don't you see? The customer paid with coins, counting them out one by one. Then, just after counting \"eight\", he asked about the time... ...and the soba vendor answered with \"nine.\"\nAthena:\nOh! Now I get it! He made the vendor say \"nine,\" and then he continued counting from \"ten\"!\nBlackquill:\nExactly. He cheated the soba vendor out of one mon with his smooth talking. The story continues with another man who saw the whole things and tries to do the same. But he bungles up the trick, and ends up paying more than sixteen mon for his soba. The story ends on that as the punch line. You can look up the rest of the details yourself. Or, I'm sure Prosecutor Sad Monk over there would love to perform it for you after court.\nAthena:\nSo, basically, it's a story about a man cheating on his soba bill! That's kind of petty, isn't it?\nNahyuta:\nHmph. Is that really ALL you have to say about this classic story? \"Time Soba\" is such a well-known staple of rakugo that the skill of the artist is critical in--\nBlackquill:\n\nBlackquill:\nFine. So you studied a lot. But we haven't the time for a lecture detour right now, Prosecutor Sad Monk!\nJudge:\nAww... I wanted to hear a bit more... But, I suppose it is off-topic. Getting back to the matter at hand, Ms. Cykes, the witness stated that... \"The story I performed is called 'Tokisoba' -- otherwise known as 'Time Soba.'\" Would you like to add this statement to his testimony?\nAthena: \nHmm, should I have that statement added to the testimony?\n\n\n\nHave it added\n\n\n\n\n\n\n\nAthena:\nYes, Your Honor. I'd like to have it added.\nJudge:\nVery well.\nAdds statement \"The story I performed is called \"Tokisoba\" -- otherwise known as \"Time Soba.\"\" if not already added, or changes statement from \"I think there must have been fifty, maybe sixty people in the audience.\" to \"The story I performed is called \"Tokisoba\" -- otherwise known as \"Time Soba.\"\"\n\n\n\n\nLeave it out\n\n\n\n\n\n\n\nAthena:\n(The show's program doesn't seem all that relevant to this case...) I don't need it to be added at this time, Your Honor.\nJudge:\nI see. Very well.\nLeads back to cross-examinationUendo:\nI'll never be able to live down how terribly I bombed during that very important show.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nExcuse me for asking, but... do you bomb like that on a regular basis?\nKisegawa:\nWell, aren't YOU a regular rude daisy?! Do you really think a rakugo artist who regularly bombs would get promoted? In fact, I'm known as the Toneido School's \"Whirl-Uendo of Laughter,\" I'll have you know!\nAthena:\nI-Is that really true, Simon?\nBlackquill:\nThat nickname is a bit of a travesty, if you ask me. But his rakugo is solid and well-received, yes.\nAthena:\nI see... But, yeah. \"Whirl-Uendo of Laughter\" IS a big ol' stink bomb of a name, isn't it? Whew! What a relief! I thought it was just me!\nUendo:\n............\nAthena:\nI-I mean uh, \"Whirl-Uendo of Laughter\" is great! Funny stuff!\nPatches:\nHee hee. I'm glad you like it!Uendo:\nI think there must have been fifty, maybe sixty people in the audience.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSo there were about fifty to sixty people at the theater listening to your rakugo... ...and not one of them laughed?\nUendo:\nThat's right. Everybody was just staring in silence at me. It was simply awful.\nAthena:\n(Yikes. That does sound awful!) But with an audience of that size... ...is it even possible for not even one person to laugh?\nKisegawa:\nWhat are you trying to say?\nAthena:\nI'm saying, are you sure there were even people in the audience?! After all, no one would be laughing if there was no one there to begin with. \nPatches:\nO-Of course here were people in the audience! It was a full house, I tell you! Lots of regular. Want me to ask 'em all to come here? \nAthena:\nN-No... That's all right...\nBlackquill:\nDon't just press him on every statement at random. You have to put some thought into it! Use your head, Athena!\nAthena:\nEeeeek! (Simon's right. I have to be more careful with the testimony I draw out.)Uendo:\nThe story I performed is called \"Tokisoba\" -- otherwise known as \"Time Soba.\"Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThe story where a man cheats on his soba bill, right? Why do you think it didn't go over well?\nKisegawa:\nWell... I suppose I was a little nervous... It's a lot of pressure when you're the star of such an important show, you know?\nAthena:\nYou? Nervous? I thought you'd be all calm and collected, but I guess even you can get stage fright, huh.\nUendo:\nI wanted so badly to live up to the great name of \"Uendo\" that I inherited... ...that I guess I overperformed a little this time.\nAthena:\nWait, \"Uendo\" was the stage name of a former member of the Toneido School, right?\nUendo:\nThat's right. The name belonged to one of Shisho's former disciples who died of illness at a young age.\nAthena:\nWith the weight of a new name like that to carry on your shoulders... ...I can see why you were feeling the heat -- just like me! I'm carrying the weight of my entire agency on my shoulders right now!\nUendo:\nIn that case, can I count on your sympathy, and have you go a little easier on me?Present Invitation\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Uendo, isn't there something odd about the routine you performed?\"Athena:\nWith the audience as his witness... ...Uendo has a pretty unshakable alibi, doesn't he?Blackquill:\nYou're not giving up, are you? Where's that \"never-say-die\" spirit you displayed earlier?Athena:\nOf course I'm not giving up, Simon! I just KNOW Uendo has something to do with this case!Blackquill:\nBut how will you connect him to the crime when he has an alibi as strong as that?Athena:\nI-I don't know just yet... But I'm going to press his testimony and keep an eye out for contradictions!Athena:\nUendo, isn't there something odd about the routine you performed?Uendo:\nOdd? N-No, I don't think there's anything odd about it.Athena:\nBut that's exactly what I find odd -- the fact that you don't think it's odd.Nahyuta:Nahyuta:\nWe are discussing the witness's alibi at the moment, defense. The show's program is completely irrelevant.Athena:Athena:\nThat's where you're wrong, Prosecutor Sahdmadhi! The reason being, it contradicts the statement the witness just made! Uendo, do you know what this is?Uendo:\nN-No. Wh-What is it...?Athena:\nThis is an invitation to the show, sent from Master Toneido to Prosecutor Blackquill. Included in the invitation is a rundown of the show's program, which clearly states... ...that \"Time Soba\" was to be performed by Master Toneido himself!Uendo:\nPYOOOOOOOOOOO!Nahyuta:\nNo!Athena:\nUendo! Why did you perform the routine your master was scheduled to do?!Kisegawa:\nWell... You see... The reason for that is...Uendo:\nHow do I say this... You see... Um, let's say it was a, uh... a prank...Patches:\nTh-That's right! It was just a little joke, you see! H-Hee hee! I was trying to surprise Shisho by performing his routine before he did!Athena:\n(I don't know if I buy that. Was doing the victim's routine just for laughs, or...? Hey... Didn't Simon happen to hear \"Time Soba\" coming from the dressing room... ...during Uendo's performance onstage? It seems like too much of a coincidence... Wait, can it be...?!)Blackquill:\nWhat's the matter? You look like a hen with a dozen eggs to lay.Athena:\nS-Stop comparing me to birds!Blackquill:\nThen cease this birdbrained timidity. If something has occured to you, then lay it out for us already! Don't breed resentment in those watching your performance!Athena:\nO-Okay, okay! I don't have a ton of confidence in this theory, but... here goes! It looks like Uendo's alibi checks out, Your Honor, but... ...even though he was onstage at the time... ...he may have been trying to obfuscate a crucial detail about this case!Judge:\nAre you referring to... the soba bill the man tried to skimp on in the witness's story?Athena:\nI'm not talking about the rakugo story, Your Honor!Judge:\nOh! I-I'm sorry! But then, what are you talking about, Ms. Cykes?Athena:\nWhat Uendo may have been trying to deceive us about was...The cause of the victim's death\n\n\n\n\n\n\n\nAthena:\nBy performing \"Time Soba,\" a story that featured soba noodles... Uendo tried to fool us into thinking that the victim had been drowned in soba broth!\nPatches:\nCome on! Not even a jester like me thinks the cops would be fooled by such a silly trick.\nKisegawa:\nBesides, the story I was originally going to do, \"Soba Glutton,\" also features soba.\nAthena:\n...Oh. Right. I-I knew that...I just wanted to see if YOU knew that I knew.\nJudge:\nMs. Cykes! Who's the one trying to deceive the court, again?!\nWidget:\nCrash and burn!\nAthena:\nI'm sorry, Your Honor. I'll get it right this time.\nLeads back to:\n\"What Uendo may have been trying to deceive us about was...\"The time of the victim's death\n\n\n\n\n\n\n\nLeads to:\n\"Uendo tried to deceive us about the time of the victim's death!\"What the victim was to perform\n\n\n\n\n\n\n\nAthena:\nUendo tried to deceive us about what rakugo routine the victim was to perform! Taifu Toneido wasn't actually supposed to do \"Time Soba\" at all!\nUendo:\nBut Shisho's scheduled routine is written right here in the invitation. \nPatches:\nHere, why don't you read what Shisho was gonna perform out loud? \nAthena:\nUm... It says \"Time Soba\"...\nPatches:\n\"You just earned yourself a penalty, defense!\"\nJudge:\nH-Hey! That's MY line!\nAthena:\nI'm sorry, Your Honor. I'll get it right this time. Promise.\nLeads back to:\n\"What Uendo may have been trying to deceive us about was...\"Athena:\nUendo tried to deceive us about the time of the victim's death!Judge:\nWHAAAAAAAAAAAT?!Patches:\nEeeeeeeeeeek!Nahyuta:Nahyuta:\nWhat gibberish! Prosecutor Blackquill even testified to the time of the victim's death!Athena:\nI know. But he only testified that way because he and Geiru had been completely taken in!Judge:\nYou mean... by the soba bill thing?Athena:\nWould you please forget about the story for a second, Your Honor?!Blackquill:\nI was deceived...?Nahyuta:\nPray tell, how did Uendo manage to deceive two people while he was performing onstage?Athena:\nThat's easy. All he had to do was use a certain \"prop\" in the dressing room.Judge:\nOh?! And what might that be?Athena:\nThe prop Uendo used was...Present TV\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"This TV was used to view what was happening on the stage.\"Present anywhere else\n\n\n\n\n\n\n\nAthena:\n\nJudge:\nTHAT'S what Uendo used to take in both Prosecutor Blackquill and Geiru? How could the witness fool anyone with that?\nAthena:\n............Huh?\nJudge:\nYou just tried to take ME in, didn't you, Ms. Cykes? Now it's your turn to take in a penalty!\nBlackquill:\nI believe you are right to suspect the use of a prop. It's just a matter of finding something he could use to fool someone outside the room with.\nLeads back to:\n\"The prop Uendo used was...\"Athena:\nThis TV was used to view what was happening on the stage. Prosecutor Blackquill, when you came to the dressing room, what was Uendo doing?Blackquill:\nHe was... performing \"Time Soba\"! Blast! Could it be...?!Athena:\nYes. It could, and it was! What you and Geiru heard was NOT Master Toneido practicing his routine. It was Uendo's performance, as heard through this TV monitor's speakers!Uendo:\nPyoooooooo!Nahyuta:\n!Judge:\nWH-WHAAAAAAAAAAAAAAAT?!Athena:\nWith the TV just inside the inner door of the dressing room... ...it could easily be heard from the hallway outside.Blackquill:\nAnd because we knew that Master Toneido was scheduled to perform \"Time Soba\"... ...we were easily manipulated into thinking he was still alive at the time, rehearsing!Athena:\nYes. Your knowledge of the day's program is why the two of you could be fooled this way. Simon, did the voice you hear belong to Master Toneido?Blackquill:\nHmph. With the doors in the way, I couldn't tell exactly who the voice belonged to. But because I heard \"Time Soba\", I just assumed it was Master Toneido. I can't believe I was taken in by such a simple mind game.Nahyuta:Nahyuta:\nAll of that is mere conjecture! Where is your proof, defense?!Athena:Athena:\nUendo moved the TV back when he \"discovered\" the body. After all, he couldn't very well leave it by the door... ...because then someone might figure out the trick he'd been playing!Nahyuta:\nNgh!Athena:\nAnd there's one more thing about Uendo's actions that's suspicious.Judge:\nAnd that is...?Athena:\nThe fact that he flopped so badly on such an important occasion.Judge:\nWhat's so suspicious about that? Even pros slip up once in a while, you know.Athena:\nBut I believe that this time, it was intentional. Because Uendo knew it'd be strange to hear laughter coming from the dressing room!Judge:\nOh, my!Patches:\nYipes!Athena:\nIt's all just a bit too perfect to be sheer coincidence! Plus, if the voice Prosecutor Blackquill and Geiru heard was due to Uendo's scheming... then the victim's time of death could have been earlier than 4 PM! In other words, Uendo could have killed Master Toneido himself!Uendo:\nPWOOOOOOOO!Blackquill:\nWe've got you by the stones now, Uendo! So you'd better confess everything!Uendo:\nNgh...Nahyuta:\n............Judge:\nWell, witness? What do you have to say for yourself?Athena:\nWe demand an explanation!Uendo:\n............Athena:\nUendo!Uendo:\nNnngh... ...I-I confess. I-I tampered with the crime scene.Nahyuta:\n...Is it the defense's claim that Uendo Toneido is the true murderer in this case?Athena:\nIf he tampered with the crime scene, then we have to at least consider him a suspect!Kisegawa:Kisegawa:\nNow wait just one minute! Yes, I admit to messing with the dressing room, but I didn't kill Shisho!Athena:\nThen why did you tamper with the crime scene?!Kisegawa:\nI... I refuse to answer that question!Athena:\nWhat?!Nahyuta:Nahyuta:\nIf you suspect this witness, then I have a question for you.Athena:\n(What could it be this time?)Nahyuta:\nUendo had absolutely no reason to murder Taifu Toneido. After all, why would Uendo kill the man who recognized his skills and promoted him?Athena:\nOH! W-Well... His motive... was, um... (I can't think of a single thing!)Nahyuta:\nIt appears you are also not aware of one other fact.Athena:\nA-And that is?Nahyuta:\nThat the accused visited the dressing room before 4 PM as well. Is it not natural, then, to suppose that the accused killed the victim at that time?Athena:\nWHAT? Nobody told me Mr. Whet had also gone there BEFORE 4 PM!Nahyuta:\nWe were only discussing the time frame after 4 PM, so I didn't think to mention it. But now that you have made the time period before 4 PM relevant...Athena:\n(Uh-oh. I don't like where this is going...)Nahyuta:\nSo, you really do not know what our client was doing during that time frame, do you?Athena:\nWell, it was all very sudden, and, uh... (Why did you wait until the very last second to contact me, Simon?!)Blackquill:\nDon't you give me that look! And just so you know, Bucky never told me he had visited the master before 4 PM, either.Athena:\nArgh! This sort of thing is exactly why that prosecutor keeps calling us \"unprepared\"!Judge:\nThe defense will stop squabbling this instant!Athena:\nS-Sorry, Your Honor.Judge:\nProsecutor Sahdmadhi, please continue.Nahyuta:\nThank you, Your Honor. Defense. You know of the soba-making implements in the dressing room, correct?Athen:\n(Is he talking about the equipment for making soba noodles?)Blackquill:\nYou speak of the large bowl that is used to mix buckwheat flour and water... ...the long rolling pin, and the special knife that is used to cut the dough into noodles?Nahyuta:\nPrecisely. These tools all came from the accused's soba shop.Athena:\nYou mean, they didn't belong to Master Toneido?Nahyuta:\nMr. Whet had visited the dressing room to give the victim a soba-making lesson. And that visit was before 4 PM. I'm afraid that after the accused kneaded the dough and made those noodles... ...he committed the act of murder.Athena:\nB-But wait! That doesn't add up! If Mr. Whet killed the victim before 4 PM, why would he return to that room at a later time?!???:Bucky:\nWhet Soba! Your kit and caboodle when it comes to noodles!Judge:\nOh, my!Bucky:\nHiya, Miz Chickadee... Heya, Simey! The reashon I went is 'cause Master Toneido ordered uncooked noodles. *ulp*Athena:\nM-Mr. Whet...Bucky:\nYeshterday, I brought noodle-making toolsh to the dresshing room at around 2 PM. Dat'sh when Master Toneido ordered uncooked soba noodlesh t' shtock up on.Athena:\nUncooked noodles to stock up on?Bucky:\nYesh, ma'am. Master Toneido kept a supply of soba noodles from my shop in hish fridge. He only had one sherving left, so I went back t' my shop t' get some more. *hic*Athena:\n(One serving of noodles in the fridge? But I thought the fridge was practically empty...? Hmm... Anyway, the whereabouts of the missing noodles isn't all that important now.)Blackquill:\nYou ran into me and Geiru when you came back to deliver the uncooked soba, correct?Bucky:\nDat'sh right, Simey! I made time outta my bust day to deliver him the noodlesh! And ya know what? He ignored me when I called to him from th' inner doorway! He jusht kept mumbling rakugo lines fer ages! So I got mad and went back to my soba shop!Athena:\nAh, so that's why you got mad. (If what he's saying is true, then there's no way he could be the murderer!)Bucky:\nI shwear I'm telling the truth, Miz Chicka--- *urp*Judge:\nB-Bailiff, quick! Get this man to the infirmary!Judge:\nWell. I daresay he's quite a handful!Athena:\nYour Honor, please accept the statements Mr. Whet made just now into evidence!Nahyuta:Nahyuta:\nI believe the accused's statement about going to the room at around 2 PM is true. For it falls within the the victim's estimated time of death.Judge:\nHmm... That opens up the possibility that the crime was committed between 2 and 4 PM. That's some critical information!Nahyuta:\nYes, Your Honor. But other than that one point, Mr. Whet's statements are dubious and without proof.Athena:Athena:\nBut they are the words of the defendant himself! Simon, back me up, here!Blackquill:\nHmph. He has a point. If I were the prosecutor, I wouldn't accept them, either.Judge:\nWhile I understand the defense's feelings on the matter... ...this court is unable to accept anything other than the time the defendant made his visit.Athena:\n(N-Now what do I do...!)Nahyuta:\nI trust you have no further objections, defense. At last, the time has come to send the soul of the victim onward to the Twilight Realm.Blackquill:Blackquill:\nWhat are you yammering on about, Prosecutor Sad Monk? We still have something we need to question Uendo about!Athena:\n(We do? Like what?)Blackquill:\nWell, don't just stand there!Athena:\nB-But we don't have any evidence left to present!Blackquill:\nHave you forgotten already? Isn't there still a hidden witness you have yet to question?Athena:\n(A hidden witness...? Oh! That's right!) Your Honor! There's still one more issue we haven't finished discussing yet!Judge:\nOh? And what is this bit of unfinished business?Athena:\nWe haven't finished discussing this issue related to Uendo...!Uendo's alibi\n\n\n\n\n\n\n\nAthena:\nWe need to discuss Uendo's alibi in further detail. \nNahyuta:\n...Let it go, and move on. Uendo does not have an alibi, but he has no motive, either.\nJudge:\nAnd you, Ms. Cykes, don't seem to have much of a clue. \nBlackquill:\nHeh. I know you know what's left to discuss.\nLeads back to:\n\"We haven't finished discussing this issue related to Uendo...!\"The \"Time Soba\" story\n\n\n\n\n\n\n\nAthena:\nThat \"Time Soba\" story... You can't fool somebody just by asking them the time!\nNahyuta:\nI see. That's fair enough. Incidentally, do you know how many people there are in this courtroom right now? \nAthena:\nHm? Let's see... One, two, three...\nNahyuta:\nWhat time is it, defense?\nAthena:\nOh, It's around ten-thirty. ... Hm? Where was I again? ...Thirty-one? Or was it thirty-two?\nJudge:\nWow, it was surprisingly easy to fool you, Ms. Cykes!\nBlackquill:\nHeh. I know you know what's left to discuss.\nLeads back to:\n\"We haven't finished discussing this issue related to Uendo...!\"Owen\n\n\n\n\n\n\n\nLeads to:\n\"We still have to discuss the possibility of a fourth personality -- the one named \"Owen\"!\"Athena:\nWe still have to discuss the possibility of a fourth personality -- the one named \"Owen\"!Judge:\nAre you suggesting that this fourth personality of Uendo's might be the true culprit?Uendo:\n...Geez. Not that again. I told you we don't know anything about this \"Owen\"!Athena:\nLook. Uendo. I know you don't have any motive to kill your master, but... ...this \"Owen\" may have one for all we know!Blackquill:\nCome clean now, Uendo. You've got another personality stashed away, haven't you?!Athena:\nPlease tell us everything you know about Owen!Nahyuta:\nThat's enough! The witness has already stated that he knows not of any \"Owen\" character!Patches:\nBravo! You tell 'em, Mr. Prosecutor! Hee hee!Blackquill:\nHey, Patches. If you claim you don't know Owen when you really do, that's tantamount to perjury. If you want to exercise your right to remain silent, however... well, that's a different story.Nahyuta:\nDo not listen to the depraved prosecutor, witness. You will be tainted with his evil.Blackquill:\nDo you have nay idea how dark and cold a prison cell is? Heh heh heh.Patches:\nI-I exercise my right to remain silent!Blackquill:\nWhat's this, now? Changing horses in midstream, are you?Patches:\nSh-Shut up! I will remain silent, and that's it!Kisegawa:\nPatches, you fool! You stay out of this!Blackquill:\nHa ha ha! Patches is not the brightest bulb in that box you call a noggin, is he? The fact that he switched from \"I don't know any Owen\" to \"I will remain silent\"... ...is proof that he DOES know about Owen!Athena:\n(Th-There it is again -- Simon's formidable psychological manipulation tactic. I'm sure glad he's on MY side today...)Nahyuta:Nahyuta:\nYou dirty, despicable, depraved prosecutor! You were leading the witness! Witness! There is no need for you to submit yourself to the defense's questioning!Athena:Athena:\nYour Honor! Uendo is definitely hiding something! Please allow me to question the witness about the existence of Owen!Judge:\nHmm... I suppose only this witness can confirm or deny the existence of Owen for us... Very well. I will allow the defense to proceed.Nahyuta:\nGrrngh... Pohlkunka...!Witness Testimony-- About Owen --Uendo:\nI've never met any personality named \"Owen.\"Kisegawa:\nPatches was just blurting out nonsense in a panic.Patches:\nWe're always aware, so we'd definitely notice if a personality like that showed up!Kisegawa:\nHow dare you treat me like a criminal based on mere conjecture?!Athena:\n(Wow. How am I supposed to deal with the testimony of three personalities...?)Blackquill:\nUnless you can prove the existence of Owen here, it's all over. You'd best screw your courage to the sticking place and attack their testimony head-on!Athena:\nA-All right. I will! Just stop piling the pressure on me! (I have to draw out some info -- anything to drag Owen out into the open!)Cross ExaminationCross Examination-- About Owen --Uendo:\nI've never met any personality named \"Owen.\"Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\n\"Met,\" huh? Is that how you experience each other? Like people meeting on the street?\nUendo:\nWell, it's more like all three of us are always here. And the personality that's most suited to the moment is the one that comes out.\nAthena:\nSo when you're out, Uendo, what are the other two doing?\nPatches:\nWell, we never know when our turn will come, right?\nKisegawa:\nSo we stand by, and listen.\nAthena:\nSo that means all three of you share the same memories?\nUendo:\nI never really thought about it, but I guess that's right.\nAthena:\nI see. Thank you. Please continue.Kisegawa:\nPatches was just blurting out nonsense in a panic.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nPatches, can I have a word with you, please?\nPatches:\nHee hee! Why, hello! You rang?\nAthena:\nYou said, at first, that you didn't know anybody named Owen. But then you exercised your right to remain silent. Were you afraid of committing perjury?\nPatches:\nWell, er... You see...\nKisegawa:\nI'll take over from here, if you don't mind! Listen, I hate to say it, but Patches is about as smart as a sack of rocks. If you grill him with a bunch of highfaluting words, he's going to want to keep silent.\nAthena:\n...I see. So looking after loose-tongued Patches... ...is your role, is it, Ms. Kisegawa?\nKisegawa:\nWell, I don't know about that. But, anyway... ...I do know that Patches was just flustered, and that's why he decided to remain silent.Patches:\nWe're always aware, so we'd definitely notice if a personality like that showed up!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nBut what if, for some reason, you three were unconscious at the time of the incident? If the three of you weren't alert and aware, what would happen?\nUendo:\nWh-What would happen? I'm not even sure what you mean...\nAthena:\nI mean, you three share the same memories, right? But what if Owen is different -- what if he has memories separate from yours? Maybe Owen emerges when the three of you are unaware or unconscious.\nUendo:\nN-Ngh...!\nNahyuta:\n\nNahyuta:\nInstead of speaking as if this \"fourth personality\" is a foregone conclusion... ...I suggest you prove his existence first.\nAthena:\nWell, we've already seen three personalities! A fourth wouldn't be a stretch!\nNahyuta:\nYou dishonor the victim and this court by jumping to such conclusions without proof.\nAthena:\nHave you ever heard these old sayings, Prosecutor Sahdmadhi? \"What happens twice will happen thrice.\" \"If you see 1, there are likely 30 in your home.\" I'm basing my theory on such premises!\nKisegawa:\nComparing us to cockroaches -- do we bug you that much, girlie?!\nNahyuta:\nBut how do you intend to prove it? How will you prove that all three personalities became \"unconscious,\" as you say? Unless you can do that, all of this talk is merely empty speculation.\nAthena:\nW-Well... I...\nBlackquill:\nDon't be so timid! If you don't have it, then find it! Look for something that could render Uendo and the others unconscious!\nAthena:\n(Simon's right. I can't back down now. For my client Mr. Whet, I have to...! ...Wait, Mr. Whet?)\n\n\nBucky:\nLemme resht? Hah! Mehbee if I were a lump o' regular flour dough fer udon noodles! But I'm fresh, like my soba! 'N y'don't let soba dough resht... 'S all about the \"three freshes\"! Grind da buckwheat seeds fresh, cut da dough fresh, and boil da noodles fre-- *urp*\nBlackquill:\nH-He's blacked out!\n\n\nAthena:\n(Mr. Whet... Falling unconscious... Wait a minute! I think I've got it!)\nJudge:\nMs. Cykes? Do you have proof to back up your theory?\n\n\n\nYes\n\n\n\n\n\n\n\nAthena:\nYes, Your Honor, I do! The proof is right here in this crime photo!\nJudge:\nIt is?! In that case, please point out what supports your theory.\nAthena:\nThis, most likely, is what caused Uendo to lose consciousness!\n\n\n\nPresent \"Camel\" bottle\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"This is probably what made Uendo lose consciousness!\"\n\n\n\n\nPresent anywhere else\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nUendo was most likely smacked over the head with this, and that's why he passed out!\nPatches:\nI may be soft in the noggin, but I don't see a single bruise on my head. Do you?\nAthena:\nWell, then, maybe it wasn't so much a \"smack\" as... ...a swing and a miss!\nJudge:\nWell! What a coincidence, defense! Your assertion was a swing and a miss, too!\nBlackquill:\nAthena, Uendo didn't need to be hit over the head to lose consciousness. Lord knows Bucky has passed out several times today without being \"smacked.\"\nJudge:\nMs. Cykes, please point out this proof of yours.\nLeads back to:\n\"This, most likely, is what caused Uendo to lose consciousness!\"\n\n\nAthena:\nThis is probably what made Uendo lose consciousness!\nBlackquill:\nAh, yes, the saké. And isn't it just like Master Toneido to pick a fine brand like \"Camel.\"\nAthena:\n\"Saké\"...? Oh, you mean \"rice wine\"?\nKisegawa:\n\nKisegawa:\nOh, please. Don't call it \"rice wine.\" That's so unsophisticated. And it's not even \"wine.\" Hmph. Silly girl.\nBlackquill:\nI must agree -- you need to become more cultured, Athena.\nAthena:\nTomayto, tomahto. It's made of rice, and people get drunk from drinking it, right?\nBlackquill:\nIt's called \"saké.\" End of story.\nAthena:\nFine! \"Saké\" it is, then. (¡Ay, caramba! Everybody's so touchy about these things!)\nBlackquill:\nI recall Master Toneido would often have a drink or two before performing. He said it made him more eloquent. Drinking too much of the stuff can make one lose consciousness, though, of course.\nAthena:\nAnd look! There were two glasses on the table! Uendo, I believe you master offered you some rice w-- I mean, saké. And then, you must've drank too much and passed out. That's when your fourth personality, Owen, emerged!\nKisegawa:\nI drank saké? Oh, that's a good one!\nUendo:\nWe have a real sweet tooth, you see, so, yes, we did accept a sugary, red-bean bun... ...but since we really dislike saké, we said no, thank you to that.\nPatches:\nBelieve it or not, we're real weak when it comes to booze. Hee hee! Even a tiny drop can knock us right out!\nUendo:\nSo, you see... I had a sweet manju bun, but I didn't drink any saké.\nAthena:\nWhat? But that can't be right! The defense demands that the glasses be examined right away!\nNahyuta:\nYou amateur! Did you really think I had not already done so? Your foolishness is beyond the pale.\nAthena:\nD-Don't tell me...\nNahyuta:\nThere was no trace of the witness having touched either of the glasses, naturally.\nAthena:\nR-Right... Of course...\nJudge:\nMs. Cykes, would you like the witness's statement added to his testimony?\nAthena:\nY-Yes, please, Your Honor.\nJudge:\nVery well.\nAdds statement \"I had a sweet manju bun, but I didn't drink any saké.\" if not already added\n\n\n\n\nNo\n\n\n\n\n\n\n\nAthena:\nI'm afraid not, Your Honor.\nBlackquill:\nOf course you do, Athena! Have another good look at the crime scene photo.\nAthena:\nO-okay... (Hmm... Something that could've made the three of them lose consciousness... Was there anything like that in the dressing room?)\nLeads back to cross-examinationKisegawa:\nHow dare you treat me like a criminal based on mere conjecture?!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSince nobody involved with this case is named \"Owen\"... ...we have to explore the possibility that he's a hidden forth personality of yours. After all, the cards read \"OWEN 4TH\"!\nUendo:\nBut how can you be so sure that that's what the cards really mean?\nAthena:\nWh-What else could they possibly mean?\nUendo:\nWell, for example, \"Owen, the fourth hitter\"!\nAthena:\nWh-Who in the world is that?!\nPatches:\nHe's a baseball player! A really great one, too! Owen Gonzales, thirty-six years old. He's a \"cleanup,\" fourth-place hitter, of course.\nAthena:\nIf such a famous baseball player was there, hanging around in the theater... ...he would've drawn a lot of attention to himself, don't you think?\nUendo:\nWell, then, how about this? Maybe it means \"OWE N 4 TH\", like, \"I owe 'N' four thousand.\"\nAthena:\nAnd who is this mysterious \"N\" person?\nUendo:\nWhat? \"N\" isn't a person! It was Shisho's favorite hobby shop, \"N-Joy.\" He was a huge model train collector.\nAthena:\nI-I see...\nUendo:\nMaybe he owed the hobby shop some money. So he left a note to remind himself.\nAthena:\nIn karuta cards on a table?\nKisegawa:\nShisho worked in mysterious ways.\nAthena:\nAre you even taking this seriously?!\nKisegawa:\nI'm being completely serious! The point is, \"OWEN 4TH\" could mean just about anything!\nAthena:\nArngh... I-I suppose you're right. (I guess I'd better approach this from a different angle...)Uendo:\nI had a sweet manju bun, but I didn't drink any saké.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSo if you had even a tiny sip of saké, you'd conk right out, huh. That's why you didn't touch the glass that Master Toneido offered, correct?\nUendo:\nYes, that's right.\nAthena:\nThen maybe you ate something that had saké in it as an ingredient?\nUendo:\nI don't recall doing anything like that.\nAthena:\n(Hmm... He doesn't \"recall\" doing it... But that doesn't necessarily mean he didn't. He just might not have known that he did... I'd better take another good look at the evidence.)Present Taifu's Note\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"This shows what, most likely, made Uendo lose consciousness!\"Before adding statement\n\n\n\n\n\n\n\nAthena:\n(I should've figured that he's not going to just give in like that...) There's gotta be some sort of key to unlocking Uendo's fourth personality...\nBlackquill:\nPersonally, I can't wait to see who will slip up first. But it'd better not be you.\nAthena:\nWell, it won't! (And if I can't find any inconsistencies, there's always one thing to do, and that's press!)After adding statement\n\n\n\n\n\n\n\nBlackquill:\nSo he didn't drink any saké, huh?\nAthena:\nOh boy... Now we're in trouble...\nBlackquill:\nThat kind of answer is exactly why Sad Monk keeps insulting you. Now, use your head! There are countless ways Uendo could've gotten saké into his mouth besides drinking it.\nAthena:\nW-Well, I don't know about the \"countless\" part, but...\nBlackquill:\nBut nothing. Give it some thought, and you'll figure something out.\nAthena:\n(So the witness must've had something that contained saké... Is there anything in the Court Record that hints at something like that...?)"
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "Yeah, I visited the dressing room during that time to make a courtesy call after my act.",
          "person": "Geiru",
          "present": []
        },
        {
          "testimony": "Shisho and Owen were in there, but they were both snoring up a storm.",
          "person": "Geiru",
          "present": []
        },
        {
          "testimony": "I saw the note Shisho left, so I just left. Didn't wanna disturb 'em, ya know.",
          "person": "Geiru",
          "present": []
        },
        {
          "testimony": "The perfume Owen smelled musta been left over from when I visited.",
          "person": "Geiru",
          "present": []
        },
        {
          "testimony": "I didn't see anything funny near Shisho, and I didn't touch anything in the room.",
          "person": "Geiru",
          "present": [
            "Crime Scene Report or Karuta Cards"
          ]
        }
      ],
      "noPresent": false,
      "newContext": "-- About Owen --Uendo:\nI've never met any personality named \"Owen.\"Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\n\"Met,\" huh? Is that how you experience each other? Like people meeting on the street?\nUendo:\nWell, it's more like all three of us are always here. And the personality that's most suited to the moment is the one that comes out.\nAthena:\nSo when you're out, Uendo, what are the other two doing?\nPatches:\nWell, we never know when our turn will come, right?\nKisegawa:\nSo we stand by, and listen.\nAthena:\nSo that means all three of you share the same memories?\nUendo:\nI never really thought about it, but I guess that's right.\nAthena:\nI see. Thank you. Please continue.Kisegawa:\nPatches was just blurting out nonsense in a panic.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nPatches, can I have a word with you, please?\nPatches:\nHee hee! Why, hello! You rang?\nAthena:\nYou said, at first, that you didn't know anybody named Owen. But then you exercised your right to remain silent. Were you afraid of committing perjury?\nPatches:\nWell, er... You see...\nKisegawa:\nI'll take over from here, if you don't mind! Listen, I hate to say it, but Patches is about as smart as a sack of rocks. If you grill him with a bunch of highfaluting words, he's going to want to keep silent.\nAthena:\n...I see. So looking after loose-tongued Patches... ...is your role, is it, Ms. Kisegawa?\nKisegawa:\nWell, I don't know about that. But, anyway... ...I do know that Patches was just flustered, and that's why he decided to remain silent.Patches:\nWe're always aware, so we'd definitely notice if a personality like that showed up!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nBut what if, for some reason, you three were unconscious at the time of the incident? If the three of you weren't alert and aware, what would happen?\nUendo:\nWh-What would happen? I'm not even sure what you mean...\nAthena:\nI mean, you three share the same memories, right? But what if Owen is different -- what if he has memories separate from yours? Maybe Owen emerges when the three of you are unaware or unconscious.\nUendo:\nN-Ngh...!\nNahyuta:\n\nNahyuta:\nInstead of speaking as if this \"fourth personality\" is a foregone conclusion... ...I suggest you prove his existence first.\nAthena:\nWell, we've already seen three personalities! A fourth wouldn't be a stretch!\nNahyuta:\nYou dishonor the victim and this court by jumping to such conclusions without proof.\nAthena:\nHave you ever heard these old sayings, Prosecutor Sahdmadhi? \"What happens twice will happen thrice.\" \"If you see 1, there are likely 30 in your home.\" I'm basing my theory on such premises!\nKisegawa:\nComparing us to cockroaches -- do we bug you that much, girlie?!\nNahyuta:\nBut how do you intend to prove it? How will you prove that all three personalities became \"unconscious,\" as you say? Unless you can do that, all of this talk is merely empty speculation.\nAthena:\nW-Well... I...\nBlackquill:\nDon't be so timid! If you don't have it, then find it! Look for something that could render Uendo and the others unconscious!\nAthena:\n(Simon's right. I can't back down now. For my client Mr. Whet, I have to...! ...Wait, Mr. Whet?)\n\n\nBucky:\nLemme resht? Hah! Mehbee if I were a lump o' regular flour dough fer udon noodles! But I'm fresh, like my soba! 'N y'don't let soba dough resht... 'S all about the \"three freshes\"! Grind da buckwheat seeds fresh, cut da dough fresh, and boil da noodles fre-- *urp*\nBlackquill:\nH-He's blacked out!\n\n\nAthena:\n(Mr. Whet... Falling unconscious... Wait a minute! I think I've got it!)\nJudge:\nMs. Cykes? Do you have proof to back up your theory?\n\n\n\nYes\n\n\n\n\n\n\n\nAthena:\nYes, Your Honor, I do! The proof is right here in this crime photo!\nJudge:\nIt is?! In that case, please point out what supports your theory.\nAthena:\nThis, most likely, is what caused Uendo to lose consciousness!\n\n\n\nPresent \"Camel\" bottle\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"This is probably what made Uendo lose consciousness!\"\n\n\n\n\nPresent anywhere else\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nUendo was most likely smacked over the head with this, and that's why he passed out!\nPatches:\nI may be soft in the noggin, but I don't see a single bruise on my head. Do you?\nAthena:\nWell, then, maybe it wasn't so much a \"smack\" as... ...a swing and a miss!\nJudge:\nWell! What a coincidence, defense! Your assertion was a swing and a miss, too!\nBlackquill:\nAthena, Uendo didn't need to be hit over the head to lose consciousness. Lord knows Bucky has passed out several times today without being \"smacked.\"\nJudge:\nMs. Cykes, please point out this proof of yours.\nLeads back to:\n\"This, most likely, is what caused Uendo to lose consciousness!\"\n\n\nAthena:\nThis is probably what made Uendo lose consciousness!\nBlackquill:\nAh, yes, the saké. And isn't it just like Master Toneido to pick a fine brand like \"Camel.\"\nAthena:\n\"Saké\"...? Oh, you mean \"rice wine\"?\nKisegawa:\n\nKisegawa:\nOh, please. Don't call it \"rice wine.\" That's so unsophisticated. And it's not even \"wine.\" Hmph. Silly girl.\nBlackquill:\nI must agree -- you need to become more cultured, Athena.\nAthena:\nTomayto, tomahto. It's made of rice, and people get drunk from drinking it, right?\nBlackquill:\nIt's called \"saké.\" End of story.\nAthena:\nFine! \"Saké\" it is, then. (¡Ay, caramba! Everybody's so touchy about these things!)\nBlackquill:\nI recall Master Toneido would often have a drink or two before performing. He said it made him more eloquent. Drinking too much of the stuff can make one lose consciousness, though, of course.\nAthena:\nAnd look! There were two glasses on the table! Uendo, I believe you master offered you some rice w-- I mean, saké. And then, you must've drank too much and passed out. That's when your fourth personality, Owen, emerged!\nKisegawa:\nI drank saké? Oh, that's a good one!\nUendo:\nWe have a real sweet tooth, you see, so, yes, we did accept a sugary, red-bean bun... ...but since we really dislike saké, we said no, thank you to that.\nPatches:\nBelieve it or not, we're real weak when it comes to booze. Hee hee! Even a tiny drop can knock us right out!\nUendo:\nSo, you see... I had a sweet manju bun, but I didn't drink any saké.\nAthena:\nWhat? But that can't be right! The defense demands that the glasses be examined right away!\nNahyuta:\nYou amateur! Did you really think I had not already done so? Your foolishness is beyond the pale.\nAthena:\nD-Don't tell me...\nNahyuta:\nThere was no trace of the witness having touched either of the glasses, naturally.\nAthena:\nR-Right... Of course...\nJudge:\nMs. Cykes, would you like the witness's statement added to his testimony?\nAthena:\nY-Yes, please, Your Honor.\nJudge:\nVery well.\nAdds statement \"I had a sweet manju bun, but I didn't drink any saké.\" if not already added\n\n\n\n\nNo\n\n\n\n\n\n\n\nAthena:\nI'm afraid not, Your Honor.\nBlackquill:\nOf course you do, Athena! Have another good look at the crime scene photo.\nAthena:\nO-okay... (Hmm... Something that could've made the three of them lose consciousness... Was there anything like that in the dressing room?)\nLeads back to cross-examinationKisegawa:\nHow dare you treat me like a criminal based on mere conjecture?!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSince nobody involved with this case is named \"Owen\"... ...we have to explore the possibility that he's a hidden forth personality of yours. After all, the cards read \"OWEN 4TH\"!\nUendo:\nBut how can you be so sure that that's what the cards really mean?\nAthena:\nWh-What else could they possibly mean?\nUendo:\nWell, for example, \"Owen, the fourth hitter\"!\nAthena:\nWh-Who in the world is that?!\nPatches:\nHe's a baseball player! A really great one, too! Owen Gonzales, thirty-six years old. He's a \"cleanup,\" fourth-place hitter, of course.\nAthena:\nIf such a famous baseball player was there, hanging around in the theater... ...he would've drawn a lot of attention to himself, don't you think?\nUendo:\nWell, then, how about this? Maybe it means \"OWE N 4 TH\", like, \"I owe 'N' four thousand.\"\nAthena:\nAnd who is this mysterious \"N\" person?\nUendo:\nWhat? \"N\" isn't a person! It was Shisho's favorite hobby shop, \"N-Joy.\" He was a huge model train collector.\nAthena:\nI-I see...\nUendo:\nMaybe he owed the hobby shop some money. So he left a note to remind himself.\nAthena:\nIn karuta cards on a table?\nKisegawa:\nShisho worked in mysterious ways.\nAthena:\nAre you even taking this seriously?!\nKisegawa:\nI'm being completely serious! The point is, \"OWEN 4TH\" could mean just about anything!\nAthena:\nArngh... I-I suppose you're right. (I guess I'd better approach this from a different angle...)Uendo:\nI had a sweet manju bun, but I didn't drink any saké.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSo if you had even a tiny sip of saké, you'd conk right out, huh. That's why you didn't touch the glass that Master Toneido offered, correct?\nUendo:\nYes, that's right.\nAthena:\nThen maybe you ate something that had saké in it as an ingredient?\nUendo:\nI don't recall doing anything like that.\nAthena:\n(Hmm... He doesn't \"recall\" doing it... But that doesn't necessarily mean he didn't. He just might not have known that he did... I'd better take another good look at the evidence.)Present Taifu's Note\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"This shows what, most likely, made Uendo lose consciousness!\"Before adding statement\n\n\n\n\n\n\n\nAthena:\n(I should've figured that he's not going to just give in like that...) There's gotta be some sort of key to unlocking Uendo's fourth personality...\nBlackquill:\nPersonally, I can't wait to see who will slip up first. But it'd better not be you.\nAthena:\nWell, it won't! (And if I can't find any inconsistencies, there's always one thing to do, and that's press!)After adding statement\n\n\n\n\n\n\n\nBlackquill:\nSo he didn't drink any saké, huh?\nAthena:\nOh boy... Now we're in trouble...\nBlackquill:\nThat kind of answer is exactly why Sad Monk keeps insulting you. Now, use your head! There are countless ways Uendo could've gotten saké into his mouth besides drinking it.\nAthena:\nW-Well, I don't know about the \"countless\" part, but...\nBlackquill:\nBut nothing. Give it some thought, and you'll figure something out.\nAthena:\n(So the witness must've had something that contained saké... Is there anything in the Court Record that hints at something like that...?)Athena:\nThis shows what, most likely, made Uendo lose consciousness!Nahyuta:\nThat note...? Are you feeling lightheaded, child? Or perhaps a bit peckish?Athena:\nI'm not hungry, and my head feels just fine, thank you very much! Look at the paper this note is written on. Isn't there something familiar about it?Nahyuta:\nWhat exactly is your point, defense?Judge:\nHmm... This faint design here reminds me of the paper from...Athena:\nYup! It's a piece of the wrapping paper on the box of manju buns by the victim on the floor! Uendo, you may not have drunk any saké... ...but you did eat a sweet red-bean bun, right?Uendo:\nWell, yes... That's right.Athena:\nI don't know if you are aware of it or not, Uendo... ...but I believe the manju you ate caused you to fall unconscious!Judge:\nTh-The bean bun? But how?Athena:\nBecause those buns contained a secret ingredient! A very \"punchy\" secret ingredient, at that!Judge:\nA \"punchy secret ingredient\"?Athena:\nYes. The design on the wrapping paper matches that of something else in the room.Judge:\nI-it does?Athena:\nThe design on this object matches that of the manju box's wrapping paper!Present saké bottle\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"The camel pattern... It's the same as the one for \"Camel\" brand saké!\"Present manju box\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThe design on this manju box matches the design on the wrapping paper!\nNahyuta:\nConsidering it is part of the same package, that is hardly surprising. Now, why don't you tell us what this \"secret ingredient\" you speak of is?\nAthena:\nTh-That, Prosecutor Sahdmadhi, is a secret!\nJudge:\nMs. Cykes, are you even taking this seriously?!\nAthena:\nI am, Your Honor. And I promise to do better next time.\nLeads back to:\n\"The design on this object matches that of the manju box's wrapping paper!\"Present anywhere else\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nLook at the design of this here. Doesn't it remind you of the wrapping paper?\nJudge:\nHmph. Not in the slightest.\nAthena:\nBut to young people like us, I assure you it DOES look vaguely similar...\nNahyuta:\nAs one of these \"young people,\" I can assure you that it does NOT look similar at all.\nAthena:\nBut to young... um... women... who, uh, wear yellow clothes...\nNahyuta:\nLet it go, and move on, defense.\nAthena:\nArrrgh... Fine.\nJudge:\nAnd here's what you get for treating me like an old fogey!\nLeads back to:\n\"The design on this object matches that of the manju box's wrapping paper!\"Judge:\nThe camel pattern... It's the same as the one for \"Camel\" brand saké!Blackquill:\nSo, just as Uendo said, he didn't drink any saké, per se...Athena:\n...but he DID eat some.Nahyuta:\nI-Impossible...Athena:\nUendo had a \"Camel\" brand red-bean bun... ...which boasts a nice shot of saké as one of its ingredients!Judge:\nSo the defense is claiming that Uendo passed out after consuming a \"Camel\" sweet bun... ...which allowed a fourth personality named \"Owen\" to emerge. Is that correct?!Athena:\nYes, Your Honor! That's exactly what I'm claiming!Uendo:\nPYOOOOOOO!Judge:\nBut there's one thing that bothers me. Wouldn't the alcoholic content of the buns evaporate as they are steamed?Blackquill:\nIn order to give them a stronger flavor... ...some manju are specially made to retain as much of their alcoholic content as possible.Kisegawa:\nH-Hmph! What kind of lightweight do you think I am?! Even I wouldn't pass out from eating a simple manju!Athena:\nThen how about we test that theory? What do you say, Your Honor?Judge:\nHmm... \"Seeing is believing,\" as they say. ...Very well, I will allow a test.Athena:\nThanks, Your Honor! Simon! Go buy us some \"Camel\" manju, on the double! And don't forget to get me one, too, okay?Blackquill:\nWh-Why must I--!Judge:\nAnd while you're at it, Prosecutor Blackquill... you will get one for me as well!Blackquill:\nTsk! I'm not the courthouse stable boy, you know. But just this once, I'll acquiesce. Taka, I'm counting on you. ...And all of you had better pay me back!Judge:\nAww... But I thought it would be your treat, Prosecutor Blackquill... What a shame... Now then, let us adjourn until the manju arrive by carrier hawk. Court will reconvene as soon as Taka returns.To be continuedMay 13District Court - Courtroom No. 4Judge:\nNow that the sweet buns have arrived, this court is back in session!Athena:\nGo on, Uendo! Eat up!Uendo:\n............Ngh...Judge:\n*chomp* *chew* Mmm. Nice flavor... You can really taste the saké... *munch* *gulp* That was delicious!Nahyuta:\nYes, a unique sweetness and the faint aroma of saké... Yet, I hardly think that anyone could pass out from eating something like this.Blackquill:\nWhat's the matter, Uendo? You're not afraid of a tiny manju, are you?Judge:\nOr are you scared of how many calories it has?!Uendo:\nD-don't be ridiculous! A sweet little snack like this couldn't possibly... I-I mean, it could never...Blackquill:\nLess bleating, more eating, witness!Uendo:\nNgh... F-Fine! Whatever!Uendo:\n*chomp* *chomp*... *gulp*Uendo:\nSee? I told you... It don-- don't affect me in th suh-- slightess! *hic*Patches:\nWe might be a liiightweight, but c'mooon, nnnobody's THAAAAT l-light. Hee hee!Kisegawa:\nHmph. Sh-Sheriouslyyy... Nobody ge's drunk offa wuh, wuh, one lil' bun... *hic*Athena:\nI-It looks like it worked!Judge:\nOh, my! W-Witness! Please tell the court your name and occupation.???:\nOooooh... *sniffle*...Judge:\n...?Athena:\n...?Nahyuta:\n...?Owen:\nOooh... *sniffle*... M-My name is Owen... I'm... five.Athena:\nY-You're five years old?Owen:\nA-Am I in trouble...? Please don't yell at me... Oooh...Judge:\nSo HE'S Uendo's fourth personality?!Nahyuta:\nI'd hardly think a child like him could have a motive to murder the victim. And even if he had a motive, could he have actually committed the murder?Judge:\nHmm... That's a very good point. Owen does appear to be very timid and weak.Athena:\nOooooh...Nahyuta:\nIt seems the defense was hoping this hidden personality would be the real killer. But now that he is standing here before us... ...it is clear that none of Uendo's personalities can be the killer!Athena:\nEeeeeeeeeeeeeeeeeeeeeeek! (Wh-Where can I even go from here!)Owen:\nShisho... Shisho...! *sniffle*Athena:\nOwen...? Do you know something about what happened to your master?Owen:\nUwahhhhh!Athena:\n...C'mon, buddy. Won't you tell Auntie Athena what happened?Owen:\nUwahhh! Whatta scary lady!Athena:\nI-I'm not scary! Look! Look at auntie's biiiig, biiiig smile! Tell me about your master, please? Pretty please, with sugar on top?Owen:\nO-okay... Shisho was... super nice... He always played with me... Just like.. Just like a real grandpa. I loved Shisho... *sniffle*Blackquill:\nAthena, do you sense anything behind his words?Athena:\nI sense his sadness -- sadness so pure it's heartrending -- but no discord. Prosecutor Sahdmadhi is right. Owen isn't the killer.Blackquill:\nBut then, don't you find it odd?Athena:\nFind what odd?Blackquill:\nLet's review what we've learned so far. Uendo rearranged the karuta cards to pin the blame on Bucky.Athena:\nWell, that's because the original message implicated Owen. But Owen is only five years old, and absolutely adores Master Toneido.Blackquill:\nExactly. The other three personalities also have no motive for murder. If Owen isn't the true culprit, then the person who first laid out the cards...Athena:\n...Probably wouldn't have been Master Toneido! So then, who did it?Judge:\nDefense? Did the appearance of Owen help you figure anything out?Athena:\nYes, Your Honor. I now know who it was that first laid out the cards.Judge:\nB-But I thought it was the victim! ...Right?Athena:\nNo, Your Honor. I don't believe it was. The one who first arranged the karuta cards on the table was none other than...The true killer\n\n\n\n\n\n\n\nLeads to:\n\"I believe the person who laid the cards out is the very person who killed Taifu Toneido!\"Whet Noodle No. 3\n\n\n\n\n\n\n\nAthena:\nCould it have been Whet Noodle No. 3, the previous owner of Whet Soba?\nBlackquill:\nHmph. You do realize that the old man has already kicked the bucket. This trend of giving wrong answers -- I suggest you buck it.\nAthena:\nHey... Was that an attempt at word play there, Simon?\nBlackquill:\n............Your Baldness! Do your duty -- swiftly, now!\nJudge:\nY-Yes, sir! It isn't every day that the defense requests a penalty for itself!\nBlackquill:\n............\nAthena:\n(Eep... He's going to really let me have it later... I just know it.)\nLeads back to:\n\"The one who first arranged the karuta cards on the table was none other than...\"Uendo's fifth personality\n\n\n\n\n\n\n\nAthena:\nIf it's not the fourth personality, Owen, then it must be a fifth personality!\nNahyuta:\nAnd why would a fifth personality try to pin the blame on the fourth? They both inhabit the same body, after all. Well? O psychology expert...\nAthena:\nUm...\nJudge:\nIt appears our psychology expert has run out of expertise!\nBlackquill:\n...Hmph. Review who rearranged the cards and their motives, O psychology expert!\nAthena:\n(Argh! I DO have a name, I'll have you all know!)\nLeads back to:\n\"The one who first arranged the karuta cards on the table was none other than...\"Athena:\nI believe the person who laid the cards out is the very person who killed Taifu Toneido!Nahyuta:\nHow quickly you move on to a new target when your Owen theory proves false! You pohlkunan!Athena:\nI don't know what a \"pohlkunan\" is, but I know I am definitely not one! And before you start with the sermons, why don't you hear me out?!Judge:\nYes, let's hear the defense's reasoning. Please proceed, Ms. Cykes. But if you are bluffing, I won't go easy on you!Athena:\nI understand, Your Honor. Now, then. Please recall the original crime scene. Who did the karuta cards name when the scene was discovered?Judge:\nLet's see... I believe they implicated the defendant, Bucky Whet.Athena:\nThat's right. But we then found out that the message originally read \"OWEN 4TH.\"Judge:\nHmm... Which implicated the young boy, Owen.Athena:\nExactly. And the person who rearranged the cards was undoubtedly Uendo.Blackquill:\nUendo may have kept silent, but we can be sure he already knew his master was dead. His tampering with the crime scene using the TV all but proves it.Uendo:\nNnngh... ...I-I confess. I-I tampered with the crime scene.Blackquill:\nThe reason Uendo rearranged the karuta cards and moved the TV was because... ...he saw the \"OWEN 4TH\" message, and was convinced Owen had committed the crime.Athena:\nRight on, Prosecutor Blackquill! It would seem that Owen and the other three personalities don't share the same memories.Uendo:\nBut really, there is no \"fourth personality.\" It's just the three of us in here.Athena:\nUendo feared that Owen had killed Master Toneido, so he tried to hide Owen from us.Owen:\nOoohhh... *sniffle*Blackquill:\nBut it turns out, Owen is but a five-year-old child, incapable of hurting a fly... ...let alone his beloved master.Athena:\nSo naturally, the culprit must be somebody else. And this somebody else -- the true killer -- tried to pin the crime on Owen!Judge:\nHmm... I see. That does make sense.Nahyuta:Nahyuta:\nThis is naught but conjecture, composed of half-truths and fantasy! Who, then, do you maintain murdered the victim?!Athena:\nI believe Owen might know something about that.Nahyuta:Nahyuta:\nI refuse to allow such impromptu testimony. And from a five-year-old, no less. Such a young child is incapable of producing anything coherent!Athena:Athena:\nB-But...!Nahyuta:\nYour desperation is disgraceful! You should realize when it is time to let it go, and--???:\nI-I saw it...Owen:\nI saw Shisho getting...Athena:\nOwen! You DO know something, don't you!Owen:\nY-Yeah...Judge:\nOh, my! Is this true? If so, we must have Owen testify immediately! Don't you agree, Prosecutor Sahdmadhi?Nahyuta:\nNnrrgh...Judge:\nIt's all right, Owen. Go ahead and tell us what you know.Witness Testimony-- I Saw It --Owen:\nShisho was standing with a knife in his hand...\nBlood was dripping onto Shisho's face, getting it all red...\nI couldn't move at all!\nI was so scared... I passed out.Athena:\n(Th-This is eyewitness testimony from the moment of the murder!) Owen! Can you tell us anything else about what you saw?!Owen:\nI... Ooooooh... I was so scared...! *sniffle* Oooooooh... So... So scared...! *sniffle*Athena:\nO-Owen! (His emotions are spiraling out of control! Something must've really frightened him!)Judge:\nI-Is he all right?!Athena:\nHis emotions are running wild because he's trying to recall something frightening to him. I recommend a therapy session right away!Judge:\nI-I see. Yes, please do whatever you can to help the poor boy!Athena:\nWill do, Your Honor! (I'd better find the cause of these out-of-control emotions, pronto!)Owen:\nShisho was standing with a knife in his hand...Owen:\nBlood was dripping onto Shisho's face, getting it all red...Probe Blood\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Yeah... Blood was dripping down onto Shisho's face...\"Owen:\nI couldn't move at all!Owen:\nI was so scared... I passed out.Blackquill:\nPoor kid. He's absolutely terrified of something.Athena:\nWhatever it is, it might be the root cause of his out-of-control emotions. (I'd better take another careful look at the images...)Owen:\nYeah... Blood was dripping down onto Shisho's face...Athena:\n(Blood...? I don't remember seeing any blood in the crime scene photos... Besides, if the victim was standing upright, how could blood drip down onto his face?)Nahyuta:\nAs I expected, all we managed to obtain from this child is a tale he dreamt up.Athena:\nUrngk...! I guess it's a little weird for blood to drip onto the victim's face if he was standing up... Unless it dripped down from the ceiling or something? What do you think, Simon?Blackquill:\nI don't know. Owen's one confused and upset kid right now, so who knows how accurate his memory is. Maybe it's time for that thing instead.Athena:\nHuh? What thing?Blackquill:\nThat thing that you and your cohorts do. What do you call it? \"Rotate your thinking about\"...?Athena:\nOh! You mean \"turn your thinking around\"!Blackquill:\nYes, whatever. It's the same thing, either way.Athena:\nNo, it isn't! Who's ever heard of \"rotating\" your thinking? I mean, \"rotate\" is-- Hey, wait a minute...Blackquill:\nWhat?Athena:\nYou know what, Simon? In this case, I think \"rotate\" just might work perfectly after all!Blackquill:\nCome again?Athena:\nAll I have to do is rotate things by ninety degrees! When he saw his master, Owen must've been...Lying on the floor\n\n\n\n\n\n\n\nLeads to:\n\"Owen must've been lying on the floor when he witnessed his master's murder.\"Doing a handstand\n\n\n\n\n\n\n\nAthena:\nOwen must've been doing a handstand when he witnessed his master's murder. the victim must've been doing a handstand, too!\nJudge:\n............\nBlackquill:\n............Heh.\nAthena:\n............Or not. It's \"not,\" isn't it?\nJudge:\nLooks like all that rotating threw you for a loop, Ms. Cykes.\nAthena:\n(Guess I rotated my thinking a little TOO much, huh... Maybe what I need to do is rotate my thinking a little less...)\nLeads back to:\n\"When he saw his master, Owen must've been...\"Pressed flat against a wall\n\n\n\n\n\n\n\nAthena:\nOwen must've been pressed flat against a wall when he witnessed his master's murder.\nJudge:\nAnd that would make it look like blood was dripping onto the victim's face, would it?\nAthena:\nOr maybe not...? I mean, it's not a big deal, right?\nJudge:\n.........What do YOU think, you big drip?!\nAthena:\nAll right, all right. This time, I promise to rotate my thinking by ninety degrees!\nLeads back to:\n\"When he saw his master, Owen must've been...\"Athena:\nOwen must've been lying on the floor when he witnessed his master's murder.Judge:\nWhat?!Athena:\nThat's the conclusion I arrived at when I rotated my thinking by ninety degrees. Which means that all of the visuals in my matrix were off by ninety degrees.Judge:\nAnd...?Athena:\nThis means Master Toneido was also lying on the floor, which solves another mystery!Judge:\nAnd which mystery is that?Athena:\nThe mystery of how blood could've been dripping onto the victim's face. It becomes much easier to imagine how that could happen if he was lying down. Like, someone bleeding onto Master Toneido from somewhere up above him!Owen:\nI-I remember now! Somebody was sitting up on top of Shisho!NOISE LEVEL70%Athena:\n(So trying to recall his master's bloody killer is what spooked Owen originally.) The blood that stained the victim's face red came from the person sitting on top of him. The victim was holding a knife, so he likely nicked his attacker as he was fighting back!Nahyuta:\nThis means his assailant was injured on their face somewhere, like the forehead, perhaps?Athena:\nAssuming the victim and his attacker were face-to-face, then, yes.Nahyuta:\nI see. So that is what happened. But if I recall correctly, the accused has a fresh bandage on his forehead, does he not? That injury of Mr. Whet's... ...is conclusive evidence that he committed this murder!Athena:\nWHYYYYYYYYYYYYYY?!Nahyuta:\nIt seems you have dug yourself into a pit you cannot crawl out of.Athena:\nNooo! (Even though I figured out the reason for Owen's out-of-control emotions... ...all I did was raise further suspicion against my own client... What do I do now...?!)Blackquill:\nWhat's the matter? You aren't thinking of throwing in the towel, are you?Athena:\nBut it looks so bad for Bucky! I mean, he had both motive and opportunity... Plus, he has that injury on his forehead!Nahyuta:\nYour Honor. I sense that the defense is finally ready to let it go, and move on.Judge:\nWell, Ms. Cykes? I understand that you don't want to give up on your client... ...but I won't allow you to prolong this trial without a good reason.Gallery:Well, that lawyer did her best, but all the signs point to the defendant's guilt.Maybe it's time she gave up? She tried everything she could...Athena:\n(I really, REALLY don't wanna back down, but...)Blackquill:Blackquill:\nAthena. Are you having doubts about Bucky's innocence?Athena:\nI-I wouldn't say THAT... It's just...Blackquill:\nDo you remember what you said to Bucky earlier this morning?Bucky:\nY'mean... you believe me, ma'am...?Athena:\nOf course! No matter what, I'll believe in you to the very end!Blackquill:\nWere those just empty words?Athena:\nO-Of course not! It's just that all the cards are stacked against us...Blackquill:\nAre you still stuck on that line of thinking? Motive, opportunity, and an injury to his forehead -- Is that all it takes to make you stop believing in your client?! Tell me again, who are you to Bucky?!Athena:\nUh... I'm... I'm his \"Miz Chickadee\" lawyer!Blackquill:\nThen do your duty, and believe in him until the very end!Athena:\nI... I will! (Simon's absolutely right. I'm Bucky's lawyer. And he's depending on me!)Judge:\nDefense team, please! No fighting in my courtroom!Athena:\nThe defense is ready to resume, Your Honor! Prosecutor Blackquill was just giving me a pep talk, that's all. Thank you, Prosecutor!Blackquill:\nHmph. I didn't do it for your sake. I did it for the future of Whet Soba.Athena:\nYeah, yeah! I got it! The defense would like to now continue with Owen's therapy session!Judge:\nHmm... Owen, would you be all right with that?Owen:\nO-Okay... Um... So... somebody was sitting up on top of Shisho, bleeding from their head... ...and smooshing something into Shisho's face!Athena:\nThat's funny...Blackquill:\nWhat is it?Athena:\nI still hear discord in Owen's voice... ...but I don't sense any inconsistencies between his statements and his emotions. And there don't seem to be any contradictions in his testimony itself, either.Blackquill:\nAhh, so that's it, huh?Athena:\nDid you figure something out?Blackquill:\nYour ability to sense emotions is making you focus too much on his feelings, Athena. But there's actually something he's being very vague about in his testimony. If you can clarify what he's feeling uncertain about with some evidence... ...you should be able to move forward from there.Athena:\nO-Okay, that makes sense. I'll give it a try! I'll just update the Mood Matrix with the new information, and then we'll be ready to go! (So I just need to present some evidence on what Owen is being vague about, huh...?)Owen:\nShisho had blood on his face and a knife in his hand...Owen:\nHe was on the floor, and somebody was smooshing something into his face...Present Crime Scene Report\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Let's put a name to the thing Owen's uncertain of, shall we...\"Owen:\nI couldn't move at all! I was so scared... I passed out.Athena:\n(So now, let's see what Owen is feeling uncertain about. It should manifest as something Owen isn't being specific about.)Blackquill:\nWhat's the matter? Is this too tough for you?Athena:\nNo, I'm thinking! So stop distracting me! (I think I can guess what Owen is uncertain about... I just don't know which piece of evidence will pull the info I need to the surface...)Blackquill:\nYou can't solve this with a rigid thought process. Try kneading your mind as well!Athena:\nKneading my mind?! It's not soba dough, you know!Blackquill:\nHeh. Looks like you've learned a thing or two about making soba, at least.Athena:\nYou think?! I've only been hearing about it all day today!Blackquill: \nWell, even with that tiny bit of knowledge, you ought to be able to find your answer.Athena:\n(That Simon! He's figured something out again, hasn't he...? And what does the soba-making process have to do with what Owen is unsure about?)Athena:\nLet's put a name to the thing Owen's uncertain of, shall we... ...by identifying the murder weapon that was used to suffocate the victim. Fortunately for us, I spy the murder weapon right here in this crime scene photo!Nahyuta:\nUnfortunately for you, I spy nothing of the sort. And the police... ...did not spy anything of the sort during their investigation, either. Pray tell, where is this \"murder weapon\" you see?Athena:\nYou don't see it because it no longer looks the way it did when it was used as a weapon. This is what the killer pressed into Master Toneido's face!Present noodles\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"The mystery person that Owen saw pressed soba into the victim's face...\"Present anywhere else\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nIt's right here in the photo!\nJudge:\nYou really think that that's what the murderer pressed into the victim's face?\nAthena:\nOr maybe it was this right here...? Or, wait, maybe that over there...?\nJudge:\nStop moving your finger around and around until you get it!\nBlackquill:\nHeh. Athena Cykes \"psyches\" out the judge... Or tries to, at any rate.\nAthena:\nYeah... I'm not real psyched about how that went...\nLeads back to:\n\"This is what the killer pressed into Master Toneido's face!\"Athena:\nThe mystery person that Owen saw pressed soba into the victim's face... ...thereby suffocating him!Nahyuta:\nI grow weary of your tasteless jokes! How could anyone commit murder with soft, delicate soba?! The noodles would instantly fall apart if they were pressed into someone's face!Judge:\nYes, I agree.Athena:\nWell, I disagree. There is a way the soba could've been used to suffocate the victim.Judge:\nWh-What? You will explain your theory at once, Ms. Cykes.Athena:\nTo kill Master Toneido, the culprit must have smothered him with...Uncooked soba noodles\n\n\n\n\n\n\n\nAthena:\nThe culprit must've pressed uncooked soba noodles into the victim's face...\nNahyuta:\nSoba noodles are even softer and more apt to fall apart before they are cooked than after. I verified this for myself by preparing and cutting my own buckwheat noodles yesterday.\nJudge:\nHow thoroughly studious of you, Prosecutor Sahdmadhi. You would do well to follow his example, Ms. Cykes!\nAthena:\nI should've known he'd find a way to study soba-making last night, too... All right, Your Honor. Please let me try that again.\nLeads back to:\n\"To kill Master Toneido, the culprit must have smothered him with...\"Balled-up soba noodles\n\n\n\n\n\n\n\nAthena:\nThe culprit must've balled up some cooked noodles and used that clump to kill the victim!\nNahyuta:\nThere is a type of spice called myoga ginger, which is said to help with memory loss. Perhaps the defense should try some. It pairs very well with soba.\nAthena:\nHuh? But why?\nNahyuta:\nBecause you appear to be suffering from severe memory loss, child. As I said earlier... ...the soba noodles would instantly fall apart if they were pressed into someone's face!\nJudge:\nHmph. Just like the defense's crumbling assertion!\nAthena:\nI was kinda hoping you'd forget about the penalty, Your Honor...\nWidget:\nGuess I'll give myoga ginger a try...\nAthena:\nAnyway, Your Honor, please let me try that again.\nLeads back to:\n\"To kill Master Toneido, the culprit must have smothered him with...\"Uncut soba dough\n\n\n\n\n\n\n\nLeads to:\n\"The culprit must've used the soba before it was cut into noodles!\"Athena:\nThe culprit must've used the soba before it was cut into noodles! In other words, the murder weapon was raw soba dough!Judge:\nWHAAAAAAAAAAAAAAAAAAAAAT?! Order! Order in the court! Yes, soba dough could definitely be used to suffocate someone, couldn't it!Nahyuta:\n............Athena:\nA-Are you all right, Prosecutor Sahdmadhi?Nahyuta:\nI was just letting the soul of the victim know... ...that the accused will finally face justice, thanks to the foolish lawyer before me.Athena:\nHuh? What are you talking about?Nahyuta:\nAllow me to summarize your statements. As the accused was killing the victim, he was slashed in the face by the victim's knife. The weapon he used to suffocate the victim with was the dough in the dressing room. He then disposed of the murder weapon by cutting the soba dough into noodles.Blackquill:\nAgnrk! Why, you smarmy...!Nahyuta:\nAfterwards, the accused put the victim's face into the bowl of soba noodles and broth... ...to wash off the blood that had dripped onto the victim's face from his own. And there you have it: the true sequence of events behind this foul affair.Athena:\nN-Now, wait just a minute! I never once said that Mr. Whet was the culprit!Nahyuta:\nWho but the accused knows how to cut dough into noodles, defense?Athena:\nGurk!Judge:\nHmm... That's a very good point, Prosecutor Sahdmadhi. I heard that cutting soba dough into uniform noodles requires considerable training. But then, what about the dying message? How do you explain that? The defendant wouldn't have known about Uendo's \"Owen\" personality.Nahyuta:\nPerhaps the victim was simply playing with the cards, and they hold no other meaning. Perhaps he spelled out Owen's name in jest, sometime before his murder.Judge:\nThat's true. From Owen's testimony, it's clear that Master Toneido cared for the boy. Hmm... It appears we've arrived at a compelling conclusion. Taken together, all of these points paint a convincing picture of the defendant's guilt.Athena:Athena:\nOwen! Is there anything else you can tell us? It doesn't matter how small of a detail -- anything will do!Owen:\nOooooh... Y-You're scaaaring me...!Athena:\nOh! I'm sorry, Owen! Auntie Athena didn't mean to raise her voice. (I have to be gentler with him! I can't forget he's only five years old.) No need to be scared, okay, sweetie? Just tell us anything you can remember.Owen:\nWell... Wh-When I woke up... the person who killed Shisho... was standing over me... ...bleeding from their head...Athena:\nOwen! You saw the killer's face?! (Oops, I did it again...) S-So who was it, Owen? Do you remember?Owen:\nOooooh... I... I don't know who it was...Athena:\n(I'm picking up some noise...! That means there's still something to uncover in Owen's testimony...)Nahyuta:Nahyuta:\nI don't know what Owen saw, but suffice it to say, we are analyzing the dreams of a child. You've wasted enough of our time, defense. Let it go, and move on!Athena:\nNo! There's still discord in Owen's heart that needs to be addressed! Therefore... I can't give in here!Judge:\nOwen, do you think you can continue your testimony for us?Owen:\n*sniffle* Okay...Athena:\nI'll enter the new info, and run an update, then!Owen:\nShisho had blood on his face and a knife in his hand...Owen:\nHe was on the floor, and somebody was smooshing dough into his face!Owen:\nI couldn't move at all!Owen:\nI was so scared... I passed out.Owen:\nAnd when I woke up...Owen:\n...the person who killed Shisho was standing over me...Pinpoint Happy marker\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Despite witnessing the culprit's terrible crime first-hand...\"Athena:\n(Owen saw the real killer's face! This is ultra-critical, eyewitness testimony! He must've been so scared... ...Wait a minute. What's that one emotion doing in there...?)Athena:\nDespite witnessing the culprit's terrible crime first-hand... ...Owen experienced a positive feeling -- one of... relief?Nahyuta:\nThe person the witness saw was no stranger. Rather, it was the accused. Therefore, it is only natural that he felt some level of relief when he saw a familiar face. Defense, end this madness and sully your soul no more.Athena:\nOwen... Who did you see?Owen:\nThat nice smell... I love the smell... of that perfume...NOISE LEVEL0%BYE BYEOwen:\nI-It's the smell of... of... Ungh...Athena:\nYou can do it! Try to remember, Owen!Owen:\nOoooooh... Th-The smell of... of... Ooooooohhhhnnnnngh...!Athena:\nO-Owen!Judge:\nIt seems Owen is now resting in the infirmary. They certainly have their hands full today down there. Let's continue with the trial.Nahyuta:\nDespite Owen's testimony, it is the opinion of this humble servant of the Holy Mother... ...that the child's words were insufficient to clear the accused of suspicion.Athena:\nB-But what about the scent of perfume Owen mentioned?! I believe it's a clue that will lead us to the true culprit!Judge:\nHmm... But there are thousands of perfumes in the world.Nahyuta:\nIt could even be the scent of the hair product the accused uses.Judge:\nHe does have one amazing hairstyle, so that's certainly possible.Nahyuta:\nThe witness is a five-year-old boy. He cannot tell the difference between conventional perfumes and hair products.Athena:\n(Argh... Why couldn't you have gone for a crew cut or something, Bucky?)Nahyuta:\nWhat's more, the only person who can cut soba noodles with such precision... ...is the accused, and no other.Athena:\n(Oh man... How am I supposed to argue with that...?)Nahyuta:\nAnd so, the person Owen saw at the scene of the crime can only be... ...the accused, Bucky Whet!???:Athena:\n?Nahyuta:\n............Judge:\n?Blackquill:\nWhat the--?!Bucky:\nHey, hey, hey! I never use hair productsh or anyding with a shmell! *hic* If I wore someding like dat, th' shmell'd get into th' soba! Boom! Check it!Athena:\nUh... Mr. Whet? Aren't you supposed to be resting in the infirmary...?Bucky:\nWhaaaatever! You dink I'd let my soba shtink o' perfume?! Try dat chillled soba fer yershelf and see!Judge:\nI believe we have no choice but to try it... Strictly for examination purposes, of course. Now then, let's dig in, shall we?*sluuuuurp* *slurp* *slurp* sluuurp*Judge:\nMmm... That was delightful. Ahem! Well, I'm satisfied that there are no traces of hair products or perfumes in Mr. Whet's soba. First, sweet bean buns, and now, savory soba! What a delectable trial this has been!Nahyuta:\nThis texture is different from the soba I had the other day. It reminds me of a dish we have in Khura'in called \"banu'puun.\"Bucky:\nWhatcha dink, Miz Chickadee? My soba'sh pretty good, ishn't it?! *hic*Athena:\nMmm-MMM! It's delicious! Don't you think so, Simon?Blackquill:\nHeh. It still pales in comparison to his late father's cuisine.Bucky:\nS-Simey! Why you alwaysh gotta be so hard on me?! *urp*Judge:\nBailiff! Take the defendant back to the infirmary at once for some rest!Bucky:\nResht?! Hey, I ain't a lump o' plain ol' wheaty udon dough, y'know! I'm fresh like my soba! Y'don't let soba dough resht... It's about the \"three freshes\" of soba! Grind the seeds fresh, cut the dough fresh, and boil the noodles fre-- *urp*Judge:\nGood grief. What a defendant...Athena:\n(At least Bucky wasn't the source of the perfume smell... Wait. Smelly perfume...)Blackquill:\nIt looks like you remembered something.Athena:\nThe phrase \"smelly perfume\"... reminded me of a certain somebody!Judge:\nOh? And who might that be?Athena:\n(There's only one person that comes to mind!) The phrase \"smelly perfume\" reminded me of this person!Present Geiru Toneido profile\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Geiru Toneido? Hmm... Yes, she DID smell very nice, didn't she?\"Present anyone else\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nThere's no doubt about it -- it's this person!\nJudge:\n............\nBlackquill:\n............\nNahyuta:\n............\nGallery:\n\n............\n\nAthena:\n............ (Uh-oh. Something tells me I got it wrong.) There's no doubt about it -- it's NOT this person!\nJudge:\nWh-What the--?! No take-backs, defense!\nBlackquill:\nCome now, Athena. There's only one person it could be.\nAthena:\nRight. If it's perfume we're talking about, it's gotta be that person!\nLeads back to:\n\"The phrase \"smelly perfume\" reminded me of this person!\"Judge:\nGeiru Toneido? Hmm... Yes, she DID smell very nice, didn't she?Nahyuta:\nJust a moment, defense. You would throw suspicion on Geiru now because of a scent? Your Honor, there is no need to go along with these ever-changing claims of the defense.Judge:\nHmm... I suppose their claims have been awfully inconsistent...Athena:\nBut Geiru could've been at the crime scene!Judge:\nYes, but...Athena:\nYou'll get to see those \"balloons\" of hers if we call her back to the witness stand!Nahyuta:\nHow vulgar! His Honor is not interested in such things!Judge:\n............Ahem! Setting the matter of her \"balloons\" aside entirely... ...I do believe it's appropriate to ask Geiru some questions, given the circumstances. This has nothing to do with her \"balloons\"... of course.Athena:\nThank you, Your Honor!Nahyuta:\nPohlkunkaaa!Geiru:\nThank you for calling this disciple of the Toneido School of rakugo back for an encore! It's me! The balloon artist you all know and love, Geeeiru Toneidooo! Onnne, twooo... BLOOOON!Judge:\nWhat wonderful balloon artistry!Athena:\nY-Your Honor... Please.Geiru:\nNow, then! What would you like me to make for you this time?Athena:\nUm, actually, I called you back for more testimony.Geiru:\nBut I'm all talked out! This case has left me completely deflated.Athena:\n............Geiru:\nWhat? You didn't find that funny? A-Anyway, what exactly is going on, Simon?Blackquill:\nIt seems the person who murdered Master Toneido was wearing perfume.Athena:\nAnd you were the only person I could think of who wears perfume.Geiru:\nWait... you mean I'm a suspect now?Athena:\nGeiru, you knew about Owen, right?Geiru:\nW-Well, yes. I often played with him at Shisho's request.Athena:\nSo that means you could've left that fake \"dying message,\" right?Geiru:\nWh-What? Just because I wear perfume and know Owen... ...you think I'm a murderer? Oh, how could youuu?!Nahyuta:\nThe witness is absolutely right. With no evidence but the distorted memories of a small child... ...it is outrageous of the defense to accuse this woman!Geiru:\nTh-Th-That's right! You don't even have any proooof...!Nahyuta:\nYou may step down from the stand, Geiru. The defense does not have one scrap of evidence that connects you to the crime.Athena:\nWait just one minute! I may not have proof, but Owen's testimony is still--!Nahyuta:\nEnough! Please feel free to leave, Geiru.Athena:\n(B-But I'm so close! There must be something I can do!)Geiru:\nWell, if the prosecutor says it's okay, then I guess I'll be going now...Blackquill:Blackquill:\nHoy, Geiru. You're an entertainer, aren't you? Once you go onstage, it's your duty to complete your performance, is it not? So what are you doing, leaving halfway through!Geiru:\nEeeeeeek!Athena:\nTh-There's a bandage on Geiru's forehead...! And since we know that Master Toneido's killer has a cut on their face somewhere...!Nahyuta:\nI-Impossible...!Athena:\nHow did you know, Simon?Blackquill:\nHmph. I didn't. But I had to take a chance and see for myself. Otherwise, your theory would remain a groundless accusation.Athena:\nYour Honor! Prosecutor Sahdmadhi! The scent of perfume, an injury on the forehead... These things are completely consistent with Owen's testimony! In short... ...the mysterious individual Owen saw in the dressing room... could have been Geiru!Judge:\nMs. Cykes... ...does this mean you are formally indicting this witness for the murder of Taifu Toneido?!Nahyuta:Nahyuta:\nShould your accusation prove to be false... I hope you are prepared to pay the price in full.Athena:\nS-Simon, what \"price\" is he talking about?Blackquill:\nHmph. I thought that should be obvious. Prosecutor Sad Monk is saying he'll see to it you never stand in a court of law again! I must say, though, he knows how to make a trial interesting.Athena:\n(Just whose side are you on, Simon?!)Blackquill:\nGo on, then. Into the deep end with you. You really have but one choice anyway.Judge:\nWell, Ms. Cykes? I'm waiting.Athena:\nW-With regards to the witness, Geiru Toneido, the defense wishes to...Indict her\n\n\n\n\n\n\n\nLeads to:\n\"There's no reason for me to hold back! Not if I really believe in my client!\"Not indict her\n\n\n\n\n\n\n\nAthena:\n(Geiru definitely seems suspicious, but what if she really isn't the culprit?)\nBlackquill:\nHoy. You'd better not be getting cold feet. It's all up to you and how much you believe in your client now. So put up your dukes, and fight!\nLeads to:\n\"There's no reason for me to hold back! Not if I really believe in my client!\"Athena:\n(There's no reason for me to hold back! Not if I really believe in my client!) The defense wishes to formally indict Geiru Toneido for the murder of Taifu Toneido!Nahyuta:\nI have tried to be merciful, but now, not even your pleas will reach the Holy Mother's ears! You will have plenty of time to regret your decision... in the pit of hell!Athena:\nExcept I won't need to! The person who murdered the victim was NOT Mr. Whet. It was Geiru Toneido!Geiru:\nThat bandage is... It's just from a silly slipup I made while cooking yesterday, that's all!Athena:\nWhat kind of \"extreme cooking\" were you doing to cut yourself on the forehead?!Geiru:\nWell, what can I say? That's what happened!Athena:\nYou also don't have an alibi for the period before 4 PM, do you, Geiru?Geiru:\nBut... But... I really didn't know anything was wrong until Shisho was found dead! If you don't believe me, then, with a twisty, twist, twiiist! And BLOOOON! There you have it, an adorable little kitty! How could you suspect a cutesy widdle balloon artist like me, hmmmm?Athena:\nGeiru, I've been meaning to say this for a while now, but... ...could it be that you don't have an eye for balloon art?!Geiru:\nD-Don't you think I know that?! You didn't have to come out and say it! I'm the daughter of a great rakugo artist! I never wanted to do stupid balloon art! I was supposed to be a rakugo storyteller, too, just like my late daddy. B-But Shisho told me to do balloon art instead... *sniffle*Athena:\n(I guess the victim thought she had no talent as a rakugo artist, either...)Geiru:\nSo you're still gonna suspect a poor, lil' thing like me?Athena:\nP-Please stop trying to skirt the issue! It all comes down to the scent of perfume, and the cut on your forehead! You and the culprit in Owen's testimony share these two traits!Geiru:\nYou're dead set on accusing me, aren't you?! Well, here's what I have for naughty little girls like you! With a twisty, twist, twiiist! I'ma cut ya, witch! Go ahead, make me testify all ya want! When the truth's revealed... ...it'll be yer balloon or mine that goes POP! Got it?!Judge:\nOh, my! Is this yet another hidden personality?!Athena:\nSimon, is everybody in the Toneido School like this?Blackquill:\nH-How should I know?!Witness Testimony-- What I Did Before the Murder --Geiru:\nYeah, I visited the dressing room during that time to make a courtesy call after my act.\nShisho and Owen were in there, but they were both snoring up a storm.\nI saw the note Shisho left, so I just left. Didn't wanna disturb 'em, ya know.\nThe perfume Owen smelled musta been left over from when I visited.Athena:\nSo Geiru's saying she went into the dressing room, but then left right away.Blackquill:\nHmph. Don't take her at her word.Athena:\nCome on, do you really think I would? I'm just trying to figure out how to get her to talk about what really happened.Judge:\nNow, then, Ms. Cykes. You may proceed with your cross-examination.Cross ExaminationCross Examination-- What I Did Before the Murder --Geiru:\nYeah, I visited the dressing room during that time to make a courtesy call after my act.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nA courtesy call after your performance, huh... Come to think of it, Uendo mentioned making the same kind of visit.\nGeiru:\nYeah, a visit to yer master before and after yer routine... That's just common courtesy with us rakugo artists and entertainers.\nAthena:\nSo that means you paid the victim a courtesy call before your performance, too, right? What did you see at that time?\nGeiru:\nHe was having a drink and getting himself into a festive mood! He liked to say that drinking gave him a silver tongue.\nAthena:\nSo he was already drinking by then.\nGeiru:\nUendo wasn't there in the dressing room yet at that time. He musta gone in there during my act, 'cause when I went back...Geiru:\nShisho and Owen were in there, but they were both snoring up a storm.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nCould you describe how they appeared?\nGeiru:\nThey were both stretched out on the floor, snoozin' away.\nAthena:\n(So sitting the victim up and over the table must've been the culprit's doing. After all, who wouldn't stretch out on the floor if they could to take a nap? Plus, that matches up with what Owen said in his testimony.) But if he was asleep, how could you tell it was Owen?\nAthena:\nHow did you know it wasn't Uendo?\nGeiru:\nI've known the guy for ages! One look at his face, and I know which one I'm dealing with.\nAthena:\nI-I see...Geiru:\nI saw the note Shisho left, so I just left. Didn't wanna disturb 'em, ya know.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nWhere did you find your master's note?\nGeiru:\nI dunno. Can't remember. \nAthena:\nDid you notice anything else unusual or out of place in the room?\nGeiru:\nWell, there was the saké and a half-eaten manju on the table. But I didn't see anything else out of place or whatever in the room, though.\nBlackquill:\nOh, is that a fact?\nGeiru:\nO-Of course it is! Whaddaya think?!\nBlackquill:\nAnd you didn't change anything around while you were in there?\nGeiru:\nI didn't do anything! Look, I'm tellin' ya! I didn't see anything funny near Shisho, and I didn't touch anything in the room.\nBlackquill:\nYour Baldness, I request that that statement be added to Geiru's testimony.\nAthena:\nSimon! What's a statement like that going to do for us?!\nBlackquill:\nJust play along and you'll see soon enough.\nAthena:\nUgh...\nJudge:\nHmm... I have no problem with adding that to the testimony, but how about you, Ms. Cykes?\nAthena:\nI-I have no problem with it either, Your Honor. (What is Simon thinking?)\nAdds statement \"I didn't see anything funny near Shisho, and I didn't touch anything in the room.\"Press (subsequent times)\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nWhere did you find your master's note?\nGeiru:\nI dunno. Can't remember. \nAthena:\nDid you notice anything else unusual or out of place in the room?\nGeiru:\nWell, there was the saké and a half-eaten manju on the table. But I didn't see anything else out of place or whatever in the room, though.\nBlackquill:\nOh, is that a fact?\nGeiru:\nO-Of course it is! Whaddaya think?!\nBlackquill:\nAnd you didn't change anything around while you were in there?\nGeiru:\nI didn't do anything! Look, I'm tellin' ya! I didn't see anything funny near Shisho, and I didn't touch anything in the room.Geiru:\nThe perfume Owen smelled musta been left over from when I visited.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSo you admit that the scent Owen smelled when he witnessed the crime... ...was from your perfume?\nGeiru:\nYeah, sure. Why not? All it proves is I was in the dressing room anyway. It don't do a thing to prove I killed Shisho!\nAthena:\nTh-That may be true, but...!\nGeiru:\nBucky's the one who bumped off Shisho!Geiru:\nI didn't see anything funny near Shisho, and I didn't touch anything in the room.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSo I just want to confirm: You didn't see anything at all unusual or out of place anywhere around the victim?\nGeiru:\nI already told ya! Nothin'!\nAthena:\nAnd you didn't touch anything at all in the dressing room?\nGeiru:\nHow many times I gotta say it?! No, I didn't touch anything!\nAthena:\n(Wait... But then, is she saying she didn't see... ...what Uendo immediately saw when he checked the victim's body? Does that mean it wasn't there yet at that time?)\nGeiru:\nOh, hold on! I guess there was something...\nAthena:\nWhat is it?\nGeiru:\nThe soba-making equipment was already there in the room. That means Bucky must've been there in the dressing room before me, doin' something!\nAthena:\nArngh... Thanks for the non-help...Present Crime Scene Report or Karuta Cards\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Geiru, you said that you didn't notice anything odd or unusual near your master.\"Before pressing third statement\n\n\n\n\n\n\n\nAthena:\nSo Geiru is insisting that she visited the dressing room... ...before Master Toneido was killed.\nBlackquill:\nSo it would seem. But if you keep on her, she may slip up under pressure.\nAthena:\nSounds like a plan!After pressing third statement\n\n\n\n\n\n\n\nAthena:\nWell, a new statement has been added... ...but she's still sticking to her guns.\nBlackquill:\nShe said she didn't see anything unusual in the dressing room. But that strikes me as a little strange on its own.\nAthena:\nReally? Why?\nBlackquill:\nIf Master Toneido really is the one who left that, you'd think Geiru would have noticed it. And if Master Toneido wasn't the one who left it, then we must ask, who did? You know what I'm getting at, don't you, Athena?\nAthena:\nI-I think so...! (I really appreciate Simon's help, but I've got to come up with the answer myself this time!)"
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "If I come into the slightest contact with buckwheat, I get an allergic reaction.",
          "person": "Geiru",
          "present": []
        },
        {
          "testimony": "And with that much soba flour in the air, that room coulda literally killed me!",
          "person": "Geiru",
          "present": []
        },
        {
          "testimony": "Look at my hand! Just touchin' Shisho's body caused this much damage.",
          "person": "Geiru",
          "present": []
        },
        {
          "testimony": "There musta been soba broth on his clothes.",
          "person": "Geiru",
          "present": []
        },
        {
          "testimony": "So I never coulda committed that murder in the dressing room!",
          "person": "Geiru",
          "present": []
        }
      ],
      "noPresent": true,
      "newContext": "-- What I Did Before the Murder --Geiru:\nYeah, I visited the dressing room during that time to make a courtesy call after my act.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nA courtesy call after your performance, huh... Come to think of it, Uendo mentioned making the same kind of visit.\nGeiru:\nYeah, a visit to yer master before and after yer routine... That's just common courtesy with us rakugo artists and entertainers.\nAthena:\nSo that means you paid the victim a courtesy call before your performance, too, right? What did you see at that time?\nGeiru:\nHe was having a drink and getting himself into a festive mood! He liked to say that drinking gave him a silver tongue.\nAthena:\nSo he was already drinking by then.\nGeiru:\nUendo wasn't there in the dressing room yet at that time. He musta gone in there during my act, 'cause when I went back...Geiru:\nShisho and Owen were in there, but they were both snoring up a storm.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nCould you describe how they appeared?\nGeiru:\nThey were both stretched out on the floor, snoozin' away.\nAthena:\n(So sitting the victim up and over the table must've been the culprit's doing. After all, who wouldn't stretch out on the floor if they could to take a nap? Plus, that matches up with what Owen said in his testimony.) But if he was asleep, how could you tell it was Owen?\nAthena:\nHow did you know it wasn't Uendo?\nGeiru:\nI've known the guy for ages! One look at his face, and I know which one I'm dealing with.\nAthena:\nI-I see...Geiru:\nI saw the note Shisho left, so I just left. Didn't wanna disturb 'em, ya know.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nWhere did you find your master's note?\nGeiru:\nI dunno. Can't remember. \nAthena:\nDid you notice anything else unusual or out of place in the room?\nGeiru:\nWell, there was the saké and a half-eaten manju on the table. But I didn't see anything else out of place or whatever in the room, though.\nBlackquill:\nOh, is that a fact?\nGeiru:\nO-Of course it is! Whaddaya think?!\nBlackquill:\nAnd you didn't change anything around while you were in there?\nGeiru:\nI didn't do anything! Look, I'm tellin' ya! I didn't see anything funny near Shisho, and I didn't touch anything in the room.\nBlackquill:\nYour Baldness, I request that that statement be added to Geiru's testimony.\nAthena:\nSimon! What's a statement like that going to do for us?!\nBlackquill:\nJust play along and you'll see soon enough.\nAthena:\nUgh...\nJudge:\nHmm... I have no problem with adding that to the testimony, but how about you, Ms. Cykes?\nAthena:\nI-I have no problem with it either, Your Honor. (What is Simon thinking?)\nAdds statement \"I didn't see anything funny near Shisho, and I didn't touch anything in the room.\"Press (subsequent times)\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nWhere did you find your master's note?\nGeiru:\nI dunno. Can't remember. \nAthena:\nDid you notice anything else unusual or out of place in the room?\nGeiru:\nWell, there was the saké and a half-eaten manju on the table. But I didn't see anything else out of place or whatever in the room, though.\nBlackquill:\nOh, is that a fact?\nGeiru:\nO-Of course it is! Whaddaya think?!\nBlackquill:\nAnd you didn't change anything around while you were in there?\nGeiru:\nI didn't do anything! Look, I'm tellin' ya! I didn't see anything funny near Shisho, and I didn't touch anything in the room.Geiru:\nThe perfume Owen smelled musta been left over from when I visited.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSo you admit that the scent Owen smelled when he witnessed the crime... ...was from your perfume?\nGeiru:\nYeah, sure. Why not? All it proves is I was in the dressing room anyway. It don't do a thing to prove I killed Shisho!\nAthena:\nTh-That may be true, but...!\nGeiru:\nBucky's the one who bumped off Shisho!Geiru:\nI didn't see anything funny near Shisho, and I didn't touch anything in the room.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSo I just want to confirm: You didn't see anything at all unusual or out of place anywhere around the victim?\nGeiru:\nI already told ya! Nothin'!\nAthena:\nAnd you didn't touch anything at all in the dressing room?\nGeiru:\nHow many times I gotta say it?! No, I didn't touch anything!\nAthena:\n(Wait... But then, is she saying she didn't see... ...what Uendo immediately saw when he checked the victim's body? Does that mean it wasn't there yet at that time?)\nGeiru:\nOh, hold on! I guess there was something...\nAthena:\nWhat is it?\nGeiru:\nThe soba-making equipment was already there in the room. That means Bucky must've been there in the dressing room before me, doin' something!\nAthena:\nArngh... Thanks for the non-help...Present Crime Scene Report or Karuta Cards\n\n\n\n\n\n\n\nAthena:\n\nLeads to:\n\"Geiru, you said that you didn't notice anything odd or unusual near your master.\"Before pressing third statement\n\n\n\n\n\n\n\nAthena:\nSo Geiru is insisting that she visited the dressing room... ...before Master Toneido was killed.\nBlackquill:\nSo it would seem. But if you keep on her, she may slip up under pressure.\nAthena:\nSounds like a plan!After pressing third statement\n\n\n\n\n\n\n\nAthena:\nWell, a new statement has been added... ...but she's still sticking to her guns.\nBlackquill:\nShe said she didn't see anything unusual in the dressing room. But that strikes me as a little strange on its own.\nAthena:\nReally? Why?\nBlackquill:\nIf Master Toneido really is the one who left that, you'd think Geiru would have noticed it. And if Master Toneido wasn't the one who left it, then we must ask, who did? You know what I'm getting at, don't you, Athena?\nAthena:\nI-I think so...! (I really appreciate Simon's help, but I've got to come up with the answer myself this time!)Athena:\nGeiru, you said that you didn't notice anything odd or unusual near your master. You also said you didn't touch anything in the dressing room.Geiru:\nThat's right! What about it?!Athena:\nThen, I wonder who left that \"dying message\" with the karuta cards?Geiru:\nWhat're ya going on about?! It hadta been that Bucky!Athena:\nSorry, but that's not possible. Because only three people knew of Uendo's personalities: Uendo, your master, and you!Geiru:\nEek!Blackquill:\nIf Bucky had left that karuta message... ...he wouldn't have spelled out \"Owen.\" He would've spelled out \"Uendo.\"Athena:\nWhat it boils down to is this: As a member of the Toneido School, you, Geiru Toneido... ...are the only one who could've left that \"dying message\"! And as the person who left that message... ...it's clear that you are Master Toneido's killer!Geiru:\nGrrrrragh! Will ya EVER quit yer yappin'?!Nahyuta:Nahyuta:\nYou are like wretches clinging to the spider thread of salvation. Allow me... to cut that holy thread from the heavens, and bring you back down to Earth.Athena:\nWould you quit butting in whenever things start to go my way!Nahyuta:\nSilence, child. Playtime is over.Athena:\nWh-What did you just say?!Nahyuta:\nAs the witness stated, she went into the dressing room and soon came back out again. But the victim's note was not the only reason she left with such haste. There was another reason that compelled Geiru to leave at once. Geiru, would you please relate said reason to the court?Athena:\nThere was a reason why Geiru had to leave the dressing room...?Geiru:\nWell, I didn't wanna show ya this, but I guess I got no choice. Keep yer eyes peeled! 'Cause here it comes!Athena:\nYour hand is all swollen and red...! What happened, Geiru?Geiru:\nIf ya must know... I'm allergic to buckwheat!Athena:\nWH-WHAAAAAAAAAAAAAAAAAAAAAAT?!Nahyuta:\nAllergic reactions to buckwheat can vary, though they're usually on the severe side. With Taifu Toneido making soba noodles in his dressing room... ...Geiru is lucky to still be alive, considering all the soba flour that was swirling in the air.Geiru:\nGood thing I left pretty quick! I managed to escape with just a mild reaction. But I touched Shisho as he was being carried away, and look what it did to my poor hands! There musta been soba broth on his clothes or something. If I'd inhaled any of that soba flour, I'da had a seizure, and it'd been \"Good night, Geiru!\" I never coulda stayed in that dressing room for very long!Judge:\nA person allergic to buckwheat couldn't be in a room with soba flour in the air... ...and certainly couldn't use soba dough as a murder weapon, either.Athena:\nTh-This isn't good...Blackquill:\nYou knew it would come to this, didn't you?! That's why you never mentioned her allergy!Nahyuta:\nHmph. As if I would do anything so underhanded. I was simply trying to protect the privacy of this witness.Geiru:\nI'm sick of all these accusations! Why don't I just testify and get it all out in the open, yeah?Witness Testimony-- Geiru's Buckwheat Allergy --Geiru:\nIf I come into the slightest contact with buckwheat, I get an allergic reaction.\nAnd with that much soba flour in the air, that room coulda literally killed me!\nLook at my hand! Just touchin' Shisho's body caused this much damage.\nThere musta been soba broth on his clothes.\nSo I never coulda committed that murder in the dressing room!Athena:\nI still can't believe it. Nobody told me she had a soba allergy... Did you know, Simon?Blackquill:\nHmph. Does it look like I knew? \"Protect the privacy of the witness,\" my foot! What a dirty trick!Athena:\nN-Now what do we do...?Blackquill:\nThere's only one thing TO do. Put Prosecutor Sad Monk to shame with your cross-examination!Athena:\nRight! No matter how small, I'll find us an opening, and break her testimony down!Cross ExaminationCross Examination-- Geiru's Buckwheat Allergy --Geiru:\nIf I come into the slightest contact with buckwheat, I get an allergic reaction.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nY-You're not lying about this soba allergy of yours, right?\nGeiru:\nOf course not! I swear on the grave of my father up in heaven! I can even get ya a doctor's certificate, if ya want.\nAthena:\n(She... seems to be telling the truth...)\nGeiru:\nI've had this allergy for as long as I can remember... But I never dreamt in a million years it'd clear me of murder!\nJudge:\nAnd you'll come out of this smelling like a delicate buckwheat flower to boot!\nGeiru:\nWell said, Your Honor!Geiru:\nAnd with that much soba flour in the air, that room coulda literally killed me!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nI'll give you that there was quite a bit of flour scattered about in that dressing room. But you went in to pay your respects to your master regardless, right?\nGeiru:\nYeah, but, like I said, I came right back out. I mean, the soba-making tools were right there! Ya better believe I was careful not ta breathe any of it in!\nAthena:\nBut you still could've committed this crime if you'd held your breath while doing it!\nGeiru:\nDon't be ridiculous! I woulda suffocated to death before Shisho did!\nAthena:\nY-Yeah, I guess you're right...\nGeiru:\nGeez. Get a grip, will ya?!Geiru:\nLook at my hand! Just touchin' Shisho's body caused this much damage.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nMaybe there's a twist here -- like you're actually allergic to dogs, and not soba?\nGeiru:\nYou kidding?! Bring my lil' Jugemu in here! I'll hug n' squeeze 'im like there's no tomorrow! I'm telling ya! I have a genuine, honest-ta-goodness soba allergy!\nNahyuta:\nDefense, the witness clearly has an authentic allergy to buckwheat. Any further deliberation on the matter would be meaningless! Pointless! Worthless!\nGeiru:\nYou heard the man, lawyer girl!\nAthena:\nAll. Right. Fine! I was just starting to think the same thing myself! (Doesn't mean I have to like it, though...!)\nGeiru:\nI probably got this allergic reaction on my hand here 'cause I touched Shisho.Geiru:\nThere musta been soba broth on his clothes.Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nI have a question about that, actually. If you're allergic to soba, does that mean you're allergic to the noodle broth, too?\nGeiru:\nWell, the buckwheat from the noodles can dissolve into the broth, so, duh. Touchin' soba broth can be just as deadly for me. Don't ya know anythin'?! What an amateur!\nAthena:\nI-I'm sorry... (Do I look like a doctor to you?!)\nGeiru:\nLook. Anything that has soba in it, or anything that has touched soba, is like poison to me!Geiru:\nSo I never coulda committed that murder in the dressing room!Press\n\n\n\n\n\n\n\nAthena:\n\nAthena:\nSo, I just want to cover all of my bases, but... ...could the murder have possibly occurred somewhere OTHER than the dressing room...?\nNahyuta:\n\nNahyuta:\nThat is out of the question. By even asking, you show your complete disregard for all we have discussed until now.\nJudge:\nYes, I have to agree. The defense can't go around suggesting new premises without basis.\nGeiru:\nUnfortunately for you... ...Shisho didn't take a single step from his dressing room around the time of the murder.\nAthena:\nW-Well, that IS unfortunate... for everyone.Athena:\nI-I don't see any particular inconsistencies in her testimony. And she seems to be telling the truth about her buckwheat allergy.Blackquill:\nHmph. What is your point?Athena:\nMy point is, I can't find a single foothold!Blackquill:\nWell, if you can't find one, make one!Athena:\nY-You want me to just make up some baseless accusation?!Blackquill:\nWhen will you stop behaving like such an amateur? If you don't do something fast, the trial will end here.Athena:\nI know, I know...! (I can't let that happen! I-I have to do something -- anything!)"
    }
  ]
}