{
  "previousContext": "Turnabout Revolution\nImage Gallery\nTranscript\nPart 1\nPart 2\nPart 3\nPart 4\nEpisode 5Turnabout Revolution\nAnime cutscene\nDefiant Dragons henchman actor:\nHeeheeheehahaha!\nRayfa actor:\nAaah! Why me?!\nDhurke actor:\nMwahahahaha! It's time for a revolution!\nRayfa actor:\nNo! Let go of me!\nPlumed Punisher actor:\nThat's far enough!\nDhurke actor:\nWho's there?!\nPlumed Punisher actor:\nIt is I-- The Plumed Punisher: Warrior of Neo Twilight Realm!\nDhurke:\nGood people of Khura'in, we can't allow things to go on like this. The Defense Culpability Act has done nothing but produce countless victims of wrongful convictions. The time to act is now. For we, the Defiant Dragons, have obtained the ultimate weapon: the Founder's Orb! And to the Ga'ran regime: Make no mistake about it-- I will personally dethrone you! A dragon never yields. Nor will he rest until his revolution is complete.\nMay 16, 11:00 AMWright Anything Agency\nTV:\n...And this concludes our report on the recent television hijacking in Khura'in. But really, who could have anticipated a surprising turn of events?\nTrucy:\nDid you hear that, Polly? Someone hijacked the airwaves over there! It's like something out of a movie!\nApollo:\n.........\nTrucy:\nApollo?\nApollo:\n......Um, yeah. Dhurke... What are you up to this time?\nTrucy:\nWait a second... Do you know the TV hijacker or something, Apollo?\nApollo:\n......You could say that... but it was a long time ago.\nTrucy:\n...And WHY do you know someone like that? I mean, they're calling him an \"insurgent.\"\nApollo:\nY-Yeah, about that...\n???:\nHey now. Is that any way to talk about the man who raised you?\nApollo:\nHuh?\nDhurke:\nHey there, Apollo! Long time no see! How've you been, son?\nApollo:\nI-I-It's--\nTrucy:\nIt's that guy that was on TV!\nDhurke:\nHah-ha ha ha ha ha! Guilty as charged! Surprised to see me, Apollo? I just beamed in from Khura'in, and boy are my arms tired!\nApollo:\nTh-Th-This can't be happening! ...I must be dreaming... or hallucinating... or both...\nTrucy:\nNo, you're not, Apollo! It's that TV hijacker-slash-insurgent in the flesh!\nApollo:\n........ (I'm so confused.)\nTrucy:\nUm! Mr. Hijacker! Sir! I have SO many questions, I don't even know where to begin! But let's start with that bit about \"the man who raised you.\"\nDhurke:\nWait, don't tell me you haven't told anyone about me, son? It's okay to brag about it. Tell everyone your old man's me, the rebel Dhurke! I mean, my face is all over TV these days! I'm practically a celebrity, hah-ha ha ha ha ha!\nApollo:\n.........Trucy, what do you say we close up early today?\nTrucy:\nWhat?! Why?!\nDhurke:\n...Aw, come on, son. No need for the cold shoulder!\nApollo:\n......... (*sigh* I know I'm going to regret this, but...) What do you want, Dhurke? You just show up here without warning after all this time... What gives?\nDhurke:\nI came all this way to see you, son! Come, rejoice!\nApollo:\nRiiight... Why don't you tell me the real reason you're here.\nDhurke:\nW-Well... Okay, so maybe there's a little something I need your help with, too, but... The fact is I came here to see you. That's the honest truth.\nApollo:\nYes, I think we've established that. (It figures... I haven't seen him in ten plus years and he's already asking for a favor. He really is a rebel in the purest sense -- he just does whatever he pleases.)\nTrucy:\nC'mon, Polly! I need details. Inquiring minds want to know!\nApollo:\nOkay, okay. Hold your horses. First, I've got a few questions of my own.\nExamine\nBookshelf\nDhurke:\nHm? Why, this is Apollo's journal.\nApollo:\nHuh?! What's it doing at the office?\nTrucy:\nIt's magic!\nDhurke:\nLet's see what he wrote...\nApollo:\nN-No, don't!\nDhurke:\nHuh... There's nothing in here.\nApollo:\nWhat?\nTrucy:\nThis calls for a special spell! Presto diario!\nDhurke:\nWhy, there's writing appearing right before my very eyes!\nTrucy:\nLike I said, it's magic! Now go ahead, read to your heart's content!\nApollo:\nWow! ...Er, I mean, give me that!\nCharley the plant\nApollo:\nThat's Charley the houseplant.\nDhurke:\nYou know, my hideout used to have a houseplant, too. We called it \"Apollo.\"\nTrucy:\nI bet it was a cactus!\nDhurke:\nHow'd you guess?\nTrucy:\nBecause Polly's hair's just as spiny!\nApollo:\nHey, leave my hair out of this.\nTrucy:\nAnd he has a prickly attitude, to boot!\nApollo:\n(I better quit while I'm ahead.)\nHula hoop\nDhurke:\nMore magic props... Oh! I've seen a ring like this before! I used to be quite good with these.\nApollo:\nReally? Why don't you show us?\nDhurke:\nWell, if you insist! I'll show you the act of daring-do I used to perform to supplement my income. First, I have to light the ring on fire, then I'll jump through it...\nApollo:\nThat's a fire hoop, this is a kid's toy, Dhurke...\nMagic props\nDhurke:\nThis is one seriously cluttered office. I mean, do you really need a piano here?\nTrucy:\nWell, it has sentimental value for Daddy, you see...\nApollo:\nYeah, but this office could use a little help with its bottom line. What if we sold it?\nTrucy:\nApollo! ...You'd better give me a cut of the proceeds when you do.\nDhurke:\nMoney before memories, eh? This office's finances really must be in dire straits then.\nMagic split box\nDhurke:\nThis is one of those contraptions for cutting people into pieces!\nTrucy:\nHow did you know that, Mr. Dhurke?\nDhurke:\nWell, it just so happens I've been in one of these myself.\nApollo:\nReally?\nTrucy:\nYou have?\nDhurke:\nYes. Once, when I was being held prisoner by Minister Inga's secret police... ...they tried to torture me into revealing one of my compatriot's hideouts.\nApollo:\nThat's a torture device, this is a magic prop, Dhurke...\nDhurke:\nMan, I barely escaped that thing alive!\nTrucy:\nWell, you have my respect as a magician for your death-defying spirit!\nTable\nDhurke:\nWhat's with this bright red jacket? Who would wear such a garish thing?\nTrucy:\nMaybe one of our clients forgot it here.\nDhurke:\nI'd love to get a look at the man who'd dare wear something like this!\nTrucy:\nMe, too!\nApollo:\n(I know I don't wear it much, but... she has to know it's mine, right?)\nTalk\nDhurke\nDhurke:\nPleased to meet you, little lady. My name is Dhurke Sahdmadhi. I'm a... well... a rebel by trade.\nTrucy:\nA rebel? But on TV, they were calling you an insurgent. So which is it? Personally, I vote for a rebel with a cause -- a real \"head\"-ache for anyone in your way!\nApollo:\nTrucy...!\nDhurke:\nHah-ha ha ha ha ha! You got me there. I'm the head of a resistance group. The Defiant Dragons. We're like the good, the bad, and the ugly... but without the good part. In Khura'in, I'm like the bogeyman -- a tall tale parents use to spook their kids straight!\nTrucy:\nThat's too bad. You seem like you'd be a fun, cool guy to hang with!\nDhurke:\n...This little lady's a real catch, son. I'm talking bride material, if you get my drift.\nApollo:\nWait, what?\nTrucy:\nOh! Stop it! You're embarrassing me... Dad.\nDhurke:\nHah-ha ha ha ha ha. She's a plucky one, all right!\nApollo:\nSomeone pluck me out of my misery...\nTrucy:\nNow, about that \"man who raised you\" business...\nFoster father (appears after \"Dhurke\")\nTrucy:\nWhat did Mr. Dhurke mean when he said that he's \"the man who raised you,\" Apollo?\nApollo:\nThe truth is, I grew up in the Kingdom of Khura'in. Did I, uh... never mention that?\nTrucy:\nOh, so you grew up in... Khura'in?! Wait, are you saying... ...you're not from around here, Polly?\nApollo:\nNo, it's just I was raised in Khura'in when I was really little.\nTrucy:\nStill, that's a shocker. It's like I hardly know anything about you! How come you never told me?!\nDhurke:\n...Apollo. You really haven't said a word about your past, have you?\nApollo:\nWhat, that I was raised by a wanted criminal? It's like a bad joke.\nTrucy:\nIt does sound rather melodramatic. I doubt anyone would even believe you. So you two haven't seen each other in a while, huh?\nApollo:\nYou could say that. I'd wager it's been at least ten years.\nTrucy:\nWow... That's a really long time.\nApollo:\nYeah, well, I figured he'd forgotten about me.\nDhurke:\nNot a chance! It's just, well... Starting a revolution takes time, and keeping it going even more so... And being a wanted man, I couldn't just hop a plane to come say hello.\nApollo:\n...I get it. It's fine. (Though, truth be told... ...it's weird having Dhurke suddenly show up acting all paternal. I'd even almost forgotten about Khura'in... No, that's not true. I probably tried to forget about it on purpose.)\nTrucy:\nNow then, Mr. Dhurke, what is it we can help you with?\nRequest (appears after \"Foster father\")\nDhurke:\nI need to get my hand on the Founder's Orb, the most sacred treasure of Khura'in. That's where you come in.\nApollo:\nThe Founder's Orb?\nTrucy:\nWait, but didn't you say you already have it in that broadcast of yours?\nDhurke:\nHah-ha ha ha ha ha! Don't go believing everything you see on TV, little lady. No one's seen hide nor hair of the Founder's Orb for some time.\nTrucy:\nNo way!\nApollo:\nS-So that was just a bluff...? What are you going to do if you DON'T find it?\nDhurke:\nI don't know. Guess that just means we HAVE to find it, son. 'Cause I can't really back down now, can I? Hah-ha ha ha ha ha!\nApollo:\n(*sigh* Different year, same old Dhurke. It's all coming back to me now.) Hold on. I think I read something about this in the newspaper a while back. Something about you stealing a sacred treasure from a temple's treasure room.\nDhurke:\nThat's a load of crock. We didn't lay a finger on the orb.\nApollo:\nReally?\nDhurke:\nYes, Baseless allegations, all of it. Our enemy has really found a way to keep us all on our toes.\nTrucy:\nOoh! So it's like a setup!\nDhurke:\nThat's the long and short of it. However, my compatriot has been hot on the orb's trail. And just the other day, his hard work finally paid off. We now know the Founder's Orb is in... Kurain Village.\nApollo:\nKurain Village?\nDhurke:\nYes. I hear there are spirit mediums there. They even have direct relations with Khura'in.\nApollo:\nSpirit mediums... Right...\nDhurke:\nSome doctor of archeology there supposedly has the orb. His name is Archie Buff. My Defiant Dragon compatriot has already made contact with him. Apparently, someone asked the doctor to study the orb.\nApollo:\nSo whoever asked him to do that is the real thief?\nDhurke:\nMost likely.\nApollo:\nAnd you think this guy will just hand the orb over to you?\nDhurke:\nMy compatriot, Datz, says Dr. Buff has already promised to do so. It seems he knew it was stolen, and wanted to do the right thing.\nApollo:\n(Datz... I remember running around him when I was a kid.) (So he's here, too, huh.)\nDhurke:\nApollo, I want you to be present as my lawyer when I take possession of the orb. Would you do that for me?\nFine\nLeads to:\n\".........Fine, but I'll charge my standard fee.\"\nNope\nApollo:\nI haven't seen you in years, and you waltz in here asking for a favor? You have a lot of nerve, you know--\nTrucy:\nOf course we'll help! Right, Apollo?!\nApollo:\nW-Wait, Trucy...!\nTrucy:\nOh, come on. It's not like you have any work anyway. Besides, we're talking about rebels and legendary treasure here. It'll be fun!\nApollo:\n(*sigh* Why is she always into the things I'm not?)\nLeads to:\n\".........Fine, but I'll charge my standard fee.\"\nApollo:\n.........Fine, but I'll charge my standard fee. Now tell me about the Founder's Orb.\nThe Founder's Orb (appears after \"Request\")\nApollo:\nIf I remember correctly, the founder is always depicted as a faceless spirit medium.\nTrucy:\nWhat do you mean \"faceless\"?\nDhurke:\nImages of the founder, the Holy Mother of Khura'in, never show her face. To depict it is to commit the greatest taboo in Khura'inism.\nApollo:\nThe greatest taboo, huh? (I wonder why? I mean, what could she have looked like to make them hide her face like that?\nDhurke:\nAs for the Founder's Orb, it was discovered during an excavation eight years ago... ...and has an interesting legend that goes along with it. It's said that there's a riddle to the orb, and that any who can solve it... ...will receive immense spiritual power from the founder herself.\nApollo:\nSounds like one big fairy tale to me.\nDhurke:\nIn any case... ...it's just what us Defiant Dragons need to get our revolution started. With it, we can gain the spiritual power, and thus, the legal authority to rule Khura'in!\nApollo:\nWait, suppose I believe this legend. Then, anyone could become king or queen? And THAT'S why you think it'll help you overthrow the Gar'an regime?\nDhurke:\nOnly the rulers of Khura'in have ever laid eyes on the orb, Apollo. A legendary treasure that bestows immense spiritual power... Doesn't that sound like something you'd want to see with your own two eyes?\nApollo:\n(...That does sound just a tiny bit intriguing.)\nFounder's Orb added to the Court Record.\nDhurke:\nThat should just about cover everything. Any other questions?\nApollo:\nNot right now.\nDhurke:\nAh, I almost forgot. I brought you a present. Eat up, son!\nApollo:\n...Sushi?\nDhurke:\nI figured you probably couldn't afford three square meals a day, so...\nTrucy:\nYay! I was just thinking it was time for lunch!\nDhurke:\nYou dig in, too, little lady. After all, we're practically family, right?! Hah-ha ha ha ha ha!\nTrucy:\nThanks, Dad! Ooh, that tuna looks good! *chomp* *nom nom nom*\nDhurke:\nThis salmon sushi's got my name on it! *chomp* *chew chew chew* Aren't you hungry, son? This is some of the best sushi you'll ever have!\nApollo:\n.........I'm... I'm good.\nDhurke:\nO-Oh, well... Okay then. ...Actually, I have one more present for you. Here.\nApollo:\nWhat's this?\nDhurke:\nA picture of your father. It's been twenty-three years since he passed away.\nApollo:\nHuh?! This... This is my father?\nDhurke:\nHis name was Jove Justice.\nApollo:\nJove...\nDhurke:\nI haven't talked to you about your real father in some time, but as you know... ...he was a musician -- a wandering minstrel, if you will -- and a talented one at that.\nApollo:\n............ Why... Why are you giving this to me now?\nDhurke:\nI thought it was sad you didn't know what your old man looked like. I searched high and low to find that one picture.\nApollo:\n............\nTrucy:\nWhat's wrong, Apollo? Don't you want it?\nApollo:\n(I don't know. I mean, it's not like I ever met the guy.)\nDhurke:\nWell, I went through all the trouble of finding it, so go on, take it! And don't ever let it go, you hear?\nPhoto of My Father added to the Court Record.\nDhurke:\nWell, now that our bellies are full, what do you say we hit the road?\nApollo:\nOne second. Hey, Trucy, any idea where Athena is?\nTrucy:\nShe left early this morning to pick up Daddy from the airport.\nApollo:\nOh, I almost forgot. Mr. Wright is coming back today.\nTrucy:\nYeah... but I wonder why he cut his trip short like that. Anyway, shouldn't they have been back by now?\nApollo:\nKnowing Athena, she probably got lost. Well, there's no point sitting around here waiting. Let's get going.\nTrucy:\nI can't wait to see that super mysterious treasure!\nDhurke:\nTo Kurain Village, then! The Founder's Orb awaits!\nThe Founder's Orb (subsequent times)\nApollo:\nIf I remember correctly, the founder is always depicted as a faceless spirit medium.\nTrucy:\nWhat do you mean \"faceless\"?\nDhurke:\nImages of the founder, the Holy Mother of Khura'in, never show her face. To depict it is to commit the greatest taboo in Khura'inism.\nApollo:\nThe greatest taboo, huh? (I wonder why? I mean, what could she have looked like to make them hide her face like that?\nDhurke:\nAs for the Founder's Orb, it was discovered during an excavation eight years ago... ...and has an interesting legend that goes along with it. It's said that there's a riddle to the orb, and that any who can solve it... ...will receive immense spiritual power from the founder herself.\nApollo:\nSounds like one big fairy tale to me.\nDhurke:\nIn any case... ...it's just what us Defiant Dragons need to get our revolution started. With it, we can gain the spiritual power, and thus, the legal authority to rule Khura'in!\nApollo:\nWait, suppose I believe this legend. Then, anyone could become king or queen? And THAT'S why you think it'll help you overthrow the Gar'an regime?\nDhurke:\nOnly the rulers of Khura'in have ever laid eyes on the orb, Apollo. A legendary treasure that bestows immense spiritual power... Doesn't that sound like something you'd want to see with your own two eyes?\nApollo:\n(...That does sound just a tiny bit intriguing.)\nPresent\nAttorney's Badge\nDhurke:\nWhat's that?\nApollo:\nIt's my attorney's badge.\nDhurke:\nI can relate. I used to want to show mine off, too. But don't ever show it to anyone in Khura'in. They'll run you right out of town the moment they find out you're a lawyer.\nApollo:\nI wonder how it went for Mr. Wright. Knowing him, he probably flashed his left and right...\nFounder's Orb\nDhurke:\nThe Founder's Orb... They say the Holy Mother will return when the riddle of the orb is solved. And she will bestow great spiritual power upon whoever accomplishes that feat.\nApollo:\n(I wonder if I could channel spirits if I had such power.)\nPhoto of My Father\nDhurke:\nBrings back memories... He was a fine young man. So cheerful and fun to be around. His big, booming singing voice would captivate everyone in the tavern. But looks-wise, he was like a grownup version of you.\nApollo:\nUm, that still doesn't give me a sense of what my real father was like.\nAfter clearing \"The Founder's Orb\" Talk option in Wright Anything Agency:\nMay 16Kurain Village\nApollo:\n(So this is Kurain, the mystical village of spirit channeling... ... and where ancient traditions come alive. Looks like a really peaceful place.)\nDhurke:\nAhh, I love the air here! Nothing beats the mountains, huh, Apollo?!\nApollo:\n(Come to think of it... We used to live way up in the mountains, too, just like this.)\nDhurke:\nSure brings back memories. Those were the days. The three of us living happily in peace.\nTrucy:\n...I still can't wrap my mind around it all, you know. That Mr. Dhurke is not only Polly's daddy, but Prosecutor Sahdmadhi's as well. And the way you two talked about it like it was nothing the whole bus ride here!\nApollo:\n(I guess it IS a lot to take in...)\nTrucy:\nSo tell me, Mr. Dhurke, what was Apollo like as a kid?\nDhurke:\nOh, he was full of piss and vinegar, he was. A real rascal! He and Nahyuta used to run around in the open fields, naked as jaybirds. I've even got pictures of him posing in his birthday suit!\nApollo:\nWhoa, whoa, Dhurke!\nTrucy:\nNo way! Prosecutor Sahdmadhi used to be like that, too?\nDhurke:\nThe two of 'em would end up with leeches on their butts and cry like babies, hah-ha ha!\nApollo:\nDhurke! Don't you think you've said enough?!\nDhurke:\nAw, you're no fun.\nTrucy:\nYeah! I wanted to hear more about the misadventures of Polly!\n???:\nHey, what are you people doing here?\nApollo:\nEma?\nDhurke:\nYou know this lady, son?\nApollo:\nYeah, this is Ema Skye. She's a detective.\nEma:\nTechnically speaking, I'm a forensics expert, but I'll let it slide. ...Anyway, I can't say I'm surprised to see you here. You always seem to pop up whenever there's trouble afoot. Still, what are the odds of running into you here in the boonies?\nApollo:\nBy \"trouble,\" you mean you're investigating a case?\nEma:\nDoes it look like I'm here to sightsee? .........Wait, don't tell me... You're not here to see Dr. Buff, are you?\nApollo:\nHuh? How'd you know that? We're actually on our way to meet with him right now.\nEma:\nFigures... Well, follow me. I'll show you the way.\nApollo:\n...Really?\nDhurke:\nDon't look a gift horse in the mouth, son. Just follow the nice lady.\nExamine\nPhone booth\nApollo:\n(A phone booth and a bus stop made of wood. They both look really old. You hardly ever see phone booths in the city anymore.)\nDhurke:\nApollo... what's this glass box for?\nApollo:\n(I guess you hardly see them in Khura'in, too.)\nKurain Boulder\nApollo:\nThere's a big boulder towering into the sky over there. According to the sign, it's called the \"Kurain Boulder.\" It also says that a spirit dwells within it. Hmm... A rock with a spirit in it?\nDhurke:\nIt's called animism -- the belief that spirits dwell within inanimate objects. They've probably enshrined this boulder as a sacred object. Their tradition of worshiping such objects is similar to our tradition in Khura'in.\nApollo:\nI-Interesting... (Who knew Dhurke could make sense every once in a while?)\nMountains\nDhurke:\nSeeing those mountains really takes me back. I remember when we used to live high in the mountains to escape from the government.\nApollo:\nSo, you don't live there anymore?\nDhurke:\nNope. I needed a more convenient place to lead the revolution from. But that old mountain hut is still there.\nApollo:\n(Man, I miss that hut...)\nDhurke:\nWhat, are you getting homesick, Apollo? You can come on back to Khura'in anytime, you know?\nApollo:\nN-No, no, I'm fine. Besides, I've got a lot on my plate here...\nFey Manor\nApollo:\nA thatched roof... First time I've ever seen one in real life.\nDhurke:\nIt looks just like the traditional thatched roofs they use in Japan. All we need now are some samurai with topknots, a few ninjas, and a cuddly mascot.\nApollo:\nWhen was the last time you were in Japan?\nTalk\nAny ideas?\nDhurke:\nMass transit and electronic communications... This country's infrastructure is really advanced compared to Khura'in.\nApollo:\nWhy don't you see the sights once you have the orb?\nDhurke:\nWell... I guess I could use a break. How about you show me around?\nApollo:\n...Oh, um, I'll probably be busy with work, so, uh...\nDhurke:\n...I-I see.\nTrucy:\nWhat are you talking about, Polly? Your only work right now is cleaning the office.\nWhat to do\nDhurke:\nThe Founder's Orb should be with the doctor right now. What do you say we go take a gander?\nApollo:\nWhat if he doesn't have it? What if you came all the way from Khura'in for nothing?\nDhurke:\nI'll cross that bridge if and when I come to it. Besides... even if I leave empty-handed, at least I got to see you, son.\nApollo:\n...Oh, ha ha. Thanks?\nDhurke:\nN-No, no -- I really mean it.\nMay 16Kurain Village - Doctor's Study\nApollo:\nSo this is Dr. Buff's study...\nTrucy:\nWow, look at all those books! The shelves go from floor to ceiling! It's like a library in here!\nDhurke:\nYes, and lots of artifacts, too. A true archeologist's paradise. Look, son! There are so many relics, they're spilling onto the floor! What a delightfully amusing room!\nApollo:\nAll I see is a mess. (And what's with that white outline...?) ...Um, Ema, where's the doctor?\nEma:\nWell the thing is... he died last night.\nApollo:\nWait, what?\nEma:\nIt seems an avalanche of books knocked him off his bookshelf ladder. We're labeling it an accidental death.\nApollo:\nWHAAAAAAAAAAAAAAT?! Please tell me you're joking...\nEma:\nAs if I'd come all the way out here for a few laughs, Apollo.\nApollo:\n...Yeah, I guess not.\nDhurke:\nA scholar killed by his own books...\nApollo:\nOh man. What do we do now? I mean, how can he transfer ownership of the orb to you if he's dead?\nDhurke:\nYes, that is a problem.\nApollo:\nEma, can you please tell us exactly what happened?\nExamine\nEma:\nWhat do you think you're doing? You can't just poke around without my permission.\nApollo:\n(Guess I should ask her what's going on first.)\nTalk\nThe doctor's death\nApollo:\nSo the doctor died in an accident?\nEma:\nI received a call this morning saying Dr. Buff had been found dead under a pile of books.\nApollo:\nThis morning? (Talk about bad timing...) You mentioned that he had fallen off a ladder.\nEma:\nRight. We believe he fell from the top of that big ladder there. Apparently, he triggered an avalanche of books while fumbling to reach one. And that sent him headlong on a fatal fall onto the hard floor.\nTrucy:\nHow sad... Killed by his own books. But at least he was doing something he loved.\nDhurke:\nFor a scholar, I suppose it's kind of like a soldier killed in the line of duty. You could say he died an honorable death.\nApollo:\nEma, who was the first one to discover the body?\nEma:\nAbout that... Whoever it was, it seems they wanted to remain anonymous.\nApollo:\nWhat?\nEma:\nIt happens now and then. Some people would rather not get involved with the police.\nDhurke:\nI can relate to that.\nApollo:\n(Yeah, being a wanted man and all.) What now, Dhurke? A dead man can't exactly hand over the orb.\nDhurke:\nWe'll just have to find it. It must be around here somewhere.\nApollo:\nJust to fill you in, Ema, we're actually here to get something.\nThe Founder's Orb (appears after \"The doctor's death\")\nApollo:\nPops here had an agreement with the doctor. The doctor was supposed to hand over a sacred relic known as the Founder's Orb.\nDhurke:\n\"P-Pops\"...?\nEma:\nOh, I see. That could be a problem, considering he's dead. Do you have a plan B?\nApollo:\nUmm...\nDhurke:\nI have an agreement in writing. My compatriot Datz should have it.\nEma:\nWell, there shouldn't be any problems, then. So, who IS this gentleman you're escorting?\nDhurke (appears after \"The Founder's Orb\")\nLeads to:\n\"Oh, right, I haven't introduced you yet. This is Dhurke. He's from the Kingdom of Khura'in.\"\nPresent\nAttorney's Badge\nEma:\nYour attorney's badge? Huh...\nApollo:\nWhat, that normally gets a better reaction from you.\nEma:\nI'm tired of collecting your fingerprints. It's kind of lost its luster.\nApollo:\nYeah, but who knows? There could be other people's prints on it.\nEma:\nOoh, that's true! Hand it over, buddy!\nApollo:\nAh!\nEma:\n............Hmph. The only prints I found were yours.\nApollo:\n(Argh, it's all dusty now.)\nFounder's Orb\nEma:\nScientifically speaking, ancient relics are highly fascinating.\nApollo:\nWhy's that?\nEma:\nBecause of all the tests I can run. CT scans, electron microscopy, chemical analysis... The list goes on and on! If you ever do find one, you'd better bring it to me straight away!\nApollo:\nCan I count on getting it back intact?\nEma:\nWe'll see. Scientific advances don't come without sacrifices, you know.\nApollo:\n(...I know someone who WON'T be seeing the orb anytime soon.)\nAnything else\nEma:\nYou sure like to shove things in people's faces, don't you?\nApollo:\nWhat about you? You're always dusting around for prints.\nEma:\nThat's my job!\nApollo:\nWell, it's not like I'm presenting evidence for the fun of it, either.\nEma:\nReally? Because it sure seems like you enjoy it, Apollo.\nApollo:\nRight back at you, Ema.\nApollo:\nOh, right, I haven't introduced you yet. This is Dhurke. He's from the Kingdom of Khura'in.\nEma:\nAll the way from Khura'in, huh? So, what do you do there?\nDhurke:\nI used to practice law, but I'm taking a break from all that. I'm focused now on making Khura'in a better place through... volunteer work.\nEma:\nVolunteer work, huh? How interesting...\nApollo:\n(...Well, it's not technically a lie.)\nEma:\nSo, how do you two know each other?\nApollo:\nOh, um... He's sorta my foster father.\nEma:\nCome again?\nTrucy:\nYeah! And he's Prosecutor Sahdmadhi's real father, too!\nEma:\nWhaaat?! You mean you... and Prosecutor Sahdmadhi... ............I'm so sorry. It seems you've had quite a life.\nApollo:\n(...Guess she's put a few things together.)\nEma:\nActually, Dhurke, you look kind of... familiar. Have we met before?\nDhurke:\nUm, not that I recall.\nApollo:\n(Great... She must've seen that news report on TV. It will really complicate things if she figures out he's a wanted man.) There are lots of guys who look like him. Sure you're not mistaking him for someone else?\nEma:\nAre there, really? I mean, a middle-aged man with long hair and an eye patch? You don't see that every day.\nApollo:\nW-Well, I'm sure you're just imagining things.\nEma:\nSo what does that sacred relic you're searching for look like? I mean, there's lots of stuff in here that's old and relic-y.\nDhurke:\nIndeed. Unfortunately, I've no idea what it actually looks like.\nApollo:\nSo then, how are we supposed to find it?\nDhurke:\nThat, I do not know, either. We'll just have to go through each candidate one by one.\nApollo:\nGreat plan of attack there, Dhurke. Well, Ema, do you mind if we give this room a once-over?\nEma:\n...I guess not. But in exchange, you're going to help me in my investigation.\nApollo:\nSure. It can't hurt.\nTrucy:\nOoh, I can't wait to get started! It'll be like hunting for buried treasure!\nExamine\nBody outline or pile of books\nApollo:\nSo this is where Dr. Buff died.\nEma:\nPoor man... He fell right on his head, and probably died almost instantly.\nApollo:\nI see some blood on the book there, but what's that dark stain?\nEma:\nIt appears to be coffee. It's still damp, so it must have gotten on there recently, perhaps even last night.\nDhurke:\nThat's a mighty big window he's next to -- big enough for someone to see inside.\nEma:\nExactly. That's how the local resident who reported his death found him to begin with. The doctor's body was visible from outside the window. And a passerby called in earlier this morning to report what they'd found.\nApollo:\nSo you mean this case is still only a few hours old?\nDhurke:\nThat explains why your investigation is just getting underway.\nStudy Photo added to the Court Record.\nStudy Diagram added to the Court Record.\nBody outline or pile of books (subsequent times)\nApollo:\nSo this is where Dr. Buff died.\nDhurke:\nYeah, the police received a call this morning... ...so their investigation is still just getting started.\nGlasses\nApollo:\nThere's a pair of glasses on this little pyramid here.\nEma:\nThey belonged to the doctor. Scientifically speaking, they appear to be your ordinary run-of-the-mill glasses.\nTrucy:\nI guess they don't pique her interest, scientifically speaking.\nComputer\nApollo:\nThis PC is password protected. Trucy, you think your magic can do something about this?\nTrucy:\nHmm... I don't think it can override a password. Now, a locked desk... That I can get into. Like yours back at the office, Polly!\nApollo:\n(Yikes... I'd better watch what I put in there.)\nTrucy:\nWhat? Do you put weird stuff in your desk? Stuff you don't want anyone to see?\nApollo:\nJeez, are you a mind reader, too?\nTrucy:\nNo, but unlocking your thoughts is a cinch!\nLadder or bookshelves\nApollo:\nThe doctor fell from the top of that ladder.\nDhurke:\nHmm... From that height, a fall onto a hard surface would probably kill anyone.\nApollo:\nI don't know why anyone would want to climb that high in the first place.\nTrucy:\nGuess you can say he climbed it all the way to heaven...\nRaincoat\nApollo:\nIt's a two-tone raincoat.\nDhurke:\nIt's still a bit damp. I think someone might've worn it recently.\nShoe shelves\nApollo:\nThere are a few pairs of shoes here. I guess there must be an entrance on this floor, too.\nEma:\nYeah, there's a backdoor over that way. But it's usually locked from what I can tell. The visitor's entrance is up that spiral staircase.\nApollo:\n(That's the way we came in.)\nGeoglyph\nApollo:\nThere are animal drawings on the floor. They look like those famous geoglyph things.\nDhurke:\nThey remind me of the chalk outlines detectives draw around bodies. And the doctor's has [sic] just joined them. Now that's what I call dedication to one's field.\nApollo:\nI don't think it was on purpose.\nWindow\nApollo:\nWhat a huge window. I bet you could see the entire study from the outside.\nDhurke:\nHow could he concentrate in here? I'd feel so exposed.\nApollo:\nWell... He does have a bookshelf positioned for some privacy around his desk.\nMechanical statue\nDhurke:\nThere's some sort of machinery inside this clay figure.\nApollo:\nWhoa, it's moving!\nEX-TER-MI-NATE. EX-TER-MI-NATE. DES-TROY ALL TAR-GETS. EX-T-T-TERRRrrr... *scrape* *grind*\nApollo:\nD-Do I even want to know what that thing is for?!\nNotebook\nApollo:\nLook, it's one of the doctor's notebooks.\nDhurke:\nMaybe there's something about the orb in there. It's a photo of the treasure box! The one from Tehm'pul Temple's treasure room. These must be his research notes on the Founder's Orb.\nApollo:\nWhat's that on the right page? It looks like a poem or something.\nDhurke:\nLet's see... Oh, it's the song that's performed during the Dance of Devotion. It's been sung during Khura'inese rites of offering since ancient times.\nApollo:\nOh, I think I've heard of that.\nDhurke:\nThere's also a legend associated with the song. Some say the solution to the orb's riddle is contained therein.\nApollo:\nIt's a song everyone in Khura'in knows? Not much of a way to keep it secret.\nTrucy:\nIt's called \"hiding secrets in plain sight,\" Polly. Us magicians know all about that.\nDhurke:\nHuh. That's strange.\nApollo:\nWhat is?\nDhurke:\nDr. Buff's notes contain the second half of the song. Only the first half is sung during the Dance of Devotion. Most people haven't even heard the second half.\nApollo:\nThe second half? As in the part that begins, \"Offer thy prayers\"?\nDhurke:\nI'm impressed. That's some thorough research he was conducting.\nResearch Notes added to the Court Record.\nModel plane\nApollo:\nIs this a bird?\nDhurke:\nIt looks like an airplane to me.\nApollo:\nNo, there couldn't have been any planes back when this was made.\nDhurke:\nYes, but it has wings and both horizontal and vertical stabilizers. That makes it an airplane.\nApollo:\nNo, it's definitely a bird.\nDhurke:\nOpen your eyes, son... As a lawyer, your job is to see the true nature of things.\nApollo:\n(I still say it's a bird.)\nMisty Fey scroll\nApollo:\nThere's a brown stain on this scroll. Hm? Why does it smell like... gravy?\nDhurke:\nWhy would there be a gravy stain on it?\nApollo:\nWho knows? But it looks like it's meant to be there.\nDhurke:\nMaybe the artist was trying to inspire a \"gravy\" new trend: food splatter art.\nApollo:\nThat pun wounded me \"gravy-ly,\" Dhurke.\nCoffee machine\nApollo:\nA coffeemaker and a bunch of coffee cups... He must've taken his coffee breaks here. Oh, and there's a filter with old coffee grounds in here. *sigh* Guess I'd better clean this up.\nDhurke:\nWhat are you doing there, son?\nApollo:\nAh! (What AM I doing, cleaning this office?!)\nDhurke:\nDon't tell me they have you on coffee duty back at your office.\nApollo:\nN-No, no... It's just, if I don't keep the place clean, no one will.\nAmi Fey statue\nApollo:\nIt's a golden statue. Looks pretty old, too.\nDhurke:\nHmm... I imagine it has great archeological value... Maybe too great for a private researcher of Dr. Buff's caliber.\nApollo:\nI wonder how he got his hands on something like this.\nSacred Urn\nApollo:\n\"Ami\"... Hmm... Why's someone's name written on here?\nTrucy:\nMaybe it's so if it ever got lost, someone could return it to its owner. You know, like how school kids put their names on things.\nApollo:\nYeah, but this is just an urn. And the name is written so big.\nTrucy:\nWell, I wrote my name on my magic panties. It says W-R-I-G-H-T in super big letters!\nApollo:\n(The less said about this, the better.)\nSpiral staircase\nApollo:\nIt's a spiral staircase... And it's connected to a hallway up there. Why'd they have to place the second floor so high up?\nEma:\nWait... You're not afraid of heights, are you?\nApollo:\nOh, um... Well...\nTrucy:\nOh, Polly's hilarious around high places. He gets all wobbly, like a baby deer taking its first steps. And his face turns as green as a watermelon.\nApollo:\nIt's not nice to make fun of people's phobias, you know.\nDhurke:\nCome to think of it, the visitor's entrance is on the second floor. What an odd layout for a house...\nWall relief\nApollo:\nWhat a huge wall relief. Hmm... It seems to depict a spirit channeling.\nDhurke:\nHey... this spirit medium looks like the Holy Mother of Khura'in.\nApollo:\nYeah, her face was left blank, but the rest is clearly detailed and well-crafted.\nDhurke:\nDid you know some researchers claim that the Holy Mother had three eyes? And that her third eye was able to divine the truth, just like the gods above. It is said to be on her forehead.\nApollo:\nLike you said, you shouldn't believe everything you hear.\nSuitcase\nApollo:\nThat's one big suitcase.\nDhurke:\nIt's locked. Is it the doctor's?\nEma:\nNo, someone left it here last night.\nApollo:\nSo the doctor might've had a visitor? But how can you tell?\nEma:\nThat sticker there. You only see those on airport luggage. Which means, its owner is likely from overseas.\nDhurke:\nIs there any way to figure out who it belongs to?\nApollo:\nNot unless we can open it to see what's inside.\nDhurke:\nGuess not...\n???:\nHeh heh heh. Ah-ha ha ha!\nEma:\nThat's because you're not me: Ema Skye, forensics expert extraordinaire! Try as you might, you won't find the word \"impossible\" in my forensics handbook!\nDhurke:\nI-Is she okay, son? It's like she became an entirely different person.\nApollo:\nOh, that's just what happens when her forensics switch gets flipped.\nEma:\nWith this, identifying the suitcase's owner will be easy as pie!\nApollo:\nIs that fingerprint powder?\nEma:\nThat's right. And there's no better time than the present to use it! Here we go! You remember how to do this, right?\nApollo:\nI apply the powder to where I think some prints might be, and blow any excess off?\nEma:\nExactly. Well, have at it!\nApollo:\n(Hmm... Now where would I expect to find prints on a suitcase?)\nExamine any fingerprint on stickers closest to keyhole\nLeads to:\n\"Hey Ema, I've got a pretty clear print here.\"\nExamine any fingerprint on handle\nEma:\nThis one isn't clear enough for a match.\nApollo:\nHmm... Where else could someone leave prints behind?\nDhurke:\nThink, son. How might someone handle a suitcase? Start by considering what you do with them.\nApollo:\nWell, besides being wheeled or carried, they can be opened and closed. So, I should look for prints that would be left at those times.\nExamine any incomplete fingerprint\nEma:\nYou'll need to use more powder than that to get a clear print.\nExamine excess powder\nEma:\nThere's still too much powder left. Try blowing some more off.\nApollo:\nHey Ema, I've got a pretty clear print here.\nEma:\nOkay, now let me know who you think it could belong to.\nApollo:\n(Hmm, who could it be? It would have to be someone who would've paid Dr. Buff a visit.)\nCompare Datz Are'bal profile\nAnalyzing...Analysis CompleteMatch Found\nLeads to:\n\"We have a match!\"\nCompare anyone else\nAnalyzing...No Match Found\nEma:\nWe didn't get a match.\nTrucy:\nAny other ideas, Apollo?\nApollo:\nHmm... Well, we can probably assume the print belongs to the suitcase's owner. (But who could that be? It would have to be someone who would've visited the doctor.)\nLeads back to profile selection\nEma:\nWe have a match!\nApollo:\nDatz... Come to think of it, he did stop by to see the doctor, didn't he? To conclude the orb transfer agreement.\nDhurke:\nSo he's the one who forgot his suitcase here.\nApollo:\nWhere do you suppose he is now?\nDhurke:\nHaven't heard from him in a while, and he's not answering his phone.\nTrucy:\nWait, you don't think he left his phone inside his suitcase, do you?\nDhurke:\nI wouldn't put it past that knucklehead.\nEma:\nActually, I think we may have run into him earlier.\nApollo:\nReally?\nEma:\nA suspicious man had been reported in the area, but when one of my officers approached to question him, he took off like a shot.\nApollo:\nWhat?!\nDhurke:\nSorry about that. Khura'inese people aren't all like him... I swear.\nEma:\nWell, he's probably still in the village somewhere.\nApollo:\nMaybe he knows something about the orb.\nSuitcase (subsequent times)\nApollo:\nSo this suitcase belongs to Datz.\nDhurke:\nHow could he leave something so big behind?\nApollo:\nBecause, you know... it's Datz.\nTalk\nDhurke\nApollo:\nOh, right, I haven't introduced you yet. This is Dhurke. He's from the Kingdom of Khura'in.\nEma:\nAll the way from Khura'in, huh? So, what do you do there?\nDhurke:\nI used to practice law, but I'm taking a break from all that. I'm focused now on making Khura'in a better place through... volunteer work.\nEma:\nVolunteer work, huh? How interesting...\nApollo:\n(...Well, it's not technically a lie.)\nEma:\nSo, how do you two know each other?\nApollo:\nOh, um... He's sorta my foster father.\nEma:\nCome again?\nTrucy:\nYeah! And he's Prosecutor Sahdmadhi's real father, too!\nEma:\nWhaaat?! You mean you... and Prosecutor Sahdmadhi... ............I'm so sorry. It seems you've had quite a life.\nApollo:\n(...Guess she's put a few things together.)\nEma:\nActually, Dhurke, you look kind of... familiar. Have we met before?\nDhurke:\nUm, not that I recall.\nApollo:\n(Great... She must've seen that news report on TV. It will really complicate things if she figures out he's a wanted man.) There are lots of guys who look like him. Sure you're not mistaking him for someone else?\nEma:\nAre there, really? I mean, a middle-aged man with long hair and an eye patch? You don't see that every day.\nApollo:\nW-Well, I'm sure you're just imagining things.\nPresent\nStudy Photo\nEma:\nMaybe it was Dr. Buff's wish to die under a pile of his beloved books. I know I could die happily under a big pile of forensic equipment.\nApollo:\nWell, I'll pass on dying under a big pile of evidence from my past cases. It's all murder weapons and photos of dead bodies.\nEma:\nSo, what? Are you saying you don't love your job?\nApollo:\nBeing buried in the tools of one's trade is hardly a valid way to assess dedication, Ema.\nAfter examining body outline or pile of books, ladder or bookshelves, notebook, Sacred Urn, spiral staircase, and suitcase:\nDhurke:\nIt seems the orb isn't here.\nApollo:\nThat means Datz might be our only lead at this point.\nDhurke:\nDetective Skye said he might still be here in the village. We should try to find him.\nMay 16Kurain Village\n???:\nGood day to you, citizens of Kurain Village! My name is Paul Atishon, and I want your vote!\nApollo:\nWow, that's REALLY loud.\nTrucy:\nLook, something's coming this way.\n???:\nPaul Atishon, savior of Kurain, has come to-- Ahhh! It's you people!\nDhurke:\nApollo? What is that strange conveyance coming this way?\nStaff:\nRight, left, right, left, HALT!\nApollo:\n(It's one of those... what-do-you-call-'ems? Palanquins...?)\n???:\nSo, you finally left Dr. Buff's house! What were you doing there?! ...What a bunch of shady-looking characters.\nApollo:\n(And you aren't?) So I take it you knew the doctor?\n???:\nHeh, what a foolish question. I've memorized the names and faces of the entire electorate here in Kurain. After all, I am the man who's destined to be king of this fine nation someday.\nApollo:\nUm... who are you? (And what do you mean, \"king\"?)\nAtishon:\nIgnorant fools. I am THE Paul Atishon. I am a soon-to-be eminent politician -- a man whose name will go down in history. You should be ashamed that you've never heard of me before.\nDhurke:\nIs he really that famous of a politician, Apollo?\nApollo:\nNot that I know of.\nAtishon:\nI'm running for a seat on the local council right now.\nApollo:\n(I guess even Jerk Q. Public has to start somewhere.)\nAtishon:\nBut my election is a sure thing, I'm told. After all, my grandfather was a famous politician with untold influence. In short, I'm the chosen one, the golden boy, the powerhouse of politics!\nTrucy:\n...And rider-of-his-grandfather's-coattails.\nAtishon:\nHeh heh heh. Are you blinded by my majesty? Go ahead! Bask in the resplendent glory that is me, the chosen one!\nApollo:\nUm... Sure...\nAtishon:\n...Ah!\nA pleasant day to you, good people of Kurain! I am Paul Atishon! It's time to reclaim the glory of Kurain, together! A convenience store on every corner, a karaoke bar in every home! A vote for Paul Atishon is a vote for a happier, hopey-er Kurain Village!\nOld Man:\nTurn off that infernal racket, you fool! You're a stain on your grandfather's good name!\nAtishon:\nThank you, good sir! Your support is appreciated, as always!\nTrucy:\nI guess he's one of those people who only hears what they want to hear.\nApollo:\n...In other words, he's a model politician.\nAtishon:\nNow where was I? Oh right, you were in the doctor's house. Just what in the world were you doing in there? Hmm?\nTalk\nPaul Atishon\nApollo:\nIs this what you ride around in when you're campaigning?\nAtishon:\nThat's right. It's perfect for the narrow roads and steep hills here in this village. It has a top speed of five miles per hour, but it suffers from serious reliability issues. (Changed from [It has a top speed of 5 miles per hour, but it suffers from serious reliability issues.] in the original release) Namely, these imbeciles tire out too quickly.\nStaff:\n*cough* *huff, puff* We'll try harder next time, sir!\nApollo:\n(Poor guys... They're exhausted and covered in sweat.)\nAtishon:\nThe Atishon family has been in politics for generations, even back in the old country.\nApollo:\nReally?\nAtishon:\nMy grandfather, Abe Atishon, was a prominent member of Congress. And he was born right here in Kurain. There isn't a person here who hasn't heard of him.\nApollo:\n(All I asked about was his palanquin.)\nAtishon:\nYou must've heard of the Atishons. I'm even reviving our old country campaigning style.\nApollo:\n...Oh, um... politics aren't really my thing. Trucy?\nTrucy:\nI don't recall ever reading about them at school.\nAtishon:\nFeh... Young people today. You people really need to pay more attention to politics.\nThe doctor's house\nAtishon:\nSo, what business did you people have at Dr. Buff's house?\nApollo:\nHe was going to transfer ownership of the Founder's Orb to us. It's a sacred relic from the Kingdom of Khura'in.\nAtishon:\nThe Founder's Orb? So you tried to get your hands on it, did you?\nApollo:\nWait, what do you know about the orb?\nAtishon:\nHeh. I know that it's mine, that's what.\nApollo:\nHow do you figure that?\nAtishon:\nBecause I know it's not the Founder's Orb. Its real name is the Crystal of Ami Fey.\nApollo:\nThe Crystal of Ami Fey?\nAtishon:\nThat's right. It's been passed down for generations in the Atishon family. Until it was stolen, that is. But just when I had zeroed in on the culprit... ...the doctor hid it away and then kicked the bucket.\nApollo:\nSo you're saying Dr. Buff stole your family heirloom? (That's not what Dhurke said. Strange...) But I've been told the doctor himself said that... ...he had the \"Founder's Orb.\"\nAtishon:\nIt's all that weird foreigner's doing! He filled the doctor's head with nonsense! Nonsense like the Crystal of Ami Fey being the Founder's Orb.\nApollo:\n\"Weird foreigner\"? (Could he mean...?) Is this the foreigner you're talking about?\nPresent Datz Are'bal profile\nApollo:\nAtishon:\nYes, that's him!\nApollo:\nI thought so. (Now we really have to find Datz.)\nLeads back to Talk options\nPresent anyone else\nApollo:\nAtishon:\nWho's that? Wait, I know everyone around here, so this must be a new eligible voter for me!\nApollo:\nYes, wouldn't that be nice. (Because I certainly wouldn't vote for you. It seems this isn't the person he's talking about. But I can't imagine the doctor had contact with that many foreigners way out here.)\nLeads back to Talk options\nDatz (appears after presenting Datz Are'bal profile upon selecting \"The doctor's house\" Talk option)\nDhurke:\nDo you know where this man is now?\nAtishon:\nI imagine he's at the Detention Center by now. I called the authorities after I found him hiding in my dog's doghouse.\nApollo:\nWhaaat?!\nDhurke:\nThat buffoon...\nApollo:\nWell, at least we know where he is now.\nDhurke:\nLet's head over to the Detention Center and see what he knows about the Founder's Orb.\nAtishon:\nSo, you really are after my crystal.\nApollo:\nNo, we're looking for the Founder's Orb, and we have an agreement to prove it.\nAtishon:\nWell, just so you know, you're not going to lay a finger on it. It's mine. And I intend to give it to my benefactor.\nApollo:\nYour... benefactor?\nYour benefactor (appears after \"Datz\")\nAthison:\nMy benefactor is ready to support my rise to the pinnacle of the political world. They have immense influence here, you see, and I intend to harness that influence.\nApollo:\nSo you're just going to give your family heirloom away to this person?\nAtishon:\nThat's right. It's a purely political decision.\nApollo:\nAnd in exchange, your patron will get the people of Kurain to vote for you?\nAtishon:\nHeh heh heh. Eminent politicians are skilled at leveraging all of their connections.\nApollo:\n......... (Isn't it illegal to buy votes?) Well, good luck with that, I guess.\nAtishon:\nHeh, you just wait. Paul Atishon will reign supreme someday.\nPresent\nAttorney's Badge\nApollo:\nActually, I'm a lawyer.\nAtishon:\nHeh heh heh. You're so shallow. Relying on your badge to impress people... What would you be without it? I petty men like you have no sense of self. Real men make their own mark in this world.\nApollo:\n(Says the man who's riding on his grandfather's coattails.)\nAnything else\nApollo:\nWhat do you think about this?\nAtishon:\nPaul Atishon is the \"squeaky-clean candidate.\" So if you're going to bribe me, try to be a little more subtle about it, would you?\nApollo:\nHuh? I wasn't trying to bribe you.\nAtishon:\n\"Don't accept any bribes unless they come in unmarked bills.\" This is but a fraction of the political wisdom my grandfather shared with me. Better luck next time.\nApollo:\n(After a spin cycle or two with those bills, I bet I'D be \"squeaky-clean,\" too.)\nWright Anything Agency (after examining body outline or pile of books, ladder or bookshelves, notebook, Sacred Urn, spiral staircase, and suitcase in Kurain Village - Doctor's Study, then visiting Kurain Village)\nTalk\nAny ideas?\nDhurke:\nAbout that Paul Atishon fellow... He's aiming to be a councilman and beyond, as his famous grandfather once was, right? No doubt some would vote for him on the merits of his grandfather's achievements. I see a grim future for Kurain Village if someone like that is able to climb the ranks.\nApollo:\nI wouldn't worry about it. Who in their right mind would vote for him with the way he's campaigning?\nDhurke:\nSo the more aggressively he campaigns, the less people will want to vote for him? That makes me want to get out there and help him fail.\nWhat to do\nApollo:\nWe turned the doctor's study upside down, but never found the orb.\nDhurke:\nYeah, I didn't expect this to be so hard.\nTrucy:\nWell, I think it's fun. It's like a big old treasure hunt!\nDhurke:\nThat orb is the key to Khura'in's future, you know.\nTrucy:\nYeah, and our office's future, too!\nApollo:\n(She does realize it's not up for sale, right?)\nPresent\nAnything else\nDhurke:\nAh, the old show-'em-and-see-what-they-say tactic. I used to try that whenever I had nothing else to say.\nApollo:\nWho says I have nothing else to say?\nDhurke:\nIt's written all over your face.\nApollo:\nLike you have anything to add right now.\nAfter clearing all Talk options with Paul Atishon in Kurain Village:\nMay 16Detention Center - Visitor's Room\nDatz:\n.........\nDhurke:\n.........Hey.\nDatz:\nYipes!\nApollo:\nWhat's he doing under the desk...?\nDatz:\nFoul cogs of the corrupt regime! I've nothing to say to you!\nDhurke:\nDatz, it's me, Dhurke.\nDatz:\nOh! Dhurke! You're a sight for sore eyes! I knew you'd come save me!\nDhurke:\nWell, this is another fine mess you've gotten yourself into.\nDatz:\nHar har har har har! My bad, my bad! 'Least the grub here's pretty good compared to that prison back home! Ya get three squares plus a place to sleep! Why don't ya join me, Dhurke?!\nDhurke:\nNo thanks. They'd just send me back to Khura'in where I'd face immediate execution.\nDatz:\nYeah, I guess that wouldn't be such a good idea.\nApollo:\n(Looks like he's still the same, too.) ...Long time no see, Datz.\nDatz:\nHuh? Hey, ya look... kinda familiar... A-A-A-Apollo?! Is it really you, m'boy?! A-to-the-J, all grown up and whatnot! How've ya been?!\nApollo:\nFine. And you, Datz? You look good, besides the incarceration and all.\nDatz:\n...Pffffff! Haaaaar har har har har! Those horns, AJ!\nApollo:\nHorns?\nDatz:\nThey've grown up with ya, just like a stag's antlers! I can't take it!\nApollo:\n*sigh* You really haven't changed a bit. Anyway, there's something we needed to talk to you about.\nDatz:\nSure, pull up a chair. I've got all the time in the world. The slammer's like my second home. It's really not so bad once ya get used to it.\nTrucy:\nHe's rather laid back for someone in police custody.\nTalk\nAbout the orb\nApollo:\nDatz, was what the doctor had really the Founder's Orb?\nDatz:\nAbsolutely positively! The doc was sure of it!\nDhurke:\nReally? Because someone from the village is calling the Crystal of Ami Fey. He also claims you were filling the doctor's head with lies.\nDatz:\nThat ain't true! The doc said he was sure it was the real deal. All his fancy research confirmed it was the Founder's Orb.\nApollo:\nSo then that Paul Atishon character was lying? Imagine that, a politician who lies...\nDatz:\nI bet he wants the orb all to himself!\nTrucy:\nHmm... I wonder who's telling the truth?\nDatz:\nWell, take a look at this! It proves the doc believed he had the Founder's Orb!\nDhurke:\nLet me see that. \"I agree to hand over the Founder's Orb to the Defiant Dragons... ...if I will come to no harm.\" Signed, Dr. Archie Buff.\nDatz:\nSee, I got it all down in writing!\nDhurke:\nBut Datz... ...why does it say, \"if I will come to no harm\" at the end here?\nTrucy:\nSounds like he was scared of you.\nApollo:\nDatz, did you threaten the doctor in any way?\nDatz:\nNo, ya got it all wrong! It was the doc's friend! HE told the old man us rebels were dangerous. It's his fault the doc thought I might hurt him!\nApollo:\nSounds like the work of that politician. He's really made a mess of things.\nOrb Transfer Agreement added to the Court Record.\nAbout the orb (subsequent times)\nApollo:\nDatz, was what the doctor had really the Founder's Orb?\nDatz:\nAbsolutely positively! The doc was sure of it!\nDhurke:\nReally? Because someone from the village is calling the Crystal of Ami Fey. He also claims you were filling the doctor's head with lies.\nDatz:\nThat ain't true! The doc said he was sure it was the real deal. All his fancy research confirmed it was the Founder's Orb.\nApollo:\nSo then that Paul Atishon character was lying? Imagine that, a politician who lies...\nDatz:\nI bet he wants the orb all to himself!\nTrucy:\nHmm... I wonder who's telling the truth?\nDatz:\nWell, take a look at this! It proves the doc believed he had the Founder's Orb!\nDhurke:\nLet me see that. \"I agree to hand over the Founder's Orb to the Defiant Dragons... ...if I will come to no harm.\" Signed, Dr. Archie Buff.\nDatz:\nSee, I got it all down in writing!\nDhurke:\nBut Datz... ...why does it say, \"if I will come to no harm\" at the end here?\nTrucy:\nSounds like he was scared of you.\nApollo:\nDatz, did you threaten the doctor in any way?\nDatz:\nNo, ya got it all wrong! It was the doc's friend! HE told the old man us rebels were dangerous. It's his fault the doc thought I might hurt him!\nApollo:\nSounds like the work of that politician. He's really made a mess of things.\nReason for arrest\nDhurke:\nWhat have you done now, Datz?\nDatz:\nNothing! I'm innocent, I tell ya! It all started when this dog-faced cop tried to question me! He looked so funny, I started laughing at him. That's when they came after me. But it was hilarious, I tell ya! I mean, a human police dog? How funny is that!\nApollo:\nRight... So what happened after that?\nDatz:\nThey caught me hiding in a doghouse. Dang pooch ratted me out! I guess that's what I get for laughing at one of his doggy comrades.\nApollo:\nSounds like the dogs got the last laugh.\nDhurke:\nDatz, weren't you cleared of those jailbreak charges? And your capture by Lady Kee'ra deemed unlawful?\nDatz:\nYeah, but... The cops here don't seem to like me anyway.\nApollo:\nWhat are the charges this time?\nDatz:\nUnauthorized entry, or something like that. They think I'm an illegal alien! And I can't prove otherwise 'cause I lost my passport!\nTrucy:\nIs there any way they'd let you go?\nDatz:\nNot without my passport... If only I had it! Dhurke, AJ! You gotta find my passport!\nApollo:\n...All right, we'll find it. (One more thing to add to our to-do list. Now, where might Datz's passport be?)\nExamine\nSecurity camera\nApollo:\nI hate the feeling of being constantly watched.\nDhurke:\nIndeed. Considering my current situation, the less I'm seen, the better.\nApollo:\nWell, it's not like there's an international arrest warrant out for you.\nDhurke:\nTrue, but I seem to have made quite an international splash with that hijacking stunt. I had to sign a ton of autographs and take a load of selfies before I got to your office.\nApollo:\nWait, what?\nDhurke:\nMaybe they thought the hijacking was part of some movie's promotion.\nGuard\nApollo:\nHe's completely uninterested in us.\nDhurke:\nThat suits me fine. It will only complicate things if I'm recognized.\nApollo:\nRight... You're known as some sort of scary terrorist who fled from Khura'in. Though, in reality, no one would believe you're the real Dhurke of legend anyway.\nMicrophone\nApollo:\nDhurke, why are you holding that mic?\nDhurke:\nI get this strange urge to speak whenever there's a microphone before me. We, the Defiant Dragons, shall--!\nApollo:\nNo, stop! Stop...!!!\nPresent\nAttorney's Badge\nDatz:\nWhy, AJ! You've become a fine lawyer in your own right!\nApollo:\nNah, I still have a lot to learn.\nDatz:\nAw, c'mon, don't be so hard on yourself. If I ever went to trial, I'd definitely want you on my side!\nApollo:\nKnowing you, you'd probably skip town before the trial even started.\nFounder's Orb or Orb Transfer Agreement\nDatz:\nThe doc agreed in writing to hand the orb over to me, but he kept stalling, like he didn't trust me or something.\nDhurke:\nThat scary mug of yours no doubt frightened him.\nDatz:\nLook who's talking!\nTrucy:\nHonestly, I think you're both about equally scary looking.\nApollo:\n(Ouch... Both Dhurke and Datz look like they've been stabbed right in the ego.)\nAnything else\nDatz:\nOh, is that for me!?\nApollo:\nNo, I was just showing it to you.\nDatz:\nAnything I could use here in the slammer is more than welcome!\nApollo:\nUm, Datz, the guard is giving you some serious side eye.\nAfter clearing all Talk options:\nDatz:\nOh! About the orb's whereabouts... Maybe the doc's kid knows something!\nApollo:\nThe doctor has a kid?\nDatz:\nYeah... A bit of a shut-in, though. The poor thing's own bedroom has become like a self-imposed prison.\nApollo:\nA shut-in? Sounds like it will be a challenge just to get a conversation going.\nGuard:\nTime for your questioning. Follow me.\nDatz:\nIt must be lunchtime. Today is fried chicken, if I'm not mistaken!\nGuard:\nYou'll get your lunch IF you behave yourself.\nDatz:\nDhurke, AJ. I'll see ya guys around!\nDhurke:\nOur only lead now is Dr. Buff's kid. But luring a shut-in out is...\nApollo:\n...Not going to be easy. I know.\nMay 16Kurain Village - Doctor's Study\n???:\nOh, it's you again.\nEma\nLooking for Mr. Wright? He was just here a second ago.\nApollo:\nHe was?!\nTrucy:\nWhat was Daddy doing here?\nApollo:\nGood question.\nEma:\nHe said he was looking for something.\nApollo:\nDid he say anything else?\nEma:\nLet me think... Something about how his ride never showed up at the airport. Yes, that was it.\nApollo:\n(I guess Athena really did get lost...)\nTrucy:\nBut what's Daddy doing all the way out here in the first place? He can't be looking for us since no one told him we'd be here.\nApollo:\nHmm...\nEma:\nWell, if you're here to take another look around, be my guest. I have other work to do, so if you'll excuse me.\nApollo:\nOf course. Thanks, Ema.\nDhurke:\nFirst and foremost, we'd better find Datz's passport. We should also have a word with Dr. Buff's child.\nTrucy:\nHey, is it just me... or is there something new in here?\nDhurke:\n...Oh, you mean that thing? Yeah, we should take a closer look at it, too.\nApollo:\nLet's not forget about Datz's passport. It should be around here somewhere.\nExamine\nSuitcase\nApollo:\nDatz's suitcase... Maybe his passport's in there.\nTrucy:\nAnnggh! It's no good. It's locked tight.\nApollo:\nWe should've asked him for the key.\nDrone\nApollo:\nWhat's this? A model helicopter?\nTrucy:\nDon't you know anything, Apollo? It's a drone! They're all the rage right now. I bet it belongs to the doctor's kid.\nDhurke:\nWe need to ask them about the orb's whereabouts.\nApollo:\nYeah, but luring out a shut-in isn't going to be easy.\nAny other point of interest\nApollo:\nNothing new here. Let's go look somewhere else.\nAfter examining suitcase and drone:\nApollo:\nWhat are we going to do about Datz's passport? It's probably right there inside his suitcase, but we can't get it open.\nTrucy:\nWhy don't I take it over to Datz so he can unlock it? That way, you guys can continue looking for the orb.\nApollo:\nGood thinking, Trucy!\nTrucy:\nOkay, here I go! ...Huh? What the...? Hrrgh...! This thing weighs a ton!\nApollo:\nLet me try. ............Jeez, how can a suitcase be so heavy? Is it filled with bricks or something?\nDhurke:\nKnowing Datz, he probably packed his dumbbells in there. It's certainly much too heavy to lug all the way to the detention center. Here, let me take a crack at that lock.\nApollo:\nWhat, are you going to pick it?\n*click* *click, click* *click* *click*\nDhurke:\nThere you go.\nApollo:\nThat was fast.\nDhurke:\nHah-ha ha ha ha! A lock like that is child's play to me. Especially after all the wrongly imprisoned compatriots I've busted out over the years.\nApollo:\nYou've sure seen a lot of action for an ex-lawyer.\nDhurke:\nAaand here we go. Datz's passport.\nTrucy:\nI'll take it over to him.\nApollo:\nThanks, Trucy.\nTrucy:\nNo problem! Now you guys enjoy some quality father-son treasure hunting time, okay? See you later!\nApollo:\n(There she goes. I wish she wouldn't make such a big deal out of our little \"family\" situation.)\nDhurke:\nFather-son time, eh? Hmm... Been ages since we've had a father-son talk, huh, son?\nApollo:\nYeah, well over a decade.\nDhurke:\nSo, Apollo, um... how've you been?\nApollo:\nOh, uh... Fine. I'm fine, I guess.\nDhurke:\nIs that so? Fine, you say? Well, fine is fine by me! Good to hear!\nApollo:\n...Um, okay. ..................\nDhurke:\n...........................\nApollo:\n............ (Umm... So what do we talk about now...?)\nDhurke:\n...Hm? Get down! Hit the dirt, son!\nApollo:\nHuh? What the--? AAAAAAAAAAAAAAAAAAAAAAAAAAAAAH! .........Unngh......Oof... .........\nDhurke:\nSpeak to me, son! Say something!\nApollo:\n......Ooh... Th-that smarts...\n???:\nYouuuu maggots! Whattaya think yer doin', invading Buff airspace?! It'll be a scorching day in Siberia before you get past me, ya yellow-bellied yahoos!\nApollo:\nWhoa! ...It can talk?! What kind of drone is this, anyw... ...AAAAAAAAAAAAAAAAAAAAAAAYYYYYY!\n???:\nDrone, nothin'! That's Sergeant Buff to you, soldier! You got that, you lowly grunts?!\nApollo:\nOww... What the who now...?!\nDhurke:\nBuff? Sounds like the doctor's son is behind the controls.\nApollo:\nHe's controlling this thing?\nDhurke:\nApollo, let's play along for now. At least until we can get the information we need out of him.\nApollo:\nG-Got it. Um... Sergeant Buff?\nSarge:\nSergeant Buff, sir! You forgot to say, \"sir\"! Ain't you never seen a war movie before?!\nApollo:\nOh, right. Let me try that again. Sergeant Buff, sir!\nSarge:\nBetter. Much better. Now, state your name, unit, and rank, soldier!\nApollo:\nOh, um, I'm Apollo Justice. I serve at the Wright Anything Agency. And my rank is, um... fledgling lawyer? ...Sir!\nSarge:\nAffirmative, Private Justice.\nApollo:\nP-Private?\nSarge:\nListen up, diaper baby! Your commanding officer's orders are absolute! Disobedience means a one-way trip to the firing squad! Do I make myself clear?!\nApollo:\nOh, um... sir! Yes, sir!\nSarge:\nGood, good, we might make a man out of you yet, private! Now for you, Cyclops!\nDhurke:\nHuh? ...Oh, you want my name, unit, and rank, too? Um, I'm Dhurke Sahdmadhi. I command the rebel group the Defiant Dragons, and my rank is... um... leader, sir!\nSarge:\nExcellent! Welcome aboard, Komandir Dhurke! Wait a second! What's with that ridiculous mop you call a head? Soldiers should be clean cut!\nDhurke:\nS-Sorry, but this is my signature look. I'm not going to-- WHOOOOOOOOOA! Fine, fine! I'll get a haircut before we ship out!\nSarge:\nListen up, you! It's kill-or-be-killed out on that battlefield. No place for leave-in conditioners. All you've got is your life, and you're lucky to have that!\nApollo:\n(He's oddly obsessed with field survival for someone who never goes outdoors...)\nDhurke:\nThis is going to be harder than I thought, son.\nExamine\nAnything\nApollo:\nAAAAAAAAAAAAAAAAAAAAAAAAAAAAGH!\nSarge:\nDon't let me catch you stepping out of line again.\nApollo:\n(...Guess I'd better play along and ask what he wants.)\nTalk\nSergeant Buff\nApollo:\nUm, are you controlling that drone from your room, sir?\nSarge:\nAffirmative! But I can see everything you do from here, so... Teeen-HUT, soldier! Wipe that stupid look off your face! I'm going to whip you sheltered peaceniks into shape!\nApollo:\n(With what? Your \"charming\" personality?)\nDhurke:\nLook, it's got a camera and speakers, too.\nSarge:\nAnd that's not all, Komandir! With these arms, I can cook and clean, too! Speaking of which... Private Justice! You're on latrine duty! Snap to it, on the double!\nApollo:\n...*sigh*... As if I don't see enough of the toilet back at the office.\nSarge's Drone added to the Court Record.\nDhurke:\nThat thing's pretty handy. Us Defiant Dragons could use one of those.\nSarge:\nHa ha ha ha ha ha ha! Yes, it is a fine piece of hardware, isn't it? I modified it especially for siege defense!\nApollo:\nSiege defense...? You mean how you won't leave your room? AAAAAAAAAAAAAAAHHH!!!\nSarge:\nHoling up in a stronghold to defend against an enemy is an age-old military tactic! A timeless strategy still applicable in modern warfare! I hope you're not trying to mock the wisdom of my forefathers!\nApollo:\nI-I... I meant no offense. It was just an observation.\nSarge:\nSo the greenhorn who ain't even discharged a firearm's got something to say, does he?!\nApollo:\nS-Sorry, sorry! It won't happen again, sir!\nSarge:\nDarn tootin'. Now, state your intentions, soldier.\nSergeant Buff (subsequent times)\nApollo:\nUm, are you controlling that drone from your room, sir?\nSarge:\nAffirmative! But I can see everything you do from here, so... Teeen-HUT, soldier! Wipe that stupid look off your face! I'm going to whip you sheltered peaceniks into shape!\nApollo:\n(With what? Your \"charming\" personality?)\nDhurke:\nLook, it's got a camera and speakers, too.\nSarge:\nAnd that's not all, Komandir! With these arms, I can cook and clean, too! Speaking of which... Private Justice! You're on latrine duty! Snap to it, on the double!\nApollo:\n...*sigh*... As if I don't see enough of the toilet back at the office.\nDhurke:\nThat thing's pretty handy. Us Defiant Dragons could use one of those.\nSarge:\nHa ha ha ha ha ha ha! Yes, it is a fine piece of hardware, isn't it? I modified it especially for siege defense!\nApollo:\nSiege defense...? You mean how you won't leave your room? AAAAAAAAAAAAAAAHHH!!!\nSarge:\nHoling up in a stronghold to defend against an enemy is an age-old military tactic! A timeless strategy still applicable in modern warfare! I hope you're not trying to mock the wisdom of my forefathers!\nApollo:\nI-I... I meant no offense. It was just an observation.\nSarge:\nSo the greenhorn who ain't even discharged a firearm's got something to say, does he?!\nApollo:\nS-Sorry, sorry! It won't happen again, sir!\nSarge:\nDarn tootin'. Now, state your intentions, soldier.\nLocation of the orb (appears after \"Sergeant Buff\")\nApollo:\nWe had an agreement with your father. He had promised to hand over the Founder's Orb to us.\nSarge:\nWhat?! Papa promised you that?!\nDhurke:\nHe did. But he died before he could tell us where it's hidden. Now we have no idea where it is.\nSarge:\n.................. ...Oh. *sniffle*\nApollo:\nHm?\nSarge:\nP-Papa... Why...? Why'd you have to die?\nDhurke:\nIt was an unfortunate accident. And I'm sorry for your loss.\nApollo:\nIf it helps at all, I know how you feel, Sergeant Bu-- AAAAAAAAAAAAAAAAAAAAAAAAAAAAAH! What'd I do nowww?!\nSarge:\nY-You insignificant maggot! What would an unseasoned rookie like you know about how I feel?! First I lost Mama... and now I've lost Papa!\nApollo:\nYou lost your mother, too?\nSarge:\nShe's been gone for some time now. I'm... I'm all alone now. All alone... *sniffle*\nDhurke:\n...Sergeant Buff, would you tell us a little more about what happened to your mother?\nYour mother (appears after \"Location of the orb\")\nSarge:\nMama passed away about six months ago. We were still living in our apartment in the city. Back then, I had yet to engage in my siege defense strategy.\nApollo:\n(In other words, something caused him to withdraw from the world.)\nSarge:\n...It was arson. It happened so suddenly... and before we knew it, our apartment was a sea of flames. Mama and I were trapped inside. But help never came. So Mama cradled me in her arms... ...kicked out a window... and jumped!\nApollo:\nShe did what?!\nSarge:\nShe was like a walkin', talkin' medal of valor, my mama was. She delivered me safely to terra firma with a perfectly executed PLF. It's a five-point landing technique used by paratroopers to land safely on the ground.\nApollo:\n(She sounds like a superhero or something.)\nSarge:\nBut from that height, she suffered massive injuries in order to protect me. She... She died so that I could live! AHHHHHHHHHHHH! MAMAAAAAAAAAAAA!!!\nApollo:\nI... I don't know what to say...\nDhurke:\nAnd the person who started the fire?\nSarge:\nHe was immediately apprehended. They say he was standing outside laughing while the building burned.\nDhurke:\nAt least justice was served. I hope that brought you some solace.\nSarge:\nI've lost both my parents now. You can't possibly know how I feel! *sniffle* *sob* Mama... Papa...\nApollo:\n(Poor kid. It's hard losing both your parents at such a young age. He must really feel alone now.)\nDhurke:\nApollo... I imagine you know what he's going through.\nApollo:\nI do?\nDhurke:\nThe road to recovery begins by talking to someone who's suffered the same hardship. I know you have something that shows you understand.\nPresent\nAnything (before clearing \"Your mother\" Talk option)\nSarge:\nWhat insubordination!\nApollo:\nARRRRRRAGH!\nSarge:\nPetty trinkets have no place in Buff's army, soldier! Now drop and give me twenty!\nApollo:\n(Sheesh... At least let me show the evidence before you shoot it down...)\nPhoto of My Father (after clearing \"Your mother\" Talk option)\nLeads to:\n\"Um, sergeant, sir. Would you please take a look at this?\"\nApollo:\nUm, sergeant, sir. Would you please take a look at this?\nSarge:\nWhat do we have here?\nApollo:\nIt's a photo of my father. I wasn't even a year old when he died... in a fire.\nSarge:\nWhat?!\nDhurke:\nAnd like your mother, he died in an arsonist's blaze. But in his final moments, he managed to save his infant son.\nSarge:\nP-Private Justice, you've suffered a loss just like mine.\nApollo:\nI have... And that's why I know how you feel.\nSarge:\nB-But... you still have your mother, don't you?!\nApollo:\nNo, I lost her, too.\nSarge:\nWhat?!\nApollo:\nShe disappeared after the fire. I don't know if she's still alive or dead. Heck, I don't even know what she looks like.\nSarge:\nWow...\nDhurke:\nSergeant Buff, his experience is very much like your own. If anyone can understand the sadness in your heart, it's him.\nSarge:\nRrrr... Nnngh... .............................. ATTEEEEEENSHUN!!! I salute you, Comrade Justice! You are no longer a private in the Buff Army! Henceforth, you will be a corporal!\nApollo:\nCorporal?\nDhurke:\nCongratulations on your promotion, Corporal Justice!\nApollo:\n...I'm just glad that seemed to cheer him up a bit.\nSarge:\nNow, comrade, let's toast to your new stripes! And call me Sarge! Don't be shy! We're a band of brothers now! Ha ha ha ha ha ha ha!\nDhurke:\nNow's our chance, corporal! Ask him about the Founder's Orb.\nApollo:\n(Dhurke's getting waaaaay too much of a kick out of this.)\nExamine\nLadder or bookshelves\nApollo:\nSarge, sir, do you ever read these books?\nSarge:\nWhy, of course! Soldiers must have extensive knowledge, as well as fighting prowess. I'm learning all I can each and every day in preparation for the big battle!\nApollo:\nThe big battle?\nSarge:\nUm, you know... for when I go back to school. I'll need to be up to date on every subject. Stuff like... y'know, the latest comics and Hollywood gossip...\nApollo:\nOh, I see... (What about reading, writing and arithmetic?) Well, I'm rooting for you, Sarge!\nSarge:\nTh-Thanks. I'll try my best.\nComputer\nApollo:\nThis computer could provide some useful information. Drat. It's password protected. Dhurke, you're good at getting into places you're not supposed to.\nDhurke:\nDon't look at me. I don't know the first thing about computers.\nSarge:\nHa ha ha ha ha! Leave it to me! A modern day warrior must be well-versed in technology... and have a mean, mean pride! After all, he who controls information, controls the battlefield!\n*click clack click clack click clack*\nSarge:\nAaaaand I'm in!\nApollo:\nLooks like modern day warriors have mean, mean keyboard skills, too.\nDhurke:\nOkay, let's see what we can find.\n*click clack click clack click clack*\nDhurke:\nOh, what's this...? An e-mail message? Now this is interesting. It's a research report to whoever asked the doctor to study the orb.\nSarge:\nHere, I put the data on this! Take it and use it well, soldier!\nE-Mail added to the Court Record.\nComputer (subsequent times)\nApollo:\nThe doctor's computer. It contains an e-mail detailing the progress of his research.\nDhurke:\nI wonder who he prepared the report for.\nGlasses\nApollo:\nAre these the doctor's?\nSarge:\nYes, those are Papa's reading glasses. He said he'd been having trouble reading lately. But those glasses seemed to help.\nDhurke:\nReading glasses, eh? I'll just hold on to these.\nApollo:\n...Dhurke. Don't tell me you're having trouble reading, too?\nDhurke:\nPerish the thought! ...I-I just don't want to leave any stone unturned.\nDoctor's Reading Glasses added to the Court Record.\nRaincoat\nApollo:\nIt's a raincoat... Hm...? It's a bit wet, and there's fresh mud on it... That must mean someone wore it recently.\nDhurke:\nIndeed. Maybe even as recently as last night.\nApollo:\nSarge, did it rain here last night?\nSarge:\nNegative. There wasn't a cloud in the sky.\nApollo:\nHmm... Then how did this raincoat get all muddy and wet?\nSarge:\nWhen I saw it last evening, it looked pretty clean and dry to me.\nApollo:\nThat means it got like this later at night.\nDhurke:\nGood eye, son. This may very well turn out to be a vital clue.\nRaincoat added to the Court Record.\nRaincoat (subsquent times)\nApollo:\nIt's a raincoat... Hm...? It's a bit wet, and there's fresh mud on it... That must mean someone wore it recently.\nDhurke:\nIndeed. Maybe even as recently as last night.\nApollo:\nSarge, did it rain here last night?\nSarge:\nNegative. There wasn't a cloud in the sky.\nApollo:\nHmm... Then how did this raincoat get all muddy and wet?\nSarge:\nWhen I saw it last evening, it looked pretty clean and dry to me.\nApollo:\nThat means it got like this later at night.\nDhurke:\nGood eye, son. This may very well turn out to be a vital clue.\nStatue\nEX-TER-MI-NATE. EX-TER-MI-NATE. DES-TROY ALL HU-MANS.\nApollo:\nWhat's this thing's problem...?\nSarge:\nIt's an OOPArt -- an our-of-place artifact. Papa won it in an online auction.\nApollo:\nAn online auction?\nSarge:\nYes, he said it's an alien weapon that destroyed an entire ancient civilization.\nApollo:\n(...Where do I even start with an explanation like that?)\nSacred Urn\nApollo:\nThis urn with \"Ami\" painted on it looks really old. But I don't think it's going to provide any info we need.\nSpiral staircase\nApollo:\nIs your room upstairs, Sarge?\nSarge:\nYes, it's the one at the end of the hall.\nDhurke:\nWhat do you say you come out, so we can enjoy a snack together?\nSarge:\nB-But...\nDhurke:\nI promise we won't bite!\nSarge:\n...............If you insist... ...then I'm not going to talk to you anymore!\nDhurke:\nNo, wait!\nApollo:\nDhurke, you'd better apologize quick.\nDhurke:\n...I'm sorry for pushing.\nSarge:\nV-Very well. As long as you don't do it again, I'll let it slide this one time.\nSuitcase\nApollo:\nIt's Datz's suitcase. It's full of survival gear and questionable souvenirs. But we already got his passport, so we can leave it be for now.\nShoe shelves\nApollo:\nIt's a shoe cubby. Hmm, these shoes look like they belong to Sarge and his dad. ...Ah, these boots here are a little damp!\nDhurke:\nAnd it looks like there's something inside this one.\nApollo:\nMaybe Doctor Buff wore them last night.\nDhurke:\nThey might lead us to where he hid the orb. Let's take a closer look.\nExamine outsole\nApollo:\nThere's a question mark on the bottom of this boot.\nSarge:\nPapa had those custom-made for his archeological fieldwork. He had the soul of an adventurer.\nDhurke:\nThis boot had the \"sole\" of an adventurer, too.\nExamine residue on insole (before examining hook-and-loop fastener straps)\nApollo:\nSomething's giving off a soft glow inside this boot. But it's too dark in there to see what it is.\nExamine hook-and-loop fastener straps\nApollo:\nWe might get a better look inside if we undid these straps.\nExamine residue on insole (after examining hook-and-loop fastener straps)\nLeads to:\n\"It looks like some kind of glowing moss.\"\nApollo:\nIt looks like some kind of glowing moss.\nDhurke:\nIt could've come from wherever the doctor went last night. Must've gotten in with some of that mud.\nApollo:\nIt might be worth looking into... ...if it'll help us pinpoint where the doctor hid the orb.\nGlowing Moss added to the Court Record.\nShoe shelves (subsequent times)\nApollo:\nThere's some glowing moss inside this boot.\nDhurke:\nI'm willing to bet it got there from wherever the doctor went last night.\nTalk\nLocation of the orb\nApollo:\nSarge, sir. Do you have any idea where the orb might be?\nSarge:\nIt was here in Papa's study until last night. But he said he was going to go hide it somewhere. He mentioned something about a shady character being after it.\nApollo:\nWhere do you think he could've hidden it?\nSarge:\nHmm... Somewhere in the village, I'd guess. He said he'd found a suitable hiding place for it.\nApollo:\nSo, it was here last night. That is, until he went out to hide it somewhere in the village. The only question is where?\nDhurke:\nMaybe he left some clue here in his study. Let's search the place again.\nApollo:\n(We should also find out more about Dr. Buff. It might steer us toward the hiding place.)\nDoctor Buff (appears after \"Location of the orb\")\nApollo:\nSo, Sarge, what was your father like?\nSarge:\nPapa was as king as Mama was courageous. His whole reason for moving to the countryside was for me.\nApollo:\nWhat do you mean?\nSarge:\nI initiated my siege defense strategy after Mama died. Papa was so worried about me, he moved us here to the countryside. He thought the fresh air, blue skies, and natural surroundings might alter my tactics.\nDhurke:\nWhat a fine father.\nSarge:\nHe even quit his position at the university to move here.\nApollo:\nHe did?\nSarge:\nHe did. He gave up his beloved research position just for me! \"A parent must be prepared to sacrifice everything for his child.\" That's what Papa said!\nDhurke:\n...Well, I'm feeling about two inches tall right now.\nSarge:\nThere's no one in the world I respected more than him. But that just makes his passing all the more devastating. *sniffle, sniffle* Papa, may you continue your beloved research up there with the angels!\nPresent\nAttorney's Badge\nSarge:\nWhat's that?\nApollo:\nIt's my attorney's badge, sir!\nSarge:\nYou mean like a medal?! What act of valor earned you such an honor?\nApollo:\nI rescued my clients from those who would brand them as guilty, sir!\nSarge:\nA heroic act, indeed!\nApollo:\nThank you for your kind words, sir! (This whole \"sir\" thing is getting real old, real quick.)\nPhoto of My Father\nSarge:\nCorporal Justice... you shoulder a bitter past.\nApollo:\nYou've been through quite a lot yourself, Sarge.\nSarge:\n...Corporal, if I may... um...\nApollo:\nYes?\nSarge:\n...Well... um... it doesn't have to be that often, but... W-W-Would you mind coming over from time to time?\nApollo:\nYou want me to visit you?\nSarge:\nO-Only if you want to, of course!\nApollo:\n...Sure. I'll come by, and I'll even bring along my coworkers, Sarge.\nSarge:\nR-Really?! Yaaaaaay! Our band of  brothers continues to grow in rank! Ha ha ha ha!\nDhurke:\n...Nice work, son. Glad to see you haven't changed one bit.\nApollo:\n(What's that supposed to mean?)\nStudy Photo or Research Notes\nSarge:\nWhy...? Why did Papa have to fall in battle?\nApollo:\n(He's putting on a brave face, but he's still just a child.)\nSarge:\nIn honor of Papa's heroic sacrifice...  let us march on, comrade! To victory!\nApollo:\nHuh?! I-I mean, sir! Yes, sir!\nDhurke:\nAre you two seriously bent on waging war against that bookcase?\nSarge's Drone\nApollo:\nIt looks like you can do everything by yourself.\nSarge:\nIndeed! I can even cook and build things whenever I want!\nApollo:\nSo there's really no reason for you to leave your room, huh.\nSarge:\nYes, but there is still one gaping hole in my siege defense. ...Going to the bathroom.\nApollo:\nWhen nature calls, it's best not to fight it.\nSarge:\nYes, all great tacticians will say never wage a battle you have no hope of winning.\nAnything else\nApollo:\nPlease take a look at this.\nSarge:\nLet me ask you something, Corporal Justice! How does that aid you on the battlefield?!\nApollo:\nUm, well, if you count the courtroom as a battlefield, it's a fairly useful weapon.\nSarge:\nGood answer! A military man must know his weapons inside and out! Keep up the good work, corporal!\nApollo:\nS-Sir, yes, sir! (I guess that's all he has to say about that.)\nAfter clearing \"Doctor Buff\" Talk option and examining computer, glasses, raincoat, and shoe shelves:\nApollo:\nOkay, let's go over what we've learned so far. Wherever it was that Dr. Buff went, he needed a raincoat. And it was somewhere where this glowing moss grows. Any ideas where that might be, Sarge?\nSarge:\nNegative, comrade. I hate to say my intel's a little thin on this one. I've been occupied with my siege defense strategy ever since we moved to the village.\nDhurke:\nWell, son, it seems we have no other choice. We'll have to ask the locals if they know of a place like that.\nWright Anything Agency\nTrucy:\nAh! Apollo, Mr. Dhurke! Did you have some quality father-son time together?\nTalk\nAny ideas?\nDhurke:\nThat poor child... How is he going to survive all on his own?\nApollo:\nYeah, it's not like he can go out grocery shopping on his own. We should drop off some food later.\nDhurke:\nNo, that would only make it worse. We should be encouraging him to come out on his own. Once his food runs out, he'll have to leave the house if he wants to eat.\nApollo:\nTalk about your old-school siege tactics. Sounds more like you want to starve him out...\nWhat to do\nApollo:\nUm...\nDhurke:\nYes? What is it?\nApollo:\n............\nDhurke:\n............\nApollo:\n(Talk about an awkward silence. I have no idea what to say.) ............ (Yeah... I've got nothing.)\nDhurke:\nAw, come on, son! Don't tell me you've got nothing!\nMay 16Kurain Village\nApollo:\nUgh. It feels like somebody's watching me, and it's really creeping me out. Oh, it's just Paul Atishon's campaign posters. When did he put these up? (Whatever. I've got more important things to be paying attention to.)\nDhurke:\nWhat great weather! It really lifts the spirits. I know! After our little treasure hunt, what do you say we go hunting, son?\nApollo:\nHunting? We used to do that a lot... didn't we?\nDhurke:\nJust look at that mountain. I bet there are some feisty wild boars up there!\nApollo:\nI... think I'll pass... but thanks.\nDhurke:\nOh, so hunting's a no-go. Um, well... I guess that wild boar stew will have to wait, then. .........Hm? Apollo, something seems different from the last time we were here.\nApollo:\nUh... You mean the posters?\nDhurke:\nNo, not those.\nApollo:\n(What's he talking about...? Guess I should take a look around myself.)\nExamine\nPaul Atishon campaign posters\nApollo:\nWhen did Paul Atishon have a chance to put up all these election posters?\nOld Man:\nThat fool keeps stickin' 'em on our houses! He's a disgrace to his distinguished heritage!\nApollo:\nHe's doing this without permission?\nFey Manor\nApollo:\nA thatched roof... First time I've ever seen one in real life.\nDhurke:\nIt looks just like the traditional thatched roofs they use in Japan. All we need now are some samurai with topknots, a few ninjas, and a cuddly mascot.\nApollo:\nWhen was the last time you were in Japan?\nBus stop\nApollo:\n(A phone booth and a bus stop made of wood. They both look really old. You hardly ever see phone booths in the city anymore.)\nDhurke:\nApollo... what's this glass box for?\nApollo:\n(I guess you hardly see them in Khura'in, too.)\nMountains\nDhurke:\nSeeing those mountains really takes me back. I remember when we used to live high in the mountains to escape from the government.\nApollo:\nSo, you don't live there anymore?\nDhurke:\nNope. I needed a more convenient place to lead the revolution from. But that old mountain hut is still there.\nApollo:\n(Man, I miss that hut...)\nDhurke:\nWhat, are you getting homesick, Apollo? You can come on back to Khura'in anytime, you know?\nApollo:\nN-No, no, I'm fine. Besides, I've got a lot on my plate here...\nKurain Boulder\nApollo:\nThere's a big boulder towering into the sky over there. According to the sign, it's called the \"Kurain Boulder.\" It also says that a spirit dwells within it. Hmm... A rock with a spirit in it?\nDhurke:\nIt's called animism -- the belief that spirits dwell within inanimate objects. They've probably enshrined this boulder as a sacred object. Their tradition of worshipping such objects is similar to our tradition in Khura'in.\nApollo:\nI-Interesting... (Who knew Dhurke could make sense every once in a while?)\nCanvas\nLeads to:\n\"What do we have here?\"\nApollo:\nWhat do we have here? It looks like an unfinished picture... like something a little kid might paint.\nDhurke:\nHmm, you're right. But I can't quite tell what it's of.\nApollo:\nI think it's supposed to be nighttime, but what's that thing on the left?\nDhurke:\nUm... A monster, or some kind of alien, perhaps? In any case, it's a pretty poor excuse for a drawing.\nApollo:\nWell, what did you expect from a little kid?\n???:\nA... little kid...?\nApollo:\nHuh? Oh, it's you, Pearl!\nPearl:\nWhy, Mr. Apollo, is that you? What a pleasant surprise! It's been quite some time. How have you been?\nApollo:\nFine, thanks. You're looking good, too, Pearl.\nDhurke:\nAren't you going to introduce me, son?\nApollo:\nOf course. This is Pearl Fey. She's a spirit medium here in Kurain Village. Pearl, this is Dhurke, my umm... client.\nPearl:\nHello, sir. Pleased to meet you. If there is anything I can do to help, please let me know.\nDhurke:\nNice to meet you, too. And what a polite little girl you are!\nPearl:\n...Um, actually... I'm a high schooler.\nDhurke:\nWhoops! Sorry about that! So, you're a spirit medium? Does that mean you can channel spirits, then?\nPearl:\nYes. I'm still in training, though. But I'm well-versed in the art of spirit channeling.\nDhurke:\nWell now, isn't that something! I mean, back in my country, our little princess hasn't channeled a single spirit yet! Pretty impressive, young lady!\nPearl:\nOh, but compared to Mystic Maya, there is so much more I must learn!\nApollo:\nMystic Maya? Oh, right, Maya Fey... Mr. Wright's former courtroom assistant. He told me all about her. She's a spirit medium, too, if memory serves.\nPearl:\nYes, she's an amazing medium. And soon, she'll be the next lead of the Fey clan, too!\nApollo:\n(Mediums and spirit channeling... I've heard all about it from Mr. Wright. He said that mediums will even physically become the person they're channeling. I wonder if even little Pearl would turn into a hulking giant if she hand to channel one...)\nPearl:\nI hope you don't mind me asking, but what brings you all the way out here, Mr. Apollo?\nApollo:\nOh, just a small matter to take care of.\nPearl:\n...Wait, would it happen to be the matter Mr. Edgeworth is looking into?\nApollo:\nProsecutor Edgeworth? What's he doing here?\nPearl:\nOh, so it's a different matter, then? Because I just saw him a moment ago. He appeared to be searching for something.\nApollo:\nOh? Hmm... (Mr. Edgeworth is a friend of Mr. Wright's, and the district's chief prosecutor. Why would HE be here in Kurain? Well, no point obsessing over it.) Come to think of it, you live here in Kurain Village, don't you, Pearl?\nPearl:\nYes, I was born and raised here.\nDhurke:\nThis is perfect, Apollo. Let's ask the young lady if she knows where the doctor might have gone last night.\nApollo:\nI was thinking the exact same thing. (Maybe I should show her what we found in the doctor's study.)\nExamine\nPaul Atishon campaign posters\nPearl:\nHonestly! Why does he keep putting these up? And on people's houses, no less!\nApollo:\nThat's got to violate some campaigning law or something... Here, Pearl, I'll help you take them down.\nApollo:\nWhew... Why did he have to put up so many...\nPearl:\nYeah... And it won't be long before he puts more up. It's really driving me crazy.\nDhurke:\nWhy don't you scribble something on them? You know, just some harmless graffiti?\nPearl:\n...Actually, that's just what I was thinking when I was sketching.\nApollo:\n...Why don't you join us for lunch at the office sometime? It'll get you away from all this.\nHouse\nPearl:\nThis is Fey Manor. Mystic Maya lives here. I hope she's doing well...\nApollo:\n(Oh right. Ms. Fey's off studying and training in Khura'in.)\nMountains\nApollo:\nThere's a lush, green mountain in the distance there.\nPearl:\nIt's home to a variety of animals. They sometimes come down to the village. I've seen foxes, badgers, and even bears.\nApollo:\nB-Bears?\nDhurke:\nWell, one would certainly never go hungry around here.\nPearl:\nThe poor animals! They are not for hunting or eating! Understand?!\nDhurke:\nBut badger and bear meat are so good...\nCanvas\nDhurke:\nThis picture looks like something you might've painted when you were little, son.\nApollo:\nI think I would've done a little better than this.\nPearl:\n.........\nCanvas (after perceiving)\nApollo:\nOn closer inspection, there's more to this picture than meets the eye.\nDhurke:\nSon, didn't you ever learn that honesty is the best policy?\nApollo:\nWay to go, Dhurke! I was trying to get us out of the hole we dug ourselves into earlier!\nTalk\nKurain Village\nDhurke:\nWhat a peaceful place. Ahh... Nothing beats mountain air.\nPearl:\nMany of the villagers have left for the city, but I just love it here. Blue skies, lush forests, star-filled skies at night, and fireflies in the summer. Plus, the big, beautiful, blue ocean is just beyond that mountain!\nDhurke:\nThe ocean?! What do you say we go for a swim, son?\nApollo:\n...Oh, um... I think I'll pass. (Besides, I can't swim.) ...Um, Pearl? Kurain Village is like, \"the home of spirit mediums,\" right?\nPearl:\nYes, and I'm a part of a long line of mediums.\nApollo:\nI've never seen a channeling before, but... ...is it possible to channel the spirit of anyone who's passed away?\nPearl:\nNo, not just anyone. You must know their face and true name.\nApollo:\nReally? You can channel a spirit just by knowing their face and name? That's an amazing ability.\nPearl:\nIt is, but it can only be learned by those with a gift occurring in certain bloodlines... ...and years of intense training. At present, Mystic Maya and I are the only ones in our village who can channel spirits.\nDhurke:\nLooks like spirit mediums are highly valued here, much like they are back in Khura'in.\nPearl:\nI heard there used to be many more of us a long time ago... ...but now, we are in very short supply. Most of the women nowadays don't want to stay; they want the thrill of the big city.\nApollo:\nYeah, well, you guys aren't exactly close to any shopping malls or nightclubs out here. But what about you? Are you NOT interested in things like that?\nPearl:\nW-Who, me? Well, I... I wouldn't mind a new outfit or two, and, well... Oh, never mind.\nApollo:\nIt's okay, Pearl. You are at that age, after all.\nPaul Atishon (appears after \"Kurain Village\")\nApollo:\nOh! We met this weirdo earlier named Paul Atishon. Do you know anything about him?\nPearl:\nYes, he's been campaigning a lot around here lately. And the noise he's been making has become quite a problem. People are especially upset that he's campaigning at all hours of the night and day.\nDhurke:\nHmm, well... The local police should arrest him for disturbing the peace.\nPearl:\nUnfortunately, there's little they can do because the Atishon family is so powerful.\nApollo:\n(...Well, isn't HE the proverbial pampered provincial prince.) He seems pretty intent on winning here in Kurain. Is there some special reason why?\nPearl:\nI'm not sure, but I have an idea. The spirit mediums of Kurain once held considerable sway in the political world. Judging by his slogan, maybe that's what he's after.\nApollo:\nGreat, so he's just another politician seeking powerful connections...\nDhurke:\nThe ability to commune with the dead gives comfort to those anxious about the future. Tiny Khura'in has preserved its independence by the queen's power of spirit channeling. It must play a similar role in this village.\nPearl:\nYes. Even today, many here revere those with spirit medium blood flowing in their veins.\nApollo:\nSo basically, as Paul Atishon's benefactor goes, so goes the whole village? (Who is this benefactor? Who could hold this much sway over Kurain Village?)\nWhere the doctor went (appears after presenting Glowing Moss)\nApollo:\nPearl... Do you have any idea where Dr. Buff might've gone last night?\nPearl:\nUmm... Well...\nApollo:\n.........\nPearl:\n...Uhh, about that... ...All I know is Dr. Buff was somewhere on Mt. Mitama.\nBRACELET THUMPS\nApollo:\n...! (My bracelet...! It's reacting! Which means Pearl is hiding something from me.)\nPresent Bracelet\nPearl:\nAll I know is Dr. Buff was somewhere on Mt. Mitama.\nPercieve twitching left thumb on \"Mt. Mitama.\"\nApollo:\nApollo:\nPearl, you seem anxious around the topic of Mt. Mitama. I could tell because you'd rub your thumb over a splotch of dried paint as you said it.\nPearl:\nOh! U-Um, well...!\nApollo:\nThat nighttime painting is yours, isn't it?\nPearl:\n.........! ...This is so embarrassing. As you saw, I'm not a very good artist. But that picture has nothing to do with Dr. Buff!\nApollo:\nI'm not so sure about that. In fact, I'm going to guess that while you were out here painting last night... ...you actually saw the good doctor heading out to Mt. Mitama from the bus stop.\nPearl:\nN-No! I-I didn't see anything like that! I swear!\nApollo:\n...No, I'm positive you saw the doctor. After all, he's right here in your picture.\nPresent human-like figure\nApollo:\nLeads to:\n\"Y-You think that's the doctor?\"\nPresent anywhere else\nApollo:\nApollo:\nSee? Isn't the doctor right there?\nPearl:\nReally? That doesn't look like him to me.\nApollo:\nWell, I guess it IS pretty abstract.\nPearl:\nOh... Is it really that hard to make out? Er, what I mean is, it has nothing to do with Dr. Buff! After all, I never even saw him that night!\nLeads back to:\n\"...No, I'm positive you saw the doctor. After all, he's right here in your picture.\"\nPearl:\nY-You think that's the doctor? I may not be a very good artist, but at least I know how to draw a person!\nApollo:\nOkay, if this isn't a person, then what is it?\nPearl:\nEr... Th-That's a... a rain spirit!\nApollo:\n.........\nPearl:\n..................\nApollo:\n...Um, and what's a rain spirit doing at a bus stop?\nPearl:\nOh, umm, rain spirits have places to go, too!\nApollo:\n........ (This is getting ridiculous.) Sorry, Pearl, but you're not a very good liar. That is Dr. Buff, and this piece of evidence proves it!\nPresent Raincoat\nApollo:\nLeads to:\n\"This is the raincoat we found in the doctor's study.\"\nPresent anything else\nApollo:\nPearl:\nThe only thing I'm guilty of is being a terrible artist. But you're taking advantage of that to claim the picture is something it's not!\nApollo:\nN-No no, it's... (...totally like that, but...)\nPearl:\nThat isn't a person! It's a rain spirit, I tell you!\nApollo:\nNo, Pearl, that isn't a rain spirit.\nLeads back to:\n\"That is Dr. Buff, and this piece of evidence proves it!\"\nApollo:\nThis is the raincoat we found in the doctor's study. It's still wet and muddy, so we know that someone wore it last night. Now, let's see how this pattern is the same as the \"rain spirit\" in your picture?\nPearl:\n...Ah!\nApollo:\nYou didn't see a rain spirit last night. You saw Dr. Buff wearing this raincoat!\nPearl:\nAh! ...I... I'm sorry. I know I'm not supposed to lie, but...\nLeads back to Talk options\nPercieve wrong area\nApollo:\nApollo:\nPearl, you seem uneasy about something.\nPearl:\nAnyone would feel uneasy being stared at like that!\nApollo:\nHuh? But I...!\nDhurke:\nI'd be unnerved, too. I mean, your eyes are practically popping out of your head.\nApollo:\nI-I get it. I'll tone it down a little. (Guess I was wrong.)\nLeads back to Talk options\nWhere the doctor went (after perceiving)\nPearl:\nI'm sorry I didn't tell you before, Mr. Apollo, but I did see the doctor last night.\nApollo:\nIt's all right. Just, please, tell me everything you know.\nPearl:\n...Of course. I was painting out here last night... when the doctor came up to the bus stop. He was wearing a raincoat, even though it wasn't raining, and a helmet with a light on it.\nApollo:\nSounds like he was well-prepared for something.\nPearl:\nI know. That's why I asked him if he was going off exploring again. He looked startled, like he hadn't noticed me there. And then, he suddenly said...\n\"Please don't tell anyone you saw me here.\"\nApollo:\nWhy would he want to silence you like that?\nDhurke:\nSomething must've happened to spook him. And he didn't want anyone to know where he was going to hide the orb.\nApollo:\nBut where could he have been going dressed like that?\nPearl:\nMy best guess is a cave somewhere on Mt. Mitama. I heard there's a cave there where mediums of the Kurain tradition went to train long ago. Legend has it, there are some sort of mystical ruins in there.\nApollo:\nMystical ruins? Sounds like the exact sort of place an archeologist might go.\nPresent\nAttorney's Badge\nPearl:\nHee hee. Seeing you present your badge like that... ...reminds me of when I used to investigate cases alongside Mr. Nick.\nApollo:\nYou used to help Mr. Wright all the time, I hear.\nPearl:\nThat I did! Doing so helped me expand mu horizons beyond this tiny little village. So please, Mr. Apollo! If there's anything I can help you with, you just let me know!\nApollo:\nI will. (What I'd really like is her help with cleaning the office again.)\nGlowing Moss\nApollo:\nPearl, do you have any idea where this moss might grow?\nPearl:\nThat looks like... Mitama Moss. It grows on Mt. Mitama, and gives off a soft glow in the dark.\nApollo:\nMt. Mitama?\nPearl:\nSee that mountain over there? That's Mt. Mitama.\nDhurke:\nAnd how would one get there?\nPearl:\nYou can take a bus from that bus stop over there. ...Um, may I ask why you're so interested in that moss?\nApollo:\nWell, Dr. Buff was supposed to give us something. But it seems he hid it somewhere last night.\nPearl:\nH-He did? Maybe that's why he, um...\nApollo:\nPearl? Do you know something that might help us?\nPearl:\nUm, well...\nApollo:\n(Sounds like I'd better find out what she knows.)\nAnything else\nPearl:\nOh, um... Sorry, I wish I could help, but...\nApollo:\nNo, don't worry about it! I'm sorry I wasted your time like that.\nPearl:\nUm... At least let me offer you some tea. I mean, you must be tired from all your investigating.\nPearl:\nOh, no, you don't have to do that. We'll be just fine, thank you. (She's so polite, it's hard NOT to feel rude around her.)\nAfter clearing all Talk options:\nApollo:\nWell, we should get going now, but thanks for all your help, Pearl.\nPearl:\nYou're welcome, Mr. Apollo. Please take care.\nDhurke:\nWhat do you say we go find that cave, son? I sense that the orb might finally be within our grasp.\nApollo:\nThis treasure hunt is shaping up to be the real deal.\nDhurke:\nHah hah hah. Really gets the blood pumping, doesn't it?! Well, what are we waiting for? Let's go!\nMay 16Mt. Mitama - Cave Entrance\nApollo:\nWhew, I'm all out of breath.\nDhurke:\nAw, come on, that was nothing. And you're so much younger than me.\nApollo:\nI, uh... *huff* *puff* ...don't normally get this much exercise... *cough* *sputter*\nDhurke:\nNeed a break?\nApollo:\nN-No, I'm fine. *huff* *puff* Dhurke! Look! There's Mitama Moss growing in that cave over there.\nDhurke:\nThis must be where the doctor was last night. Let's take a look inside.\nMay 16Mt. Mitama - Cave\nApollo:\n............ I can't see a thing.\nDhurke:\nRelax. Your eyes will adjust eventually. Now, follow me.\nApollo:\nI-I really think we need a flashlight, Dhurke.\nDhurke:\nShould've brought one along then, son.\n???:\n...Here, use mine.\nApollo:\nThanks! Wait, were you holding out on me?\nDhurke:\nUm... who are you talking to, Apollo?\nApollo:\n...You...? Whoa! (Someone just pushed me!)\nDhurke:\nApollo? What the--?! Apollo!\nAh... AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAH!\nApollo:\nOww...\nDhurke:\nAre you all right, son?\nApollo:\nY-Yeah... Looks like someone got the drop on us.\nDhurke:\nQuite literally.\nApollo:\nBut who--? I mean, we could've died from that fall!\nDhurke:\nI don't know... Hmm... But I don't think we'll be getting out the way we came in. Looks like we're in a pretty deep cave. Nothing to do but press on, son.\nApollo:\nHow can you even see in here?\nDhurke:\n...Come on, let's go.\nApollo:\nH-Hey, wait! (One false step and we're dead... What in the world should we do...?)\nWait here\nApollo:\nHow about we wait for help to come?\nDhurke:\nAnd how are we to call for said help, hmm?\nApollo:\nWith my phone, obviously. I'll just-- Argh...! Of course we're in a dead zone... *sigh*\nDhurke:\nGuess that's that.\nApollo:\n(Just great...)\nLeads back to:\n\"What in the world should we do...?\"\nGo forward\nLeads to:\n\"I guess we keep going.\"\nClimb back up\nApollo:\nLet's try climbing back up.\nDhurke:\nCan you even see the wall in front of you?\nApollo:\n...No...\nDhurke:\nWell, I can tell you it's far too steep.\nApollo:\nYou never know until you try! Here goes nothing! Hrrrgh... Annngh...\nDhurke:\nYour loud voice may move mountains... ...but you've barely moved an inch, son.\nApollo:\n(Argh!)\nLeads back to:\n\"What in the world should we do...?\"\nApollo:\nI guess we keep going. There must've been some path for Dr. Buff to follow when he came to hide the orb.\nDhurke:\nRight. By the way, it looks like our attacker left us with this useful parting gift.\nApollo:\nFrom lawyer to spelunker... How do I always get myself into these situations...? We're never going to make it out alive, I hope you know.\nDhurke:\nDon't tell me you're scared, son. We're just getting started. The greatest treasures are only ever found at the point of a blade, or the edge of a cliff.\nApollo:\nYeah, sure... If I'd known I'd wind up at the bottom of some dark, damp cave... ...I would've never taken your request, Dhurke.\nDhurke:\nSave your breath, Apollo. Just keep putting one foot ahead of the other.\nApollo:\nThere'd really better be a way out of here.\nDhurke:\nWe'll find one before you know it. You'll see.\n..................................................................\nMay 16Mt. Mitama - Cave\nApollo:\n*huff* *puff* We've been walking for over an hour. It's like a maze in here. I couldn't go back to where we started if I wanted to.\nDhurke:\nY-Yeah... This cave goes deeper than I thought.\nApollo:\nWait, don't tell me there really is no way out...\nDhurke:\n...Where there's a will, there's a way.\nApollo:\nEver the optimist, aren't you... (Maybe we should cut our losses while we still can...)\nForge ahead\nLeads to:\n\"Even if we were to turn back, we wouldn't make it up that wall of solid rock.\"\nTurn back\nApollo:\nI seriously think we're going to get completely turned around if we go any further, Dhurke. I mean, we don't even know if there's a way out up ahead.\nDhurke:\nBut we DO know we can't climb up that wall.\nApollo:\nYeah, but...\nDhurke:\nI still know the way back from here. Don't worry, son. We can always go back there any time we want.\nApollo:\nI-If you say so. (Famous last words if I've ever heard some...)\nLeads back to:\n\"Maybe we should cut our losses while we still can...\"\nPut my foot down\nApollo:\nI'm not taking another step, Dhurke!\nDhurke:\nCome on, now... Be reasonable...\nApollo:\nNo! I'm done, and that's final.\nDhurke:\nI remember when you used to throw tantrums like this.\nApollo:\nW-Well, I'm not a child anymore!\nDhurke:\nThere, there! It's okay. Daddy'll buy anything you want once we get home, son.\nApollo:\n(...I'd better quit while I still have some manhood left to salvage... But it doesn't seem like Dhurke's about to quit any time soon. Even still...)\nLeads back to:\n\"Maybe we should cut our losses while we still can...\"\nApollo:\n(Even if we were to turn back, we wouldn't make it up that wall of solid rock. So, I guess we keep going.) ............*sigh* How did I get stuck wandering around in a dark cave again? It's definitely not in my job description.\nDhurke:\nHeh heh. Listen, son. Only the truly accomplished have the luxury of being so choosy. When I was just starting out, I did everything from street performing to yak milking.\nApollo:\nAnd... that helped you become an accomplished attorney, how?\nDhurke:\nIt didn't. But when you need to make a living, you'll take on any job just to survive. ...Say, how IS your career going, by the way?\nApollo:\nWell, it's been a harrowing adventure so far, to say the least. My first trial really put me through the wringer. And my next case had me investigating a pair of stolen panties. And just when I was hitting my stride, this one prosecutor branded me as \"Herr Forehead.\" Oh, and there's this other, ridiculous prosecutor who wields a samurai sword.\nDhurke:\n...Sounds like you've, um... seen quite a bit.\nApollo:\nYou're telling me.\nDhurke:\n...Listen, Apollo... I'm, uh, I'm sorry I didn't contact you for so long.\nApollo:\n............It's fine, Dhurke. What happened, happened.\nDhurke:\n...Hm? Careful, the ground doesn't feel as solid here.\nApollo:\nWhat? Yikes! The cave floor's collapsing!\nDhurke:\nArgh! Not agaaaain!\nApollo:\nAAAAAAAAAAAAAAAAAAAAAAAAAAAHH!\nMay 16???\n???:\nHey, Apollo. Can you hear me?\nApollo:\n...Unngh. (.........Dhurke?) Huh? Where are we? Whoa! What is this place?!\nDhurke:\nI was shocked, too. These ruins look really old.\nApollo:\nIt's not exactly something you'd expect to find in the middle of a cave system, that's for sure. Maybe the doctor hid the orb here? I mean, those look like footprints over there.\nDhurke:\nSon, I think our little adventure is about to pay dividends! Time to find that orb!\nExamine\nPlastic bottle\nApollo:\nWhat's a plastic bottle doing here?\nDhurke:\nThere's seaweed stuck to it, which means it probably came from the ocean. Hmm... It's possible this cavern is connected to the sea somehow.\nDriftwood\nApollo:\nDriftwood? How'd that get in here?\nDhurke:\nBy drifting on in, I'd assume. The only question is, from where?\nCavern wall near stone altar\nApollo:\nSo that's the hole we fell through. Doesn't look like we'll be going back that way. We're lucky we survived the fall from way up there.\nDhurke:\nIndeed. If that hole hadn't been above the lake, we'd be history. You passed out the moment you hit the water.\nApollo:\nYeah, well, water's not really my thing.\nDhurke:\nHmm, this cavern is solid rock all around. Looks like we either go back through that hole... ...or find some other way out.\nApollo:\nUgh. Why am I always between a rock and a hard place?\nStone altar\nApollo:\nIt's a big stone altar. One false move, and some god might come and smite us.\nDhurke:\nOh, come on. It's not all doom and gloom.\nApollo:\n...I dare you to look at our surroundings and say that again, Dhurke.\nDhurke:\nHah-ha ha ha ha ha! You've got me there, son.\nApollo:\n(Dear gods, please smite me now.)\nWater\nApollo:\nThis lake looks really deep. I can't even see the bottom. (A bottomless lake in the depths of a mountain cave system. My blood runs cold at the thought of falling in there.)\nDhurke:\nThe water... It's salty. This lake may very well lead to the ocean.\nApollo:\nDidn't Pearl mention something about the ocean? ...Like how it's on the other side of the mountain? Can't imagine she meant it literally.\nFootprints\nApollo:\nThese have gotta be the doctor's footprints. They match the bottoms of the boots we saw in his study.\nDhurke:\nSo he made it all the way down here. Hmm... The water's washed and most of them away, but his footprints are everywhere.\nApollo:\nReally? 'Cause these are the only sets I see.\nDhurke:\nHe must've been looking for something. ...Ah. Those prints... They're coming out of that lake.\nApollo:\nHey, you're right. But that would mean Dr. Buff came walking out of the water.\nBox on altar\nApollo:\nThis box looks pretty new. I'm guessing... the doctor's the one who brought it down here.\nDhurke:\nIt's no good. It's locked tight.\nApollo:\nThere's no way to open it?\nDhurke:\nDoesn't look like it. There isn't even a keyhole. Which means... there must be a trick to opening it. We'll have to figure it out if we want to see what's inside.\nTalk\nAny ideas?\nApollo:\nI wonder what this place was for before it was... well, ruins.\nDhurke:\nI'm guessing it was a place for spirit mediums to perform their rites. But earthquakes and the changing landscape eventually buried it.\nApollo:\nIf you're right, that would mean that it hasn't been used in ages.\nAfter examining cavern wall near stone altar, water, footprints, and box on altar:\nDhurke:\nLet's sum up what we know so far. The orb is almost definitely inside this box contraption that we can't open. As for this cave, there doesn't seem to be any way out.\nApollo:\nNnrgh... We're THIS close to the orb...\nDhurke:\nAww, come now, son. Don't be like that. It's just a bit of bad luck. That's all.\nApollo:\nA bit? Murphy called. He wants his law back.\nDhurke:\nWhat doesn't kill you, makes you stronger, right? Hah-ha ha ha ha ha!\nApollo:\n(How can he laugh at a time like this?)\nDhurke:\nWe're stuck here for now, so we might as well try to open this thing.\nApollo:\nOkay, let's see what we're dealing with.\nExamine button\nApollo:\nThere's a big button here. ...Huh. Nothing happened.\nExamine pictures\nApollo:\nThis thing is covered with pictures. And, hey! Each section also rotates!\nDhurke:\nTake a look at this, son. See the picture of a dragon battling a tiger? And this green and purple one... ...is of a Khura'inese butterfly and a mitamah.\nApollo:\n...I wonder if they're clues for figuring out how to open this box.\nAfter examining button and pictures:\nDhurke:\nIt appears this box uses a picture-based combination lock. We'll have to arrange the pictures on each side in the correct sequence.\nApollo:\nLet's see... There's the dragon and tiger fight, a Khura'inese butterfly with a mitamah...\nDhurke:\n...And a number of pictures, too.\nApollo:\nDhurke, I was thinking... Maybe we should check the evidence we've collected so far. I think we have something that just might help us open it.\nDhurke:\nYou read my mind, son.\nApollo:\nI think this will help us open the puzzle box.\nPresent Research Notes\nApollo:\nLeads to:\n\"Dr. Buff's research notes mention the Song of Ceremony.\"\nPresent anything else\nApollo:\nDhurke:\nI don't see how that would help us.\nApollo:\nReally? (Guess that wasn't it.)\nDhurke:\nThere's a dragon and tiger fighting, and a Khura'inese butterfly with a mitamah. We've gotta have something related to those things, don't we?\nApollo:\nHmm...\nLeads back to:\n\"I think this will help us open the puzzle box.\"\nApollo:\nDr. Buff's research notes mention the Song of Ceremony. Maybe its lyrics and the pictures on the box correspond somehow.\nDhurke:\nI think you're on to something, son.\nApollo:\nOkay, let's give it a shot. Each dial has six pictures... ...and there are four dials in all. The box should open once the pictures are arranged in the right order. Funky puzzle box... here comes Justice!\nInput tiger and dragon picture on top row, Khura'inese butterfly and mitamah picture on middle-top row, praying people and Holy Mother picture halves on middle-bottom row, and Holy Mother's spiritual blessing picture on bottom row\nLeads to:\n\"It opened!\"\nInput any other combination\nApollo:\nIt won't open.\nDhurke:\nMaybe the pictures aren't in the right order. The case should open if the pictures are arranged properly, but...\nApollo:\nI know. I should carefully consider which part of the song corresponds to which picture.\nApollo:\nIt opened! So this is the Founder's Orb...\nDhurke:\nWe did it, son! The orb is finally ours!\nFounder's Orb updated in the Court Record.\nDhurke:\nAt last, the Founder's Orb is ours! And it's all thanks to you, son! Well done! Then again, I'd expect nothing less from my boy!\nApollo:\nOh, uh, ha ha. It's no big deal.\nDhurke:\nDon't sell yourself short! You may think it's nothing... ...but your insights and reasoning led us here. And I'd say that's truly impressive!\nApollo:\nI don't know about that, ha ha ha.\nDhurke:\nAll those battles you fought in the courtroom have shaped you into the man you are today. And I couldn't be prouder!\nApollo:\n...W-Will you cut it out, already? (...Before I turn into a sun-ripened tomato.)\nDhurke:\nWith this orb, I can finally deliver a fatal blow to the Ga'ran regime. Hah-ha ha ha ha ha!\nApollo:\nSo, how exactly do you plan on using it? You're not going to try to become a spirit medium, are you?\nDhurke:\nDon't be ridiculous. I don't need supernatural powers like that.\nApollo:\nSo then, are you going to use it as a bargaining chip with Queen Ga'ran? Like demanding she abolishes the Defense Culpability Act?\nDhurke:\nWell, the thought had crossed my mind, but... ...the main thing is returning this to the Kingdom of Khura'in. After all, as a sacred relic of Khura'inism, that is where it belongs.\nApollo:\nReally? That's all you wanted to do?\nDhurke:\nMm-hm. Because my true objective has always been... ...to find out who asked Dr. Buff to study it and why.\nApollo:\nI'm not sure I follow.\nExamine\nBox on altar\nApollo:\nThat was one fancy puzzle box.\nDhurke:\nThe fact that he chose to use such an elaborate box... ...makes me think that Dr. Buff must've had a rather playful side to him.\nApollo:\nI can almost imagine him saying, \"Go ahead. Open it if you can.\"\nTalk\nThe orb's significance\nDhurke:\nThe official story is that the orb was stolen from the Tehm'pul Temple treasure room.\nApollo:\nYeah, I heard about that on the news. They also said your group was behind the theft.\nDhurke:\nThat's not good... We're probably on an international most-wanted list now. ...Let me ask you something, Apollo: Who do YOU think really stole the orb?\nApollo:\nUmm, I really haven't a clue.\nDhurke:\nWell, I think it was one of the royals.\nApollo:\nReally? Someone from the royal family?\nDhurke:\nYeah, and I've got a pretty good idea which one it was.\nApollo:\n(He knows who it is?) Care to share your hunch?\nDhurke:\nAll I'll say at this point is this: Security is pretty tight, but the royals have unfettered access to the treasure room. Plus, they seem to be turning a blind eye to the orb's loss.\nApollo:\nBut why would a member of the royal family do that?\nDhurke:\n...That, I haven't figured out yet. But whatever the reason, it can't be good. I mean, a Khura'inese royal stealing a national treasure of such religious significance? And then pinning the crime on us, the Defiant Dragons?\nApollo:\nSounds like a conspiracy or something.\nDhurke:\nI agree. And if the truth were to come to light, it would be a scandal of epic proportions. To allow a foreign national to study a treasure so sacred that it's off limits to the public... It would be seen as an utter sacrilege to those who truly revere the Holy Mother.\nApollo:\nSo if this were to go public, support for the Ga'ran regime would weaken.\nDhurke:\nBut that's not all. This is just a hunch, but I believe there's something even bigger here. Something that would explain why the orb was being studied in the first place. Something that would shake the Kingdom of Khura'in to its very core. And I'm going to find out what.\nApollo:\n(.........He's probably right. His intuition is usually spot on.) Dhurke, why are you so bent on revolution, anyway? Is it to reform the legal system in Khura'in?\nDhurke:\nThere's that. But I'm  also doing this for my children... I want to save Nahyuta.\nApollo:\nWhat do you mean?\nDhurke:\n...This is for your ears only. It's the other reason why this revolution needs to succeed.\nNahyuta (appears after \"The orb's significance\")\nApollo:\nNahyuta... I never thought that our reunion would take place in a courtroom.\nDhurke:\nOh, so you've run into each other already.\nApollo:\nYeah, but it was like he was a different person. He used to be such a kind, cheerful kid -- always smiling and stuff. But now... He tried to convict Trucy for a crime she didn't even commit. Plus, he kept telling me I had a \"putrid mind\" and to \"let it go, and move on.\"\nDhurke:\nHas it really gotten that bad? It must be Ga'ran's influence. He wasn't like that when he first stepped into the courtroom. Back then, he still had a keen sense of justice.\n\"I vow to bring the Ga'ran regime down and reform the legal system.\"\nDhurke:\nThat's what he swore to do... but that was also five years ago. He'd been the shining star of the Defiant Dragons, and our greatest hope.\nApollo:\nWait, Nahyuta was a Dragon?\nDhurke:\nHe was. But these days, he's more like Ga'ran's lapdog.\nApollo:\nTalk about a complete about-face. Why would he do that?\nDhurke:\nSomething must have happened to him. Something that sparked a radical change. Still... I don't think he truly believes in the new path he's taken. It's not conviction that fills his heart; it's resignation and despair.\nApollo:\nI-I see...\nDhurke:\n...The only thing I know for sure is... Nahyuta is suffering... and he is suffering in silence.\nApollo:\nNahyuta... is suffering...?\nDhurke:\nYes. He knows the rightful state of Khura'in's legal system... ...but something forces him to bend to Ga'ran's will, and it's tearing him apart.\nApollo:\nBut it's been five years. Do you really think he even still wants to reform the legal system?\nDhurke:\n...As long as he carries what I've taught him in his heart, I do.\nDhurke's teachings (appears after \"Nahyuta\")\nLeads to:\n\"\"A dragon never yields.\" ...That's what you always told us.\"\nPresent\nFounder's Orb\nDhurke:\nThe orb is ours at last!\nApollo:\nI'm just glad we were able to make what you said in your broadcast a reality.\nDhurke:\nMe, too. I didn't want to admit it before, but I was starting to have second thoughts about making such a big, bold move. I kept thinking, \"What would happen if we failed to get the orb?\"\nApollo:\nJust another example of how a bluff can be the starting point in the quest for the truth.\nDhurke:\nAnd what a hard-won truth it was. But I couldn't have done it without you, son.\nApollo:\n\"A dragon never yields.\" ...That's what you always told us.\nDhurke:\nThat I did. It's a belief I've held since back when I was lawyer. [sic] The dragon stands at the pinnacle of the natural world. Nothing and no one can bend its will.\nApollo:\nThat's why we lawyers must pursue the truth like an unyielding dragon, right? We must fight for truth to the bitter end, no matter what it takes... (Dhurke and Mr. Wright... they have that much in common.)\nDhurke:\nThat's why I've held onto this badge, even though there are no more lawyers in Khura'in. I believe that one day, our legal system will return to its former glory. And this badge here is a testament to that belief.\nApollo:\n...Hmm... I wonder if Nahyuta still believes in what you taught us?\nDhurke:\nHe does. That much I'm sure of.\nA dragon never yields.\nDhurke:\nI know that belief is etched deep in his heart. ...I'd bet my life on it. After all, he is my flesh and blood!\nApollo:\n............ (This unshakable faith and confidence... It's what draws people to him, whether they like it or not. ...Even people like me.) You know, I remember back when we were kids... ...Nahyuta used to say with great pride, \"I have the blood of the dragon within me.\"\nDhurke:\nYes, and that's why I want to free him. Free him from the poisonous clutches of the Ga'ran regime.\nApollo:\nSo that's your other reason for starting a revolution...\nDhurke:\nYes. I need to smack some sense into that boy of mine. I mean, what else are fathers for? Hah-ha ha ha ha ha!\nApollo:\n...I... I wouldn't know.)\nDhurke:\nNow that we have the orb, on to the next problem -- getting out of here.\nApollo:\nWell, we're not going back the way we came. That's for sure. That hole we fell through is way too high to climb back up to.\nDhurke:\nActually, I have an idea. That lake water tastes salty, which means it must connect to the ocean.\nApollo:\nW-Wait a second. You're not suggesting we SWIM our way out of here...?\nDhurke:\nThat's exactly what I'm suggesting.\nApollo:\nBut we have no idea how deep that lake goes. It's pitch black down there.\nDhurke:\nNot a problem.\nApollo:\nHow is that not a problem? I mean, how do you even know if there's really a passage to the ocean?\nDhurke:\nWell, one of us has to try, and I'm the better swimmer. Time's a wastin'! I'll be back before you know it, son.\nApollo:\nDhurke! ...He's gone. I sure hope he knows what he's doing.\nMay 16Mt. Mitama - Kurainese Ruins\nApollo:\n......... (It's been twenty minutes. I hope he's okay.) What's going on? Uh-oh. Th-The water...! It's rising! And fast! Aaaaaaaaaaaaah! (N-Need... air...) *cough* *sputter* *cough* *cough* ...Ahhh! I don't know how to swim! If I don't grab onto something that floats...! .................. *cough* *sputter* *cough* *cough* ...This is bad! I-I better think of something -- quick!\nExamine\nPlastic bottle\nApollo:\nHey, maybe I can use this like an oxygen tank! ...Wait, what am I thinking?! I need to stay calm and be more rational about this!\nDriftwood\nApollo:\nI've got it! As long as I hold onto this, I should be able to stay afloat!\nStone altar\nApollo:\nThis is not good. The water's almost up to the top of the altar. It won't be long before it reaches the roof of the cave.\nBox on altar\nApollo:\nThe puzzle box is still at the base of the altar. It must've been designed to stay put, even at high tide. Wait, that's it! Dr. Buff must've gotten in here from some ocean-side entrance at low tide. That's why his footprints were leading OUT of the lake. So it really DOES connect to the ocean. Not that that helps. I'd drown before I made it out.\nTop of cavern\nApollo:\nNnrrgh... It's no use! The hole's still too high up! I'll have to find another way -- and quick -- before I drown!\nAfter examining plastic bottle, driftwood, box on altar, and top of cavern:\nApollo:\nThe water won't stop rising! Aaaah! I-I'm getting swept away! Aaaaaaaaaaaaaaahhhhh! Please...! STOPPPP!\nExamine\nPlastic bottle\nApollo:\nIf only that bottle were a little bigger, it'd store that much more air... No, it wouldn't make that much of a difference... I need to stop with these harebrained ideas, and come up with a real way to escape!\nCavern ceiling\nApollo:\nThe water's almost to the top now. At this rate, I'll run out of breathing room! I'm a goner if I don't find a way out quick!\nHole in cavern\nLeads to:\n\"The water's just high enough for me to reach the hole!\"\nApollo:\nThe water's just high enough for me to reach the hole! I'm saved! All I have to do is go back the way we came! The water might even lift me all the way back up, over that wall of rock! Here goes! ...Huh? The hole! It's full of rubble. The tunnel collapsing above must've filled it in after we fell through it. Nngh... This... This can't be happening! No, I can't give up now. I refuse to die here! Th-The water...! I can't--! *cough* *sputter* I can't... I can't... breathe... .................. (Is this... the end?) .................. (Dhurke... I wonder if he made it out.) .................. (So this is what it feels like to drown. I would've eaten that sushi if I'd known it would be my last meal. ...I feel like I've been through this before. ...Ah, now I remember. It was back when all three of us were living in that shack in the mountains. Nahyuta and I were playing by the riverside when we got swept up in the rapids.)\nApollo:\nAAAAAAHHH!\nNahyuta:\nAAAAAAAGH!\nApollo:\n(I thought we were goners, but then...)\nDhurke:\nNahyuta! Apollo! Hold on! I'm coming!\nApollo:\n...*sniffle*... *sniffle*... *sniffle*... Wahhhhh!!!\nNahyuta:\nWaaahhhh!!!\nDhurke:\nHah-ha ha ha ha ha! That was a close one! Thought I'd lost you two!\nApollo:\nI-I'm sorry, Dhuuuuuuurke!\nDhurke:\nAll right, that's enough now. Didn't I teach you that boys don't cry?\nNahyuta:\n...Thank you, Father.\nApollo:\n*sniffle* *hiccup* *hiccup*\nNahyuta:\nYou... You could've been killed... But you risked your life... to save us... Why...?\nDhurke:\nWhat a silly question. What father wouldn't risk his life to save his own children? Nahyuta, Apollo... Don't you ever hesitate to call when you need me. Understand?\nApollo:\n...Hey Dhurke? This isn't forever, right? You'll bring me back from America someday, right?\nDhurke:\nOf course... I'll come pick you up as soon as things settle down here. Promise.\nApollo:\nOkay! You promised!\nApollo:\n...Dhurke. I waited and waited. For the day you'd come and take me home. But you never came. That's why I tried to forget about you... ...and my life back in Khura'in.\n...Dhurke... Why...? Why... didn't you...? .................. .....................\n???:\nA... ...lo... A... pol... lo...! Apollo! Can you hear me?!\nApollo:\n*cough* *sputter* *cough* .........D-Dhurke?\nDhurke:\nStill can't swim, eh?\nApollo:\nYou... You came back? But why?\nDhurke:\nI said I'd come for you, didn't I?\nApollo:\nYeah... But you can't hold me and swim...! We're both going to...!\nDhurke:\nStop talking. You'll bite your tongue.\nApollo:\nWhat? Whoa whoa whoa! (We're being pulled under! What's going on?! Why is this happeniiiiing?!)\n..................\nMay 16???\nApollo:\n*cough* ...Uuuuugh. Wh-Where...?\n???:\nAhh, you finally came to, son.\nDhurke:\nGet your fill of seawater? Good thing your name's not Neptune, huh! Hah-ha ha ha ha ha!\nApollo:\nD-Dhurke...\nDatz:\nHar har har har har har! You're telling me! Check it out, snot's coming out of his nose!\nTrucy:\nWhat a miraculous escape! Not even some of the escape-artist greats could pull that off!\nApollo:\n...Wh-What on earth happened?\nDhurke:\nSorry it took me so long, son. I made it to the ocean, but I figured you still couldn't swim. So I found a local fisherman and had him take us out near the undersea cavern. He tied a rope to me, and I came and grabbed you. Then he yanked me back.\nApollo:\nOh, so that's what pulled us under with such force.\nTrucy:\nDon't forget about me! I assisted in your escape act, too, Polly!\nDhurke:\nI've helped compatriots escape from all sorts of places -- mountain jails, island prisons... But an undersea cavern? Now that was a first!\nApollo:\n......... (Dhurke... He risked his life for me.) .........Dhurke. I'm only alive because of you. ...Thank you.\nDhurke:\nOh, uh... Y-You're welcome. I, uh... just did what any father would do for his son.\nApollo:\n(.........He saved my life yet again.) *growl* ...Um...\nDhurke:\nHah-ha ha ha ha ha! I guess seawater doesn't make for much of a meal!\nTrucy:\nIt's 'cause Polly didn't have any sushi!\nApollo:\n(Oh, yeah. I haven't eaten anything since this morning.)\nDatz:\n...Oh, that's right! Hey, AJ! Dhurke had me buy this for ya.\nApollo:\n!\nDhurke:\nThought you might be hungry. Ready to have some this time around?\nApollo:\n.........Yeah. Thanks! *chomp* *nom nom nom* Oh wow, this is delicious!\nDhurke:\nHah-ha ha ha ha ha! Glad you approve! I'd better get some before you eat them all! *chomp* *chew chew chew*\nApollo:\n(Just like old times. Dhurke used to slice up the fish he caught, and we'd all eat fresh sashimi together. He used to talk about all the vitamins and minerals packed in the raw fish.)\nDatz:\n*chomp* *munch munch munch* Hey, by the way! Lemme see that orb, AJ!\nApollo:\nHere you go.\nDatz:\nHoa, so that's what it looks like!\nTrucy:\nYou found the legendary treasure! Nice work, Polly!\nApollo:\nThanks. ...Guess you could say, mission accomplished!\nDhurke:\nWith the orb, our revolution can take a big step forward. Let's celebrate the eve of our revolution! We'll all get dressed up and feast till dawn!\nDatz:\nYeah! Now you're talkin'! Time to party!\nApollo:\n......... (After all that? I just want to go to bed. Sure wish Nahyuta was here. Maybe one day, we'll enjoy times like these together again. ...The revolution. If it can bring back those happy days... ...you can sign me up for--)\n???:\nSorry to interrupt your little party, but I'm here for my crystal.\nStaff:\nRight, left, right, left, HALT!\nApollo:\nAh! It's him again!\nAtishon:\nHeh heh heh. Well done. Then again, I always knew you could do it. After all, we politicians must be excellent judges of character. Still, I'm impressed you both made it out of there alive.\nApollo:\n...W-Wait a second. YOU'RE the one who shoved us into that pit?\nAtishon:\nIt sounds so bad when you say it like that. All I did was give you a little nudge in the right direction.\nDhurke:\n...So... it was you... ............................................................... You no good, son of a--!\nAtishon:\n...EEP! D-Don't look at me like that! The Crystal of Ami Fey is mine! Now, hand it over!\nDhurke:\nOver my dead body!\nAtishon:\nEEK! Detective! Help!\nEma:\nYeah yeah, I know.\nApollo:\nEma? What's going on here?\nEma:\nHe filed a police report. He claims you're trying to steal his family heirloom.\nAtishon:\nTh-That's him! The one with the long hair! Arrest him this instant! He's the thief that made off with the Atishon family's most precious heirloom!\nEma:\nWell, I suppose I should ask you to come in for questioning.\nDhurke:\nDown at the police station? I... think I'll pass. After all, Mr. Atishon seems bent on having me arrested on theft charges.\nApollo:\n(This is not good! If Dhurke gets arrested, he'll be sent back to Khura'in to face execution!)\nEma:\nSorry, but now that I know you have the crystal, or orb as you call it, I must insist. Will you please come with me, sir?\nApollo:\nApollo:\nEma! I'm afraid I can't let you take Dhurke in! He received the orb from Dr. Buff in a perfectly legal transaction.\nEma:\nIs that so? Can you prove it?\nApollo:\nOf course. This should sufficiently prove that the orb now belongs to Dhurke.\nPresent Orb Transfer Agreement\nApollo:\nLeads to:\n\"Take a look at this agreement.\"\nPresent anything else\nApollo:\nApollo:\nLook at this! It's proof that the orb is Dhurke's.\nEma:\nUmm... All this proves is you're completely our of your mind.\nApollo:\nOops... (I guess that wasn't it.) But the doctor definitely transferred it over to us.\nLeads back to:\n\"This should sufficiently prove that the orb now belongs to Dhurke.\"\nApollo:\nTake a look at this agreement.\nEma:\nWhat do we have here? Let's see... \"I agree to hand over the Founder's Orb to the Defiant Dragons if I will come to no harm.\" Hmm... It appears to be a perfectly legal agreement.\nAtishon:\nNot so fast! That's not the Founder's Orb! It's the Crystal of Ami Fey, which means their agreement is null and void!\nEma:\nHmm, this is going nowhere fast.\nApollo:\nYou can say that again.\n???:\nThen it will just have to go to trial. Right, Apollo?\nApollo:\nM-M-Mr. Wright?\nTrucy:\nDaddy!\nPhoenix:\nWhat's with you two? You look like you just saw a ghost.\nApollo:\n(...Oh yeah. Ema mentioned she had seen him around.) ...Um, what're you doing in Kurain Village, Mr. Wright?\nPhoenix:\nMr. Atishon has retained me as his lawyer.\nApollo:\nWait, you're his... lawyer?\nExamine\nMountains\nApollo:\nYou can see Mt. Mitama from here. We're lucky we found the Founder's Orb, and even luckier we got out of there alive. I hope I never have to go through anything like that again.\nTalk\nLegal advisor\nApollo:\nMr. Wright, why are you serving as Mr. Atishon's lawyer?\nPhoenix:\nBecause he hired me. He needed my help in getting a family heirloom back from Dr. Buff. And it seems he correctly foresaw that something like this might happen.\nAtishon:\nIt's because those shifty insurgents were harassing poor Dr. Buff. So I knew I might need a lawyer if things went south. I figured with a celebrated lawyer like Phoenix Wright, I couldn't go wrong.\nApollo:\nIs this what you came back from Khura'in for, Mr. Wright?\nPhoenix:\nIt was just good timing. My work over there just happened to wrap up, so here I am. Plus... Mr. Atishon is a very important client.\nApollo:\n(They know each other? But I've never heard Mr. Wright mention his name before.)\nThe Crystal of Ami Fey\nApollo:\nMr. Wright, are you sure this is Mr. Atishon's family heirloom?\nPhoenix:\nThat's my client's assertion. He says it's the Crystal of Ami Fey. Apparently, it's the crystal she once used when channeling spirits.\nApollo:\nWho's Ami Fey?\nPhoenix:\nShe brought Khura'inese channeling to Japan, and her descendants brought it here. Her true origins are still rather murky... ...but what's clear is she is the founder of the Kurain Channeling Technique.\nApollo:\nOh, so she's like the one they call the founder in Khura'in -- the Holy Mother.\nPresent\nAnything\nPhoenix:\nI'd think you would have more pressing things to ask me about.\nApollo:\nY-Yeah... (I'd better ask what I can while I can.)\nAfter clearing all Talk options:\nPhoenix:\n...Apollo, I don't plan to betray my client's confidence. I may not know all the facts yet, but I do know we won't be handing the crystal over to you.\nApollo:\nWhat? Are you saying...?\nPhoenix:\n.................. I'm really sorry it's come to this, but...\nApollo:\nMr. Wright? I don't understand.\nPhoenix:\nLet me spell it out then. If you continue to claim that the crystal belongs to your client... ...then I will be seeing you in court.\nApollo:\nWh-Wh-Whaaaaaaaaaaaaaat?!\nTrucy:\n...Wh-What's gotten into you, Daddy?\nPhoenix:\nNothing. This is strictly business.\nAtishon:\nHeh heh heh. Two lawyers from the same firm facing off? What are the odds! Lucky for me, I believe I have the \"right\" man for the job! What ever are you going to do? Remember, he IS your boss.\nApollo:\nNgrrrgh... (How did it come to this?!) M-Mr. Wright! Please! Don't do this!\nPhoenix:\nApollo, there's no point in arguing about it here... ...when it's now clear we're headed to court. That's where we'll find out who the crystal really belongs to.\nApollo:\n(I don't believe it. Am I really going to face Mr. Wright in court?)\nTrucy:\nDaddy! Apollo! No! We can't have our agency's talent competing against each other!\nPhoenix:\nIt's too late, Trucy. The die has been cast. We each have to fight for our clients' best interests.\nTrucy:\nB-But...\nPhoenix:\nSo, what's it going to be, Apollo. Are we going to have to take this to trial?\nApollo:\n(I have to battle Mr. Wright in court? THE legendary Phoenix Wright? No matter how many trials of his I've watched... ...no matter how dire the situation, he's always pulled out a win in the end. Can I do it? Can I really take on the man whose footsteps I've been following in...? I owe it to Dhurke to at least try. I... What should I do?)\nBattle Mr. Wright\nLeads to:\n\"There's no turning back now.\"\nThrow in the towel\nApollo:\n(I can't do this. I mean, how can I go up against a man like him? I couldn't possibly win! ...But do I really want to give up without a fight? If I do, I'll be forever walking in his shadow! Plus, I'd be letting Dhurke down! And I can't let that happen!)\nLeads to:\n\"There's no turning back now.\"\nApollo:\n(There's no turning back now.) If it's a trial you want, Mr. Wright, I'm more than happy to oblige! I'm ready to fight for my client... ...even if it means facing off against you!\nPhoenix:\n.................................... .................. ...All right. I won't be pulling any punches, either, Apollo. The kid gloves are officially off. May the best attorney win.\nApollo:\nYou got it!\nTrucy:\nWhoa whoa whoa! First Daddy, now you! Polly! You're not seriously...\nApollo:\n...Sorry, Trucy. But I have to do this.\nPhoenix:\n.................. Apollo... All right, then, I'd better go prepare for tomorrow. See you in court.\nTrucy:\nDaddy, no! Wait!\nDhurke:\nA fine mess I've gotten you into, son. I mean, of all the lawyers we could've faced, it had to be him? He's practically a celebrity in Khura'in now. They're calling him the Fighting Phoenix.\nApollo:\n...I-I'll be fine! (After all, I've come a long way, too! Who knows? I could even end up winning. There's always a chance...... right?)\nDhurke:\nYou know, this may be a blessing in disguise. If the trial proves what we found is indeed the Founder's Orb... ...then whoever asked Dr. Buff to study it may be revealed, too. This is our chance to finally pull them out of the shadows!\nApollo:\n...The first step of your revolution, huh?\nDhurke:\nYes. The revolution to restore Khura'in to its former glory, and save Nahyuta's soul!\nApollo:\nDhurke... I swear to fight as hard as I can in court to make that a reality. We're going to win this one. You'll see.\nDhurke:\nI know you can do it... son.\nApollo:\n(It doesn't matter that I'll be going up against Mr. Wright. I have to win this for Dhurke... ...and for Nahyuta. His salvation, along with all of Khura'in, depends on it!)\nTo be continued\nNothing to examine during investigation\nApollo:\nNothing particularly interesting here.\nArea already examined\nApollo:\nWe've already searched here, but it never hurts to take another look around.\nNothing to examine during fingerprinting session\nApollo:\nDoesn't look like there are any prints here.\nExamine insignificant area on evidence\nApollo:\n(Nothing particularly interesting here.)\nConsult (while opening puzzle box)\nApollo:\nHmm, this is harder than I imagined. I thought all we had to do was arrange the pictures according to the song.\nDhurke:\nIt's times like these you have to think outside the puzzle-box. Sometimes the truth can only be found when you look at things from a different angle.\nApollo:\nA different angle? (Come to think of it, one of the pictures from the song is missing. Does this mean the pictures don't line up exactly one-to-one?)",
  "characters": [
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Trucy Wright",
      "age": "• Age: 17",
      "description1": "A particular set of circumstances led to her being adopted by Mr. Wright. A world-class magician on the rise."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Athena Cykes",
      "age": "• Age: 19",
      "description1": "The youngest lawyer in our agency. She apparently studied psychology in Europe."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Phoenix Wright",
      "age": "• Age: 35",
      "description1": "My boss. He taught me a lot about what it means to be a lawyer."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Nahyuta Sahdmadhi",
      "age": "• Age: 25",
      "description1": "A prosecutor from Khura'in. He's also a monk, which explains why he's known as the \"Last Rites Prosecutor.\""
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Dhurke Sahdmadhi",
      "age": "• Age: 45",
      "description1": "Leader of the Defiant Dragons, and the man who raised me. He was a lawyer once."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Archie Buff",
      "age": "• Age: 64",
      "description1": "An archeologist in Kurain Village. He was asked by someone to study the Founder's Orb."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Datz Are'bal",
      "age": "• Age: 46",
      "description1": "A member of the Defiant Dragons, and Dhurke's right-hand man. He's always been one to laugh at just about anything."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Ema Skye",
      "age": "• Age: 27",
      "description1": "A detective. It looks like she finally became the forensics investigator she always wanted to be."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Paul Atishon",
      "age": "• Age: 25",
      "description1": "He's looking to represent Kurain Village. His remarkable self-confidence is blinding."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Sergeant Buff → Armie Buff",
      "age": "• Age: ? → 12",
      "description1": "The doctor's reclusive child. He lost his mother in a fire.",
      "description2": "The doctor's child. A self-styled sergeant. Her mother was ex-Russian military."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Pearl Fey",
      "age": "• Age: 18",
      "description1": "Ms. Maya Fey's cousin. She's also one of Kurain Village's spirit mediums. She's always really courteous."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Miles Edgeworth",
      "age": "• Age: 35",
      "description1": "Mr. Wright's best friend and the district's chief prosecutor. His frilly cravat makes a strong fashion statement."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Maya Fey",
      "age": "• Age: 28",
      "description1": "Mr. Wright's former assistant. She's currently training in Khura'in. I'm told she can channel the dead."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Inga Karkhuul Khura'in",
      "age": "• Age: 46",
      "description1": "Khura'in's Minister of Justice and the kingdom's second-in-command.",
      "description2": "Khura'in's Minister of Justice and the victim in this case."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Rayfa Padma Khura'in",
      "age": "• Age: 14",
      "description1": "Daughter of Ga'ran and princess of Khura'in who is more than a little spoiled."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Ga'ran Sigatar Khura'in",
      "age": "• Age: 43",
      "description1": "The grand priestess and queen of Khura'in. It's said that she can channel the dead."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Nayna",
      "age": "• Age: ?",
      "description1": "Rayfa's attendant. She disappeared all of a sudden after Minister Inga's death."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Ahlbi Ur'gaid",
      "age": "• Age: 9",
      "description1": "When not undergoing monastic training, this plucky kid works as a tour guide."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Amara Sigatar Khura'in",
      "age": "• Age: 44",
      "description1": "The previous queen. She is a spirit medium known as the grand priestess and possesses incredible spiritual power."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Trucy Wright",
      "age": "• Age: 17",
      "description1": "An aspiring magician and my daughter. I adopted her nine years ago."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Athena Cykes",
      "age": "• Age: 19",
      "description1": "The newest lawyer in my office with a background in psychology."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Apollo Justice",
      "age": "• Age: 24",
      "description1": "A reliable subordinate at my office. Serious and hot-blooded with vocal chords made of steel."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Nahyuta Sahdmadhi",
      "age": "• Age: 25",
      "description1": "A Khura'inese prosecutor and monk. He's also known as the \"Last Rites Prosecutor.\""
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Dhurke Sahdmadhi",
      "age": "• Age: 45",
      "description1": "Leader of the Defiant Dragons and Apollo's adoptive father."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Datz Are'bal",
      "age": "• Age: 46",
      "description1": "The Defiant Dragons' XO and Dhurke's right-hand man. He will laugh at just about anything."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Ema Skye",
      "age": "• Age: 27",
      "description1": "A detective with a love of science. She's finally achieved her dream of becoming a forensics investigator."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Miles Edgeworth",
      "age": "• Age: 35",
      "description1": "The district's chief prosecutor and my childhood friend. We used to go head-to-head back in his courtroom days."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Maya Fey",
      "age": "• Age: 28",
      "description1": "A practitioner of the Kurain Channeling Technique. We used to take on all sorts of cases together."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Inga Karkhuul Khura'in",
      "age": "• Age: 46",
      "description1": "Khura'in's Minister of Justice. He was killed during the hostage exchange."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Rayfa Padma Khura'in",
      "age": "• Age: 14",
      "description1": "A Khura'inist priestess and crown princess of Khura'in. Her Divination Séances show the last memories of the dead."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Ga'ran Sigatar Khura'in",
      "age": "• Age: 43",
      "description1": "The grand priestess and queen of Khura'in. It's said that she can channel the dead."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Nayna",
      "age": "• Age: ?",
      "description1": "Rayfa's attendant. She disappeared all of a sudden after Minister Inga's death."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Ahlbi Ur'gaid",
      "age": "• Age: 9",
      "description1": "When not undergoing monastic training, this plucky kid works as a tour guide."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Attorney's Badge",
      "description1": "My beloved attorney's badge. Wearing it gets me raring to go."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Founder's Orb",
      "description1": "A national treasure of the Kingdom of Khura'in. None but those of in the royal family have laid eyes on it.",
      "description2": "Heating the Founder's Orb revealed the statue within.",
      "description3": "The founder's form has appeared from within. It seems only the queen knows the founder's real name."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Photo of My Father",
      "description1": "A picture of my biological father, Jove Justice, who died in Khura'in."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Study Photo",
      "description1": "Atishon saw Datz fleeing the scene the night of the murder. One of the books is stained with coffee. [caption] The victim is lying in the study next to floor-to-ceiling windows with clear glass. He is covered by books."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Study Diagram",
      "description1": "A diagram of the doctors's study. Note the bookcase, large window, and second-floor area. [caption] There is a tree outside the large floor-to-ceiling window. On the other side of the window is the bookshelf."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Research Notes",
      "description1": "Research notes on the Song of Ceremony and the box containing the Founder's Orb."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Orb Transfer Agreement",
      "description1": "States: \"I agree to hand over the Founder's Orb to the Defiant Dragons if I will come to no harm.\""
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Sarge's Drone",
      "description1": "A helicopter drone operated by the doctor's kid. Equipped with a camera and a microphone."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Glowing Moss",
      "description1": "Stuck to the insole of the doctor's boot. It probably got there when he went to hide the Founder's Orb."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "E-Mail",
      "description1": "Data obtained from the doctor's computer. Includes a report on his research into the Founder's Orb. Found on the computer in Archie Buff's study, it was sent from Buff to \"PAW-711@nmail\" as a reply to an earlier email concerning his research into the Founder's Orb."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Doctor's Reading Glasses",
      "description1": "The doctor's poor eyesight meant he couldn't read anything without these. They were found on his desk."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Raincoat",
      "description1": "Seems the doctor wore this last night. Bears a distinctive yellow and green two-tone design."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Robbery Report",
      "description1": "A report filed a year ago by one Mr. Paul Atishon-Wimperson for the theft of the Crystal of Ami Fey."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Dr. Buff's Autopsy Report",
      "description1": "Dr. Buff was struck with the corner of some object. The time of death is between 10 and 11 PM."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Armie's Statement",
      "description1": "She'd fled to her room when she realized someone had moved her while she'd been unconscious on the second floor."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Inga's Autopsy Report",
      "description1": "Stabbed from behind. Cause of death is blood loss. Time of death is approximately 3 PM."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Tomb Diagram",
      "description1": "A diagram of the crime scene. Amara's sarcophagus is in the very center of the room."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Tomb Crime Photo",
      "description1": "A photo of Inga's body. He was stabbed in the back with a knife."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Gemstone",
      "description1": "Inga's button, discovered in the ashes of the tomb's incense burners. Caked in soot."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Pink Butterfly Pendant",
      "description1": "A pendant adorned with a pink butterfly. Seems it belongs to Dhurke. Stained with the victim's blood.",
      "description2": "A locket found at the crime scene. It actually belongs to Amara."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Mysterious Bloodstain",
      "description1": "A bloodstain from Amara's Tomb. Analysis reveals that it's Dhurke's blood."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Painkiller Shots",
      "description1": "The medication Inga used for his back pain. Said to make the pain disappear."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Inga's Notepad",
      "description1": "A notepad used by Inga. People's characteristics are written inside."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Woman's Photo",
      "description1": "A photo showing Dhurke and Amara's life on the run about 23 years ago."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Channeling Photo",
      "description1": "A picture taken at around 2 PM of the channeling rite."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Ahlbi's Statement",
      "description1": "At around 2 PM, Shah'do was surprised by a firecracker, ran into the courtyard, and stole Nayna's hat."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Amara's Assassination File",
      "description1": "A file containing a ton of info on the assassination of Amara Sigatar Khura'in."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Dhurke's Law Book",
      "description1": "A document establishing the Defense Culpability Act in the name of the queen."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Dhurke's Badge",
      "description1": "The symbol of Dhurke's creed: \"A dragon never yields.\" Nahyuta never confiscated it."
    },
    {
      "currentChapter": "Turnabout Revolution",
      "name": "Dhurke's Corpse Photo",
      "description1": "More than three days have passed since his death death. He was shot three times in the chest."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "The police have had their eye on Dr. Buff for some time.",
          "person": "Ema",
          "present": []
        },
        {
          "testimony": "And just today, a number of stolen artifacts were discovered in his study.",
          "person": "Ema",
          "present": []
        },
        {
          "testimony": "Among them were a priceless urn and a statue that were stolen from the Fey clan.",
          "person": "Ema",
          "present": []
        },
        {
          "testimony": "It seems the doctor would do anything to study artifacts, including steal them.",
          "person": "Ema",
          "present": []
        },
        {
          "testimony": "As for the relic at the center of this dispute, he likely stole it from the Atishon residence.",
          "person": "Ema",
          "present": [
            "E-Mail"
          ],
          "source": {
            "evidence_span": "it was sent from Buff to \"PAW-711@nmail\" as a reply to an earlier email concerning his research into the Founder's Orb",
            "testimony_span": "he likely stole it from the Atishon residence",
            "explanation": "\"PAW\" in the email likely stands for Paul Atishon-Wimperson, the plaintiff. This suggests that the plaintiff is aware of of the defendant's research into the artifact. Therefore, the defendant could not have stolen the artifact from the plaintiff's residence.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        }
      ],
      "noPresent": false,
      "summarized_context": "The witness Ema explains the police's suspicion towards Dr. Buff the defendant.",
      "labels": [
        "spelling",
        "behavior"
      ],
      "reasoning": [
        "Fact 1: The witness claims the defendant stole the artifact from the plaintiff's residence.",
        "Fact 2: The evidence suggests the defendant replied to an email from \"PAW-711@nmail\" regarding his research into the artifact.",
        "Prop 1: \"PAW\" in the email likely is an acronym of Paul Atishon-Wimperson, the plaintiff.",
        "Prop 2: If a person replies to another person regarding a subject, the other person has been aware of the subject.",
        "Prop 3: If a person is aware of an artifact being studied, the artifact cannot have been stolen from that person."
      ],
      "newContext": "Turnabout Revolution\n\n\n\n\n\n\n\n\n\nImage Gallery\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 4May 17, 10:08 AMDistrict Court - Defendant Lobby No. 3Trucy:\nJust so you know... I'm not going to take sides!Apollo:\nMessage received, loud and clear.Trucy:\nGood, because I don't like this one bit! You and Daddy should be on the same team!Apollo:\nS-Sorry, Trucy... (Wow, she's really mad.)Dhurke:\nI'm sorry, too, little lady. This is all my fault.Trucy:\nI'm just worried things will never be the same between Daddy and Apollo... ...if they go through with this.Dhurke:\nIs that all? Well, I wouldn't worry about that. That's the way it is with us men. We may fight, but we don't burn bridges.Trucy:\nReally?Dhurke:\nSure. One minute we're trading blows, and the next, we're having drinks together. We're simple creatures at heart. Hah-ha ha ha ha ha!Trucy:\nI sure hope you're right...Athena:\nSorry I'm late, Apollo!Apollo:\nAthena! There you are! What happened with you and Mr. Wright yesterday?Athena:\nO-Oh, about that... I ended up going to the wrong airport. I was waiting there, thinking his flight was really late... and before I knew it, I dozed off. By the time I woke up, it was already dark.Apollo:\nI figured something like that had happened. Being late and dozing off are the two things you do best.Athena:\nUgh. Guilty as charged.Apollo:\nSo then, I take it you have no idea what today's case is about?Athena: \nNot a clue. Sorry... Um, what IS today's case about, if I might ask? Another locked-room mystery? A suspect with a flimsy alibi? Ooh, or a dying message?Apollo:\nSorry, strike three, you're out. It's a civil case.Athena: \n...A civil case?Apollo:\nYou act like I'm speaking Swahili here.Athena: \nIt's just, the Wright Anything Agency specializes in criminal law, or so I thought. In civil cases, there are no prosecutors, right? Instead, both parties retain an attorney.Apollo:\nRight. And the other attorney is someone you know very well.Athena: \nReally? Who?Bailiff:\nThe trial will begin shortly. Please proceed to the courtroom at once.Apollo:\n(...Okay, let's do this!)Athena: \nApollo, wait. Who's the other attorney? And where is Mr. Wright?Apollo:\nNo time to explain. Let's go.Athena: \nO-Okay! Right behind you!May 17, 10:30 AMDistrict Court - Courtroom No. 6Judge: \nCourt is now in session. Oh, um... Uh, is this some sort of practice session? A mock trial, perhaps?Apollo:\nUm... no. No, it's not, Your Honor.Phoenix:\nIt's the real deal, Your Honor.Judge: \nHmm... So then you two have had a falling out? I won't have you use my courtroom for that, you know!Apollo:\nI-It's nothing like that, Your Honor!Phoenix:\nExactly. It just so happens that we have different clients in this case.Judge: \nI see... Well, here's to hoping this has no adverse effect on your working relationship.Athena: \nYou can say that again! I had no idea we'd be going up against the boss today! Ugh... You sure this is a good idea, Apollo?Apollo:\n...What? Do you want to switch sides?Athena: \nHonestly, I'd rather be anywhere but here right now.Apollo:\n(Well, at least she IS here. I'm really going to need her help.)Phoenix:\n...Mr. Justice.Apollo:\nYes?!Phoenix:\nDon't expect me to pull any punches just because you're the opposing lawyer. As I said, the kid gloves are off, and come what may, they'll stay off.Apollo:\n...Same here, Mr. Wright! If it's a fight you want, it's a fight you'll get!Phoenix:\n..................Apollo:\n..................Athena: \nYeesh, you guys are really chomping at the bit, aren't you?Judge: \nHmm... I don't mind a good fight between co-workers. Just keep this civil case civil. Now then, if the plaintiff would take the stand, we may begin.Staff:\nRight, left, right, left, HALT!Atishon:Noble judge, members of the gallery! Good day to you! I am Paul Atishon! This is but the start of my epic campaign! And you all have the honor of witnessing it! I believe the youth of this country are our very future. Too long have they been looked down on and given the cold shoulder! So, to them I say! Ask not what you can do for your country! Ask what you can do for me!Judge:\nM-Mr. Atishon! What is that crazy contraption you're riding in?!Atishon:\nHeh heh heh. It's my custom-made, election-winning campaign mobile. Beautiful, isn't it?Judge:\nYou're at a witness stand, not a campaign podium. So come out of there this instant!Atishon:\nFeh...Judge:\nAll right. Now, would the plaintiff's attorney, Mr. Wright... ...please explain the complaint filed against the defendant.Phoenix:\nMr. Atishon's complaint against the defendant is simple. The defendant, one Dhurke Sahdmadhi... ...stole my client's family heirloom -- the Crystal of Ami Fey. Mr. Atishon merely seeks its return.Atishon:\nThis wouldn't have happened if that archeologist hadn't kicked the bucket.Judge:\n...I see. Well, Mr. Justice, let's have your opening statement, if you would.Apollo:\nThe defense asserts the item in question is the Founder's Orb, a sacred relic from Khura'in.Judge:\nHmm... Go on.Apollo:\nIt seems someone asked an archeologist -- Dr. Archie Buff -- to study the orb. Dr. Buff determined that it was a Khura'inese national treasure known as the Founder's Orb. The very orb that was stolen from a treasure room in Khura'in several weeks ago.Judge:\nWhy yes, I saw a news report about that! The theft of a Khura'inese national treasure caused quite an uproar in the kingdom.Apollo:\nWell, we believe it was not, in fact, a theft in the traditional sense. But rather, that it was spirited out of Khura'in by someone for Dr. Buff to study.Judge:\nYou don't say... And...?Apollo:\nAround that time, an acquaintance of the defendant learned of Dr. Buff. He made contact with the doctor, who agreed to hand over the orb. Apparently, the doctor wanted nothing to do with it once he'd learned it had been stolen.Judge:\nHmm... It seems you even have a transfer agreement between both parties.Apollo:\nMr. Sahdmadhi also agreed to return the Founder's Orb to the Kingdom of Khura'in... ...once the doctor verified it was the real thing.Judge:\nI see... So this dispute centers on... ...whether the item is the Founder's Orb or the Crystal of Ami Fey. That, in turn, will determine the object's rightful owner.Apollo:\n(I'd better bring my A game. Going up against Mr. Wright won't be a walk in the park.)Judge:\nHmm... Come to think of it, the name Dhurke Sahdmadhi sounds awfully familiar. But I can't recall where I've heard it.Apollo:\n...Oh. umm, it's probably your imagination, Your Honor. He's just a tourist, after all.Judge:\nHmm... My imagination, you say?Athena: \nAre you sure about this, Apollo? He's a wanted criminal in Khura'in, isn't he?Apollo:\n...In Khura'in, yes. Here, he's just a tourist.Judge:\nVery well, let's begin the proceedings. Bailiff, would you bring in the first witness?Apollo:\n...Ema?Ema:\nShow some manners. We're in court.Apollo:\nI know, it's just... This is a civil trial, so I was surprised to see a detective take the stand.Phoenix:\nI had her do some digging on Dr. Buff.Apollo:\n(What for?)Ema:\nYou disappoint me, Apollo. First, you know I'm not just a detective. I'm a forensic scientist. Do try to remember that. Second, you owe Mr. Wright an apology. After all he's done for you, you have some nerve!Apollo:\nFirst, I'm sorry. And second, I'm really just trying to do my job.Ema:\nYou'll never get anywhere with that attitude. Take some advice from someone who's been there.Apollo:\nWhy do I feel like I'm on trial here?Judge:\nDetective Skye, your testimony, if you please.Witness Testimony-- The Doctor's Dark Secret --Ema:\nThe police have had their eye on Dr. Buff for some time.\nAnd just today, a number of stolen artifacts were discovered in his study.\nAmong them were a priceless urn and a statue that were stolen from the Fey clan.\nIt seems the doctor would do anything to study artifacts, including steal them.\nAs for the relic at the center of this dispute, he likely stole it from the Atishon residence.Apollo:\nThe doctor... is a thief? Why am I just hearing about this now?Ema:\nWell, \"cat burglar\" isn't something he'd put on his résumé. He was more careful than that. But the fact is, he was a classic treasure hunter.Athena:\nA treasure hunter, huh... Like people who have thrilling adventures in exotic places, risking life and limb for glory?Apollo:\nI doubt Dr. Buff was the star of his own hit movie series, Athena.Phoenix:\nOut of respect for the dead, I will say that Dr. Buff wasn't doing it to get rich. Apparently, he only wanted to borrow artifacts to study them. He would then return them as soon as his research was finished.Ema:\nAccording to the doctor's child... ...he would even repair or restore some of the artifacts he stole before returning them. He believed he was honoring the dead by discovering their history through artifacts. But whatever lofty ideals he had, it makes no difference. Larceny is larceny.Judge:\nYes, he certainly sounds no different than a regular thief to me.Apollo:\nSo, let's say for a moment that the doctor really did moonlight in stealing artifacts... Might he not have stolen the Founder's Orb in Khura'in and brought it back here himself?Phoenix:\nNope. There's no records of him traveling overseas over the past few years. Plus, he couldn't very well leave his reclusive child at home all alone.Judge:\nHmm... Then this really must be the Crystal of Ami Fey.Phoenix:\nYes. He stole it from the Atishon residence, probably so he could study it.Apollo:\n......... (This is the left hook I did not need.)Athena:\nI bet you never saw that coming, Apollo.Apollo:\nYeah, when Mr. Wright said the kid gloves were off, he wasn't kidding.Phoenix:\n.........Judge:\nMr. Justice, you may proceed with your cross-examination.Cross ExaminationCross Examination-- The Doctor's Dark Secret --Ema:\nThe police have had their eye on Dr. Buff for some time.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHow exactly did Dr. Buff arouse the suspicion of the police anyway?\nEma:\nChalk it up to good, old-fashioned sleuthing. After investigating countless artifact thefts over the years... ...the police finally zeroed in on him, and the doctor became their prime suspect.\nPhoenix:\nA number of those artifact thefts occurred in Kurain Village, too, if I might add. And they started right around the time the doctor moved there.\nApollo:\nBut he was never arrested. I take it there was nothing concrete linking him to a crime?\nEma:\nNo. Which is why we were never able to get a search warrant in the first place. It's hard to arrest artifact thieves unless you catch them red-handed. Still, the police had him under constant surveillance.Ema:\nAnd just today, a number of stolen artifacts were discovered in his study.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nAre you sure these allegedly stolen artifacts are the real deal?\nEma:\nThey're not fakes, that's for sure. Take the urn, for example. Apparently, it's an extremely intricate work of art. Its design, cracks, and other features would be impossible to replicate perfectly.\nPhoenix:\nActually, I've had a few run-ins with that urn myself. So I was shocked to see it there in the doctor's study. I can say without a doubt, that that urn was stolen from the Fey clan.\nApollo:\nI-I see...\nJudge:\nDetective Skye, please continue your testimony, if you would.Ema:\nAmong them were a priceless urn and a statue that were stolen from the Fey clan.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWere any other stolen artifacts found besides those belonging to the Feys?\nEma:\nYes. For instance... Remember the large relief on the wall? It was chiseled out some ancient ruins in the Kingdom of Khura'in several years ago.\nApollo:\nCh-Chiseled out...? Didn't that damage it?\nEma:\nWell, he did restore the parts that were so faded you could barely see them anymore. It seems he intended to return it someday, so one could say his intentions were good. But good intentions are no get-out-of-jail-free card. That's a fact. \nPhoenix:\nIf I might add, with respect for the deceased... ...the quality of the restorations was apparently exceptional. It seems the doctor invested a lot of money in hiring an extremely talented specialist.\nAthena:\nHe sounds like a good man... who took a wrong turn somewhere.\nApollo:\n(I guess Sarge takes after him in that way.)\nEma:\nAny further questions? If not...Ema:\nIt seems the doctor would do anything to study artifacts, including steal them.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHad these alleged thefts been going on for some time?\nEma:\nAt least five years, as far as we can tell. All the recent thefts had been local... ...but before moving to Kurain Village, he had been stealing from ruins around the world.\nApollo:\n(Dr. Buff was an international criminal?)\nEma:\nThis data lends itself to but one conclusion: Dr. Buff was a thief.Ema:\nAs for the relic at the center of this dispute, he likely stole it from the Atishon residence.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou claim he stole a family heirloom from the Atishon residence. But claiming something doesn't make it true.\nEma:\nUnfortunately, it IS true. \nApollo:\nHow can you be so sure?\nEma:\nA police report was filed concerning the theft -- one year ago, in fact.\nApollo:\nWhat?! A whole year ago?\nEma:\nAugust 25 of last year, to be exact. The report state, and I quote... \"The Crystal of Ami Fey was discovered to be missing... ...from the Atishon storehouse at 10 AM. The storehouse lock had been picked. Signed, Paul Atishon-Wimperson.\"\nJudge:\nWell, a year-old report certainly lends the the plaintiff's claim credence. The doctor could really have stolen the Crystal of Ami Fey.\nPhoenix:\nNot only that, Your Honor... ...but the Founder's Orb was only found to be missing several weeks ago. That is nearly a year after the crystal's theft was reported. Therefore, I believe we must consider the orb and the crystal to be two separate items.\nApollo:\n.........\nAthena:\nPaul Atishon-Wimperson? Not the most awe-inspiring tail end, is it? I see why he cut it.\nApollo:\nNot that he inspires confidence without it. Still, I'd probably do the same in his shoes.\nRobbery Report added to the Court Record.Press (subsequent times)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThis police report say say the \"Crystal of Ami Fey,\" but... ...how do you know it's this relic right here?\nEma:\nBecause Mr. Atishon has stated as much.\nApollo:\n(...Well, I'm not buying it.)\nAthena:\nApollo, I was thinking... The plaintiff's legal name is pretty distinctive. Paul Atishon-Wimperson... Do we have any evidence related to his initials or his name?\nApollo:\nWe just might. It might even point out a flaw in something Ema said.\nAthena:\nYou think her logic's faulty?\nApollo:\nYeah. If the doctor stole the relic from Mr. Atishon... er, Mr. Atishon-Wimperson... ...then there's one thing the doctor did that doesn't make any sense.\nAthena:\nEspecially if Paul Atishon-Wimperson was desperately searching for his stolen relic.\nApollo:\n(Okay, time to go over the evidence again.)Present E-Mail (after pressing fifth statement)\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"The doctor stole the relic from the plaintiff?\"Before pressing fifth statement\n\n\n\n\n\n\n\nAthena:\nThe trial's barely started and we're already backed into a corner.\nApollo:\nTo make matters worse the judge seems to agree with the plaintiff's case. But we've still got to give it our all.After pressing fifth statement\n\n\n\n\n\n\n\nAthena:\nA police report was filed about the crystal's theft a year ago.\nApollo:\nBut the theft of the Founder's Orb was only reported a few weeks ago. So the crystal's report was filed way before the orb was found missing.\nAthena:\nThat suggests the stolen relic is the Crystal of Ami Fey, as Mr. Atishon-Wimperson asserts. Hmm... I doubt the police report is a fake. After all, Ema is the one who submitted it as evidence.\nApollo:\n(Still, I feel like something we learned in the police report is important somehow...)"
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "My ancestor was praised as a benevolent ruler.",
          "person": "Atishon",
          "present": []
        },
        {
          "testimony": "He protected the spirit mediums, a minority back then, from the rest of the locals.",
          "person": "Atishon",
          "present": []
        },
        {
          "testimony": "Some discriminated against them, you see, while others tried to abuse their power.",
          "person": "Atishon",
          "present": []
        },
        {
          "testimony": "As thanks, Ami Fey gave the crystal she had specially made as a gift to him.",
          "person": "Atishon",
          "present": [
            "Research Notes"
          ]
        },
        {
          "testimony": "I am a descendent of that great lord.",
          "person": "Atishon",
          "present": []
        },
        {
          "testimony": "As such, my political power and influence is backed by centuries of history!",
          "person": "Atishon",
          "present": []
        }
      ],
      "noPresent": true,
      "newContext": "-- The Doctor's Dark Secret --Ema:\nThe police have had their eye on Dr. Buff for some time.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHow exactly did Dr. Buff arouse the suspicion of the police anyway?\nEma:\nChalk it up to good, old-fashioned sleuthing. After investigating countless artifact thefts over the years... ...the police finally zeroed in on him, and the doctor became their prime suspect.\nPhoenix:\nA number of those artifact thefts occurred in Kurain Village, too, if I might add. And they started right around the time the doctor moved there.\nApollo:\nBut he was never arrested. I take it there was nothing concrete linking him to a crime?\nEma:\nNo. Which is why we were never able to get a search warrant in the first place. It's hard to arrest artifact thieves unless you catch them red-handed. Still, the police had him under constant surveillance.Ema:\nAnd just today, a number of stolen artifacts were discovered in his study.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nAre you sure these allegedly stolen artifacts are the real deal?\nEma:\nThey're not fakes, that's for sure. Take the urn, for example. Apparently, it's an extremely intricate work of art. Its design, cracks, and other features would be impossible to replicate perfectly.\nPhoenix:\nActually, I've had a few run-ins with that urn myself. So I was shocked to see it there in the doctor's study. I can say without a doubt, that that urn was stolen from the Fey clan.\nApollo:\nI-I see...\nJudge:\nDetective Skye, please continue your testimony, if you would.Ema:\nAmong them were a priceless urn and a statue that were stolen from the Fey clan.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWere any other stolen artifacts found besides those belonging to the Feys?\nEma:\nYes. For instance... Remember the large relief on the wall? It was chiseled out some ancient ruins in the Kingdom of Khura'in several years ago.\nApollo:\nCh-Chiseled out...? Didn't that damage it?\nEma:\nWell, he did restore the parts that were so faded you could barely see them anymore. It seems he intended to return it someday, so one could say his intentions were good. But good intentions are no get-out-of-jail-free card. That's a fact. \nPhoenix:\nIf I might add, with respect for the deceased... ...the quality of the restorations was apparently exceptional. It seems the doctor invested a lot of money in hiring an extremely talented specialist.\nAthena:\nHe sounds like a good man... who took a wrong turn somewhere.\nApollo:\n(I guess Sarge takes after him in that way.)\nEma:\nAny further questions? If not...Ema:\nIt seems the doctor would do anything to study artifacts, including steal them.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHad these alleged thefts been going on for some time?\nEma:\nAt least five years, as far as we can tell. All the recent thefts had been local... ...but before moving to Kurain Village, he had been stealing from ruins around the world.\nApollo:\n(Dr. Buff was an international criminal?)\nEma:\nThis data lends itself to but one conclusion: Dr. Buff was a thief.Ema:\nAs for the relic at the center of this dispute, he likely stole it from the Atishon residence.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou claim he stole a family heirloom from the Atishon residence. But claiming something doesn't make it true.\nEma:\nUnfortunately, it IS true. \nApollo:\nHow can you be so sure?\nEma:\nA police report was filed concerning the theft -- one year ago, in fact.\nApollo:\nWhat?! A whole year ago?\nEma:\nAugust 25 of last year, to be exact. The report state, and I quote... \"The Crystal of Ami Fey was discovered to be missing... ...from the Atishon storehouse at 10 AM. The storehouse lock had been picked. Signed, Paul Atishon-Wimperson.\"\nJudge:\nWell, a year-old report certainly lends the the plaintiff's claim credence. The doctor could really have stolen the Crystal of Ami Fey.\nPhoenix:\nNot only that, Your Honor... ...but the Founder's Orb was only found to be missing several weeks ago. That is nearly a year after the crystal's theft was reported. Therefore, I believe we must consider the orb and the crystal to be two separate items.\nApollo:\n.........\nAthena:\nPaul Atishon-Wimperson? Not the most awe-inspiring tail end, is it? I see why he cut it.\nApollo:\nNot that he inspires confidence without it. Still, I'd probably do the same in his shoes.\nRobbery Report added to the Court Record.Press (subsequent times)\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThis police report say say the \"Crystal of Ami Fey,\" but... ...how do you know it's this relic right here?\nEma:\nBecause Mr. Atishon has stated as much.\nApollo:\n(...Well, I'm not buying it.)\nAthena:\nApollo, I was thinking... The plaintiff's legal name is pretty distinctive. Paul Atishon-Wimperson... Do we have any evidence related to his initials or his name?\nApollo:\nWe just might. It might even point out a flaw in something Ema said.\nAthena:\nYou think her logic's faulty?\nApollo:\nYeah. If the doctor stole the relic from Mr. Atishon... er, Mr. Atishon-Wimperson... ...then there's one thing the doctor did that doesn't make any sense.\nAthena:\nEspecially if Paul Atishon-Wimperson was desperately searching for his stolen relic.\nApollo:\n(Okay, time to go over the evidence again.)Present E-Mail (after pressing fifth statement)\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"The doctor stole the relic from the plaintiff?\"Before pressing fifth statement\n\n\n\n\n\n\n\nAthena:\nThe trial's barely started and we're already backed into a corner.\nApollo:\nTo make matters worse the judge seems to agree with the plaintiff's case. But we've still got to give it our all.After pressing fifth statement\n\n\n\n\n\n\n\nAthena:\nA police report was filed about the crystal's theft a year ago.\nApollo:\nBut the theft of the Founder's Orb was only reported a few weeks ago. So the crystal's report was filed way before the orb was found missing.\nAthena:\nThat suggests the stolen relic is the Crystal of Ami Fey, as Mr. Atishon-Wimperson asserts. Hmm... I doubt the police report is a fake. After all, Ema is the one who submitted it as evidence.\nApollo:\n(Still, I feel like something we learned in the police report is important somehow...)Apollo:\nThe doctor stole the relic from the plaintiff? Are you sure? Because that statement doesn't agree with a certain piece of evidence.Ema:\nWhat do you mean?Apollo:\nTake a look at this.Ema:\nWhat about it?Apollo:\nThis contains an e-mail from the doctor's computer.Judge:\n...E-mail? In that little piece of plastic? ......... I'm afraid I don't understand.Apollo:\nOh, umm... This stick here can store all sorts of computer data.Judge:\nI still don't get it.Apollo:\nH-Here, just look at this! Apparently, the doctor was reporting his research findings to a certain individual. Now, take a look at this. It's the police report that Detective Skye presented to this court. You can see the plaintiff's legal name on it. Paul Atishon-Wimperson.Judge:\nI can see why'd he drop \"Wimperson\" from his name, but that's hardly breaking news.Apollo:\nLook closer, Your Honor.Phoenix:\n.........Ah! H-His initials!Apollo:\nRight. The plaintiff's full legal name is Paul Atishon-Wimperson. Now consider this... The e-mail's recipient address starts with three letters.Ema:\nP-A-W...? Ahhhhhhhhhhhhhhh! Don't tell me--!Apollo:\nOh, but I will anyway. The individual who hired the doctor to study the disputed item... ...is none other than Paul Atishon-Wimperson.Ema:\nWait, th-then that means...Apollo:\nExactly. He wouldn't have asked the man who stole his family heirloom to study it. Therefore, how could this possibly be the Crystal of Ami Fey?!Ema:\nAHHHHHHHHHHHHHHH! ...We never checked the doctor's e-mails. We couldn't even figure out the password to his computer.Apollo:\nThe plaintiff willingly left the orb in the doctor's care so he could study it... ...at the behest of his \"benefactor\"!Ema:\n...Wait. Then what about the police report? I have all the details of the theft right here!Apollo:\nIt's probably for another relic -- the real Crystal of Ami Fey. He's just using the report as a way to claim that our orb is actually his stolen crystal.Phoenix:Phoenix:\nAnd how are you certain that \"PAW\" refers to my client's initials? Maybe the e-mail's recipient was a dog lover.Apollo:\nPerhaps. So let's get to know your client a little better, shall we? Mr. Paul Atishon-Wimperson!Atishon:\nFeh. I suppose shutting down detractors is all part of a politician's job.Apollo:\nAnswer me this, Mr. Atishon-Wimperson: what is...Your shoe size?\n\n\n\n\n\n\n\nApollo:\nWhat's your shoe size?\nAtishon:\nHow should I know?\nApollo:\nWait, you don't know your own shoe size?\nAtishon:\nI have all my shoes handcrafted in Italy. And the shoemaker comes to my residence to take the necessary measurements. I have better things to do than memorize trivial information like that.\nApollo:\n(Makes we wish I'd memorized the Italian for \"entitled jerk.\")\nJudge:\nMaybe this will help you memorize what happens to those who waste the court's time.\nApollo:\n(I really put my foot in it this time.)\nAthena:\nApollo, no matter what his shoe size is, there wouldn't be enough digits. We're looking for a three-digit number.\nApollo:\nOh, right. Let's see...\nLeads back to:\n\"Answer me this, Mr. Atishon-Wimperson: what is...\"Your favorite food?\n\n\n\n\n\n\n\nApollo:\nWhat's your favorite food?\nAtishon:\nCurry rice. It's an old family favorite.\nApollo:\nReally? As in, boil up some rice and dump some curry sauce on top? THAT curry rice?\nAtishon:\nHeh, I bet you assumed I would say French cuisine... ...just because I'm a member of the political elite. But nothing beats the delectable curry recipe my ancestors bright over from Japan. And I'm the kind of representative who upholds the value of such traditions!\nApollo:\n(Is his entire strategy really just to pander to \"traditional values\" voters?)\nJudge:\nYour penalty is served, Mr. Justice. Let this be some food for thought!\nAthena:\nApollo, why don't we take another look at the e-mail address?\nApollo:\nNo, it's fine! I just need another crack at this.\nLeads back to:\n\"Answer me this, Mr. Atishon-Wimperson: what is...\"Your birthday?\n\n\n\n\n\n\n\nLeads to:\n\"What is your birthday?\"Apollo:\nWhat is your birthday?Atishon:\nMy birthday? It's July 11th, but what's it to you? (Changed from [My birthday? It's July 11, but what's it to you?] in the original release) ...Oh, I see. You can address birthday gifts to my office. But, full disclosure... I only accept gifts valued at one thousand dollars or more. (Changed from [But, full disclosure... I only accept gifts valued at $1,000 or more.] in the original release)Phoenix:\n.........Judge:\n.........Atishon:\n...Hm? Why has everyone gone silent?Apollo:\n(How can anyone be that self-centered? Oh, right... politician.) Did everyone hear that? He said, \"July 11th.\" (Changed from [He said, 'July 11.'] in the original release) July 11 -- or rather, \"711\" -- matches the numbers in the e-mail address. Both the name and birthday are a match! I hardly think that's a coincidence!Atishon:\n.........Wait... Why you sneaky little--!Apollo:\n(Looks like someone finally decided to join the conversation.) Would the plaintiff care to explain?Atishon:\nI-I would like to say... that is q-quite...Apollo:\nQuite what?Atishon:\nQ-Quite... a thing... you've said. .........Apollo\nUm... Any other thoughts?Atishon:\nNo further comments. I stand by my previous statement.Apollo:Apollo:\nYou can't just walk away. Even politicians have to explain themselves in a court of law!Atishon:\n...I'm afraid I simply don't know how it happened. I can't possibly explain matters out of my purview. Perhaps it was a mistake on the part of my secretary?Apollo:\n(Oh no you don't, you slippery eel.) Mr. Wright, would you care to respond?Phoenix:\n...I won't argue your assertion. My client lent the treasure in question to the doctor and asked him to study it. It seems that much is a fact.Apollo:\n(Now we're getting somewhere!)Phoenix:\nHowever, it has no bearing on the issue of ownership.Apollo:\n...How so?Phoenix:\nMr. Atishon, I fully understand your position here. You HAD to hide the fact that you sent the crystal out to be studied. Your family would've been very upset if they had found out. It's a family heirloom, after all.Apollo:\nYou've got to be kidding me!Atishon:\nMr. Wright is, well, right, of course. But then, he always is. That's why he's my lawyer. The crystal is a precious Atishon family heirloom, and has been for centuries. But Dr. Buff was so eager to study its proud heritage, I just couldn't say no. I didn't even tell my grandfather.Apollo:Apollo:\nBut in order to win the backing of your so-called \"benefactor\"... ...you were going to give what you claim to be the Crystal of Ami Fey to that person? You were going to give a precious family heirloom away, just like that?Atishon:\n...I-I was going to explain everything to grandfather later! Honest!Phoenix:\nMy client's grandfather is very proud of his grandson for following in his footsteps. And if refusing him would've meant dashing the dreams of his darling grandson... ...I doubt the kindly old man could've said no.Judge:\nWell, grandchildren ARE meant to be spoiled. That's what grandfathers are for.Apollo:\nYour Honor... Please. (I mean, it's been in the family for centuries.)Atishon:\nMy grandfather thinks highly of my talents as a politician. That's why he entrusted me with this very important name placard today. So I'm sure he would've been okay with me using the crystal as I saw fit.Apollo:\n(Grrr... Grandpa's spoiled little brat.)Athena:\nI think the judge is buying it, Apollo.Apollo:\nNo surprise there. He's always going on and on about his own grandchild, after all.Ema:\n...Excuse me. Can I leave now, Mr. Wright? I believe my work here is done.Phoenix:\nBy all means, Detective Skye. Thank you for your assistance.Ema:\nYou're welcome. It's nice to testify at a civil trial once in a while. See you around.Judge:\nHmm... It seems the facts have changed somewhat. Mr. Atishon-Wimperson apparently lent his family heirloom to Dr. Buff. Mr. Justice. How would the defense like to proceed?Apollo:\nOh, umm... (All right, now what?)Athena:\nApollo, let's hear what what they know about this so-called \"Crystal of Ami Fey.\" Maybe we can find some inconsistencies in their statements.Apollo:\nRight... Okay then, Mr. Wright. If the item in question really is an Atishon family heirloom... ...then let's hear all your client knows about it.Phoenix:\n...Of course. Mr. Atishon-Wimperson? Please tell the defense everything you know about the crystal's origin.Atishon:\nAll right. Now then, listen and learn. This is the tale of the Crystal of Ami Fey, and the illustrious history of the Atishon clan! Are you ready? Our story begins back in the old country, when the Atishon family reigned supreme...Witness Testimony-- The Illustrious History of the Atishon Clan --Atishon:\nMy ancestor was praised as a benevolent ruler.\nHe protected the spirit mediums, a minority back then, from the rest of the locals.\nSome discriminated against them, you see, while others tried to abuse their power.\nAs thanks, Ami Fey gave the crystal she had specially made as a gift to him.\nI am a descendent of that great lord.\nAs such, my political power and influence is backed by centuries of history!Apollo:\n(Well, that devolved into a great load of self-aggrandizing propaganda fast.)Phoenix:\nAs you can see... ...the Crystal of Ami Fey is an heirloom of the esteemed House of Atishon.Apollo:\nAnd you have proof that it has always been in the Atishon family?Phoenix:\n...I have someone who gave a statement to that effect. My client's neighbor -- one Ives Shineto, age eighty-five -- gave the following statement: (Changed from [My client's neighbor -- one Ives Shineto, age 85 -- gave the following statement:] in the original release) \"The Atishons showed me the Crystal back when I was but a lad.\"Apollo:Apollo:\nCan we really trust the memory of an old man?Phoenix:\n...Mr. Justice. Would you care you to explain that statement to the judge?Apollo:\nOh... Er, I didn't mean-- What I'm trying to say is, um...Judge:\nNever underestimate the memory of your elders. I may forget my verdicts the next day, but the memories of my past are clear as day! Therefore, I find Mr. Ives Shineto's statement to be perfectly credible.Athena:\nWow, did you see how Mr. Wright got the judge on his side? That's definitely a trick I want up my sleeve.Apollo:\n*sigh* You're not helping, Athena...Judge:\nYou may cross-examine the witness, Mr. Justice.Cross ExaminationCross Examination-- The Illustrious History of the Atishon Clan --Atishon:\nMy ancestor was praised as a benevolent ruler.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nUm, that object you set down there... Is it something of importance to you?\nAtishon:\nIt's a name placard. This one here belonged to my grandfather, Abraham Atishon. He had it custom-made during his distinguished political career. It's special because it was crafted from the finest Italian plastic.\nApollo:\n(I wasn't aware the Italians were famous for their fine plastic...)\nAtishon:\nHeh heh heh. You can touch it if you want.\nApollo:\nNo, I'm fine.\nAtishon:\nVery well. I'll just continue with my testimony. My ancestor was praised as a benevolent ruler. But he was also an eminent politician.Atishon:\nHe protected the spirit mediums, a minority back then, from the rest of the locals.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo I take it the relationship with the Fey clan was a close one.\nAtishon:\nA smooth and open line of communication with my entire electorate... That is the Paul Atishon way.\nApollo:\nHuh...? Oh, sorry. I was asking about your ancestor.\nAtishon:\nHeh. Whether it's about me or my ancestor... ...feel free to ask me anything you'd like. Transparency in government! That's the Paul Atishon way.\nApollo:\n(More like: Dodging questions! That's the Paul Atishon way.) Thanks. I'll be sure to ask when I have something you'll actually answer.\nAtishon:\nAs I was saying, the Atishon family protected the Fey spirit mediums back then.Atishon:\nSome discriminated against them, you see, while others tried to abuse their power.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSpirit mediums were targets of discrimination?\nAtishon:\nYes. Some people even treated them like they were monsters. The transformation the mediums underwent when channeling spirits frightened the locals. And then there were those who tried to use them.\nApollo:\nYou mean they sought to control the channeling powers of the mediums?\nAtishon:\nDiscriminating against a minority is absolutely despicable. A vote for me is a vote to end discrimination. I vow to root it out wherever it may be! That is my promise to you!\nAthena:\nHe's totally ignoring your questions. It's like you're a moderator at a political debate.\nApollo:\nYeah, and only HE cares about his talking points. As thrilling as your campaign is, could we please get back to your testimony?\nAtishon:\nFeh. As you wish. Now then, as for the Crystal of Ami Fey...Atishon:\nAs thanks, Ami Fey gave the crystal she had specially made as a gift to him.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou said she had it made. So then it was made in Japan?\nAtishon:\nThat's right. They say she hired a famous craftsman to make it. And they say it's quite valuable, too.\nApollo:\nAnd you were going to take such a priceless family heirloom... ...and just give it to your patron?\nAtishon:\nFeh. That's so typical of you ignorant, common types. Making difficult decisions when the chips are down is what being a politician is all about.\nApollo:\n(But only when it's in service of your own political career, you mean.)\nAtishon:\nThe crystal is a testament to my ancestor's remarkable achievements. And furthermore...Present Research Notes\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"You stated that Ami Fey had the crystal made for your ancestor.\"Atishon:\nI am a descendent of that great lord.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo tell me, Mr. Atishon-Wimperson, are you famous in Kurain Village?\nAtishon:\nYou could say that. But I find my popularity to be rather bemusing.\nApollo:\nBemusing?\nAtishon:\nYes, my campaign posters keep going missing as soon as I put them up. My avid supporters and female fans are likely taking them home to hang in their bedrooms.\nApollo:\n(...I guess ignorance really is bliss.)\nAtishon:\nHeh heh heh. All this only proves my fine lineage.Atishon:\nAs such, my political power and influence is backed by centuries of history!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nI'm sorry, but is any of that relevant to the issue of the relic's rightful owner?\nAtishon:\n...Have you never heard of kingcraft?\nApollo:\nKingcraft?\nAtishon:\nIt's the art of ruling as a king. My father drilled it into my head from a young age. And one of its precepts states: \"Ruin awaits a ruler who responds to every single issue posed by the masses.\"\nApollo:\n(Well, that answered my question about what he meant by \"king of this nation.\" Progress.)Athena:\nApollo, who is this Ami Fey, anyway?Apollo:\nI believe she was the founder of the Kurain Channeling Technique.Athena:\nThe plaintiff claims she had the crystal made for his ancestor. That would mean it was made in Japan, right?Apollo:\nYes, I suppose it would."
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "That evening, I was walking alone, lost in thought.",
          "person": "Atishon",
          "present": []
        },
        {
          "testimony": "I passed by the doctor's house... and that's when I saw Mr. Are'bal.",
          "person": "Atishon",
          "present": []
        },
        {
          "testimony": "I was under this tree when I saw Mr. Are'bal.",
          "person": "Atishon",
          "present": []
        },
        {
          "testimony": "He was running out the front door.",
          "person": "Atishon",
          "present": []
        },
        {
          "testimony": "I had no idea Dr. Buff was dead. That's why I didn't call the police.",
          "person": "Atishon",
          "present": [
            "Study Photo",
            "Study Diagram"
          ],
          "source": {
            "evidence_span": ["The victim is lying in the study next to floor-to-ceiling windows with clear glass.", "There is a tree outside the large floor-to-ceiling window."],
            "testimony_span": ["I was under this tree when I saw Mr. Are'bal.", "I had no idea Dr. Buff was dead."],
            "explanation": "Since there is a floor-to-ceiling window separating the tree outside and the study inside, the witness could have seen the victim and known he was dead.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "It was around 10 at night. Surely that must've been him fleeing the scene of his crime.",
          "person": "Atishon",
          "present": []
        },
        {
          "testimony": "A vote for me is a vote to end such violence. That is my promise to you!",
          "person": "Atishon",
          "present": []
        }
      ],
      "noPresent": false,
      "summarized_context": "The witness Atishon describes his whereabouts at the night of the crime.",
      "labels": [
        ""
      ],
      "reasoning": [
        "Fact 1: The witness claims he couldn't have known the victim was dead in the study.",
        "Fact 2: The witness also claims he was under the tree.",
        "Fact 3: The evidence suggests there is a floor-to-ceiling window separating the tree outside and the study inside where the victim was dead.",
        "Prop 1: If there is a floor-to-ceiling window separating two locations, one should be able to see one location from another."
      ],
      "newContext": "-- The Illustrious History of the Atishon Clan --Atishon:\nMy ancestor was praised as a benevolent ruler.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nUm, that object you set down there... Is it something of importance to you?\nAtishon:\nIt's a name placard. This one here belonged to my grandfather, Abraham Atishon. He had it custom-made during his distinguished political career. It's special because it was crafted from the finest Italian plastic.\nApollo:\n(I wasn't aware the Italians were famous for their fine plastic...)\nAtishon:\nHeh heh heh. You can touch it if you want.\nApollo:\nNo, I'm fine.\nAtishon:\nVery well. I'll just continue with my testimony. My ancestor was praised as a benevolent ruler. But he was also an eminent politician.Atishon:\nHe protected the spirit mediums, a minority back then, from the rest of the locals.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo I take it the relationship with the Fey clan was a close one.\nAtishon:\nA smooth and open line of communication with my entire electorate... That is the Paul Atishon way.\nApollo:\nHuh...? Oh, sorry. I was asking about your ancestor.\nAtishon:\nHeh. Whether it's about me or my ancestor... ...feel free to ask me anything you'd like. Transparency in government! That's the Paul Atishon way.\nApollo:\n(More like: Dodging questions! That's the Paul Atishon way.) Thanks. I'll be sure to ask when I have something you'll actually answer.\nAtishon:\nAs I was saying, the Atishon family protected the Fey spirit mediums back then.Atishon:\nSome discriminated against them, you see, while others tried to abuse their power.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSpirit mediums were targets of discrimination?\nAtishon:\nYes. Some people even treated them like they were monsters. The transformation the mediums underwent when channeling spirits frightened the locals. And then there were those who tried to use them.\nApollo:\nYou mean they sought to control the channeling powers of the mediums?\nAtishon:\nDiscriminating against a minority is absolutely despicable. A vote for me is a vote to end discrimination. I vow to root it out wherever it may be! That is my promise to you!\nAthena:\nHe's totally ignoring your questions. It's like you're a moderator at a political debate.\nApollo:\nYeah, and only HE cares about his talking points. As thrilling as your campaign is, could we please get back to your testimony?\nAtishon:\nFeh. As you wish. Now then, as for the Crystal of Ami Fey...Atishon:\nAs thanks, Ami Fey gave the crystal she had specially made as a gift to him.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou said she had it made. So then it was made in Japan?\nAtishon:\nThat's right. They say she hired a famous craftsman to make it. And they say it's quite valuable, too.\nApollo:\nAnd you were going to take such a priceless family heirloom... ...and just give it to your patron?\nAtishon:\nFeh. That's so typical of you ignorant, common types. Making difficult decisions when the chips are down is what being a politician is all about.\nApollo:\n(But only when it's in service of your own political career, you mean.)\nAtishon:\nThe crystal is a testament to my ancestor's remarkable achievements. And furthermore...Present Research Notes\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"You stated that Ami Fey had the crystal made for your ancestor.\"Atishon:\nI am a descendent of that great lord.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo tell me, Mr. Atishon-Wimperson, are you famous in Kurain Village?\nAtishon:\nYou could say that. But I find my popularity to be rather bemusing.\nApollo:\nBemusing?\nAtishon:\nYes, my campaign posters keep going missing as soon as I put them up. My avid supporters and female fans are likely taking them home to hang in their bedrooms.\nApollo:\n(...I guess ignorance really is bliss.)\nAtishon:\nHeh heh heh. All this only proves my fine lineage.Atishon:\nAs such, my political power and influence is backed by centuries of history!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nI'm sorry, but is any of that relevant to the issue of the relic's rightful owner?\nAtishon:\n...Have you never heard of kingcraft?\nApollo:\nKingcraft?\nAtishon:\nIt's the art of ruling as a king. My father drilled it into my head from a young age. And one of its precepts states: \"Ruin awaits a ruler who responds to every single issue posed by the masses.\"\nApollo:\n(Well, that answered my question about what he meant by \"king of this nation.\" Progress.)Athena:\nApollo, who is this Ami Fey, anyway?Apollo:\nI believe she was the founder of the Kurain Channeling Technique.Athena:\nThe plaintiff claims she had the crystal made for his ancestor. That would mean it was made in Japan, right?Apollo:\nYes, I suppose it would.Apollo:\nYou stated that Ami Fey had the crystal made for your ancestor. So, am I to assume it was made in Japan?Atishon:\nThat's right. The craftsmanship is unbeatable!Apollo:\nWell, that's strange. I don't see how your so-called crystal could've been made there.Atishon:\nWhat are you talking about?Apollo:\nIt's quite obvious if you take a closer look at this.Present motif on Founder's Orb pedestal\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Take a look at the distinctive design here. According to Dr. Buff...\"Present anywhere else\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSee this part right here? Doesn't it exude a mysterious, exotic charm?\nJudge:\nHmm... I don't know about that.\nPhoenix:\nWhat I do know, Mr. Justice, is your assertion exudes a mysterious amount of nonsense.\nApollo:\n...Oops.\nJudge:\nAnd I assure you there's no mystery behind a penalty for aimless speculation, Mr. Justice.\nApollo:\nNope. No mystery there, Your Honor.\nAthena:\nApollo, let's go over everything we have on the orb once more. Maybe there's something that can help us prove it wasn't made in Japan.\nApollo:\nYour Honor, I can prove the orb wasn't made in Japan.\nLeads back to:\n\"It's quite obvious if you take a closer look at this.\"Apollo:\nTake a look at the distinctive design here. According to Dr. Buff... ...it's a mitamah motif dating back to the early days of the Kingdom of Khura'in.Judge:\nThe Kingdom of Khura'in, hmm? And you base this on...?Apollo:\nHere, this piece of evidence, Your Honor. These are the doctor's research notes on the Founder's Orb. This is the box in which the orb was originally stored. It features the same pattern as the one found on the orb.Judge:\nHmm... They do look like the same pattern.Apollo:\nTherefore, I assert that... ...the disputed item must have been made in the Kingdom of Khura'in!Atishon:\nAAAAAAAAAHHHH! Eeeeeeek! M-My placard...!!!Phoenix:Phoenix:\nThe Kurain Channeling Technique originated in the Kingdom of Khura'in. And Ami Fey is known to have traveled there to train. With that in mind, what's to say she didn't bring that pattern back with her?Apollo:Apollo:\nBut since this is CLEARLY a Khura'inese design... ...not even you can deny... ...the possibility that it was made there -- in the Kingdom of Khura'in!Phoenix:Phoenix:\nAnything is possible to some extent. That doesn't make it true. So you can't conclude that the orb is from Khura'in based solely on that pattern. If it were that simple... ...I could just as easily say it's Japanese.Judge:\nI have to agree with Mr. Wright. The pattern alone proves nothing. But that also means there's no basis to claim that the item in dispute was made in Japan, either. Hmm... At this rate, we're going nowhere fast.Apollo:\n(...Argh. He's right -- we're just spinning our wheels here.)Athena:\nI wonder if we have any evidence that could break this stalemate.Apollo:\n(Hmm... Evidence that could break this stalemate...)Exists\n\n\n\n\n\n\n\nApollo:\nThe defense would like to present a piece of evidence to the court. A piece that will finally break this stalemate!\nPhoenix:\nOh? Well, you've sure piqued my interest. Let's see what you've got.\nApollo:\n...All right. I will now prove that this is, in fact, the Founder's Orb!\n\n\n\nPresent anything\n\n\n\n\n\n\n\nApollo:\n\nPhoenix:\nAnd just how does that piece of evidence prove that the relic is the Founder's Orb?\nApollo:\n.........It doesn't, does it?\nPhoenix:\nNot by any means I can fathom.\nAthena:\nSorry, Apollo, but I have to agree with the boss on this.\nApollo:\n...Me too, actually.\nJudge:\nMe three, defense!\nApollo:\nYikes!\nJudge:\nTime to think that one over again, Mr. Justice.\nApollo:\nY-Yes, Your Honor...\nLeads back to:\n\"Hmm... Evidence that could break this stalemate...\"Does not exist\n\n\n\n\n\n\n\nLeads to:\n\"There doesn't seem to be anything we can use. At least, not at this point.\"Apollo:\nThere doesn't seem to be anything we can use. At least, not at this point.Athena:\nWell, unless we can find something, this trial won't be going anywhere.Atishon:\n......... *whew* That's much better.Apollo:\n(What's his deal?)Phoenix:\n...I have a suggestion. Why don't we consider this from a different angle?Apollo:\nI'm listening...Phoenix:\nWhat if... ...the Defiant Dragons really were authorized to take possession of the relic?Judge:\nHmm... I'm afraid I don't know where you're going with this, Mr. Wright.Phoenix:\nConsider the Orb Transfer Agreement, which states: \"I agree to hand over the Founder's Orb to the Defiant Dragons if I will come to no harm.\" What if, as the last part suggests, this was written under duress? That would render the agreement null and void.Apollo:\n...What are you suggesting, Mr. Wright?Phoenix:\nWhile you were on your little cave expedition, I was investigating Dr. Buff's accident. And there was something you overlooked, Mr. Justice. Namely, that his \"accident\" might have actually been murder.Apollo:\nWhat?! (M-Murder?)Judge:\nM-Mr. Wright! You do realize such statements are not to be made lightly? Are you suggesting the doctor was murdered by the Defiant Dragons?Phoenix:\nYes, but follow me on this for a sec. The books that came tumbling down were from the archeology shelf. However, among that mountain of books was a single volume on psychology. What's more, there was blood on it.Apollo:\nAnd you feel this is important because...?Phoenix:\nThe took that came tumbling down were from the top shelf -- the archeology books. We know this because the doctor's books were meticulously organized by subject. Archeology took up the entire shelf, so that psychology book is completely out of place.Apollo:\n(Come to think of it, the shelves were arranged quite carefully.)Phoenix:\nIt's also worth noting that psychology books only take up a tiny part of the bottom shelf. You might wonder why a book on psychology was found amid the pile of archeology books. But I believe I can explain what that single out-of-place book was doing there. The doctor was struck from behind while selecting a psychology book from the shelf.Apollo:\nAnd that's when the blood got on the book?Phoenix:\nPrecisely. And to make it look like an accident... ...he was buried under a mountain of archeology books.Apollo:Apollo:\nW-Wait a second. This is all just speculation, right? Or do you have proof it was murder?Phoenix:\nOf course I do.Apollo:\nY-You do?Phoenix:\nOn a hunch, I had Detective Skye examine the doctor's head wound. She found that he'd been struck by the corner of some object or another.Apollo:\nWait, what?!Phoenix:\nA would like that couldn't have resulted from a fall to a floor, you know. Do you understand what this means, Mr. Justice? The wound makes it crystal clear that Dr. Buff was murdered!Apollo:\nWHAAAAAAAAAAAAAAAAAAAAAT?!Athena:\nWell, THAT was unexpected! Who'd have thought we'd break out of the stalemate like this! He pulled the ladder right out from under us.Apollo:\n(Still, if he thinks that's enough to make me back down, he's got another thing coming!) Even if the cause of death was murder, what makes you think it was the Defiant Dragons? You should know better than to hurl baseless accusations!Phoenix:Phoenix:\nDid you forget who you were up against, Mr. Justice?Apollo:\nHuh?Phoenix:\nYou didn't actually think I'd come to court without witnesses and evidence, did you?Apollo:\nWh-What are you talking about?Phoenix:\nI would like to request further testimony from the plaintiff. Specifically... ...I would like the court to hear how he saw one of the rebels leaving the crime scene!Apollo:\nHe-- He-- He saw whaaaaaaaaaaaaaaaaaat?!Athena:\nIf he can prove it was murder, that's the end of our client's right to the orb! Did he have this up his sleeve the whole time?!Apollo:\nGrrr... How could Mr. Wright do this to us? (He was just waiting to spring this trap!)Phoenix:\n...Heh.Judge:\nHmm... This trial has taken another unexpected turn. But I must mention, Mr. Wright, that you have yet to identify the murder weapon.Phoenix:\nThe object used to commit the murder was not located at the scene of the crime. The murderer likely disposed of it elsewhere.Dr. Buff's Autopsy Report added to the Court Record.Judge:\nWell, I never thought we'd be deliberating the issue of murder at a civil trial. All right, Mr. Atishon-Wimperson, your testimony, if you please.Atishon:\nHeh. Prepare to be dazzled! Dazzled by charismatic oration forged in the crucible of campaign battles!Witness Testimony-- The Rebel's Crime --Atishon:\nThat evening, I was walking alone, lost in thought.\nI passed by the doctor's house... and that's when I saw Mr. Are'bal.\nHe was running out the front door.\nIt was around 10 at night. Surely that must've been him fleeing the scene of his crime.\nA vote for me is a vote to end such violence. That is my promise to you!Judge:\nSo the plaintiff saw a possible suspect fleeing from the doctor's residence? And it was within the window of the estimated time of death?Apollo:\n......... (Datz Are'bal! What in the world were you doing there then?!)Study Photo updated in the Court Record.Phoenix:\nIt seems that Mr. Are'bal was loitering about Kurain Village that day. There's evidence that he was in the doctor's study as well. Isn't that right, Mr. Justice?Apollo:\n......Ah! You mean the suitcase?Phoenix:\nExactly. He must have been in quite a rush to leave that behind. Oh, and by the way, Your Honor... ...Mr. Are'bal just so happens to be sitting in the gallery today.Datz:\nAck!Phoenix:\nSee? That's him trying to escape as we speak.Judge:\nBailiff! Don't let that man get away!Datz:\nWright, you backstabber! Why are you doing this to meeee?!Judge:\nAll right. The... counsel-slash-defense may question the plaintiff-slash-witness once more. ...Ahem. Please proceed, Mr. Justice.Cross ExaminationCross Examination-- The Rebel's Crime --Atishon:\nThat evening, I was walking alone, lost in thought.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhy were you taking a walk?\nAtishon:\nSociety is inundated with serious problems that must be solved. And as a politician... ...I'm always on the job, thinking hard about possible solutions, even on my walks.\nApollo:\nUmm... (Thanks for the non-answer.)\nAtishon:\nWhile we live out our comfy lives... ...there are starving children who suffer in the back alleys of our major cities. It's not in me to ignore such suffering! A vote for me, is a vote to end hunger. ...And for world peace!\nPhoenix:\nYes, Mr. Atishon-Wimperson, we are well aware of your outstanding character. Now, please continue with your testimony.\nAtishon:\nHeh heh heh. I can practically hear my poll numbers surging. Now, on with my speech. After all, the voting public must be informed of the magnificence that is me!Atishon:\nI passed by the doctor's house... and that's when I saw Mr. Are'bal.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhere exactly were you when you saw Mr. Are'bal?\nAtishon:\nRight here, under this tree. I saw him dashing out of Dr. Buff's front door.\nApollo:\nAnd he didn't notice you?\nAtishon:\nNo. I was hidden by the tree.\nJudge:\nIs it really all that important to know from where the plaintiff saw Dr. Buff?\n\n\n\nNo, it isn't\n\n\n\n\n\n\n\nApollo:\nNo, I don't believe it bears any relevance to this case.\nJudge:\nAll right, then. Will the witness please continue with his testimony?\nLeads back to cross-examination\n\n\n\n\nYes, it is\n\n\n\n\n\n\n\nApollo:\nYes, I believe it matters a lot. I ask that it please be added to the witness's testimony.\nAdds statement \"I was under this tree when I saw Mr. Are'bal.\" if not already addedAtishon:\nI was under this tree when I saw Mr. Are'bal.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhat were you doing under that tree?\nAtishon:\nA lack of lateral thinking... That is a politician's downfall.\nApollo:\nWhat?\nAtishon:\nThat is why, if I'm elected... I promise to think outside the box!\nApollo:\nUm... uh... The question was, what were you doing under the tree, Mr. Atishon-Wimperson.\nAtishon:\nFeh... I suppose I can't expect a plebeian such as yourself to understand my grand design.\nApollo:\n(Oh, yeah? Try me, O Lord of Plebs.)\nPhoenix:\nMr. Atishon-Wimperson. I believe the court is well aware of your grand political vision. Now, let's have the rest of your testimony, if you please.\nAtishon:\nHeh, I can hardly wait for the upcoming election.Atishon:\nHe was running out the front door.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nDid you notice anything unusual?\nAtishon:\nYes, his behavior was incredibly suspicious. His eyes were darting all around as he ran off in total panic. As soon as I saw that, I knew he had done something, and it probably wasn't good.\nApollo:\nDespite that, you still didn't report it to the police?\nAtishon:\nWho would've thought he had killed Dr. Buff? Not me. That's why I didn't report him. \nJudge:\nSo the witness didn't notify the police. Is that an important statement, Mr. Justice?\n\n\n\nNo, it isn't\n\n\n\n\n\n\n\nApollo:\nNo, it's not important.\nJudge:\nHmm... All right, then. Let's have the witness continue with his testimony.\nLeads back to cross-examination\n\n\n\n\nYes, it is\n\n\n\n\n\n\n\n\nApollo:\nYes, it's important. I request that the witness add it to his testimony.\nAtishon:\n...Feh. Sure, why not.\nAdds statement \"I had no idea Dr. Buff was dead. That's why I didn't call the police.\" if not already addedAtishon:\nI had no idea Dr. Buff was dead. That's why I didn't call the police.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou had no idea he was dead. In other words, you knew nothing about what had happened?\nAtishon:\nI am truly ashamed of myself.\nApollo:\nWhat?\nAtishon:\nThere's been a gruesome murder in my beloved village. What a fool I've been! I was thinking only of the village's future and world peace! It seems my earnest attitude and industrious nature have come back to haunt me!\nApollo:\n(Only a politician would try to pass off self-aggrandizement as self-deprecation.)\nAthena:\nApollo, you think this is how all politicians will be from now on?\nApollo:\nWe're all doomed if they are...\nAtishon:\nIf you don't mind, I'd like to continue with my testimony.Present Study Photo or Study Diagram (after adding statement \"I was under this tree when I saw Mr. Are'bal.\")\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Mr. Atishon-Wimperson, rather than Mr. Are'bal...\"Atishon:\nIt was around 10 at night. Surely that must've been him fleeing the scene of his crime.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nBut at the time, you didn't know the doctor was dead. Is that correct?\nAtishon:\n...It's true that I've been known as a prodigy from a very young age.\nApollo:\nHuh?\nAtishon:\nI graduated high school and college with exceptional grades. As class president... ...I reformed stale old school traditions. My exploits were even covered in local papers. But as exceptional as I am, I can't possibly be expected to know everything at all times.\nApollo:\n(This isn't working. He keeps bending the questions to serve his own needs.)\nAthena:\nHang in there, Apollo!\nPhoenix:\nMr. Atishon-Wimperson. I believe the court is well aware of your exceptional nature. Now, would you please continue with your testimony?\nAtishon:\nHeh heh heh. I have the upcoming election in the bag.Atishon:\nA vote for me is a vote to end such violence. That is my promise to you!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo, how do you actually intend to end such violence?\nAtishon:\nElite politicians such as myself never reveal their strategies. Did you really think I would divulge such sensitive information to the likes of you?\nApollo:\nYeah, but, surely you have some sort of campaign platform you're running on?\nAtishon:\n................................... ...No comment.\nApollo:\n(Clearly, his is a platform, told by an idiot, full of sound and fury, signifying nothing.)Before adding either statement\n\n\n\n\n\n\n\nAthena:\nThey're accusing the Defiant Dragons of murder. If this sticks, we'll lose the orb!\nApollo:\nYeah, we need to sink Paul Atishon's testimony before it's too late. (Mr. Wright is pulling out all the stops. Then again, I'd expect nothing less from him.)After adding statement \"I was under this tree when I saw Mr. Are'bal.\", but before adding statement \"I had no idea Dr. Buff was dead. That's why I didn't call the police.\"\n\n\n\n\n\n\n\nAthena:\nHe saw Mr. Are'bal from under that tree? Apollo, maybe there's some sort of an inconsistency there.\nApollo:\nHmm, I wonder...\nAthena:\nWhy don't we review the evidence?\nApollo:\n(Yeah. Maybe there's something we overlooked.)After adding statement \"I had no idea Dr. Buff was dead. That's why I didn't call the police.\", but before adding statement \"I was under this tree when I saw Mr. Are'bal.\"\n\n\n\n\n\n\n\nAthena:\nHe didn't know the doctor was dead? Well, I guess that makes sense, considering the body was inside the study.\nApollo:\nRight, how could he have known? (Guess I could find out where our weaselly witness was when he saw Datz.)After adding both statements\n\n\n\n\n\n\n\nApollo:\nHe said he saw Datz from under the tree. If that's true, then...\nAthena:\nDid you figure something out?\nApollo:\nYeah, I think he's hiding something. Let's take another look at the evidence, Athena."
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "Papa met with someone the night he died.",
          "person": "Sarge",
          "present": []
        },
        {
          "testimony": "I didn't have eyes on the ground, as I'd already mounted my siege defense, but...",
          "person": "Sarge",
          "present": [
            "Sarge's Drone"
          ],
          "source": {
            "evidence_span": "Equipped with a camera and a microphone.",
            "testimony_span": "I didn't have eyes on the ground",
            "explanation": "Since the witness' drone has a camera, he could have visuals on the ground.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "...I did hear him arguing with someone in his study!",
          "person": "Sarge",
          "present": []
        },
        {
          "testimony": "From my window, I saw the one designated \"Datz\" getting ejected from the premises.",
          "person": "Sarge",
          "present": []
        },
        {
          "testimony": "After that, the man lingered around the perimeter for some time.",
          "person": "Sarge",
          "present": []
        },
        {
          "testimony": "He must have regrouped and killed my papa in the study later -- I just know it!",
          "person": "Sarge",
          "present": []
        }
      ],
      "noPresent": false,
      "summarized_context": "The witness Sarge is a kid with social anxiety. He operates a drone around the house. He is describing an argument between his father, the victim, and another person.",
      "labels": [
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims he could have seen the crime scene from another room.",
        "Fact 2: The evidence suggests the witness has a drone with a camera.",
        "Prop 1: A camera can capture images of the crime scene.",
        "Prop 2: A drone can move to another room."
      ],
      "newContext": "-- The Rebel's Crime --Atishon:\nThat evening, I was walking alone, lost in thought.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhy were you taking a walk?\nAtishon:\nSociety is inundated with serious problems that must be solved. And as a politician... ...I'm always on the job, thinking hard about possible solutions, even on my walks.\nApollo:\nUmm... (Thanks for the non-answer.)\nAtishon:\nWhile we live out our comfy lives... ...there are starving children who suffer in the back alleys of our major cities. It's not in me to ignore such suffering! A vote for me, is a vote to end hunger. ...And for world peace!\nPhoenix:\nYes, Mr. Atishon-Wimperson, we are well aware of your outstanding character. Now, please continue with your testimony.\nAtishon:\nHeh heh heh. I can practically hear my poll numbers surging. Now, on with my speech. After all, the voting public must be informed of the magnificence that is me!Atishon:\nI passed by the doctor's house... and that's when I saw Mr. Are'bal.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhere exactly were you when you saw Mr. Are'bal?\nAtishon:\nRight here, under this tree. I saw him dashing out of Dr. Buff's front door.\nApollo:\nAnd he didn't notice you?\nAtishon:\nNo. I was hidden by the tree.\nJudge:\nIs it really all that important to know from where the plaintiff saw Dr. Buff?\n\n\n\nNo, it isn't\n\n\n\n\n\n\n\nApollo:\nNo, I don't believe it bears any relevance to this case.\nJudge:\nAll right, then. Will the witness please continue with his testimony?\nLeads back to cross-examination\n\n\n\n\nYes, it is\n\n\n\n\n\n\n\nApollo:\nYes, I believe it matters a lot. I ask that it please be added to the witness's testimony.\nAdds statement \"I was under this tree when I saw Mr. Are'bal.\" if not already addedAtishon:\nI was under this tree when I saw Mr. Are'bal.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhat were you doing under that tree?\nAtishon:\nA lack of lateral thinking... That is a politician's downfall.\nApollo:\nWhat?\nAtishon:\nThat is why, if I'm elected... I promise to think outside the box!\nApollo:\nUm... uh... The question was, what were you doing under the tree, Mr. Atishon-Wimperson.\nAtishon:\nFeh... I suppose I can't expect a plebeian such as yourself to understand my grand design.\nApollo:\n(Oh, yeah? Try me, O Lord of Plebs.)\nPhoenix:\nMr. Atishon-Wimperson. I believe the court is well aware of your grand political vision. Now, let's have the rest of your testimony, if you please.\nAtishon:\nHeh, I can hardly wait for the upcoming election.Atishon:\nHe was running out the front door.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nDid you notice anything unusual?\nAtishon:\nYes, his behavior was incredibly suspicious. His eyes were darting all around as he ran off in total panic. As soon as I saw that, I knew he had done something, and it probably wasn't good.\nApollo:\nDespite that, you still didn't report it to the police?\nAtishon:\nWho would've thought he had killed Dr. Buff? Not me. That's why I didn't report him. \nJudge:\nSo the witness didn't notify the police. Is that an important statement, Mr. Justice?\n\n\n\nNo, it isn't\n\n\n\n\n\n\n\nApollo:\nNo, it's not important.\nJudge:\nHmm... All right, then. Let's have the witness continue with his testimony.\nLeads back to cross-examination\n\n\n\n\nYes, it is\n\n\n\n\n\n\n\n\nApollo:\nYes, it's important. I request that the witness add it to his testimony.\nAtishon:\n...Feh. Sure, why not.\nAdds statement \"I had no idea Dr. Buff was dead. That's why I didn't call the police.\" if not already addedAtishon:\nI had no idea Dr. Buff was dead. That's why I didn't call the police.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou had no idea he was dead. In other words, you knew nothing about what had happened?\nAtishon:\nI am truly ashamed of myself.\nApollo:\nWhat?\nAtishon:\nThere's been a gruesome murder in my beloved village. What a fool I've been! I was thinking only of the village's future and world peace! It seems my earnest attitude and industrious nature have come back to haunt me!\nApollo:\n(Only a politician would try to pass off self-aggrandizement as self-deprecation.)\nAthena:\nApollo, you think this is how all politicians will be from now on?\nApollo:\nWe're all doomed if they are...\nAtishon:\nIf you don't mind, I'd like to continue with my testimony.Present Study Photo or Study Diagram (after adding statement \"I was under this tree when I saw Mr. Are'bal.\")\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Mr. Atishon-Wimperson, rather than Mr. Are'bal...\"Atishon:\nIt was around 10 at night. Surely that must've been him fleeing the scene of his crime.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nBut at the time, you didn't know the doctor was dead. Is that correct?\nAtishon:\n...It's true that I've been known as a prodigy from a very young age.\nApollo:\nHuh?\nAtishon:\nI graduated high school and college with exceptional grades. As class president... ...I reformed stale old school traditions. My exploits were even covered in local papers. But as exceptional as I am, I can't possibly be expected to know everything at all times.\nApollo:\n(This isn't working. He keeps bending the questions to serve his own needs.)\nAthena:\nHang in there, Apollo!\nPhoenix:\nMr. Atishon-Wimperson. I believe the court is well aware of your exceptional nature. Now, would you please continue with your testimony?\nAtishon:\nHeh heh heh. I have the upcoming election in the bag.Atishon:\nA vote for me is a vote to end such violence. That is my promise to you!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSo, how do you actually intend to end such violence?\nAtishon:\nElite politicians such as myself never reveal their strategies. Did you really think I would divulge such sensitive information to the likes of you?\nApollo:\nYeah, but, surely you have some sort of campaign platform you're running on?\nAtishon:\n................................... ...No comment.\nApollo:\n(Clearly, his is a platform, told by an idiot, full of sound and fury, signifying nothing.)Before adding either statement\n\n\n\n\n\n\n\nAthena:\nThey're accusing the Defiant Dragons of murder. If this sticks, we'll lose the orb!\nApollo:\nYeah, we need to sink Paul Atishon's testimony before it's too late. (Mr. Wright is pulling out all the stops. Then again, I'd expect nothing less from him.)After adding statement \"I was under this tree when I saw Mr. Are'bal.\", but before adding statement \"I had no idea Dr. Buff was dead. That's why I didn't call the police.\"\n\n\n\n\n\n\n\nAthena:\nHe saw Mr. Are'bal from under that tree? Apollo, maybe there's some sort of an inconsistency there.\nApollo:\nHmm, I wonder...\nAthena:\nWhy don't we review the evidence?\nApollo:\n(Yeah. Maybe there's something we overlooked.)After adding statement \"I had no idea Dr. Buff was dead. That's why I didn't call the police.\", but before adding statement \"I was under this tree when I saw Mr. Are'bal.\"\n\n\n\n\n\n\n\nAthena:\nHe didn't know the doctor was dead? Well, I guess that makes sense, considering the body was inside the study.\nApollo:\nRight, how could he have known? (Guess I could find out where our weaselly witness was when he saw Datz.)After adding both statements\n\n\n\n\n\n\n\nApollo:\nHe said he saw Datz from under the tree. If that's true, then...\nAthena:\nDid you figure something out?\nApollo:\nYeah, I think he's hiding something. Let's take another look at the evidence, Athena.Apollo:\nMr. Atishon-Wimperson, rather than Mr. Are'bal... ...wasn't there's something else that should've had your undivided attention?Atishon:\nLike what? ...Oh, yes, of course! A politician must also keep his finger on the electorate's pulse, and focus on the nation's--Apollo:\nSorry, but you're way off.Atishon:\nI am? Hmm...Judge:\nWould you care to explain, Mr. Justice?Apollo:\nIf the witness saw Mr. Are'bal from his position here... ...then he should've also been able to see the doctor's body. After all, it was right next to a huge window.Judge:\nWhy, I believe you have a point there!Apollo:\nWith the body THAT clearly visible to the witness... ...it's unthinkable that he wouldn't have reported it to the police!Phoenix:\nAh!Judge: \nHmm... Would the witness care to respond?Atishon:\n...........................Apollo:\n......... (Did he... fall asleep?)Judge:\n...Um, Mr. Atishon-Wimperson?Atishon:\n...........................Judge:\nMr. Atishon-Wimperson!!!Atishon:\nHuh?! Oh, um. Hmm... There are many sides to any issue.Apollo:\n(What did I ever do to deserve this?) In any case, I'd like the court to acknowledge in the inconsistency in the witness's testimony. Mr. Atishon-Wimperson, did you really see Mr. Are'bal?Atishon:\nYes! ..................Apollo:Apollo:\nWhere do you think you're going?!Atishon:\nOh, I thought I would return to my seat, seeing as I had already answered the question.Apollo:\nThis isn't some small town hall debate, so you just stay right there until I say we're through.Atishon:\nI-I'll have to run that by my campaign manager before I...Apollo:Apollo:\n.........*glare*Atishon:\n*gulp*Phoenix:\n...Mr. Atishon-Wimperson. I think it's time for you to come clean.Atishon:\nHuh?!Apollo:\n...So then, does this mean he DIDN'T see Mr. Are'bal?Phoenix:\nAs your lawyer, Mr. Atishon-Wimperson... ...I advise you divulge that matter we discussed. Silence is no longer an option.Atishon:\n...Err, are you sure about this? I'm in the midst of running for office! I can't afford to let any strange rumors get out.Phoenix:\nDon't worry. You won't suffer any blowback for what you're about to reveal.Judge:\n\"Blowback\"? I'm not sure I like the sound of that, Mr. Wright.Phoenix:\nNot to worry, Your Honor. Nothing untoward will come of this, I promise. Now then, Mr. Justice. Remember how it was an anonymous caller that reported the doctor's death?Apollo:\nCome to think of it...Apollo:\nEma, who was the first one to discover the body?Ema:\nAbout that... Whoever it was, it seems they wanted to remain anonymous.Apollo:\nWhat?Ema:\nIt happens now and then. Some people would rather not get involved with the police.Apollo:\nWait... You're not saying that...Phoenix:\nYes, that's exactly what I'm saying. The anonymous source who contacted the police after discovering the body was... ...my client, Mr. Paul Atishon-Wimperson.Apollo:\nWh-What?! (Y-You don't say...)Phoenix:\nSo you see, he played his part as a concerned citizen -- quite admirably, if I may say so. Isn't that right?Atishon:\n.........Y-Yes, indeed... In our society today, there are too many who choose indifference over righteous action. But I don't number among them. That's why I did my duty as a concerned citizen. One might call me THE model citizen -- one worthy of standing above all the rest!Apollo:\n(What a real standard-bearer he is, reporting it anonymously.)Phoenix:\n...Oh, and by the way, Mr. Justice. Wasn't there someone else at the scene of the crime when my client discovered the body?Apollo:\n...Oh, um, you mean Mr. Are'bal? He would have been leaving the doctor's house right around then... Wait, th-that means...!Phoenix:\nYes, it does. In short... ...what my client witnessed was Mr. Are'bal fleeing the scene of a heinous murder!Apollo:\n...Aaaaaaah!Phoenix:\nAnd that's not all! Based on what we've heard so far... ...Mr. Are'bal looked exceedingly suspicious, and that's putting it mildly. We already know the Defiant Dragons threatened the doctor with bodily harm. And now that they've killed him, the so-called Orb Transfer Agreement is null and void!Apollo:\nAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAGH!Athena:\nA-Apollo! If we don't come up wit with some sort of counterargument...!Apollo:\nA-And what sort of evidence do you have? Can you actually prove that it was Mr. Are'bal who killed the doctor?Athena:\nThat move had \"desperate\" written all over it.Apollo:\nIt's all I've got, so I'm going with it!Phoenix:\n...Evidence? I suppose it's true that I don't have any...Apollo:\nI-I knew it!Phoenix:\nBut I do have another witness.Apollo:\nYou do?Phoenix:\nYou should know I always come fully prepared, Mr. Justice. And my new witness will provide testimony proving Mr. Are'bal's guilt.Apollo:\n...Gnrggh!Athena:\nA new witness? I wonder who it could be.Judge:\n...Very well. Bailiff, please summon our new witness. In the meantime, the court will take a brief recess. I would like both sides to use this time to prepare properly, understood?May 17District Court - Defendant Lobby No. 3Apollo:\nWow. I knew Mr. Wright would put up a tough fight, but...Athena:\nYeah! Just when I thought we had him, he'd turn the tables on us. He really is the Turnabout Terror.Apollo:\n(We can't let him blindside us again.)Datz:\nLooks like they've got me again! Three times in one year! \"Datz\" a new record! Har har har har har har!Apollo:\nDatz, please... No more new records -- or bad puns, while you're at it. It's hard enough trying to help you as it is.Datz:\nRoger that. I'll be more careful next time!Dhurke:\nDatz, is what Mr. Wright said true? Did you really pay a visit to Dr. Buff that night?Datz:\nSure did. Can't remember the exact time, though. All I know is he wouldn't hand over the orb. Someone put it in his head that we rebels were dangerous. That's why he threw me out.Apollo:\nSo the doctor was still alive when Datz last saw him.Athena:\nWe'll still have to prove it, though.Dhurke:\n...Better brace yourself, son. The next witness's testimony could make or break this case.Apollo:\nYeah, I know. Hey, where's Trucy?Athena:\nShe went to go see her dad.Apollo:\nHmm... Maybe she's still mad.Athena:\nMore like worried. Worried that this trial will create a rift between you two... ...and that you might then leave the agency.Apollo:\nHa ha ha. She has an active imagination.Bailiff:\nExcuse me. The trial will be resuming shortly.Apollo:\nWell, let's go see what new testimony awaits us.May 17District Court - Courtroom No. 6Judge:\nAll right, court is back in session. Mr. Wright, you said you had a witness...?Phoenix:\nYour Honor, I would like to call the lone survivor of the doctor's murder to the stand.Apollo:\n(Wait.. He can't mean... that Sarge is here?) You mean Dr. Buff's reclusive son? How did you get him to cooperate?Phoenix:\n...Nothing a little persuasion couldn't handle. The poor child only agreed to help if it meant catching the killer.Apollo:\n(Getting a kid like that to overcome his fear... Now that's impressive.)Athena:\nThis must be really important testimony for the kid to come out in public like this.Judge:\nVery well, Mr. Wright. Please call your witness to the stand.Judge:\n.........Oh, my!Sarge:\nSergeant Buff at your service, sir!Apollo:\n...He's here as the drone? Really?Judge:\n...Um, Mr. Wright? What exactly is the meaning of this?Phoenix:\nPast trauma has rendered it impossible for the witness to venture into public. Leaving home was hard enough. And it seems leaving the witness lobby was just too much. But I would still like to continue with testimony delivered via this drone.Judge:\nHmm... I understand it must be terrible to lose one's father like that... ...but testimony via a remote control toy? .........Well, let's take things for a spin and see how it goes.Apollo:\n(Just who's piloting this trial, anyway?!)Athena:\nThe judge sure warmed up to the idea fast.Apollo:\nI think the phrase you're looking for is \"gave up.\"Sarge:\nYou disappoint me, Corporal Justice! To think I once called you comrade!Apollo:\nAAAAAAAAAGH!Sarge:\nDefending the man who killed Papa?! That's full-on treason, soldier! I hereby demote you back to \"private\"!Athena:\n\"Corporal\"? \"Private\"? What's he talking about, Apollo?Apollo:\nIt's... a long story.Judge:\nNow then, are you ready to testify, youngster?Sarge:\nLocked and loaded, sir! Ready to rain lead down upon the perpetrator! Ha ha ha ha ha ha ha ha ha!Witness Testimony-- What Happened That Evening --Sarge:\nPapa met with someone the night he died.\nI didn't have eyes on the ground, as I'd already mounted my siege defense, but...\n...I did hear him arguing with someone in his study!\nFrom my window, I saw the one designated \"Datz\" getting ejected from the premises.\nAfter that, the man lingered around the perimeter for some time.\nHe must have regrouped and killed my papa in the study later -- I just know it!Judge:\nHmm... So he was thrown out, but later returned and committed the murder, did he?Phoenix:\nYes, Your Honor. So the man my client saw... ...really must have been the fleeing Mr. Are'bal.Datz:Datz:\nObjeeeeection! Wright, you backstabbing, no good--! I-I didn't kill no one!Sarge:\nIt's the enemy! Ready all missiles! And... FIIIIIIIIIIIIIIIIIIIIIIIIIRE!!Datz:\nWHOA WHOA WHOA WHOA WHOA!!!Sarge:\nHa ha ha ha ha ha ha! Capitalist pig! I'll turn you into pork stroganoff! And that's just a taste of my ultimate anti-swine weapon!Apollo:\n(Whoa! It fires missiles, too?!)Judge:\n...Yes, well, the witness is all yours, Mr. Justice.Cross ExaminationCross Examination-- What Happened That Evening --Sarge:\nPapa met with someone the night he died.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYour father met with \"someone\"? Could you be more specific?\nSarge:\nNo. I was in the midst of a crucial defensive siege operation.\nApollo:\nRight... You're referring to how you don't leave your room, correct?\nSarge:\nYou never know where the enemy might be lurking outside the siege perimeter.\nApollo:\nWhat about, you know, school?\nSarge:\nOh, uhhh... I don't go to boot camp! I'm a soldier! A sergeant doesn't associate with rookies still too green to fight!\nApollo:\n(With a kid like this, I bet Dr. Buff won't be getting any rest in the afterlife, either.)\nJudge:\nHmm... It was very brave of you to come to the courthouse today. But what was that you said about a siege defense?\nSarge:\nOh, that? Well...Sarge:\nI didn't have eyes on the ground, as I'd already mounted my siege defense, but...Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nUm, Sarge? I've always wondered... ...who or what are you battling?\nSarge:\n! Th-That's... classified.\nApollo:\nEven so, it may be relevant to this case.\nPhoenix:\n\nPhoenix:\nUmm... I don't know if YOU'RE the right person to be asking things like that...\nAthena:\nThat's right. Such matter need to be handled with a certain delicacy.\nApollo:\nOh, ha ha ha. I guess curiosity got the better of me.\nSarge:\nYou're all talk and no action, soldier! Out on the battlefield, it ain't the number of pretty words in yer repertoire... ...but the number of bullets in yer gun belt that counts!\nApollo:\n(Easy for you to say. You're the one with all of them.\nJudge:\nWould the witness please tell the court what he saw and heard that night?Present Sarge's Drone\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Sarge, are you hiding something from me?\"Sarge:\n...I did hear him arguing with someone in his study!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhat was the argument about?\nSarge:\nI heard things like, \"Where's the orb?!\" and \"Are you Defiant Dragons really criminals?!\" It sounded real volatile, like a war might break out any second!\nApollo:\n(So the two of them had an argument when Datz came to get the orb.) Did you see or hear anything else?\nSarge:\nYeah. I heard them arguing, and then, silence.Sarge:\nFrom my window, I saw the one designated \"Datz\" getting ejected from the premises.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHow was Mr. Are'bal acting?\nSarge:\nLike a conquered trooper retreating with his tail between his legs.\nApollo:\nA \"trooper\"...? Well, I guess he does dress like he's in the military.\nAthena:\nI bet those two would have really hit it off had they met under different circumstances.\nApollo:\nYeah, I can see that.\nSarge:\nAnd so, the defeated soldier was expelled. But that wasn't the end.Sarge:\nAfter that, the man lingered around the perimeter for some time.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThat... does seem suspicious.\nSarge:\nHe kept hiding behind trees and telephone poles, and stealing glances at our house.\nApollo:\nWell, he couldn't exactly leave without the orb...)\nSarge:\nI bet he was angry that he'd been kicked out.Sarge:\nHe must have regrouped and killed my papa in the study later -- I just know it!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nBut don't you keep your front door unlocked? If so, anyone could've gotten in..\nSarge:\nThat's true. Papa didn't keep our house locked up. He said there was no need because there were only good people in Kurain Village.\nApollo:\n(Yet he ended up dead, anyway.)\nSarge:\nOnly a monster could do what they did to my kind, trusting Papa! There will be no mercy! I vow swift and terrible vengeance! I'll carpet-bomb the killer with everything in my arsenal! FIIIIIIRE!!!\nJudge:\nWhile I sympathize with you, witness, you will refrain from firing Gatling guns in this court.Athena:\nSo Sarge saw Datz, too.Apollo:\nAnd just when I thought things couldn't get any worse. I wonder why he hung around after getting thrown out?Athena:\nI hate to say this, but if Datz is proven to be the killer... ...we'll lose the orb to the plaintiff. So our only option is to prove the Defiant Dragons had nothing to do with the murder!"
    },
    {
      "category": "cross_examination",
      "testimonies": [
        {
          "testimony": "It was around 11 at night, and I was out on a mobile meet-and-greet around the village.",
          "person": "Atishon",
          "present": []
        },
        {
          "testimony": "That's when I saw Dr. Buff being murdered from outside his study window!",
          "person": "Atishon",
          "present": []
        },
        {
          "testimony": "Mr. Are'bal snuck up from behind and struck him on the head.",
          "person": "Atishon",
          "present": []
        },
        {
          "testimony": "The doctor was standing in front of the bookshelves, absorbed in a book.",
          "person": "Atishon",
          "present": [
            "Doctor's Reading Glasses"
          ],
          "source": {
            "evidence_span": "The doctor's poor eyesight meant he couldn't read anything without these. They were found on his desk.",
            "testimony_span": "The doctor was standing in front of the bookshelves, absorbed in a book.",
            "explanation": "The doctor requires the glasses to read anything. Since the glasses were found on his desk, he must have been reading at the desk, not the bookshelves..",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "His weapon of choice: a suitcase.",
          "person": "Atishon",
          "present": []
        },
        {
          "testimony": "A big, strong man like him could easily swing a heavy suitcase into someone's head.",
          "person": "Atishon",
          "present": []
        }
      ],
      "noPresent": false,
      "summarized_context": "The witness Atishon describes the victim's position at the time of the crime.",
      "labels": [
        "spatial",
        "behavior"
      ],
      "reasoning": [
        "Fact 1: The witness claims the doctor was reading in front of the bookshelves.",
        "Fact 2: The evidence suggests the doctor could only read with glasses.",
        "Fact 3: The evidence also suggests the glasses were at the desk.",
        "Prop 1: If someone has to read with glasses, the glasses will be at the same place where they read.",
        "Prop 2: If an object is at the desk, it cannot be at the bookshelves."
      ],
      "newContext": "-- What Happened That Evening --Sarge:\nPapa met with someone the night he died.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYour father met with \"someone\"? Could you be more specific?\nSarge:\nNo. I was in the midst of a crucial defensive siege operation.\nApollo:\nRight... You're referring to how you don't leave your room, correct?\nSarge:\nYou never know where the enemy might be lurking outside the siege perimeter.\nApollo:\nWhat about, you know, school?\nSarge:\nOh, uhhh... I don't go to boot camp! I'm a soldier! A sergeant doesn't associate with rookies still too green to fight!\nApollo:\n(With a kid like this, I bet Dr. Buff won't be getting any rest in the afterlife, either.)\nJudge:\nHmm... It was very brave of you to come to the courthouse today. But what was that you said about a siege defense?\nSarge:\nOh, that? Well...Sarge:\nI didn't have eyes on the ground, as I'd already mounted my siege defense, but...Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nUm, Sarge? I've always wondered... ...who or what are you battling?\nSarge:\n! Th-That's... classified.\nApollo:\nEven so, it may be relevant to this case.\nPhoenix:\n\nPhoenix:\nUmm... I don't know if YOU'RE the right person to be asking things like that...\nAthena:\nThat's right. Such matter need to be handled with a certain delicacy.\nApollo:\nOh, ha ha ha. I guess curiosity got the better of me.\nSarge:\nYou're all talk and no action, soldier! Out on the battlefield, it ain't the number of pretty words in yer repertoire... ...but the number of bullets in yer gun belt that counts!\nApollo:\n(Easy for you to say. You're the one with all of them.\nJudge:\nWould the witness please tell the court what he saw and heard that night?Present Sarge's Drone\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Sarge, are you hiding something from me?\"Sarge:\n...I did hear him arguing with someone in his study!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nWhat was the argument about?\nSarge:\nI heard things like, \"Where's the orb?!\" and \"Are you Defiant Dragons really criminals?!\" It sounded real volatile, like a war might break out any second!\nApollo:\n(So the two of them had an argument when Datz came to get the orb.) Did you see or hear anything else?\nSarge:\nYeah. I heard them arguing, and then, silence.Sarge:\nFrom my window, I saw the one designated \"Datz\" getting ejected from the premises.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHow was Mr. Are'bal acting?\nSarge:\nLike a conquered trooper retreating with his tail between his legs.\nApollo:\nA \"trooper\"...? Well, I guess he does dress like he's in the military.\nAthena:\nI bet those two would have really hit it off had they met under different circumstances.\nApollo:\nYeah, I can see that.\nSarge:\nAnd so, the defeated soldier was expelled. But that wasn't the end.Sarge:\nAfter that, the man lingered around the perimeter for some time.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nThat... does seem suspicious.\nSarge:\nHe kept hiding behind trees and telephone poles, and stealing glances at our house.\nApollo:\nWell, he couldn't exactly leave without the orb...)\nSarge:\nI bet he was angry that he'd been kicked out.Sarge:\nHe must have regrouped and killed my papa in the study later -- I just know it!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nBut don't you keep your front door unlocked? If so, anyone could've gotten in..\nSarge:\nThat's true. Papa didn't keep our house locked up. He said there was no need because there were only good people in Kurain Village.\nApollo:\n(Yet he ended up dead, anyway.)\nSarge:\nOnly a monster could do what they did to my kind, trusting Papa! There will be no mercy! I vow swift and terrible vengeance! I'll carpet-bomb the killer with everything in my arsenal! FIIIIIIRE!!!\nJudge:\nWhile I sympathize with you, witness, you will refrain from firing Gatling guns in this court.Athena:\nSo Sarge saw Datz, too.Apollo:\nAnd just when I thought things couldn't get any worse. I wonder why he hung around after getting thrown out?Athena:\nI hate to say this, but if Datz is proven to be the killer... ...we'll lose the orb to the plaintiff. So our only option is to prove the Defiant Dragons had nothing to do with the murder!Apollo:\nSarge, are you hiding something from me?Sarge:\nH-How dare you question your superior officer like that! You wanna get in on this stroganoff action with pig-boy over there, soldier?!Apollo:\nSorry, but I'm afraid lawyers are missile-proof.Sarge:\nWh-What?!Judge:\nWould the defense care to explain?Apollo:\nIt's simple, Your Honor. Just as he is able to see what is happening in court right now... ...Sarge was able to see what happening in the study then. With his cherished drone, of course.Judge:\nAhhh! Now that you mention it... And to think, the answer was right before our eyes this whole time.Apollo:\nSarge! You were perfectly capable of patrolling the study that night! So you must've seen something!Sarge:\nAaaaaaaaaagh! I'm hit! What is this strange new weaponry you're using against me?!Apollo:\nCourtroom warriors don't use guns or missiles, because evidence is our weapon of choice! And the evidence has exposed your bald-faced lie! My truth bomb, Sarge... has stripped your defenses bare!Sarge:\nA t-t... truth bomb?! Noooooooooooo! AAAAAAAAAAAAAAAAAAAAAAAAAAARGH! Mayday, mayday!!! I'm going doooooooown!!!Judge:\nOh, my! Are you all right?!Sarge:\n*cough* *sputter* Evidence... Never have I seen such fearsome ordnance.Apollo:\nTell it to us straight, Sarge. After all, you want to help your father, don't you?Sarge:\nPapa...Apollo:\nYes. You want to find out who killed him, don't you? So please. Tell us what you saw that night.Sarge:\n...It's... It's... It's not what you think. I-I... I... I didn't see anything. I swear...!Apollo:\n...You sure? You seem awfully stressed for someone who didn't see anything.Sarge:\n...Grrrrrrr!Apollo:\nUWAAAAAAHHH! ...S-Sarge. You need to answer my question.Sarge:\nShut your piehole, maggot! It'll be a scorching day in Siberia before a lowly private like you orders me around!Apollo:\n(...What's with him and Siberia, of all places? But if a scorching day is what it'll take, then maybe it's time to turn up the heat.) Hey, Athena. You think a therapy session might help?Athena:\nWell, it could help alleviate some of his anxiety.NOISE LEVEL100%Athena:\n...Plus, I'm picking up a lot of discord in Sarge's voice. That usually means the patient wants to say something, but can't for some reason.Apollo:\nAnd in Sarge's case, I imagine whatever's plaguing him is pretty severe. In that case, I leave it to you and your Mood Matrix magic!Athena:\nYou got it! Your Honor, I believe I can be of help here.Judge:\nTime for a therapy session, is it, Ms. Cykes?Athena:\nYes. It will help the witness with his anxiety -- maybe even enough to testify!Judge:\nThen by all means, please bring the poor child out into the light of day. ...Oh, but I assume this will be all right with you, Mr. Wright?Phoenix:\nWhy not? It's not like we all haven't been through this before.Sarge:\nWh-What are you butting in for, lady?! There ain't a place on this battlefield for you!Athena:Athena:\nI beg to differ, Sarge. This G.I. Jane's always ready for a fight in the courtroom! And wait until you see what I've got in my arsenal -- analytical psychology! With it, I'm going to blow a big ol' hole in the armor you've built around your heart!Sarge:\nUWAAAAAAH! First evidence, now analytical psychology?! Where are these WMDs coming from?! ...W-Well, if it's a battle you want, bring it on! You may have started this war, but I'm going to end it, Corpswoman Cykes!Athena:\nYou got it, Sarge. Time to seek out the agony buried deep in your heart.Widget:\nBrace yourself!Sarge:\nI stayed in my room with my drone that evening.Sarge:\nI heard Datz and Papa arguing with each other.Sarge:\nDatz got kicked out, but I saw him still hanging around outside.Pinpoint Surprised marker\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"That's strange...\"Sarge:\nI was in my room, so I didn't know Papa was dead until the next day.Pinpoint Surprised marker\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"That's strange... You reacted with shock when you discovered your father's body... \"Apollo:\nSo I'm looking for unexpected emotions and unnatural reactions, right?Athena:\nRight -- emotions and reactions that don't fit the content of his testimony. When you find one, make sure you point it out to me. Also, remember not to view his emotional reactions in isolation. Sometimes, it's important to see how they change from one statement to the next.Apollo:\nOkay, I'll give it a try.Apollo:\nThat's strange... You reacted with shock when you discovered your father's body... ...yet, you weren't nearly as shocked then as when you saw Mr. Are'bal. Normally, you'd expect the death of one's father to be much more impactful.Sarge:\n...Enemy fire! Direct hit!!!Athena:\nThat IS strange. I wonder what it could mean.Apollo:\nWell, we know he wasn't as affected by his father's death as he should've been. And I think I know why.Athena:\nOh?Apollo:\nSarge, you weren't as shocked at seeing your father's body as seeing Mr. Are'bal because...You're scared of Mr. Are'bal\n\n\n\n\n\n\n\nApollo:\nMaybe you were scared of him?\nSarge:\nWhy you--! How could you even THINK I was scared of that capitalist pig!\nApollo:\nSo you weren't scared?\nSarge:\nListen up, trainee! You feckless amateurs don't even know what true fear is! Naïve little babies like you wouldn't last two seconds out there. So he's your first lesson, private! A heaping spoonful of true, battlefield terror!\nApollo:\nAAAAAAAAAAAAAAAAAAAAAGH!\nAthena:\nI think that means you were wrong. But there's no need to look so bitter about it, Apollo.\nApollo:\nNo, but that was some bitter medicine... (Ugh, the aftertaste of failure...)\nLeads back to:\n\"Sarge, you weren't as shocked at seeing your father's body as seeing Mr. Are'bal because...\"You'd already seen his body\n\n\n\n\n\n\n\nLeads to:\n\"Sarge...\"Something else shocked you\n\n\n\n\n\n\n\nApollo:\nDid... something else shock you when you saw Mr. Are'bal? Something even more shocking than your father's death?\nAthena:\nHmm, like what exactly, Apollo?\nApollo:\nI don't know... Maybe a mouse or a cockroach?\nAthena:\nEeeuuuwww, gross!!!\nSarge:\nFoolish cannon fodder! Vermin are powerless in the fact of my deadly arsenal! I'll pump 'em full of lead!\nApollo:\nSounds kinda messy, don't you think?\nSarge:\n...Ah! Th-Then I'll develop new weaponry! Maybe a flamethrower'd do the trick...\nApollo:\nS-Sure... As long as you keep it \"for vermin use only\"...\nAthena:\nGuess it wasn't something like mice or cockroaches after all, huh.\nApollo:\nNo, but it was worth a try -- especially to see your reaction. (*sigh* What else could it be...?)\nLeads back to:\n\"Sarge, you weren't as shocked at seeing your father's body as seeing Mr. Are'bal because...\"Apollo:\nSarge... Maybe the truth is, you left your room that night. And that's when you saw it -- your father's body.Sarge:\nI-I saw no such thing!Apollo:\nReally? You didn't see his body? All right then, what DID you see?Sarge:\nErr...NOISE LEVEL70%Athena:\nLook, Apollo! We've lost some noise!Apollo:\nSo, just as I suspected... he really did see something. Sarge! Please. Tell us what you saw.Sarge:\nOoh... B-B-But... .................. ........................... I-I... The moment I saw it, ooh... ...I-I.. I couldn't bear it. I couldn't stand to lose yet another loved one.Apollo:\nHuh? (Am I missing something here?) Is that you weren't very shocked when you found out your father was dead? Because you had already sensed he was a goner somehow?Sarge:\nM-Maybe...Apollo:\nPlease, Sarge. What was it you saw on the night of your father's murder?Sarge:\nOoh... Gah gah gah gah. I-I... I saw... ...Agh. Gah. Hrgh. Aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaah! UHWOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!Apollo:\nWh-What's happening?! (I don't like where this is going...)Sarge:\nYAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAARGH! NO MORE! NO MORE, PLEEEEEEAAASE!!!Athena:\nEeeeeek!Widget:\nHelp!Sarge:\nI've confiscated your little toy! The battlefield has no place for unauthorized equipment!Athena:\nW-Widget...! A-Apollo! I can't continue the rest of the session without him!Judge:\nC-Calm yourself this instant, witness! I hereby order you to submit to your therapy session! What in blazes...?!Sarge:\nLookit me! I'm judge, jury, and executioner now! I hereby convene a military tribunal!Apollo:\nWhoa, whoa... This has gone way too far.Judge:\nB-Bailiff! Arrest that drone this instant!Sarge:\nRAAAAAAAAAAAAAAAWRRRRRR!Bailiff:\nStop resisting! AAAAAAAAAAAAAAAAAAAGGGHHHHH! If you don't come quietly, I'll--!Sarge:\nFIIIIIIIIIIIIRRRE!Bailiff:\nAAAAAAAAAAAAAAAAAAAAAAAAAAH!Athena:\nGive Widget back right-- EEEEEEEEEEEEEEEEEEKKK!!!..................................................................Athena:\n*huff* *puff* *cough, cough* Whew, finally got him back.Apollo:\nNice work.Judge:\nHmm... This witness is truly a handful.Sarge:\nOoh... hup, two, three, four... Uwoooooooooooooooooooooooooooh!Phoenix:\nMs. Cykes, what is the witness's current psychological state?Athena:\nLet's see... He's emotionally all over the map.Apollo:\nSo his out-of-control emotions are in control of him, huh. Does that mean we can calm him down if we can figure out the root cause?Athena:\nYes. So let's see what we can find. Sarge! Can you hear me?Sarge:\nOoh... I-Is that you, Corpswoman Cykes?Athena:\nI'm here. Now, I want you to take a few deep breaths. Just try to relax. Try it with me. Breathe in, breathe out. Breathe in, breathe out.Sarge:\nIn... Out... In... Out...Athena:\nAnd now... Let your emotions take you where they will. Go on, just let it all out!Sarge:\nUHWOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOH!!! All forces, attaaaaaaaaaaaaaaaaaaack!Apollo:\n(...That's the LEAST relaxing breathing exercise I've ever seen.)Sarge:\nDatz was still hanging around after he got kicked out when...Sarge:\n...I heard more fighting, and I got worried about Papa.Sarge:\nSo I left my room, but suddenly...Sarge:\n...I got dizzy and passed out.Sarge:\nI remember a flame lighting up the room...Probe Flames\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"That's it!\"Sarge:\n...and Papa grinning with delight.Probe Flames\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"That's it!\"Sarge:\nThat's when he must have been killed. If only I hadn't passed out!Apollo:\nSo he has two out-of-control emotions, huh. And all we have to do is find out what's causing them to run wild like this?Athena:\nYes. Whatever the cause, it should appear somewhere in the Mood Matrix. Let me know if you think you've found it.Apollo:\nUgh... Easier said than done. Don't suppose you have any ideas on where to start?Athena:\nWell... I would think about Sarge's personality and his past. Those are the things that shape a person's emotions. You should be able to find something to work with from there!Apollo:\nThat's it! Sarge... You were overcome with shock and fear when you saw those flames, weren't you?Sarge:\nWas I...?Apollo:\nYes. Just six months ago... ...you and your mother were caught up in an arsonist's blaze. So it's no wonder you would be extremely scared of fire.Sarge:\n...Y-Yes, that does make sense.Athena:\nAnd maybe, just maybe... ...your subconscious fear of fire was what caused you to withdraw from the world.Sarge:\nWhat do you mean, Corpswoman Cykes?Athena:\nIn the outside world, you were bound to come across all sorts of fire. Candles, cigarettes... heck, even the grill at a diner. Even if it's not that often, just the idea that you might see them... ...grew bigger and bigger until you couldn't shut it out.Sarge:\n...! I... I think you might be onto something. Candles, cigarettes... Just thinking about them sends a chill down my spine.Apollo:\n(Wow, the things I take for granted.)Sarge:\nNow I see. I was afraid... Afraid of the fire. Strange, I didn't even realize it myself.Apollo:\nAbout that fire, Sarge... Can you tell me what it was burning?Athena:\nJust stay calm and maybe something will come to you.Sarge:\nOh, umm... ............. ..................Oh! I'm starting to remember! I-It was...! It was that relic! That relic Papa was studying... It was on fire!Apollo:\nThe orb... was on fire?Sarge:\nMm-hm. It's still kind of fuzzy...  ...but yes, the \"orb\" was burning right in front of Papa. And there... in the flames was... ...Mama? Yes! Now I remember... I saw Mama appear amid the dancing flames!Apollo:\nWait... WHAAAAAAAAAT?!NOISE LEVEL30%Apollo:\nWh-What's going on here?Athena:\nMaybe it's a memory from the fire that killed his mother. Hmm... He might be confusing it with what really happened when his father died.Apollo:\nSo let me guess... More therapy?Athena:\nYep. But this time, it seems there's an inconsistency in his statements. And I think we should be able to prove that with the evidence at hand.Apollo:\n(I hope this inconsistency is the key... ...to proving that the relic is really the Founder's Orb!)Sarge:\nDatz was still hanging around after he got kicked out when...Sarge:\n...I heard more fighting, and I got worried about Papa.Sarge:\nSo I left my room, but suddenly, I got dizzy and passed out.Sarge:\nI remember a flame lighting up the room, and Papa grinning with delight.Sarge:\nThe relic was on fire, and I saw Mama's face inside.Sarge:\nThat's when he must have been killed. If only I hadn't passed out!Present Founder's Orb\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Don't blame yourself, Sarge.\"Athena:\nI believe Sarge's fear of fire is triggering a past memory. As a result, the memory of what he really saw is being suppressed. When he tries to remember, the past memory is being overlaid onto the more recent one.Apollo:\nWow, the mind sure is a tricky beast. So, I'll just have to find an inconsistency?Athena:\nRight. Once you find an inconsistent statement... ...present the evidence that proves it.Apollo:\n(The main issue here is when the doctor was murdered. Was he really killed while Datz was there?)Apollo:\nDon't blame yourself, Sarge. After all, even if you hadn't passed out... ...the outcome would've been the same.Sarge:\nWhat do you mean?Apollo:\nI'm talking about the time of death. Your father wasn't killed right after you left your room.Sarge:\nWh-What?! Explain yourself at once, Private Justice!Apollo:\nYou said you saw your father burning the orb, right? But that night, he went out to hide it in a cave. So, what you saw, Sarge... ...was something that happened before your father left to hide the orb.Sarge:\nAh!Apollo:\nSo you see, you didn't pass out right before he was killed. You passed out right before he left for the cave, to hide the orb in the ruins within.Sarge:\nS-So, even if I hadn't passed out...Apollo:\nThat's right. The outcome would've been exactly the same. That's because your father, Dr. Buff, was killed after he returned from the ruins. And therefore, Sarge, there's no need to blame yourself.Sarge:\nOh... I see... .............. ................................ Private Justice... Can... Can you really say I bear no blame in this?Apollo:\n...Why do you ask?Sarge:\n.........Because... the truth is... ...if I hadn't engaged in my siege defense, Papa would still be alive.Apollo:\nSarge...Sarge:\nPapa wished nothing more than for me to lead a happy, healthy life. That's why he quit his job and moved us out, away from the big city. But even then, I didn't have the courage to set foot into the outside world. And in the end......I failed to make Papa's wish come true.Sarge:\n.....................???:\n...Um, Sarge?Athena:\nIf you want to make your father's wish come true... If that's what you really want... ...then who's to say it's too late? Why don't you take the first step now?Sarge:\n...My first step?Athena:\nThat's right. You can cast off all your regret. You can stop standing still and start moving forward. You have the power within you. I know from experience. I know what's it like to feel like you do. But only you... only you can decide to take the first step!Sarge:\n................................Apollo:\nIf you don't change your tactics now, Sarge... ...the victory you seek in the war you're waging will always lie beyond your grasp.Sarge:\n................................................ Hmm... I think I understand now. I've... I've made up my mind!Apollo:\n!Sarge:\nAs of this moment... ...I will suspend my siege defense indefinitely!Apollo:\n...............Huh????:\nS-Sergeant Buff, r-reporting for duty.Apollo:\nWHAAAAAAAAAAAAT?! I-I-I thought you were a guy!Athena:\nYou're DEFINTELY not the gruff drill sergeant I envisioned!???:\nW-Well, my mama was in the Russian army.Phoenix:\nI was just as shocked, but it certainly explained a few things when I found out, too. May I introduce to you Miss Armie Buff, age twelve. (Changed from [May I introduce to you Miss Armie Buff, age 12.] in the original release)Apollo:\nN-No way...Armie:\nCareful, soldier! Don't forget I could blow you away at a moment's notice!Athena:\nS-She's just too cute...Apollo:\nSo... Have you always been in a wheelchair, Sarge?Armie:\nNegative. Only since I was injured... in the fire.Judge:\nUmm... Your voice sounds awfully different from before.Armie:\nMy drone features a voice modulation device. It's just one of my army's many technological marvels.Judge:\nWell, you fooled me. I thought some twenty-something military fanatic was at the controls.Armie:\nI-If it's all the same to you, troops, I'd like to continue my testimony! I've just remembered something! And it's as crisp and clear as a trumpet at roll call.Apollo:\nWhat did you remember?Armie:\nIt wasn't my mother who appeared in the burning orb. It was some lady Papa had shown me a picture of a long time ago. He said it was the Holy Mother, the founder of Khura'inism. She appeared right there, right in the burning orb!Apollo:\nHuh...?!Phoenix:\nWhat did you just say?!NOISE LEVEL0%BYE BYEAthena:\nThe Holy Mother of Khura'inism was in the burning orb? Wh-What does that even mean?Phoenix:\n...I have a bad feeling about this.Apollo:\nCould it be...? Could this explain what Sarge means by the Holy Mother appearing in the burning orb?Present Research Notes\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"Dr. Buff's research notes? What do they have to do with this?\"Present anything else\n\n\n\n\n\n\n\nApollo:\n\nArmie:\nWhat's that?\nApollo:\nA piece of related evidence. Wouldn't you agree? Although, to be honest, I'd have to plead the fifth if you asked me how certain I was.\nSarge:\nPrivate! Did you really think such a cockamamie plan would rout out the enemy?!\nApollo:\nYiiiiiikes! {I'd better be more careful!)\nAthena:\nIf the orb was burning, maybe the evidence you're looking for has to do with fire.\nApollo:\nYeah, I know.\nLeads back to:\n\"Could this explain what Sarge means by the Holy Mother appearing in the burning orb?\"Athena:\nDr. Buff's research notes? What do they have to do with this?Apollo:\nLook at this! The burning orb, the appearance of the founder -- this part points to both!Present third stanza of Song of Ceremony\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"There's a legend about the orb involving a mysterious riddle.\"Present anywhere else\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nIt's all... right here!\nAthena:\nUmm.. I'm not seeing it.\nApollo:\nWell, it's... Maybe you can explain it, Athena.\nAthena:\nI'M not the one who's supposed to explain things when YOU'RE the one presenting!\nApollo:\n(Yikes, she's really mad. I'd better come up with something before her anger burns me to a crisp.)\nLeads back to:\n\"Look at this! The burning orb, the appearance of the founder -- this part points to both!\"Apollo:\nThere's a legend about the orb involving a mysterious riddle. And this song, in turn, is said to contain the key to solving it. If the legend is true, then I believe the answer lies in this part of the song: \"Offer thy prayers as fervent as fire Only then shall the Holy Mother return.\" ...Well? Anyone see where I'm going with this?Phoenix:\nPrayers as fervent as fire... ...Ah! You're supposed to... set the orb on fire?Apollo:\nThe whole stanza seems to suggest that the founder will appear if the orb is set on fire.Athena:\n...Wait! S-So the doctor! He...!Apollo:\n...Yes, Athena. He had solved the ancient riddle of the Founder's Orb!Judge:\nOh, my!Armie:\nPapa was a great archeologist. So I believe in him... and I want to believe... I want to believe he achieved his long-time dream of solving that riddle before he died.Apollo:\nWell, we won't know for sure... until we try it for ourselves.Armie:\nYes, do it, Private Justice. Please! I want to see what Papa was searching for with my own eyes!Phoenix:Phoenix:\nThe, uh... The plaintiff must object to this!Apollo:Apollo:\nThe plaintiff will stand down and be quiet!Phoenix:Phoenix:\nY-You don't have the right to set a precious relic like that on fire!Apollo:Apollo:\nOh, but I do. All I needed was Sarge's permission. Since we still don't know if this treasure if the Founder's Orb or the Crystal of Ami Fey... ...any ownership rights the doctor had now belong to his daughter. Therefore, you have absolutely no right to stop us!Phoenix\n...Gnrk!Judge:\nVery well, Mr. Justice. I never thought I'd be saying this, but you may burn the evidence.Apollo:\nAll right, here we go!Apollo:\nLook!Athena:\nA-Apollo! The inside of the orb... It's melting!Apollo:\nThere's something in there... Ahhhhhhhhhh! Dh-Dhurke! Isn't she...?Dhurke:\nHer garb leaves no room for doubt. It's the founder herself! Face and all...Dhurke:\nI-I don't understand. The greatest of taboos in Khura'inism... ...is the depiction of the founder's face. Yet here it is, hidden within this orb!Founder's Orb updated in the Court Record.Apollo:\nSorry, Mr. Wright, but as you can see, the issue is \"crystal\" clear. This figure is the Holy Mother, founder of Khura'inism. And based on that, this must be none other than the Founder's Orb!Phoenix:Phoenix:\nB-Be that as it may, Mr. Are'bal still may have killed the doctor! If so, it would render the Orb Transfer Agreement null and void!Apollo:\nDon't play dumb, Mr. Wright. The truth of the matter has already been proven! Dr. Buff wasn't killed right after Sarge saw Mr. Are'bal. It happened after the doctor came back from hiding the orb. And you've no proof that Mr. Are'bal was still around at the time!Phoenix:\n...Urrrrrrrgh.Apollo:\nYour claim that the Defiant Dragons were behind the crime doesn't hold water. And that means the Orb Transfer Agreement is still perfectly valid.Phoenix:\n...Arrrrrrrgh.Apollo:\nAdmit it, Mr. Wright. I just burned your whole case to the ground!Phoenix:\nOoh... NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!Apollo:\n(I won? I actually won?)Judge:\nM-Mr. Wright! Would you care to respond?Phoenix:\n.........R-Respond? ...Um...Apollo:\n(I didn't think so!)Athena:\nWait, did we just win? Did we actually beat the Turnabout Terror?! You're amazing, Apollo!Atishon:\nDon't just stand there, Wright! Do something!Phoenix:\n...Umm, well... I don't think there's any digging out of this hole.Apollo:\nMr. Atishon-Wimperson, I think it's time for your concession speech. I have proven beyond a shadow of a doubt that this is the Founder's Orb. The facts don't lie, but you obviously do. How's that for a campaign slogan?Atishon:\nWh-Why you contemptuous peasant...!Judge:\n...Hmmm. I think this is a good time to wrap up this trial. If both parties have no further objections, I will render my verdict.Apollo:\nNo objections here, Your Honor.Phoenix:\nErr... Um... No ob--Atishon:Atishon:\nYou can't do this. The crystal is mine! I'll lose the election if I lose that crystal!Phoenix:\nI'm sorry, but there's really nothing more I can do.Atishon:\n...You haven't forgotten about our little chat... have you?Phoenix:\n! ..........Apollo:\n(What's going on here?)Phoenix:Phoenix:\n...Y-Your Honor. I...I object to the defense's last claim!Apollo:\nWhat?!Phoenix:\nI don't believe they have truly proven that the relic is indeed the Founder's Orb.Apollo:Apollo:\nMr. Wright. I don't think even you could bluff your way out of this one! What possible argument could you have to claim that this isn't the Founder's Orb?Phoenix\n.........Um, about that... ...................Oh, of course!Apollo:\n.......... (H-He can't possibly have hit on something...)Phoenix\nThe defense's assertion is incomplete, and here's why. Their claim that this relic is the Founder's Orb is based on a legend. (Changed from [The defense is basing their claim that this relic is the Founder's Orb on a legend.] in the original release) And that legend claims that the founder will return when the riddle is solved at last.Apollo:\nRight. And that's what happened. The founder was revealed for all to see.Phoenix:\nBut Mr. Justice, what about the rest of the legend?Apollo:\nHuh?Phoenix:\nAccording to the legend, once the founder returned... ...she would bestow spiritual power onto the person who solved the riddle.Apollo:\n..........Y-You're kidding, right?Phoenix:\nWell, Mr. Justice? Do you feel great spiritual power coursing through your veins?Apollo:\nUm.......... no. B-But receiving spiritual powers and stuff... It's all just mystic mumbo-jumbo, right?Phoenix:\nMaybe so, but you're the one basing your claim on said legend. And what we saw here does not fully fulfill it, does it?Apollo:\nN-No, but...Phoenix:\nConsequently... You cannot rightfully claim that this is the Founder's Orb!Judge:\n..........Atishon:\n..........Apollo:\n....................Apollo:\n(What's gotten into him? Why is Mr. Wright doing this?)Judge:\nHmm... It would appear that Mr. Wright has lost a few of his marbles.Phoenix:\n...Th-That couldn't be further from the truth, Your Honor.Judge:\nIn any case... I believe this a good time for a recess. Both sides will have twenty minutes to prepare. (Changed from [I believe this a good time for a recess. Both sides will have 20 minutes to prepare.] in the original release) I ask that all arguments be ready by then. Oh, and Mr. Wright? You'd do well to wash up and find your missing marbles by then, too.Phoenix:\n....................May 17District Court - Defendant Lobby No. 3Athena:\nMr. Wright is sure acting funny. I mean, he's famous for going out on a limb, but that last assertion was just plain crazy.Apollo:\nIt's either a bluff or a Hail Mary. Either way, it doesn't make much sense.Trucy:\n...Maybe there's something we're missing here. Although, he seemed perfectly normal when we spoke earlier.Athena:\n...Apollo, I have a bad feeling about this. I'm going to go check up on him.Apollo:\n(What's going on with you, Mr. Wright...?)???:\nHey. Private Justice.Apollo:\n...Oh, Sarge.Armie:\nI forgot to mention something. O-On the night of Papa's murder, a strange thing happened.Apollo:\nOh? But why are you only telling me about it now?Armie:\nWell... I didn't say anything before because I thought Papa's death was an accident. But now that we know otherwise, I figured it might be important.Apollo:\n(There's still more to this case?)Armie:\nWhen I left my room and lost consciousness, I passed out right here.Apollo:\nThat's right above the coffee bar.Armie:\nMm-hm. But when I came to... ...someone was pushing my wheelchair.Apollo:\nWhat?!Armie:\nI was so scared, I beat a hasty retreat -- as fast as my wheels could take me!Apollo:\nDo you know who it was?Armie:\nNo. It was pitch black. Plus, I fled to my room so fast, I didn't even have a chance to turn on the lights.Apollo:\nMaybe it was your father.Armie:\nNo, he would have said something to me. Besides, I'd have known if it was him.Apollo:\nSo then, it could've been... ...your father's real killer?Armie:\nMy thoughts exactly.Apollo:\nBut you didn't report this to the police?Armie:\n...I-It didn't even occur to me.Apollo:\nIt's okay. You were obviously still upset, so don't bear yourself up over it.Dhurke:\nApollo, this could be really important information. I think the act of pushing Sarge's wheelchair could be part of some bigger scheme. It's hard to see why else the killer would do such a thing.Apollo:\n(Guess I should take her statement down as evidence.)Armie's Statement added to the Court Record.Apollo:\nOh, welcome back, Athena. ...Hm? (What's with the long face?)Athena:\n..........Apollo:\nHow'd it go with Mr. Wright?Athena:\n.......... What should I...?Apollo:\nAthena?Athena:\nOops, sorry! Zoned out there for a sec. The recess is almost over, so let's go! Ha, a-ha ha.Apollo:\n........ (What was that all about?)May 17District Court - Courtroom No. 6Judge:\nAll right. Court is, once again, back in session. Now, umm... Mr. Wright. About that last objection you raised...Phoenix:\nWe, the plaintiffs, still believe that the defense has yet to sufficiently prove its case. They claim that, according to legend, the Founder's Orb would bestow spiritual power... ...yet the relic in question has failed to do so. Therefore, it has failed its own test.Judge:\nI-I see...Apollo:\n(He's sticking with that ridiculous argument?)Phoenix:\nFurthermore... ...even if is the Founder's Orb, it can't be awarded to the Defiant Dragons. After all, they were the ones who killed Dr. Buff.Apollo:Apollo:\nWhat are you talking about? That was already proven to be false. There are no grounds for asserting that the Defiant Dragons murdered the doctor!Phoenix:\nOh, but I'm afraid there are, Mr. Justice. ...Your Honor. I would like to present new testimony to this court. Testimony that will show that Datz Are'bal did, in fact, kill Dr. Buff!Apollo:\nWhat?!Judge:\nVery well. You may call your witness.Athena:\nI guess Mr. Wright found another new angle.Apollo:\nWhat new testimony could there be this late in the game?Atishon:\nFellow citizens! It is I, Paul Atishon, the once and future representative of the people!Apollo:\n(Jeez, not him again.)Phoenix:\nMy client divulged new information to me during the recess. He remembered something he saw, you see -- something crucial to this case.Apollo:\n(How very convenient...)Witness Testimony-- Datz's Crime --Atishon:\nIt was around 11 at night, and I was out on a mobile meet-and-greet around the village.\nThat's when I saw Dr. Buff being murdered from outside his study window!\nMr. Are'bal snuck up from behind and struck him on the head.\nHis weapon of choice: a suitcase.\nA big, strong man like him could easily swing a heavy suitcase into someone's head.Apollo:\nYou saw the murder as it happened?! And you're just telling us now because...?Atishon:\nHeh heh heh. I saved the best for last. It's a tactic known to all the political greats.Phoenix:\nThe murder weapon was a complete mystery... ...but my client's eyewitness account has finally brought it to light.Judge:\nAccording to the autopsy report... ...Dr. Buff was struck in the head by the corner of some object. I suppose that could very well be the corner of a suitcase.Apollo:Apollo:\nBut eyewitness testimony isn't the same as hard evidence!Phoenix:\nOh, I wouldn't worry about that if I were you.Apollo:\nWhat's that supposed to mean?Phoenix:\nWe have physical evidence, too. A luminol test revealed... ...the doctor's blood on Mr. Are'bal's suitcase.Apollo:\nR-Really?! But how does that prove that Mr. Are'bal used it as a weapon?Phoenix:Phoenix:\nYou should know the answer to that, Mr. Justice. Since you know was well as I that the suitcase is covered in his fingerprints.Apollo:\nAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAH! (I forgot we'd dusted it right in front of Ema!)Athena:\nThe Turnabout Terror strikes again.Judge:\nHmm... This is quite convincing testimony and evidence. Nevertheless, you may proceed with your cross-examination, Mr. Justice.Cross ExaminationCross Examination-- Datz's Crime --Atishon:\nIt was around 11 at night, and I was out on a mobile meet-and-greet around the village.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou were on a so-called \"mobile-meet-and-greet\" at 11 at night?\nAtishon:\nThat's right. It's the perfect time because everyone is at home. You should have seen how the villagers' eyes teared up when they heard what I had to say.\nApollo:\n(With tears of frustration, no doubt.) You weren't riding around in your palanquin?\nAtishon:\nThat's right. Some village idiot reported me to the police. I've been banned from using it after dark.\nAthena:\nNo wonder, what with all the noise he makes.\nApollo:\nSo, what exactly did you see, then?Atishon:\nThat's when I saw Dr. Buff being murdered from outside his study window!Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nSounds like you witnessed something rather shocking.\nAtishon:\nIndeed. I didn't even believe it at first. I mean, a vicious murder, in Kurain?\nApollo:\nThere haven't been many murders there, I take it?\nAtishon:\nIf I'm elected, I promise you that such a terrible tragedy will never happen again! A vote for me is a vote to banish murder forever from our beloved Kurain Village!\nApollo:\n(Yeah, good luck with that.)\nJudge:\nMr. Atishon-Wimperson, please tell the court what you saw at the scene of the crime.Atishon:\nMr. Are'bal snuck up from behind and struck him on the head.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nHe snuck up from behind? So you're saying the doctor never even realized Mr. Are'bal was there?\nAtishon:\nThat's right. He was utterly absorbed in a book. \nApollo:\n...I see. What did you see Mr. Are'bal do next?\nAtishon:\nHe climbed up the bookshelf ladder and dumped a bunch of books down on the body. I believe he was trying to make it look like an accident. But that idiot didn't realize I could see everything from outside the window.\nApollo:\n(One of those statements doesn't feel right.) Your Honor, I believe the witness made an important statement just now about how...\n\n\n\nThe crime was clearly visible\n\n\n\n\n\n\n\nApollo:\nIf the crime was visible through the window, that's earth-shattering testimony!\nJudge:\n...Is it? Because to my ears, it sounds like a rather obvious fact.\nApollo:\n...Oh, sorry. I'm good, then.\nJudge:\nHmmm... Very well. Will the witness please continue with his testimony?\nLeads back to cross-examination\n\n\n\n\nThe doctor was reading a book\n\n\n\n\n\n\n\nApollo:\nThe doctor was reading a book at the time of the murder...? That's vital testimony!\nJudge:\nVery well. The witness will please add that statement to his testimony.\nAdds statement \"The doctor was standing in front of the bookshelves, absorbed in a book.\" if not already added\n\n\n\n\nDatz is an idiot\n\n\n\n\n\n\n\nApollo:\nThe witness said Mr. Are'bal is an idiot. That's a key piece of information!\nDatz:\nDon't you jump on the bandwagon, AJ! I'm no idiot, you hear!\nJudge:\nHmm... I fail to see how that is a key piece of information.\nApollo:\n...Yeah, I guess it's not, is it?\nJudge:\nThen it seems there is no need to add it into the witness's testimony. So let's get on with it, shall we?\nLeads back to cross-examinationAtishon:\nThe doctor was standing in front of the bookshelves, absorbed in a book.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nYou watched a murderer commit his crime and did nothing to stop it? That doesn't sound like a good way to score points with the voting public.\nAtishon:\nI'm a politician, not a superhero! I'm under no obligation to risk life and limb.\nAthena:\nHe's sure quick to deny his obligations when there's nothing in it for him.\nApollo:\nI'm getting tired of listening to his endless campaigning and flimsy rationalizations.\nPhoenix:\nAbout your testimony, Mr. Atishon-Wimperson... You said Mr. Are'bal struck the doctor from behind when he was absorbed in a book.\nAtishon:\nYes, that's exactly what happened.Present Doctor's Reading Glasses\n\n\n\n\n\n\n\nApollo:\n\nLeads to:\n\"The doctor was standing in front of the bookshelves, absorbed in a book, you say?\"Atishon:\nHis weapon of choice: a suitcase.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo:\nAre you sure?\nAtishon:\nPositive. I saw it with my own two eyes.\nApollo:\nYet, despite your certainty, you kept quiet about it until now?\nAtishon:\nNo, I was waiting. I knew there would be a perfect chance to talk about it later. Information must always be disclosed in a strategic manner. That is one of the lessons of kingcraft, as taught by the Atishon clan.\nApollo:\n(Is there a lesson, by chance, in the Atishon Kingcraft Guidebook on being honest?)\nAtishon:\nAnyway, I saw Mr. Are'bal commit that heinous crime.Atishon:\nA big, strong man like him could easily swing a heavy suitcase into someone's head.Press\n\n\n\n\n\n\n\nApollo:\n\nApollo: \nI would have to agree, that suitcase is really heavy. ...Wait a second. How did you know it was so heavy? For all you knew, it could've been empty.\nAtishon:\nGnrk!\nPhoenix:\n\nPhoenix:\nMy client witnessed the crime in progress. So naturally, he saw Mr. Are'bal straining to lift what was obviously a heavy suitcase. I can't say I'm a fan of you trying to discredit my client by tripping him up, Mr. Justice.\nApollo:\n(But I'm just doing what you always do, Mr. Wright!)Before adding statement\n\n\n\n\n\n\n\nAthena:\nTalk about new testimony. He's totally changed his story.\nApollo:\nIf he had really seen the murder taking place, you'd think he'd have said so from the start.\nAthena:\nMaybe he had some reason to hide what he really saw?\nApollo:\n(If so, that might be our only opening.)After adding statement\n\n\n\n\n\n\n\nAthena:\nDr. Buff was struck from behind while he was absorbed in a book? He must've been really into it.\nApollo:\nHmm... It doesn't add up.\nAthena:\nWhat doesn't?\nApollo:\n(That Paul Atishon is lying. I'm sure of it.)"
    }
  ]
}