{
  "previousContext": "",
  "characters": [
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "Susato Mikotoba",
      "age": "16",
      "gender": "",
      "description1": "A judicial assistant sent to Britain on a study tour. She's the epitome of a refined Japanese lady and a huge help to me always."
    },
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "Mael Stronghart",
      "age": "52",
      "gender": "",
      "description1": "The Lord Chief Justice, who wields absolute authority in judicial matters, including the appointment of lawyers. He's a thoroughly intimidating man."
    },
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "Magnus McGilded",
      "age": "48",
      "gender": "",
      "description1": "The defendant in this case. He's an incredibly wealthy philanthropist with a wonderful reputation in London. I'm to defend him as a test of my worthiness to become a lawyer."
    },
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "Barok van Zieks",
      "age": "32",
      "gender": "",
      "description1": "A prosecutor known as the Reaper of the Bailey. Supposedly, the souls of those he prosecutes are eternally damned, one way or another."
    },
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "'Thrice-Fired' Mason",
      "age": "54",
      "gender": "",
      "description1": "The victim. A skilled but poor brickmaker who apparently owed the defendant a considerable sum of money."
    },
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "Beppo",
      "age": "62",
      "gender": "",
      "description1": "The driver of the omnibus on which the murder took place. He's an eyewitness to the incident."
    },
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "Bruce Fairplay",
      "age": "34",
      "gender": "",
      "description1": "A gentleman who works as a city banker. He witnessed the incident from his seat on the roof deck of the omnibus."
    },
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "Lay D. Furst",
      "age": "21",
      "gender": "",
      "description1": "An apprentice milliner who witnessed the incident from his seat on the roof deck of the omnibus."
    },
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "Gina Lestrade",
      "age": "17",
      "gender": "",
      "description1": "A young woman who witnessed the incident from her hiding place aboard the omnibus on the night of the murder. She was discovered by the defendant."
    }
  ],
  "evidences": [
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "Armband",
      "type": "",
      "obtained": "",
      "description1": "An armband I inherited from Kazuma. It identifies the wearer as a defence lawyer throughout the Empire of Japan."
    },
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "Autopsy Report",
      "type": "",
      "obtained": "",
      "description1": "A report prepared by the Scotland Yard coroner. It gives the cause of death as internal haemorrhaging as a result of a single stab wound to the abdomen."
    },
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "Crime Scene Photograph",
      "type": "",
      "obtained": "",
      "description1": "A photograph of the victim taken on the omnibus. The knife in his abdomen is clearly visible, but his face is partly obscured from view by an old, crooked hat."
    },
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "Defendant's Leather Gloves",
      "type": "",
      "obtained": "",
      "description1": "The leather gloves the defendant was wearing at the time of the incident. There is a bloodstain on the right glove."
    },
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "Omnibus",
      "type": "",
      "obtained": "",
      "description1": "The eight-seater omnibus that was the scene of the crime. There were passengers both inside the carriage and on the roof deck that night.",
      "description2": "The scene of the crime. There is a bloodstain visible on the frame of the skylight when it's open."
    },
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "Murder Weapon",
      "type": "",
      "obtained": "",
      "description1": "A largish knife that was found lodged in the victim's abdomen. Its quality and fancy ornamentation suggest it must be quite valuable."
    },
    {
      "currentChapter": "The Adventure of the Runaway Room",
      "name": "Debtors' Ledger",
      "type": "",
      "obtained": "",
      "description1": "A catalogue of people who had borrowed money from the defendant at a high rate of interest. It includes the victim, who owed twenty guineas.",
      "description2": "Among the defendant's list of debtors is Bruce Fairplay, who would have been due to repay his loan imminently."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "The Adventure of the Runaway Room\n\n\n\n\n\n\n\n\n\nTranscriptEpisode III\nThe Adventure of The Runaway RoomAnime cutscene\nGlancing over my records of the late last century, I am faced by the events of a certain bitter winter. A murder in a carriage as it sped through dense London fog in the dead of night - Though the victim and the perpetrator were the only ones inside, there were multiple witnesses to the crime itself. However, none could have imagined at the time that such a seemingly obvious case as this would end in such a horrendous manner. My friend, Mr Herlock Sholmes, once said of the incident, 'I believe that perhaps that case was indeed the \"prelude\" - the beginning of a long concerto that impressive Japanese student and I were to play together.'Anime cutscene\nRyunosuke:\nAmazing... Is...is this really just a railway station?Susato:\nRailway station or not, I've never seen such an enormous building before.Ryunosuke:\nAnd look at all the steam locomotives. This country is incredible.Susato:\nWah... I feel like...like I'm dreaming.Ryunosuke:\nSo this...is the capital of Great Britain...Man:\nSo...where to?Ryunosuke:\nOh, hello!Man:\nClimb aboard. I'll take you wherever you want to go.Susato:\nIn that case, um...the Supreme Court in Whitehall, if you wouldn't mind.Man:\nMy pleasure. I suppose you're...visiting students from abroad, eh?Ryunosuke:\nYes.Man:\nThought so. Well then, I hope you enjoy your stay. And welcome...to the centre of the world: Great Britain's mighty capital, London!18th February, 9:21 a.m.\nBritish Supreme Court, Lord Chief Justice's OfficeExamine evidence\n\n\n\n\n\n\n\n\n\nArmband\n\n\n\n\n\n\n\n\n\nInsignia on front\n\n\n\n\n\n\n\nRyunosuke:\nThese are the Scales of Justice. They're a symbol of the defence, aren't they?\nSusato:\nYes, that's right. The scales are a symbol of fairness, to show that all are treated equally in the eyes of the law. And they're a warning to those who enter the courtroom without an impartial mind. \nRyunosuke:\nBut if they're the mark of the defence... ...it would be more auspicious if they were weighing more heavily on the 'not guilty' side, I think. \nSusato:\n......... Very impartial, I'm sure.\n\n\n\n\nInside of armband\n\n\n\n\n\n\n\nRyunosuke:\nThe lawyer's name is embroidered on the inside here, look. 'Kazuma Asogi'... This was his band, of course. \nSusato:\nHe had his heart set on this study tour in Great Britain. \nRyunosuke:\nI'm sure he would have found the truth he longed for here. (...But he lost his life before he even had the chance to see the place.)\nSusato:\nI have such a strong sense of his hopes and dreams when I look at this armband, though.Susato:\n.........Ryunosuke:\n...What an incredible place!Susato:\nIt's so...imposing. It's, it's almost suffocating...Ryunosuke:\n(This place is breathtaking...! It looks like a fortress!)Susato:\nThere are some stone buildings like this in Japan now, of course. But they've only been built in the few short decades since we opened our borders to the outside world. An authentic example like this has quite a different impact, wouldn't you agree? A far cry from the wood and paper most of our buildings are constructed from.Ryunosuke:\nIt's certainly...unfamiliar... (...But I think there's more to the differences than just construction materials...) What is this place again...?Susato:\nThis is the Lord Chief Justice's office, Naruhodo-san. In the Supreme Court of Great Britain.Ryunosuke:\nThe Lord Chief Justice...Susato:\nWe had instructions to report here at this time. If...circumstances were different... ...we were supposed to let the Lord Chief Justice know that we had arrived from Japan.Ryunosuke:\n......... But Kazuma can't.Susato:\nNo... So instead, we are here in a different capacity. As envoys, to report the news of Kazuma-sama's death.Ryunosuke:\nYes...Susato:\nAnd having delivered his or her message, an envoy's duty is done.Ryunosuke:\n(So...we'd have to return to Japan.)Susato:\nIf we want to remain here in Great Britain...Ryunosuke:\n...I have to take Kazuma's place as the law student selected for the study tour.Susato:\nYes. Which means you need the requisite qualifications as a lawyer.Ryunosuke:\nWhich is what I've been studying for.Susato:\nHere in Great Britain, it is the Lord Chief Justice who appoints lawyers. So that's the second reason why we're here. To have you officially recognised as a lawyer. It's the only way that we'll be able to remain here in London.Ryunosuke:\n......... (I hope I'm up to scratch...)Ah, good morning. \nSorry for keeping you.Ryunosuke:\nOh...???:\nI trust you aren't too exhausted after your long voyage from Japan? Hmph. It seems I'm one hour, twelve minutes and... forty-seven seconds late. My apologies.Ryunosuke:\nOh! No no. Don't mention it! We're never happier than when we're standing around with nothing much to do!???:\n...How fortunate.Stronghart:\nSo, introductions... I am Mael Stronghart, Lord Chief Justice of the British Empire.Ryunosuke:\n(Ugh... And I feel like a little mouse under an elephant's foot...)Susato:\nCome on, Mr Naruhodo! Don't be a mouse!Ryunosuke:\nOh, um... It's, it's an honour to meet you, Lord Chief Justice Stronghart! I'm Ryunosuke Naruhodo from the Empire of Japan!Stronghart:\nWell, Mr Naruhodo... Welcome to London! The capital of our glorious British Empire!Ryunosuke:\nAh...yes... Thank you!Examine\n\n\n\n\n\n\n\n\n\nBookshelves\n\n\n\n\n\n\n\nRyunosuke:\nJust look at all the knotty books packed together on these shelves! They go from floor to ceiling!\nSusato:\nAnd they're all books that you couldn't hope to come by in Japan. It's like a dream!\nRyunosuke:\nYes...a very bad dream.\nSusato:\nThey're not all about British law, either. There are books about the judicial systems of other Western nations. France, Germany, Spain, Holland...\nRyunosuke:\nWhat about Russia?\nSusato:\nWhy do you ask?\nRyunosuke:\nI was wondering about asking the Lord Chief Justice how you say 'wardrobe' in Russian. What do you think?\nSusato:\n...I think, perhaps, it's a thought best abandoned.\n\n\n\n\nArmor\n\n\n\n\n\n\n\nRyunosuke:\nLook at these menacing metal giants facing each other across the room!\nSusato:\nI believe they're... Yes, they're suits of armour.\nRyunosuke:\nOh, right... I thought maybe they were like the lion-dogs we have in Japan guarding shrine gates.\nSusato:\nNo, not at all. In fact, in Europe, suits of armour like these are always possessed by evil spirits, you know. And they roam around in the middle of the night.\nRyunosuke:\nReally? ...Is there nothing you don't know, Miss Susato?\nSusato:\nThis book tells me everything I need to know about everything. If you're ever unsure, just ask!\nRyunosuke:\n(Where did she get that incredible tome?!)\n\n\n\n\nGears\n\n\n\n\n\n\n\nRyunosuke:\nIs this...some kind of clock?\nSusato:\nActually, I, I think we might be INSIDE some sort of giant clock. But those gears are larger than anything you'd find on a steam locomotive, even!\nRyunosuke:\nIt's...eerie. Do you think clocks are some sort of hobby of his? The Lord Chief Justice, I mean.\nSusato:\nWell, boys do enjoy fiddling around with machines, don't they?\nRyunosuke:\nI'm not sure you could 'fiddle' with cogs that size! And I'm certain you couldn't call him a 'boy'! (Still, it's amazing how little noise the cogs make, considering how large they are. There's actually something quite soothing about their precise rhythm...)\n\n\n\n\nChair or desk\n\n\n\n\n\n\n\nSusato:\nThis must be the Lord Chief Justice's desk. I believe it's made of marble.\nRyunosuke:\nIt looks more like an over-the-top tombstone that's toppled over to me.\nSusato:\nI think that's your fanciful imagination at work again, Mr Naruhodo.\nRyunosuke:\nIt feels like everything that's normally made of wood and paper at home... ...is made of bricks and stone here.\nSusato:\nI know. That's why this place feels so overbearing, I'm sure.Converse\n\n\n\n\n\n\n\n\n\nLondon\n\n\n\n\n\n\n\nStronghart:\nSo...what are your impressions of our capital so far? How do you like London?\nRyunosuke:\nOh! Um, well...erm... (Help! I've been so nervous ever since I got here that I can't remember a single thing about the city!)\nSusato:\nIt's simply splendid! ...Isn't it, Mr Naruhodo?\nStronghart:\nOh?\nSusato:\nWe had a wonderful view of some of London's streets from the carriage on the way here from the station. Everything is so...impressive and...grand! I must say I'm almost lost for words. \nStronghart:\nI'm glad to hear you like it. The city boasts tramways, piped water and gas - even cables supplying electricity. We spearhead every revolutionary new technology in the world. Every visitor to London is astounded. \nSusato:\nOh yes! Astounded is the word!\nRyunosuke:\n(Thanks for saving me there, Susato-san...)\nSusato:\nAnd everyone seems so jolly and full of vigour!\nStronghart:\nYes. There's much excitement about the upcoming Great Exhibition we will be hosting here in London. \nRyunosuke:\nGreat Exhibition...?\nStronghart:\nCultural and technological achievements from around the globe are to be exhibited here in our great city. It will be the greatest spectacle of its kind in history. ...And will make Paris's World Fair look like a toy shop!\nSusato:\nGosh! I can hardly imagine how magnificent it's going to be!\nStronghart:\nGreat Britain's capital city is nothing but magnificent! London is the centre of the modern world!\nRyunosuke:\n(Even if you do say so yourself...)\nStronghart:\nThe sun will never set on our great empire! Perhaps it is fate that in these progressive times, we welcome visitors from the Land of the Rising Sun.\n\n\n\n\nLaw student\n\n\n\n\n\n\n\nRyunosuke:\nUm...Lord Chief Justice... ...I think you were expecting a student of law for this study tour, weren't you?\nStronghart:\n......... Absolutely. A Mr Kazuma Asogi, if my memory serves. \nRyunosuke:\nThat's right. \nStronghart:\nThe British government has already been telegraphed a full report on the situation. I understand the young man lost his life aboard the steamship bound for our shores. \nRyunosuke:\n(That's amazing! The news reached him before we even arrived...)\nStronghart:\n...My country naturally extends its deepest condolences to yours. \nRyunosuke:\nOh...thank you. \nStronghart:\nAnd you honoured this appointment specifically to inform me of the news?\nSusato:\n...Yes. We are here in the capacity of envoys from Japan to report the sad news in person. \nStronghart:\nThey tell me you Japanese are a people of protocol and courtesy, and I see that it's true. ...And it is with some regret that I must inform you... ...that the death of the young lawyer means this study tour arrangement can no longer proceed. \nSusato:\nIf you would just hear us out, Lord Stronghart. \nStronghart:\n...What do you have to say, madam?\nSusato:\nIt's about the study tour... Mr Naruhodo here would like to make a proposal. \nStronghart:\nWould he now? Well, Mr Naruhodo...?\nRyunosuke:\n(This is it, then. The moment of truth...)\n\n\n\n\nContinuing the study tour (appears after \"Law student\")\n\n\n\n\n\n\n\nRyunosuke:\nThe thing is, Lord Justice, erm... Lord Stronghart... I was wondering if perhaps you would consider allowing the study tour to go ahead?\nStronghart:\n...Don't misunderstand me. Britain would ideally like to see the tour go ahead. But without a lawyer from your country, there's nothing to be done. \nRyunosuke:\nWell, in that case... ...what if there was someone else? Another lawyer from Japan, I mean. \nStronghart:\n......... ...Is there something I don't know?\nRyunosuke:\nUm...\nStronghart:\nOnly a single lawyer was invited to Great Britain from your country. And that was Mr Asogi. ...At least, that is what I've been led to understand. \nRyunosuke:\nWell, um, the thing is... (This really isn't going well at all. I just can't seem to find the right words to say to this man!)\nSusato:\nMr Naruhodo!\nRyunosuke:\n(I could ruin things here if I'm not careful! What am I going to say?) ...If there is someone else here from Japan who could be described as a lawyer, it's...\n\n\n\nActually, there's no one!\n\n\n\n\n\n\n\nRyunosuke:\n(It's only been forty days since Kazuma died. And yes, I've studied as hard as I possibly could. But can I really stand before this terrifying man and claim that I can do the job?) Sorry. I, I don't know what I was thinking. Of course only one lawyer...\nSusato:\n.........\nRyunosuke:\n(Ugh, but I'm not sure if I can stand before this terrifying woman and claim that I can't! I'll end up upside-down on the floor if I do that. ......... Not that I'm scared of a Susato Takedown, obviously. But still, perhaps I should change my answer...) \nLeads to:\n\"It's me. I can do it!\"\n\n\n\n\nIt's Miss Susato!\n\n\n\n\n\n\n\nRyunosuke:\nIt...can probably only be... Yes! Miss Susato!\nStronghart:\n.........\nSusato:\n.........\nStronghart:\nAn unusual introduction. But I presume you mean this charming lady besides you. You're a lawyer, are you?\nSusato:\n.........\nRyunosuke:\n(That look she's giving me... After all the days of hard work she put in to help me study... ...I can't let her down now!) I, I think that's quite enough joking...don't you, Lord Stronghart? My real answer is...\nLeads to:\n\"It's me. I can do it!\"\n\n\n\n\nIt's me!\n\n\n\n\n\n\n\nLeads to:\n\"It's me. I can do it!\"\n\n\nRyunosuke:\nIt's me. I can do it!\nStronghart:\n...Is that so?\nRyunosuke:\n......... I mean, I don't actually have any qualifications as such, but... \nStronghart:\nNo qualifications, you say? And yet you still claim to be a lawyer?\nRyunosuke:\nI, I have acted as a lawyer in court before! ...Only once, as it happens. (And I had Kazuma to help me AND I was the accused! But glossing over the details...)\nStronghart:\n.........\nRyunosuke:\nI've been spending every spare moment on the journey here to Great Britain studying. I've learnt all about British law and court proceedings while I was on board the SS Burya. \nStronghart:\nThe voyage from Japan is some fifty days, I believe. Not what you might call a full education. To become a qualified lawyer here in Britain... ...not only do  you need a university degree in law, you must also complete several years of training. \nRyunosuke:\nI realise it's far too short a period of time. But...I can't just go back to Japan.\nStronghart:\n.........\nRyunosuke:\nKazuma- Mr Asogi's journey had only just begun! Coming here on this study tour was all he thought about! I have to carry on and do everything he planned to do!\nStronghart:\n...!\nRyunosuke:\nI know it must sound like I have an overly inflated opinion of myself. But I would do anything to prove that I have what it takes. Any test you care to set me. Just one chance... That's all I'm asking for. Please!\nStronghart:\n......... Hm, thirty-one seconds.\nRyunosuke:\n...Sorry?\nStronghart:\nYour opening statement there, Mr Naruhodo. It was thirty-one seconds long. Not too brief, not too protracted. A perfectly judged appeal, I would say. ...Which is a skill that would stand you in good stead as a lawyer.\nRyunosuke:\nOh. Thanks.\nStronghart:\nSo, you're willing to put those words to trial, are you? Well, I'm all for entertainment.\nRyunosuke:\nHuh...?\nStronghart:\nBut let me ask you one thing first...sir.\nRyunosuke:\nY-Yes...?\nStronghart:\nYou say you intend to do everything Mr Asogi planned to do. ...Are you firmly set on that path?\nRyunosuke:\nWell...yes. That's my intention.\nStronghart:\nI see...\nRyunosuke:\n(Am I imagining things... ...or did his expression just alter a fraction there all of a sudden?)\nStronghart:\n...Very well. You have your wish. I'll give you a chance. A test to become a specially certified lawyer. Whether you pass or fail is entirely down to you. \nRyunosuke:\nReally?!\nChanges \"Continuing the study tour\" Converse option to \"Test\"\n\n\n\n\nTest\n\n\n\n\n\n\n\nRyunosuke:\nSo...what form will the test take exactly?\nStronghart:\nTell me, Mr Naruhodo, what do you consider the role of a lawyer to be?\nRyunosuke:\nWell, defending people, of course.\nStronghart:\nWell said. So...let's have you defend someone.\nRyunosuke:\n...Huh?\nStronghart:\nYour timing is perfect, in fact. There's an apt trial about to begin later today. No advocate has been appointed for the defence as yet, so this will be welcome news. \nRyunosuke:\nT-Today...?\nSusato:\nStraight away...?\nStronghart:\nIf you manage to secure a verdict of not guilty, you'll have passed my test. What could be simpler?\nRyunosuke:\n(Ugh...how do I get myself into these situations?)\nSusato:\nWell, could I ask...what sort of trial is it, Lord Stronghart?\nStronghart:\nHm, yes, good question. ...Ah, I remember. It's a murder trial.\nSusato:\nA murder?!\nStronghart:\nAn extremely simple case, I understand. You really can't lose.\nRyunosuke:\n(That's easy to say...)\nStronghart:\nBut I should mention, just in case... ...if the defendant is found guilty, he will of course be sentenced to capital punishment.\nRyunosuke:\nCapital punishment?! (He'll, he'll be put to death?!)\nStronghart:\nHere in Great Britain, murderers are sent to the gallows without exception. Presumably you read that much in your short sea-based introduction to British law?\nSusato:\nWe, we can't possibly agree to such a test! We would be toying...with a man's life!\nStronghart:\nI am the Lord Chief Justice. And I've decided it's acceptable.\nRyunosuke:\nBut... (You can't do that! ...Can you?)\nStronghart:\nThere's not need to overcomplicate this. All you have to do is ensure that you don't lose.\nRyunosuke:\n......... (So the defendant may live or die depending on how well I perform in court? If I lose... ...he'll be hanged...)\nStronghart:\nMr Naruhodo! You've come to me claiming to be a lawyer.\nRyunosuke:\n...!\nStronghart:\nIf you want me to take you seriously, you need to prove you're willing to do a lawyer's job. And you say you intend to see through the will of your compatriot, Mr Asogi. ...I would like to understand just how far you're willing to go in order to make that happen.\nRyunosuke:\n(He's testing my resolve...)\nStronghart:\n...What's the matter? You've fallen silent. I'm sorry, but time is pressing. The trial begins shorty. I need an answer from you now. ...What's it to be?\nRyunosuke:\n......... (...What do I say? Do I agree to this absurd test?)\n\n\n\nI'll do it\n\n\n\n\n\n\n\nLeads to:\n\"Alright then, if I have to give you a decision now, my answer is...is...\"\n\n\n\n\nI won't do it\n\n\n\n\n\n\n\nLeads to:\n\"Alright then, if I have to give you a decision now, my answer is...is...\"\n\n\nRyunosuke:\nAlright then, if I have to give you a decision now, my answer is...is... (I can't do it! I can't get the words out!)\nStronghart:\n...Fifteen seconds. Hm, your decision making needs work if you want to be a lawyer. That was too slow.\nRyunosuke:\n...!\nStronghart:\nSo, it's as I suspected, is it?\nRyunosuke:\nSorry?\nStronghart:\nYou have noble intentions, but lack the resolve to see them through.\nRyunosuke:\n.........\nStronghart:\nThe test is cancelled. Thank you for stopping by. Go and acquire your ticket for passage back to the East tomorrow. This conversation is over.\nRyunosuke:\n......... Yes, Lord Stronghart. Thank you for offering me a chance.\nSusato:\nMr Naruhodo...\nRyunosuke:\nI'm sorry, Miss Susato. But what could I do?\nSusato:\nIt's alright. I understand.\nRyunosuke:\nYou do?\nSusato:\nIt's not an easy decision to choose whether to defend a man in these circumstances. But resolve has absolutely nothing to do with it.\nStronghart:\n...What are you trying to say, madam?\nRyunosuke:\n......... I think what Miss Susato means... ...is that no matter how badly I'd like to be recognised as a lawyer and stay here in Great Britain... ...to risk another man's life by treating his one and only chance at a trial so trivially... ...would be utterly unforgivable! And I feel exactly the same way.\nStronghart:\n.........\nRyunosuke:\nI'm sure the defendant won't see this trial as a test. As some kind of experiment.\nStronghart:\n.........\nRyunosuke:\nA lawyer may fight for his clients in court day after day. But for each one of those clients... ...the particular day they stand in the dock may be the only chance they have to fight to prove their innocence. No, I was wrong. I'm not qualified to do that job yet. I'm sorry for wasting your precious time, Lord Chief Justice.\nLeads to:\n\"Wait, Mr Naruhodo.\"Present\n\n\n\n\n\n\n\n\n\nAnything\n\n\n\n\n\n\n\nRyunosuke:\nLord Stronghart, may I show you this?\nStronghart:\nTo accept this item, issue a receipt, examine it thoroughly and make a formal statement of my findings... ...would require something in the region of twenty-four seconds of my time.\nRyunosuke:\nSorry?\nStronghart:\nDoes the item warrant twenty-four seconds of my time, Mr Naruhodo?\nRyunosuke:\n...Let's leave it for now.Stronghart:\nWait, Mr Naruhodo.Ryunosuke:\nOh! ...Was there something else?Stronghart:\nIt's approximately twenty minutes by carriage to the Old Bailey from here. If you leave immediately, you should still be there in time.Ryunosuke:\nBut, but I just said that...Stronghart:\nI was quite serious in what I told you. The defendant in this case has literally no one to advocate for him.Ryunosuke:\nWhat?Stronghart:\nAt this point, he can't hope to find someone to represent him. The trial will begin without a defence. And if that happens, there's only one possible outcome. He will receive the most severe sentence the judge can pass down.Ryunosuke:\nBut that's awful!Stronghart:\nBut that is the truth.Susato:\nWhy does it have to be like this?Stronghart:\n......... Please don't expect an answer to every question.Susato:\n...!Stronghart:\nThe cold, hard truth of the matter... ...is that there is only one person now with a chance to save this man from a very miserable end. And that is you.Ryunosuke:\n......... (I'm really his only hope?)Stronghart:\nSo... ...what do you say now, madam?Susato:\nMe? What do you mean, Lord Stronghart?Stronghart:\nYou said it wasn't an easy decision to choose whether to defend a man in these circumstances. And I agree. But in my estimation...it is purely and simply a matter of resolve.Susato:\nOh!Stronghart:\nOur time is up here. I have a meeting to attend. I must leave in two minutes and sixteen seconds. So! Venture into our great city and enjoy yourselves!Susato:\nHe's gone...Ryunosuke:\nHm, the Old Bailey...Susato:\nIf we're going to do this, Mr Naruhodo, we must leave at once!Examine\n\n\n\n\n\n\n\n\n\nAnything\n\n\n\n\n\n\n\nRyunosuke:\nMiss Susato, can I just ask you something?\nSusato:\nCareful! From this position, I can perform a Susato Takedown in an instant. \nRyunosuke:\n...I know.\nSusato:\nMr Naruhodo, you heard Lord Stronghart. The trial starts imminently. If I need to throw you, I will!\nRyunosuke:\n(You know, you could just say, 'I think we should hurry to the courtroom.')\nSusato:\nIf you need to ask me anything, it had better wait until we're at the Old Bailey.Converse\n\n\n\n\n\n\n\n\n\nWhat to do\n\n\n\n\n\n\n\nRyunosuke:\nMiss Susato, can I just ask you something?\nSusato:\nCareful! From this position, I can perform a Susato Takedown in an instant. \nRyunosuke:\n...I know.\nSusato:\nMr Naruhodo, you heard Lord Stronghart. The trial starts imminently. If I need to throw you, I will!\nRyunosuke:\n(You know, you could just say, 'I think we should hurry to the courtroom.')\nSusato:\nIf you need to ask me anything, it had better wait until we're at the Old Bailey.Present\n\n\n\n\n\n\n\n\n\nAnything\n\n\n\n\n\n\n\nRyunosuke:\nMiss Susato, can I just ask you something?\nSusato:\nCareful! From this position, I can perform a Susato Takedown in an instant. \nRyunosuke:\n...I know.\nSusato:\nMr Naruhodo, you heard Lord Stronghart. The trial starts imminently. If I need to throw you, I will!\nRyunosuke:\n(You know, you could just say, 'I think we should hurry to the courtroom.')\nSusato:\nIf you need to ask me anything, it had better wait until we're at the Old Bailey.18th February, 9:45 a.m.\nThe Old Bailey, Defendants' AntechamberSusato:\nOh, thank goodness, we're in time. There's still fifteen minutes until the trial begins.Ryunosuke:\nI never knew a horse-drawn carriage could go so fast! I thought my teeth were going to rattle loose!Susato:\nDid you hear what I said to the driver when we climbed aboard? 'Get us to our destination in five minutes, driver, and there's a guinea in it for you!' It's one of my favourite lines from the Herlock Sholmes stories! And it worked quite perfectly!Ryunosuke:\nI'm not sure why you're so pleased. I thought we were going to die, AND we had to pay gold for the privilege.Susato:\nWell, at least we arrived here before the trial started.Ryunosuke:\nYes...I suppose there's that.Susato:\nAnyway, I don't understand it. The court clerk said the defendant should be here... ...but there's no sign of him at all.Ryunosuke:\n(So this is the Old Bailey... Even this room for defendants to wait in is grand.)Susato:\nAre you alright, Mr Naruhodo?Ryunosuke:\nI'm feeling tense, that's all. This place gives me the same sense of foreboding that I remember from the Supreme Court in Japan. An oppresive air... Almost as if the building itself is going to crush whoever is about to be sentenced. (It feels like only yesterday that I was the one about to be crushed...)Susato:\nYes, whoever the man you're to defend is, I imagine he's feeling very alone at this moment...???:\n...Top of the mornin' to ya, madam! ...Sir. What are youse doin', followin' me here? Tings are fair desperate, are they?Ryunosuke:\nSorry????:\nWould ya look at those expressionless faces. From the East, are youse?Ryunosuke:\nUm...we're from Japan, yes.???:\nAh, Japan, is it? Right, say no more! So? How much do youse need?Ryunosuke:\nNo no, we're here because-???:\nNo need to explain, fella. I've been there meself, so I have. No place to go! Nuttin' to eat! Barely a penny to your name! And all while in a strange, faraway land!Ryunosuke:\nWell, actually... Haah... We haven't found a place to stay yet, no.???:\n'Tis grand, 'tis grand! Let me start by givin' youse a thousand guineas. Say nuttin' now!Ryunosuke:\nHaah...Susato:\nA, a thousand guineas?!Ryunosuke:\nPlease, Miss Susato! You don't have to shout.Susato:\nBut a thousand guineas is... ...is enough to build an entire mansion in the most prestigious area of Tokyo!Ryunosuke:\nWHAAAAAAAAAT?!???:\n'Tis nuttin' to me at all. I like to ensure I have sufficient funds to weather a rainy day, you see. I've enough wealth to buy the city of London two or three times over.Ryunosuke:\n(...Could that much rain even fall in one day?) Well even so, we couldn't possibly accept such a large sum of money... Agh! (That hit me in the eye!)???:\n...Don't get me wrong, fella. I'm not givin' it ya 'no strings attached'. I'll be wantin' you to do sometin' for me.Ryunosuke:\nOh????:\nTo be honest, 'tis a little embarrassin'. The trial that's about to begin, you see, is for me good self here. I'll be in the dock.Ryunosuke:\n...!???:\nSo now, what I want you to do... ...is come along with me and stand there beside me. Officially, you'd be my lawyer, but...that's just a little detail now.Ryunosuke:\nOh, well, the thing is-???:\nDon't worry about a ting! All you have to do, is stand up there next to me. Nuttin' more. Otherwise, you see... ...the trial is goin' to start without me havin' any kind of representation at all!Ryunosuke:\n(So it was true. The Lord Chief Justice wasn't just making it all up.)Susato:\nUm...I'm terribly sorry to have to ask, but... ...does that mean you're the defendant in this trial????:\n......... Blusterin' blazes! Do youse...? Do youse not know I am? Me? One of London's biggest names?Ryunosuke:\nNo. Sorry. We've only just arrived in the city, you see.???:\nHm...I see... I s'pose it isn't altogether impossible. Well, just next to Hyde Park there in the centre of London is another beautiful park.Ryunosuke:\nSorry? A park? What????:\n'Tis called McGilded Park. Full of blossomin' flowers in the spring and singin' birds and whatnot. I donated it to the city, so I did!Susato:\nAn, an entire park? In central London?!???:\n'A city of smiles', that's my vision for London.McGilded:\nThere's nuttin' Magnus McGilded wouldn't do for the city and its quare old people!Ryunosuke:\nThat's...amazing. I mean, really extraordinary!McGilded:\nAh, but! Now they've the gall to say I'm a good-for-nuttin' criminal! Me! Magnus McGilded! What is the matter with the London police, I ask ya? Hahh...hahh...hahh...Ryunosuke:\n(Alright, don't pass out...)Susato:\nMr Naruhodo... Perhaps now would be a good time to introduce ourselves, while the gentleman catches his breath.Ryunosuke:\nGood idea.McGilded:\nHahh...hahh...hahh...Ryunosuke:\nUm, Mr McGilded, the thing is... ...we're actually here in London to study British law. We're law students, on a study tour from Japan, you see.McGilded:\nHahh...hahh...hahh...Ryunosuke:\nSo...if you don't have a lawyer for the trial yet... ...and you'd be happy to put yourself in our hands, we'll do our best-McGilded:\nWhat was I after sayin', you daft eejit? I've given you a thousand guineas to stand up there next to me, haven't I?Ryunosuke:\n(Well yes, but I wasn't really offering to just 'stand up there next to you'...)McGilded:\n......... Oh, I tink I see what's goin' on here.Ryunosuke:\nSorry?McGilded:\nI know what you're tinkin'. 'This chancer of a fella claims to have more money than the Queen. But if that's true, why the blazes can't he hire the finest lawyer in all of England? Because he did it! That's the only explanation!' ...Well?Ryunosuke:\nUm, well...Exactly\n\n\n\n\n\n\n\nRyunosuke:\n...Yes! Exactly! \nMcGilded:\nWhat now?!\nRyunosuke:\nWell, like you said, if you have all that money but you don't have anyone to represent you in court... ...there's no other logical conclusion than that you're guilty of the charges. \nMcGilded:\n.........\nSusato:\n.........\nMcGilded:\nWell, you call a spade a spade in the East, so you do!\nRyunosuke:\nOh! I'm, I'm sorry. I didn't mean any offence! I still can't express myself very well in English, you see. And I'm never sure what's acceptable to say and what isn't, so...\nMcGilded:\nIs that so? Because you sounded fluent enough when you were tellin' me what a blackguard I must be. \nRyunosuke:\nErrrm... I'm terribly sorry. \nMcGilded:\nWah hah hah hah hah! I can't say that I blame ya for tinkin' it, fella! \nRyunosuke:\nIt, it is a little strange, to be honest. \nLeads to:\n\"Why you don't have a lawyer, I mean.\"Not at all\n\n\n\n\n\n\n\nRyunosuke:\nNot at all! ...Although, it is a little strange, to be honest.\nLeads to:\n\"Why you don't have a lawyer, I mean.\"Ryunosuke:\nWhy you don't have a lawyer, I mean.McGilded:\n......... That would be the fault of the Reaper.Ryunosuke:\nSorry? (Did he just say, 'reaper'?)McGilded:\nAye, the Grim Reaper of the Bailey, Lord Barok van Zieks. He's the prosecutor.Susato:\nThe prosecutor...is the Grim Reaper?McGilded:\nWhen van Zieks stands for the prosecution, they call the accused his 'sacrificial lambs'.Ryunosuke:\n...!McGilded:\nAnd to this day... ...in every single trial in which he's been the prosecutor... ...the accused has been damned!Ryunosuke:\nWhat?!McGilded:\nSo it's reached the desperate situation... ...where there's no one willin' to stand in defence against the fella at all. You could say he's a living legend of the Old Bailey.Susato:\nGoodness... Lord Barok van Zieks... He must be an exceptionally talented prosecutor then.McGilded:\n......... Talented isn't the word you're lookin' for, madam. ...It's 'cursed'.Ryunosuke:\nCursed?! (What on earth...?)Bailiff:\nThe defendant is summoned! And his counsel! Please make your way into the courtroom. The trial is about to begin!Ryunosuke:\nHis counsel... (That would be me!)McGilded:\nOh, 'tis time! Well then, fella, don't let me down!Ryunosuke:\nBut... But I don't know anything about the case! You haven't told me what happened!McGilded:\n......... Until you showed yer face here... ...I'd made up me mind, so I had.Ryunosuke:\nSorry?McGilded:\nI'd decided I'd have to defend meself in there!Ryunosuke:\n...! (How would that have worked?)McGilded:\nBut then you made an appearance. A student of law, wouldn't ya know? 'Tis no accident, I can assure ya of that. 'Tis fate. So don't get cold feet now. Please.Ryunosuke:\n......... (I literally know nothing about the case, or about this man who stands accused. In fact, the only thing I do know... ...is that I can't just turn my back on him.)Susato:\nMr Naruhodo...Ryunosuke:\nThe man has no one. He'll have to stand alone in that courtroom, armed with nothing to defend himself. Yes... Something that Kazuma would never have allowed to happen.Susato:\n...!Bailiff:\nCounsel for the Defence! What are you doing? If you're late for the start of the trial, you will lose your right to stand!Ryunosuke:......... I'll be right there.(It's happening, then. My first trial in a British court. I hope you're watching over me, Kazuma... ...because I have no idea how I'm going to manage this!)18th February, 10:00 a.m.\nThe Old Bailey CourtroomRyunosuke:\nSo this is the highest court in Great Britain... The Old Bailey... The centuries of history in this place is [sic] palpable, isn't it? It's so different to the Supreme Court in Japan.Susato:\n...It feels both imposing and serene at the same time. The atmosphere almost makes words redundant. Whatever the country, determining a person's guilt or innocence is always a solemn affair. May I say something, Mr Naruhodo?Ryunosuke:\nOh! Yes, what?Susato:\nYour eyes look ready to pop out of your head again.Ryunosuke:\nI know, but I just can't help it...Judge:\nIn the name of Her Majesty the Queen, I hereby declare this court to be in session. We are here today to determine the guilt or innocence of Mr Magnus McGilded. I now call upon the counsels for the prosecution and defence to declare their willingness to proceed.Van Zieks:\nThe prosecution...is fully prepared.Ryunosuke:\n(That must be the Reaper of the Bailey... He...really does look fully prepared to dispatch his next poor victim to the underworld...)Judge:\nCounsel for the Defence, you appear to be...Eastern. Do you speak English?Ryunosuke:\nHuh? Oh! Yes, of course! Sorry. (But he asked if the defence was ready. And I couldn't be further from ready if I tried...)Van Zieks:\nThose eyes please me. ...Nipponese.Ryunosuke:\n...!Van Zieks:\nThey shroud your fear, your doubt, your trepidation... They run wild, clinging to some phantom notion of courage. The quintessential look...of a sacrificial lamb.Ryunosuke:\n(Ugh... A cold shiver just ran down my spine all the way to the tips of my toes...)Judge:\n......... Now, Mr McGilded...McGilded:\nYes, My Lord?Judge:\nYou stand accused of murder. A capital offence. You could be sent to the gallows if found guilty. Are you quite sure you wish to entrust your defence to this...foreigner?McGilded:\n......... As I've always said, My Lord, 'tis a grand ting to give opportunities to the young. Even if the fella is a student from some little island off in the Far East. Is it not the British way to ignore the dangers to yeself and give those less fortunate a fair chance? I'd like to tink that acts of chivalry do the great British Empire proud.Listen to Mr McGilded!What a fine gentleman London has in him!Did you hear that he donated five thousand pounds to the government the other day?Mother, please may we go and play in McGilded Park?Susato:\nIt seems as though everyone in the public gallery is firmly behind Mr McGilded.Ryunosuke:\nThat's definitely welcome news. And he certainly has a way with words. I'm surprised he couldn't convince anyone to defend him.Judge:\nEloquently put, Mr McGilded. And most laudable sentiments. Now... ...ladies and gentlemen of the jury, I'm sure I need hardly remind you... ...that you six members of the public have been selected for your impartiality. Are you ready to proceed?Juror No. 1:\nYes, My Lord! If the task is to send rotters to the gallows where they belong, I'm more than ready!Juror No. 2:\nAt the manor, His Lordship always says we should dispose of rubbish promptly. Naturally, I agree.Juror No. 3:\nHah! Any criminals here will soon be wishing they never set eyes on me!Juror No. 5:\n...I feel a chill.Juror No. 6:\nOh, don't mind me, my dears! I'll just be getting on with my knitting. Must finish these mitts for my grandson.Susato:\nAh, Mr Naruhodo, those people are...Ryunosuke:\nThe jury. Yes... That's something we don't have in Japan yet.Susato:\nThat's right. I've only ever read about it. But here in Great Britain, the court's final verdict depends on the opinions of these six jurors. The judge passes sentence according to the law, but the jurors determine guilt based on common sense. So the defendant is ultimately judged from two completely different points of view.Ryunosuke:\nBut how exactly do the jurors give their verdict?Susato:\nThat I don't know. But... ...I'm sure it will become clear as the trial progresses.Ryunosuke:\nYes...Judge:\nProsecutor van Zieks...Van Zieks:\nMy Lord?Judge:\nIt's been a number of years since we've seen you here in the courtroom. I thought you'd renounced your fame.Van Zieks:\nI'm known as the Reaper of the Bailey, My Lord. ...Infamy rather than fame, I would say. But yes, five years have passed since I last...spread my wings in this capacity.Judge:\nSo, what brings you back? Is there some change of circumstance of which the court should be aware?Van Zieks:\n......... I leave that to your imagination...My Lord.Ryunosuke:\n(So the 'Reaper' has been out of action for five years... Why did he have to choose today of all days to make a comeback?!)Susato:\nDon't lose heart! Mr Naruhodo!Judge:\n...As you wish, sir. The court nevertheless welcomes your return. Now then, opening statements, I think. A summary of the case, if you please.Van Zieks:\nCertainly, My Lord. As Your Lordship is aware, this is a case of overwhelming simplicity.Ryunosuke:\n(We must be the only ones in here who aren't aware.)Van Zieks:\nThe incident took place in the late evening, three days past. The hour was some minutes after ten. The victim was a maker of building bricks known in the community as 'Thrice-Fired' Mason.Ryunosuke:\nSorry? 'Thrice...'?Judge:\nHe was a very accomplished craftsman. The bricks he fired were said to be almost indestructible.Van Zieks:\nThe victim's corpse was discovered in an omnibus in service on the streets of London at the time. A dagger that had been thrust into the victim's abdomen is believed to be the ultimate cause of death. Here is the autopsy report from the investigating medical officer at Scotland Yard.Judge:\nThank you, Counsel. I shall accept that and the photograph as evidence.The autopsy report has been entered into the Court Record.The photograph of the crime scene has been entered into the Court Record.Van Zieks:\nAnd one further item of evidence... The prosecution wishes to submit these as well.Judge:\nAnd these are...? Good Lord! Is that blood, Counsel?!Van Zieks:\nYes, My Lord. Seized by a policeman who arrived at the scene... ...these gore-soaked gloves...were taken from the hands of the accused when he was arrested.Ryunosuke:\nWhat?! (Mr McGilded's gloves...had blood on them?!)Judge:\nYes, I will accept these as evidence as well.The defendant's leather gloves have been entered into the Court Record.Ryunosuke:\n(How did I get into this? I'm backed into a corner before I've even started...)Examine evidence\n\n\n\n\n\n\n\n\n\nDefendant's Leather Gloves\n\n\n\n\n\n\n\n\n\nBloodstain on seat\n\n\n\n\n\n\n\nRyunosuke:\nThis is definitely...blood, isn't it? Not the most pleasant sight to be confronted with on our first day in London.\nSusato:\nWell, nothing will come of grumbling now.\nRyunosuke:\nNo. ...By the way, is Mr McGilded right-handed?\nSusato:\nYes, I believe so. He was toying with a coin in his right hand a little earlier.\nRyunosuke:\nHaah...pity. If only he'd been left-handed.\nSusato:\nI think blood on either glove would be fairly incriminating, really.Van Zieks:\nContinuing... According to the driver of the omnibus... ...there were only two passengers travelling inside his vehicle at the time.Ryunosuke:\nOnly two?Van Zieks:\nObviously, one of those passengers was the deceased brickmaker, Mr Mason. The other... ...was the accused, Magnus McGilded!Juror No. 1:\n...!Juror No. 2:\n...!Juror No. 3:\n...!Judge:\nHm, well... Rather damning circumstances, to say the least. Defendant, what say you?McGilded:\n......... Well of course, I have no recollection of such a ting.Ryunosuke:\nMr McGilded!McGilded:\nTo be sure, I rode the omnibus that evenin'. But whenever I'm in a carriage, I'm taken with a fierce tiredness, and I always succumb to it.Judge:\nAre you claiming to have been asleep?McGilded:\n'Tis the motion of the carriage, My Lord. Liltin', so it is. And when I opened my eyes again... ...'twas a desperate sight before me. The body of a man I'd never laid eyes on before in me life.Judge:\nHm...McGilded:\nNow I ask youse, what good-hearted soul wouldn't rush to help a fella bleedin' from his stomach? I wasn't about to start worryin' about me gloves now, was I? I reached out to give the man a hand.Ryunosuke:\n(So the blood got onto the gloves then, after the man had been killed...)Van Zieks:\nUnfortunately... ...that statement of the driver's is only the beginning.Ryunosuke:\nWhat?! (That's not all of it?)Van Zieks:\nThere were multiple witnesses... ...to the precise moment at which the brickmaker was fatally stabbed!Juror No. 4:\n...!Juror No. 5:\n...!Juror No. 6:\n...!Judge:\nOrdaaar! Ordaaar! Orrrdaaar!Van Zieks:\nWhen the killing took place, the victim and the accused were inside the carriage. And there were witnesses to the crime. This is not just a case of compelling evidence... ...it's the nail in the coffin  for the accused.Ryunosuke:\n...!Judge:\nHm... Thank you, Counsel. The circumstances of the crime have been made quite clear. I think we will hear testimony from these witnesses first of all.Van Zieks:\n...Your wish is my command. Bailiff! Bring the witnesses in at once!Van Zieks:\nWitnesses. Your names and occupations.Beppo:\nMy name is... Well, everyone calls me Beppo. I, I drive an omnibus in the East End.Fairplay:\nBruce Fairplay. I'm a banker in the city.Furst:\nMy name's Furst. Lay D. Furst. I, um...make hats for gents.Van Zieks:\nLet's begin by confirming the facts: Three days ago, at a short time after ten o'clock in the evening... ...all of you present in the stand were in an omnibus and witness to the aforementioned incident. Is that correct?Beppo:\nYes, sir!Fairplay:\nQuite right.Furst:\nYes, sir, that's right, sir.Judge:\nVery well then, let's proceed to your formal testimonies, please. Each of you will tell the court precisely what you saw!Witness Testimony\n- What the Witnesses Saw -Beppo:\nIt, it was the last bus of the evening, so I had few customers. I remember it well.Fairplay:\nThe victim and the man accused of killing him were sat next to each other inside the bus.\nThen out of the blue, the accused just reached over and plunged a knife right into his guts!Furst:\nThat's right. He stabbed him! I screamed, I did! Couldn't help it.Beppo:\nAs soon as I heard the scream, I stopped my bus. And, and then I saw it, too!Judge:\nHm... Unambiguous testimony, I must say.Van Zieks:\nExactly, My Lord. These men witnessed the incident in the omnibus with their own eyes.Ryunosuke:\n......... Um...I'd like to ask a question, if I may?Judge:\nYes, Counsel?Ryunosuke:\nWell, this testimony... ...makes absolutely no sense to me whatsoever.Van Zieks:\n...Why not?Ryunosuke:\nWell...the incident took place inside a moving carriage, didn't it?Van Zieks:\nAs has been clearly stated from the outset, yes.Ryunosuke:\nWell in that case... ...how could those two witnesses possibly have seen what happened?! There's no way they could have seen the inside of the moving carriage!Van Zieks:\n.........Judge:\n..................Van Zieks:\nHow...quaint. I'd read that civilisation in the Eastern island nations was a good century behind our own. But you're here in London yourself. Are you really so ignorant about our omnibuses?Ryunosuke:\nHuh?Van Zieks:\nTell me, my Nipponese friend... Have you even travelled in an omnibus?Ryunosuke:\n......... Well...no... We, um...only arrived in London this morning.Van Zieks:\nNo matter. I've arranged for us all to see for ourselves. The actual scene of the crime, that is.Ryunosuke:\nWhat...do you mean...? (The actual scene? How?)Van Zieks:\nA carriage is designed to be moved, after all. ...Presumably you understand that much?Ryunosuke:\nUm, yes...Van Zieks:\nThe omnibus in which this bloody crime took place is here today, in this very building.Ryunosuke:\nHere...? WHAT?! The, the entire carriage?!Van Zieks:\nBailiff! Bring forth the stricken omnibus!Ryunosuke:\nSo that's an omnibus... THE omnibus... (I can't believe they could bring something so enormous in here. Great Britain's courtrooms are amazing.)Van Zieks:\nAs you can see, the omnibus is pulled by two horses, and can carry up to eight passengers. Four passengers seated inside in the enclosed cabin, and another four on the rooftop deck above. Every Londoner knows... ...that the best views of the city's architecture and sights are to be had from the top of an omnibus. And I should point out to our foreign guests... ...that there is a skylight in the roof, allowing a view of the interior from the seats above.Ryunosuke:\nAh, a skylight... ...Oh!Van Zieks:\nThe penny drops at last, I see. These two gentlemen were occupying the rooftop seats on this omnibus when the murder took place. That is how they came to witness the grim incident. Through the skylight.Ryunosuke:\n(Ugh... That makes perfect sense...)Judge:\nWell, Counsel, this is a first. In all my years behind the bench, I've never experienced the crime scene itself being brought into the courtroom!Van Zieks:\nThere are a number of important clues remaining inside the carriage, My Lord. I would like to submit the omnibus itself as evidence. ...That is the prosecution's wish.Judge:\nVery well, I see no reason why not. This omnibus is hereby formally accepted as evidence.The omnibus has been entered into the Court Record.Ryunosuke:\nI can't believe it! The entire crime scene entered as evidence?!Examine evidence\n\n\n\n\n\n\n\n\n\nOmnibus\n\n\n\n\n\n\n\n\n\nDoor\n\n\n\n\n\n\n\nSusato:\n...Well, let's open the door and go inside, shall we?\nRyunosuke:\nUgh... The scene of a murder... It's horrible...\n\n\n\nBloodstain\n\n\n\n\n\n\n\nRyunosuke:\nThat's blood that's soaked into the seat. The victim's obviously.\nSusato:\nYes. And that seat would be clearly visible from the roof deck.\nRyunosuke:\nWould you really stab somebody in full view of the other passengers like that, I wonder...\nSusato:\nWell, it was after dark. And there was a lamp on in here, so perhaps the culprit couldn't see anything outside through the skylight.\nRyunosuke:\n(Whichever way you look at it, it doesn't seem like it was a planned attack.)\n\n\n\n\nNotice or poster\n\n\n\n\n\n\n\nRyunosuke:\nAh, that's a poster for the Great Exhibition that's due to start six months from now. There's a lot of focus being drawn to the Crystal Tower, the centrepiece of the whole exposition.\nSusato:\nOoh, the Crystal Tower... It's under construction already, I believe. People all over London must be fizzing with excitement at the prospect of such a grand event!\n\n\n\n\nSkylight\n\n\n\n\n\n\n\nRyunosuke:\nIt's quite a large skylight, isn't it?\nSusato:\nYes, quite large enough to afford a good view into the cabin from the roof deck.\nRyunosuke:\nAnd there doesn't appear to be a handle or catch of any description... So I suppose it can't be opened from inside the cabin at least.\n\n\n\n\nEmpty seats\n\n\n\n\n\n\n\nRyunosuke:\nThis seat looks reasonably soft, but it's actually rather hard when you sit on it. And only just wide enough for two gentlemen to sit side by side, really.\nSusato:\nOf course, an English gentlewoman would be dressed in such finery... ...it would be quite impossible for her to climb up to the roof deck, so she would have to be seated in here.\nRyunosuke:\nA woman in a kimono would have the same problem. ...Women's clothes are very impractical, aren't they?\n\n\n\n\nHandle under seat\n\n\n\n\n\n\n\nRyunosuke:\n(This seat has a handle, it seems...)\n\n\n\nStorage space\n\n\n\n\n\n\n\nRyunosuke:\nThis looks like all sorts of equipment that might be needed to keep the omnibus running.\nSusato:\nFeeding tubs, tools to repair wheels, blankets, horse-shoeing tools... So it's a storage compartment for the coachman to keep his things, it seems.\nRyunosuke:\nThere doesn't seem to be any space for passengers to stow their luggage, that's for sure.\nSusato:\nWell...I don't imagine it would be very convenient for that purpose anyway.\n\n\n\n\n\nDoor\n\n\n\n\n\n\n\nSusato:\nHave you seen enough? Let's step back outside then.\n\n\n\n\n\nBench on roof\n\n\n\n\n\n\n\nSusato:\nSo this is the roof deck of the omnibus. Oh, you must have a wonderful view of London's streets from up here.\nRyunosuke:\nSo people sit all the way up here on bitter winter nights with the cold air rushing past them? And they have to pay money to do so?\nSusato:\nBrrr...I can't imagine how cold it must feel!\nRyunosuke:\nThat...just made me think of something horrible. Can you imagine being dragged around the city in the freezing cold as a punishment?\nSusato:\n...Perhaps that is the real price you pay to stay out late.\n\n\n\n\nSkylight\n\n\n\n\n\n\n\nRyunosuke:\nYou can certainly see inside the carriage through this opening, that's for sure.\nSusato:\nYes, and there's a lamp in the enclosed cabin. So I'm sure the witnesses would have been able to see quite clearly.\nRyunosuke:\n(That's not good for me...)Susato:\nYes! Great Britain is simply extraordinary!Ryunosuke:\n(I could help myself a lot by giving that omnibus a thorough examination, seeing as it's here.)Judge:\nLet us continue with proceedings, then. Your cross-examination, Counsel.Van Zieks:\nHmph. Pray don't expect this Nipponese stray to understand the intricacies of a British court's cross-examination rites.Ryunosuke:\n(Alright... My first cross-examination in a British court... Focus, Ryunosuke... Focus!)Cross-Examination\n- What the Witnesses Saw -",
      "testimonies": [
        {
          "testimony": "It, it was the last bus of the evening, so I had few customers. I remember it well.",
          "person": "Beppo",
          "present": []
        },
        {
          "testimony": "The victim and the man accused of killing him were sat next to each other inside the bus.",
          "person": "Fairplay",
          "present": []
        },
        {
          "testimony": "Then out of the blue, the accused just reached over and plunged a knife right into his guts!",
          "person": "Fairplay",
          "present": []
        },
        {
          "testimony": "That's right. He stabbed him! I screamed, I did! Couldn't help it.",
          "person": "Furst",
          "present": []
        },
        {
          "testimony": "As soon as I heard the scream, I stopped my bus. And, and then I saw it, too!",
          "person": "Beppo",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "Beppo:\nIt, it was the last bus of the evening, so I had few customers. I remember it well.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYes...I think it was some time after ten, wasn't it?\nBeppo:\nOh, yes, sir, that's, that's right, sir. Yes. Ever so cold, it was, sir. F-Freezing in fact.\nRyunosuke:\nAnd you had four passengers on board at the time. Is that correct?\nBeppo:\nYes, yes, that's right, sir. Not all travelling in the same parts of the b-b-bus, of course, though. No.\nJudge:\nAnd there were no other passengers when the incident took place? No one alighted, for example?\nBeppo:\nYou're quite right with that, sir. No other passengers like that, no. None.\nRyunosuke:\n(So nobody fled the scene of the crime, then.) \nBeppo:\nI have to say, the boss insists on it running, he does. Every evening. That last b-b-bus of the day. But I, I do wonder sometimes if it's altogether worthwhile. Yes, s-s-sorry to say...\nRyunosuke:\nWhat do you mean by that?\nBeppo:\nWell, what with it being so cold and everything, and only m-making twenty pence on the run, you see... Yes, I, I spend that much at the p-p-pub on the way home just, just trying to warm up again.Press (after Jurors No. 2 and 4 vote guilty, if third, fourth, and fifth statements were pressed)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYes...I think it was some time after ten, wasn't it?\nBeppo:\nOh, yes, sir, that's, that's right, sir. Yes. Ever so cold, it was, sir. F-Freezing in fact.\nRyunosuke:\nAnd you had four passengers on board at the time. Is that correct?\nBeppo:\nYes, yes, that's right, sir. Not all travelling in the same parts of the b-b-bus, of course, though. No.\nJudge:\nAnd there were no other passengers when the incident took place? No one alighted, for example?\nBeppo:\nYou're quite right with that, sir. No other passengers like that, no. None.\nRyunosuke:\n(So nobody fled the scene of the crime, then.) \nBeppo:\nI have to say, the boss insists on it running, he does. Every evening. That last b-b-bus of the day. But I, I do wonder sometimes if it's altogether worthwhile. Yes, s-s-sorry to say...\nRyunosuke:\nWhat do you mean by that?\nBeppo:\nWell, what with it being so cold and everything, and only m-making twenty pence on the run, you see... Yes, I, I spend that much at the p-p-pub on the way home just, just trying to warm up again. I, I just can't believe it, sir. C-Can't believe it... A m-m-murder on my own b-bus. It's t-t-too awful to think about. I h-haven't been able to sh-shake this c-c-cold ever since it happened.\nLeads to:\n\"My Lord, I wish to speak!\"Fairplay:\nThe victim and the man accused of killing him were sat next to each other inside the bus.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nAnd you saw them through the skylight in the roof of the carriage?\nFairplay:\nThat's right. When you sit up on the top deck, the window's right there at your feet. There was a lamp on inside, so I had a pretty good view. The two of them were wearing hats and I couldn't exactly make out their faces... ...but there's not a shred of doubt in my mind that it was Mr McGilded.\nRyunosuke:\nHow can you be so sure?\nFairplay:\nWell...how can I put it politely? McGilded is a gentleman of...rather small stature. I couldn't have mistaken him for anyone else.\nVan Zieks:\nLet's not forget that when the vehicle came to a halt, the only people inside the enclosed cabin... ...were the deceased Mr Mason, and Mr McGilded. There is no room for doubt here.\nRyunosuke:\nUgh, I really wish there was...Fairplay:\nThen out of the blue, the accused just reached over and plunged a knife right into his guts!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYou actually saw the exact moment it happened?\nFairplay:\nDidn't I already testify to that? ...Or are fair dinkum, hard-working city bankers not considered trustworthy these days?\nRyunosuke:\nOh, no no! I, I didn't mean that! (This is no good. I've really got his back up.) ...Perhaps you could just tell us what you saw in a little more detail, if that's-\n\nMy Lord!\n\nJudge:\nHm? Juror number three? What's the meaning of this?\nJuror No. 3:\nMy mind is made up, My Lord. Completely and utterly made up!\nRyunosuke:\nMade up about what...?\nJuror No. 3:\nI don't like the stinking rich. Never have. They're always up to something or other that they shouldn't be. Every one of them. And that little leprechaun of a man is no exception. Well...he can't fool me! There's no point in wasting time listening to any more of this. That's my opinion on the matter, anyway.\n???:\n\nJuror No. 1:\nThat is precisely what I was about to say! As the foreman of the jury, it's my duty to set a good example to my fellow jurors.\nRyunosuke:\nWhat the...? (What is happening here?!)\nSusato:\nLet me see... Ah yes, it seems that's how the members of the jury give their verdicts.\nRyunosuke:\n...With fire?\nSusato:\nApparently, yes. White for innocent, and black for guilty. As the six members of the jury make up their minds about the case... ...one by one, they each cast a ball of fire into the great Scales of Justice...as we saw a moment ago.\nRyunosuke:\nSo if those enormous scales fall completely to the black side, does that mean...?\nSusato:\n......... Let's do our very best to make sure that doesn't happen!\nRyunosuke:\n(Ugh... Now I'm even more worried than I was before...)\nJudge:\nVery well. The court acknowledges the change in the jury's stance. Counsel for the Defence, please continue with your cross-examination.\nRyunosuke:\nHaah... (This is a nightmare...)Press (after Jurors No. 1 and 3 vote guilty)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYou actually saw the exact moment it happened?\nFairplay:\nDidn't I already testify to that? ...Or are fair dinkum, hard-working city bankers not considered trustworthy these days?\nRyunosuke:\nOh, no no! I, I didn't mean that! (This is no good. I've really got his back up.) ...Perhaps you could just tell us what you saw in a little more detail, if that's-\nJuror No. 2:\nMy Lord, if you'll forgive the interruption...\nJudge:\nAh, juror number two. Go on...\nJuror No. 2:\nMr McGilded is a pillar of society and a gentleman. And a gentleman's word should be sacrosanct. However... ...those of us in service know we must accept hard truths.\nRyunosuke:\nWait, what are you about to do?\nJuror No. 2:\nDispose of the rubbish!\nRyunosuke:\nNo!\nJuror No. 2:\nI don't wish to cause offence, but I do like to eradicate all traces of filth and grime.\n???:\n\nJuror No. 4:\n...I have painstakingly typed every word uttered here today, and cross-referenced all the facts. As such, I am now in a position to draw the only logical conclusion.\nRyunosuke:\nNot again...\nSusato:\nThat's...four out of six jury members who've proposed a guilty verdict! There are only two left!\nRyunosuke:\n(We've had it... Every time I press these witnesses for more information, I just make the situation worse...)\nSusato:\nNevertheless... ...what we need more than anything at the moment is more information. We're still very much in the dark.\nRyunosuke:\nI suppose I'll just have to keep pressing the witnesses, knowing that more sparks may well fly...\nSusato:\nWe mustn't give up hope that we'll uncover something that will give us a way to fight back!\nRyunosuke:\nBut... ......... Alright, I'll keep trying. (I can't give up. I just need to keep calm and listen to the witnesses' statements again.)Press (after Jurors No. 2 and 4 vote guilty, if first, fourth, and fifth statements were pressed)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYou actually saw the exact moment it happened?\nFairplay:\nDidn't I already testify to that? ...Or are fair dinkum, hard-working city bankers not considered trustworthy these days?\nRyunosuke:\nOh, no no! I, I didn't mean that! (This is no good. I've really got his back up.) ...Perhaps you could just tell us what you saw in a little more detail, if that's-\nLeads to:\n\"My Lord, I wish to speak!\"Press (subsequent times)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYou actually saw the exact moment it happened?\nFairplay:\nDidn't I already testify to that? ...Or are fair dinkum, hard-working city bankers not considered trustworthy these days?\nRyunosuke:\nOh, no no! I, I didn't mean that! (This is no good. I've really got his back up.) ...Perhaps you could just tell us what you saw in a little more detail, if you don't mind?\nFairplay:\nWhy don't you ask the young man next to me?\nFurst:\nOh! Me? Oh, well, yes...Furst:\nThat's right. He stabbed him! I screamed, I did! Couldn't help it.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\n'He stabbed him,' you say. And you were sitting up on the roof deck, were you?\nFurst:\nYes, that's right, sir. I was up on the roof seats. I remember seeing the little gent sitting next to the fellow that was stabbed. I'd been thinking about a new hat design, you see. So I was just gazing absent-mindedly around. But then! ...Then I happened to look down through the skylight! It, it, it was sticking right out from his belly! That, that huge, great knife!\nJudge:\nHmph. A grim sight indeed.\nRyunosuke:\nAh! (That didn't help me at all! The jury look like they're even more convinced my client did it than they were before...)\nSusato:\nThat appears to have made everyone even more dubious that Mr McGilded is telling the truth. If only we had some evidence to counter their suspicions...\nVan Zieks:\nMr Furst!\nFurst:\nOh! Yes, yes, sir?\nVan Zieks:\nIs this the knife you saw?\nFurst:\nOh, good grief! Yes! That's it! The very one, sir!\nRyunosuke:\nIs, is that...?\nVan Zieks:\nYes, Counsel. This is the blade that was driven into the victim's belly like a stake through the heart.\nJudge:\nThat is a blade of considerable size, Counsel.\nVan Zieks:\nIt is. And furthermore, the scabbard is emblazoned prominently with a certain initial. The letter 'M'. ...Which seems oddly familiar.\nRyunosuke:\nUgh... (Please, no...)\nVan Zieks:\n'M' for 'Magnus' perhaps? Or 'McGilded' possibly? ...Take your pick. It seems this particular big name in London made a... magnificent mistake.\nRyunosuke:\n\nRyunosuke:\nBut! But there are 'M's everywhere! Like...like... Yes! Like in 'Mason'!\nVan Zieks:\n\nVan Zieks:\nThis blade is far too extravagant for a poor brickmaker to have owned. No! This weapon of murder almost certainly belongs to the accused!\nRyunosuke:\nUgh...\nJudge:\nHm, not conclusive, but certainly compelling, Counsel.\nThe murder weapon has been entered into the Court Record.\n\nMy Lord!\n\nJudge:\nHm? Juror number three? What's the meaning of this?\nJuror No. 3:\nMy mind is made up, My Lord. Completely and utterly made up!\nRyunosuke:\nMade up about what...?\nJuror No. 3:\nI don't like the stinking rich. Never have. They're always up to something or other that they shouldn't be. Every one of them. And that little leprechaun of a man is no exception. Well...he can't fool me! There's no point in wasting time listening to any more of this. That's my opinion on the matter, anyway.\n???:\n\nJuror No. 1:\nThat is precisely what I was about to say! As the foreman of the jury, it's my duty to set a good example to my fellow jurors.\nRyunosuke:\nWhat the...? (What is happening here?!)\nSusato:\nLet me see... Ah yes, it seems that's how the members of the jury give their verdicts.\nRyunosuke:\n...With fire?\nSusato:\nApparently, yes. White for innocent, and black for guilty. As the six members of the jury make up their minds about the case... ...one by one, they each cast a ball of fire into the great Scales of Justice...as we saw a moment ago.\nRyunosuke:\nSo if those enormous scales fall completely to the black side, does that mean...?\nSusato:\n......... Let's do our very best to make sure that doesn't happen!\nRyunosuke:\n(Ugh... Now I'm even more worried than I was before...)\nJudge:\nVery well. The court acknowledges the change in the jury's stance. Counsel for the Defence, please continue with your cross-examination.\nRyunosuke:\nHaah... (This is a nightmare...)Press (after Jurors No. 1 and 3 vote guilty)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\n'He stabbed him,' you say. And you were sitting up on the roof deck, were you?\nFurst:\nYes, that's right, sir. I was up on the roof seats. I remember seeing the little gent sitting next to the fellow that was stabbed. I'd been thinking about a new hat design, you see. So I was just gazing absent-mindedly around. But then! ...Then I happened to look down through the skylight! It, it, it was sticking right out from his belly! That, that huge, great knife!\nJudge:\nHmph. A grim sight indeed.\nRyunosuke:\nAh! (That didn't help me at all! The jury look like they're even more convinced my client did it than they were before...)\nSusato:\nThat appears to have made everyone even more dubious that Mr McGilded is telling the truth. If only we had some evidence to counter their suspicions...\nVan Zieks:\nMr Furst!\nFurst:\nOh! Yes, yes, sir?\nVan Zieks:\nIs this the knife you saw?\nFurst:\nOh, good grief! Yes! That's it! The very one, sir!\nRyunosuke:\nIs, is that...?\nVan Zieks:\nYes, Counsel. This is the blade that was driven into the victim's belly like a stake through the heart.\nJudge:\nThat is a blade of considerable size, Counsel.\nVan Zieks:\nIt is. And furthermore, the scabbard is emblazoned prominently with a certain initial. The letter 'M'. ...Which seems oddly familiar.\nRyunosuke:\nUgh... (Please, no...)\nVan Zieks:\n'M' for 'Magnus' perhaps? Or 'McGilded' possibly? ...Take your pick. It seems this particular big name in London made a... magnificent mistake.\nRyunosuke:\n\nRyunosuke:\nBut! But there are 'M's everywhere! Like...like... Yes! Like in 'Mason'!\nVan Zieks:\n\nVan Zieks:\nThis blade is far too extravagant for a poor brickmaker to have owned. No! This weapon of murder almost certainly belongs to the accused!\nRyunosuke:\nUgh...\nJudge:\nHm, not conclusive, but certainly compelling, Counsel.\nThe murder weapon has been entered into the Court Record.\nJuror No. 2:\nMy Lord, if you'll forgive the interruption...\nJudge:\nAh, juror number two. Go on...\nJuror No. 2:\nMr McGilded is a pillar of society and a gentleman. And a gentleman's word should be sacrosanct. However... ...those of us in service know we must accept hard truths.\nRyunosuke:\nWait, what are you about to do?\nJuror No. 2:\nDispose of the rubbish!\nRyunosuke:\nNo!\nJuror No. 2:\nI don't wish to cause offence, but I do like to eradicate all traces of filth and grime.\n???:\n\nJuror No. 4:\n...I have painstakingly typed every word uttered here today, and cross-referenced all the facts. As such, I am now in a position to draw the only logical conclusion.\nRyunosuke:\nNot again...\nSusato:\nThat's...four out of six jury members who've proposed a guilty verdict! There are only two left!\nRyunosuke:\n(We've had it... Every time I press these witnesses for more information, I just make the situation worse...)\nSusato:\nNevertheless... ...what we need more than anything at the moment is more information. We're still very much in the dark.\nRyunosuke:\nI suppose I'll just have to keep pressing the witnesses, knowing that more sparks may well fly...\nSusato:\nWe mustn't give up hope that we'll uncover something that will give us a way to fight back!\nRyunosuke:\nBut... ......... Alright, I'll keep trying. (I can't give up. I just need to keep calm and listen to the witnesses' statements again.)Press (after Jurors No. 2 and 4 vote guilty, if first, third, and fifth statements were pressed)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\n'He stabbed him,' you say. And you were sitting up on the roof deck, were you?\nFurst:\nYes, that's right, sir. I was up on the roof seats. I remember seeing the little gent sitting next to the fellow that was stabbed. I'd been thinking about a new hat design, you see. So I was just gazing absent-mindedly around. But then! ...Then I happened to look down through the skylight! It, it, it was sticking right out from his belly! That, that huge, great knife!\nJudge:\nHmph. A grim sight indeed.\nRyunosuke:\nAh! (That didn't help me at all! The jury look like they're even more convinced my client did it than they were before...)\nSusato:\nThat appears to have made everyone even more dubious that Mr McGilded is telling the truth. If only we had some evidence to counter their suspicions...\nVan Zieks:\nMr Furst!\nFurst:\nOh! Yes, yes, sir?\nVan Zieks:\nIs this the knife you saw?\nFurst:\nOh, good grief! Yes! That's it! The very one, sir!\nRyunosuke:\nIs, is that...?\nVan Zieks:\nYes, Counsel. This is the blade that was driven into the victim's belly like a stake through the heart.\nJudge:\nThat is a blade of considerable size, Counsel.\nVan Zieks:\nIt is. And furthermore, the scabbard is emblazoned prominently with a certain initial. The letter 'M'. ...Which seems oddly familiar.\nRyunosuke:\nUgh... (Please, no...)\nVan Zieks:\n'M' for 'Magnus' perhaps? Or 'McGilded' possibly? ...Take your pick. It seems this particular big name in London made a... magnificent mistake.\nRyunosuke:\n\nRyunosuke:\nBut! But there are 'M's everywhere! Like...like... Yes! Like in 'Mason'!\nVan Zieks:\n\nVan Zieks:\nThis blade is far too extravagant for a poor brickmaker to have owned. No! This weapon of murder almost certainly belongs to the accused!\nRyunosuke:\nUgh...\nJudge:\nHm, not conclusive, but certainly compelling, Counsel.\nThe murder weapon has been entered into the Court Record.\nLeads to:\n\"My Lord, I wish to speak!\"Press (subsequent times)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\n'He stabbed him,' you say. And you were sitting up on the roof deck, were you?\nFurst:\nYes, that's right, sir. I was up on the roof seats. I remember seeing the little gent sitting next to the fellow that was stabbed. I'd been thinking about a new hat design, you see. So I was just gazing absent-mindedly around. But then! ...Then I happened to look down through the skylight! It, it, it was sticking right out from his belly! That, that huge, great knife!\nJudge:\nHmph. A grim sight indeed.\nRyunosuke:\nAh! (That didn't help me at all! ...The members of the jury are as shocked as they were the first time!)\nSusato:\nIf this wasn't a court of law... ...I would have felt compelled to use a Susato Takedown for that lapse in judgement.\nRyunosuke:\nNo no! I'll, I'll be more careful!\nVan Zieks:\nAs we have heard! The witness had an unfettered view of events unfolding. Would you not concur, coachman? Your diddering suggests that you would.\nBeppo:\nOh! Y-Yes, sir!Examine evidence\n\n\n\n\n\n\n\n\n\nMurder Weapon\n\n\n\n\n\n\n\n\n\nSheath\n\n\n\n\n\n\n\nSusato:\nThat part is the sheath, isn't it?\nRyunosuke:\n.........\nSusato:\nAre you alright, Mr Naruhodo?\nRyunosuke:\nHm? Oh, sorry, yes. I...just don't really like blades.\nSusato:\nOh... Those don't seem like the words of a man with a large katana slung from his waist.\nRyunosuke:\nThat's not a blade; that's Kazuma's soul. Anyway...there's no sense in delaying it. Let's see what the blade looks like.\n\n\n\nBlood on blade\n\n\n\n\n\n\n\nRyunosuke:\nUgh...that looks like a lot of blood.\nSusato:\nIt surely is blood. The victim's.\nRyunosuke:\nUgh...an Englishman's blood looks a lot like a Japanese man's blood.\nSusato:\nDid you think it wouldn't?\nRyunosuke:\n...Sorry, it's just that we've only just arrived here in Great Britain. I'm finding it a little hard to adjust.\nSusato:\n...Yes, I do understand.\n\n\n\n\n\n\"M\" insignia\n\n\n\n\n\n\n\nRyunosuke:\nAn ornate letter 'M'... Undeniably Mr Magnus McGilded's initial.\nSusato:\nAnd it's beautifully gilded, too. It must be very valuable, I should think.\nRyunosuke:\n...Ah!\nSusato:\nWhat is it?\nRyunosuke:\nLook at this 'M'... If you turn it upside-down, it becomes a 'W'! This could change everything!\nSusato:\nA 'W'...?\nRyunosuke:\nYes, this is one of those...you know, turnabout cases! I'm sure of it!\nSusato:\nI'm afraid I don't know at all. But what I am sure of is that this is an 'M'.\nRyunosuke:\nOh. (Well that idea was quickly quashed...)Beppo:\nAs soon as I heard the scream, I stopped my bus. And, and then I saw it, too!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nErm...what exactly did you see?\nBeppo:\nOh, well sir, that would be the p-p-passenger, sir. Yes, c-c-collapsed on the floor, he was.\nVan Zieks:\nAnd by the passenger, obviously you are referring to the victim, Mr Mason, the brickmaker.\nBeppo:\nAnd, and then the other p-p-passenger had that kn-knife in his hand, l-like this...\nVan Zieks:\nBy the other passenger, obviously you are referring to the accused, Mr Magnus McGilded.\nBeppo:\nAnd then he p-p-p-plunged it down like this, s-stabbing the other passenger in the b-b-belly.\nRyunosuke:\nWhat?!\n\nMy Lord!\n\nJudge:\nHm? Juror number three? What's the meaning of this?\nJuror No. 3:\nMy mind is made up, My Lord. Completely and utterly made up!\nRyunosuke:\nMade up about what...?\nJuror No. 3:\nI don't like the stinking rich. Never have. They're always up to something or other that they shouldn't be. Every one of them. And that little leprechaun of a man is no exception. Well...he can't fool me! There's no point in wasting time listening to any more of this. That's my opinion on the matter, anyway.\n???:\n\nJuror No. 1:\nThat is precisely what I was about to say! As the foreman of the jury, it's my duty to set a good example to my fellow jurors.\nRyunosuke:\nWhat the...? (What is happening here?!)\nSusato:\nLet me see... Ah yes, it seems that's how the members of the jury give their verdicts.\nRyunosuke:\n...With fire?\nSusato:\nApparently, yes. White for innocent, and black for guilty. As the six members of the jury make up their minds about the case... ...one by one, they each cast a ball of fire into the great Scales of Justice...as we saw a moment ago.\nRyunosuke:\nSo if those enormous scales fall completely to the black side, does that mean...?\nSusato:\n......... Let's do our very best to make sure that doesn't happen!\nRyunosuke:\n(Ugh... Now I'm even more worried than I was before...)\nJudge:\nVery well. The court acknowledges the change in the jury's stance. Counsel for the Defence, please continue with your cross-examination.\nRyunosuke:\nHaah... (This is a nightmare...)Press (after Jurors No. 1 and 3 vote guilty)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nErm...what exactly did you see?\nBeppo:\nOh, well sir, that would be the p-p-passenger, sir. Yes, c-c-collapsed on the floor, he was.\nVan Zieks:\nAnd by the passenger, obviously you are referring to the victim, Mr Mason, the brickmaker.\nBeppo:\nAnd, and then the other p-p-passenger had that kn-knife in his hand, l-like this...\nVan Zieks:\nBy the other passenger, obviously you are referring to the accused, Mr Magnus McGilded.\nBeppo:\nAnd then he p-p-p-plunged it down like this, s-stabbing the other passenger in the b-b-belly.\nRyunosuke:\nWhat?!\nJuror No. 2:\nMy Lord, if you'll forgive the interruption...\nJudge:\nAh, juror number two. Go on...\nJuror No. 2:\nMr McGilded is a pillar of society and a gentleman. And a gentleman's word should be sacrosanct. However... ...those of us in service know we must accept hard truths.\nRyunosuke:\nWait, what are you about to do?\nJuror No. 2:\nDispose of the rubbish!\nRyunosuke:\nNo!\nJuror No. 2:\nI don't wish to cause offence, but I do like to eradicate all traces of filth and grime.\n???:\n\nJuror No. 4:\n...I have painstakingly typed every word uttered here today, and cross-referenced all the facts. As such, I am now in a position to draw the only logical conclusion.\nRyunosuke:\nNot again...\nSusato:\nThat's...four out of six jury members who've proposed a guilty verdict! There are only two left!\nRyunosuke:\n(We've had it... Every time I press these witnesses for more information, I just make the situation worse...)\nSusato:\nNevertheless... ...what we need more than anything at the moment is more information. We're still very much in the dark.\nRyunosuke:\nI suppose I'll just have to keep pressing the witnesses, knowing that more sparks may well fly...\nSusato:\nWe mustn't give up hope that we'll uncover something that will give us a way to fight back!\nRyunosuke:\nBut... ......... Alright, I'll keep trying. (I can't give up. I just need to keep calm and listen to the witnesses' statements again.)Press (after Jurors No. 2 and 4 vote guilty, if first, third, and fourth statements were pressed)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nErm...what exactly did you see?\nBeppo:\nOh, well sir, that would be the p-p-passenger, sir. Yes, c-c-collapsed on the floor, he was.\nVan Zieks:\nAnd by the passenger, obviously you are referring to the victim, Mr Mason, the brickmaker.\nBeppo:\nAnd, and then the other p-p-passenger had that kn-knife in his hand, l-like this...\nVan Zieks:\nBy the other passenger, obviously you are referring to the accused, Mr Magnus McGilded.\nBeppo:\nAnd then he p-p-p-plunged it down like this, s-stabbing the other passenger in the b-b-belly.\nRyunosuke:\nWhat?!\nLeads to:\n\"My Lord, I wish to speak!\"Press (subsequent times)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nErm...what exactly did you see?\nBeppo:\nOh, well sir, that would be the p-p-passenger, sir. Yes, c-c-collapsed on the floor, he was.\nVan Zieks:\nAnd by the passenger, obviously you are referring to the victim, Mr Mason, the brickmaker.\nBeppo:\nAnd, and then the other p-p-passenger had that kn-knife in his hand, l-like this...\nVan Zieks:\nBy the other passenger, obviously you are referring to the accused, Mr Magnus McGilded.\nBeppo:\nAnd then he p-p-p-plunged it down like this, s-stabbing the other passenger in the b-b-belly.\nRyunosuke:\nWhat?!\nJudge:\n...Ordaaar! Ordaaaaaar!!! It is hard to believe of one of London's greatest philanthropists, but this is damning indeed.\nVan Zieks:\nThe law knows no philanthropists, My Lord. Only the innocent...and the guilty. Good deeds mean nothing, when overshadowed by evil. The truth...is everything.\nBeppo:\nCouldn't agree more, sir! The truth!Ryunosuke:\n(Alright, so when it happened, the only two people in the enclosed cabin area were the victim and the defendant. And - so help me - THREE WHOLE PEOPLE witnessed the man I'm trying to defend do the deed...)Susato:\nI don't like to be pessimistic, but we do seem to be in a rather difficult situation here.Ryunosuke:\nUgh... (What am I supposed to think here? Is Mr McGilded really innocent? Or could it be...?)Susato:\nB-before we jump to conclusions, our first task should be to gather information. We need to understand the case much better than we do at the moment.Ryunosuke:\nYes! You're absolutely right. (Let's listen to those witness statements again, a little more carefully this time.)Juror No. 5:My Lord, I wish to speak!Judge:\nYes, juror number five? Do I take it that you, too...?Juror No. 5:\nAs the master of the London Guild of Coachmen... ...the idea of a murder being committed in one of the city's carriages is utterly abhorrent to me. It wouldn't be right to make a decision before hearing all the facts, though, I said to myself. But I've heard enough now. The horse has bolted, as they say.Ryunosuke:\nNo, no! Please, just keep an open mind a little long-Juror No. 5:\nGee-up now, Silver Blaze! The finish is in sight! Beppo is a long-standing member of the guild, and I trust what the man says.Beppo:\nOh, thank you, sir. You're t-t-too kind, sir.Ryunosuke:\nUgh, this is t-t-too unkind, sir...Van Zieks:\nWhich now means that five jurors agree to condemn this man. Madam juror number six...Juror No. 6:\nYes, dear? What can I do for you?Van Zieks:\nYou have heard the testimonies of the witnesses in the stand.Juror No. 6:\nOh yes. I certainly have. Still got my hearing, you know!Van Zieks:\nThen, pray tell, why are you yet to pronounce your leaning?Juror No. 6:\n......... Well, dear, the thing is, I'm a creature of habit, me. I always go to the park at around this time of day, and sit on a nice bench and get on with my knitting.Van Zieks:\n.........Juror No. 6:\nThere's a lovely little park just near where I live. McGilded Park, it's called.Ryunosuke:\n...!Juror No. 6:\nThe gentleman donated it to the city, you know. To put a smile on Londoners' faces, he said. I can't imagine such a fine, young gentleman would have it in him to take another man's life.He is always doing wonderful things for the city.That's right! A man like that wouldn't stab someone, surely?Mother, may we go to the McGilded Public Library later and borrow some more books?Van Zieks:\nHow many Londoners live with their heads in the clouds?! Do you people not know... ...what kind of a man Magnus McGilded really is?Ryunosuke:\nWhat kind of a man is he?!Van Zieks:\nThe philanthropist, Magnus McGilded... ...has enough wealth to purchase the entire city he claims to value so highly. But where did all that wealth come from? Your client is a shylock, sir! And one with the very darkest of souls.Ryunosuke:\nWhat?!Juror No. 6:\nStone the crows!Van Zieks:\nMcGilded lends money at extortionate rates of interest so his victims have no hope of repaying him. When they default, he takes possession of everything they own. He is a vulture that preys on the weak.Juror No. 6:\nI've, I've never heard any mention of that before...Van Zieks:\nYour faculties haven't deserted you, I'm sure, madam. So has this thought not crossed your mind? Would a man wealthy enough to buy London in its entirety not have a carriage of his own?Ryunosuke:\n...!Van Zieks:\nWhat possible reason could this man have had to make use of a public omnibus service?Juror No. 6:\nUm...Ryunosuke:\nYou're not saying that...?Van Zieks:\nThe victim - a poor brickmaker - had next to nothing to his name, save considerable financial liability. It will come as no surprise that his creditor was the accused, Magnus McGilded. But let it also be known, that the very day Mr Mason was killed, was the final repayment date for his debts.Judge:\nGood gracious!Van Zieks:\nThe brickmaker was destitute. He had lost his house. He had not a shilling with which to repay his debts. And in the end, this pitiful soul had the very last thing he owned taken from him...his life. By the merciless philanthropist pretender... Magnus McGilded!Ryunosuke:\n(I don't believe it!)Susato:Susato:\nIf I might add something briefly...?Ryunosuke:\nMiss Susato?Susato:\nYou claim that the victim had been lent money by Mr McGilded... ...but where is the evidence to support your claim?Van Zieks:\n......... ...Pray forgive the discourtesy of filling my hallowed chalice in a court of law...Judge:\nAh-ha, there it is! Lord van Zieks's hallowed chalice!Ryunosuke:\n(How can this be considered acceptable?!)Van Zieks:\n...But I find myself in unexpectedly good humour. I had heard ladies from the Far East could show great courage...but I didn't expect to experience it myself.Susato:\nAh! As, as judicial assistant to the defence, I am simply doing my job!Van Zieks:\nWhat a pity that your display of courage...is in vain. This is the debtors' ledger, which details all monies loaned by the accused. You will find the victim's name clearly recorded inside.Susato:\nOh...Van Zieks:\nAllow me to present this ledger as evidence... ...and pray forgive the discourtesy of raising my chalice in a toast to the enigmatic East at the same time!Judge:\nA marvellous toast, Counsel! I will gladly accept this new evidence.The debtors' ledger has been entered into the Court Record.Judge:\nAh yes, twenty guineas... The victim owed a considerable sum.Examine evidence\n\n\n\n\n\n\n\n\n\nDebtors' Ledger\n\n\n\n\n\n\n\n\n\nClasp\n\n\n\n\n\n\n\nRyunosuke:\n...This portfolio must contain all sorts of secrets of London's gentry.\nSusato:\nOh dear... Do you really think we ought to look inside?\nRyunosuke:\nWell, it's not as though we know any of London's gentry personally, is it? Apart from our great detective friend, perhaps. ......... (Actually, I wonder...)\nSusato:\nI assure you we will not find Mr Sholmes's name inside!\nRyunosuke:\nWell, let's see what we find...\n\n\n\nWriting\n\n\n\n\n\n\n\nSusato:\nGosh, it's crammed full of gentlemen's names, isn't it?\nRyunosuke:\nWell, I suppose they're probably not all gentlemen at all, are they? (After all, not everyone in this country is well off...)\nSusato:\nAh! Goodness!\nRyunosuke:\nWhat is it?\nSusato:\nLook at this! Do you see the name here?\nRyunosuke:\n'Bruce Fairplay'... ...Should that mean something to me? It, it does sound strangely familiar, actually...\nSusato:\nBruce Fairplay! The witness testifying at this very moment!\nRyunosuke:\nOh yes, of course! The banker! Why is his name in here? (...Ah, he borrowed twenty guineas, did he?) And look, the repayment date is fast approaching.\nSusato:\nIt's possible that this is just a coincidence, of course. But this could be very useful information.\nThe details of the debtors' ledger have been updated in the Court Record.\n\n\n\n\nWriting (subsequent times)\n\n\n\n\n\n\n\nSusato:\nGosh, it's crammed full of gentlemen's names, isn't it?\nRyunosuke:\nWell, I suppose they're probably not all gentlemen at all, are they? (After all, not everyone in this country is well off...)Van Zieks:\nAnd the accused made quite certain he had ample recompense.Juror No. 6:\n......... Well, it would seem I've... ...I've had the wool pulled over my eyes.Van Zieks:\nRegrettably, madam, that is the modus operandi of the accused.Juror No. 6:\nAnd it's such a pretty little park, too. ...What a scoundrel! .........Still... ...maybe it's all for the best.Ryunosuke:\nAh! W-Wait a minute! Let's think about this a little more before-Juror No. 6:\nI don't stand for nonsense!Ryunosuke:\n......... (That was it... The last juror's decision...)Susato:\n......... ...Ah, according to this Encyclopaedia of British Law... 'When all members of the jury have concluded that the defendant is guilty... ...court proceedings are suspended, and the presiding judge will deliver the final verdict and sentence.' That's what it says here.Ryunosuke:\n(Haah... The final verdict... It's over then.)Susato:\nOh! There's a footnote, though.Ryunosuke:\nA footnote?Susato:\n'However, the defence-'Judge:\nAll six members of the jury are now in agreement in this case.Van Zieks:\nAllow me to convey my respect for your swift and righteous decision.Judge:\nAccording to the laws of this country, I will now conclude the trial... ...by delivering my final verdict. ...I trust there are no objections?Ryunosuke:\n......... ......... Miss Susato, just tell me one thing...Susato:\nOh! Yes?Ryunosuke:\nYou were in the middle of saying something before. The footnote in your Encyclopaedia of British Law. 'However, the defence...' What did it say next?Susato:\nO-Oh yes, of course. One moment... 'When all members of the jury have concluded that the defendant is guilty... ...court proceedings are suspended, and the presiding judge will deliver the final verdict and sentence.' Then the footnote says... 'However, the defence... ...has the right to demand a summation examination of the jurors at this point.'Ryunosuke:\nA...summation...examination...?Van Zieks:Van Zieks:\n...A summation examination? From which century has that tome you have there been resurrected?Susato:\nAh!Van Zieks:\nJudging from the binding, I would say that book is at least fifty years old. Any modern text on British Law wouldn't even give such an antiquated procedure a mention. It's a relic. Long forgotten, and certainly no longer practised. So you're out of luck.Susato:\nOh...Ryunosuke:\nWhat even is it, Miss Susato? This so-called 'summation examination'?Susato:\nOh, um... One moment, and I'll read about it.Van Zieks:\n...You would demand the right to a procedure before you even understand what it entails? Hmph, typical Nipponese.Susato:\nAlright, Mr Naruhodo, I think I understand... It seems that under this procedure, we would be able to appeal to the members of the jury.Ryunosuke:\nTo do what...exactly?Susato:\nAppeal to them to change their leaning and reverse their decisions. And it says here that... ...'If successful, the proceedings of the trial must be resumed.'Ryunosuke:\n(Make them reverse their decisions...)Judge:\nYes, in times gone by, barristers would use a summation examination to attempt to influence the jury's decision. But that procedure became something of a formality with no practical benefit, really. So it rather fell out of use.Susato:\nI wonder why...Van Zieks:\nBecause it was devoid of purpose.Ryunosuke:\n...!Van Zieks:\nChanging just one member of the jury's mind would be hard enough, let alone several. No self-respecting defence barrister would even assert his right to try in this day and age.Susato:\n......... Still... ...I don't see any mention of the procedure actually being formally revoked.Van Zieks:\nWhat are you suggesting?Susato:\nI'm suggesting that although it may be antiquated and largely forgotten...it isn't yet extinct.Van Zieks:\n...!Susato:\nWhat do you think, Mr Naruhodo?Ryunosuke:\n(A summation examination... Our last possible option. Do we assert our right to carry it out, or admit defeat?)Assert our right\n\n\n\n\n\n\n\nLeads to:\n\"The defence wishes to assert its right to a summation examination, My Lord!\"Forget it\n\n\n\n\n\n\n\nRyunosuke:\n.........\nSusato:\nMr Naruhodo... Are you sure that's the right decision?\nRyunosuke:\nYou heard what the judge and the prosecutor said. It's an antiquated procedure. It's history. We barely know our way around the law that's in use today. What hope would we have of pulling it off?\nSusato:\n.........  Perhaps what we don't know can work to our advantage.\nRyunosuke:\nSorry?\nSusato:\nIn any case, there's really only one course of action available to us here. What we can't afford to do is allow this trial to end!\nRyunosuke:\n...! (What we don't know can work to our advantage...?) You're right, Miss Susato. Let's bring this antiquated procedure back into the present day!\nLeads to:\n\"The defence wishes to assert its right to a summation examination, My Lord!\"Ryunosuke:\nThe defence wishes to assert its right to a summation examination, My Lord!Van Zieks:Van Zieks:\nLondon is the capital city of the most powerful nation on earth. We have a duty to the world to exemplify the very highest standards of judicial procedure. Summation examinations are an embarrassment that should remain buried!Ryunosuke:Ryunosuke:\nBut if it's our right, it's our right! I believe it could prove vital in this trial!Judge:\nThe defence's petition is perfectly valid. The court will proceed with the summation examination!Van Zieks:\nThis is madness...Judge:\nForeman, are you and the remainder of the jury ready?Juror No. 1:\nEh?! Well, erm, I'm not, erm... There was no mention of this in the letter I received, you see, so...Judge:\nAll members of the jury will be asked to explain on what grounds they have reached their decision.Juror No. 1:\nOn what grounds...?Judge:\nYou must all justify your decisions and explain why you believed the defendant to be guilty.Juror No. 1:\nWell, My Lord, you're rather putting us on the spot...Juror No. 2:\nThis is most irregular. No mention was made of this before.Juror No. 3:\nI don't really hold with all this 'justifying' lark.Juror No. 4:\n.........Ryunosuke:\n(That seems to have thrown the jurors off...)Susato:\nIt seems none of them have experienced this before.Ryunosuke:\n(Alright then, the summation examination... A defence procedure no practising lawyer has attempted for years, is it? Well, just maybe... ...it might be the opportunity we've been looking for... to turn this trial around!)Judge:\nSo be it, then. Ladies and gentlemen of the jury, the court hereby calls upon you... ...to state the grounds on which you find the defendant, Magnus McGilded, guilty of this most serious crime.Judicial Findings\n- The Jurors' Contentions -Juror No. 1:\nThere was no one else inside the carriage at the time, so it has to have been him.Juror No. 2:\nI trust the driver. He has an excellent memory, it seems. Four passengers, with fares totalling twenty pence.Juror No. 3:\nHe stuck the chap next to him just like this! Brazen, I must say. Absolutely brazen!Juror No. 4:\nI have simply typed and collated all the statements made thus far, and drawn the logical conclusion.Juror No. 5:\nYou can trust the guild. Fair fares is our motto. We haven't raised prices above fourpence for years.Juror No. 6:\nThe scoundrel, stabbing that poor man on the floor! It beggars belief!Ryunosuke:\n(I'm starting to wish I hadn't pushed for this now...)Susato:\nSome of the jurors don't seem to have wonderfully formed arguments, though, do they?Ryunosuke:\nWell, let's see what we can do. We need to get these six people to change their minds. (I'll have to throw everything I can at them! And use some very persuasive language...)Susato:\nJust a moment, Mr Naruhodo. According to my book, that's not quite how it works.Ryunosuke:\nOh? I thought I was going to have to thaw their icy minds with some heart-warming rhetoric about the defendant.Susato:\nUnfortunately... ...once the jurors have decided the defendant is guilty, they're unlikely to heed anything the defence says.Ryunosuke:\nBut, but then...Susato:\nThey've reached their conclusions by their own reasoning, you see. Your pleas will sound like excuses. In fact, it could recoil on you. The more you try to persuade them, the more entrenched they may become.Ryunosuke:\nThen what on earth am I supposed to do?!Susato:\nOh dear. I'm just citing what I've read about British law, Mr Naruhodo.Ryunosuke:\nRight, I'm sorry. ...Do you have any idea how to make this work, then?Susato:\nWell, from what I can understand... ...the key to this procedure is using the jurors' own words to make your arguments.Ryunosuke:\nWhat do you mean?Susato:\nWell, the six members of the jury are randomly selected members of the public. They may appear to present a united front, but the truth is... ...they are complete strangers, who just happen to find themselves here in the courtroom together.Ryunosuke:\nAnd...that's the way to break them down, you mean?Susato:\nYes, exactly. We must listen very carefully to what each member of the jury says... ...and see if we can identify any contradictory statements. If we can, we then contrast the statements and pit the corresponding jurors against each other!Ryunosuke:\nI see. So it's contradictions in what two or more jurors say that we're looking for. In a way, then... ...this is similar to a regular cross-examination.Susato:\nOh! Yes, I, I suppose you're right!Ryunosuke:\n......... (Find contradictions in their statements and pit the jurors against one another to break them down... Alright, I might be able to pull this off. ...No, that's not right... I HAVE TO pull this off!)Judge:\nCan we start proceedings, Counsel? I would ask you to take the stand for this. I'm expecting a clear and concise rebuttal!Ryunosuke:\nYes, My Lord!Jury Examination\n- The Defence's Rebuttal -Juror No. 1:\nThere was no one else inside the carriage at the time, so it has to have been him.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nCertainly, the testimonies we've heard suggest the victim and Mr McGilded were alone inside the carriage.\nJuror No. 1:\nPrecisely my point.\nRyunosuke:\nBut! Could there be some other explanation? Something we haven't considered yet?\nJuror No. 1:\nSuch as...?\nRyunosuke:\n......... Haha, well, um...perhaps that's something we could, um... all work out together now?\nJuror No. 1:\nNow listen here! Maybe you don't know how things work around here because you're...from foreign climes. But we're here to form our opinions as individuals. And I have!\nRyunosuke:\nUgh...\nSusato:\nOh dear. He doesn't appear to be in the mood to consider an alternative point of view, does he?\nRyunosuke:\n(No, I'm going to have to pit the jurors against one another, like Susato-san said. Finding contradictions in these six people's assertions is the only way I'm going to succeed...)Juror No. 2:\nI trust the driver. He has an excellent memory, it seems. Four passengers, with fares totalling twenty pence.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nBut does his ability to recall his takings that night really tell us how trustworthy the man is?\nJuror No. 2:\nI manage all His Lordship's cash affairs, so I'm very particular when it comes to accounts.\nRyunosuke:\nI see...\nJuror No. 2:\nA single penny can mean the difference between life and death, after all, can't it?\nRyunosuke:\n...That's, that's a saying in your country?\nJuror No. 2:\nMy point is, a man who minds his figures is a man you can trust. Those of us in service would swear to that, sir.\nRyunosuke:\n(Does that bench really need any more polishing...?)\nJuror No. 2:\nSo if the good driver says that he saw Mr McGilded in the act, I don't doubt him. The only task left to do today is disposing of the rubbish.\nRyunosuke:\n(Ah, now wait a minute... One of the other jurors mentioned something about money, I think.)\nSusato:\nNow would be a very good time to listen carefully to the jurors' statements again, Mr Naruhodo. If you notice an inconsistency in what two different jurors are saying...\nRyunosuke:\n...I should expose it by pitting them against each other. (Yes, let's see if I can do just that...)Pit against Juror No. 5's statement (before Jurors No. 3 and 6 vote innocent)\n\n\n\n\n\n\n\nRyunosuke:\n \nRyunosuke:\nThose two statements clearly contradict each other!\nJudge:\nThey do? Explain yourself, Counsel!\nJuror No. 2:\nMe?! Oh dear, what have I said?\nJuror No. 5:\nI swear on Silver Blaze's mane and name, I haven't the first idea what you're talking about!\nRyunosuke:\nAccording to the group testimony we've heard so far... ...there were four passengers on the omnibus on the night in question. And according to the coachman, Mr Beppo, he took twenty pence in fares.\nJuror No. 4:\nQuite right. I have those precise details typed neatly here in front of me.\nRyunosuke:\nAnd juror number five also told us the following: The fare for the omnibus...is always fourpence.\nJuror No. 5:\nThat it is. A fair and convenient single price. Just the way London's carriages should be operated!\nRyunosuke:\nBut that doesn't add up at all. In fact, it leaves a glaring discrepancy in the facts.\nJuror No. 5:\nWhy, man, why?!\nRyunosuke:\nFour passengers paying fourpence each. If you do the multiplication...\nJuror No. 2:\nAh! It would be sixteen pence!\nRyunosuke:\nExactly. As I said, it doesn't add up. The figures are different. By fourpence, in fact. ...Or precisely one person's fare.\nJudge:\nOne person's fare?\nRyunosuke:\nYes! In other words, on the omnibus that night... ...it's distinctly possible...there was another passenger we've heard nothing about!\nJudge:\nGood gracious!\nJuror No. 5:\nThis, this can't be right! The coachmen of the guild are good, honest men, one and all! Trustworthiness is our watchword!\nJuror No. 4:\nThe figures your coachman claims most certainly do not add up. Your watchword, good sir, is a fallacy!\nJuror No. 5:\nI beg your pardon?!\nRyunosuke:\nMr Guildmaster, I think you ought to consider that if this trial were to end now... ...the news will surely spread all over London. The news that one of your coachmen tried to hide the fact that he lets nefarious characters ride his omnibus.\nJuror No. 5:\n...! Alright then, how do I make it so this miserable trial doesn't end, hm?\nSusato:\nWell, according to my book here... ...you simply launch a ball of fire onto the innocent side of the set of scales!\nJuror No. 1:\nNow hold your horses there, coachman! We were all in agreement! Why do you have to go and-\nJuror No. 5:\nWait till I get my hands on you, Beppo!!!\nJuror No. 1:\nArgh! This is all very irritating...\nJuror No. 2:\nBegging your pardon, sir, I'm going to do the same.\nJuror No. 1:\nFor the love of Mike! Not you as well?!\nJuror No. 2:\nA penny can be the difference between a smile and a tear, after all. I certainly can't put my trust in someone who doesn't follow my exacting standards in financial matters.\nJuror No. 1:\nOh really?\nJuror No. 2:\nI, for one, think it's only proper that we hear from the witnesses again.\nSusato:\nOh, well done, Mr Naruhodo! You did it! If we can manage to change two more jurors' minds... ...we can force the trial to continue!\nRyunosuke:\nTwo more... (Actually... ...there is something else that's bothering me about a couple of their assertions.)\nSusato:\nThen that's where you must strike next!\nRyunosuke:\n(So I need to pit two more jurors against each other and show there's another contradiction in their assertions.)\nSusato:\nExactly! You can do it!\nJudge:\nWell, the Scales of Justice have shifted, but they still weigh heavy on the side of guilt. Counsel, you have the floor again. Continue with your summation examination!\nChanges Juror No. 2's statement to \"I'm changing my leaning to innocent. I should like to hear what the slipshod bookkeeper has to say for himself!\" and Juror No. 5's statement to \"Grrr! Beppo! This trial has to continue so I can get to the bottom of this corruption! Not guilty, I say!\"Pit against Juror No. 5's statement (after Jurors No. 3 and 6 vote innocent)\n\n\n\n\n\n\n\nRyunosuke:\n \nRyunosuke:\nThose two statements clearly contradict each other!\nJudge:\nThey do? Explain yourself, Counsel!\nJuror No. 2:\nMe?! Oh dear, what have I said?\nJuror No. 5:\nI swear on Silver Blaze's mane and name, I haven't the first idea what you're talking about!\nRyunosuke:\nAccording to the group testimony we've heard so far... ...there were four passengers on the omnibus on the night in question. And according to the coachman, Mr Beppo, he took twenty pence in fares.\nJuror No. 4:\nQuite right. I have those precise details typed neatly here in front of me.\nRyunosuke:\nAnd juror number five also told us the following: The fare for the omnibus...is always fourpence.\nJuror No. 5:\nThat it is. A fair and convenient single price. Just the way London's carriages should be operated!\nRyunosuke:\nBut that doesn't add up at all. In fact, it leaves a glaring discrepancy in the facts.\nJuror No. 5:\nWhy, man, why?!\nRyunosuke:\nFour passengers paying fourpence each. If you do the multiplication...\nJuror No. 2:\nAh! It would be sixteen pence!\nRyunosuke:\nExactly. As I said, it doesn't add up. The figures are different. By fourpence, in fact. ...Or precisely one person's fare.\nJudge:\nOne person's fare?\nRyunosuke:\nYes! In other words, on the omnibus that night... ...it's distinctly possible...there was another passenger we've heard nothing about!\nJudge:\nGood gracious!\nJuror No. 5:\nThis, this can't be right! The coachmen of the guild are good, honest men, one and all! Trustworthiness is our watchword!\nJuror No. 4:\nThe figures your coachman claims most certainly do not add up. Your watchword, good sir, is a fallacy!\nJuror No. 5:\nI beg your pardon?!\nRyunosuke:\nMr Guildmaster, I think you ought to consider that if this trial were to end now... ...the news will surely spread all over London. The news that one of your coachmen tried to hide the fact that he lets nefarious characters ride his omnibus.\nJuror No. 5:\n...! Alright then, how do I make it so this miserable trial doesn't end, hm?\nSusato:\nWell, according to my book here... ...you simply launch a ball of fire onto the innocent side of the set of scales!\nJuror No. 1:\nNow hold your horses there, coachman! We were all in agreement! Why do you have to go and-\nJuror No. 5:\nWait till I get my hands on you, Beppo!!!\nJuror No. 1:\nArgh! This is all very irritating...\nJuror No. 2:\nBegging your pardon, sir, I'm going to do the same.\nJuror No. 1:\nFor the love of Mike! Not you as well?!\nJuror No. 2:\nA penny can be the difference between a smile and a tear, after all. I certainly can't put my trust in someone who doesn't follow my exacting standards in financial matters.\nJuror No. 1:\nOh really?\nJuror No. 2:\nI, for one, think it's only proper that we hear from the witnesses again.\nLeads to:\n\"...Wait! That, that means...\"Juror No. 2:\nI'm changing my leaning to innocent. I should like to hear what the slipshod bookkeeper has to say for himself!Juror No. 3:\nHe stuck the chap next to him just like this! Brazen, I must say. Absolutely brazen!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nCareful! You, you could hurt somebody with that!\nJuror No. 3:\nTsk! You're a fine one to talk! What of that sword hanging from your waist, hm?\nRyunosuke:\nNo no! That's...just my battered soul...\nJuror No. 3:\nWell anyway, I despise anyone with too much money. They're all the same. All stabbing some brickmaker or other behind the scenes, you mark my words!\nRyunosuke:\n \nRyunosuke:\nThat...seems very unlikely, doesn't it?\nJuror No. 3:\nAre you mad, man? We know that small shorty is a rotten shylock!\nRyunosuke:\nWell, yes, that does seem to be the case, but-\nSusato:\nMr Naruhodo! Please! Be careful what you say!\nJuror No. 3:\nIf he's been trying to squeeze money out of us less fortunate, then as far as I'm concerned... ...he's as guilty as sin! The man can hang!\nRyunosuke:\n(Come to think of it... ...didn't one of the other jurors have something to say about the defendant's underhand activities?)\nSusato:\nIf you've thought of something, Mr Naruhodo, don't let it go! Test your theory!\nRyunosuke:\n(Pit the two jurors whose statements seem to be contradictory against each other...? No time like the present to use [X / Y / R] to 'Pit' them against each other...or I'll never get anywhere...)Pit against Juror No. 6's statement\n\n\n\n\n\n\n\nRyunosuke:\n \nRyunosuke:\nThose two statements are completely contradictory!\nJudge:\nWhaaat?! Explain, Counsel, post-haste!\nJuror No. 6:\nOh dearie me! I, I was only knitting a jumper for my other half!\nJuror No. 3:\nWhat is all this claptrap? What does 'contradictory' even mean, I ask you?\nRyunosuke:\nWe've heard from more than one witness... ...that they allegedly saw the actual moment when the defendant stabbed the victim. Now, out of curiosity, juror number three...\nJuror No. 3:\nWhat?! Can't you see that I'm busy here?\nRyunosuke:\n...How would you say the defendant stabbed the victim? What sort of motion was it?\nJuror No. 3:\nHa! Want to test me, do you? It was like this! Stuck the fellow next to him without even getting up! Just like the prim banker said.\nJudge:\nYes, that was Mr Fairplay's testimony. Quite true.\nRyunosuke:\nNow then, juror number six...\nJuror No. 6:\n...Oh! Is that me, is it? What can I do for you, young man?\nRyunosuke:\nHow would you say the defendant stabbed the victim, madam?\nJuror No. 6:\nOh, well dear, as far as I understand it... ...it was like this! He stabbed the poor man after he'd collapsed on the floor! ...The coachman said so.\nRyunosuke:\nNow don't move! Take a look at these two jurors! 'He stuck the fellow next to him without even getting up!' And 'He stabbed the poor man after he'd collapsed on the floor!'\nJudge:\nWell I never! They're... They're stabbing in totally different directions!\nJuror No. 3:\nWhat?!\nJuror No. 6:\nBless my stitches! What a muddle!\nRyunosuke:\nWhat this tells us... ...is that there's a strong possibility one of the witnesses isn't telling the truth!\nJuror No. 6:\nOh!\nJuror No. 3:\nBut why?! Why the dickens would they lie?\nRyunosuke:\nI don't know that yet. But what I do know... ...is that if the trial ends at this point, we may never find out! We may never know the real truth! Ladies and gentlemen of the jury! Can you really let that happen, in all good conscience?\nJuror No. 6:\nLies, you say? Oh dearie me... I can't abide people telling lies!\nJuror No. 2:\nThe, the scales...\nJuror No. 5:\nI don't believe it!\nJuror No. 1:\n\nJuror No. 1:\nWaaaaaait! Now hear this, my fellow jurors: I warn you, you cannot listen to this man! Look at him, in his black suit! He's...he's...clearly some devious Eastern sorcerer using magic on us all!\nRyunosuke:\n(If I could use magic, do you really think I'd be putting myself through all this?)\nJuror No. 1:\nAnswer me this, Dark Jinx!\nRyunosuke:\nHuh?! M-Me?\nJuror No. 1:\nWhat exactly is the problem? What of it if two witnesses have slightly different recollections of events?\nRyunosuke:\nWhat of it?\nJuror No. 1:\nLet's say the shylock did stab the victim as he was sat next to him on the omnibus. And this young dandy saw him do it! And now let's say the victim collapsed on the floor, and then the shylock stabbed him again! And this old lady saw him do it! Well? What's to say it didn't happen like that, hm?\nJuror No. 3:\nWho are you calling a dandy, sir?! Why, I should take this knife to you!\nJuror No. 6:\nWho are you calling old?! Why, I should take this needle to you!\nRyunosuke:\n(Ugh...they're ready to kill each other now... But could the foreman of the jury be right? Did the two witnesses see two different moments of the same crime?) \n\n\n\nIt's possible\n\n\n\n\n\n\n\nRyunosuke:\nHm, it's true... There's an outside chance of almost anything you care to mention.\nJuror No. 1:\nEeexactly the point I've been trying to make!\nSusato:\nBefore you go any further, Mr Naruhodo...\nRyunosuke:\nOh! What is it, Miss Susato?\nSusato:\n...I think you should have a look through the Court Record.\nRyunosuke:\n......... Ah!\nSusato:\nYou see? This evidence makes it quite clear. There isn't even an outside chance of what the juror is saying!\nRyunosuke:\n(How did I miss that...?)\nLeads to:\n\"Unfortunately, Mr Foreman...\"\n\n\n\n\nIt's out of the question\n\n\n\n\n\n\n\nLeads to:\n\"Unfortunately, Mr Foreman...\"\n\n\nRyunosuke:\nUnfortunately, Mr Foreman...\nJuror No. 1:\nHm? What is it, you dark jinx? Come on, out with it!\nRyunosuke:\n...What you're suggesting is impossible! It's out of the question!\nJuror No. 2:\n...!\nJuror No. 4:\n...!\nJuror No. 6:\n...!\nJuror No. 1:\nWhat, what are you talking about, man? How can you possibly say that? You, you do realise that I'm...I'm only doing my job! As foreman of the jury, I have a responsibility to steer everyone in the right direction. So where's your evidence, man? That's what we want to see! I say the two witnesses saw two different moments of the same crime. If you say that's out of the question, show me some proof!\nRyunosuke:\n......... (It looks like the only way I'm going to convince him is to present him with something he can't dismiss. Some irrefutable hard evidence!) As you wish.\nJuror No. 1:\nWhat?\nRyunosuke:\nI'll give you the proof. It's out of the question that the two witnesses saw two different moments of the same crime...as proven by... \n\n\n\nPresent Autopsy Report (before Jurors No. 2 and 5 vote innocent)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nThis is the victim's autopsy report. According to what's written here, Mr Mason was stabbed in the abdomen... ...only once.\nJuror No. 1:\nEh?! Only once?!\nRyunosuke:\nIt's quite simple! The victim was stabbed precisely one time. Which means these witnesses can't possibly have seen it happen two different times!\nJuror No. 3:\nHuuurgh...grrr...hyuuurgh... Alright...I concede defeat!\nSusato:\nOh, well done, Mr Naruhodo! You did it! If we can manage to change two more jurors' minds... ...we can force the trial to continue!\nRyunosuke:\nTwo more... (Actually... ...there is something else that's bothering me about a couple of their assertions.)\nSusato:\nThen that's where you must strike next!\nRyunosuke:\n(So I need to pit two more jurors against each other and show there's another contradiction in their assertions.)\nSusato:\nExactly! You can do it!\nJudge:\nWell, the Scales of Justice have shifted, but they still weigh heavy on the side of guilt. Counsel, you have the floor again. Continue with your summation examination!\nChanges Juror No. 3's statement to \"I'm no lover of the rich, but I despise liars even more! Innocent is my call, for now at least!\" and Juror No. 6's statement to \"Dear me, you can't make accusations based on lies! I wonder if the poor man is innocent after all...\"'\n\n\n\n\nPresent Autopsy Report (after Jurors No. 2 and 5 vote innocent)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nThis is the victim's autopsy report. According to what's written here, Mr Mason was stabbed in the abdomen... ...only once.\nJuror No. 1:\nEh?! Only once?!\nRyunosuke:\nIt's quite simple! The victim was stabbed precisely one time. Which means these witnesses can't possibly have seen it happen two different times!\nJuror No. 3:\nHuuurgh...grrr...hyuuurgh... Alright...I concede defeat!\nLeads to:\n\"...Wait! That, that means...\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\n...this clear piece of evidence! Well, Mr Foreman?\nJuror No. 1:\n......... Do you know what they say about me, young man? They say I've got no powers of persuasion.\nRyunosuke:\nOh, I see... Erm... I'm sorry to hear that...?\nJuror No. 1:\nBut no one will need persuading about this: You're even worse than me!\nRyunosuke:\nAaagh! (Two different moments... In other words, the victim was stabbed two times... Ah! But we have evidence that clearly contradicts that possibility!) If you'll allow me another chance...I'd like to present you with one more piece of evidence to consider.\nLeads back to:\n\"It's out of the question that the two witnesses saw two different moments of the same crime...as proven by...\"Juror No. 3:\nI'm no lover of the rich, but I despise liars even more! Innocent is my call, for now at least!Juror No. 4:\nI have simply typed and collated all the statements made thus far, and drawn the logical conclusion.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nUm...\nJuror No. 4:\n.........\nRyunosuke:\nWhat have you been doing all this time?\nJuror No. 4:\n'What have you been doing all this time?'... There. ...I should have thought it was obvious. I am recording everything that takes place as part of these proceedings.\nRyunosuke:\nAnd...what have you learnt from that?\nJuror No. 4:\nFor example, at this moment in time, the judge has used his gavel eleven times in total... ...the prosecution has snorted derisively at your remarks seven times in total... ...and, I might add, each time you have gawped like a simpleton.\nRyunosuke:\n...Thank you. (And what's the point exactly?) So anyway, madam, are you able to explain why you think the defendant is guilty?\nJuror No. 4:\n......... That is a conclusion I have drawn as a result of the copious notes I have typed.\nRyunosuke:\nClearly! But I'm asking you to explain WHY you've drawn that conclusion!\nJuror No. 4:\nPlease don't distract me. It makes it extremely hard to concentrate on my note-keeping.\nRyunosuke:\n(This is going nowhere...)Juror No. 5:\nYou can trust the guild. Fair fares is our motto. We haven't raised prices above fourpence for years.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nThat's how much it costs to take the omnibus?\nJuror No. 5:\nThat's right. As the guildmaster, I decided to set a policy for all drivers across the city. One fare, no matter which bus you take or how far you're going. We have to compete with the rise of the motor car, you see. Us coachmen have to make a stand together!\nRyunosuke:\nMotor cars, you say?\nJuror No. 5:\nYes. And this murder on one of our buses is extremely damaging to our cause! It's beyond the pale! It'll lead to a decline in passengers, you mark my words! And it's all that rascal's fault! He has to pay!\nRyunosuke:\n(Is it the crime or his buses he's more worried about...?)\nJuror No. 5:\nAnyway, every member of my guild is reliable and trustworthy. So if the driver says he saw him do it, that fellow in the dock is as guilty as sin!Pit against Juror No. 2's statement (before Jurors No. 3 and 6 vote innocent)\n\n\n\n\n\n\n\nRyunosuke:\n \nRyunosuke:\nThose two statements clearly contradict each other!\nJudge:\nThey do? Explain yourself, Counsel!\nJuror No. 2:\nMe?! Oh dear, what have I said?\nJuror No. 5:\nI swear on Silver Blaze's mane and name, I haven't the first idea what you're talking about!\nRyunosuke:\nAccording to the group testimony we've heard so far... ...there were four passengers on the omnibus on the night in question. And according to the coachman, Mr Beppo, he took twenty pence in fares.\nJuror No. 4:\nQuite right. I have those precise details typed neatly here in front of me.\nRyunosuke:\nAnd juror number five also told us the following: The fare for the omnibus...is always fourpence.\nJuror No. 5:\nThat it is. A fair and convenient single price. Just the way London's carriages should be operated!\nRyunosuke:\nBut that doesn't add up at all. In fact, it leaves a glaring discrepancy in the facts.\nJuror No. 5:\nWhy, man, why?!\nRyunosuke:\nFour passengers paying fourpence each. If you do the multiplication...\nJuror No. 2:\nAh! It would be sixteen pence!\nRyunosuke:\nExactly. As I said, it doesn't add up. The figures are different. By fourpence, in fact. ...Or precisely one person's fare.\nJudge:\nOne person's fare?\nRyunosuke:\nYes! In other words, on the omnibus that night... ...it's distinctly possible...there was another passenger we've heard nothing about!\nJudge:\nGood gracious!\nJuror No. 5:\nThis, this can't be right! The coachmen of the guild are good, honest men, one and all! Trustworthiness is our watchword!\nJuror No. 4:\nThe figures your coachman claims most certainly do not add up. Your watchword, good sir, is a fallacy!\nJuror No. 5:\nI beg your pardon?!\nRyunosuke:\nMr Guildmaster, I think you ought to consider that if this trial were to end now... ...the news will surely spread all over London. The news that one of your coachmen tried to hide the fact that he lets nefarious characters ride his omnibus.\nJuror No. 5:\n...! Alright then, how do I make it so this miserable trial doesn't end, hm?\nSusato:\nWell, according to my book here... ...you simply launch a ball of fire onto the innocent side of the set of scales!\nJuror No. 1:\nNow hold your horses there, coachman! We were all in agreement! Why do you have to go and-\nJuror No. 5:\nWait till I get my hands on you, Beppo!!!\nJuror No. 1:\nArgh! This is all very irritating...\nJuror No. 2:\nBegging your pardon, sir, I'm going to do the same.\nJuror No. 1:\nFor the love of Mike! Not you as well?!\nJuror No. 2:\nA penny can be the difference between a smile and a tear, after all. I certainly can't put my trust in someone who doesn't follow my exacting standards in financial matters.\nJuror No. 1:\nOh really?\nJuror No. 2:\nI, for one, think it's only proper that we hear from the witnesses again.\nSusato:\nOh, well done, Mr Naruhodo! You did it! If we can manage to change two more jurors' minds... ...we can force the trial to continue!\nRyunosuke:\nTwo more... (Actually... ...there is something else that's bothering me about a couple of their assertions.)\nSusato:\nThen that's where you must strike next!\nRyunosuke:\n(So I need to pit two more jurors against each other and show there's another contradiction in their assertions.)\nSusato:\nExactly! You can do it!\nJudge:\nWell, the Scales of Justice have shifted, but they still weigh heavy on the side of guilt. Counsel, you have the floor again. Continue with your summation examination!\nChanges Juror No. 2's statement to \"I'm changing my leaning to innocent. I should like to hear what the slipshod bookkeeper has to say for himself!\" and Juror No. 5's statement to \"Grrr! Beppo! This trial has to continue so I can get to the bottom of this corruption! Not guilty, I say!\"Pit against Juror No. 2's statement (after Jurors No. 3 and 6 vote innocent)\n\n\n\n\n\n\n\nRyunosuke:\n \nRyunosuke:\nThose two statements clearly contradict each other!\nJudge:\nThey do? Explain yourself, Counsel!\nJuror No. 2:\nMe?! Oh dear, what have I said?\nJuror No. 5:\nI swear on Silver Blaze's mane and name, I haven't the first idea what you're talking about!\nRyunosuke:\nAccording to the group testimony we've heard so far... ...there were four passengers on the omnibus on the night in question. And according to the coachman, Mr Beppo, he took twenty pence in fares.\nJuror No. 4:\nQuite right. I have those precise details typed neatly here in front of me.\nRyunosuke:\nAnd juror number five also told us the following: The fare for the omnibus...is always fourpence.\nJuror No. 5:\nThat it is. A fair and convenient single price. Just the way London's carriages should be operated!\nRyunosuke:\nBut that doesn't add up at all. In fact, it leaves a glaring discrepancy in the facts.\nJuror No. 5:\nWhy, man, why?!\nRyunosuke:\nFour passengers paying fourpence each. If you do the multiplication...\nJuror No. 2:\nAh! It would be sixteen pence!\nRyunosuke:\nExactly. As I said, it doesn't add up. The figures are different. By fourpence, in fact. ...Or precisely one person's fare.\nJudge:\nOne person's fare?\nRyunosuke:\nYes! In other words, on the omnibus that night... ...it's distinctly possible...there was another passenger we've heard nothing about!\nJudge:\nGood gracious!\nJuror No. 5:\nThis, this can't be right! The coachmen of the guild are good, honest men, one and all! Trustworthiness is our watchword!\nJuror No. 4:\nThe figures your coachman claims most certainly do not add up. Your watchword, good sir, is a fallacy!\nJuror No. 5:\nI beg your pardon?!\nRyunosuke:\nMr Guildmaster, I think you ought to consider that if this trial were to end now... ...the news will surely spread all over London. The news that one of your coachmen tried to hide the fact that he lets nefarious characters ride his omnibus.\nJuror No. 5:\n...! Alright then, how do I make it so this miserable trial doesn't end, hm?\nSusato:\nWell, according to my book here... ...you simply launch a ball of fire onto the innocent side of the set of scales!\nJuror No. 1:\nNow hold your horses there, coachman! We were all in agreement! Why do you have to go and-\nJuror No. 5:\nWait till I get my hands on you, Beppo!!!\nJuror No. 1:\nArgh! This is all very irritating...\nJuror No. 2:\nBegging your pardon, sir, I'm going to do the same.\nJuror No. 1:\nFor the love of Mike! Not you as well?!\nJuror No. 2:\nA penny can be the difference between a smile and a tear, after all. I certainly can't put my trust in someone who doesn't follow my exacting standards in financial matters.\nJuror No. 1:\nOh really?\nJuror No. 2:\nI, for one, think it's only proper that we hear from the witnesses again.\nLeads to:\n\"...Wait! That, that means...\"Juror No. 5:\nGrrr! Beppo! This trial has to continue so I can get to the bottom of this corruption! Not guilty, I say!Juror No. 6:\nThe scoundrel, stabbing that poor man on the floor! It beggars belief!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nI, I really think you should stop waving that needle around...\nJuror No. 6:\nYou heard what the good coachmen said before, didn't you? That hideous man stabbed the poor fellow! Just like this!\nRyunosuke:\nY-Yes... That is what he said, you're right.\nJuror No. 6:\n......... McGilded Park is such a lovely little place, too. I've always enjoyed resting my legs there while I get on with my knitting. And I had thought that anyone who donated such a delightful place must be a fine fellow indeed. I suppose I was wrong. ......... Whoever would have thought he was a miserable, murdering moneylender with not a scrap of remorse?!\nRyunosuke:\n(Oh help... She's as sure as sure can be that he's guilty now...)\nSusato:\nThe old lady certainly seems to know her mind, doesn't she?Pit against Juror No. 3's statement\n\n\n\n\n\n\n\nRyunosuke:\n \nRyunosuke:\nThose two statements are completely contradictory!\nJudge:\nWhaaat?! Explain, Counsel, post-haste!\nJuror No. 6:\nOh dearie me! I, I was only knitting a jumper for my other half!\nJuror No. 3:\nWhat is all this claptrap? What does 'contradictory' even mean, I ask you?\nRyunosuke:\nWe've heard from more than one witness... ...that they allegedly saw the actual moment when the defendant stabbed the victim. Now, out of curiosity, juror number three...\nJuror No. 3:\nWhat?! Can't you see that I'm busy here?\nRyunosuke:\n...How would you say the defendant stabbed the victim? What sort of motion was it?\nJuror No. 3:\nHa! Want to test me, do you? It was like this! Stuck the fellow next to him without even getting up! Just like the prim banker said.\nJudge:\nYes, that was Mr Fairplay's testimony. Quite true.\nRyunosuke:\nNow then, juror number six...\nJuror No. 6:\n...Oh! Is that me, is it? What can I do for you, young man?\nRyunosuke:\nHow would you say the defendant stabbed the victim, madam?\nJuror No. 6:\nOh, well dear, as far as I understand it... ...it was like this! He stabbed the poor man after he'd collapsed on the floor! ...The coachman said so.\nRyunosuke:\nNow don't move! Take a look at these two jurors! 'He stuck the fellow next to him without even getting up!' And 'He stabbed the poor man after he'd collapsed on the floor!'\nJudge:\nWell I never! They're... They're stabbing in totally different directions!\nJuror No. 3:\nWhat?!\nJuror No. 6:\nBless my stitches! What a muddle!\nRyunosuke:\nWhat this tells us... ...is that there's a strong possibility one of the witnesses isn't telling the truth!\nJuror No. 6:\nOh!\nJuror No. 3:\nBut why?! Why the dickens would they lie?\nRyunosuke:\nI don't know that yet. But what I do know... ...is that if the trial ends at this point, we may never find out! We may never know the real truth! Ladies and gentlemen of the jury! Can you really let that happen, in all good conscience?\nJuror No. 6:\nLies, you say? Oh dearie me... I can't abide people telling lies!\nJuror No. 2:\nThe, the scales...\nJuror No. 5:\nI don't believe it!\nJuror No. 1:\n\nJuror No. 1:\nWaaaaaait! Now hear this, my fellow jurors: I warn you, you cannot listen to this man! Look at him, in his black suit! He's...he's...clearly some devious Eastern sorcerer using magic on us all!\nRyunosuke:\n(If I could use magic, do you really think I'd be putting myself through all this?)\nJuror No. 1:\nAnswer me this, Dark Jinx!\nRyunosuke:\nHuh?! M-Me?\nJuror No. 1:\nWhat exactly is the problem? What of it if two witnesses have slightly different recollections of events?\nRyunosuke:\nWhat of it?\nJuror No. 1:\nLet's say the shylock did stab the victim as he was sat next to him on the omnibus. And this young dandy saw him do it! And now let's say the victim collapsed on the floor, and then the shylock stabbed him again! And this old lady saw him do it! Well? What's to say it didn't happen like that, hm?\nJuror No. 3:\nWho are you calling a dandy, sir?! Why, I should take this knife to you!\nJuror No. 6:\nWho are you calling old?! Why, I should take this needle to you!\nRyunosuke:\n(Ugh...they're ready to kill each other now... But could the foreman of the jury be right? Did the two witnesses see two different moments of the same crime?) \n\n\n\nIt's possible\n\n\n\n\n\n\n\nRyunosuke:\nHm, it's true... There's an outside chance of almost anything you care to mention.\nJuror No. 1:\nEeexactly the point I've been trying to make!\nSusato:\nBefore you go any further, Mr Naruhodo...\nRyunosuke:\nOh! What is it, Miss Susato?\nSusato:\n...I think you should have a look through the Court Record.\nRyunosuke:\n......... Ah!\nSusato:\nYou see? This evidence makes it quite clear. There isn't even an outside chance of what the juror is saying!\nRyunosuke:\n(How did I miss that...?)\nLeads to:\n\"Unfortunately, Mr Foreman...\"\n\n\n\n\nIt's out of the question\n\n\n\n\n\n\n\nLeads to:\n\"Unfortunately, Mr Foreman...\"\n\n\nRyunosuke:\nUnfortunately, Mr Foreman...\nJuror No. 1:\nHm? What is it, you dark jinx? Come on, out with it!\nRyunosuke:\n...What you're suggesting is impossible! It's out of the question!\nJuror No. 2:\n...!\nJuror No. 4:\n...!\nJuror No. 6:\n...!\nJuror No. 1:\nWhat, what are you talking about, man? How can you possibly say that? You, you do realise that I'm...I'm only doing my job! As foreman of the jury, I have a responsibility to steer everyone in the right direction. So where's your evidence, man? That's what we want to see! I say the two witnesses saw two different moments of the same crime. If you say that's out of the question, show me some proof!\nRyunosuke:\n......... (It looks like the only way I'm going to convince him is to present him with something he can't dismiss. Some irrefutable hard evidence!) As you wish.\nJuror No. 1:\nWhat?\nRyunosuke:\nI'll give you the proof. It's out of the question that the two witnesses saw two different moments of the same crime...as proven by... \n\n\n\nPresent Autopsy Report (before Jurors No. 2 and 5 vote innocent)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nThis is the victim's autopsy report. According to what's written here, Mr Mason was stabbed in the abdomen... ...only once.\nJuror No. 1:\nEh?! Only once?!\nRyunosuke:\nIt's quite simple! The victim was stabbed precisely one time. Which means these witnesses can't possibly have seen it happen two different times!\nJuror No. 3:\nHuuurgh...grrr...hyuuurgh... Alright...I concede defeat!\nSusato:\nOh, well done, Mr Naruhodo! You did it! If we can manage to change two more jurors' minds... ...we can force the trial to continue!\nRyunosuke:\nTwo more... (Actually... ...there is something else that's bothering me about a couple of their assertions.)\nSusato:\nThen that's where you must strike next!\nRyunosuke:\n(So I need to pit two more jurors against each other and show there's another contradiction in their assertions.)\nSusato:\nExactly! You can do it!\nJudge:\nWell, the Scales of Justice have shifted, but they still weigh heavy on the side of guilt. Counsel, you have the floor again. Continue with your summation examination!\nChanges Juror No. 3's statement to \"I'm no lover of the rich, but I despise liars even more! Innocent is my call, for now at least!\" and Juror No. 6's statement to \"Dear me, you can't make accusations based on lies! I wonder if the poor man is innocent after all...\"'\n\n\n\n\nPresent Autopsy Report (after Jurors No. 2 and 5 vote innocent)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nThis is the victim's autopsy report. According to what's written here, Mr Mason was stabbed in the abdomen... ...only once.\nJuror No. 1:\nEh?! Only once?!\nRyunosuke:\nIt's quite simple! The victim was stabbed precisely one time. Which means these witnesses can't possibly have seen it happen two different times!\nJuror No. 3:\nHuuurgh...grrr...hyuuurgh... Alright...I concede defeat!\nLeads to:\n\"...Wait! That, that means...\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\n...this clear piece of evidence! Well, Mr Foreman?\nJuror No. 1:\n......... Do you know what they say about me, young man? They say I've got no powers of persuasion.\nRyunosuke:\nOh, I see... Erm... I'm sorry to hear that...?\nJuror No. 1:\nBut no one will need persuading about this: You're even worse than me!\nRyunosuke:\nAaagh! (Two different moments... In other words, the victim was stabbed two times... Ah! But we have evidence that clearly contradicts that possibility!) If you'll allow me another chance...I'd like to present you with one more piece of evidence to consider.\nLeads back to:\n\"It's out of the question that the two witnesses saw two different moments of the same crime...as proven by...\"Juror No. 6:\nDear me, you can't make accusations based on lies! I wonder if the poor man is innocent after all...First time\n\n\n\n\n\n\n\nSusato:\n'Hm... So...we just need to find two jurors with contradictory statements and pit them against each other. ...Which is so much easier said than done!' Is that perhaps what were just thinking?\nRyunosuke:\nHow did you know?!\nSusato:\nWell, I took the liberty of doing some research, in case you happened to find yourself in just such a situation. Shall I read you what I found out? It is a little long, I'm afraid... \n\n\n\nNot right now\n\n\n\n\n\n\n\nSusato:\n'...If I have to rely on advice right from the start, how will I get on later? No, I need to work this out for myself now!' ...Is that perhaps what you were just thinking?\nRyunosuke:\nHow did you know?!\nSusato:\nWell, that sort of attitude...is most admirable, Mr Naruhodo!\nRyunosuke:\n(I know what I have to do. Let's listen to those assertions one more time...)\n\n\n\n\nPlease go ahead\n\n\n\n\n\n\n\nSusato:\nVery well. Listen to this... During the summation examination, you will hear the assertions of the six members of the jury. In this situation, the counsel for the defence should use [X / Y / R] and 'Pit' with impunity! Having done so, you will be able to compare the chosen assertion with those of the other jurors. Select the corresponding buttons to listen to the other jurors' assertions again. Note that you cannot choose the assertion of the juror you initially selected... ...nor can you choose assertions of jurors who have changed their leaning to 'not guilty' already. Once you've compared the various jurors' assertions... ...work out which two contradict each other, and then 'Pit' them together with [X / Y / R] to pull them apart!\nRyunosuke:\nI see... (She wasn't joking when she said it was long.)\nSusato:\nThe first step is to listen very carefully to what each individual juror has to say. Then I'm sure you'll start to see which ones might not quite agree with each other.\nRyunosuke:\nAlright then... (Let's get this right now, so I never have to listen to that long and boring explanation again!)\nSusato:\nThat's the spirit!Subsequent times\n\n\n\n\n\n\n\nSusato:\nWhat do you think, Mr Naruhodo? I took the liberty of doing some research to help us navigate a situation such as this... \n\n\n\nNot right now\n\n\n\n\n\n\n\nSusato:\n'...If I have to rely on advice right from the start, how will I get on later? No, I need to work this out for myself now!' ...Is that perhaps what you were just thinking?\nRyunosuke:\nHow did you know?!\nSusato:\nWell, that sort of attitude...is most admirable, Mr Naruhodo!\nRyunosuke:\n(I know what I have to do. Let's listen to those assertions one more time...)\n\n\n\n\nPlease go ahead\n\n\n\n\n\n\n\nSusato:\nVery well. Listen to this... During the summation examination, you will hear the assertions of the six members of the jury. In this situation, the counsel for the defence should use [X / Y / R] and 'Pit' with impunity! Having done so, you will be able to compare the chosen assertion with those of the other jurors. Select the corresponding buttons to listen to the other jurors' assertions again. Note that you cannot choose the assertion of the juror you initially selected... ...nor can you choose assertions of jurors who have changed their leaning to 'not guilty' already. Once you've compared the various jurors' assertions... ...work out which two contradict each other, and then 'Pit' them together with [X / Y / R] to pull them apart!\nRyunosuke:\nI see... (She wasn't joking when she said it was long.)\nSusato:\nThe first step is to listen very carefully to what each individual juror has to say. Then I'm sure you'll start to see which ones might not quite agree with each other.\nRyunosuke:\nAlright then... (Let's get this right now, so I never have to listen to that long and boring explanation again!)\nSusato:\nThat's the spirit!Ryunosuke:\n(...Wait! That, that means... ...four jurors are now leaning to not guilty!)Susato:\nWe've done it, Mr Naruhodo! We've won!Juror No. 1:\nWhat are you playing at, you dandy fool?!Juror No. 3:\nShut your trap, sir! No one deceives me!Juror No. 1:\nBut we had a consensus!Juror No. 3:\nI said shut your trap! I know a liar when I see one! And if the chap ever dares to cross the threshold of my shop... ...I'll take this razor-sharp blade...and shave every last hair off his head!Ryunosuke:\n(Please tell me he's a barber...)Judge:\nWell! In a quite remarkable turn of events... ...the defence's summation examination has flipped the balance of the Scales of Justice! The jurors now stand at two for guilty...and four for not guilty! Accordingly, there is no longer a large enough majority among the jury for me to adjudicate... ...and the trial must continue! I hereby ask the defence, prosecution and witnesses to return to their places. And I call upon all of you to continue to pursue the truth!Judge:\nSo...Lord Van Zieks. Continue to substantiate the case for the prosecution, if you please.Van Zieks:\nHaving savoured the rich aroma of the carmine contents of this hallowed chalice... ...it may seem crass to crush it to dust. ...Pray forgive the discourtesy.Judge:\nL-Lord van Zieks!Ryunosuke:\n(Brrr... Is it cold in here, or is it just me?)Van Zieks:\nAs your antiquated tome no doubt says, the prosecution may not speak during a summation examination. So I honoured a deathly silence...and listened to the charade. It seems I overestimated the intelligence of the jury.Juror No. 1:\n...!Juror No. 2:\n...!Juror No. 3:\n...!Van Zieks:\n...Well, no matter. There is nothing so hard to prove as a self-evident truth, it would seem. No... And why else would we grace the courtroom with our presence after all? So, let us proceed to the next round of battle. Bring forth the witnesses once more!Van Zieks:\nWitnesses! I trust you heard the summation examination we have just had to...endure?Beppo:\nOh, y-yes, sir, that I did, sir.Fairplay:\nOf course I heard it!Furst:\nOh yes, sir. I heard it.Judge:\nYou, sir, on the end... The coachman. I believe it's 'Beppo'?Beppo:\nY-Yes, sir, My Lord, sir?Judge:\nIf it transpires that in your previous testimony... ...you were attempting to veil the presence of a fifth passenger on your omnibus... ...you will be found guilty of perjury! You are advised to bear that in mind, sir.Beppo:\nUhhh... Oh mio Dio... Uhhh...Judge:\nNow then, witnesses. I hereby call on you to testify before the court again. You will explain the various misgivings brought to our attention by the defence's summation examination!Witness Testimony\n- Various Misgivings -Beppo:\nI, I only c-carried f-four passengers that night! I swear it! ...B-B-But, um...Fairplay:\nWell, I for one was told I had to pay fivepence for the bus.Furst:\nHe fiddled us on the fare, he did! And then I saw that blood-curdling sight as well... It's all too much!Fairplay:\nI tell you, I saw McGilded stabbing that man! Everything I said before stands!Beppo:\nOh yes... Yes, he s-s-stabbed him. Yes he did. ...I, I think so, yes.Judge:\nCounsel, make sense of this for me, please.Van Zieks:\nThe phantom fifth passenger conjured into existence by my learned Eastern friend never existed. The confusion has arisen from the coachman's sly little... cozenage.Beppo:\nUhhh...Juror No. 5:\nBeppo! Explain yourself!Beppo:\nI'm t-terribly sorry, G-G-Guildmaster!Juror No. 5:\nThe guild's fare is fourpence across the board! You know that! Am I to understand that you've been overcharging our passengers by a penny a fare?Beppo:\nIt's, it's so c-c-cold... And the last r-run of the day is always h-h-half empty...Judge:\n......... You have been dishonest, coachman.Beppo:\nUhhh... I'm s-sorry...Juror No. 5:\nYou're a disgrace, Beppo! A disgrace! And your selfish actions have brought dishonour on the entire guild!Furst:\nIf I may, sir...? I had to pay tenpence on the bus just last week.Juror No. 5:\nWHAAAAAAT?Susato:\nFour passengers at fivepence each is... Yes, twenty pence. I've done the arithmetic ten times already, but I just can't make the result come out differently!Ryunosuke:\n...No, that...figures.Judge:\nWell, it would appear that one of the aforementioned misgivings has already been explained. So, Counsel for the Defense... Your cross-examination, if you please.Van Zieks:\nWe've already had the pleasure of a protracted summation examination today. I see you intend to continue the parlour games.Ryunosuke:\n......... ...Absolutely!Cross-Examination\n- Various Misgivings -",
      "testimonies": [
        {
          "testimony": "I, I only c-carried f-four passengers that night! I swear it! ...B-B-But, um...",
          "person": "Beppo",
          "present": []
        },
        {
          "testimony": "Well, I for one was told I had to pay fivepence for the bus.",
          "person": "Fairplay",
          "present": []
        },
        {
          "testimony": "He fiddled us on the fare, he did! And then I saw that blood-curdling sight as well... It's all too much!",
          "person": "Furst",
          "present": []
        },
        {
          "testimony": "I tell you, I saw McGilded stabbing that man! Everything I said before stands!",
          "person": "Fairplay",
          "present": []
        },
        {
          "testimony": "Oh yes... Yes, he s-s-stabbed him. Yes he did. ...I, I think so, yes.",
          "person": "Beppo",
          "present": []
        },
        {
          "testimony": "D'you think I'd forget the sight of those blood-soaked hands after that butcher stabbed the man?!",
          "person": "Fairplay",
          "present": [
            "Defendant's Leather Gloves"
          ],
          "source": {
            "evidence_span": "The leather gloves the defendant was wearing at the time of the incident. There is a bloodstain on the right glove.",
            "testimony_span": "D'you think I'd forget the sight of those blood-soaked hands after that butcher stabbed the man?!",
            "explanation": "If McGilded stabs the victim with gloves on, the witness cannot see the blood-soaked hands.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Furst, Fairplay, and Beppo are testifying about what they saw on the omnibus when the murder happened.",
      "labels": [
        "physical"
      ],
      "reasoning": [
        "Fact 1: The witness claims he saw the blood-soaked hands of McGilded.",
        "Fact 2: The evidence suggests McGilded is wearing a pair of gloves when the incident happens.",
        "Prop 1: If one is wearing a pair of gloves, then the others cannot see his or her bare hand"
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "Beppo:\nI, I only c-carried f-four passengers that night! I swear it! ...B-B-But, um...Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nSo, there were only four passengers on your carriage, but you didn't charge them the standard fourpence fare. Is that right?\nBeppo:\n......... It's, it's imp-p-possible to make the last run of the day p-p-pay! I was so c-c-cold, it was all I could d-do to stop myself p-p-passing out!\nRyunosuke:\n...I'm getting chilblains just listening to you.\nBeppo:\nIt was t-t-terrible! So I wanted to give myself a p-p-pat on the back for even keeping the b-bus running! Doesn't a d-dedicated coachman d-deserve an extra p-p-penny per p-p-p-p-passenger?\nRyunosuke:\n...You're digging a deeper hole for yourself here... (If only there had been a fifth passenger on the omnibus that night... Then we would have had another suspect.)\nVan Zieks:\n.........Fairplay:\nWell, I for one was told I had to pay fivepence for the bus.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nDoes that mean everyone on board that night paid fivepence instead of four?\nFurst:\nWell, I paid fivepence, too, sir.\nFairplay:\nAnd I just told you that I did.\nBeppo:\nA flat f-fare of fivepence across the b-b-board!\nRyunosuke:\n(It's not something to be proud of...)\nVan Zieks:\nThe so-called discrepancy my learned friend identified was nothing of the sort. Much like the phantom killer you so desperately needed, it's gone. Dead...and buried...\nRyunosuke:\n(I'd have been happy if it had ever existed in the first place...)Furst:\nHe fiddled us on the fare, he did! And then I saw that blood-curdling sight as well... It's all too much!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nThis 'blood-curdling' sight... You mean the murder, I presume?\nFurst:\nYes, sir!\nJudge:\nA loathsome sight. No one should have to witness the horror in the eyes of a man the moment his life is taken.\nFurst:\nOh, well...not exactly, sir. I mean, I didn't actually see the exact moment the gent was stabbed.\nJudge:\nGood gracious! Really?\nVan Zieks:\nWe have another witness who did, however. The banker has already testified to it.\nRyunosuke:\n(Hm, but Mr Furst didn't actually see the point at which the victim was killed. That may turn out to be very significant...)\nFurst:\nI heard the banker gent next to me take a sharp intake of breath, see. That's when I looked through the glass. That's, that's when I saw that horrible blade poking out from his belly, all covered in blood! Every time I see a knife now, I can't help screaming. Even when I'm eating...Fairplay:\nI tell you, I saw McGilded stabbing that man! Everything I said before stands!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nSo you saw the defendant, Mr McGilded, stabbing the victim, Mr Mason, who was sitting next to him?\nFairplay:\n...That's, that's what I said, isn't it?\nRyunosuke:\n(It was bothering me before, this was. For just a brief moment, he hesitated before answering the question.)\nFairplay:\nAnyway, there was only the two of them inside the carriage, wasn't there?\nVan Zieks:\n...There's been much talk of a fifth passenger. But as yet...zero evidence.\nFairplay:\nThen what are we wasting all this time for, eh? It's black and white! The man's guilty!\nRyunosuke:\n......... (Something about Mr Fairplay's testimony just...jars with me... I wish I could work out what it was...)Beppo:\nOh yes... Yes, he s-s-stabbed him. Yes he did. ...I, I think so, yes.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nEarlier, you testified that you saw the moment when the defendant allegedly stabbed the victim, didn't you?\nBeppo:\nOh, yes. Yes, that's right.\nRyunosuke:\nYou said that the victim was on the floor, and described the assailant holding the knife in an ice pick grip.\nBeppo:\n......... I, I suppose... ...I m-might have...you know. Yes... P-P-Put the c-cart before the horse, maybe...\nJudge:\nWhat's this?\nBeppo:\nWell, I'm q-quite sure about m-most of it... I was d-driving the horses when I heard a scream f-f-from the seats on the roof deck.\nFurst:\nOh! I expect that was me, sir.\nBeppo:\nThen when I t-t-turned around...yes. Yes, I s-saw it through the skylight. The g-gentleman was on the floor, and the knife was s-sticking up out of his m-m-midriff. That's right, yes. And the f-f-fellow holding the h-handle was the f-famous man. Yes.\nRyunosuke:\nSo, in short... ...you didn't see the moment when the victim was actually stabbed at all?\nBeppo:\n......... ...I, I r-really thought that I did, b-b-but... ...but when I g-go over it again in my head... ...no. I, I suppose I d-didn't actually see the p-precise moment of the s-stabbing, did I?\n\n\n\nPursue Bruce Fairplay\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nDo you have something to say about that, Mr Fairplay?\nFairplay:\nNow you listen to me! I know what you're thinking! 'He didn't really see the exact moment the fellow was stabbed! What are the chances of that?' ...Eh?\nRyunosuke:\n...Are you asking me or telling me? (He's getting flustered. I might be able to extract some new information from him if I answer him cleverly... Could he have just happened to see the exact moment the crime was committed?)\n\n\n\nNo chance!\n\n\n\n\n\n\n\nRyunosuke:\nWell, it is a little hard to believe, certainly. Unless you spend your time peeping through a skylight on the top of an omnibus, that is.\nLeads to:\n\"Peeping?!\"\n\n\n\n\nSome days are like that\n\n\n\n\n\n\n\nRyunosuke:\nWell, I suppose some days are like that. Sooner or later you'll see something you wish you hadn't... ...if you're always peeping through a skylight on the top of an omnibus.\nLeads to:\n\"Peeping?!\"\n\n\nFairplay:\nPeeping?! I'm a, a respectable city banker, I'll have you know! And I know what I saw! I remember it as clear as a Ballarat day! It was a grim scene, I don't mind telling you...\nJudge:\nThank you, Mr Fairplay.\nFairplay:\nOh! Excuse me if I was getting a little hot under the collar there, My Lord.\nJudge:\nI would ask you to supplement your testimony with a clear statement about what exactly you saw.\nFairplay:\nOh, I can do that alright. I'll tell you just how grim it was!\nAdds statement \"D'you think I'd forget the sight of those blood-soaked hands after that butcher stabbed the man?!\"\n\n\nBeppo:\nIn, in fact, now that I c-c-come to think of it... ...it, it m-m-must've already happened when I heard the scream...\nJuror No. 1:\nAh!\nJuror No. 3:\nOf course!\nJuror No. 5:\nThat goes without saying!\nRyunosuke:\n(But I really wish he had said it earlier...)\nVan Zieks:\nThe autopsy report makes it quite clear that the victim was stabbed only once. Which means... ...the banker was witness to the fatal wound that ended Mr Mason's life.\nJudge:\nHm...Fairplay:\nD'you think I'd forget the sight of those blood-soaked hands after that butcher stabbed the man?!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nBlood-soaked?!\nFairplay:\nAhem! Well, perhaps 'soaked' is laying it on a little thick, but... But anyway! There was definitely blood all over them. Both of them were covered in it!\nRyunosuke:\nAnd you saw that from the roof? Through the skylight?\nFairplay:\nWell, the skylight's reasonably large, so I had a pretty good view. And there was a lamp on inside the carriage as well. So I'm quite sure of what I saw!\nRyunosuke:\n(Hm...this banker's latest statement... I feel sure there's something not quite right about it.)\nSusato:\nWhen you feel something doesn't add up, Mr Naruhodo... ...that's when you should have a good look through the Court Record!Present Defendant's Leather Gloves\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"Blood-soaked...hands?\"Ryunosuke:\n(Not long ago, this trial very nearly came to an end. Somehow, we've managed to keep our chances alive here. I can't waste this cross-examination! I have to use it to bring some new facts to light!)Susato:\nHm, if you're not careful when you press these witnesses... ...the danger is that the jury will end up believing something...unhelpful, as they did before.Ryunosuke:\nMaybe. ...But we can't let the fear of that happening stop us from uncovering important new information.Susato:\n...! Yes, you're so right.Ryunosuke:\n(I need to pay careful attention here. I don't want to miss even a flicker of a reaction among these witnesses!)Susato:\nRemember, if you happen to spot one of the witnesses reacting in a strange way... ...don't hesitate to pursue them as to the reason!Ryunosuke:\nBlood-soaked...hands?Fairplay:\nWell, I admit that 'soaked' might be laying it on a little thick, but... But anyway! There was definitely blood all over them. Both of them were covered in it!Ryunosuke:\nWell, I'm very sorry to disagree, Mr Fairplay, but that's more than a little peculiar.Fairplay:\nWhat?Ryunosuke:\nHere are the gloves worn by the defendant, Mr McGilded, on the night in question.Fairplay:\nOh...yes...right...Ryunosuke:\nAnd there certainly does appear to be a sizeable dark-coloured stain there. But, as I'm sure you can clearly see... ...it's only on the right-hand glove.Fairplay:\nArrrrgh!Ryunosuke:\nIn short, Mr Fairplay... ...your testimony is inconsistent!Fairplay:\nGyaaagh! But, but...no! That can't be right!Juror No. 6:\nSo you're the liar here then!Fairplay:\nGargh!Juror No. 3:\nThat's right! You were quite clear about it. You said - Hyuurgh! - it was both hands!Fairplay:\nGrrr...Ryunosuke:\nMr Fairplay. If your last statement was a lie... ...it calls your entire testimony into question. You say you saw the moment the victim was stabbed. ...But is that really the truth?!Fairplay:\nArgh! I...well... I...Van Zieks:Van Zieks:\nIt was a simple mistake. You can't justify accusing this man of lying! Yes, it wasn't both hands; it was only one. But the fact remains... ...the victim's blood was on the accused!Ryunosuke:Ryunosuke:\nNo! Mr Fairplay categorically stated that he saw blood 'all over both hands'! Which means there's a strong possibility that this witness was deliberately trying to mislead the court!Fairplay:\nGaaargh! Why? Why?! I'm a city banker, for pity's sake! My word should be...the gold standard! I'm a gentleman, not some guttersnipe! Upstanding members of society don't prevaricate!Ryunosuke:\n(He's claiming to have no reason to lie... But is that really the case?)Susato:\nMr Naruhodo! If we had some evidence to explain why Mr Fairplay might be lying... ...it could turn the tide in this trial completely!Ryunosuke:\n(Something to show this man has a compelling reason to lie in his testimony...)There's no evidence\n\n\n\n\n\n\n\nRyunosuke:\nYes. ...If only we had some evidence like that.\nJudge:\nHmph. So the defence has nothing?\nFairplay:\nWhew...\nSusato:\nAh! Mr Naruhodo! Did you see that?\nRyunosuke:\nYes... He let out an audible sigh of relief. (Does that mean there IS some evidence that would show why he might lie?)\nSusato:\nI think perhaps...we should consult the Court Record again. From Mr Fairplay's reaction, I wonder if there's some evidence we haven't properly examined yet.\nRyunosuke:\n(Yes, we ought to look at everything in as much detail as possible!) My Lord!\nJudge:\nYes, Counsel?\nRyunosuke:\nThe defence is ready to present evidence! Evidence that will clearly demonstrate why Mr Fairplay had reason to lie in his testimony!\nJudge:\nI'm afraid, Counsel... ...that before I can allow that to happen, I shall have to penalise you for that reckless about-turn.\nRyunosuke:\nUgh... (I suppose that's fair play...)\nLeads to:\n\"...Very well.\"I have evidence\n\n\n\n\n\n\n\nRyunosuke:\nMy Lord!\nJudge:\nYes, Counsel?\nRyunosuke:\nThe defence is ready to present evidence!\nJudge:\nBy Jove! Are you sure?\nRyunosuke:\nYes. Evidence that will clearly demonstrate why Mr Fairplay had reason to lie in his testimony!\nFairplay:\nGAAARGH!!!\nLeads to:\n\"...Very well.\"Judge:\n...Very well. I hereby call on the defence to present its evidence. The evidence that demonstrates a motive for the witness's alleged deception of the court!Present Debtors' Ledger (after examining writing)\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"This is a list of the debtors who owe money to Mr McGilded.\"Present anything else\n\n\n\n\n\n\n\nRyunosuke:\n\nJudge:\nYes... I believe this evidence does indeed demonstrate a deception of sorts. The deception by the defence that it is in any way competent.\nRyunosuke:\nAh...\nVan Zieks:\nA deception that won't pass muster in a British court of law, my...unlearned friend. Here's to that message being carved into your mind.\nRyunosuke:\nUwaaaaaagh!\nSusato:\nMr Naruhodo... I wonder if perhaps there are some details we've overlooked in the Court Record. Do you think it might be wise to check over all the evidence again?\nRyunosuke:\n(Yes, it looks like I need to thoroughly examine every piece of evidence we have...)\nLeads back to:\n\"...Very well.\"Ryunosuke:\nThis is a list of the debtors who owe money to Mr McGilded.Van Zieks:\n...Yes, a list of innocent victims, crippled by the accused's extortion.Ryunosuke:\nThe point is, among the names of these debtors is your name... ...Mr Bruce Fairplay.Fairplay:\n...!Judge:\nWhat?! Mr Fairplay! Are you currently indebted financially to the accused?Fairplay:\nArrrgh! No! Well...it's, it's barely worthy of being called a debt...Ryunosuke:\nAccording to this ledger, you owe twenty guineas. Not an inconsiderable sum of money, wouldn't you say?Fairplay:\nArgh! Well, well what of it?!Ryunosuke:\nLet's suppose Mr McGilded were to be found guilty of murder... What would become of your debt in that case?Judge:\nHm, these documents state that the loan agreement is forged between two individual parties. Therefore, were the creditor - the defendant here - to be sentenced to a capital punishment... ...all outstanding debts which were owed to him would be annulled. They would cease to exist.Susato:\nCease to exist?!Ryunosuke:\nMr Fairplay! Is it not the case that you claimed in your testimony to have seen something you never in fact saw... ...in a devious attempt...to annul your debt of twenty guineas to the defendant!Fairplay:\nGugh... GAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAARGH!Judge:\nOrdaaar! Ordaaar! Ordaaaaaar!!! ...Mr Bruce Fairplay!Fairplay:\nY-Yes, My Laaarghd?Judge:\nLet me ask you again. And be aware that your answer may have most serious implications upon your future, sir.Fairplay:\nGrrr...Judge:\nDid you or did you not... ...see the precise moment in time at which the defendant is alleged to have thrust a knife into the victim?Fairplay:\n......... .........Ryunosuke:\nYour silence speaks volumes! You did NOT tell the truth in your testimony!Fairplay:\nAlright! Now let's not make a melodrama out of this. Perhaps I did...overstate the truth a pinch.Ryunosuke:\nA pinch?Fairplay:\nBut it makes no difference! I definitely remember seeing blood on McGilded's hands! Both of them!Ryunosuke:Ryunosuke:\nAnd yet! Only one of the defendant's gloves, which we have here as evidence, is stained!Fairplay:\nGrrr... So you keep saying!Furst:\n......... I, I wonder if I might be allowed to speak, sir?Judge:\nGo ahead, Mr Furst.Furst:\nWell, the thing is...I think I remember seeing it myself, as it happens.Ryunosuke:\nSeeing what?Furst:\nThe blood, sir. On the assailant's hands. I think... Yes, I'm, I'm almost sure that it was on both of his hands, not just one.Ryunosuke:\nWha...? WHAAAT?!Judge:\nHmph. It would appear that we're going to need further testimony from all you witnesses. This time, I would like to know precisely what you DID and what you did NOT see! ...Do I make myself perfectly clear?Fairplay:\nY-Yaaarghsss...Susato:\nMr Naruhodo! This is good news! The course of the trial seems to have shifted slightly at last!Ryunosuke:\nYes! (I might finally have a chance to turn things around here...)Witness Testimony\n- What the Witnesses Really Saw -Fairplay:\nThere was blood on both hands of the assailant. I sincerely and distinctly remember that!\nHowever...I, I suppose you might say that I didn't see the exact moment the stabbing transpired...if that matters.Furst:\nI remember seeing the knife. And, and I remember seeing both of the attacker's hands with blood on them.Beppo:\nI, I d-didn't actually s-see anything myself. No. N-Not until I h-heard that scream.Fairplay:\nAnyway, the fact remains! There can't have been anyone else inside that carriage, or we all would have seen!Judge:\nWell, lo and behold... ...in truth of fact, not one of you was witness to the crucial moment the crime was perpetrated!Fairplay:\nI, I apologise, My Lord! But... But honestly... Argh! There was no one else inside that carriage, and the man's hands were covered in blood! Grrr... That much incriminating evidence is tantamount to saying we saw the man do it!Ryunosuke:\nThat's...really not what testimony is about.Van Zieks:\n...Let us examine the interior of the omnibus once more. The victim's fresh blood is clearly visible on the seat, corroborating the witnesses' accounts. In other words, there is no substantial - nor significant - change in the facts of the case.Judge:\nHm... Very well. Your cross-examination, please, Counsel.Ryunosuke:\nYes, My Lord!Cross-Examination\n- What the Witnesses Really Saw -",
      "testimonies": [
        {
          "testimony": "There was blood on both hands of the assailant. I sincerely and distinctly remember that!",
          "person": "Fairplay",
          "present": []
        },
        {
          "testimony": "However...I, I suppose you might say that I didn't see the exact moment the stabbing transpired...if that matters.",
          "person": "Fairplay",
          "present": []
        },
        {
          "testimony": "I remember seeing the knife. And, and I remember seeing both of the attacker's hands with blood on them.",
          "person": "Furst",
          "present": []
        },
        {
          "testimony": "I, I d-didn't actually s-see anything myself. No. N-Not until I h-heard that scream.",
          "person": "Beppo",
          "present": []
        },
        {
          "testimony": "Anyway, the fact remains! There can't have been anyone else inside that carriage, or we all would have seen!",
          "person": "Fairplay",
          "present": [
            "Omnibus"
          ],
          "source": {
            "evidence_span": "The eight-seater omnibus that was the scene of the crime. There were passengers both inside the carriage and on the roof deck that night.",
            "testimony_span": "There can't have been anyone else inside that carriage, or we all would have seen!",
            "explanation": "If there is a storage space in the seat of the omnibus that can fit a person, there can be a person that the passenger on the roof deck cannot see.",
            "is_self_contained": "no",
            "context_span": "Handle under seat Ryunosuke: This seat has a handle, it seems...) Storage space"
          }
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Beppo, Fairplay, and Furst are testifying about the crucial moment the crime was perpetrated.",
      "labels": [
        "spatial",
        "behavior"
      ],
      "reasoning": [
        "Fact 1: The witness claims nobody is in the carriage, or they would have seen",
        "Fact 2: The evidence suggests there is a storage space under the omnibus seat that the witnesses could not see.",
        "Prop 1: If there is a place that could hide a person, then the person from the top of the omnibus could overlook the possibility that this person is the actual culprit."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "Fairplay:\nThere was blood on both hands of the assailant. I sincerely and distinctly remember that!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nNo! The evidence tells us otherwise! We have the gloves the defendant was wearing on the night in question in the Court Record.\nFairplay:\nI'm well aware of that, sir. But nevertheless... ...I know what I saw and I stand by it! The man had blood on both his hands!\nRyunosuke:\n(He's defiant, even in the face of hard evidence. He's steadfastly refusing to admit that he might be mistaken about what he saw... But why?)\nVan Zieks:\nYour reasoning...is dire.\nRyunosuke:\n...!\nVan Zieks:\nOne hand or two, the salient point remains unchanged! Minutes after the grim crime, the victim's blood dripped guiltily from the accused's fingers!\nJudge:\nHmmm...Fairplay:\nHowever...I, I suppose you might say that I didn't see the exact moment the stabbing transpired...if that matters.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nDon't try to downplay this! Whether or not you saw the exact moment of the crime... ...is a matter of fundamental importance, as well you know!\nFairplay:\nArgh! But... For crying out loud, we all know that no one else could possibly have done it! I was just - Grrr - trying to save us all some time!\nRyunosuke:\nYou have a loan of twenty guineas outstanding with the defendant, do you not?\nFairplay:\nHmph!\nRyunosuke:\nHad you hoped to release yourself from that financial burden by ensuring the defendant was found guilty?\nFairplay:\nI...well... Argh! That's not entirely...not...what I was hoping for... Argh! I, I just lost a little guinea or...ten when I backed the wrong horse in the Derby, that's all. Grrr... I was going to win it all back! There's a fixture this weekend that's a sure thing!\nRyunosuke:\nHaah... (A 'little' guinea or ten?)\nFairplay:\nI'm a banker! No one bats an eye if I borrow a little spending money for the weekend!\nJudge:\n......... I think you may have revealed rather more about your character than you bargained for, sir.\nVan Zieks:\nThis witness's scruples are not on trial here. ...Proceed to the next witness.\nRyunosuke:\n(Is, is that really how it's supposed to work...?)Furst:\nI remember seeing the knife. And, and I remember seeing both of the attacker's hands with blood on them.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYou definitely saw that, too? Blood on both hands?\nFurst:\n...Yes, sir. I mean, I, I know what you're going to say. Only one of Mr McGilded's gloves has any signs of blood on it.\nJudge:\nThat's right.\nFurst:\nThe thing is...as far as I remember, sir... ...when I looked down and saw Mr McGilded sitting beside the other fellow... ...I don't believe he was wearing any gloves, sir.\nRyunosuke:\nHe wasn't wearing these gloves?\nFurst:\nThat's correct, sir. And I saw the blood on both his bare hands quite clearly.\nRyunosuke:\n(It's true that the dark-coloured stain on the dark leather gloves wouldn't have been easy to see...)\nVan Zieks:\n...I should point out that the police officer who apprehended the accused on the night in question... ...reported that there was no trace of blood on Mr McGilded's gloved hands.\nRyunosuke:\n(There wasn't blood on his hands...?)\nJudge:\nHm. This is puzzling indeed.\nRyunosuke:\n(This must be significant somehow. I'm sure of it!)Beppo:\nI, I d-didn't actually s-see anything myself. No. N-Not until I h-heard that scream.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYou didn't see anything?\nBeppo:\nOh, yes sir. That is to say, no sir, I d-didn't. Very sorry about what I s-s-said before, sir. Very sorry, yes. It, it was very wrong of me to m-m-make up stories and s-say I saw him s-stab the man. ...W-Wouldn't you agree, sir?\nFairplay:\nHmph! I know what you're insinuating! But I certainly wasn't making up stories!\nRyunosuke:\nStill, to say you saw nothing isn't right either, is it?\nBeppo:\nNo no, sir. I saw n-n-nothing at all.\nRyunosuke:\nMr Beppo! You were driving your horses! ...At the very least, you, um... You must have enjoyed a good view of London's streets, no?\nBeppo:\n.........\nRyunosuke:\n......... Oh, please... You didn't even see that?\nBeppo:\nIt, it was so c-cold that night, you see. It was all I c-could do to k-k-keep from passing out, sir. Yes, my h-h-head was fairly f-frozen solid. S-Sorry to say, sir.\nVan Zieks:\n...It would seem prudent... ...to avoid travel on the last omnibus service of London's cold winter nights.\nJuror No. 5:\nBeppoooooo!\nBeppo:\nAgh!Fairplay:\nAnyway, the fact remains! There can't have been anyone else inside that carriage, or we all would have seen!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nAnd everything you saw of the incident was through the skylight on the roof of the omnibus?\nFairplay:\nThat's right. It was fiercely cold that night, but the glass wasn't frosted over.\nFurst:\nOh yes! I remember I was shivering, it was so bitter.\nJudge:\nWhich rather begs the question of why the pair of you were sitting on the roof deck in the first place.\nFairplay:\nWell I don't know about this young fellow, but I couldn't enter the cabin.\nRyunosuke:\nOh? Why not?\nFairplay:\nIt was locked from the inside. I tried knocking, but no one opened the door.\nRyunosuke:\nIt was locked?\nFairplay:\nThat's right! And it's a public bus service, for pity's sake! That's not what I call fair play!\nFurst:\nYes, I had exactly the same experience. I tried knocking, but the gent inside just gestured at me to clear off! So I had no choice but to climb up to the roof deck and look down longingly into the warm cabin below.\nFairplay:\nWell I can assure you I wasn't just looking down! I was glaring! Long and hard! And that's precisely why I can tell you with absolute confidence... ...that if there was anyone else at all in the cabin, I would have noticed!\nVan Zieks:\n......... Unequivocal, I would say.\nRyunosuke:\n(I'm not sure about these two witnesses. Could they really have seen everything inside the cabin through the skylight?) \n\n\n\nThey would have seen everything\n\n\n\n\n\n\n\nRyunosuke:\n(I suppose they would have had a bird's-eye view from the roof. And birds generally have very keen eyesight, so...) Thank you, that's all clear. What you've said does make sense.\nJudge:\nVery good. Continue with the cross-examination, Counsel.\nLeads back to cross-examination\n\n\n\n\nThey might not have been able to\n\n\n\n\n\n\n\nLeads to:\n\"Allow me to confirm one thing, Mr Fairplay...\"Present Omnibus\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"Allow me to confirm one thing, Mr Fairplay...\"Susato:\nMr Fairplay didn't see Mr Mason being stabbed at all! That's a hugely significant change in the facts of the case!Ryunosuke:\nAnd there's something else that occurred to me whilst listening to the witnesses' latest testimony. Two of them are recounting what they saw through the skylight in the omnibus roof.Susato:\nI know it's a large window and certainly affords a good view of the inside, but... Well, I think perhaps we ought to confirm what they're saying with our own eyes as much as possible.Ryunosuke:\nWhat do you mean?Susato:\nI mean that we can examine the evidence firsthand. The omnibus is here in the courtroom after all.Ryunosuke:\n(That's a good idea. And we can consider the witnesses' statements while we're looking around.)Ryunosuke:\nAllow me to confirm one thing, Mr Fairplay... You were riding this omnibus... ...and witnessed the events in the cabin through the skylight in the floor of the upper deck. Is that right?Fairplay:\nThat's right, yes.Ryunosuke:\nIn that case... ...there is a portion of the cabin interior that would have been out of sight from you.Fairplay:\nWhat?!Furst:\nBy golly! Really?!Ryunosuke:\nObviously at this stage we can't say for sure... ...but the possibility cannot be denied... ...that at the time of the incident, there could have been another passenger in the enclosed cabin of the omnibus!Van Zieks:Van Zieks:\nEnough hypothetical meandering! ...My Nipponese friend. The prosecution demands that you substantiate your claims. After all, the scene of the crime is here...in the flesh.Judge:\nVery well, I will uphold the prosecution's demand. You will identify the area on this cross-sectional plan of the omnibus. Where exactly in the omnibus are you suggesting that this potential extra passenger could have been situated?Present seat on right inside the cabin\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"Both rows of seats on the roof face in the direction of travel.\"Present anywhere else\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nHere, My Lord! In this location, an extra passenger could have been completely hidden from view!\nVan Zieks:\n\nVan Zieks:\nIf you believe that to be true, Counsel, then may I suggest you attempt to conceal yourself there?\nRyunosuke:\nSorry?\nVan Zieks:\nAnd here's to you never seeing the light of day again!\nRyunosuke:\nAaagh! (Ugh, whatever's in that hallowed chalice, it has a very bitter aftertaste...)\nSusato:\nIt pains me to say it, Mr Naruhodo, but that was, well... bitterly disappointing.\nRyunosuke:\nUgh...there's bitterness in the air, it seems...\nJudge:\nHmph. Perhaps you'd like to reconsider your answer, Counsel?\nLeads back to:\n\"You will identify the area on this cross-sectional plan of the omnibus.\"Ryunosuke:\nBoth rows of seats on the roof face in the direction of travel. Whereas the seats in the enclosed cabin face each other. Which means... ...the visible part of the cabin, which passengers on the roof deck can see through the skylight... ...is as I've drawn here.Judge:\nAh!Ryunosuke:\nThat's right, My Lord. As you can see... ...the seat opposite the one on which the victim and his attacker were sitting is obscured from view. In other words, if someone had been sitting on that seat... ...it's quite possible that these witnesses would have been completely unaware of it!Fairplay:\nGAAAAAARGH!Van Zieks:Van Zieks:\n'It's quite possible' some phantom was sitting there? You Nipponese have a forbidding habit of obscuring the truth with ambiguity.Ryunosuke:\n...!Judge:\nI concur with the prosecution's rejoinder. In a British court of law, evidence is paramount. I cannot entertain this conjecture, Counsel. That is, unless you're able to put a name to this mysterious passenger to whom you allude?Susato:\nCan you, Mr Naruhodo?!Ryunosuke:\n......... (I honestly don't know. Who could it have been...? Who could have been in the other seat, which was out of sight from the witnesses on the roof deck?)I have an inkling\n\n\n\n\n\n\n\nRyunosuke:\nI understand, My Lord.\nLeads to:\n\"The defence would like to put forward a name.\"I have no idea\n\n\n\n\n\n\n\nRyunosuke:\n(...Ugh! I have literally no idea...)\nSusato:\nBut as a proud citizen of the Japanese Empire... ...you will look to the sky and walk on, making sure all signs of tears are gone! ...Go on!\nRyunosuke:\nThis isn't just a case of 'going on', Miss Susato.\nSusato:\n.........\nRyunosuke:\nAl-Alright then! I'll...go on!\nLeads to:\n\"The defence would like to put forward a name.\"Ryunosuke:\nThe defence would like to put forward a name.Van Zieks:\n...You are a fool. That response was a desperate attempt by a man who has no notion of his own limitations. A toast! ...To hard lessons, not yet learnt!Judge:\nLet us not delay, Counsel. The defence is still to name the passenger in the other seat.Ryunosuke:\n(This could be it! This could be the chance I've been waiting for to turn the trial in my favour.) On that night... On the night of the murder... ...the person occupying the seat in the omnibus cabin that was obscured from view was...Present Magnus McGilded profile\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"The passenger in the enclosed cabin that the witnesses on the roof deck failed to see...\"Present anyone else\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYes! Concealed in the blind spot of the cabin that night... was none other than THIS unexpected passenger!\nVan Zieks:\n...Whatever so-called 'logic' you used to arrive at that conclusion, it matters not. Because your answer has made one thing abundantly clear... ...the real blind spot is inside your head. ...And it would appear to be unusually large.\nRyunosuke:\nUgh... (You could have just said that's not right...)\nSusato:\n...Mr Naruhodo. Our task here is to defend Mr McGilded. And...we are working on the assumption that he is innocent of the crime.\nRyunosuke:\nUm, yes, of course. ...Why?\nSusato:\nThat must mean, then, that there was someone else inside the omnibus with Mr McGilded. The true culprit.\nRyunosuke:\nThat's right. Exactly what I've been- Oh! Of course! So the two people sitting inside the cabin that the witnesses saw through the skylight that night... (They were the victim...and the real culprit...)\nSusato:\n...It does seem... ...as though we've all been making a false assumption.\nRyunosuke:\n(The witnesses weren't looking at Mr McGilded at all. Meaning he has to have been sitting somewhere else...)\nJudge:\nLet us not delay, Counsel. The defence is still to name the passenger in the other seat.\nLeads back to:\n\"This could be it!\"Ryunosuke:\nThe passenger in the enclosed cabin that the witnesses on the roof deck failed to see... ...has to have been Mr Magnus McGilded.Fairplay:\nMc...?Furst:\nMr McGilded?!Judge:\nWhat are you talking about, Counsel? That's the name of the defendant!Van Zieks:Van Zieks:\n...If I desecrate this chamber by smashing my hallowed chalice...do forgive the discourtesy.Judge:\nLord van Zieks!Van Zieks:\nPeople talk of those tiny island nations in the Far East as having a learning and culture of their own. ...But I see they use the terms ill-advisedly.Ryunosuke:\nWhat are you trying to say?Van Zieks:\nLet me explain in terms that even a student of an artless backwater such as yourself might understand... When the bloody scene unfolded, the victim and his assailant were sitting side by side. Multiple witnesses have attested to the fact. It's the very premise on which this case is built!Ryunosuke:Ryunosuke:\nBut that premise...may be wrong.Van Zieks:\n...What?Ryunosuke:\nIf the victim really was sitting beside Mr McGilded... ...it creates an inconsistency that can't be reconciled in any way.Judge:\nWhat inconsistency, Counsel?Ryunosuke:\nThe defendant's gloves, My Lord.Van Zieks:\n...!Ryunosuke:\nBoth witnesses made the same testimony. They claim that there was blood on both hands of the person sitting next to the victim.Van Zieks:Van Zieks:\nYet we know the truth to be otherwise. Only one glove bears the gory remains.Ryunosuke:Ryunosuke:\nThe point is! ...Even in the face of this irrefutable evidence, both witnesses have maintained their stance.Judge:\nYes, their testimony remains unchanged.Ryunosuke:\nExactly. They both adamantly swear... ...that they clearly remember seeing blood on both hands of the assailant. In short! Their memory of events is correct...and their testimony reveals the truth!Fairplay:\n...!Ryunosuke:\nIt was somebody else sitting beside the victim that night. A third party we have yet to identify. And the victim's blood was on that passenger's hands! Both of them!Van Zieks:Van Zieks:\nAnd who was this 'third party'?Ryunosuke:\nObviously...the true culprit!Judge:\nEx-traordinary! Ordaaar! Ordaaar! Orrrdaaar! What exactly are you postulating?Van Zieks:Van Zieks:\nThe defence's postulation is just that! Nothing more than conjecture! The witnesses have clearly stated...that they saw the accused!Ryunosuke:Ryunosuke:\nBut when elaborating on his testimony... ...Mr Fairplay said, 'The two of them were wearing hats and I couldn't exactly make out their faces.'Fairplay:\nHm... Yes... The tops of their heads were obscured by the roof. I could see the rest of them, though.Furst:\nYes, that's right. Both gents were most certainly hatted. Hatters do tend to notice such things, sir.Judge:\nAnd what particular styles of hat did the two gentlemen sport, Mr Furst?Furst:\n......... I'm afraid I...don't remember.Ryunosuke:\n(And you call yourself a hatter...?)Van Zieks:\nThe style of hat makes no difference! There was no third passenger in that cabin!Ryunosuke:\nHow can you be sure?Van Zieks:\nBecause if there had been... ...the accused, Mr McGilded, would undoubtedly have offered to depose the fact!Ryunosuke:\n...!Van Zieks:\nUnless, that is, you are proposing an even more preposterous explanation? That the accused failed even to notice the presence of the true culprit in the very cabin in which he travelled?Ryunosuke:\nAh! (He's right... If there was another person travelling in the enclosed cabin of the omnibus... ...it's inconceivable that Mr McGilded would have been unaware of it.)Judge:\nOrdaaar! There is clearly a simple solution to this 'problem'.Van Zieks:\nBring the accused, Mr McGilded, to the stand?Judge:\nWell, what say you, Counsel?Van Zieks:\nThe prosecution objects, My Lord.Judge:\nOn what grounds?Van Zieks:\nAs a suspect, he will have already made a full statement to the police.Ryunosuke:\nBut, but what if there's some reason why he's unable to speak freely?Van Zieks:\nMagnus McGilded is no uneducated ruffian.Ryunosuke:\n...!Van Zieks:\nIf it indeed turns out the man has been withholding information... ...you can be sure it will have been a most deliberate act.Judge:\nHm... Counsel for the Defence, what is your opinion?Ryunosuke:\nMy Lord... (Should we ask Mr McGilded to testify...or not?)Demand his testimony\n\n\n\n\n\n\n\nLeads to:\n\"Yes, we need to hear what he has to say in order to find out the truth.\"Leave well alone\n\n\n\n\n\n\n\nRyunosuke:\n......... (Ugh...I can't get the words out...) \nSusato:\nI understand, Mr Naruhodo. The idea that Mr McGilded may be hiding something must be playing on your mind. The truth could be far more disturbing than we realised.\nRyunosuke:\nBut...that's all the more reason... ...why there's only one course of action here. To believe in my client. That's what Kazuma taught me.\nSusato:\n...!\nRyunosuke:\nWhenever I'm not sure what to do, I feel like I can hear him guiding me.\nSusato:\nThen that's what we must do.\nLeads to:\n\"Yes, we need to hear what he has to say in order to find out the truth.\"Ryunosuke:\n(Yes, we need to hear what he has to say in order to find out the truth.) The defence would like to call Mr McGilded to the stand!Judge:\nHm... In that case, I would like to hear the opinion of the jury.Juror No. 1:\nAh, yes, erm... I need a little time to consider this...Juror No. 2:\nIf you ask me, I think we should hear what Mr McGilded has to say.Juror No. 3:\nGet the man out here, I say!Juror No. 4:\nIt would be utterly illogical not to hear his testimony.Juror No. 5:\nWhen something needs doing, get it done! That's how I run things at the guild!Juror No. 6:\nHearing what the patron of my favourite little park has to say? Oh yes, that would be lovely.Juror No. 1:\nYes! The jury says the man must be heard!Judge:\nVery well. The court will hear the defendant's testimony. Bailiff! Show the defendant to the stand at once!Ryunosuke:\n......... (Now, maybe what actually happened that night... ...will finally become clear.)Judge:\nLet proceedings be resumed. Mr McGilded... ...have you been listening to the discourse of the day?McGilded:\nTo be sure I have, My Lord.Judge:\nThere are now two matters on which the court desires to hear from you. The first... ...is whether or not there was a third party with you in the omnibus cabin, as proposed by the defence. The second... ...is that if such a person was indeed present, why did you conceal that fact from the police?McGilded:\n......... Begad, no! 'Tis not in my nature to hide anytin' at all.Van Zieks:\nJust answer the questions, please.McGilded:\nThe truth of the matter is, I've been desperate about this all along. Do I tell youse all, or keep me mouth shut?Ryunosuke:\n...! Tell us what, Mr McGilded?Van Zieks:\n.........McGilded:\nThe fine fella representin' me is absolutely right. In the carriage on the night with meself and the other man, there was another passenger.Judge:\nIt's true?!McGilded:\nAye, and 'twas me who helped the little urchin get away after it all happened.Ryunosuke:\nYou... WHAAAAAAAAAT?!Van Zieks:\n......... No, Magnus McGilded. That convenient excuse can't save you now.McGilded:\nI'm truly sorry, so I am, Lord van Zieks! I'm sure you'll be wantin' to know why I said nuttin' when I was taken in by the police. I do be havin' a very good reason, I assure you.Judge:\nWhich was...?McGilded:\nWell, the little child was just in the wrong place at the wrong time, and not in any way involved, you see.Van Zieks:\nWhat?McGilded:\nIf the police had known the wee one was there... ...they'd have assumed she'd done it. They'd have hauled her into this here courtroom, just like meself. I was only tryin' to spare her that. ...Young hearts and young minds are easily damaged, My Lord.Van Zieks:\n.........Judge:\nHm... And who was this young child of whom you speak?McGilded:\nThat...I don't know.Judge:\nYou don't know?McGilded:\nAye, well, the wee ting just happened to be in the carriage that night. I never saw her before or since.Van Zieks:Van Zieks:\nWe have absolutely no reason to believe this man. The prosecution calls for the witness's statements to be disregarded by the court.McGilded:\nYou know, I wouldn't be surprised... ...if the urchin isn't here in this courtroom as we speak, listenin' to the proceedings.Ryunosuke:\nWhat?*BANG!*Ah! Smoke!AAAAAAGH!Fire! There's a fire!Look! Someone's trying to get away!*Cough!* After them!It's no use! *Cough, cough!*I, I can't see anything through all this smoke!Ryunosuke:\nWhat is going on?!Susato:\nBe careful, Mr Naruhodo! Cover your face!Van Zieks:\nBailiff! Don't let the accused escape! Secure the omnibus!Judge:\nI hereby call an emergency recess! Bailiff! Ensure the defendant is in custody, and clear the courtroom!Ryunosuke:We were hurriedly removed from the smoke-filled courtroom by the bailiff... ...amid scenes of chaos as people stumbled over one another in their desperation to flee the chamber. We had no idea what was happening. All we knew was that, for the time being at least, the trial was suspended.To be continued...18th February, 12:52 p.m.\nThe Old Bailey, Defendants' AntechamberRyunosuke:\n(What on earth just happened in there?)Susato:\nMr Naruhodo! I've managed to find out what happened!Ryunosuke:\nMiss Susato!Susato:\nI was told it was an advanced form of 'smoke grenade'. A type of exploding device that releases smoke.Ryunosuke:\nA smoke grenade? It, it sounds like the sort of thing ninjas use!Susato:\nThey're just making sure everything is safe now. I think the trial will start again before long.Ryunosuke:\nBut...who would have done something like that?Susato:\nThe police managed to catch someone who was trying to flee the courtroom, apparently.Ryunosuke:\nFlee the courtroom? Why?Susato:\nWell, it's a young girl of around fifteen, I hear.Ryunosuke:\nA young girl? Then, could it be...? ...the other passenger that Mr McGilded was just talking about?!Susato:\nMy thoughts exactly!Ryunosuke:\n(So he wasn't lying...) Oh! What's become of Mr McGilded, actually? There are so many things I need to ask him about. But he's not here!Susato:\nI think he was summoned to the prosecutor's antechamber to answer questions. Along with the young girl.Ryunosuke:\nWho is she, I wonder? And what was she even doing here at the trial? (She was taking a huge risk, and for what possible benefit to herself?)Susato:\nThere's another matter that's troubling me.Ryunosuke:\nWhat's that?Susato:\nThe 'twenty pence'.Ryunosuke:\nHm? Oh...um...Susato:\nAccording to the coachman, Mr Beppo... ...he took four passengers that night, at a fare of fivepence each. That comes to a total of twenty pence exactly.Ryunosuke:\nBut now it seems there were in fact five passengers.Susato:\nWhich means the figures don't seem to add up again.Ryunosuke:\nEr... (She's right. That is strange...)Bailiff:\nCounsel for the Defence! Kindly proceed into the courtroom! The trial will recommence in five minutes!Ryunosuke:\nOh! Thank you, Officer. We'll go in straight away.Susato:\nWell... ...whoever she is, I imagine this young girl will be asked to take the stand and testify now. I really can't imagine what she's going to say. But it could alter the whole direction of the trial!Ryunosuke:\n...We'll know soon enough, Miss Susato.Susato:\nYes!18th February, 1:00 p.m.\nThe Old Bailey CourtroomExamine evidence\n\n\n\n\n\n\n\n\n\nOmnibus\n\n\n\n\n\n\n\n\n\nDoor\n\n\n\n\n\n\n\n\n\nBloodstain on floor\n\n\n\n\n\n\n\nRyunosuke:\nThat's...blood, isn't it? .........\nSusato:\nIs something wrong?\nRyunosuke:\nOh, it's just... Well, this bloodstain is so obvious, that's all. And yet van Zieks has made no mention of it.\nSusato:\n...I suppose that does seem a little strange.\nRyunosuke:\n......... (Why do I have such a bad feeling about this...?)\n\n\n\n\nHandle under seat\n\n\n\n\n\n\n\n\n\nStorage space\n\n\n\n\n\n\n\nRyunosuke:\nThis is a storage compartment, but there's nothing in here. It's totally empty. ......... (...Something doesn't seem right here, but I can't put my finger on what it is...)Ryunosuke:\nThere's the young girl next to Mr McGilded, look. She must have been the one who caused the disturbance before.Judge:\nWell, after that rather eventful recess, the court will now resume the trial of Mr Magnus McGilded. Now then, Lord van Zieks...Van Zieks:\nMy Lord?Judge:\nI believe you have established the cause of the smoke which veiled proceedings earlier?Van Zieks:\nIt seems to have been an advanced form of 'smoke grenade', of the sort typically employed by the army.Judge:\nGood gracious! The army?! What in the devil's name...?Van Zieks:\nIt was an elaborate attempt by a young girl to cloak her escape from the public gallery. But she was caught. ...And now occupies the stand.Judge:\nHm... Your name, girl????:\n.........Judge:\nAre you responsible for the smoke grenade which induced such pandemonium here in my courtroom????:\n.........Judge:\nWhat is the meaning of this deplorable behaviour?!???:\n.........McGilded:\nAhem! ...If I may, My Lord?Judge:\nYes, Mr McGilded?McGilded:\nI tink perhaps I ought to explain here. Why it is that this wee lass was here in the first place, and why she tried to bolt like that. 'Tis all tied up with the events of that night, so it is.Judge:\nHmmm... Very well, Mr McGilded, give your testimony. You will explain to the court exactly how this young woman is involved in the case!Van Zieks:\n.........Ryunosuke:\n(Just what did happen that night? It's not like a defence lawyer needs that information or anything...)Witness Testimony\n- The Young Girl -McGilded:\nOn the night in question, I took the back seat in the omnibus and promptly nodded off.\nThen, begorrah, a loud thud and a wee scream woke me up with a fair start.\nThere was a fella collapsed on the floor at me feet. So I sat him up on the seat across from me.\nThen I turned to find out where that scream had come from. And bless my soul, what did I find?\nThere was a child in there, all curled up in a ball, hidin' her wee self away!Judge:\n......... I remain somewhat baffled, I confess. But from what I gather, on the night in question... ...this young girl was indeed riding in the omnibus. Is that correct?McGilded:\n'Tis exactly as the defence counsel said. This lass was the fifth passenger, My Lord.Judge:\nVery well. The defence may now cross-examine the witness. Are you ready, Counsel?Ryunosuke:\nYes, My Lord! (Or rather, no. I have no idea where to start...)Van Zieks:\n.........Cross-Examination\n- The Young Girl -",
      "testimonies": [
        {
          "testimony": "On the night in question, I took the back seat in the omnibus and promptly nodded off.",
          "person": "McGilded",
          "present": []
        },
        {
          "testimony": "Then, begorrah, a loud thud and a wee scream woke me up with a fair start.",
          "person": "McGilded",
          "present": []
        },
        {
          "testimony": "There was a fella collapsed on the floor at me feet. So I sat him up on the seat across from me.",
          "person": "McGilded",
          "present": []
        },
        {
          "testimony": "Then I turned to find out where that scream had come from. And bless my soul, what did I find?",
          "person": "McGilded",
          "present": []
        },
        {
          "testimony": "There was a child in there, all curled up in a ball, hidin' her wee self away!",
          "person": "McGilded",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "McGilded:\nOn the night in question, I took the back seat in the omnibus and promptly nodded off.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nAnd when you first got onto the omnibus, were there any other passengers already on board?\nMcGilded:\nThere were not. The cabin was empty, and there was no one on the roof deck, either.\nJudge:\nYou were the first passenger, as it were. I see...\nMcGilded:\nAye, and that's why I took the back side as I did. 'Tis the most comfortable, so it is.\nRyunosuke:\nCould you explain exactly what you mean by 'the back seat'?\nMcGilded:\nBy all means. 'Tis how you already described it earlier. I'm talkin' about the seat opposite the one in which the poor gentleman who was stabbed was sittin'. Like I said, 'tis the most comfortable and where I feel most at ease. And of course, I enjoy gazin' through the skylight from time to time as well.\nVan Zieks:\n.........McGilded:\nThen, begorrah, a loud thud and a wee scream woke me up with a fair start.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nA loud thud, you say? And a scream?\nMcGilded:\nAye, that's right. How can I explain it...? 'Twas like the sound of someone fallin' to the ground. That sort of noise.\nRyunosuke:\nSo you think it was the sound of Mr Mason falling to the floor having been stabbed?\nMcGilded:\nWell now, you'll remember I was asleep at the time. So I wouldn't like to say. And when the sound woke me and I opened my eyes... ...there wasn't a soul to be seen in the carriage but the fella on the floor.\nRyunosuke:\nHm, you didn't see anyone... But at the same moment...you did hear a scream?\nJudge:\nAh, from the seats above you on the roof deck, I presume?\nMcGilded:\nNot above me, no, My Lord. 'Twas from inside the cabin. But I wasn't altogether tinkin' about the scream. No...I was too stunned by the desperate sight before me eyes.McGilded:\nThere was a fella collapsed on the floor at me feet. So I sat him up on the seat across from me.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYou, you sat him up?! The victim, you mean?\nMcGilded:\nThat I did. On the seat across from me, as I said. I could plainly see the poor devil was already gone. And you wouldn't leave a dead man just lyin' on the floor now, would you? 'Tis common courtesy, so it is!\nVan Zieks:\nI find that a little hard to believe.\nMcGilded:\nAra, Lord van Zieks! Now why would that be?\nVan Zieks:\nYou wake to find a man lying dead at your feet in a carriage. Any normal person would hail the cabman. Any...upstanding member of London society, that is.\nMcGilded:\n......... Well now, as you know...I'm in somethin' of a 'special' line of business.\nJudge:\nThe business of lending money at exorbitant rates of interest?\nMcGilded:\nUnfortunately, My Lord, not everyone is tankful for the help I offer them, and some would even see me dead. So I do try, where at all possible, to avoid gettin' meself in a tangle with trouble.\nRyunosuke:\nAre, are you suggesting you were just going to leave the man there?\nMcGilded:\nHeavens alive, no! I was always intendin' to report it, so I was. Only...I had a mind to find out the whys and wherefores first.\nRyunosuke:\nThe whys and wherefores?\nMcGilded:\nRight you are. There were some details I wanted to understand before...anyone else got to meddlin'. That wee scream I heard, for example. Wouldn't your good self do just the same? \nRyunosuke:\n(Hm, yes... The scream he says he heard at the same time as the thud of the victim collapsing...)McGilded:\nThen I turned to find out where that scream had come from. And bless my soul, what did I find?Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nUm...I'm afraid I don't understand. I'm sure you told the court that there was no one else in the carriage except yourself and the victim.\nMcGilded:\nSo I did, sir, so I did. ...As far as I could see, that is.\nRyunosuke:\nWhat do you mean by that?\nMcGilded:\nWell now, 'tis a queer ting. The wee scream I heard as I woke up... It came from - if you'll excuse the vulgar expression - under me backside!\nJudge:\nGood gracious!\nRyunosuke:\nUnder your backside?!\nMcGilded:\nAnd when I lifted the seat on which I'd been sitting... ...I found there was a wee cubbyhole there for storage.\nSusato:\nMr Naruhodo! We can examine the omnibus ourselves, remember!\nRyunosuke:\n...Yes, of course. The whole bus was submitted as evidence.\nSusato:\nThis would be a very good time to have a thorough look around inside!\nMcGilded:\nAnd that's when I found her...McGilded:\nThere was a child in there, all curled up in a ball, hidin' her wee self away!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYou say she was hiding herself?\nMcGilded:\nAye, that's right. 'Twas hard to see in the dim lamplight, but she was all curled up in a wee ball. When our eyes met, well... Me heart nearly stopped beatin' in me chest!\nRyunosuke:\n(Ugh... You're really overacting this...)\nMcGilded:\nStill an' all, I pulled her out from under there... ...and sat her on the seat opposite so I could have a wee chinwag with her.\nRyunosuke:\nThe seat opposite?\nMcGilded:\nThat's right. Just next to the dead gentleman there.\nJudge:\nYou sat this young girl next to a corpse, sir?\nMcGilded:\nWell, as I'm sure I mentioned... ...a gentleman in my position can all too often find himself in mortal danger. So I needed to find out just who this urchin was, you see.\nJudge:\nHm...\nMcGilded:\nAnd while I was in the middle of talkin' with her, I heard another scream. A fella's voice this time.\nRyunosuke:\nPresumably that scream was Mr Furst, who was sitting on the roof deck seats.\nMcGilded:\nRight you are again, I would say, sir. Looking down through the skylight, he must've seen this young girl and the gentleman with the knife in his belly.\nJudge:\nIn other words, the previous witnesses did not, in fact, see you at all, Mr McGilded. What they believed to be yourself and the victim was in fact this girl and the late Mr Mason?\nMcGilded:\nAye, My Lord. I was, as I tink everyone understands now, sat at the back of the carriage out of sight.\nJudge:\nIt is certainly plausible... The defendant is somewhat diminutive in stature... ...and readily confused, perhaps, with this young girl.\nMcGilded:\nAfter that, of course... ...with the scream from the gentleman over us, the driver realised sometin' was wrong and pulled up the horses.Susato:\nI do wonder how you must be feeling Mr Naruhodo...Ryunosuke:\nBeing the defendant's lawyer, and yet finding myself as stunned as everyone else at his testimony? ...Let's just say it's...trying.Susato:\nWe certainly had precious little time to talk to Mr McGilded before the trial. But we mustn't be dispirited! We must just try to learn all the facts we can!Ryunosuke:\n(Haah... When we arrived in London this morning, I didn't see my day panning out like this...)Susato:\nMr Naruhodo! No grumbling, even in your head!Ryunosuke:\nUhhh... How did you know...?After pressing all statements:Judge:\nThank you, I've heard enough. The events as explained are clear in my mind. However...at least one conundrum remains... Who is the girl????:\n.........McGilded:\nHer name is Gina Lestrade, My Lord. She's a chancer. Earns her crust among large crowds, relievin' people of their purses. What's commonly called a pickpocket.Ryunosuke:\nWhat?!Judge:\nThis girl here?! A petty thief? Ordaaar! Ordaaaaaar!!! Is this true...Miss Lestrade????:\n.........Judge:\nMiss Lestrade! You will answer the question! ARRRGH! How dare you?! What is the meaning of this?! Ah! The girl! She's gone!Open yer eyes!Gina:\nI'm over 'ere.Judge:\nGood gracious! How...?Ryunosuke:\n(What was the point in that little sidestep...?)Gina:\nI know wot you lot are thinkin'! Grown-ups are all the same! 'This dirty little dipper,' you'll say, 'slipped up an' got caught on the job. She got 'erself backed into a corner, so she knifed the gent!' Go on! That's wot's in yer 'eads, ain't it?Ryunosuke:\nNo, not at all! This is a court of law. We're here to determine the truth, not cast- .........Gina:\nLook, knives are for cowards. Only thugs use weapons like that. All I need for wot I do is these fingers. I'm a professional, alright? Maybe not in your eyes, but I got pride in wot I do!Ryunosuke:\nLet me guess? You don't count smoke guns among 'weapons for thugs'?Gina:\nOh, this? Yeah, this was in a bag I lifted the other day, down where they keep the four-wheeled drags. It's nice, innit? I like the pink best.Judge:\nAgh! Do not wave that thing in my direction again!Van Zieks:\nSo... ...you admit that you were riding the omnibus on the night in question?Gina:\n.........McGilded:\n...'Tis alright, lass. You can tell them the truth now.Gina:\n......... Alright, yeah... It's just like the Irishman said...Judge:\nThe court accepts this girl, Miss Gina Lestrade, as a valid and significant witness in this case. Accordingly, young lady, we will now hear your testimony, if you please.Gina:\n.........Judge:\nYou will tell the court exactly what happened in the omnibus on the night in question.Gina:\n...Alright...if I 'ave to...Witness Testimony\n- What the Girl Saw -Gina:\nSo I snuck inside the carriage before they 'ooked up the 'orses, just like always.\nBut it was a right old waste o' time. I got nuffin' to show for me troubles that night.\nI'll tell ya, you can't see a blind thing in that hidin' place. It's pitch in there.\nThen after a while, I 'ear this loud bang. Nearly jumped out me skin, I did. An' the scream just...came out.\nIt's because o' that, this swell found me. ...'E did 'elp me get away, mind.Ryunosuke:\nYes, he let you go...Judge:\nI fail to understand why you would let this street urchin go, Mr McGilded.McGilded:\nOh, 'tis simplicity itself, My Lord. You see, she couldn't possibly have killed the other passenger. I knew that for a fact.Ryunosuke:\nHow?McGilded:\nAs I'm sure I said before, sir... ...I was sittin' right on top o' the place where she was hidin' herself.Judge:\nI think a demonstration is called for.McGilded:\n...This is where I was sat that night.Judge:\nAnd the 'cubbyhole' of which you have spoken is underneath this seat, I presume? Hm, yes... It does appear just large enough to accommodate someone of the girl's stature.McGilded:\nAye, but of course, the wee lass was stuck in there. Because I'd parked meself on the seat for the duration.Judge:\nAh!McGilded:\nSo you see, that's why I let the lass bolt. I knew that if the police found her there, they'd automatically assume she'd done it. But I couldn't live with meself if a young life was ruined when all the time I knew she was innocent.Judge:\nEven though you must have realised your action would result in your own innocence being called into question?McGilded:\nNot at all, My Lord, not at all!Juror No. 1:\n...!McGilded:\nI knew in my own heart that I was innocent. So I thought it was worth takin' a punt on my own good name for the sake of this less fortunate lass.Juror No. 2:\nMy goodness!Juror No. 6:\nWhat a perfect gentleman!Juror No. 1:\n...My Lord! This...this fine example of a man cannot possibly be guilty of a heinous crime like this. I'm ashamed of myself for ever doubting you, sir!Juror No. 4:\nWith calm, calculated reasoning, one arrives clearly at the truth every time.Judge:\nSaints alive! All six members of the jury consensual in their leaning to a verdict of not guilty?!Susato:\nMr Naruhodo! This... Well, it must mean...Ryunosuke:\nIt must mean what?Susato:\nThat we're victorious!Ryunosuke:\n......... We've...won? Are, are you sure?Van Zieks:Van Zieks:\n...If the sight of my iron-heeled Wellington offends... pray, do forgive the discourtesy. This really is a consummate example... ...of the one, monumental flaw in British judicial practices.Ryunosuke:\n...!Van Zieks:\nWhere evidence and reasoning should be paramount... emotion rules the day.Ryunosuke:\nEmotion?Van Zieks:\nThe witness's latest statement gives us a clear insight into his true nature.Ryunosuke:\nWhat do you mean, 'his true nature'?Van Zieks:\nDo you really think Scotland Yard would have made such a glaring omission? After the incident, the omnibus was comprehensively searched by officers of the police. Obviously the interior of this 'cubbyhole', as the witness put it, was included in their investigation.Ryunosuke:\n...!Van Zieks:\n'The compartment under the posterior seat was full of the coachman's belongings.' It's noted in black and white here in the police report.Judge:\nGood Lord!Van Zieks:\n...The evidence has been tampered with. In order to corroborate Mr McGilded's story...someone has unlawfully removed everything from under the seat!Ryunosuke:\nWHAAAAAAAAAT?!Judge:\nOrdaaar! Orrrdaaar! How could such a devious contrivance possibly have been effected, Counsel?Van Zieks:\n...Naturally, we must acknowledge the deficiencies of the constabulary in allowing this to have happened. However, I assure you, when the omnibus was wheeled into the courtroom this morning... ...the compartment under the seat was not empty. ...Well, my Nipponese friend?Ryunosuke:\nHm? ...Me?Van Zieks:\nWhen the carriage was submitted as evidence... ...doubtless you examined it in fine detail, as would any self-respecting practitioner of the law. Pray, what did you find the condition of the under-seat compartment to be?Ryunosuke:\n...!McGilded:\nOh, to be sure. The young gentleman will be able to clear this up in a jiffy.Ryunosuke:\nSorry?McGilded:\nGo ahead. You tell the court now, fella... ...how this is all an elaborate excuse by the desperate Lord van Zieks!Ryunosuke:\n.........Judge:\nWell, Counsel? Do you have something to say on this matter?Ryunosuke:\n......... (...How am I supposed to answer? What can I say about the state of that little compartment under the seat in the omnibus?)I didn't look\n\n\n\n\n\n\n\nRyunosuke:\nSorry. I'm a failure... I didn't look... (Why didn't I examine the omnibus more thoroughly?)\nVan Zieks:\nHm... Perhaps I credited you with too much intelligence. It seems, My Lord, that this Eastern initiate is as unreliable as wine from the barrel.\nRyunosuke:\n.........\nSusato:\nMr Naruhodo!\nMcGilded:\nEh heh heh heh heh... Well now, it would seem the argument is moot. And the truth of the matter is there for youse all to see, after all. That there cubbyhole under the seat is as empty as the devil's heart, so it is!\nVan Zieks:\n.........\nLeads to:\n\".........\"It was empty\n\n\n\n\n\n\n\nRyunosuke:\nUm, yes... I'm...fairly sure it was empty. (If I'm honest, my memory about all this is a little hazy.)\nVan Zieks:\nHm... As I suspected... It seems, My Lord, that this Eastern initiate has the scruples of a by-street wine merchant.\nRyunosuke:\n.........\nSusato:\nMr Naruhodo!\nMcGilded:\nEh heh heh heh heh... Perfect! 'Tis why the fella is representin' me, after all! He knows just what to say, does he not?\nVan Zieks:\n.........\nMcGilded:\nWell now, it would seem the argument is moot. And the truth of the matter is there for youse all to see, after all. That there cubbyhole under the seat is as empty as the devil's heart, so it is!\nJudge:\nHm, that we can be sure of, at least.\nLeads to:\n\".........\"It wasn't empty\n\n\n\n\n\n\n\nRyunosuke:\n(I really don't know if giving this answer is helping my cause as counsel for the defence... But as far as I remember at least...) When I first examined the compartment... ...I'm fairly certain there were a number of articles inside it, yes.\nJudge:\nAre, are you sure, Counsel?\nMcGilded:\nAra, be whist! What are you saying now, you daft daw?! I thought you were on my side here?\nVan Zieks:\n...! What game are you playing? Your task is to defend the man in the stand. Why would you say something to compromise his position?\nRyunosuke:\n......... ...As the advocate for the defence in this trial... ...I confess I'm still not entirely sure where I stand. But it seems to me... ...that I should state what facts I do know as clearly and honestly as possible.\nVan Zieks:\n......... Interesting.\nMcGilded:\n...'Tis not altogether pleasin', fella.\nRyunosuke:\nI'm simply telling the truth, Mr McGilded.\nMcGilded:\nWell, don't forget that yer supposed to be representin' my best interests here, lad. Now, then... A fella's memory is a curious ting, and not altogether reliable. No, the court must consider the facts. That there cubbyhole under the seat is as empty as the devil's heart, so it is! D'you think perhaps it would be...in your best interests now to admit that you might have been mistaken?\nLeads to:\n\".........\"Ryunosuke:\n......... (Why...? Why do I feel like something's not right here...)Judge:\nHmmm... I should like the jury to weigh in on this matter, I think.Juror No. 5:\n......... That compartment is designed to house equipment used to maintain the smooth running of the carriage. The guild's rules state that omnibuses should be properly and fully equipped at all times. So it certainly wouldn't have been empty on the night in question. ...Beppo isn't that irresponsible. That money-lending fleecer and the pickpurse are lying!Ryunosuke:\nAh!Juror No. 3:\nI can't believe I was nearly taken in. The stinking rich are always stinkers. Nothing but cowards, the lot of them!Ryunosuke:\nWhat? (Oh no...)Juror No. 3:\nIt's a trick! Of course it's a trick!Juror No. 4:\n...Quite so. I must concur here. With calm, calculated reasoning, one arrives clearly at the truth every time.Ryunosuke:\n(Yes, but every time a different truth, it seems...)Van Zieks:\nMy Lord, I humbly exhibit the Scales of Justice... Clearly, a verdict of not guilty at this time would be wholly inappropriate.Judge:\nThank you, Counsel. But before we proceed any further, there is the matter of the outstanding cross-examination..........Judge:\nCounsel for the Defence, begin your questioning of the witness, please.Ryunosuke:\nYes, My Lord. (...What just happened? The whole balance of the trial just shifted almost beyond recognition! ...The 'Reaper of the Bailey' is at work, it would seem...)Van Zieks:\n.........Cross-Examination\n- What the Girl Saw -",
      "testimonies": [
        {
          "testimony": "So I snuck inside the carriage before they 'ooked up the 'orses, just like always.",
          "person": "Gina",
          "present": []
        },
        {
          "testimony": "But it was a right old waste o' time. I got nuffin' to show for me troubles that night.",
          "person": "Gina",
          "present": []
        },
        {
          "testimony": "I'll tell ya, you can't see a blind thing in that hidin' place. It's pitch in there.",
          "person": "Gina",
          "present": []
        },
        {
          "testimony": "I was strainin' me ears to work out wot was goin' on, but all I could 'ear was snorin'.",
          "person": "Gina",
          "present": []
        },
        {
          "testimony": "Then after a while, I 'ear this loud bang. Nearly jumped out me skin, I did. An' the scream just...came out.",
          "person": "Gina",
          "present": []
        },
        {
          "testimony": "It's because o' that, this swell found me. ...'E did 'elp me get away, mind.",
          "person": "Gina",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "Gina:\nSo I snuck inside the carriage before they 'ooked up the 'orses, just like always.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nSo...you were already in the omnibus before it even set off on its run?\nGina:\nWell yeah. I mean, wot's the point of spendin' a joey to make a few bob, eh? That's a rum idea, innit?\nRyunosuke:\n(I suppose she means there's no point spending money to make money. ...It actually makes sense.)\nJudge:\nCounsel. May I remind you that this girl is a petty thief? Kindly refrain from entertaining her tenets.\nMcGilded:\nWell, that does clear up the little mystery of the fares an' all. Four payin' passengers at fivepence a piece, makin' the twenty to which the cabman testified. ...And one little scapegrace ridin' for free.\nGina:\nThe red conk of a driver always goes for some grub before 'is last run, see. So that's when I slip into the carriage and get meself 'idden under the seat. ...Nice an' easy, right?\nVan Zieks:\nBut your hiding place is a storage compartment. Full of equipment for the coach...no?\nGina:\n......... Yeah, there's brushes and buckets and wotnot in there, sure. I always chuck all that out and cram it in a corner somewhere. No one ever seems to bother much.\nVan Zieks:\nAnd yet, according to the report filed by the police officer who first arrived at the scene... ...the compartment was full of such paraphernalia.\nGina:\n...Well, I don't know nuffin' about that. Like I said, I moved all that stuff out so I could 'ide under the seat. That's all I can tell ya.\nJudge:\nHm... It seems we've reached the end of that line of enquiry. Continue...Gina:\nBut it was a right old waste o' time. I got nuffin' to show for me troubles that night.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\n'A waste of time'? Why is that?\nGina:\nWell, most nights I'm on me own in the God permit at least some o' the time.\nJudge:\nI, I beg your pardon? Did you say, 'God permit'?\nGina:\nOh, yeah. Well that's wot my kind call it. You'd say the 'omnibus', I s'pose. The point is, any normal run, the carriage ain't got no one in it for a while.\nRyunosuke:\nAnd that's when you come out of your hiding place and get away?\nGina:\nThat's it. Only that night... ...this cove was sat on me seat from the start. And 'e didn't budge the whole way, did 'e? Not one inch! I was totally stuck.\nJudge:\nDo you mean to tell us that you were present in the carriage for the duration? You were under the seat the entire time while events unfolded in the enclosed cabin?\nGina:\nYeah. ...Right, Mister?\nMcGilded:\nTo be sure, to be sure. I was as shocked as anyone. You don't expect to lift the cushion you've been sat on and find a child now, do you?\nRyunosuke:\n(Hm... So this Miss Lestrade couldn't possibly be the culprit then...)Gina:\nI'll tell ya, you can't see a blind thing in that hidin' place. It's pitch in there.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nSo you couldn't see out into the cabin at all?\nGina:\nNot a jot. Most days I push the cushion up wiv me 'ead an' look out the crack. Then I can 'ave a butcher's at who I'm gonna fiddle.\nRyunosuke:\nI thought you were a pickpocket, not a butcher...\nGina:\nI mean, I can 'ave a look. The seat I get under ain't as plush as the other one, see. So most o' the time, the passengers plant 'emselves opposite. But for some reason that night, this 'ere Irishman spent the whole journey right over me 'ead!\nRyunosuke:\nAnd for that reason, you weren't able to push the cushion up to peek out. I see...\nGina:\nTruth is... ...I ain't too 'appy in small, dark places. Feels too much like bein' thrown in the clink. But it's the only place to 'ide in them carriages, so it's 'Obson's choice.\n\n\n\nPursue Magnus McGilded (after pressing fifth statement)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\n...Is something wrong, Mr McGilded?\nMcGilded:\nOh! I do apologise. Was there sometin' the matter, Counsel?\nRyunosuke:\nI'm just wondering if Miss Lestrade's last comment made something occur to you, perhaps? You seemed to be thinking something to yourself.\nMcGilded:\nOh, no no. 'Twas nuttin' important. I was feelin' bad for the poor lass, is all. I remember feelin' desperate meself as a young lad, shut up in the dark. 'Twas terrifying, so it was.\nRyunosuke:\nI see. Yes, I'm sure we can all sympathise. (I'm still scared of the dark now...)\nMcGilded:\nAye. And I don't know about yeself... ...but I find that the darkness seems to make everytin' you hear seem that much louder as well.\nGina:\n......... Yeah... I, I s'pose it does...maybe.\nRyunosuke:\n...! Miss Lestrade! Did you hear something that night? Anything? An unusual noise, perhaps?\nGina:\n......... Nah. Not really. All I could 'ear was the Irishman snorin'.\nMcGilded:\nBejabers! There's no need to tell the whole world of me foibles, ye little scamp!\nSusato:\nWhat a pity... If only Miss Lestrade had heard something, it might have given us a vital new clue.\nRyunosuke:\nYes... (What should we make of that last statement of hers?)\n\n\n\nIt's insignificant\n\n\n\n\n\n\n\nRyunosuke:\n...Well, I don't think we can draw any particular conclusions from that.\nJudge:\nHmm... Very well, if that is the position of the defence.\nSusato:\n.........\nRyunosuke:\nWhat's the matter, Miss Susato?\nSusato:\nWell...I don't know... Is that really true, do you think?\nRyunosuke:\nIt, it must be, surely? She said that she didn't hear anything.\nSusato:\nPerhaps that's precisely the point. Could that be important in and of itself?\nRyunosuke:\n...! (The fact that she heard nothing...)\nJudge:\nContinue with the cross-examination, Counsel.\nLeads back to cross-examination\n\n\n\n\nIt's profoundly important\n\n\n\n\n\n\n\nRyunosuke:\nMy Lord! I believe the statement just made by the witness is profoundly important!\nJudge:\nProfoundly important?! But, but all she said... ...was that she heard nothing!\nRyunosuke:\nYes! Which is the profoundly important point! I'm almost sure of it!\nJudge:\n...Hm, I'm almost sure that I don't understand the inner workings of your Eastern mind, Counsel. Nevertheless... Miss Gina Lestrade! You will supplement your formal testimony by repeating that last statement, please.\nGina:\nWot? Supperment? Wot are you on about? Don't gimme all your fancy talk! I know wot yer tryin' to do! Well it won't work on me!\nRyunosuke:\n(That's right, insult the judge. Always a good move...)\nAdds statement \"I was strainin' me ears to work out wot was goin' on, but all I could 'ear was snorin'.\"\n\n\n\nRyunosuke:\n(Why doesn't she just stick to picking people's pockets in the open, then? I'd say there's some reason that she's not letting on, judging from her demeanour.)\nGina:\nSo anyways, I was a bit scared, but I 'ad to just stick it out under there. Nuffin' else for it.Gina:\nI was strainin' me ears to work out wot was goin' on, but all I could 'ear was snorin'.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nSo you were straining to hear what was happening the entire time? Since the moment you hid yourself?\nGina:\nUm... Not exactly, no.\nRyunosuke:\nSorry?\nGina:\nWell, there was no one in the cabin to start wiv. I could just push the cushion up and 'ave a butcher's to see wot was wot. But then, when I saw this swell gettin' on, I got me 'ead down so 'e didn't notice me.\nRyunosuke:\nAnd Mr McGilded sat on the seat under which you were hiding, correct?\nGina:\nYeah! Would you Adam an' Eve it, eh?! Wot a mug! So then all I could I [sic] do was listen. I was waitin' to jump out o' there as soon as I 'eard 'im leave, see. But would 'e? Not likely! Even though he stopped 'ere an' there, I never 'eard the door open. So I just 'ad to stay put an' listen to 'im drivin' 'is pigs to market. Snorin' like an old dog, 'e was.\nMcGilded:\n.........\nRyunosuke:\n(Hm, are there any conclusions we can draw from that, I wonder?)\n\n\n\nIt makes sense\n\n\n\n\n\n\n\nRyunosuke:\n......... Well, that all seems to make sense.\nJudge:\nYou took your time reaching that conclusion, Counsel.\nVan Zieks:\n...Heh.\nRyunosuke:\n(What was that from van Zieks? ...Is he...laughing?)\nJudge:\nVery well, then. Continue with the cross-examination.\nLeads back to cross-examination\n\n\n\n\nIt doesn't add up\n\n\n\n\n\n\n\nRyunosuke:\nMiss Lestrade! What you have just told the court... ...is clearly at odds with the facts!\nGina:\nAh!\nJudge:\nAt odds?! Are, are you sure, man?\nRyunosuke:\nAbsolutely.\nVan Zieks:\nIt seems my learned Nipponese friend is not as dull-witted as I feared.\nRyunosuke:\n(So van Zieks realised it too...)\nJudge:\nCounsel! I must insist that you bolster your claim with evidence! Or some complicit party's name at the very least!\nRyunosuke:\nYes, My Lord!\nJudge:\nI expect you to demonstrate this alleged contradiction to the court.\nRyunosuke:\n(According to Miss Lestrade, whilst she was hiding in the omnibus that night... ...she heard nothing but the sound of Mr McGilded snoring. But think, Ryunosuke, think! There's something else she should have heard...)\n\n\n\nShow a piece of evidence\n\n\n\n\n\n\n\nRyunosuke:\nVery well, My Lord. Allow me to elaborate... ...on a particular sound that Miss Lestrade could not have failed to hear on the night in question. The sound very clearly explained by the following piece of evidence! \n\n\n\nPresent anything\n\n\n\n\n\n\n\nRyunosuke:\n\nVan Zieks:\nIt would seem phantoms are at work again. This time in my Nipponese friend's ears.\nJudge:\nI concur. No sound is apparent to me at all.\nRyunosuke:\nOh...\nVan Zieks:\nAllow me to introduce you to a sound that will be very real indeed, however. The sound of your death throes!\nRyunosuke:\nGaaargh! (Ugh... He's right. That was loud...)\nJudge:\nWell then, Counsel?\nLeads back to:\n\"According to Miss Lestrade, whilst she was hiding in the omnibus that night...\"\n\n\n\n\n\nShow a person\n\n\n\n\n\n\n\nRyunosuke:\nVery well, My Lord. Allow me to elaborate... ...on a particular sound that Miss Lestrade could not have failed to hear on the night in question. The sound very clearly explained by the presence of the following person! \n\n\n\nPresent 'Thrice-Fired' Mason profile\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"'Thrice-Fired' Mason...?\"\n\n\n\n\nPresent anyone else\n\n\n\n\n\n\n\nRyunosuke:\n\nVan Zieks:\nIt would seem phantoms are at work again. This time in my Nipponese friend's ears.\nJudge:\nI concur. No sound is apparent to me at all.\nRyunosuke:\nOh...\nVan Zieks:\nAllow me to introduce you to a sound that will be very real indeed, however. The sound of your death throes!\nRyunosuke:\nGaaargh! (Ugh... He's right. That was loud...)\nJudge:\nWell then, Counsel?\nLeads back to:\n\"According to Miss Lestrade, whilst she was hiding in the omnibus that night...\"\n\n\n\n\n\nForget it\n\n\n\n\n\n\n\nRyunosuke:\n(Hm... I just can't seem to think this through...) Sorry, My Lord. I need to withdraw the allegation for now.\nVan Zieks:\n...What you need, Counsel, is to withdraw forever.\nRyunosuke:\nUgh...\nJudge:\nSo be it. Continue with the cross-examination.\nLeads back to cross-examinationGina:\nThen after a while, I 'ear this loud bang. Nearly jumped out me skin, I did. An' the scream just...came out.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nWhen you say a 'loud bang', do you mean the noise of someone falling to the floor?\nGina:\n......... Could've been...I s'pose. I...don't remember so well. Point is, it made me jump.\nRyunosuke:\nAnd you let out a scream, involuntarily?\nGina:\nThat's right. And then I felt the cushion over me 'ead get lighter all of a sudden.\nRyunosuke:\nPresumably when the defendant got up in order to help the victim, yes.\nVan Zieks:\n...Or not. It could equally have been the moment the accused stood in order to stab his victim...could it not?\nJudge:\nWell, girl? Did you see what happened at that crucial moment?\nGina:\n......... Yeah, I saw it.\nRyunosuke:\n...!\nGina:\nI pushed up the cushion and 'ad a quick butcher's while I 'ad the chance, didn't I? The Irishman was sittin' up the bloke wot 'ad fallen on the floor on the seat opposite.\nSusato:\nThat matches Mr McGilded's account, of course.\nGina:\nBut then! The fella suddenly turns around an' looks right at me! I sunk back down again, but it was too late by then. I should never 'ave risked lookin'...Gina:\nIt's because o' that, this swell found me. ...'E did 'elp me get away, mind.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nAnd when Mr McGilded discovered you, he pulled you out from your hiding place?\nGina:\nI was scared stiff, I was. 'E dragged me out and sat me down on the seat an' all.\nRyunosuke:\nNext to the victim, Mr Mason?\nGina:\nYeah... The bloke 'ad a knife in 'is guts. 'E was...still bleedin'. Then the carriage lurched a bit, and 'e ended up fallin' onto me.\nSusato:\nUgh... How awful...\nGina:\nBoth me 'ands got covered in blood. It made me feel sick as a dog.\nRyunosuke:\n(Both her hands covered in blood... That must be what the rooftop passengers saw.) After that, I believe you talked with Mr McGilded for a while. Is that correct?\nGina:\n...'E asked me some stuff. Wanted to know me name an' wot I was up to an' that. Then I 'eard somefin' from up above. Someone screamed.\nJudge:\nYes, Mr Furst on the roof deck, one would presume.\nGina:\nWell I didn't want no one seein' me face, so I didn't look up. Then the 'orses were drawn up smartish and this 'ere Irishman says to me: 'Get back under the seat. I'll see that you can get away later.'\nJudge:\nHm...Susato:\nAll six members of the jury had decided the defendant was innocent.Ryunosuke:\nFor one brief shining moment, yes...Susato:\nIt's clear that they are all still very unsure. If we could just find some conclusive piece of evidence among this new testimony... ...I'm sure we would clinch the verdict we want!Ryunosuke:\nYes, I think you're right. (And I have this niggling feeling... Something's bothering me...but I just can't quite put my finger on it.)Judge:\n'Thrice-Fired' Mason...?Ryunosuke:\nYes, My Lord. The sound that Miss Lestrade cannot have failed to hear... ...is that of the victim, Mr Mason, boarding the omnibus!Judge:\nOrdaaar! Ordaaar! Explain your reasoning, Counsel!Ryunosuke:\nMiss Lestrade, allow me to confirm something. You claimed earlier that you were the first person on board the omnibus. Is that correct?Gina:\nYeah, 'course I was! I got on while the driver was in the pub, didn't I?Ryunosuke:\nAnd...the next person to board the omnibus was Mr McGilded?McGilded:\nThat it was. Not a soul was in the cabin when I climbed aboard. ...At least, not in plain sight.Ryunosuke:\nSo you were, to all intents and purposes, alone in the enclosed cabin of the omnibus at that time?McGilded:\nDid I not just say as much? I wasn't travellin' with anyone else, if that's what you mean.Gina:\nYeah, I saw 'im get on, remember? Through the crack under the seat cushion. 'E was on 'is own for sure.Ryunosuke:\nAnd, from what we've heard, the carriage made a number of stops after that on its onward journey. ...During which time, did you not hear the door opening or closing at all?Gina:\nNah, I never 'eard it. That's exactly wot I was listenin' for, weren't it? Waitin' for this swell to leave.Ryunosuke:\nIn which case... ...when and how did the victim end up in the carriage?Judge:\nAh!Ryunosuke:\nWe know that the victim collapsed inside the enclosed cabin of the omnibus. Therefore... ...Miss Lestrade's statement about what she did - or did not - hear...is at odds with the facts!Gina:\nAh!Van Zieks:\nYes. This petty thief's statement was clearly flawed.Judge:\nLord van Zieks!Ryunosuke:\n(Yes... He knew. He knew all too well that there was an inconsistency in Miss Lestrade's statement.)Van Zieks:\nKeh...heh...heh... It would seem words of thanks are in order for my learned friend.Ryunosuke:\nWhat are you talking about?Van Zieks:\nYou have demonstrated matters impeccably. This witness, and her...colourful statements... ...are entirely unreliable! Her words are convenient untruths, nothing more!He's dead right...How could the victim possibly not have boarded the omnibus? That makes no sense whatsoever...And this girl is a pickpocket. Let's not forget that.Ryunosuke:\nAgh! (She, she didn't even say anything!)Juror No. 6:\nI didn't want to judge the dear little mite just because she has some rather naughty ways. But I must say... ...I can't abide liars.Juror No. 1:\nAnd neither can I!Ryunosuke:\nM-Mr Foreman!Juror No. 1:\nI didn't want to judge the girl just because she has some less than salubrious ways. But I must say... ...I cannot abide liars.Ryunosuke:\nArgh!Susato:\nMr Naruhodo! That's five jury members leaning towards guilty!Van Zieks:\n...Well, your consideration for others is...refreshing, my Nipponese friend. To the considerable troubles you have spared me! ...Yes, very refreshing.Ryunosuke:\nAAAAAAAAAAAAAAAAAAGH!McGilded:\nGAAAAAARGH! What are ye playin' at?! Have ye forgotten who you're workin' for, ye useless Eastern amadan!Juror No. 3:\n...This is carnage! It's perfect!Ryunosuke:\n(Juror number two is the only one left...)Susato:\nMr Naruhodo! The way this is going...Ryunosuke:\n(I know. If we can't find some new way to convince everyone of Mr McGilded's innocence... ...the judge will rule and we'll have lost!)Juror No. 2:\nI very much wanted to believe the words of one of London's most respected gentlemen. But... ...those of us in service know we must accept hard truths.Ryunosuke:Ryunosuke:\nYes, the witness's last statement seems to have revealed a critical inconsistency in her story. However! If we consider the possibility that her statement is in fact the truth... ...it may shed an entirely new light on this whole case!Van Zieks:\nWhat are you saying?Gina:\n...!McGilded:\nCounseeel!Juror No. 2:\nI'm...sorry, sir? Whatever do you mean?Judge:\nCounsel, I will not tolerate you attempting to prorogue my adjudication! Explain yourself at once!Ryunosuke:\n...!Van Zieks:\nWhen the accused boarded the omnibus on the night in question, the victim was nowhere to be seen. Subsequently... ...the carriage door was not heard opening a single time, as testified by the witness in the stand.Judge:\nAnd yet the victim's body was found inside the carriage.Van Zieks:\nIF this petty thief's words are to be believed... ...how do you explain the victim's miraculous appearance inside the cabin of the omnibus?Ryunosuke:\n......... There's only one way to explain how the victim came to be inside the carriage...He was in there already\n\n\n\n\n\n\n\nRyunosuke:\nClearly he was in there already from beforehand!\nVan Zieks:\n \nVan Zieks:\nTell me, my learned friend...what was the function of that 'clearly' in your last sentence?\nRyunosuke:\nHm?\nJudge:\nWell said, Lord van Zieks. The 'clearly' is troubling me also.\nRyunosuke:\nNo, no! That's really not the point! The point is that the victim must have been in the carriage from beforehand.\nVan Zieks:\nThen answer me this... By 'beforehand', to what specific point in time are you referring?\nRyunosuke:\n......... Well...clearly...erm...\nJudge:\nI shall have to penalise the defence heavily for this irrelevant rambling.\nRyunosuke:\n(Ugh...I must learn to ramble more relevantly...) \nVan Zieks:\nThe penalty is evidently not heavy enough...judging from those Nipponese eyes. So I ask you again...\nLeads back to:\n\"IF this petty thief's words are to be believed...\"There's another entrance\n\n\n\n\n\n\n\nLeads to:\n\"If the door wasn't opened even once...\"He was put there after he died\n\n\n\n\n\n\n\nRyunosuke:\nObviously, the victim must have been placed in the carriage AFTER he was killed!\nVan Zieks:\n \nVan Zieks:\nTell me, my learned friend...what was the function of that 'obviously' in your last sentence?\nRyunosuke:\nHm?\nJudge:\nWell said, Lord van Zieks. The 'obviously' is troubling me also.\nRyunosuke:\nNo, no! That's really not the point! The point is that the victim must have been moved into the carriage afterwards.\nVan Zieks:\nThen answer me this... How could a cadaver have been placed inside a moving carriage?\nRyunosuke:\n......... Well...obviously...erm...\nJudge:\nI shall have to penalise the defence heavily for this irrelevant rambling.\nRyunosuke:\n(Ugh...I must learn to ramble more relevantly...) \nVan Zieks:\nThe penalty is evidently not heavy enough...judging from those Nipponese eyes. So I ask you again...\nLeads back to:\n\"IF this petty thief's words are to be believed...\"Ryunosuke:\nIf the door wasn't opened even once... ...the only explanation is that the victim...entered the enclosed cabin some other way!Van Zieks:Van Zieks:\n...I wondered what new fantasy you would come up with in your blind panic. But behold! The omnibus is here for all to see. Only one side of the enclosed cabin is furnished with a door. The other has only windows. Fixed windows, which cannot possibly open. In short... ...there is no entrance to the cabin other than the door!Ryunosuke:Ryunosuke:\nBut there could be! There's one possibility you haven't considered.Van Zieks:\nOh really?Ryunosuke:\nYes. One other way inside that isn't the door. Another opening, the use of which allowed the victim to 'appear' inside the enclosed cabin!Van Zieks:\n...!McGilded:\n...!Gina:\n...!Judge:\nAlright, Counsel. The defence will identify the location for the court. Here is the omnibus on which the incident occurred. Where on earth is this 'entrance' by which you propose the victim entered the cabin?Present skylight\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"The answer is obvious! It can only have been the skylight!\"Present anywhere else\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nIt must have been here! This is how the victim came to be inside the cabin!\nVan Zieks:\n...Humour me a moment while I consider your answer. You propose that it is possible to enter this omnibus without using the door, despite the windows being fixed.\nRyunosuke:\nI, I do, yes...\nVan Zieks:\nWell, if you believe such a thing to be possible, pray, do demonstrate. And here's to you remaining inside...until the carriage has taken you back to the port for your inevitable departure.\nRyunosuke:\n...I'd like to stay here and try again, if it's all the same to you...\nLeads back to:\n\"Alright, Counsel.\"Ryunosuke:\nThe answer is obvious! It can only have been the skylight!Judge:\nI say! The skylight?Van Zieks:Van Zieks:\nYour ludicrous proposal almost has me lost for words. However-Ryunosuke:Ryunosuke:\nThe skylight may well be large enough for someone to pass through!Van Zieks:Van Zieks:\nSo you claim! But do you have a shred of evidence to support your addle-brained theory?Ryunosuke:\n......... Both Mr McGilded and Miss Lestrade said the same in their testimonies... They each claim to have heard a loud thud, such as the noise made by someone falling to the floor.Judge:\nYes, which has already been explained... ...as the sound of the victim falling from his seat having been assaulted with the dagger.Ryunosuke:\nYes, it has. But! Would a man slipping from the seat onto the floor really have made such a loud noise as the witnesses describe? A noise loud enough to cause Miss Lestrade let out an involuntary cry, in fact...Judge:\nGood, good gracious!Ryunosuke:\nPerhaps in fact... ...that was the moment that the victim made his entrance into the cabin. No, let me rephrase that: The victim didn't enter the cabin as such... He fell into it!Van Zieks:Van Zieks:\nYou're now suggesting...that the victim fell from the skylight into the cabin? That's simply impossible!Ryunosuke:\nHow can you be so sure?Van Zieks:\nBecause if the victim had fallen inside through the skylight as you say... ...the passengers on the roof deck would have seen it happen. And yet...not one person made mention of such events in their testimony.Ryunosuke:\nWell, um... Yes...that's true, but...McGilded:McGilded:\nMight a humble fella...make a wee comment here?Ryunosuke:\nMr, Mr McGilded?!McGilded:\n...To be sure now, the two fellas who were sat on the roof that testified afore... ...said nuttin' of the victim fallin' through the skylight. But...it seems to me, My Lord, that 'tis not so much a case of them not sayin', but... ...Aye... ...'tis a case of them bein' unable to say.Ryunosuke:\nWha...?McGilded:\nI tink perhaps the two fellas... ...do be havin' sometin' of a compellin' reason not to mention what happened. Would youse not agree...fine ladies and gentlemen of the jury?Juror No. 1:\nHmmmmmmph!Juror No. 2:\nOh my...my goodness! Surely not...Juror No. 3:\nThose two chaps on the roof...?Juror No. 5:\nYou mean, the ones who stuck that knife in the man were...?Juror No. 6:\nAaaaaagh!???:Fairplay:\nJust what exactly are you insinuating here, you...you blitherer?!Furst:\nYou rotter, he said! You rotter! What are you insinuating?Fairplay:\nThis is a flaming outrage! I've a good mind to give you a blinker in a minute!Furst:\nHe'll give you a shiner in a minute, he said! And so will I!Ryunosuke:\nMr Fairplay!Fairplay:\nYou're effectively accusing me - a city gentleman and well-respected banker!Furst:\nAnd me! A, a very angry hatter!Fairplay:\nSuggesting that someone like me could have stabbed that man in the guts, it's...it's... It's a disgrace! It's scandalous! It's...ARGH! I protest! I protest in the strongest possible terms!Furst:\nThat's right! I protest, too! About you, you rotten scoundrel!Judge:\nOrdaaar! Ordaaar! Ordaaaaaar!!! This is not the time, witnesses! I will not permit this wanton invasion of the stand! Return to the anteroom at once!Fairplay:\nBut, but this is beyond reason, My Lord! Argh! It's outrageous!Furst:\nIt's, it's very hurtful, you know!Van Zieks:\nMy Lord, if I may comment?Judge:\nGo ahead, Lord van Zieks.Van Zieks:\nIt was the defence that incited this outburst from the witnesses. My learned friend has seen fit to abandon all protocol and accuse the witnesses without proof.Ryunosuke:\nA-Accuse? I, I never intended to...Van Zieks:\n...It seems, young Nipponese, that your command of the English tongue is wanting.Ryunosuke:\n...!Van Zieks:\nYou proposed to this court that the victim fell through the skylight from the roof deck of the omnibus. That hypothesis cannot possibly stand without the rooftop passengers being aware of the events. You have branded these gentlemen liars! You have intimated their criminal guilt! In our British courts of law, that is what is termed a baseless accusation!Ryunosuke:\n...! (I know I was rash to put this idea forward without any actual evidence, but... ...you can't just dismiss it without a second thought!)Juror No. 3:\nWhat are we wasting time for? Get them to - Hnurgh! - testify!Ryunosuke:\n...!Juror No. 1:\nI thought there was something fishy about that hat from the moment I laid eyes on the fellow!Juror No. 5:\nWe have to see this matter through now. One way or another!Juror No. 2:\nIf there's filth and rubbish in our midst, we must dispose of it at once!Tes-ti-fy! Tes-ti-fy! Tes-ti-fy!Susato:\nWhat's...what's happening, Mr Naruhodo?Ryunosuke:\nThe spectators in the public gallery are... They're in a complete frenzy!Judge:\nMr Fairplay and Mr Furst...Fairplay:\nUm...My Lord...?Judge:\nYou... You will take the stand again and make another formal testimony... ...in reference to the indictment brought by the defence!Fairplay:\nUm... Y-Yes...My Lord...Furst:\nI, I didn't come here for this...McGilded:\n.........Ryunosuke:\n(There's no time to think this through. All I can do...is keeping [sic] pushing forward!)Witness Testimony\n- Refuting the Accusation -Fairplay:\nWe were the only two people up on that roof deck, dead or alive! ...I can swear to that!Furst:\nIf anything had happened where we were sitting, don't you think one or the other of us would have noticed?Fairplay:\nIn any case, neither of us know the first thing about the victim. We had no reason to kill the man!Furst:\nThe skylight was shut the entire time, I tell you! We couldn't possibly have opened it!Fairplay:\nIf you're so sure the victim fell through the skylight, where's your proof?Judge:\nHm... I must say that on listening to this testimony, it is somewhat hard to imagine... ...how either witness could have performed any malevolent act on this open rooftop deck... ...without the other noticing forthwith.Fairplay:\nThat's right, you see!Furst:\nWe're innocent, I tell you!Juror No. 4:\n...Although logically, of course, the argument falls down if the two of you were in collusion with one another.Fairplay:\nWhat?!Furst:\nEh?!Van Zieks:\nAccording to investigations by Scotland Yard... ...the two witnesses share no common dealings.Juror No. 3:\nHah! Well I don't trust coppers any more than I trust the stinking rich!Ryunosuke:\n(Something doesn't feel right here... The trial is going in our favour, really. So why do I feel so uneasy...?)Judge:\nCounsel for the Defence, over to you. Your cross-examination, please.Ryunosuke:\nOh! Yes...My Lord!Cross-Examination\n- Refuting the Accusation -",
      "testimonies": [
        {
          "testimony": "We were the only two people up on that roof deck, dead or alive! ...I can swear to that!",
          "person": "Fairplay",
          "present": []
        },
        {
          "testimony": "If anything had happened where we were sitting, don't you think one or the other of us would have noticed?",
          "person": "Furst",
          "present": []
        },
        {
          "testimony": "In any case, neither of us know the first thing about the victim. We had no reason to kill the man!",
          "person": "Fairplay",
          "present": []
        },
        {
          "testimony": "The skylight was shut the entire time, I tell you! We couldn't possibly have opened it!",
          "person": "Furst",
          "present": []
        },
        {
          "testimony": "If you're so sure the victim fell through the skylight, where's your proof?",
          "person": "Fairplay",
          "present": [
            "Omnibus"
          ],
          "source": {
            "evidence_span": "The scene of the crime. There is a bloodstain visible on the frame of the skylight when it's open.",
            "testimony_span": "If you're so sure the victim fell through the skylight, where's your proof?",
            "explanation": "If there is a bloodstain on the frame of the skylight, and the skylight cannot be open from the inside, it must be someone on the roof opened the skylight and throw the body in.",
            "is_self_contained": "no",
            "context_span": "And there doesn't appear to be a handle or catch of any description... So I suppose it can't be opened from inside the cabin at least."
          }
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Fairplay and Furst are testifying about the possibility that the victim fell through the skylight.",
      "labels": [
        "physical"
      ],
      "reasoning": [
        "Fact 1: The witness asks for the proof that the victim fell through the skylight.",
        "Fact 2: The evidence suggests there is blood stain on the frame of the skylight when it is open.",
        "Fact 3: The context suggests the skylight can only be open from the top.",
        "Prop 1: If there is bloodstain on the skylight when it is open, then the body must have hit the skylight when it is open.",
        "Prop 2: If something hit the skylight when it is open, and the skylight can only be open from the top, then it means the body was above the carrage."
      ]
    }
  ]
}