{
  "previousContext": "",
  "characters": [
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Yujin Mikotoba",
      "age": "43",
      "description1": "A medical professor at the Imperial Yumei University. He is an authority in forensic science in charge of the university's laboratory. He also happens to be my father."
    },
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Rei Membami",
      "age": "16",
      "description1": "An assistant to my father in his laboratory at the Imperial Yumei University. She's my best friend, and considers herself very much indebted to the late Dr John Wilson."
    },
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Jezaille Brett",
      "age": "25",
      "description1": "The victim of the case who was a former British exchange student. Nine months ago, she was found guilty of the murder of visiting professor Dr John Wilson."
    },
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Taketsuchi Auchi",
      "age": "52",
      "description1": "The lead prosecutor of this case, who appears to be struggling to accept the changes afoot as a result of these turbulent new times in Japan - the Meiji era."
    },
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Satoru Hosonaga",
      "age": "30",
      "description1": "A chief inspector in the Imperial Police Bureau who was surreptitiously submerged in the sea in order to keep watch over Miss Brett. He was present at the time of her murder."
    },
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Soseki Natsume",
      "age": "33",
      "description1": "A former visiting student to the British empire who returned to Japan after a spell of bad luck with the law. He's now a successful author and a witness in the current case."
    },
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Raiten Menimemo",
      "age": "38",
      "description1": "A journalist for the Shoyu News who's currently following Soseki-san everywhere, reporting on his every move. As a result, he's an eyewitness to the incident."
    }
  ],
  "evidences": [
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Post-Mortem Report",
      "type": "",
      "obtained": "",
      "description1": "Time of death just after 2 p.m. Death is believed to be due to trauma to the victim's lung from a knife blade. Only a single wound was identified."
    },
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Crime Scene Photograph",
      "type": "",
      "obtained": "",
      "description1": "A photographic print of the scene taken by police just after the incident occurred. The stab wound in the victim's back is clearly visible."
    },
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Soseki Natsume Article",
      "type": "",
      "obtained": "",
      "description1": "A newspaper containing an article about a discussion between my father and Soseki-san. The debate became quite spirited."
    },
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Fountain Pen",
      "type": "",
      "obtained": "",
      "description1": "The pen that the victim was found grasping in her hand. It carries the initials 'R.M.'.",
      "description2": "The fountain pen that the victim was found grasping in her hand. It carries the initials 'R.M.' as well as an emblem of some description.",
      "description3": "A fountain pen bearing the initials 'R.M.' and an emblem of some description. There is a very small amount of liquid still inside the ink reservoir."
    },
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Poison Article",
      "type": "",
      "obtained": "",
      "description1": "An article about poison that was stolen from a laboratory at Yumei University. Even my father, who is responsible for the lab, knew nothing of the incident.",
      "description2": "An article about poison that was stolen from a laboratory at Yumei University. The reporter, Menimemo-san, based it on information he gleaned by eavesdropping. The article reveals the following property about the poison in question: When the toxin enters the body on a knife laced with the poison, it's rapidly absorbed and causes death in minutes. In the newspaper article, there's the following information about the stolen poison: 'Onset of symptoms occurs in minutes...ending with acute contraction of the pupils prior to death."
    },
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Incriminating Photograph",
      "type": "",
      "obtained": "",
      "description1": "A photographic print taken at the moment the victim was attacked. My friend Rei can be seen kneeling over Miss Brett."
    },
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Chemical Reagent",
      "type": "",
      "obtained": "",
      "description1": "A special indicator solution for a new poison under development by my father's team. It's been created in strict secrecy and exists only in my father's laboratory."
    },
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Murder Weapon",
      "type": "",
      "obtained": "",
      "description1": "A small knife from the scene of the crime that was found in the victim's back. No trace of poison was found on the blade."
    },
    {
      "currentChapter": "The Adventure of the Blossoming Attorney",
      "name": "Beach Hut Plan",
      "type": "",
      "obtained": "",
      "description1": "A plan of the layout of the small beach hut where the victim was found."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "The Adventure of the Blossoming Attorney\n\n\n\n\n\n\n\n\n\nTranscriptRendered cutscene\nSusato:\nStanding here in the bright sunshine, looking out over the vast ocean... ...those days in London seem like a dream. But I do miss my time in England's vast capital... You know...he's flourished into a truly wonderful lawyer. I've no doubt that at this very moment, he's fighting some noble cause in court. Forgive me for taking so long to come to visit you. My life has been such a whirlwind since I returned. And no one could have predicted what has happened. Just two months after arriving home... ...I find myself faced with another awful crime. So I came here today to ask something of you. Tomorrow, I shall be standing in court. For the only time in my life... ...as a lawyer. So please...I ask for your guidance. ...Kazuma-sama.Episode I\nThe Adventure of the Blossoming Attorney13th August, 8:26 a.m.\nSupreme Court of Judicature, Defendants' Antechamber 3Susato:\n(Here I am again after nine months... The Supreme Court of Judicature of Japan. I feel so nervous. But I must steel my nerves and find a way to compose myself.)Mikotoba:\nAh good, you're here. It doesn't do for a lawyer to be late.Susato:\nOh! Yes, um... Good morning, sir!Mikotoba:\nI hardly recognise you. You cut a fine figure, Counsel. But you look as white as a sheet. And those wide eyes aren't doing you any favours, either.Susato:\nOh dear... The truth is...I'm so incredibly nervous, I feel utterly nauseated. I almost wish that I'd never been born.Mikotoba:\nGoodness. Not the sort of thing a father hopes to hear from his daughter, I must say.Susato:\n(...Yujin Mikotoba. Professor of Medicine at the Imperial Yumei University. A man who, earlier in his life, travelled to Great Britain to study the latest advances in forensic medical science. And of course...my brilliant father.)???:\n...Um, excuse me... Would I be correct in thinking that you're to be my lawyer in court today?Susato:\nHm... Oh! Um...yes. Yes, that's right...miss!???:\nWell...I, um... I want to thank you for agreeing to represent me! I swear... I swear on my life... ...it's a complete fabrication! This whole thing!Susato:\n(...Rei Membami. Born the same year as I, and my greatest friend. Though unusual for a woman in our time, she works at the university research laboratory, helping my father. And sadly...she's the defendant in today's trial. Accused of committing a truly awful murder.)Susato:\nAre you feeling alright? Since we started talking, you seem...well, to have become a little flushed.Rei:\nOh my! Um...well...erm... It's just that... ...you look so gallant and dashing.Susato:\nSorry?Rei:\nAnd when I fall under your intense gaze, it... Well, it makes me feel rather bashful.Susato:\n......... (Goodness... I don't think she knows. She hasn't realised who I am.)Mikotoba:\nWa ha ha ha ha! It would seem our little plan for this trial is going to work.Rei:\nOh! What, what do you mean, Professor Mikotoba?Mikotoba:\nIf even your best friend can't see through the disguise, I think we can relax.Rei:\nDisguise...?Susato:\nYes... I've never tried dressing this way before, of course, so I wasn't sure how convincing it would be. But this does make me feel a little relieved, as you say, Father.Rei:\nF-Father? ......... WHAAAAAA?! Is, is that...? Is that you, Susato?Susato:\nI'm so sorry I didn't say something sooner, Rei. It's just that-Rei:\nNOOOOOOOOO! What are you doing? What's going on? What what what what what? That varsity uniform! That varsity cap! That varsity cape! That varsity badge! Look at you! You look for all the world just like a student of the Imperial Yumei University! A male student!Susato:\n...I'm so glad you think so. It means all my preparations have been worthwhile. I woke at four this morning to make a start.Rei:\nBut, but I don't understand. Why are you dressed like that?Susato:\nWell...you see...Mikotoba:\nIt was the only way. The only way she would be permitted into the Supreme Court to take on your defence in this trial.Rei:\nMy... My defence?Susato:\n......... (Never before in my life have I felt so frustrated at having been born into this body. Courts in Japan are barred to women. We're not even allowed to set foot inside the courtroom. Despite the fact that the laws of the land apply to all people - male and female - alike...)Rei:\nBut...women are forbidden...Susato:\nJust for today, I'll be leaving my true self at the courtroom door. So that I can act as your lawyer.Rei:\nOh, Susato... You'd go to such lengths for me?Susato:\nOf course. You're my greatest friend. I just worry that I shan't be the lawyer you deserve.Rei:\nOh no! I have complete faith in you!Susato:\nRei...Rei:\n......... It's so strange, though. I mean, you're such an accomplished judicial assistant already. And yet just because you're a woman... What a wretched reason! I mean, why shouldn't you be allowed in court?! ...You're so gallant and dashing!Susato:\nUm...Rei... ...please don't look at me like that, with those flushed cheeks and doting eyes.Rei:\nOh! I'm, I'm sorry. It's just...you really do look so dashing...Susato:\nY-Yes, you mentioned that once or twice.Mikotoba:\nWa ha ha ha ha! You should be pleased. It means you look convincing as a man.Susato:\nI am pleased...I think. It's certainly helped to bolster my confidence today. (Rei... You're managing to put on a brave face in all this, but I can see through it. I've noticed how your shoulders are slumped and how you're trembling ever so slightly.)Rei:\nSusato... ...you...do believe me, don't you? I didn't do it. I, I couldn't have! I mean...murder...Susato:\nOf course. You have nothing to worry about. Your conscience is perfectly clean! ...Isn't that right?Rei:\nYes...yes it is. Perfectly clean!Susato:\nI have absolutely no doubt in my mind about your innocence. Which is why I'll stand by you until the bitter end in this trial. Whatever happens...I'll always be on your side! (Because that's what it means to be a defence lawyer!)Rei:\nThat means so much to me, Susato.Bailiff:\nDefendant! Counsel! Court is about to begin. Proceed to the courtroom at once!Mikotoba:\nYou should go in at once, Rei. If you're late, the judge won't hesitate to pronounce you guilty.Rei:\nOh... STAND ASIIIIIIDE!Susato:\n(I don't think I've ever seen her run so fast...)Mikotoba:\n...Well, Susato, you've certainly surprised your father. Going to such lengths to be admitted into the courtroom, and with no prior experience of being a lawyer...Susato:\nThere was simply no other way. That's all there is to it. But Father... ...you haven't told her, have you? I mean, I'm right in assuming that Rei doesn't know how it came to this?Mikotoba:\nYes, quite right. I've kept that information from her. It would only worry her if she found out that no other lawyer would agree to take her case. I didn't want to burden her with that.Susato:\nAnd is it true? The reason why every other lawyer is refusing to take the case? Is it really because of who the victim was?Mikotoba:\n......... We should be making a move now, too. As you know, law isn't my field, but I'll do what I can to support my student.Susato:\nThank you, Father. (I'm Susato Mikotoba, a judicial assistant. Eight months ago, I accompanied a student of law on a study trip to Great Britain. But two months ago, due to unforeseen circumstances, I found myself back in Japan.)How many times have I wished that he were here, I wonder? Still...I have no choice now but to steel myself for the trial ahead. Wish me luck...Naruhodo-san.13th August, 9:00 a.m.\nSupreme Court of Judicature, Courtroom 1Judge:\nThis court is now in session to hear the trial of Rei Membami.Auchi:\nThe prosecution is fully ready to proceed, Your Excellency.???:\n.........Judge:\nDefence Counsel! Are you ready?Mikotoba:\nYes, Your Excellency. We are ready.???:\nReady!Judge:\n......... Ah yes, Counsel... ...according to your registration details, your name is... erm... ...Ryutaro Naruhodo. Is that correct?Ryutaro:\n......... Sorry?Mikotoba:\nOh yes...I had to come up with a suitable male name for you for this little venture. So I'm afraid to say I simply put down the first name that sprung to mind.Judge:\nWell, Counsel?Ryutaro:\nAh! Um, yes, that's right! That's me. I'm, erm... I mean... Yes! I am Ryutaro, he who has vowed to uphold the pride of the great Naruhodo clan!Judge:\nAh...Mikotoba:\nIt seems Ryutaro may need to consider how to better uphold his manly act first and not overdo it. And those wild, wide eyes aren't doing you any favours, either. Just relax, and listen...Rei:\nNaru...hodo...?Auchi:\nA fresh face in this courtroom, if I'm not mistaken. But the name 'Naruhodo'... Would that perchance be...?Mikotoba:\nYou may be thinking of Ryunosuke Naruhodo, currently in Britain as part of a study programme. This is, um...Ryutaro:\n...His cousin!Mikotoba:\nThat's right. Ryutaro here has been studying in the provinces, but was called to the capital for this trial. I assure you, in matters of law, his knowledge rivals that of any of Tokyo's pre-eminent lawyers.Ryutaro:\nAny of them!Auchi:\nTut tut tut. What a pitiful situation. Having been rejected by every lawyer in the capital, the accused has had to call in a country boy.Rei:\nHow dare you?! Susato is every bit as gallant and dashing as any of your Tokyo attorneys! I won't have you making fun of her!Auchi:\n...'Her'?Rei:\nOh! Um, er...Ryutaro:\n(Please be careful, Rei...)Auchi:\nTsh huh huh... What an unrefined tomboy we have here. But I wonder...is your 'gallant and dashing' lawyer up to the challenge of defending you? His wide, skittish eyes very much suggest that he is not.Ryutaro:\n(Ugh...I'm so nervous... Now that I'm standing in his shoes, I'm starting to understand what Naruhodo-san goes through. Like it or not, eyes are wont to flit!)Judge:\nThe case to be heard on this day is a matter of great significance to our national interests. In fact, it would be reasonable to assume that the outcome of this trial may well affect the very future of our empire.Auchi:\n...Just like the trial nine months ago. And yet for proceedings of such importance, we have this...unknown yokel by the dock? Dear me.Judge:\nHmph. Perhaps this would be an appropriate moment for me to assess the defence. To determine whether you are sufficiently competent to practise in this courtroom.Mikotoba:\nNine months ago, when a certain other Naruhodo stood where you're standing now... ...this same judge tested him as well. And even though he was just a student at the time - not even of law - he passed the test with flying colours. For a trained and experienced judicial assistant like you, this will be easy.Judge:\nSo, Counsel...do you consent to answering some simple questions?Ryutaro:\n......... (Alright, it's time to prove myself.) Yes, Your Excellency! (But please do make them simple!)Judge:\nVery well. To start with... ...you will state the name of the victim.Ryutaro:\n(Whew, that is simple. I couldn't forget that if I tried.) ......... Ah.Mikotoba:\nWhat's the matter?Ryutaro:\n(Now that I'm standing in his shoes, I'm starting to understand something else Naruhodo-san goes through. Like it or not, minds are wont to blank!)Mikotoba:\nIt's not surprising, really. It's your first time in this position and...in that guise. Even a bright spark like you is bound to flicker and falter a little under the circumstances.Ryutaro:\nOh dear...this is a dismal failure...Mikotoba:\nDon't fret. You need only use the knowledge you've gained as a judicial assistant to overcome the problem.Ryutaro:\n...! (Of course! The Court Record!) Yes, the answer will be amongst all the key information about the case, in the Court Record.Mikotoba:\nThat's right. Just use [R / R1 / E] to open the Court Record. Then you need to flip to the 'People' section with [R / R1 / E]. And don't take too long over it. His Excellency is watching you closely.Ryutaro:\n(Alright, check the Court Record with [R / R1 / E]... That's where the information I need will be!)Judge:\nI'm waiting, Counsel... What is the name of the victim in this case?Taketsuchi Auchi\n\n\n\n\n\n\n\nRyutaro:\nThe victim in this case is... Yes! Prosecutor Taketsuchi Auchi!\nJudge:\nWhat?!\nAuchi:\nWhy the sudden triumphant cry of 'Yes!'? Are you threatening to kill me?\nRyutaro:\n...He seems angry.\nMikotoba:\nAnd you're surprised? Did you consult the Court Record? You must look through it carefully.\nRyutaro:\nOh yes, I did, of course! I looked at everyone on file. And I chose the person whose features appeared to be the most deathly.\nMikotoba:\n...I must say...this most unusual methodology of yours leaves me almost speechless. It occurs to me with renewed certainty that reading the information carefully is vitally important. I strongly recommend it!\nRyutaro:\n(Oh dear... I simply can't ignore that imploring look.) Your Excellency! Please allow me to amend my answer!\nJudge:\n...Very well. I will excuse this incorrect response given your wide-eyed state of panic.\nLeads back to:\n\"What is the name of the victim in this case?\"Yujin Mikotoba\n\n\n\n\n\n\n\nRyutaro:\nThe victim in this case...is none other than Professor Yujin Mikotoba!\nJudge:\nWhat?!\nMikotoba:\nWell... To be written off by one's own child...\nRyutaro:\nFather, you, you seem suddenly so much older...and wearier than you were mere moments ago...\nMikotoba:\nBecause of you, clearly! The judge is asking for the victim's name. The person who was killed in this case. Look through the information in the Court Record again. Carefully. Before you kill me, for mercy's sake!\nRyutaro:\n(Oh dear... I simply can't ignore that disapproving look.) Your Excellency! Please allow me to amend my answer!\nJudge:\n...Very well. I will excuse this incorrect response given your wide-eyed state of panic.\nLeads back to:\n\"What is the name of the victim in this case?\"Jezaille Brett\n\n\n\n\n\n\n\nRyutaro:\n\nLeads to:\n\"The name of the victim who lost her life in this case...is Miss Jezaille Brett!\"Ryutaro:\nThe name of the victim who lost her life in this case...is Miss Jezaille Brett!Auchi:\n.........Rei:\nJezaille Brett...Mikotoba:\nA name that will never be forgotten in the courtrooms of our country, I'm sure.Judge:\nCorrect. And being a member of our empire's judiciary, you will be well aware of the significance of that name.Ryutaro:\n...!Judge:\nSo...let me pose another simple question. As you know, Miss Brett was a visiting student from the Empire of Great Britain. Why, then, is her name indelibly associated with our own empire's judicial history?Mikotoba:\nObviously, you won't have forgotten that case from nine months ago. But if it's proving hard to recall the finer points, everything you need is included in the Court Record.Ryutaro:\n(Obviously, I still remember. That was the start of everything.) Jezaille Brett... Behind the woman's student persona was the face of...A victim\n\n\n\n\n\n\n\nRyutaro:\n...a victim, obviously!\nJudge:\n.........\nAuchi:\n.........\nJudge:\nThe victim's role is already taken, Counsel! As you should know!\nAuchi:\nThat answer came with such misguided confidence, I was almost taken in!\nRyutaro:\nI thought it sounded a little odd!\nMikotoba:\n...Leave me out of this. Check the Court Record, and find the correct answer to the question of Miss Brett's true identity. You'll find it in the 'People' section.\nJudge:\nThat won't do, Counsel. Amend your answer before we have any more victims to contend with.\nRyutaro:\nYes...of course! ...Your Excellency!\nLeads back to:\n\"Behind the woman's student persona was the face of...\"Queen Victoria\n\n\n\n\n\n\n\nRyutaro:\n...Queen Victoria, obviously!\nJudge:\n.........\nAuchi:\n.........\nJudge:\nObviously not!\nAuchi:\nThe Queen of England?! Studying overseas?\nRyutaro:\nI thought it sounded a little odd!\nMikotoba:\n...Leave me out of this. I'm sure you know all the details of the case in question from nine months ago.\nRyutaro:\nOh yes! How could I forget? I know every last detail about it.\nMikotoba:\nThen what on earth was that absurd answer you just gave?\nJudge:\nNo more absurdity, please, Counsel. You will amend your answer.\nRyutaro:\nYes, of course, Your Excellency! (...Did they both have to call my answer absurd?)\nLeads back to:\n\"Behind the woman's student persona was the face of...\"A killer\n\n\n\n\n\n\n\nRyutaro:\n\nLeads to:\n\"Nine months ago, a visiting professor of medicine at the Imperial Yumei University was killed.\"Ryutaro:\nNine months ago, a visiting professor of medicine at the Imperial Yumei University was killed. And the culprit was...Jezaille Brett.Mikotoba:\nYes... She was a killer...Judge:\nAt the time, our country had just signed a new treaty with the Empire of Great Britain. And it was in the midst of this delicate diplomatic situation that the incident occurred. An Englishman, Dr John H. Wilson, was shot dead. I believe he was an associate of yours, Professor Mikotoba?Mikotoba:\nYes, I was indebted to the man. He'd been my mentor when I went to London to study forensic medicine. Indeed, it was I who invited him here to Japan as a visiting professor at the university. Naturally, the murder of an Englishman on our soil was a matter the government wished to resolve rapidly.Judge:\nIndeed it was. Which is why a secret trial was conducted here at the Supreme Court. A student of the Imperial Yumei University was arrested on suspicion of murder. A second-year English language student by the name of... Ryunosuke Naruhodo. With the help of his best friend, a student lawyer, the accused conducted his own defence... ...and exposed the despicable crime committed by Miss Jezaille Brett. Miss Brett eventually admitted to her crime. However, when questioned about the motive that drove her to take Dr Wilson's life... ...she gave no satisfactory answer before the trial reached its conclusion.Auchi:\nImmediately after the trial, the British government brought its consular jurisdiction into play. We were unable to sentence Miss Brett according to our empire's laws. It was decided that she would be removed to Shanghai, China, instead.Ryutaro:\nWhy Shanghai?Mikotoba:\nThere's a British consular court there.Judge:\nCorrect. I oversaw the negotiations personally. The date of her transfer to Shanghai was finally settled upon only last week. All that remained of our empire's obligations was to see the woman safely on board a steamship.Auchi:\nAnd yet, the very day before her departure... The Englishwoman was killed!Ryutaro:\nOnly the day before?!Judge:\nThat will do. I'm satisfied that the counsel for the defence is sufficiently capable of representing the defendant.Ryutaro:\nOh! Thank you, Your Excellency! (Over the first hurdle...)Judge:\nNow, a summary of the incident, if you please. Prosecutor Auchi...Auchi:\nAs is your wish...Your Excellency. The repugnant crime took place on the 11th August, in broad daylight. On the outskirts of the imperial capital, under a bright blue sky, at a secluded bathing spot by the sea... The incident occurred inside a small beach hut, erected for bathers to rest or change their clothes. The cause of death was a single stab wound to the posterior abdomen that pierced the victim's lung. An injury which proved fatal. There were two persons alone together in the beach hut at the time of the victim's death: Miss Brett, in her bathing attire, and the accused, Rei Membami! Accordingly, there can be no doubt of the accused's guilt! Especially when we consider she had a powerful motive! The police arrived rapidly at the scene and promptly arrested the young lady.Ryutaro:\n.........Judge:\n......... Well... ...that extraordinary description of events leaves me somewhat lost for words, I must say.Ryutaro:\n(That's certainly true. The prosecution's summary... ...was full of words that raise an awful lot of questions. As a lawyer, I really ought to pick up the prosecution counsel on what he said about...)The bathing spot (before clearing all other options)\n\n\n\n\n\n\n\nRyutaro:\nUm, if I may...Prosecutor Auchi...\nAuchi:\nWhat do you want? You fresh-faced, young yokel student!\nRyutaro:\nI wonder... Could you explain, please? You mentioned a 'bathing spot'...\nAuchi:\nHah! My apologies. Clearly my modernity has confused the poor country bumpkin's simple mind. 'Bathing spots' are the very latest trend in health practices from the West. We are told...that bathing in the water of the ocean is curative, therapeutic and excellent for the skin's-\nRyutaro:\nNo, that's not what I meant. I was referring to the fact that Miss Brett had, to all intents and purposes, been found guilty of murder. Why would a known criminal have been relaxing by the sea?\nAuchi:\n......... For old times' sake, I believe.\nRyutaro:\nSorry?\nAuchi:\nMiss Brett was to depart for Shanghai the following day. Her 'final wish', as it were, was to enjoy a day at our country's wonderful coast. And the British embassy put extreme pressure on our government to comply.\nRyutaro:\nBut, but on what grounds would we agree to such a request?\nMikotoba:\nBecause, as usual, our government is unable to stand up to foreign powers. In matters of diplomacy, it seems we don't even have the courage to decline the whims of a known criminal.\nAuchi:\nD-Don't look at me, Professor! It was the government who granted permission, not I! In any case, it was decided that with a dedicated detective on duty, nothing could go wrong.\nRyutaro:\n...But in fact...a murder took place.\nAuchi:\nI, I said don't look at me! It was that young student girl who did it, not I!\nRyutaro:\nNo one has proved that yet!\nMikotoba:\n...I wouldn't provoke the man if you don't need to.\nRyutaro:\n(Hm, at this stage, I need to gather more information, I think.)\nLeads back to:\n\"As a lawyer, I really ought to pick up the prosecution counsel on what he said about...\"The bathing spot (after clearing all other options)\n\n\n\n\n\n\n\nRyutaro:\nUm, if I may...Prosecutor Auchi...\nAuchi:\nWhat do you want? You fresh-faced, young yokel student!\nRyutaro:\nI wonder... Could you explain, please? You mentioned a 'bathing spot'...\nAuchi:\nHah! My apologies. Clearly my modernity has confused the poor country bumpkin's simple mind. 'Bathing spots' are the very latest trend in health practices from the West. We are told...that bathing in the water of the ocean is curative, therapeutic and excellent for the skin's-\nRyutaro:\nNo, that's not what I meant. I was referring to the fact that Miss Brett had, to all intents and purposes, been found guilty of murder. Why would a known criminal have been relaxing by the sea?\nAuchi:\n......... For old times' sake, I believe.\nRyutaro:\nSorry?\nAuchi:\nMiss Brett was to depart for Shanghai the following day. Her 'final wish', as it were, was to enjoy a day at our country's wonderful coast. And the British embassy put extreme pressure on our government to comply.\nRyutaro:\nBut, but on what grounds would we agree to such a request?\nMikotoba:\nBecause, as usual, our government is unable to stand up to foreign powers. In matters of diplomacy, it seems we don't even have the courage to decline the whims of a known criminal.\nAuchi:\nD-Don't look at me, Professor! It was the government who granted permission, not I! In any case, it was decided that with a dedicated detective on duty, nothing could go wrong.\nRyutaro:\n...But in fact...a murder took place.\nAuchi:\nI, I said don't look at me! It was that young student girl who did it, not I!\nRyutaro:\nNo one has proved that yet!\nMikotoba:\n...I wouldn't provoke the man if you don't need to.\nLeads to:\n\"I believe we all have a clear picture of the incident now.\"Being alone together (before clearing all other options)\n\n\n\n\n\n\n\nRyutaro:\nUm, Membami-san...\nRei:\nYes, what is it, Susa- I, I mean, um... Naruhodo-san!\nRyutaro:\n(I'm really starting to wish we'd made my alias Ryutaro Susato...) Please tell the court why exactly you were present at the bathing spot with the victim in the first place. And why you were alone with her.\nRei:\nOh! Well! No! That's not true! It wasn't like that at all! There were other people present. A detective who was guarding Miss Brett for starters! I was just asked to accompany Miss Brett as a companion, that's all.\nAuchi:\nBut let us be clear! At the moment of her death, you were alone together with the victim in the hut. You and no one else!\nRyutaro:\n...!\nAuchi:\nThe truth is, there is only one reason why this young woman accompanied Miss Brett on her bathing sojourn: It was the accused's last chance to take the victim's life!\nRei:\nNo!\nAuchi:\nBecause, as we know... ...the following day would see Miss Brett extradited to the British authorities in Shanghai. And the accused would never have an opportunity to dispatch her again.\nRyutaro:\nKindly refrain from conjecture, Counsel!\nAuchi:\n...Tsh huh huh...\nMikotoba:\n...The prosecution counsel seems to enjoy using provocative tricks like that. But for now at least, we need to assemble more facts... Try not to let him goad you.\nSusato:\n(Oh dear... This is really terrifying. But Father's right. We need more information.)\nLeads back to:\n\"As a lawyer, I really ought to pick up the prosecution counsel on what he said about...\"Being alone together (after clearing all other options)\n\n\n\n\n\n\n\nRyutaro:\nUm, Membami-san...\nRei:\nYes, what is it, Susa- I, I mean, um... Naruhodo-san!\nRyutaro:\n(I'm really starting to wish we'd made my alias Ryutaro Susato...) Please tell the court why exactly you were present at the bathing spot with the victim in the first place. And why you were alone with her.\nRei:\nOh! Well! No! That's not true! It wasn't like that at all! There were other people present. A detective who was guarding Miss Brett for starters! I was just asked to accompany Miss Brett as a companion, that's all.\nAuchi:\nBut let us be clear! At the moment of her death, you were alone together with the victim in the hut. You and no one else!\nRyutaro:\n...!\nAuchi:\nThe truth is, there is only one reason why this young woman accompanied Miss Brett on her bathing sojourn: It was the accused's last chance to take the victim's life!\nRei:\nNo!\nAuchi:\nBecause, as we know... ...the following day would see Miss Brett extradited to the British authorities in Shanghai. And the accused would never have an opportunity to dispatch her again.\nRyutaro:\nKindly refrain from conjecture, Counsel!\nAuchi:\n...Tsh huh huh...\nLeads to:\n\"I believe we all have a clear picture of the incident now.\"A powerful motive (before clearing all other options)\n\n\n\n\n\n\n\nRyutaro:\nYou're clearly exaggerating! 'Powerful motive' is a blatant overstatement!\nAuchi:\nTut tut tut. Is the yokel boy using long words he doesn't fully understand?\nRyutaro:\nI beg your pardon?\nAuchi:\n...No matter. Let us put this to the accused, shall we? Membami-san, you are a research assistant at the Imperial Yumei University, I believe?\nRei:\nYes! I am! I'm working with Professor Mikotoba in his laboratory at the moment!\nMikotoba:\nI can confirm that. The defendant is an excellent assistant with a strong sense of responsibility.\nAuchi:\nFascinating to hear. Now, another question... Prior to your work with Professor Mikotoba...whose research were you assisting then?\nRei:\nOh! Um...well...erm... I was studying under Dr John H. Wilson.\nJudge:\nDr...Dr Wilson?! The visiting English professor who was murdered by Miss Brett nine months ago?\nAuchi:\nThe accused had a deep-seated respect for her former mentor, Dr Wilson. ...Is that not true?\nRei:\n...Yes. Dr Wilson was a wonderful man.\nAuchi:\nInteresting. Then tell the court what deep-seated feelings you had towards the Englishwoman who killed him.\nRei:\nWell, obviously I was filled with hatred for what she'd done! A powerful hatred!\nRyutaro:\nOh no! Rei! Be careful of what you're saying!\nRei:\nAh.\nAuchi:\nThe motive...was revenge. ...Plain and simple, Your Excellency.\nJudge:\nHmmm...\nMikotoba:\nWell, it was clearly a trap all along.\nRyutaro:\nHow wicked of him to use Rei's undying respect for her former mentor against her like that. (I must find out more details, and something we can use to bolster our defence...)\nLeads back to:\n\"As a lawyer, I really ought to pick up the prosecution counsel on what he said about...\"A powerful motive (after clearing all other options)\n\n\n\n\n\n\n\nRyutaro:\nYou're clearly exaggerating! 'Powerful motive' is a blatant overstatement!\nAuchi:\nTut tut tut. Is the yokel boy using long words he doesn't fully understand?\nRyutaro:\nI beg your pardon?\nAuchi:\n...No matter. Let us put this to the accused, shall we? Membami-san, you are a research assistant at the Imperial Yumei University, I believe?\nRei:\nYes! I am! I'm working with Professor Mikotoba in his laboratory at the moment!\nMikotoba:\nI can confirm that. The defendant is an excellent assistant with a strong sense of responsibility.\nAuchi:\nFascinating to hear. Now, another question... Prior to your work with Professor Mikotoba...whose research were you assisting then?\nRei:\nOh! Um...well...erm... I was studying under Dr John H. Wilson.\nJudge:\nDr...Dr Wilson?! The visiting English professor who was murdered by Miss Brett nine months ago?\nAuchi:\nThe accused had a deep-seated respect for her former mentor, Dr Wilson. ...Is that not true?\nRei:\n...Yes. Dr Wilson was a wonderful man.\nAuchi:\nInteresting. Then tell the court what deep-seated feelings you had towards the Englishwoman who killed him.\nRei:\nWell, obviously I was filled with hatred for what she'd done! A powerful hatred!\nRyutaro:\nOh no! Rei! Be careful of what you're saying!\nRei:\nAh.\nAuchi:\nThe motive...was revenge. ...Plain and simple, Your Excellency.\nJudge:\nHmmm...\nLeads to:\n\"I believe we all have a clear picture of the incident now.\"Judge:\nI believe we all have a clear picture of the incident now.Mikotoba:\nDespite her guilt being determined nine months ago... ...Miss Brett managed to avoid incarceration, instead continuing her research work at the university. Obviously, over that period, she and Rei would have encountered each other on a number of occasions.Ryutaro:\nSeeing the murderer of the mentor for whom she had such great respect enjoying such undeserved liberty...Mikotoba:\nYes, even if it was only temporary until Miss Brett's extradition to Shanghai... ...you can hardly blame Rei for her feelings of anger and resentment.Ryutaro:\n(Poor Rei...)Auchi:\nSo, Your Excellency...if you'd be so kind as to peruse this exhibit. A photographic print that shows the scene of the crime immediately following the grim incident.Judge:\nYes, thank you, Counsel. A tragic image.Auchi:\nAs you can clearly see, there is nowhere within the hut that anyone else could have hidden.Judge:\nThe court will accept this photographic print as evidence.The photograph of the crime scene has been entered into the Court Record.Judge:\nAs I understand it then, the victim and the defendant were alone inside the beach hut at the time. This is deeply troubling, I must say. The finger of guilt points firmly at the defendant.Auchi:\nWell, Your Excellency...naturally the prosecution has much more to its case.Ryutaro:\n...!Auchi:\nWe intend to prove the accused's appalling actions beyond all possible contention. To that end, I can confirm that we have multiple witnesses to the crime, and damning evidence.Ryutaro:\nW-Witnesses? But, but who...?Rei:\n.........Auchi:\nOne of whom, I might add, is a highly respected police detective. I assure you...the testimony of these witnesses will leave no room for doubt!Ryutaro:\nUgh!Judge:\nVery well then, Counsel. Bring forth your witnesses.Auchi:\n......... I, Taketsuchi Auchi, have been waiting for this moment.Ryutaro:\nSorry?Auchi:\nOh yes, I haven't forgotten. That trial nine months ago, here in this very courthouse... ...when that irreverent little student boy...utterly humiliated me!Auchi:\nARRRRRRGH! Ryunosuke Naruhodo!Ryunosuke:\nWha- Yes?Auchi:\nThis insult to the Auchi family name... will NEVER be forgotten!Kazuma:\nYou've become conceited with age, Counsel. But the old have to stand aside and make way for the new. It's the way of the world. ...May you never forget that!Auchi:\n'Strike the head of a samurai whose topknot has been cut, and the bell of cultural enlightenment tolls.' Yes, on that fateful day...my former self died.Ryutaro:\nThe start of your own mini Meiji Revolution! Are you modernising as well, Counsel?Auchi:\nSilence! Since I swore revenge back then, there has been a minor miracle atop my head. Observe, the Auchi growth! You see? You see this seed of hope sprouting forth from the barren expanse of my crown?Ryutaro:\n(I, I think that tiny growth is trying to tell me something!)Rei:\nUm... ...I'm afraid I can't really see. Where, where is the hope exactly?Auchi:\nI said silence! Today, I face another yokel student of the Naruhodo clan. Well...I will vanquish you! And my victory will be fertiliser for the seed of hope atop my head! ...You have been warned. With that...the prosecution calls the witnesses to the stand!Mikotoba:\n...It looks like the stakes are high on both sides in this trial. The prosecution and defence each has much to lose.Ryutaro:\nA haircut is hardly comparable to Rei's life!Auchi:\nWitnesses, please state your names and occupations for the court.Hosonaga:\nChief Inspector Satoru Hosonaga, Imperial Police Bureau. I'm in disguise, obviously, so I can go undetected.Soseki:\nAnd I am... Well, the next big thing in books. An author renowned throughout the capital, in fact. Yes... Soon to be sold out! The satirical 'I Am a Cat'! A sensational success! By Soseki Natsume!Ryutaro:\nOh my goodness!Soseki:\nStruggling student from the provinces, please... You needn't be in awe of me.Ryutaro:\nI needn't?Soseki:\nIt's only natural that you'd feel nervous in my presence. But all of you, please, relax. Call me Soseki, even.Ryutaro:\nUm...yes... (What on earth is Soseki-san doing here?)Mikotoba:\nTread carefully, Susato. That author fellow knows you from your time in London, doesn't he? If he exposes you for who you really are, this will be over before it's begun.Ryutaro:\nYes... Yes, of course. I know. (I presume Soseki-san won't have forgotten about me. I could certainly never forget him. Although he does seem to have changed somewhat in the six months or so that it's been since I last saw him. And as for Inspector Hosonaga... That amazing outfit is... hard to believe.)Hosonaga:\n...Do I have something on my face?Ryutaro:\n(Well, your glasses for one. Although they don't seem to be helping you see... Thank goodness he hasn't recognised me either.)Hosonaga:\nAh, I suppose it's this disguise, is it? I thought that appearing here in the clothes I was wearing at the time would make for a more faithful testimony. It is my guiding principle to carry out all testimonies flawlessly.Judge:\nHm, well, I can appreciate why an Imperial Police Bureau detective might have been present... ...but what business did a writer such as yourself have being at the scene, Soseki-san?Soseki:\nAh, well, you see... ...I had been asked that day to give a lecture. On the morning of the incident...in the Imperial Yumei University's Grand Lecture Hall no less.Ryutaro:\nAt...Yumei University?Soseki:\nAfter the lecture, I had a very pleasant conversation with a researcher from the medical science department. The professor over there, in fact.Ryutaro:\nWith my fath- With Professor Mikotoba?!Mikotoba:\nYes, that's right. It was arranged by one of the newspapers. They wanted some story or other about two former students who'd studied in Great Britain.Soseki:\nOf course, being a renowned author, the press never leave me alone. They secretly spy! Snap shots! Scribble stories! And scupper my privacy!Ryutaro:\nHaah...Soseki:\nAs you can see, the conversation was written up in this newspaper here. Read it at your leisure, my provincial, struggling student friend. I have plenty of copies.Ryutaro:\nThank you very much! (He practically threw that paper at me.)The Soseki Natsume article has been entered into the Court Record.Soseki:\nAnyway, following my interview with the professor... ...the lady in question appeared and made a very unexpected announcement. 'I should like to go with everyone to see your country's coast!' Those were her words.Mikotoba:\nAs I explained before, Miss Brett was never taken into custody. She continued to work in my laboratory, under strict surveillance, of course.Auchi:\nAt which utterance, the university immediately contacted the government to seek guidance. And the response was, 'Permit Miss Brett to go as long as a detective accompanies her.'Hosonaga:\nThat detective, I am at liberty to divulge, was me, Chief Inspector Satoru Hosonaga.Auchi:\nThereby the entire party departed cordially for the seaside, it seems.Hosonaga:\nIt was extremely challenging to clear all other members of the public from the vicinity of the beach. But fortunately, I am at peak physical fitness at the moment, so... ...I was able to carry out my duty flawlessly.Ryutaro:\nOh my! Inspector, you... Well, you do have something on your face now.Hosonaga:\nAh, how unsightly. I do apologise.Ryutaro:\nDoes that mean that you went to the beach too, Father?Mikotoba:\nNo no. Fortunately, I had work to finish off. But unfortunately, of course... ...it meant that, as my assistant, Rei was invited to take my place.Soseki:\nOf course, being a renowned author, I didn't like to decline the invitation. AGH, BUT IF ONLY I HAD! I'D NEVER HAVE SEEN THAT AWFUL SIGHT!Relentlessly Racked by Remorse and Regret!Judge:\nVery well. I must now ask you to present your formal testimony to the court. You will give an account of all that you witnessed on your impromptu excursion to the coast.Hosonaga:\nOf course, Your Excellency...Soseki:\n...Relentlessly racked by remorse and regret, I am...Witness Testimony\n- The Witnessed Scene -Hosonaga:\nOn the day of the incident, I was ordered on a special surveillance assignment in this disguise.Soseki:\nI'd just managed to catch that crab when I suddenly heard a caterwaul from behind me.Hosonaga:\nI ran into the beach hut at once, where I found the pair in question.Soseki:\nYES YES YES! That young girl was astride the Englishwoman, dagger in hand, as she stabbed wildly!Hosonaga:\nI saw blood on the blade. It proved to me that she'd stabbed the victim multiple times.Judge:\nIndeed... It does appear from this testimony that both witnesses here present saw it. The very moment...of this heinous crime!Ryutaro:\nWhat?!Auchi:\nNow...if you will recall, I promised evidence as well. What phrase did I use again? ...Ah yes, that was it: 'damning' evidence.Judge:\nHm, what have you there, Counsel? A so-called 'fountain pen', is it?Hosonaga:\nCorrect, Your Excellency. I found it at the scene whilst examining the body. It appears that in her dying moments, with her final ounce of strength... ...the victim clutched a piece of evidence that would positively identify her killer.Ryutaro:\nWhat?!Auchi:\nYour Excellency, if you would cast your eyes over the photographic print of the crime scene once more...Judge:\n......... Ah! Goodness me! Yes, the victim is clearly grasping something quite deliberately there in her hand!Hosonaga:\nThat's right. The fountain pen. And if you would kindly examine the pen, Your Excellency...Judge:\n......... Ah! The owner's initials have been engraved into the ebonite barrel! 'R.M.'... Rei Membami... The initials of the defendant!Ryutaro:\nAh... NOOOOOO!Judge:\nThis fountain pen will be admitted immediately as critical evidence!The fountain pen has been entered into the Court Record.Auchi:\nSo...have I omitted anything? Decisive testimony and damning evidence... There's a bright blue sky outside the courthouse today. Perfect weather to ascribe guilt, I feel.Ryutaro:\n(I, I don't understand. The Prosecutor Auchi of nine months ago... ...had none of this man's poise!)Judge:\nCounsel for the Defence...you may begin your cross-examination now.Ryutaro:\n.........Judge:\nNaruhodo-san!Ryutaro:\nNaruhodo... That...means... Oh! Yes! Me!Judge:\nIs there another Naruhodo in my courtroom?Ryutaro:\n(Actually, there isn't even a single Naruhodo in your courtroom...)Mikotoba:\nCousin Ryutaro...pull yourself together, please.Ryutaro:\n(Alright, I've seen this countless times as a judicial assistant. Find inconsistencies in the witnesses' testimonies to prove that they're lying somehow. That's all there is to it. That's how a real lawyer would handle a cross-examination. So let's see what I can do!)Cross-Examination\n- The Witnessed Scene -",
      "testimonies": [
        {
          "testimony": "On the day of the incident, I was ordered on a special surveillance assignment in this disguise.",
          "person": "Hosonaga",
          "present": []
        },
        {
          "testimony": "I'd just managed to catch that crab when I suddenly heard a caterwaul from behind me.",
          "person": "Soseki",
          "present": []
        },
        {
          "testimony": "I ran into the beach hut at once, where I found the pair in question.",
          "person": "Hosonaga",
          "present": []
        },
        {
          "testimony": "YES YES YES! That young girl was astride the Englishwoman, dagger in hand, as she stabbed wildly!",
          "person": "Soseki",
          "present": []
        },
        {
          "testimony": "I saw blood on the blade. It proved to me that she'd stabbed the victim multiple times.",
          "person": "Hosonaga",
          "present": [
            "Post-Mortem Report"
          ],
          "source": {
            "evidence_span": "Time of death just after 2 p.m. Death is believed to be due to trauma to the victim's lung from a knife blade. Only a single wound was identified.",
            "testimony_span": "I saw blood on the blade. It proved to me that she'd stabbed the victim multiple times.",
            "explanation": "If only one single wound was identified on the post-mortem report, the victim could not have been stabbed multiple times.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Hosonaga is testifying about the events that took place on the day of the incident.",
      "labels": [
        "numerical"
      ],
      "reasoning": [
        "Fact 1: The witness claims the victim was stabbed multiple times.",
        "Fact 2: The evidence suggests the victim has only one single wound.",
        "Prop 1: If a person was stabbed multiple times, then he or she would have multiple wounds."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "Hosonaga:\nOn the day of the incident, I was ordered on a special surveillance assignment in this disguise.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nIn that...jaunty disguise?\nHosonaga:\nCorrect. ......... Wait! No! I mean, it wasn't the first time I've worn this swimsuit for a dip in the ocean. It's tried and tested. 'Do what must be done to keep the Englishwoman under surveillance.' Those were my orders that day.\nRyutaro:\nAnd this tried and tested outfit was the answer?\nHosonaga:\nBeing able to blend flawlessly into a crowd is an important part of a detective's job. I submerged myself in the salty water leaving only Mr Turtle floating inconspicuously on the surface. Mr Turtle loves the water.\nRyutaro:\n......... But there was no need for you to blend into the background on this assignment really, was there?\nMikotoba:\nIf that made you late arriving on the scene, I think perhaps you had your priorities wrong.\nHosonaga:\n......... Ahem. ...Ahem.\nRyutaro:\n(Perhaps I shouldn't pursue this line of questioning any further at the moment...)Soseki:\nI'd just managed to catch that crab when I suddenly heard a caterwaul from behind me.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nAh, you're describing the victim's scream, presumably, Soseki-san?\nSoseki:\nIn more literary terms, you might say it was a scream that could have pierced the heavens. 'KYAAAAAAAAAAAAH!!!' ...Or the like. Of course, that's just a metaphor. We renowned authors are wont to describing things so.\nRyutaro:\n(Soseki-san wasn't at all like this in England...)\nSoseki:\nAnyway, I spun around at the noise and the beach hut immediately fell under my gaze.\nRyutaro:\nYes, the beach hut...\nHosonaga:\nThe area is popular with government ministers. Many have seaside retreats there for rest and recuperation. Locals are prohibited from entering the area, so it's always very quiet. The beach hut is a simple structure, erected as a place for people to change or take refuge from the sun.\nSoseki:\nAlthough, the Englishwoman commandeered the hut for herself... ...which meant that I was forced to change into my swimwear on the sand.\nRyutaro:\nAh. I imagine that was rather embarrassing for you.\nSoseki:\nWell anyway, I tossed the crab aside and headed for the beach hut at a run. Or, in more literary terms... I decrabbed and beetled off hut-wise!Hosonaga:\nI ran into the beach hut at once, where I found the pair in question.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nWait, by 'pair', you don't mean to say...? But how could that be?\nHosonaga:\nNo no, you misunderstand! Obviously, I mean the victim and the defendant, Rei Membami-san.\nRyutaro:\n...Oh. It would have been helpful if you could have just said that from the outset.\nHosonaga:\n...If you jump to conclusions, you have to expect to fall flat on your face sometimes.\nAuchi:\nDear me, pinning your hopes on such an outside chance. Foolish. Very foolish.\nRyutaro:\n(It really was an outside chance. I just wish I'd realised that before I said something silly.)\nAuchi:\nSo, Inspector, why don't you tell the court how exactly you found the aforementioned pair in the hut.\nHosonaga:\nWell, it was a sorry sight. A really grisly scene. I parted the noren curtain hanging in the doorway and stepped inside, only to see... ...the defendant leaning menacingly over the lifeless body of the victim sprawled on the sand! Ahem! Ahem, ahem, ahem! My glasses very nearly cracked at the ominous sight that met my eyes.\nAuchi:\nHow thoroughly appalling.\nRyutaro:\nUgh... (He doesn't appear to be lying here...) Well, Soseki-san, can you confirm what Inspector Hosonaga is saying, I wonder?\nSoseki:\nAh... You'd like a literary man's opinion?Soseki:\nYES YES YES! That young girl was astride the Englishwoman, dagger in hand, as she stabbed wildly!Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\n'Stabbed wildly'? You actually saw her do it?\nSoseki:\nOh, indeed. The terrible spectre! The terrapin inspector! The bloody torrent! The author's torment!\nRyutaro:\nEEEEEEEEEEEK!!!\nSoseki:\nEvery sight and every sound is still carved in my melancholy memory! That was my impression, at least...as a future literary sensation.\nAuchi:\nCounsel! What on earth was that shrill, effeminate scream?\nRyutaro:\nOh! N-No! ...Ahem! No. What are you insinuating? I'm as manly a Japanese man as you!\nMikotoba:\nI wonder if I might interject here, Soseki-san. Something you said is troubling me. 'That was my impression' were your words just now, I believe.\nSoseki:\n.........\nRyutaro:\nAh! So...do you mean to say... ...you're not confident that you really did see what you've described?\nSoseki:\n......... NO! I mean, YES! I mean, I KNOW WHAT I SAW! My ears didn't deceive me when I heard that scream. Hence my eyes didn't deceive me, either! I could describe everything I saw vividly! I could publish it all in tomorrow's newspaper serial!\nAuchi:\nIt sounds as though the next instalment of 'I Am a Cat' may take a macabre turn.\nMikotoba:\nI think this is a fool's errand. The more we press your author friend on what he saw, the more entrenched he's going to become.\nRyutaro:\nOh dear... How awkward.Hosonaga:\nI saw blood on the blade. It proved to me that she'd stabbed the victim multiple times.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nShe was stabbed multiple times...? How can you be sure of that?\nHosonaga:\nVery simply. From the blood on the blade.\nRyutaro:\nThe...blood?\nHosonaga:\nWhen I entered the hut, I saw the defendant holding the blade raised up in the air.\nSoseki:\nYES! YES! That's right! I saw it too!\nRyutaro:\nOh...\nHosonaga:\nAnd I noted that there was blood on the blade already at that point. In other words, the victim had already been stabbed at least once by the time I arrived on the scene.\nSoseki:\nYES! YES! That's right! I saw it too!\nHosonaga:\nAnd the victim was already holding the defendant's fountain pen in her hand, too. All of which means I can be sure...the victim did not die instantly.\nSoseki:\nYES! YES! Right! Saw it too!\nRyutaro:\n(Maybe a year in London was too much for him. He sounds like he's forgotten how to speak Japanese.)\nMikotoba:\nThe logic of your argument is sound at least.\nHosonaga:\nWell, as I said, it is my guiding principle to carry out all testimonies flawlessly.\nRyutaro:\nPerhaps it should have been your guiding principle to protect the victim flawlessly? That's just my personal opinion, of course.\nHosonaga:\n......... Ahem! Ahem! Ahem, ahem!\nJudge:\nCounsel! You will refrain from mocking the witness!Present Post-Mortem Report\n\n\n\n\n\n\n\nRyutaro:\n\nLeads to:\n\".........\"Ryutaro:\n(Oh no... I just have so many thoughts whirling around in my head... It's all I can do to stand here, wide-eyed and mute...)Mikotoba:\nGoodness, my dear. You really must try to calm down.Ryutaro:\nBut how am I supposed to find an inconsistency in what these two gentlemen are saying? I don't see why either of them would have any reason to lie.Mikotoba:\nWhat you must remember, I think, is that witnesses may inadvertently lie at times. For various reasons: a misunderstanding, a mistaken observation, a delusion, even...Ryutaro:\nAh...a delusion...Mikotoba:\nWhat's important is that we determine the truth. And there's only one sure way to do that.Ryutaro:\nYes...with evidence, of course.Mikotoba:\nSpoken like a true judicial assistant. During witness testimony, you can use [R / R1 / E] to pick a piece of evidence to 'Present' for consideration. So you need to listen carefully to each statement, and compare what's said to the details in the Court Record. If you find some conflicting information, that may be the inconsistency you're looking for.Ryutaro:\n(Yes, it's all about inconsistencies...)Mikotoba:\nOnce you've identified a witness's statement that appears to conflict with a piece of evidence... Present the evidence to the witness with [X /  / R], and the way ahead will present itself to you, I'm sure.Ryutaro:\nYes! (Alright, then... I'll consider the details of all the evidence in the Court Record against each statement to find an inconsistency. I hope I'm up to the task...)Mikotoba:\nDon't forget that you can have the witnesses repeat their statements as many times as you like. Everyone has to start at the beginning, remember. So those wide eyes are quite forgivable. And besides...there's no one else to defend the poor girl.Ryutaro:\nYou're right! (I need to listen to the testimony again from the start.)Ryutaro:\n......... (With that accusatory cry that just welled up from deep inside me, I think I finally understand... Every time Kazuma-sama and Naruhodo-san have stood here at this bench... ...the stakes have been very, very high, indeed!)Auchi:\nWh-What's the meaning of that menacing pose, Counsel?Ryutaro:\nI'd like the witness to clarify something for me.Soseki:\nWho? What? Where? When? Hooooooooooow?!Ryutaro:\nNot you, Soseki-san. This query is directed at Inspector Hosonaga.Hosonaga:\n...! At me?Ryutaro:\nIn your statement just now... ...you said that the victim was stabbed multiple times.Hosonaga:\nYes, that's right. As I said, when I entered the hut... ...the defendant was already standing over the victim, bloody knife in hand, like a murderous demon.Ryutaro:\nAnd yet...that cannot be.Hosonaga:\nWhat?Judge:\nGet to the point please, Counsel.Ryutaro:\nIn the post-mortem report, it clearly states... ...that the victim was stabbed one time only.Judge:\nAh!Auchi:\nNnnf!Ryutaro:\nIn other words...Inspector Hosonaga's testimony... ...is clearly flawed!Hosonaga:\nAgh!Ryutaro:\nAnd Soseki-san!Soseki:\nM-M-Me?!Ryutaro:\nYou claim to have seen Membami-san in the throes of stabbing the victim.Soseki:\nY-Yes... Yes, I did... WILDLY!Ryutaro:\nBut both you and the inspector confirmed the same point: That there was already blood on the knife that you saw the defendant holding.Hosonaga:\nYes... And...?Ryutaro:\nIt's quite simple. We know the murder weapon was used to stab the victim only once. Therefore... ...there is no way there could have been blood on the knife if that single stabbing hadn't already occurred.Soseki:\nARGH! TRUE!Judge:\nThen what exactly is your contention, Counsel? Are you ever going to tell us?Ryutaro:\nYes, Your Excellency. There's only one logical conclusion. What Soseki-san in fact saw was not the moment that the defendant stabbed the victim at all... ...but the moment that the defendant in fact...withdrew the blade from the victim's body!Soseki:\nThat, that can't... ...BEEEEEEEEEEEE!Mikotoba:\nExcellent work, Susato! You exploded at them with that objection, and then proceeded to pull them apart systematically.Auchi:Auchi:\nTsh huh huh... Well well, this takes me back.Ryutaro:\n...!Auchi:\nYes, I seem to remember your cousin staged a scene much like this in that trial nine months ago. A half-witted child with a half-baked objection attempting to steal the show.Mikotoba:\nYou're right. There were certain similarities. Except that so-called 'half-witted child' managed to outwit the prosecution...who has only half a head of hair.Auchi:\nSlander! My head is quite adequately dressed! In any case, all this talk of stabbing and withdrawing and multiple wounds... ...it makes not a jot of difference!Ryutaro:\nWhat? Why not?Auchi:\nEngage your brain, young man! When the accused first plunged the deadly weapon into the victim, that was the fatal blow. And it was that moment, just as she had withdrawn the blade ready for her next strike, that the witnesses saw. The knife was already tainted with blood, because the accused had already stabbed the victim!Ryutaro:\nAh!Auchi:\nAll you have successfully shown with your little display... ...is that the moustached author is prone to moments of extravagance!Ryutaro:\nAAAAAAAAAGH!Judge:\nI am in agreement with the prosecution. If the defendant was seen wielding the blade at all... ...that is sufficient grounds for her actions to be viewed with suspicion.Ryutaro:\nBut, but if she was withdrawing the blade...Auchi:\n...Then we are back where we started!Ryutaro:\nSorry?Auchi:\nConsider this, young yokel boy... If the student girl is innocent as you claim... ...then why would she have pulled the blade from the victim? And with a demon's cold-blooded composure, too. The prosecution demands an explanation! ...And it had better be good.Ryutaro:\nWhy did Rei pull out the knife...?Mikotoba:\nAh, yes... Going for the jugular.Ryutaro:\nHm? (What does Father mean by that?)Judge:\nLet the court hear your answer then, Counsel.Ryutaro:\n(The truth is, I don't really know. But I have to come up with a plausible reason here, or we don't have a case.) The reason why the defendant pulled the knife blade out of the victim's body was surely so she could...Stab her again\n\n\n\n\n\n\n\nRyutaro:\nHm, well, this is only one possible answer, but... ...could it have been so she could stab the victim again?\nJudge:\nPardon?\nRyutaro:\nIsn't there a saying? If someone slaps you on the right cheek, turn to him the left also.\nMikotoba:\nSusa- Ryutaro! What are you saying?! Or rather, what are you doing? Do you realise what a hole you're digging?\nRyutaro:\nAh! AAAAAAGH! (It must be the pressure of being here. I'm starting to say things I don't mean...)\nAuchi:\nQuite a slap in the face for the woman you represent. You yokels and your heavy-handed ways!\nRyutaro:\nN-No, I didn't... That, that was just an example! A mere musing! I didn't mean that's what happened!\nJudge:\nI suggest you take a moment to consider your answer next time. ...Before you speak, Counsel.\nRyutaro:\nUgh... Yes, Your Excellency... Thank you for allowing me another chance.\nLeads back to:\n\"The reason why the defendant pulled the knife out of the victim's body was surely so she could...\"Save her life\n\n\n\n\n\n\n\nLeads to:\n\"According to the post-mortem report, the victim's death was not instant.\"Hide the knife\n\n\n\n\n\n\n\nRyutaro:\nI think...it was possibly so that she could hide the murder weapon.\nAuchi:\n\nAuchi:\nAnd yet the murder weapon was left there, thrust into the sand at the scene.\nRyutaro:\n......... Having pulled the knife from the victim, she couldn't find a place to hide it, so that was her only option, perhaps?\nJudge:\n......... I think, Counsel... ...that you were ill-advised with your answer initially. And you were further ill-advised to pursue it.\nRyutaro:\nOh dear! I'm terribly sorry! (...This job is not to be taken lightly. There's just so much pressure.)\nMikotoba:\nJust because you're under pressure doesn't mean you can say the first thing that comes into your head.\nRyutaro:\nI'd, I'd like to revise my answer, Your Excellency!\nLeads back to:\n\"The reason why the defendant pulled the knife out of the victim's body was surely so she could...\"Ryutaro:\nAccording to the post-mortem report, the victim's death was not instant.Hosonaga:\nThat's correct. It's thought she would have remained conscious for a short while after sustaining the injury.Auchi:\nIndeed, giving her the time to take hold of this piece of evidence that clearly indicates her killer.Ryutaro:\nThe, the point is... ...being a medical research assistant, Membami-san was compelled to act when faced with the wounded victim. Instinctively, she pulled the blade out in an attempt to save Miss Brett's life!Auchi:\n.........Judge:\n.........Mikotoba:\n.........Auchi:\nTsh huh huh! Did you hear that, Your Excellency? It would seem this is the best we can expect of this young yokel.Judge:\nHmmm... Indeed.Ryutaro:\n(Ugh... Is it just me, or does it suddenly feel much colder in here?)Hosonaga:\n...Your Excellency, if I may?Judge:\nSpeak, witness.Hosonaga:\nI would like another opportunity to testify. In respect to the slipshod assertion just put forward by the yokel defence counsel, I mean.Ryutaro:\nS-Slipshod?Auchi:\nTsh...huh...huh... An excellent idea, Inspector. Our young yokel hopeful has a modicum of knowledge when it comes to the law, it seems... ...but in matters of medicine, he appears to possess not one iota of common sense!Judge:\nVery well, Inspector. I will permit your request. You will testify again before the court. On the subject of the defence counsel's assertion.Hosonaga:\nYes, sir. I will do so flawlessly.Witness Testimony\n- Forensic Medicine Primer -Hosonaga:\nPulling a blade from a wound without thinking could cause heavy bleeding.\nThat's basic knowledge that any medical research assistant with an ounce of sense ought to know.\nIn other words, there's no good reason why the defendant would have tried to pull the knife from the victim.\nLet's not forget that the young student did have a motive for killing the victim.\nThe man the victim murdered nine months ago, Dr Wilson, was the defendant's highly respected mentor.Ryutaro:\nIs, is what you just said true, Inspector? Could pulling a knife from a wound really cause the wound to bleed heavily?Hosonaga:\nYes. Think of the weapon itself as a stopper in the wound that prevents excessive blood loss. Until a doctor is ready to provide proper treatment, that stopper shouldn't be removed.Ryutaro:\nOh, I... I see...Auchi:\nHah! This is why yokels should stay on the farm. Even a quack from some obscure mountain village would have such basic knowledge. Anyone who's ever given someone a little poke with a knife and pulled it out again knows it!Ryutaro:\nOh...well...I've never stabbed anyone, you see. Or pulled a blade out of a wound, so...Mikotoba:\nOf course you haven't. I didn't bring you up to behave like a bandit.Ryutaro:\nFather, is it true, what they're telling me?Mikotoba:\nYes, it's basic remedial knowledge for medics. Rei would have been well aware of it. If she were to claim ignorance of such fundamentals, that would prove fatal in many ways.Ryutaro:\nBut then...why would Rei have done it? Could she have pulled out that knife in full knowledge that it would be fatal for Miss Brett?Mikotoba:\n...I don't know.Ryutaro:\n(Rei never once mentioned anything about the knife to me. It seems almost impossible to believe, but... ...could my friend actually have...?)Mikotoba:\nSusato!Ryutaro:\nY-Yes?Mikotoba:\nPull yourself together! We mustn't lose sight of why we're here.Ryutaro:\n(Ah!)Judge:\nCounsel, it's time for your cross-examination.Ryutaro:\nOh...yes, Your Excellency!Judge:\nHowever... ...I must warn you that if your cross-examination fails to identify any issue with the established facts... ...I will be moving to my adjudication immediately afterwards.Ryutaro:\n...I understand. (Believing in your clients and fighting for their cause until the bitter end... I knew it would be hard, but...I had no idea it would be this hard!)Cross-Examination\n- Forensic Medicine Primer -",
      "testimonies": [
        {
          "testimony": "Pulling a blade from a wound without thinking could cause heavy bleeding.",
          "person": "Hosonaga",
          "present": []
        },
        {
          "testimony": "That's basic knowledge that any medical research assistant with an ounce of sense ought to know.",
          "person": "Hosonaga",
          "present": []
        },
        {
          "testimony": "In other words, there's no good reason why the defendant would have tried to pull the knife from the victim.",
          "person": "Hosonaga",
          "present": [
            "Poison Article"
          ],
          "source": {
            "evidence_span": "An article about poison that was stolen from a laboratory at Yumei University. The reporter, Menimemo-san, based it on information he gleaned by eavesdropping. The article reveals the following property about the poison in question: When the toxin enters the body on a knife laced with the poison, it's rapidly absorbed and causes death in minutes.",
            "testimony_span": "In other words, there's no good reason why the defendant would have tried to pull the knife from the victim.",
            "explanation": "If the knife is laced with the poison, the defendant would have had a reason to pull the knife out of the victim. The poison would have been absorbed into the body, and the defendant would have wanted to save the victim's life.",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "Let's not forget that the young student did have a motive for killing the victim.",
          "person": "Hosonaga",
          "present": []
        },
        {
          "testimony": "The man the victim murdered nine months ago, Dr Wilson, was the defendant's highly respected mentor.",
          "person": "Hosonaga",
          "present": []
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Hosonaga is testifying about the events that took place on the day of the incident.",
      "labels": [
        "object property"
      ],
      "reasoning": [
        "Fact 1: The witness claims the defendant had no reason to pull the knife from the victim.",
        "Fact 2: The evidence suggests the knife was laced with poison.",
        "Prop 1: If one is stabbed with a poisoned knife, then one possible reason to pull the knife out is to save the victim's life."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "Hosonaga:\nPulling a blade from a wound without thinking could cause heavy bleeding.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nYou say doing it without thinking could be a problem... Does that mean that if you used due care and attention it would be alright?\nHosonaga:\nI wouldn't have thought this needed spelling out, really, but... ...the blade is like a stopper in the wound. Remove it, and a serious haemorrhage will occur. In other words, a medic would need to be present before any attempt was made to withdraw the blade. Doing it without thinking would be madness. You just can't do it.\nRyutaro:\nOh! Well...thank you for such a thorough explanation.\nAuchi:\nYou see, Counsel? When you act without thinking, the result is a bloodbath.\nRyutaro:\nUgh...\nJudge:\nBack to the witness testimony, please.Hosonaga:\nThat's basic knowledge that any medical research assistant with an ounce of sense ought to know.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nIn that case, there's an obvious explanation here.\nHosonaga:\n...Which is?\nRyutaro:\nClearly...the defendant, Rei Membami-san, does not possess an ounce of sense!\nHosonaga:\n......... What do you think about that, Professor Mikotoba?\nMikotoba:\nI'm not sure that you should be labelling your best friend as lacking in common sense.\nRyutaro:\nWell, I thought it would be better than labelling her as a murderer.\nAuchi:\nI don't know, young people today... If that's friendship, I don't understand it.\nJudge:\nCareful, Counsel. A lack of common sense can be a very dangerous thing.\nRyutaro:\n(Oh dear... That recoiled on me rather badly.)\nMikotoba:\nThat's life, I'm afraid. A lesson everyone must learn.\nHosonaga:\nHopefully you can see now that this is really basic medical knowledge. Being involved in medical research, Membami-san would certainly have been aware of it.Hosonaga:\nIn other words, there's no good reason why the defendant would have tried to pull the knife from the victim.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nBut the defendant had suddenly encountered somebody she knew lying on the ground, bleeding to death. The sight could have shocked her delicate sensibilities, causing her to remove the blade inadvertently.\nHosonaga:\nI really don't think 'inadvertent' actions can explain this. The woman is a medical research assistant. I can't imagine she would behave so irrationally.\nRyutaro:\nOh, but irrational behaviour is a woman's prerogative, isn't it?\nHosonaga:\nOh dear...you have a lot to learn about women. Only a small-minded man could have such bigoted views.\nRyutaro:\n(Oh dear...perhaps I'm letting my male persona take hold a little too much...)\nHosonaga:\nWell...have I managed to convey the basics now? That should cover the medical side of the argument.Present Poison Article\n\n\n\n\n\n\n\nRyutaro:\n\nLeads to:\n\"No. There is one possibility.\"Hosonaga:\nLet's not forget that the young student did have a motive for killing the victim.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nWhatever the motive, it just isn't in Membami-san's nature to do something so awful!\nHosonaga:\nBut she had both motive and opportunity. That's very hard to argue against.\nRyutaro:\nBut you don't know the defendant!\nAuchi:\n\nAuchi:\nAnd you, Counsel, do not appear to know the law!\nRyutaro:\n...!\nHosonaga:\nYes, evidence is the only way to convince the court of your argument. Not feelings.\nAuchi:\nWith this...fledgling to defend her, I would almost say I pity the accused.\nRyutaro:\n(So do I...)\nJudge:\nInspector, you will reiterate your point about the defendant's motive, please.\nHosonaga:\nAh, yes. Miss Brett was in many ways the sworn enemy of Membami-san.Hosonaga:\nThe man the victim murdered nine months ago, Dr Wilson, was the defendant's highly respected mentor.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nWell...yes, that's true. Dr Wilson recognised Membami-san's talent and offered her the position of assistant despite her being a woman. She was extremely grateful to him.\nHosonaga:\nYes, the Englishman appears to have been a very broad-minded individual.\nMikotoba:\nDr Wilson had no time for outdated traditions. He met with opposition of course, but he believed firmly in Membami-san's abilities.\nHosonaga:\nClearly the defendant was in the man's debt. Which only serves to prove my point.Ryutaro:\n(This is hopeless! I can't find a single crack in this testimony anywhere! If Rei knew that withdrawing the knife from the wound would threaten Miss Brett's life further... ...I just can't think of any way to explain why she did it.)Mikotoba:\nSusato. It's at times like these when it's especially important to remember the fundamentals.Ryutaro:\nThe fundamentals?Mikotoba:\nEvidence is what counts in the courtroom, isn't it?Ryutaro:\nOf course! But I've been through the Court Record dozens of times already!Mikotoba:\nI think perhaps you're forgetting something, though. You needn't take the evidence at face value. You can and must examine it in greater detail, too.Ryutaro:\nAh!Mikotoba:\nI realise this is your first time playing the role of lawyer in the courtroom. So if you need reminding of the rudiments, you need only ask. I'll do my very best to help.Ryutaro:\n(Examine the evidence in the Court Record...? It's an idea, certainly. What should I do?)Ask for a refresher\n\n\n\n\n\n\n\nRyutaro:\nYes, Father...Spartan guidance is what I need!\nMikotoba:\nI, I think that might be overdoing it slightly, but... Very well. So, open the Court Record first of all with [R / R1 / E]. Now, let's take a look at the fountain pen which was submitted as evidence most recently. Simply press [A / X / space] to 'Examine' it further. That's all there is to it.\nRyutaro:\nYes, the initials 'R. M.'... There they are, clearly engraved on the barrel.\nMikotoba:\nBy using [right analog stick / arrow keys], you can look at a piece of evidence from all angles. You should have a good look at everything to make sure you haven't missed any clues.\nRyutaro:\nYes! I will! (I just need to rotate the pen with [right analog stick / arrow keys] and watch closely for anything out of the ordinary, then...)\n\n\n\nExamine emblem on finial\n\n\n\n\n\n\n\nRyutaro:\nThere's some sort of emblem here, look. But...it isn't a Yumei University one!\nMikotoba:\nIt must belong to some other organisation, I suppose. A business of some kind... But that would seem to imply that the pen doesn't in fact belong to Rei.\nThe details of the fountain pen have been updated in the Court Record.\n\n\n\n\nExamine emblem on finial (subsequent times)\n\n\n\n\n\n\n\nRyutaro:\nThere's some sort of emblem here, look. But...it isn't a Yumei University one!\nMikotoba:\nIt must belong to some other organisation, I suppose. A business of some kind... But that would seem to imply that the pen doesn't in fact belong to Rei.I know what to do\n\n\n\n\n\n\n\nRyutaro:\n(Come to think of it... ...Kazuma-sama and Naruhodo-san were always turning evidence over and over in their hands. Yes, I need to 'Examine' things in greater detail with [A / X / space]...)\nMikotoba:\nAh...by the look in your eyes, I see it's coming back to you. Go through the Court Record again and have a thorough look at everything. You may just find a clue.\nRyutaro:\nYes! I'll do it straight away!Examine evidence\n\n\n\n\n\n\n\n\n\nSoseki Natsume Article\n\n\n\n\n\n\n\n\n\nFront page\n\n\n\n\n\n\n\nRyutaro:\n'Raucous England Returnees Tell All'... This is the interview with you and Soseki-san, is it, Father? It looks as though it was quite an exchange.\nMikotoba:\nYes, he became a little over-animated when he was talking about his time in England. The photographer managed to capture the moment his hand karate-chopped me on the neck.\nRyutaro:\nI do hope you weren't hurt.\n\n\n\n\nBack page\n\n\n\n\n\n\n\nRyutaro:\n(This is the newspaper from Soseki-san. There seems to be an important article on the back page as well...) 'Exclusive! Deadly Poison Stolen from Yumei Medical Research Laboratory!' From Yumei's Medical Research... Father, isn't that your lab?\nMikotoba:\nWhat the...? Let me see that! The, the poison's been stolen?!\nRyutaro:\nIt's this morning's paper that Soseki-san gave us. Are you saying...you didn't know?\nMikotoba:\n...As embarrassing as that is for the head of the laboratory, I didn't. I've not heard any such thing. Where on earth could the reporter have gleaned his information?\nRyutaro:\nCome to think of it... ...there was no article mentioning this story in our paper this morning, was there?\nMikotoba:\nIt's a highly toxic poison we've been working on in the strictest confidence. I'd put Rei in charge of the project.\nRyutaro:\nRei! She was managing it?\nMikotoba:\nIf what's written here is true... ...it means that she tried to hide the theft from me. And moreover...the details were leaked somehow.\nRyutaro:\nI, I don't believe it!\nMikotoba:\nWe need to read this article very carefully.\nThe article about the poison has been entered into the Court Record.\n\n\n\n\nBack page (subsequent times)\n\n\n\n\n\n\n\nRyutaro:\n'Exclusive! Deadly Poison Stolen from Yumei Medical Research Laboratory!' I can't believe you knew nothing about this, Father.\nMikotoba:\nNothing was reported to me. It seems an attempted cover-up was at play.\nRyutaro:\nThis is extraordinary...\nMikotoba:\nWhat I'd really like to know is...how a reporter found out about it. Well, however it happened... ...I have to take full responsibility. There'll be serious consequences for sure.\nRyutaro:\nOh, Father...\n\n\n\n\n\nFountain Pen\n\n\n\n\n\n\n\n\n\nLid\n\n\n\n\n\n\n\nRyutaro:\nIf we take off the pen's lid...\n\n\n\nBarrel\n\n\n\n\n\n\n\nRyutaro:\nNow let's unscrew the barrel, shall we?\n\n\n\nInkwell\n\n\n\n\n\n\n\nRyutaro:\nThis must be the little reservoir that holds the ink.\nMikotoba:\nYes, you fill it by drawing ink from a bottle up through the nib. .........\nRyutaro:\nIs something wrong, Father?\nMikotoba:\nJust that there doesn't actually appear to be any ink in there, that's all.\nRyutaro:\nOh yes, you're right. It's pretty much empty. (Well, it could be on the verge of running out, I suppose...)\nThe details of the fountain pen have been updated in the Court Record.\n\n\n\n\nInkwell (subsequent times)\n\n\n\n\n\n\n\nRyutaro:\nThis must be the little reservoir that holds the ink.\nMikotoba:\nYes, you fill it by drawing ink from a bottle up through the nib. .........\nRyutaro:\nIs something wrong, Father?\nMikotoba:\nJust that there doesn't actually appear to be any ink in there, that's all.\nRyutaro:\nOh yes, you're right. It's pretty much empty. (Well, it could be on the verge of running out, I suppose...)\n\n\n\n\n\n\nEmblem on finial (if not already examined yet)\n\n\n\n\n\n\n\nRyutaro:\nThere's some sort of emblem here, look. But...it isn't a Yumei University one!\nMikotoba:\nIt must belong to some other organisation, I suppose. A business of some kind... But that would seem to imply that the pen doesn't in fact belong to Rei.\nThe details of the fountain pen have been updated in the Court Record.\n\n\n\n\nEmblem on finial (subsequent times)\n\n\n\n\n\n\n\nRyutaro:\nWell, we know for certain that this emblem isn't that of Yumei University.\nMikotoba:\nThe police really ought to have spotted that.\nRyutaro:\nThey were obviously convinced of Rei's guilt from the outset.\n\n\n\n\nInitials\n\n\n\n\n\n\n\nRyutaro:\nThe 'R. M.' initials are very clearly engraved here.\nMikotoba:\nAnd the fact that Miss Brett was clinging to this pen in her dying moments is very clearly a message, too.\nRyutaro:\nTo identify her killer, you mean?\nMikotoba:\nI don't think there can be any doubt that this is a key piece of evidence in this case.\n\n\n\n\nInitials (subsequent times)\n\n\n\n\n\n\n\nRyutaro:\nThe 'R. M.' initials are very clearly engraved here.Ryutaro:\nNo. There is one possibility. One very good reason why the defendant might have decided to withdraw the knife from the victim's wound!Hosonaga:\nWhat?!Auchi:\nHah! The yokel not only has a poor grasp of the law, but is also a poor loser! Tell us, then! What 'possibility' do you think you've identified?Ryutaro:\nIt's here...in this newspaper article. An article about a deadly poison having been stolen from a laboratory at the Imperial Yumei Uni-Auchi:Auchi:\nThe victim perished from a stab wound. Poison has no relevance in this case!Ryutaro:\nBut...Judge:\nProsecutor Auchi. You will let the defence speak.Auchi:\nBut, but a newspaper article! The court cannot rely on the kind of hearsay those wretched publications carry.Judge:\nCounsel for the Defence... ...I am going to need some tangible basis for your claim. You will indicate to the court precisely what part of the newspaper article mentioned affirms your assertion.Auchi:\nYour Excellency!Ryutaro:\nYes, of course. ...Thank you! (Rei would never have done something to further endanger Miss Brett's life without just cause.) The reason why the defendant pulled the knife from the victim's body is explained in the article where it says...'Poison Stolen from Laboratory!'\n\n\n\n\n\n\n\nRyutaro:\nThe poison was apparently stolen from a medical research laboratory at Yumei University.\nJudge:\nYes, it would seem so. Calling the department's security practices into question.\nAuchi:\nThe very department of the professor standing so nonchalantly opposite me, I believe.\nMikotoba:\nAgh! Susa- Ryutaro...\nRyutaro:\nOh! Yes, Father?\nMikotoba:\nWas there some reason you felt it necessary to highlight the fact that the theft occurred in my department?\nRyutaro:\n......... How can I explain it...? It was the first detail I cast my eye over...I suppose...\nMikotoba:\nI suggest you read the article again. Carefully!\nRyutaro:\nI'm so sorry! (Oh dear. Father's fuming...)\nLeads back to:\n\"The reason why the defendant pulled the knife from the victim's body is explained in the article where it says...\"'Deadly in Tiny Quantities!'\n\n\n\n\n\n\n\nLeads to:\n\"The article reveals the following property about the poison in question:\"'Why is the Poison Being Developed?'\n\n\n\n\n\n\n\nRyutaro:\nAccording to the article, the development of the poison was requested by the military.\nJudge:\nHmmm... Yes, a troubling revelation indeed.\nRyutaro:\nOh, it's very worrying...\nAuchi:\nAnd yet, even more worrying... ...is how this yokel is trying to manipulate the court with nothing more than rumours!\nRyutaro:\nAAAAAAGH! (But I feel sure Rei had a good reason for her actions. And I feel sure the explanation is somewhere in this newspaper article!)\nMikotoba:\nTry reading the article again.\nRyutaro:\nYes!\nLeads back to:\n\"The reason why the defendant pulled the knife from the victim's body is explained in the article where it says...\"Ryutaro:\nThe article reveals the following property about the poison in question: When the toxin enters the body on a knife laced with the poison, it's rapidly absorbed and causes death in minutes.Hosonaga:\nAre, are you suggesting...?Ryutaro:\nIf the knife used to attack Miss Brett was laced with this very poison... ...it would explain why the defendant, Membami-san, would have withdrawn the blade as soon as possible. ...Yes, the truth is... ...it was an attempt to stop the poison from entering the victim's body!Hosonaga:\nWHAT?!Auchi:Auchi:\nThis is complete and utter nonsense!Ryutaro:\nNot at all! The defendant withdrew the knife blade from the victim's body not to accelerate the woman's demise... ...but to save her life! And the prosecution cannot deny the possibility!Auchi:\nHave you not read the post-mortem report? The cause of death was haemorrhage! The word 'poison' appears nowhere in the document!Ryutaro:\nWell, well that's... That's because by acting quickly to remove the blade, the defendant prevented the poison from taking hol-Auchi:Auchi:\nOh please! This is clearly desperation! The weasel's last breaking of wind! Poison has nothing whatsoever to do with this case, as I believe the defence is well aware! We have no proof that the information in this wretched newspaper article is at all reliable anyway.Hosonaga:\nIn that situation, what the student should have done is wait for medical assistance to arrive. But instead, you claim she suspected poisoning and took the potentially lethal decision to remove the blade. She must have had a strong reason for her suspicions then, or the argument makes no sense.Auchi:\nExactly! Well put, Inspector! On what grounds did she do it, hm, yokel?Ryutaro:\n(Why DID Rei suspect the stolen poison was involved...?) If you want grounds... I'll give you grounds.Hosonaga:\nWhat?Auchi:\nYou...you can't possibly...Judge:\nFrom your expression, Counsel, it would appear those are not empty words.Ryutaro:\n.........Judge:\nBut naturally, as you stand in this courtroom as a lawyer, you must be aware... ...that words alone, empty or not, are of no value in our modern justice system. The court demands evidence.Ryutaro:\nYes, Your Excellency. (I'm well aware of that. I've seen it many times...from my place at his side in the Old Bailey.)Judge:\nIn that case, Counsel, you will present the proof to the court now. What evidence demonstrates a clear link between this case and the poison in the newspaper article?Present Post-Mortem Report\n\n\n\n\n\n\n\nRyutaro:\n\nLeads to:\n\"I would ask the court to refer to the 'Notes' section of the post-mortem report, which reads:\"Present anything else\n\n\n\n\n\n\n\nRyutaro:\n\nJudge:\n...How exactly would you explain this piece of evidence's connection to the newspaper article?\nRyutaro:\nIn truth...I'm not really sure. But my father always taught me to ask my elders whenever I was in trouble. So I thought I should ask your opinion, Your Excellency.\nJudge:\nIf it is advice you seek, Counsel, then I suggest that before indiscriminately thrusting evidence under my nose... ...why not thrust it under the nose of the professor at your side?\nRyutaro:\n...I think he means you.\nMikotoba:\nGood grief, thrusting that under MY nose isn't going to solve anything here! We must use our heads. The article in the paper had details of the toxin. Now, where have we seen similar details... Does nowhere come to mind?\nRyutaro:\nAh, you mean I ought to search through all the evidence looking for that?\nJudge:\nIf I'm not mistaken, it appears the advice of your elders has given you an idea.\nRyutaro:\nYes! I'd like another chance to present evidence, if I may, Your Excellency.\nLeads back to:\n\"In that case, Counsel, you will present the proof to the court now.\"Ryutaro:\nI would ask the court to refer to the 'Notes' section of the post-mortem report, which reads: 'Extreme miosis - pupil constriction - was observed in the victim.'Hosonaga:\n...Ah!Ryutaro:\nClearly, being a yokel with no knowledge of forensic science, I have no idea, so please, do tell me... Presumably, the fact that this condition of the victim was noted in the post-mortem report... ...means that it's an unusual symptom of death?Auchi:\n...Tsk! Well...Hosonaga:\nUnder normal circumstances, the pupils dilate when someone dies. If there was extreme constriction instead...that's most certainly unusual, yes.Auchi:\nWhat are you doing, you yokel detective?!Ryutaro:\nIn the newspaper article, there's the following information about the stolen poison: 'Onset of symptoms occurs in minutes...ending with acute contraction of the pupils prior to death.'Auchi:\nWhat?!Ryutaro:\nIf the defendant, upon seeing the victim stabbed in the back... ...happened to notice that the pupils of Miss Brett's eyes had constricted severely...Mikotoba:\n...Yes, as a medical research assistant, she would have suspected poison immediately. Without doubt.Auchi:\nHnnn...grrr...Ryutaro:\nProsecutor Auchi! I think you'll agree...this is very compelling evidence!Auchi:\nTsk! You... You... Yokel student and yokel professoooooor!!!Judge:\nI believe the defence has expertly demonstrated a credible reason for the defendant's actions.Auchi:\nNo...Judge:\nYujin Mikotoba...Mikotoba:\nYes, Your Excellency?Judge:\nI believe you are best placed here to confirm or deny the veracity of the defence counsel's argument. You will tell the court the truth about the details reported in this newspaper, please.Mikotoba:\n......... It pains me to have to admit it... ...but I'm afraid I don't know.Judge:\nYou don't know?Mikotoba:\nThe toxin was kept under lock and key in my laboratory, certainly. But I was unaware of any theft.Judge:\nDo you mean to tell the court that the reports of this theft are unfounded?Mikotoba:\nNo, Your Excellency. Without returning to the laboratory to investigate myself, I couldn't say.Auchi:\nHah! Listen to the bumbling academic! Unaware of the theft of secret state research from his own workplace until he reads of it in the newspaper!Mikotoba:\n...I take full responsibility for the incompetence of my supervision.Ryutaro:\nFather...Auchi:\nTsk! A pitiful situation for a university professor. You should have more control over your students... rather than allowing them off on killing sprees!Ryutaro:\nThat's, that's totally unfounded-???:Rei:\nNone of this is Professor Mikotoba's fault! It's all... It's all MY fault!Ryutaro:\nRei...Judge:\nMembami-san! You stand accused here! Outbursts like this will not be tolerated!Rei:\n......... But...it was me. I was the one who noticed that the poison we were developing had been stolen that day.Judge:\nWhat?!Ryutaro:\nSo you knew...Rei:\nI'd, I'd been placed in charge of overseeing the project. It was the day that the professor and Soseki-san were interviewed together for the newspaper. That's when I noticed that some of the poison was missing. Just a tiny amount, it was.Mikotoba:\nWhy didn't you let me know immediately?Rei:\n......... I...I was scared. The whole project was supposed to be confidential, but some of the toxin had somehow been taken... So...I decided I'd try to get it back before anyone else found out. Because I had a very good idea who the thief was!Ryutaro:\nThe thief... You, you don't mean...?Rei:\nYes, of course. It was that dainty Englishwoman!Judge:\nMiss Jezaille Brett?Rei:\nThat's why I decided to join the little group of people going to the seaside. Inside the beach hut, I confronted Miss Brett. But she just sat on a stool at the back of the hut, smiling sweetly at me as if she knew she was untouchable.I know it was you who stole the poison!Well now... whatever do you mean?Rei:\nAnd then... ...she suddenly got to her feet... ...before falling to her knees in front of me and...then collapsing on the floor.Ryutaro:\n...!Rei:\nThat's when I saw the knife in her back. I couldn't understand what had just happened. And then...a moment later, I was seized with fear. The pupils of her eyes had... They'd shrunk to tiny pinpoints.Mikotoba:\nI don't believe it...Judge:\nIn other words, you realised that the victim was suffering the effects of the stolen poison.Rei:\nMy mind started racing... I hadn't seen anything pass Miss Brett's lips whilst I'd been with her. Which left only one possible way for the poison to have entered her body.Ryutaro:\nOn the blade of the knife in her back...Judge:\nAnd that train of thought was what spurred you to withdraw the blade.Rei:\nYes. If the amount that had entered her bloodstream was small enough, she might still have a chance... That's what I hoped. Really... I... I'm so sorry for staying silent all this time!Ryutaro:\n.........Auchi:\n.........Judge:\n......... Your attempt to hide the truth of what happened is not something that can be overlooked. However, I have duly noted the courage with which you confessed in the end.Rei:\n...Thank you, Your Excellency!Ryutaro:\n(It's barely perceptible, but I do think... ...the balance has shifted a little here in this courtroom now.)Auchi:Auchi:\nYour Excellency, do not be deceived! The victim just collapsed before your eyes, you say? Well, Membami-san, if that is the case, perhaps you could explain how Miss Brett came to be stabbed?Rei:\nWell, um...Auchi:\nYou have no answer because the simple truth...is that YOU stabbed the victim motivated by revenge!Ryutaro:Ryutaro:\nBut you have no conclusive evidence to prove that assertion, do you?Auchi:\n......... Oh, I have evidence. And it is very much conclusive!Ryutaro:\n...! (What's the prosecution counsel up to...? It was brief, but he hesitated for a moment there, I'm almost sure of it...)Judge:\nYou will produce the aforementioned evidence at once, Prosecutor Auchi.Auchi:\n......... Perhaps some praise is due, young yokel student.Ryutaro:\nWhat?Auchi:\nI had imagined there would be no need for me to submit this evidence. But you've brought this on yourself!What the...?Could a more damning shot exist?The cruelty in the air on that beach is almost palpable...Auchi:\nThis evidence, more than any other, reveals the true extent of the accused's murderous nature. For it shows the precise moment that Membami-san plunged her dagger into the victim's back!Rei:\nNo, that's not true! No!Ryutaro:\nI, I don't believe it... AAAAAAAAAAAAAH!!!Judge:\nOrder! Order! Order! Counsel for the Defence, was it you who was responsible for that shrill scream that just pierced my courtroom?Auchi:\nPerhaps his voice has yet to break? These yokels are slow of mind and slow to mature.Ryutaro:\n(I'll show you who's slow to mature...)Mikotoba:\nCareful now. Susato is starting to show her face here.Judge:\nIt is often said that a picture is worth a thousand words. And here we have ample proof. The court will accept this extremely cogent photographic print as evidence.The incriminating photograph has been entered into the Court Record.Ryutaro:\n(I can't believe he's had a photograph like that up his sleeve the entire time. It's such a stark image, I'm genuinely lost for words...)Rei:\nWait a minute! I, I don't understand. How did you...? I mean, who took that photograph?!Ryutaro:\n...! (Rei...)Auchi:Auchi:\nThat's of no importance here. Stop trying to divert attention!Rei:\nOh...Ryutaro:Ryutaro:\nThat's an absurd thing to say! It's crucially important! Whoever took this photographic print was a witness to Miss Brett's death! The court must be allowed to hear this person's testimony!Auchi:\nArgh!Judge:\nI will uphold the defence's demand. The prosecution will reveal the identity of the person responsible for taking this photograph at once!Auchi:\n......... Well...I'm afraid I can't do that.Ryutaro:\nPardon?Auchi:\nYou see, this print arrived at the Imperial Police Bureau headquarters by express post yesterday. But there was nothing to indicate the sender's name or address. The provenance of the print is unknown.Judge:\nGoodness...Ryutaro:\nAre we to understand then, Counsel... ...that in full knowledge of the fact that this photograph has the murkiest of origins... ...you nevertheless believe it fit for submission as evidence in the Supreme Court?Mikotoba:\nWhen you first produced that print before, I noticed that you hesitated for a brief moment. Because you knew that it wasn't completely reliable evidence, didn't you?Auchi:\nSilence...you yokel student and blabbering professor! What matters is the blatant truth that this print so eloquently expresses.Ryutaro:\nBut the defendant has already admitted to pulling the blade from the wound. Clearly this isn't the moment that the knife was plunged into the victim's back, but-Auchi:\nThe moment it was withdrawn? Don't waste this court's time with your ramblings!Judge:\nIndeed. Without knowledge of who produced this print, we have no means of verifying the claim. And the scene it captures is without doubt the most compelling evidence presented to the court. If the defence is unable to shed any further light on the matter, I believe the conclusion is clear.Ryutaro:\nOh no!Mikotoba:\nSusato... This is the time for you to fight. If what you've established so far is true, then there can be no doubt... ...this photograph shows the moment that Rei withdrew the blade from the victim.Ryutaro:\n...! (Yes, we just need to prove that somehow...)Auchi:\nTsh...huh...huh... You'll have plenty of time to rue your defeat on the slow train back to the provinces. And to rue the day you came up against Taketsuchi Auchi in a court of law!Ryutaro:\n(If I can't determine who took this photograph, then the trial is going to come to an end. There must be a clue somewhere. There must be some way of working out who took it!)Judge:\nWell, Counsel?Ryutaro:\n......... Your Excellency... The burning question is who took that photograph. And the truth is...I don't know\n\n\n\n\n\n\n\nRyutaro:\n......... (No... If I give up now... ...I'll never be able to look Rei in the eye again!)\nMikotoba:\nSusato, you need to steel yourself and summon your best argument.\nRyutaro:\nI'll do my best!\nLeads to:\n\"This isn't about whether I can or can't come up with the answer now...\"I have the answer\n\n\n\n\n\n\n\nLeads to:\n\"This isn't about whether I can or can't come up with the answer now...\"Ryutaro:\n(This isn't about whether I can or can't come up with the answer now... I simply have to!) The identity of the person who took this dramatic photographic print... ...is, I assure you...something the defence can and will reveal!Auchi:\nWha...? No... You can't possibly! But as you so boldly claim that you can...please, do enlighten us!Ryutaro:\nUnfortunately, I'm unable to present a name.Auchi:\nHow utterly underwhelming. Did you really believe you could-Ryutaro:\nHowever! I am able to present evidence. The defence has a piece of evidence that reveals important details about the photographer's identity.Auchi:\nWha...?Judge:\nVery well then, Counsel. Present your proof to the court. Which piece of evidence do you claim reveals something about the identity of the mystery photographer?Present Soseki Natsume Article\n\n\n\n\n\n\n\nRyutaro:\n\nLeads to:\n\"What is that?\"Present anything else\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nThe piece of evidence in question...is this!\nJudge:\n......... I'm afraid, Counsel, that when presenting evidence, you must learn to temper those wide, nervous eyes.\nRyutaro:\n.........\nJudge:\nI'm obliged to penalise you for the lack of focus in both your eyes and your answer.\nAuchi:\nWould you care to squeeze your head in your hands again, Counsel? To punish yourself for presenting such utterly irrelevant evidence.\nRyutaro:\nUgh! I'll squeeze my head as many times as it takes to win this trial! ...Your Excellency! May I?\nJudge:\n...You may present another piece of evidence. But no more squeezing, Counsel.\nLeads back to:\n\"Which piece of evidence do you claim reveals something about the identity of the mystery photographer?\"Judge:\nWhat is that? The newspaper again? 'Raucous England Returnees Tell All'...Ryutaro:\nIt's not the headline that's relevant here, Your Excellency. It's the photograph. If you look at it closely, you'll notice that there are some white lines on the right-hand side.Judge:\nAh, yes, indeed. They had already caught my eye, as it happens.Auchi:\nHah! What of it? A shadow of some kind, presumably. From the branches of a tree or the like.Mikotoba:\nThere are no trees growing inside my laboratory at the university, I can assure you.Ryutaro:\nNow...if you look closely at this photograph...Judge:\n......... ...Good gracious!Ryutaro:\nYes, exactly the same pattern of lines is present on this photograph, too.Auchi:Auchi:\nWell... Well... That, that tells us nothing! H-Hah! Yes, it's a shadow of some kind, definitely! From the branches of a tree!Ryutaro:\nThere wouldn't be any trees growing inside a hut at the beach, Counsel.Auchi:\nNnnf!Judge:\nWhat's quite remarkable about it, is that the two patterns are absolutely identical. How could such an extraordinary similarity have transpired?Ryutaro:\nThe curious matching pattern that appears on both photographic prints is a result of...The photographer's technique\n\n\n\n\n\n\n\nRyutaro:\nI believe...the pattern may be the result of a particular quirk of the photographer when taking a picture.\nAuchi:\nYou believe?\nJudge:\nWhat quirk could possibly produce such consistent markings?\nRyutaro:\nClearly, it must be a quirk that's quite unimaginable!\nJudge:\nI repeat, Counsel. What would be the nature of this quirk?\nRyutaro:\n......... Well, um...I... I can't really imagine, of course.\nAuchi:\nBecause there is no such quirk!\nMikotoba:\nIt's time to consider another, more credible option, I think.\nLeads back to:\n\"The curious matching pattern that appears on both photographic prints is a result of...\"A camera defect\n\n\n\n\n\n\n\nLeads to:\n\"Obviously, it must be due to a problem with the camera used to take the photographs.\"Some tree branches\n\n\n\n\n\n\n\nRyutaro:\nClearly, the branches of a tree have caused this pattern!\nAuchi:\n\nAuchi:\nAn argument I put forward myself only moments ago, to much ridicule!\nJudge:\nIndeed. ...There was considerable ridicule involved.\nRyutaro:\nWell... It's hard to think of another explanation.\nAuchi:\nWell then...'hard' luck!\nMikotoba:\nYou pointed out yourself that no trees would be growing inside a beach hut.\nRyutaro:\nOh dear... Sorry... (What was I thinking?)\nMikotoba:\nIt's time to consider another, more credible option, I think.\nLeads back to:\n\"The curious matching pattern that appears on both photographic prints is a result of...\"Ryutaro:\nObviously, it must be due to a problem with the camera used to take the photographs.Auchi:\nWith, with the photographic device...?Mikotoba:\nYes, we can confidently say that the camera's lens must be scratched. And that the scratched lens causes unwanted lines to appear on every print taken with the device.Ryutaro:\nIn short... The two photographs under consideration here... ...were taken with the same camera!Auchi:\nHnnngh... Hnnnnnngh... B-But... ...there must be hundreds of such camera devices here in the capital! It would be utterly impossible to identify the owner of this particular one!Ryutaro:Ryutaro:\nI think you're forgetting, Prosecutor Auchi... ...that one of the photographs featured in a newspaper article.Auchi:\nA newspaper... Ah!Ryutaro:\nThat's right. The author of that article is the mystery witness to this crime!Auchi:\nWha... WAAAAAAAAAAAAGH!...Menimemooooooh!Judge:\nI, I see why you were called a 'raucous England returnee'...Auchi:\nWhat are you yelling about? You've already testified!Soseki:\nIt's Menimemo, I tell you! MENIMEMO!ME...NI...ME...MO!Ryutaro:\nUm...Soseki-san...what was that? Did you say 'Menimemo'?Soseki:\n...Ever since I returned to Japan... ...a reporter from the Shoyu News has been hounding me, following my every move! A reporter by the name of Raiten Menimemo. Yes, hounding me from dawn till dusk!Ryutaro:\nAh! (Now that he mentions it...)Soseki:\nThey secretly spy! Snap shots! Scribble stories! And scupper my privacy!Ryutaro:\n(Could that same reporter be...?)Soseki:\nA camera to the left of him! A notebook to the right! There I am, stuck in the middle with... Raiten Menimemo!Judge:\nSo you're saying that this picture was taken by-Soseki:\nBy MENIMEMO! YES! ...My Lord, Your Excellency, Esquire!Judge:\nOfficer! Find this newspaper reporter at once and bring him to my courtroom! We will adjourn for a short recess in the meantime.Ryutaro:\nOh... Yes, Your Excellency!Auchi:\nAs, as you say, Your Excellency...Judge:\nAnd one more thing... I want this knife - the murder weapon - examined for traces of poison! You will solicit the assistance of the imperial university's medical department for the task. ...Understood?Auchi:\n......... Meh... Menimemooooooh!!!To be continued...13th August, 10:41 a.m.\nSupreme Court of Judicature, Defendants' Antechamber 3Rei:\n...I'm so sorry, Susato. I should have told you about the toxin.Susato:\nRei...Rei:\n.........Mikotoba:\nYou have a strong sense of responsibility, I know. That's why you decided to shoulder the burden alone.Rei:\nNo! That's not it at all! I... I was just... I was scared of my failure coming to light, that's all. So I hoped to retrieve the substance from the Englishwoman before anyone found out.Mikotoba:\n.........Rei:\nBefore the trial started, do you remember what you said, Susato? That you had no doubt in your mind about my innocence. That you'd stand by me to the last.Susato:\n...I remember.Rei:\nAnd yet I... I didn't deserve your trust in me. I hid important details from you, Susato. I completely betrayed your faith in me. Hit me, Susato! I deserve it! No, in fact, throw me to the floor! No, that's too good for me as well! Drag me through the city streets!Susato:\n...I'm no better, you know.Rei:\nOh!Susato:\nEven though in my heart I knew that you'd pulled the knife blade from Miss Brett's back... ...there was just a brief moment when, in my mind... I doubted you.Rei:\nSusato!Susato:\nI'm sorry. After I stood here and promised you that I'd stand by you and always be on your side... I betrayed your faith in me, too. And as such, I've failed you as a lawyer.Rei:\nOh no no...Mikotoba:\nI think this situation has taught both of you a valuable lesson. Placing your unbridled faith in another is no easy task.Susato:\n...Yes, Father. That fact has certainly struck home. Which is why I can see more clearly now. So...Rei...Rei:\nYes?Susato:\nCan you find it in your heart to forgive me?Rei:\n......... Oh, Susato... ...you know you'll always be a gallant, dashing lawyer in my eyes now!Susato:\n(Oh, Rei...)Rei:\n......... I was so scared, you know, when it happened. I didn't know what was going on. The Englishwoman was sitting at the back of the hut, listening to what I was saying.I know it was you who stole the poison!Well now...whatever do you mean?Rei:\nAnd then a moment later... ...she suddenly got to her feet... ...before collapsing on the floor in front of me...with a knife in her back.Rei:\nIt all happened right before my eyes.Susato:\nAnd...you were the only people in the hut at the time?Rei:\nThat's right. Just Miss Brett and myself. There was no one else. So I just don't understand how she could possibly have been stabbed like that.Mikotoba:\nHm... A great mystery indeed.Rei:\nI still can't believe it happened. That's why I just couldn't bring myself to speak up.Susato:\n......... It will be alright. However it happened, and whatever really went on by the sea that day... ...I promise you that I'm going to prove everything you've said you saw is true!Mikotoba:\nSpoken like a true Mikotoba. Now, I think we should discuss what's coming up in the trial, don't you? We don't have much time. We must make sure we have our facts in order.Susato:\nYes! I expect the poison is going to come under close scrutiny in the upcoming proceedings. The police should hopefully have identified it on the blade by now.Rei:\nThe trouble is, it's a completely new laboratory-synthesised blend of alkaloids. The police won't have any way of testing for it.Susato:\nOh...I see...Mikotoba:\nYes, without this chemical reagent, it's impossible to detect the toxin.Susato:\n'Chemical reagent'?Mikotoba:\nI sent a colleague of mine off with some earlier to deliver to police headquarters. I think perhaps you should have some as well, though, just in case.The chemical reagent has been entered into the Court Record.Susato:\n.........Examine evidence\n\n\n\n\n\n\n\n\n\nChemical Reagent\n\n\n\n\n\n\n\n\n\nLabel\n\n\n\n\n\n\n\nRyutaro:\nThe label appears to be written in a foreign language that I don't know.\nMikotoba:\nIt's German, so your knowledge of English is going to be of little help here, I'm afraid.\nRyutaro:\nCouldn't you just have written 'Medicine' on it in Japanese? Then we'd all be able to read it.\nMikotoba:\nGerman is the international language of medicine, my dear. But yes, I can certainly see the merit in labelling the bottle in Japanese. ...Though I'm not sure 'Medicine' would be entirely appropriate...Mikotoba:\nWhat's the matter, Susato? You're suddenly very quiet.Susato:\nIt's this newspaper article. 'Exclusive! Deadly Poison Stolen from Yumei Medical Research Laboratory!' I'm wondering how the information got out, given that it was a government secret.Rei:\nIt was all the Englishwoman's doing!Susato:\nWha...?Rei:\nIt was when the professor and Soseki-san were being interviewed at the laboratory. That so-called English lady swanned in, and without any compunction said to Professor Mikotoba:Oh Professor, surely your guest would love to hear about your work on that substance there?Mikotoba:\nIt put me in a very awkward position, to be frank. But Soseki-san's curiosity had been piqued, so I had little choice but to give him a cursory introduction.Susato:\nSo then...Soseki-san knew about the poison...Mikotoba:\nYes. And it's highly likely... that the reporter who was writing up the story about us would have caught a glimpse of the toxin, too.Susato:\n(This..Menimemo-san...) By the way, did that reporter join you all when you went to the beach?Rei:\nOh... No, I don't remember the reporter being there...Mikotoba:\nIndeed, he shouldn't have been. I very much doubt anyone would have wanted him there.Susato:\nOh?Mikotoba:\nA known criminal had been given permission by the authorities to bathe by the seaside. Soseki-san pointed out that inviting a reporter might be problematic, so the man was sent back to his office.Susato:\nYet he obviously didn't go back. He secretly followed the party to the beach and took this very candid photograph. And then presumably he posted it, anonymously, to the police.Rei:\nAh!Mikotoba:\n......... Yes, that must be what happened.Susato:\n.........Bailiff:\nCounsel! We've just heard that the new witness is now ready to testify. The trial is about to resume. Please proceed into the courtroom at once!Mikotoba:\nIt's time to steel ourselves once again, then... ...Defence Attorney Ryutaro Naruhodo.Susato:\nYes! (Rei has put her faith in me now and told me everything. So I can't let her down. I have to prove that what she's telling the court is true. I have to prove what really happened that day!)13th August, 11:30 a.m.\nSupreme Court of Judicature, Courtroom 1Judge:\nI hereby call this court to order, as we reconvene to continue the trial of Rei Membami. Prosecutor Auchi, have you summoned the new witness?Auchi:\n......... Before I address that question, Your Excellency... ...I have some very important news to share!Judge:\nOh?Ryutaro:\n(What news? And why does he look so happy about it?)Auchi:\nDuring the recess, with the collaboration of Professor Mikotoba's laboratory at Yumei University... ...the police re-examined the knife that was used to end Miss Jezaille Brett's life.Judge:\nExcellent. I admire your rapid handling of the matter.Auchi:\nOh, too kind, Your Excellency, too kind! I was merely carrying out your instructions, of course.Mikotoba:\nI had the reagent delivered to police headquarters by rickshaw so it would be there in good time. But judging by the man's swagger, I fear we might need to brace ourselves for the inevitable...Ryutaro:\nAnd, Counsel? What were the results?Auchi:\n......... This dagger, which was so cruelly used to end the life of the victim... ...has no trace of poison anywhere along its blade!Ryutaro:\nWh-What? Are you sure about that?Auchi:\nI would stake the reputation of the police on it.Mikotoba:\nArmed with the reagent, the test is extremely simple. They couldn't have made a mistake.The murder weapon has been entered into the Court Record.Auchi:\nIn short...the accused's feeble excuse earlier... ...has been utterly destroyed!Examine evidence\n\n\n\n\n\n\n\n\n\nMurder Weapon\n\n\n\n\n\n\n\n\n\nBlood\n\n\n\n\n\n\n\nMikotoba:\nAh yes, this must be the victim's blood.\nRyutaro:\nOh dear... Blood is never a pretty sight, is it? I'm having to fight the urge to run it under a hot tap and get it clean.\nMikotoba:\nYou've always been fastidious about cleanliness, haven't you?\nRyutaro:\n...I think this is something else, Father.Ryutaro:\nAAAAAAAAAGH!Auchi:\nNow, the prosecution is ready to call the new witness.Judge:\nAh, the newspaper reporter who managed to capture a photograph of the crucial moment. Good. Very well. Officer, bring in the witness!Ryutaro:\n(No trace of poison on the knife... But if that's really the case... ...how could the toxin have entered the victim's body?)Auchi:\nWitness, please state your name and occupation for the court.Menimemo:\nRaiten Menimemo of the Shoyu News. I'm what people like to call a journo!Ryutaro:\nWhat's a 'journo', Father? Do you know?Mikotoba:\nIt's simply a contraction of 'journalist'.Menimemo:\nI'm there where the news breaks, putting pen to paper to catch those scoops so they're in print the next morning! They don't call me the hero of the herald for nothing! The nice guy of news!Ryutaro:\nOh! So, um...it was you who took this photograph, was it?Menimemo:\n......... Well well, what have we here?Ryutaro:\nI'm, I'm sorry?Menimemo:\nOoh, brace yourselves, people! Menimemo senses a scoop in the offing! 'Female student up to foul play defended by curiously handsome young lawyer in Supreme Court...' The readers will lap this up! We'll set it above the fold at 72 point in a five-leg format for the morning edition!Ryutaro:\nHuh?Menimemo:\nRight then...let's start with your name!Ryutaro:\nOh, um... It's Ryutaro Naruhodo.Menimemo:\nNext! What made you want to become a lawyer?Ryutaro:\nErm...well, um... I...wanted to reform our country's legal system, I suppose.Mikotoba:\nRyutaro has suddenly become very ambitious, I see.Ryutaro:\n...I just borrowed Kazuma-sama's dream for a while.Auchi:\nBy the way, my name is Taketsuchi Auchi. That's 'Ta-ke-tsu-chi A-u-chi'... The so-called dark horse of the Supreme Court, my objections strike fear into every defence lawyer's heart!Menimemo:\n......... No, the readers won't buy that.Auchi:\nWha...?Judge:\nWitness...Menimemo:\nUm...yes?Judge:\nWhat this court demands to know is whether or not you were responsible for the taking of this picture? It was delivered anonymously to the Imperial Police Bureau only yesterday.Menimemo:\n...Yeah, I wouldn't be a journo if I didn't click quick when presented with a scoop like that now, would I? Sometimes stories call out to me, sometimes I have to chase them down, but either way you've got to be fast! Fast legs to run with, and a fast hand to write with! It's no good if you don't note it down, I always say! That's what I call...my Menimemoism!Ryutaro:\nMenimemoism?Mikotoba:\nAh yes...I remember your face. We met that day when you were interviewing myself and Soseki-san.Menimemo:\nYes, right... That was me, Menimemo again!Mikotoba:\nBut you were supposed to be going back to the Shoyu News offices after our meeting.Menimemo:\nBut the scoop is, I didn't! Because that Englishwoman's words had piqued my journalistic interest.Ryutaro:\nMiss Brett's words?Menimemo:\nA criminal, left to do as she pleases, just because she happens to be a British citizen? It's horse dung! This country's judiciary is rotten to the core! The Supreme Court's rulings aren't worth the paper they're written on! The police are just imperial pawns!Auchi:\nStay your tongue, young man! There are complex political issues at play!Menimemo:\nHmph! Well anyway, I quickly jotted down those words she said in my Menimemo memo pad. Are you ready? I'll read it out. It's all here. Right, here goes... 'I should like to go with everyone to see your country's coast!' A serious criminal going on some junket! ...The people need to know about this! That's why I decided to sneak after them. To get the woman's story so I could hammer her in the press!Judge:\nDo you mean to say that you did indeed witness it firsthand? The grim scene portrayed in this photograph?Menimemo:\nOh yes! I saw it with my very own journo eyes! From start to finish, through the viewfinder of my trusty camera!Judge:\nThank you, Menimemo-san. You will now give a formal testimony before the court. You will state exactly what it is that you witnessed of the events surrounding Miss Brett's death.Witness Testimony\n- The Camera Never Lies -Menimemo:\nThe beach hut was made of shoddy old reed screens, so there were plenty of gaps I could see inside through.\nThe Englishwoman was sitting on a stool when the student girl came in and started arguing with her.\nSeconds later, the girl pulled out a knife, throwing the Englishwoman to the floor as she stabbed her in the back!\nMy smouldering journo spirit burst into flames! Quick as a flash, I whipped out my camera ready to click!\nI pulled apart the rough weave of one of the screens and poked the lens through for the perfect shot.Ryutaro:\nReed screens, you say?Menimemo:\nRight! You can see them clearly enough in that great shot I snapped. The hut walls were just screens made of coarsely woven reeds.Judge:\n...Yes, it allows the breeze to pass through and bring some relief from the summer heat.Menimemo:\nAnd it was a breeze for me to poke my camera through and see the whole thing hotting up!Ryutaro:\n...Ignoring for the time being the appalling invasion of privacy involved... ...did you witness everything that happened from the moment the defendant entered the hut?Menimemo:\nOh yes. I saw it. I saw the whole thing from start to finish!Ryutaro:\nAnd you say that you took the photograph through a gap in one of the screens?Menimemo:\nLuckily for me, they were pretty shoddily woven. I pulled the reeds apart and thrust the lens of my camera through the gap! Would I get away with it? Or would I be seen? It was the gamble of a lifetime!Auchi:\nA tenacity of purpose that's considered admirable in a journalist, I suppose.Menimemo:\n'Run a risk one day, run a scoop the next!' That's Menimemoism in a nutshell!Judge:\nAt last... ...it would appear we have a genuine witness to this wicked crime. The evidence and testimony are extremely compelling. I believe we may be close to a verdict.Ryutaro:\nNo!Auchi:\nWonderful news, Your Excellency! Wonderful!Mikotoba:\nNevertheless, it cannot be denied... ...that this testimony begs one very large question.Auchi:\nWhat question?Mikotoba:\nExclusive news...a startling photograph... All the makings of an exceptional story for the reporter. Why then, was the story never published?Ryutaro:\nOh! (That's right!)Menimemo:\n.........Mikotoba:\nIt seems clear to me that there are circumstances at play here that are yet to be understood.Auchi:\nHah! More pathetic excuses!Judge:\nVery well then, Counsel. Proceed with your cross-examination.Ryutaro:\nYes, Your Excellency! (There's more to this reporter than meets the eye. He's keeping something about this case very close to his chest...)Cross-Examination\n- The Camera Never Lies -",
      "testimonies": [
        {
          "testimony": "The beach hut was made of shoddy old reed screens, so there were plenty of gaps I could see inside through.",
          "person": "Menimemo",
          "present": []
        },
        {
          "testimony": "The Englishwoman was sitting on a stool when the student girl came in and started arguing with her.",
          "person": "Menimemo",
          "present": []
        },
        {
          "testimony": "Seconds later, the girl pulled out a knife, throwing the Englishwoman to the floor as she stabbed her in the back!",
          "person": "Menimemo",
          "present": []
        },
        {
          "testimony": "My smouldering journo spirit burst into flames! Quick as a flash, I whipped out my camera ready to click!",
          "person": "Menimemo",
          "present": []
        },
        {
          "testimony": "I pulled apart the rough weave of one of the screens and poked the lens through for the perfect shot.",
          "person": "Menimemo",
          "present": []
        },
        {
          "testimony": "I never once set foot in the hut, nor spoke with the Englishwoman. I was there only as an observer.",
          "person": "Menimemo",
          "present": [
            "Fountain Pen"
          ],
          "source": {
            "evidence_span": "The fountain pen that the victim was found grasping in her hand. It carries the initials 'R.M.' as well as an emblem of some description.",
            "testimony_span": "I never once set foot in the hut, nor spoke with the Englishwoman. I was there only as an observer.",
            "explanation": "If the witness was only an observer, then his pen would not have been found at the scene of the crime.",
            "is_self_contained": "no",
            "context_span": "Menimemo:\nRaiten Menimemo of the Shoyu News. I'm what people like to call a journo!"
          }
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Menimemo is testifying about the events that took place in the beach hut.",
      "labels": [
        "object property",
        "spelling"
      ],
      "reasoning": [
        "Fact 1: The witness claims he have never set foot in the hut.",
        "Fact 2: The evidence suggests a pen with initial 'R.M.' was found at the scene of the crime.",
        "Prop 1: If one's pen was found at the scene of the crime, then he must have been there.",
        "Prop 2: If a pen is engraved with one's initial, then the pen is likely to belong to that person."
      ]
    },
    {
      "category": "cross_examination",
      "newContext": "Menimemo:\nThe beach hut was made of shoddy old reed screens, so there were plenty of gaps I could see inside through.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nWhat made you want to see what was happening inside the beach hut in the first place?\nMenimemo:\nCall it journo instinct. Can you think of a better reason?\nRyutaro:\nOh, I don't know. Perhaps because as well as being a proven criminal, the person inside was a young woman...\nMenimemo:\nAh, I see where you're going with this. Brace yourselves, people, he's painting the journo as a voyeur!\nRyutaro:\nIt's hardly slander, sir. You had a camera and you were taking pictures without the woman's knowledge.\nMenimemo:\nNope, you've got it all wrong, little student boy.\nRyutaro:\nSorry?\nMenimemo:\nTo my mind, all that was inside that hut was a scoop. Nothing more, nothing less. Scoops know no gender! Man or woman, it's all news! That's not even Menimemoism; it's basic journalism!\nRyutaro:\n(If only the courtroom was as indiscriminate...)\nMenimemo:\nRight! So, if that's all buttoned up, can we move on?\nJudge:\nTell the court then, witness, what sight befell your eyes when you looked inside the hut?\nMenimemo:\nA sight that vindicated my journo instinct, that's what! When I pulled back the reeds, I could see it all as clear as day.Menimemo:\nThe Englishwoman was sitting on a stool when the student girl came in and started arguing with her.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nSo you actually saw Membami-san entering the hut?\nMenimemo:\nYup. And she was raging! Raging like my journo spirit!\nRyutaro:\nAnd the argument you mentioned... What was that about exactly?\nMenimemo:\n'You stole it!' 'I didn't steal it!' That kind of thing.\nRyutaro:\n(Talking about the poison, I suppose...)\nMenimemo:\nThe student girl walked right up to the Englishwoman and really started laying into her. I mean, if she'd laid into her any more, there would have been eggs!\nMikotoba:\nThe man should have been an author. His descriptive talents are wasted on journalism.\nMenimemo:\nBut the student's rantings fell on deaf ears. Like a Japanese person listening to English for the first time.\nRyutaro:\n(He really ought to work on his similes first though, to be honest...)\nMenimemo:\nAnyway, the point is, that woman in the dock was mightily angry.\nAuchi:\nAnd her temper finally got the better of her, it seems. Dear me.\nMenimemo:\nWhich was the climactic moment that I caught on film!Menimemo:\nSeconds later, the girl pulled out a knife, throwing the Englishwoman to the floor as she stabbed her in the back!Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nDo you swear before this court that you actually saw the precise moment when the stabbing took place?\nMenimemo:\nHah! The precise moment? I didn't see just that... I saw the whole hellish scene play out from start to finish!\nAuchi:\nI have here a simple plan of the beach hut. Perhaps you could use it to explain to the court exactly what you witnessed.\nMenimemo:\n......... Right you are. It's all here in my Menimemo memo pad. When I first peered into the hut... ...I'm sure that the Englishwoman... ...was on this stool at the back of the hut here.\nAuchi:\nYes, the accused's own testimony confirmed that.\nRyutaro:\n'She just sat at the back of the hut, smiling sweetly', is what I have noted down.\nMenimemo:\nIt's my turn to testify now. Try not to interrupt.\nRyutaro:\nUgh...\nMenimemo:\nThen, the next moment, as I was watching... ...the evil student girl entered the hut! After a while, the pair of them ended up in the middle of the hut, arguing furiously. The Englishwoman went for the student, but the girl dodged out of the way... ...and in a flash, plunged the knife into her adversary's back as the two passed each other!\nJudge:\nHmph... What you describe is a grim crime indeed.\nMenimemo:\nNever sugar-coat the truth. That's what Menimemoism says.\nThe beach hut plan has been entered into the Court Record.\nRyutaro:\nBy the way, Menimemo-san... ...whilst you were watching that terrible scene unfold before your eyes through the gap in the screen... ...did it not occur to you to try to prevent the tragedy, rather than capture it on film?\nMenimemo:\n...Journos have to be observers. We can't get involved. That's our raison d'tre.\nRyutaro:\nSo you didn't converse with Miss Brett at all?\nMenimemo:\nObviously not. An observer always remains on the outside looking in.\nRyutaro:\n(...And that's something to be proud of, is it?)\nMikotoba:\nYour Excellency, if I may...\nJudge:\nYes, Professor?\nMikotoba:\nI think the witness's last, expertly phrased statement... ...should perhaps be added to his formal testimony.\nRyutaro:\n(Father, what are you...?)\nJudge:\nI will grant the defence's request. Menimemo-san, you will supplement your formal testimony with the aforementioned statement.\nMenimemo:\nWell, nihilism is the foundation of Menimemoism. But I'll gladly prove that my words aren't meaningless.\nAdds statement: \"I never once set foot in the hut, nor spoke with the Englishwoman. I was there only as an observer.\"Press (subsequent times)\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nDo you swear before this court that you actually saw the precise moment when the stabbing took place?\nMenimemo:\nHah! The precise moment? I didn't see just that... I saw the whole hellish scene play out from start to finish!\nAuchi:\nI have here a simple plan of the beach hut. Perhaps you could use it to explain to the court exactly what you witnessed.\nMenimemo:\n......... Right you are. It's all here in my Menimemo memo pad. When I first peered into the hut... ...I'm sure that the Englishwoman... ...was on this stool at the back of the hut here.\nAuchi:\nYes, the accused's own testimony confirmed that.\nRyutaro:\n'She just sat at the back of the hut, smiling sweetly', is what I have noted down.\nMenimemo:\nIt's my turn to testify now. Try not to interrupt.\nRyutaro:\nUgh...\nMenimemo:\nThen, the next moment, as I was watching... ...the evil student girl entered the hut! After a while, the pair of them ended up in the middle of the hut, arguing furiously. The Englishwoman went for the student, but the girl dodged out of the way... ...and in a flash, plunged the knife into her adversary's back as the two passed each other!\nJudge:\nHmph... What you describe is a grim crime indeed.\nMenimemo:\nNever sugar-coat the truth. That's what Menimemoism says.Menimemo:\nMy smouldering journo spirit burst into flames! Quick as a flash, I whipped out my camera ready to click!Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nThe court is fully aware of your desire to capture the incident on film, I'm sure. But why then, did you choose to post the photograph anonymously to the police?\nMenimemo:\n......... I'm afraid...I don't understand a word that's coming out of your mouth.\nRyutaro:\nI'm asking why, as a journalist, you decided not to make a story out of the incident?\nMenimemo:\n......... Think of me as a sculptor. A sculptor who makes art out of the sordid, private details of other people's lives. But I never discuss my own personal life on principle. I mean, that's basic Menimemoism.\nRyutaro:\nIt's not something to boast about!\nAuchi:\nNo doubt your burning desire to see the truth exposed and justice done was what motivated you.\nMenimemo:\nThat's it! That's brilliant! My burning desire to see something or other exposed...\nRyutaro:\n(There has to be a good reason why he didn't think to write an article about what he saw, though...)\nJudge:\nBy your own admission, you were outside the hut. How then, did you manage to take the photograph?\nMenimemo:\nAh yes, that! I'm glad you asked!Menimemo:\nI pulled apart the rough weave of one of the screens and poked the lens through for the perfect shot.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nBut the two women inside didn't notice?\nMenimemo:\nHah! Obviously not! If they had, where would I be right now? In jail, that's where!\nRyutaro:\n...Which you'd think would make you reflect on what you were doing.\nMenimemo:\nNo, a journo's job is to collect little snippets of life as unobtrusively as possible. Leave nothing but footprints, take nothing but photos. ...Yes! That's spot on!\nRyutaro:\n(...Did he just make that up?)\nAuchi:\nThe point is, the witness risked life and limb to obtain this photograph. And this photograph reveals the whole truth. ...There is nothing more to be said!\nMenimemo:\n.........Menimemo:\nI never once set foot in the hut, nor spoke with the Englishwoman. I was there only as an observer.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nReally, you didn't set foot inside the hut at all? Are you quite sure about that?\nMenimemo:\nI think you may have the wrong impression of me. We're talking about a murder scene here. My nerves were stretched to breaking point already.\nRyutaro:\nOh, I see. You were scared? ...Maybe I did have the wrong impression of you, yes.\nMenimemo:\nIt was all I could do to stifle a scream and hold my hands steady enough to snap the shot.\nMikotoba:\nYou really should have summoned help before thinking of your camera.\nMenimemo:\nMenimemoism and humanism don't always agree. And most of the time in those instances...Menimemoism comes out on top.\nRyutaro:\nHaah...\nMenimemo:\nAs a sculptor of stories, sometimes I have to be cruel for my art. ...Yes! That's spot on!\nRyutaro:\n(...Surely he's making all this up.)Present Fountain Pen (after examining emblem on finial)\n\n\n\n\n\n\n\nRyutaro:\n\nLeads to:\n\"Menimemo-san, until now, I've had a firm belief...\"Mikotoba:\nHe claims to have spied the whole affair from start to finish. If true, his testimony is devastating.Ryutaro:\nBut...it does seem as though he's holding something back, doesn't it?Mikotoba:\nIf that's how you feel, I suggest that you trust your instincts and press him on everything he's said. As you've no doubt seen done many times before in your role as judicial assistant.Ryutaro:\nYes, I have! (I've seen witnesses like this pressed often. I know exactly what to do!)Ryutaro:\nMenimemo-san, until now, I've had a firm belief... ...that newspapers are in the business of uncovering and publishing the truth.Menimemo:\nYou're spot on there! The press doesn't lie! Which is why I'm proud to wear the emblem of the Shoyu News on my arm! In a way...that's more Menimemoism.Ryutaro:\nSadly, though... ...it seems that the journalists who write for those papers... don't always share the same passion for the truth.Auchi:\nWha... What are you suggesting with those recriminatory words, Counsel?Ryutaro:\nMenimemo-san...do you recognise this fountain pen?Menimemo:\nAgh!Ryutaro:\nThis pen was found at the scene of Miss Brett's death. In fact, the murdered victim was gripping it in her hand as she died.Menimemo:\nWhat are you...?Ryutaro:\nIf you look at the barrel of the pen, you'll notice that its owner's initials are engraved there. 'R. M.'...Auchi:\nYes, thank you for bringing that up, Counsel. The initials of the accused, Rei Membami.Ryutaro:\nIs it a coincidence, I wonder... ...that your initials are also 'R. M.'?Auchi:\nNo!Ryutaro:\nRaiten Menimemo... 'R. M.'...Menimemo:\nThat's...that's horse dung! Can't you see? One of the central tenets of Menimemoism is being a pencil user!Ryutaro:\nAnd yet...as the court will clearly be able to see, on your right hand... ...there is a very obvious blue ink stain.Mikotoba:\nIt would appear that you must have rather carelessly left it somewhere recently. Your favourite fountain pen, that is.Menimemo:\nHorsey horse dung!Ryutaro:\nMenimemo-san! Is it not the case that before she died... ...you met with Jezaille Brett in that beach hut?Auchi:Auchi:\nWhy should we listen to this absurd nonsense? It's nothing but another excuse!Menimemo:\nExactly! Shoyu News will stand behind me all the way! I deny everything! There must be as many people with the initials 'R. M.' as there are stars in the night sky!Ryutaro:\nThe defence has neither the time nor the inclination to count every star in the sky.Menimemo:\nHm?Ryutaro:\nAnd there's no need, anyway, because this pen has more to tell. Yes, there is another clue. A clue that undeniably proves who its owner really is!Judge:\nIn that case, Counsel, the defence will now show the court where this alleged clue lies!Ryutaro:\nOf course, Your Excellency. The clue on this fountain pen that clearly reveals its owner's identity is...Present emblem on finial\n\n\n\n\n\n\n\nRyutaro:\n\nLeads to:\n\"As well as the initials, there is also an emblem on this fountain pen!\"Present anywhere else\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nWell, Menimemo-san? Do you still deny it?\nMenimemo:\nHm, let me see now... I think if I had to give it a headline, it would be... ...'Night Sky Stars Cause Counting Confusion For Cocky Courtroom Counsellor'!\nRyutaro:\nSorry?\nAuchi:\nGo ahead, Counsel, the stars await!\nJudge:\nI've a mind to tell you not to return to my courtroom until you have counted every one.\nRyutaro:\n(Oh dear... I think I must have made a mistake.)\nMikotoba:\nYou've already furnished the court with the revelation that there's a clue on this pen as to its owner. It's only the smallest additional step to actually point the clue out. ...Concentrate, Susato!\nRyutaro:\nYes...I'm sorry! Let me try again!\nLeads back to:\n\"In that case, Counsel, the defence will now show the court where this alleged clue lies!\"Ryutaro:\nAs well as the initials, there is also an emblem on this fountain pen! An emblem that you will of course recognise... Menimemo-san.Menimemo:\nUm...Judge:\nGoodness me! It's, it's the emblem of the Shoyu News!Ryutaro:\nIn other words...the owner of this pen... ...is an employee of the Shoyu News, whose initials are 'R. M.'. Suddenly the stars in the night sky don't seem so numerous...do they? Well, Menimemo-san? How do you respond?Menimemo:\nNnn... NOOOOOOOOOOOO!Judge:\nOrder! Order! Explain yourself, witness!Menimemo:\n......... Hah...hah...hah... So...this is how the mighty Supreme Court works, is it? Using coercive tactics to have well-meaning citizens reveal harmless secrets...Ryutaro:\n...I've used nothing but honest tactics.Menimemo:\nAlright then, fine. I won't try to hide it any more. Yes, not long before that grim tragedy unfolded... ...I, a Shoyu News reporter, on behalf of the public, conducted an interview with the Englishwoman.Ryutaro:\nAn interview?Auchi:\nYou, you never mentioned this before!Ryutaro:\nWhen exactly was this?Menimemo:\nAs I said, it was before that evil little student girl showed her face in the hut. It couldn't have lasted more than two or three minutes, that's all. It was just a brief exchange. But it came to nothing. And as we Menimemoists say, 'The people don't pay their dues for unworthy news!'Judge:\nHowever insignificant you deem it to be, this court cannot overlook the meeting between yourself and the victim. You will testify now under oath about the precise nature of this meeting and what transpired!Menimemo:\nGot it. Yes, alright. But... ...on one condition.Auchi:\nC-Condition?Menimemo:\nIn all good conscience, I couldn't speak out alone about this. You need to call back the earlier witness. Soseki Natsume-san!Ryutaro:\nSo-Soseki-san?Menimemo:\nOh yes, according to my notes here, that man... ...has a secret of his own. And brace yourselves...because it's not a harmless one. It's big!Auchi:\nWha...Ryutaro:\nWhat?!Menimemo:\nMenimemoism states that 'one man's secret is every other man's front-page story!'Judge:\nVery well. I will grant the witness's request in this instance. Officer! Summon the earlier witness back to the stand!Ryutaro:\n(Soseki-san...hiding something...?)Witness Testimony\n- The Witnesses' Secrets -Menimemo:\nI asked the Englishwoman for an interview, but she declined. So I left the hut without making a fuss.\nThen, watching secretly from outside, I saw the woman being stabbed and the other witnesses come running.\nThe detective realised that the victim still had a pulse, so he ran off to fetch help.\nThat's when this writer man here asked the woman a very significant question.\nBut he didn't say anything about that in his testimony! Which is why Menimemoism demands I reveal it now!Judge:\nYou, you mean to say the victim...Auchi:\nThe victim regained consciousness?!Soseki:\nAh...well, um...Auchi:\nAnd when she did, you, you decided to ask her a question?!Soseki:\nThat's, um...true. Yes.Menimemo:\nHe did, he did! And that's not all! The woman gave him a very definite answer! An answer that incriminates the accused!Auchi:\nThis is preposterous! Why am I only hearing about this now? Why didn't you mention this before, you...you yokel hack?Soseki:\nIt, it, it... IT WASN'T EVEN A CONVERSATION! Yes, I did pose the withering English rose a question. I don't deny it. But she could no longer speak. She was barely conscious, even.Judge:\nCounsel for the Defence, I expect a thorough cross-examination to be conducted here. This court must and will know the truth!Ryutaro:\nAbsolutely, Your Excellency! (The reporter is claiming that Miss Brett implicated Rei somehow? What on earth could have happened in that hut?)Cross-Examination\n- The Witnesses' Secrets -",
      "testimonies": [
        {
          "testimony": "I asked the Englishwoman for an interview, but she declined. So I left the hut without making a fuss.",
          "person": "Menimemo",
          "present": []
        },
        {
          "testimony": "Then, watching secretly from outside, I saw the woman being stabbed and the other witnesses come running.",
          "person": "Menimemo",
          "present": []
        },
        {
          "testimony": "The detective realised that the victim still had a pulse, so he ran off to fetch help.",
          "person": "Menimemo",
          "present": []
        },
        {
          "testimony": "That's when this writer man here asked the woman a very significant question.",
          "person": "Menimemo",
          "present": []
        },
        {
          "testimony": "I asked her, 'Who did this to you?' ...But she never replied.",
          "person": "Soseki",
          "present": []
        },
        {
          "testimony": "But he didn't say anything about that in his testimony! Which is why Menimemoism demands I reveal it now!",
          "person": "Menimemo",
          "present": []
        },
        {
          "testimony": "She just lifted a trembling finger...and pointed in the direction of the defendant.",
          "person": "Soseki",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "Menimemo:\nI asked the Englishwoman for an interview, but she declined. So I left the hut without making a fuss.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nYou asked her for an interview, you say?\nMenimemo:\nWell, of course I did! I wanted to ask her about the incident she was involved in at the end of last year.\nRyutaro:\nAbout the case in which Dr John H. Wilson lost his life?\nMenimemo:\nThat's not the way I phrased it. Menimemoism calls for straight talking. 'Why did you murder Dr Wilson?' is how I put it to her.\nRyutaro:\n...Yes, that sort of talking is as straight as a ruler.\nMenimemo:\nAsk every question as if you're asking for a menu in a restaurant, I say. It's the best way. A veteran at the paper taught me that.\nRyutaro:\nAnd how did Miss Brett answer?\nMenimemo:\nWith one simple phrase: 'Mystery is a woman's charm.' ...Whew! That told me! So I waltzed right out of there.\nRyutaro:\n(Really? Something about that doesn't quite seem to fit together...)\nMenimemo:\nLeave every room as if you're waltzing in a dance hall, I say. It's the best way. A veteran at the paper taught me that..Menimemo:\nThen, watching secretly from outside, I saw the woman being stabbed and the other witnesses come running.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nThat was very persistent of you, considering that Miss Brett had just turned you away.\nMenimemo:\nPersistence wins the prize! Any Menimemoist will tell you that. Let them think you've left, then just when they lower their guard, that's when you swoop in for the scoop!\nAuchi:\nAnd the fruits of your labour are all too apparent in this telling photograph. Though I'm sure the young yokel student would rather not be reminded of this damning evidence.\nRyutaro:\nActually, it's thanks to that photograph that we managed to identify this witness.\nMenimemo:\nAnd now that you've found me, I'll tell you whatever you want to know. I've got nothing to hide!\nRyutaro:\n...I'm sure.\nAuchi:\nPlease, do go ahead, witness. The court is eager to hear what you have to say.\nMenimemo:\nTry to stop me! There's a story to tell here, and I'm going to tell it!Menimemo:\nThe detective realised that the victim still had a pulse, so he ran off to fetch help.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nAnd Soseki-san remained behind in the hut?\nMenimemo:\nThat's right, yup. Our author friend here... ...was a blabbering wreck! Shaking all over, from his head to his toes. Moustache twitching! Eyes bulging!\nSoseki:\nWHAT DO YOU EXPECT?! You, you don't know the t-t-terrifying troubles that taunted me whilst travelling abroad!\n\nBack Behind Baleful Bars! ...They'll be coming for me, surely!\nThat's all I could think. I felt as though I were gasping for air, drowning in a sea of cold sweat!\nRyutaro:\n(Poor Soseki-san. His experiences in London have scarred him deeply.)\nSoseki:\nAs the world seemed to close in around me, I quietly recited a prayer to Amida Buddha:\n\nEternal Emptiness, Empty Eternity! ...The end is coming for me, surely!\n\nJudge:\nNo sutras are to resound in my courtroom, please.\nMenimemo:\nAnd now...we come to the crucial part! That's when it happened!Menimemo:\nThat's when this writer man here asked the woman a very significant question.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nWhat question? What exactly did he say?\nMenimemo:\nWell now...you should hear that from the horse's mouth, I think. Don't you, Mr Writer-Man?\nSoseki:\nAAARGH!\nAuchi:\nOut with it, you yokel hack! What did you say to her? What did you say to the dying Englishwoman?\nSoseki:\n......... Well, in truth... ...I'd been catching crabs at the water's edge and building castles in the sand, you see.\nJudge:\n...Well, the seaside is a place to be at leisure, I suppose... even for a grown man.\nSoseki:\nBut then all of a sudden, from that little beach hut...a young girl's panic-stricken cries for help pierced the air!\nRyutaro:\nRei...!\nSoseki:\nI ran up the beach to see what was happening...to find the defendant leaning over the collapsed victim! As soon as Inspector Hosonaga saw Miss Brett on the ground, he sprinted off to get help. And then, just a moment later, I heard a faint moan! A moan from the dead Englishwoman... I NEARLY JUMPED OUT OF MY SKIN!\nRyutaro:\nBut what did you ask her, Soseki-san?!\nSoseki:\n......... I asked her, 'Who did this to you?'\nRyutaro:\n...!\nAuchi:\n...!\nJudge:\nDon't protract this any longer! How did the woman respond?\nSoseki:\nSHE DIDN'T! SHE SAID NOTHING IN RESPONSE! ...B-But... .........\nJudge:\nWhen in the stand, you will answer the questions asked of you unambiguously! Now, without evasion or reticence, I demand that you amend your testimony!\nSoseki:\n......... I WIIIIIIIIILL!\nChanges statement \"That's when this writer man here asked the woman a very significant question.\" to \"I asked her, 'Who did this to you?' ...But she never replied.\"\nChanges statement \"But he didn't say anything about that in his testimony! Which is why Menimemoism demands I reveal it now!\" to \"She just lifted a trembling finger...and pointed in the direction of the defendant.\"Soseki:\nI asked her, 'Who did this to you?' ...But she never replied.Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nSo you tried to find out who the culprit was!\nSoseki:\n'He who asks a question is a fool for a minute; he who does not remains a fool forever.' And having been labelled a criminal twice during my time in Great Britain, I was quick to make up my mind... BETTER TO BE A FOOL FOR A MINUTE THAN REMAIN A FOOL IN PRISON FOREVER!\nAuchi:\nHowever...you've indicated that the victim failed to respond. Is that correct?\nSoseki:\nI know why. I know why the Englishwoman said nothing. SHE WAS IGNORING ME! BECAUSE OF MY STOOP AND MOUSTACHE! BECAUSE I'M JAPANESE!\nRyutaro:\n(Oh dear... Soseki-san has really developed a dislike for the English, it seems.)\nMikotoba:\nHaving read the report on his time in Great Britain, I can't say I'm surprised at his xenophobia.\nMenimemo:\nBut the Englishwoman didn't ignore you at all. ...Did she, Mr Writer-Man?\nSoseki:\nHm? Well, yes, alright...she did respond in a manner of speaking, I suppose.Menimemo:\nBut he didn't say anything about that in his testimony! Which is why Menimemoism demands I reveal it now!Press\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nSoseki-san...are you trying to hide something?\nSoseki:\nDon't...DON'T LOOK AT ME LIKE THAT!\nRyutaro:\nSoseki-san! You MUST tell the court everything that happened!\nSoseki:\n......... Well, in truth... ...I'd been catching crabs at the water's edge and building castles in the sand, you see.\nJudge:\n...Well, the seaside is a place to be at leisure, I suppose... even for a grown man.\nSoseki:\nBut then all of a sudden, from that little beach hut...a young girl's panic-stricken cries for help pierced the air!\nRyutaro:\nRei...!\nSoseki:\nI ran up the beach to see what was happening...to find the defendant leaning over the collapsed victim! As soon as Inspector Hosonaga saw Miss Brett on the ground, he sprinted off to get help. And then, just a moment later, I heard a faint moan! A moan from the dead Englishwoman... I NEARLY JUMPED OUT OF MY SKIN!\nRyutaro:\nBut what did you ask her, Soseki-san?!\nSoseki:\n......... I asked her, 'Who did this to you?'\nRyutaro:\n...!\nAuchi:\n...!\nJudge:\nDon't protract this any longer! How did the woman respond?\nSoseki:\nSHE DIDN'T! SHE SAID NOTHING IN RESPONSE! ...B-But... .........\nJudge:\nWhen in the stand, you will answer the questions asked of you unambiguously! Now, without evasion or reticence, I demand that you amend your testimony!\nSoseki:\n......... I WIIIIIIIIILL!\nChanges statement \"That's when this writer man here asked the woman a very significant question.\" to \"I asked her, 'Who did this to you?' ...But she never replied.\"\nChanges statement \"But he didn't say anything about that in his testimony! Which is why Menimemoism demands I reveal it now!\" to \"She just lifted a trembling finger...and pointed in the direction of the defendant.\"Soseki:\nShe just lifted a trembling finger...and pointed in the direction of the defendant.Press\n\n\n\n\n\n\n\nRyutaro:\n\nLeads to:\n\"Miss Brett pointed a finger at the defendant...?\"Ryutaro:\nPoor Soseki-san has been fidgeting constantly in the stand next to Menimemo-san.Mikotoba:\nYes, like a naughty child who's waiting for punishment from his parents. It rather reminds me of you when you were younger.Ryutaro:\nI, I was like that?!Mikotoba:\n...Never mind that now. The question is, how far can we trust this reporter's account of events? We must focus our energies on gathering information and establishing facts.Ryutaro:\nYes!Ryutaro:\nMiss Brett pointed a finger at the defendant...? Soseki-san! Is that really true?Soseki:\n......... It's not easy to stand here and say this, but... ...when we first entered the beach hut... ...the Englishwoman was sprawled on the floor before us, with the student girl standing on the far side of her. And when I asked 'Who did this to you?'... ...the Englishwoman summoned her last ounce of strength to point a trembling finger at the back of the hut. Which was, it can't be denied, in the direction of the student girl who stands accused today.Ryutaro:\nNo...Judge:\nSoseki-san! Why on earth did you neglect to mention this in your original testimony?Soseki:\nB-B-But... 'FIDDLESTICKS,' I say!Judge:\nThis is not a British court of law. You will respond in Japanese.Soseki:\nYes, of course! The Englishwoman did point her finger towards the back of the hut, but! ...But I was trembling...and she was trembling...and everything was a blur. And thinking about it, I feel as though perhaps she was pointing in a slightly different direction. Actually, NO! Not SLIGHTLY! In a VERY DIFFERENT DIRECTION to where the student girl was standing! To somewhere at the back of the hut...where nobody was standing at all!Ryutaro:\nYou mean that your memory of events, and the direction in which the victim was pointing are both unclear?Soseki:\nYes! That's it! Unclear! I'm very, very unclear!Auchi:Auchi:\nYour Excellency! Surely this proves the matter beyond all reasonable doubt! Yes, the woman may barely have been conscious, and yes, perhaps her finger wavered slightly... ...but there can be no doubt that this was an attempt by the victim to confirm the identity of her assailant! ...Why? Because as the court can see...there was no one other than the accused in the direction the victim was pointing! It is now abundantly clear that no one besides the accused could possibly have committed this crime!Judge:\n...I am inclined to agree. And in the absence of any credible argument to the contrary, I believe we can now conclude this trial.Ryutaro:\nNo... NOOOOOOOOO!Menimemo:\nHeh heh heh... The headline's writing itself! 'Dashing Lawyer's Hopes Dashed!' 92 point across the whole page. We'll do an extra edition!Mikotoba:\nThis is a serious blow, Susato. Unless we're able to identify the true culprit, and substantiate our claim with evidence... ...the judge will give his ruling and the trial will be over!Ryutaro:\nBut, but that's impossible, Father! We don't even know how the crime was committed yet!Mikotoba:\nImpossible though the task may seem, we have no choice. We must think back over everything we've learnt thus far. Somewhere in all those details, I'm confident we'll find the clue we need.Ryutaro:\n(Rei gave us her account of how events unfolded in the defendants' antechamber before the trial resumed. She told us what happened at the precise moment Miss Brett was killed.)Rei:\nThe Englishwoman was sitting at the back of the hut, listening to what I was saying. And then a moment later... ...she suddenly got to her feet... ...before collapsing on the floor in front of me...with a knife in her back.Ryutaro:\n(How could Miss Brett have been stabbed in the back in a beach hut that was empty but for herself and Rei? Somewhere amid all the information we've gathered so far, there must be an answer to that question!)Judge:\nI take it then, that the defence has nothing further to add.Auchi:\nSo, the gallant yokel student's luck finally runs out. I can't say I'm surprised.Judge:\nIn that case, I am ready to deliver my final verdict on this matter.Ryutaro:\n(This is a crucial turning point now. If I can't establish what really happened, it's over. Where was the real culprit hiding? And how did he or she stab the victim?)I know how!\n\n\n\n\n\n\n\nRyutaro:\n\nLeads to:\n\"Your Excellency! I respectfully ask you to postpone your adjudication for the time being.\"I don't know\n\n\n\n\n\n\n\nRyutaro:\n(I'm just not in a position to establish what actually happened at this point in time. But if I fail to come up with something...)\nMikotoba:\nIf we fail to present a credible alternative to the judge, this trial will reach a very unfavourable conclusion. There's no time to hesitate here, Susato!\nRyutaro:\n......... I understand. I'll worry about whether or not I can establish an alternative theory after I've established it!\nMikotoba:\n......... Whatever you really mean by that...it's worth a shot!\nRyutaro:\n\nLeads to:\n\"Your Excellency! I respectfully ask you to postpone your adjudication for the time being.\"Ryutaro:\nYour Excellency! I respectfully ask you to postpone your adjudication for the time being.Judge:\nOh? ...To what end, Counsel?Ryutaro:\nThe defence would like to present the court with an alternative theory. An alternative theory that can explain... ...who the victim was actually trying to implicate with her dying gesture!Auchi:Auchi:\nAn alternative theory? Hah! None exists!Ryutaro:Ryutaro:\nThere was someone else present at the scene...who could have committed this crime!Auchi:\nWhaaat?Ryutaro:\nAnd the victim, Miss Brett, tried to reveal who it was to those around her at the time... ...by mustering all her remaining strength...and pointing a trembling finger in the killer's direction!Auchi:\nThis, this is fiction! Fantasy!Judge:\nVery well. As you seem so sure of yourself, Counsel, I am prepared to hear your 'alternative theory'. So, young Ryutaro Naruhodo...Ryutaro:\nYes, Your Excellency!Judge:\nYou will present your latest theory to the court by means of this plan. At the moment the victim was stabbed, where exactly are you proposing the culprit was concealed?Present area outside hut, west of stool\n\n\n\n\n\n\n\nRyutaro:\n\nLeads to:\n\"Naruhodo-san would never give up. And I'm a Naruhodo now...\"Present anywhere else\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nThe true culprit...was in this area here!\nJudge:\nThere, Counsel?\nRyutaro:\nThat's right, Your Excellency. I believe that the culprit was hiding in the location I've indicated.\nJudge:\n...Why?\nRyutaro:\nOh! Well, um...that's rather hard to say, um...\nJudge:\nHmph. Clearly this particular theory needs no further consideration, given your wide-eyed look of alarm.\nRyutaro:\n(Oh dear... I chose poorly.)\nMikotoba:\nI suggest you begin by considering where the victim was in the moments leading up to her death.\nRyutaro:\nYes...of course!\nJudge:\nPerhaps you'd care to identify a more credible location, Counsel?\nLeads back to:\n\"You will present your latest theory to the court by means of this plan.\"Ryutaro:\n(Naruhodo-san would never give up. And I'm a Naruhodo now...) The true culprit who fatally stabbed Miss Brett...was concealed in this location here!Judge:\nAre you mad, Counsel? You're suggesting that the culprit was outside the hut!Menimemo:\n...!Auchi:\nWHAAAT?!Judge:\nOrder! Order! Order!Soseki:\nBut student lawyer Naruhodo-san Esquire! That makes no sense at all!Menimemo:\nYou've, you've just pointed out the exact spot where I was hiding to get my scoop snap! But I didn't see any suspicious individuals loitering about. I can swear to that!Auchi:\nObviously! If the culprit had been outside the hut... ...there is no way that he or she could have stabbed the victim who was inside the hut!Ryutaro:\nActually, Prosecutor Auchi...there is a way.Menimemo:\nAh!Ryutaro:\nAnd...in point of fact... ...the defence can provide evidence strongly suggesting that is precisely the way Miss Brett was killed!Auchi:\nYou're bluffing! You're, you're bluffing, you yokel-Judge:\nThe defence's assertion is clearly too fantastical for the court to comprehend. You will need to give us more guidance, Counsel. What piece of evidence corroborates your theory that the victim was stabbed from outside the hut?Present Crime Scene Photograph\n\n\n\n\n\n\n\nRyutaro:\n\nLeads to:\n\"The, the original photographic print of the crime scene?\"Present anything else\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\n......... (Well, I've presented it now... ...but I haven't the first idea why I chose this piece of evidence!)\nJudge:\nCounsel. You're suggesting that this piece of evidence bears out your theory as to how the victim was stabbed?\nRyutaro:\nIt's...something of a windfall...Your Excellency.\nAuchi:\nI think the word you were looking for, Counsel, was 'downfall'!\nMikotoba:\nIf your theory is correct, and the knife was thrust into Miss Brett's back from outside the hut... ...there should be a visible trace somewhere.\nRyutaro:\nA trace? Yes...on the hut itself... (Armed with that idea, I must look through the Court Record again.) Your Excellency! The defence would like to present a different piece of evidence!\nJudge:\n...Go ahead.\nLeads back to:\n\"What piece of evidence corroborates your theory that the victim was stabbed from outside the hut?\"Judge:\nThe, the original photographic print of the crime scene?Ryutaro:\nYes. It's clearly visible in this print: The trace of the fatal thrust that was delivered from outside the beach hut.Auchi:Auchi:\nD-Do you take us for fools?! There's no hint of any such thing!Ryutaro:\nI'm not sure that everyone present would agree. Someone, at least, appears to have noticed what it is that I'm referring to.Judge:\nCounsel! Once again, I must call on you to be explicit for the court. Where on this photograph is the trace of the stabbing, which you claim took place from outside the hut?Present slit on back wall\n\n\n\n\n\n\n\nRyutaro:\n\nLeads to:\n\"Look closely just here...\"Present anywhere else\n\n\n\n\n\n\n\nRyutaro:\n\nRyutaro:\nWell! It's right here!\nJudge:\nThis is some remnant of the attack that took place?\nRyutaro:\nWell! I think it might be!\nAuchi:\nPreceding your remarks with a spirited 'Well!' wont' give them any more credence.\nRyutaro:\n......... Well...\nJudge:\nNo, Counsel, I'm afraid a spirited penalty is in order for that dismal display.\nMikotoba:\nIf the blade penetrated the victim's back from the far side of the reed screens... ...where would you expect to see some trace of it remaining?\nRyutaro:\nAh... Yes!\nLeads back to:\n\"Counsel! Once again, I must call on you to be explicit for the court.\"Ryutaro:\nLook closely just here... In the screen at the back of the hut, you can see the effects of a blade having been forced through the reeds.Auchi:\nN-No, I can't! I, I can't see any such thing!Ryutaro:\nIt's true that the hut in question had four walls as you'd expect. However... ...by parting the reeds, a knife blade could easily penetrate them.Judge:\nThis is extraordinary!Ryutaro:\nYes... ...the true culprit actually stabbed the victim from outside the beach hut!Soseki:\nAh...Ryutaro:\nAnd of everyone present at the scene, there is only one person who could have done that. Only one person who was directly outside the hut when Miss Brett was killed. Raiten Menimemo-san! It could only have been you!Menimemo:\nHnnn...nnngh... NAAAAAAAAAOOOOOOOOO!Auchi:Auchi:\nThis preposterous idea leaves me almost speechless! Just look at the photograph again! The victim lies almost exactly in the centre of the beach hut, does she not? Are we to assume, as part of this farcical scenario, that the assailant was a knife-thrower?Ryutaro:Ryutaro:\nNo, of course not.Auchi:\nWe're not?Ryutaro:\nIf you recall the testimony of the defendant about the events just before the victim's death...Rei:\nInside the beach hut, I confronted Miss Brett. But she just sat on a stool at the back of the hut, smiling sweetly at me as if she knew she was untouchable.Auchi:\nA, a stool...Ryutaro:\nHave another look at the photograph. The slit in the reed screen... ...would align perfectly with the back of a person who was sitting on that stool.Judge:\nMy word... So...in fact, the victim was...Ryutaro:\n...Killed whilst sitting on that stool...by a stab wound to her back delivered through the reed screen!Auchi:\nAh!Ryutaro:\nHaving been attacked, Miss Brett rose to her feet instinctively. But then, unable to speak, she collapsed on the floor in the middle of the hut... ...before the defendant, Membami-san's appalled eyes. And that, Your Excellency...is the truth of what happened on the beach that day!Menimemo:\n.........Ryutaro:\nBy your silence, Menimemo-san... ...I take it that you don't deny the charge.Menimemo:\n.........Auchi:\nThis... This is... ...ABSUUUUUUUUURD!Judge:\nThat will do! It would appear that we have a tacit admission of guilt from the witness. Accordingly, this court has successfully established the truth of this matter. Which means that the defendant, Membami-san, is innocent of the crime.Ryutaro:\n(Oh, thank goodness! I finally made him cave.)Mikotoba:\nI must say...I've never been more proud.Auchi:\nNo... This can't be... The Auchi clan can't... What of my growth? My growth of hope! It, it wasn't all an apparition! I can't accept this! I won't!Judge:\nI see no reason for the continuance of this trial. I will therefore move to conclude proceedings by delivering my final verdict and-???:Menimemo:\nHah...hah...hah... Well, this is all very convenient. This is how the highest court in our mighty empire delivers justice, is it? Suppressing well-meaning citizens' freedom to speak and branding them as criminals...Ryutaro:\nBut... ...we've established that the victim was stabbed from outside the hut, through the reed screen walls!Mikotoba:\nAnd no one but you was in place at the time to have his hand on the hilt of the blade. ...It's a perfectly logical deduction.Menimemo:\nSo...your argument hinges on the location of whoever stabbed the Englishwoman, does it? Well...it seems a little irrelevant now.Ryutaro:\nIrrelevant?Menimemo:\nWhere she was stabbed, how she was stabbed... ...it doesn't matter. I mean, whether she was stabbed at all makes no difference, if you think about it. After all... ...this trial's already shown the whole thing hinges on something else!Ryutaro:\nWhat...what are you talking about?Menimemo:\nBrace yourself...little man. I'm talking about the fact that everything's changed... ...because of the dirt YOU dug up!Ryutaro:\nWhat?!Judge:\nEnough obscurity! Explain yourself, witness!Menimemo:\nWhat's to explain? I'm talking about the poison, of course.Auchi:\nThe...poison...?Menimemo:\nLet's ask the professor for a comment on the situation, shall we? I understand that a deadly poison you were developing was stolen from your laboratory. Correct? And it's been shown that this poison was administered to the victim, Miss Brett. Is that right?Mikotoba:\n...That is correct. The unusual constriction of the victim's pupils are a sure sign that this particular poison was used.Menimemo:\nI see, I see. So...presumably that means... ...that the victim already had the poison in her body...before she was stabbed?Ryutaro:\nAh!Mikotoba:\nGiven that her pupils were clearly constricted...it seems highly likely, yes. If she had been dead already, the poison could not have circulated in her blood.Auchi:\n......... Tsh huh huh... Ah, how refreshing to hear the argument of a metropolitan mind. Precisely! It matters not a jot who stabbed whom in whose back and with whose blade! Because, quite simply...the Englishwoman's life was taken not by the knife...but by the poison!Ryutaro:Ryutaro:\nBut...that can be explained by the poison being on the blade, as I already-Auchi:Auchi:\nTa ha ha ha ha! Forgotten already, have we, yokel? During these very proceedings, the laboratory of the professor at your side assisted in proving... ...that the blade of the weapon used to attack the victim had no trace of poison on it whatsoever!Ryutaro:\nUgh...Menimemo:\nSo let me get this down: the 'facts', as skilfully established by the defence in this trial... ...turn out to be a headline-making red herring! ...Is that about right?Ryutaro:\nUgh...um...well... AAAAAAAAAAAAGH!!!Judge:\nOrder! Order! Order! But...where does this leave us? How, in that case, did the poison enter the victim's body?Mikotoba:\nThere is an undeniably obvious answer to that. The lady most likely imbibed it.Ryutaro:\nYou mean she drank it?Mikotoba:\nHave another look at the photograph here. As you can see... ...a bottle of carbonated water and a glass had been knocked onto the sandy floor of the beach hut. The poison could have been slipped into either.Ryutaro:\n...! (So somebody made Miss Brett drink it...)Menimemo:\nWell, what do you know? Look at those dashing eyes! This will make a great front-page shot! Hey! Why the bewitching stare? After all, I'm the last person you should be looking at. It would make no sense at all that I poisoned the woman, would it? I mean...that's been established already!Ryutaro:Ryutaro:\nEstablished? What are you talking about?Menimemo:\nHm? Don't tell me you've forgotten? That's a little hard to believe, given that the person who established it... ...was you!Ryutaro:\nMe?! (What on earth does he mean?)Menimemo:\nOoh! Let me capture those wide eyes! This is prime press fodder, this is!Judge:\nIt would seem that this trial is not destined to end yet after all. I hereby call upon the witness to give further testimony.Menimemo:\nThat's great, that is! Let me get a shot of that magnificent beard, Your Excellency!Judge:\nYou claim it to be impossible that you were the one responsible for administering the poison to the victim. You will explain to the court in your testimony the basis upon which you make such a claim!Menimemo:\nI'm a journo and I'm a man... I've never tried to run or hide from anything in my life. And I'm not about to start now! Because that's...Menimemoism!Ryutaro:\n(For a brief moment, I thought I'd illuminated the truth. But it's slipped right back into obscurity again... Just where is this trial going to take us...?)Witness Testimony\n- Complete Innocence -Menimemo:\nOh yes, I stabbed the Englishwoman. And it's that very fact that proves I'm innocent!\nBecause why would I have bothered to stab the woman if I'd already poisoned her?\nWhen I heard the student girl and that pompous English murderer arguing...it got my goat.\nIf the courts weren't going to punish Brett for what she did, someone else would have to see justice done!Ryutaro:\nSo...you admit it then? That everything happened as I described... That you are the one who stabbed Miss Brett in the back through the reed screen!Menimemo:\n......... You can blame this miserable country of ours.Ryutaro:\n...!Menimemo:\nA country that bows to the pressure of foreign powers and lets murderers walk free! What kind of future can a country like that have? That's why I did it! I did what our pathetic leaders didn't have the guts to do! Slap bang in the middle of that charming lady's back! I plunged the blade of sweet justice right in there! As someone who spends his life seeing that the truth is told... ...I feel really, really awful about giving false information in my testimony before. But as it turns out... ...there was somebody else who had it in for the victim and got to her before me!Ryutaro:\n...!Menimemo:\nThat's right...you guessed it! That pretty little student girl. Now there's a woman after my own heart!Ryutaro:\nYou're implicating Rei again...Menimemo:\nShe's the one who gave the poison to the Englishwoman and ended her pitiful existence! And suddenly, snap! This journo here is off the hook!Judge:\nHmmm...the argument is sound, certainly. If the witness had administered the poison himself, he need only have waited for it to take effect. Subsequently stabbing the victim in the back would have been entirely nonsensical.Auchi:\nAnd therefore, this reporter had nothing to do with the poisoning. ...Yes, it's all quite logical.Menimemo:\nThat's right, it is! Logical and true. I'm glad you've all seen the light. Justice at last!Ryutaro:\n(This is unbelievable. And after I'd made so much progress in proving his guilt. ...Is he going to get away with it now?) ......... (Think of Kazuma-sama and Naruhodo-san... They never stopped looking for a way forward until the judge's final gavel!)Judge:\nVery well then, Counsel. Proceed with what I assume to be your final cross-examination in this trial.Ryutaro:\nYes, Your Excellency!Cross-Examination\n- Complete Innocence -",
      "testimonies": [
        {
          "testimony": "Oh yes, I stabbed the Englishwoman. And it's that very fact that proves I'm innocent!",
          "person": "Menimemo",
          "present": []
        },
        {
          "testimony": "Because why would I have bothered to stab the woman if I'd already poisoned her?",
          "person": "Menimemo",
          "present": [
            "Poison Article"
          ]
        },
        {
          "testimony": "When I heard the student girl and that pompous English murderer arguing...it got my goat.",
          "person": "Menimemo",
          "present": []
        },
        {
          "testimony": "It was nothing to do with Dr Wilson! We were discussing the stolen poison.",
          "person": "Rei",
          "present": []
        },
        {
          "testimony": "If the courts weren't going to punish Brett for what she did, someone else would have to see justice done!",
          "person": "Menimemo",
          "present": []
        },
        {
          "testimony": "The point is...if you'd poisoned someone, there'd be no reason to then go and stab the person as well!",
          "person": "Menimemo",
          "present": [
            "Poison Article"
          ],
          "source": {
            "evidence_span": "In the newspaper article, there's the following information about the stolen poison: 'Onset of symptoms occurs in minutes...ending with acute contraction of the pupils prior to death.",
            "testimony_span": "The point is...if you'd poisoned someone, there'd be no reason to then go and stab the person as well!",
            "explanation": "If a person die with acute contraction of the pupils, it can be inferred that he or she is died from this specific poison. Since the poison is very controlled, it is easier to induce who has contacted and steal the poison. Stab the victim by a dagger is to hopefully kill the victim before the symptom is shown, and thus enlarge the scope of possible suspects. ",
            "is_self_contained": "no",
            "context_span": "Under normal circumstances, the pupils dilate when someone dies. If there was extreme constriction instead...that's most certainly unusual, yes. A special indicator solution for a new poison under development by my father's team. It's been created in strict secrecy and exists only in my father's laboratory"
          }
        }
      ],
      "noPresent": false,
      "summarizedContext": "The witness Menimemo is testifying about the incident involving the Englishwoman and the poison article. ",
      "labels": [
        "behavior"
      ],
      "reasoning": [
        "Fact 1: The witness claims there is no reason to stab the victim if the poison was already used.",
        "Fact 2: The evidence suggests the posion was stolen and the symptoms of the poison would be visible before death.",
        "Fact 3: The poison is very controlled, and it is easier to induce who has contacted and steal the poison.",
        "Prop 1: If a person is killed by the poison, then he or she will show the unusual symptoms before death.",
        "Prop 2: If the poison is very well controlled, then the person who has contacted the poison can be easily induced.",
        "Prop 3: If the victim does not show the symptom, then it is possible to enlarge the scope of possible suspects."
      ]
    }
  ]
}