{
  "previousContext": "Episode II\nThe Memoirs of the Clouded Kokoro\nAnime cutscene\nIt was a ghastly tale of a winter's night - one of an invisible killer and a crime perpetrated on the pavement along Briar Road. As the victim lay at death's door, thy mystery of just who had stabbed the young lady from behind had been resolved. But no sooner had my friend saved that Eastern exchange student from his harrowing plight, than in the dim, flickering shadows of gaslight did a second bizarre crime rend the stillness of that very night. I daresay most can still recall the sensational headlines of the day. 'Haunted Apartment of Death' 'The Condemned Criminal's Curse' 'The Dread Demon of Coal Gas' Yet, though the great detective had at once discerned the truth upon his arrival at the scene, it only proved to be the overture that announced the rising of the curtain on a most tragic play.\nMy name is Ryunosuke Naruhodo. I'm a fledgling lawyer, just starting out on my journey. Six months ago, I arrived as a visiting student of law... ...having made the long voyage across the sea from the Empire of Japan to here...London, England. And on the way, in quite extraordinary circumstances, I made the acquaintance of a world-famous detective. Currently, I reside in the attic of the detective's own lodgings, from where I run my legal consultancy of sorts. I've successfully defended a number of clients in Britain's highest court, the Old Bailey. But since a particularly gruelling and unforgettable legal battle four months ago now... ...I haven't returned to the courtroom. In truth, I lost my right to return. But that epic trial was just part of an epic tale. A tale which was now about to awaken from slumber... ...thanks to a letter that arrived this morning from my homeland...\n*Ruuumble*\nRyunosuke:\n......... (Mmm, what a delicious smell wafting up the stairs... It must be nearly time for breakfast. I'd better go down to Mr Sholmes's suite... ...and say good morning to the great detective and his flatmate.)\n30th August, 7:28 a.m.\nSholmes's Suite\nIris:\nAh, Runo, good! I was just about to call up to you. The bacon's ready.\nRyunosuke:\nGood morning, Iris. It smells delicious as usual. Before we eat, though, I have some news. I had a surprise this morning-\nSholmes:\nShh! Not another word, Mr Naruhodo! This could be just the abstruse thing for my pre-breakfast stagnation-repelling mental stimulation, my dear fellow.\nRyunosuke:\n'Morning' to you too, Mr Sholmes.\nSholmes:\nAh...yes...I see... So that's it... The truth is as clear to me as day. My faculties of observation have revealed it again.\nRyunosuke:\nWh-What are you talking about?\nSholmes:\nYou, Mr Naruhodo. You have, this very morning, met with a surprise! ...Well? Is that not the case?\nRyunosuke:\nUm...\nSholmes:\nReally, my dear fellow, it barely warrants explanation. Firstly, your hair is particularly unkempt. Somewhat reminiscent of a bird's nest. Secondly, you have neglected to fasten the third button of your jacket. Clearly, when considered together, these two facts point to you having been flustered this morning.\nRyunosuke:\n......... Can I talk now?\nSholmes:\nBut of course, of course! Though I don't look for admiration, you understand.\nRyunosuke:\nMy hair always looks like this. It's been this way since I first met you.\nSholmes:\nOh. It has?\nRyunosuke:\nAnd the button...was ripped off last night, if you remember? ...By you.\nIris:\nHurley pulled your button off?\nSholmes:\n......... Ah yes, I recall the incident now. It was after supper, was it not? As the evening advanced, I picked up my violin and began to play the wailing notes of a haunting tune. But then, to my utter dismay, the third string snapped! Why did it have to happen? WHY?! Little wonder then, that in my vexation, I grabbed the first button I saw and ripped it from its proper place!\nRyunosuke:\n...Well, I'd like it back now, please. It's troubling me that I can't fasten my jacket.\nSholmes:\nAnd it's troubling me that you expect me to know where it is! Somewhere thereabouts on the floor, one presumes.\nRyunosuke:\n(Helpful.)\nSholmes:\nWhat matters at the present time, my dear fellow, is simply whether or not my deduction was unerring.\nIris:\nBut Hurley, Runo said it when he came in, didn't he? 'I had a surprise this morning.'\nSholmes:\n......... Ah ha ha ha ha hah! Well, that really is a surprise!\nRyunosuke:\n(Yes, this man is the pride of the British Empire. The famous consulting detective, Mr Herlock Sholmes. There can't be a single person in the world who doesn't know his name.)\nIris:\nAlright then, enough of this silly conversation. Come and eat this bacon before it goes cold. And I have a new herbal tea for you to try, too! My latest special blend!\nRyunosuke:\n(And here we have Iris Wilson, Mr Sholmes's lodger and companion. A truly exceptional young girl, who's the author of a highly successful serialisation here in London. Yes, 'The Adventures of Herlock Sholmes' as published in Randst Magazine.)\nSholmes:\nSo, Mr Naruhodo, won't you put us out of our misery? What surprised you this fine morning?\nRyunosuke:\nAh, well, I received a letter...from Japan.\nIris:\nOh! From Susie, you mean?! Was it? Really?\nRyunosuke:\nThat's right. And she had some rather startling news, in fact.\nSholmes:\nAh... intriguing indeed. You must tell us all about it over breakfast!\nIris:\nOh yes! What fun!\nAfter clearing all Converse options:\nRyunosuke:\nSummoning her back to Japan so suddenly like that... I wonder what Miss Susato's father is hiding.\nIris:\nHmmm... Hurley, do you know what it's all about?\nSholmes:\n...Hm? Ah, well, who can say?\nRyunosuke:\nWhat? But, but you said...\nSholmes:\nPlease, I have engagements, my dear fellow! My calendar is quite surprisingly full today. And a stringent analysis of the matter would be excessive, I feel. Even if I were quite at leisure. So! Man the fort in my absence, won't you, Iris?\nIris:\nI will, Hurley, don't worry. See you later!\nRyunosuke:\n(He scuttled off rather quickly there... I think perhaps Professor Mikotoba isn't the only person hiding something here. Soseki-san was involved in two cases, but only one of them was forbidden from being published. By, of all people...Mr Sholmes.)\nIris:\nAh-ha! I've found them at last!\nRyunosuke:\nIris! Are, are they...?\nIris:\nThe notes about the case? That's right. Susie and I compiled them together. 'The Case of the Haunted Lodgings'... Do you want to read them, Runo?\nRyunosuke:\n......... Absolutely. Thank you, Iris. I have no idea what secrets could still be hiding in the shadows of this case... ...but perhaps if I read over the notes again, something might come to light.\nIris:\nThat's the spirit!\nAnd so... ...Iris and I decided to read over the case notes again together. Everything from what happened, to our investigation and that fierce battle in court that followed. Reliving every detail... I just need to find a clue. And I have all the time in the world. Because of course... ...I'm no longer allowed to practise law in the courts of Great Britain.\nIt was six months ago... A mysterious incident that unfolded on the wintry streets of London. A young woman was found lying on the snowy pavement of Briar Road with a knife in her back. Fortunately, her life was spared, but she was unconscious for several days following the incident. The fog was thick, and nobody saw her attacker, but... ...by a cruel twist of fate, a visiting Japanese student was walking behind her at the time, and was duly arrested. That man was Soseki-san. And the man who effected his arrest...was Mr Sholmes. Believing in our compatriot's innocence, Susato-san and I decided to represent Soseki-san in court. And, after a gruelling trial of many twists and turns, we finally managed to prove his innocence.\nSoseki:\nJoyful, Joyous, Jubilant Jubilation!\nRyunosuke:\n...Was the man's reaction after the trial. But his jubilant jubilation was short lived. We received a telegram from Mr Sholmes the following morning. 'The victim of the Briar Road stabbing has regained consciousness. Hurry to Barts at once!' So Susato-san and I summoned a hansom and headed immediately to the hospital.\nBefore clearing all Converse options in Sholmes's Suite:\n30th August\nNaruhodo's Legal Consultancy\n21st February, 5:30 a.m.\nSt Bartholomew's Hospital, Recovery Ward\nSholmes:\nThere you are at last!\nRyunosuke:\nGood morning, Mr Sholmes.\nSholmes:\nI think not.\nSusato:\nOh!\nSholmes:\nYou're late! What on earth took you so long!\nSusato:\nYour telegram only arrived at five o'clock, Mr Sholmes. And it's a twenty-minute ride to the hospital.\nRyunosuke:\nThat's right, and it's half past five now. I think we made very good time.\nSholmes:\nThe time is utterly irrelevant! The fact is, I have been waiting for what has felt like an eternity.\nRyunosuke:\nHaah...\nSholmes:\nIn point of fact, I myself was awoken at four this morning by a telegram boy. And feeling it was somewhat unjust that I alone had been roused at such an hour, I sent one to you.\nRyunosuke:\n(Well thanks for that.)\nSholmes:\nAnyway, you're here now, so... The victim is over there. She's only just regained consciousness. You should introduce yourselves. And I shall observe from here.\nRyunosuke:\n(So that's the lady who was found on the snow-covered pavement with the knife in her back...)\nSusato:\nHer name is... Ah yes, here we are. Miss Green.\nAfter clearing all Converse options with Olive Green and examining picture frame:\n???:\nIs there a Mr Narrowfodder here? Mr Narrowfoddeeer?!\nRyunosuke:\n('Narrowfodder' now...?) Well, um, if you're looking for Naruhodo, the lawyer, that's me, but...\n???:\nAh! Mr Narrowfodder, good. This is for you. It's a message from a Mr Saucy Nutsmeg.\nRyunosuke:\nMr Natsume?! Sent a message...to me?\nSusato:\nBut why would a policeman be delivering a message from Mr Natsume?\nRyunosuke:\nExactly... (What's going on? What's a Scotland Yard constable doing playing delivery boy at this time in the morning?)\nSholmes:\nArgh, what are you waiting for?! Let me see that!\nRyunosuke:\nOh!\nSholmes:\n......... Well...this is most unexpected...\nRyunosuke:\nIs something wrong, Mr Sholmes?\nSholmes:\n'Is something wrong, Mr Sholmes?' he says! Have you not seen this note?!\nRyunosuke:\nNo, how could I have?!\nSholmes:\nIt would seem that London's criminals have no intention of letting the great detective rest. A new case calls. A case of murder, no less. ...We must depart at once!\nSusato:\nMurder?!\nSholmes:\nCall a cab! Time is of the essence!\nRyunosuke:\nBut...the trouble is... ...we've yet to read Mr Natsume's note. I was thinking we ought to pay him a visit in his lodgings once we did.\nSholmes:\nThat will be entirely convenient.\nSusato:\nConvenient? What do you mean?\nSholmes:\nIt's all here in the note, my dear fellows. The murder we must investigate...took place at Mr Moustache's lodgings!\nRyunosuke:\nWait...WHAT?!\nSusato:\nI'll hail a fiacre at once!\n(It was only yesterday that Soseki-san was in court and we were dispelling doubts about his innocence. And now...the very next day... ...there's a murder at the man's own address? He may very well be the unluckiest man alive.) ...Or so it seemed to us at the time, but we were soon to discover it was worse than we thought.\n21st February\nSholmes's Suite\n21st February, 7:18 a.m.\nMr Natsume's Lodgings, Ground Floor\nRyunosuke:\nWhat on earth...?!\nSusato:\nOh my! The gentleman is deceased, without question! He's dead!\nSoseki:\nL-L-L-Locum Student Mr Naruhodo Esquire!\nRyunosuke:\nMr Natsume!\nSoseki:\nOh...why...? Why is this happening? Why to me? I'VE ONLY JUST GOT OUT OF COURT! YESTERDAY! I WAS FINALLY HOME AFTER TWO DAYS OF MISERY! AND THEN I WAKE UP THE NEXT DAY TO THIS! NO EARLY BIRD SHOULD CATCH A WORM LIKE THIS!\nWOEFUL WORM WITHOUT WIGGLE!\nSholmes:\nI see you're in high spirits again this morning, Mr Moustache.\nSoseki:\nAAAAAAAAAAAAAAARGH!!! Not the horrible HERR LOCK SHOLMES! SHOO! SHOVE OFF! SHOW YOURSELF THE DOOR! I NEVER INVITED YOU!\nSusato:\nMr Sholmes came here with us. I'm quite sure he'll be able to help you, Mr Natsume!\nSholmes:\nI am entirely at your disposal, Mr Moustache. What can I do for you?\nSoseki:\nGRRRRRRRRRRRRRRR!\nGregson:\nTsk, here they are...already. The busybodies.\nSholmes:\nAh, Inspector Gregson. What a pleasant surprise.\nGregson:\nPleasant, is it? Gives me heartburn every time I see your face at a crime scene, Sholmes.\nSholmes:\nHah! I deduce, Inspector...that your heartburn is a result of your excessive consumption of fried food.\nRyunosuke:\nUm...good morning, Inspector.\nGregson:\n.........This is a crime scene! Don't you go touchin' anythin'!\nRyunosuke:\n(Or 'Good morning to you too, sunshine...')\nRyunosuke:\nUm, Mr Sholmes, what are you doing?\nSholmes:\nHah! You need only observe to know it, my dear fellow. Investigating, naturally!\nRyunosuke:\n...There's nothing natural about that pose.\nSusato:\nMr Sholmes! Have you made some miraculous discovery?\nSholmes:\nPatience, my dear madam, patience. We've not been here in this room five minutes. So far, all I've managed to deduce is what actually happened.\nSusato:\nMy goodness! But...isn't that everything we need to know, Mr Sholmes?\nSholmes:\nHm... Now that you propose the idea, I believe one could, indeed, see it that way. At the present time, I have managed to draw two incontrovertible conclusions. The first, that there was a physical struggle here last night in which the victim fought for his life.\nSoseki:\nAAAAAAAAAH!\nSusato:\nAh!\nRyunosuke:\nMr Natsume, what's wrong? Is something that Mr Sholmes said significant somehow?\nSoseki:\nN-No... Don't mind me! Forget I was here!\nSholmes:\nAnd my second conclusion... ...is that there was a poison lingering in the air here last night that passed the victim's lips.\nSoseki:\nN-N-N-NONSENSE!\nSusato:\nAh!\nRyunosuke:\nAlright, Mr Natsume. Why are you reacting so extremely to Mr Sholmes's deductions?\nSoseki:\nN-N-N-No... Please! Pretend I'm not here!\nInvisible, Ineffable, Inscrutable...Insignificant!\nRyunosuke:\n...Impossible to ignore.\nSusato:\nYou must tell us everything, Mr Sholmes! Spare no detail!\nSholmes:\n......... But of course. Let the theatrical tragedy before us be unravelled by my great deductions, presented for your pleasure in two acts!\nRyunosuke:\n(We've heard some truly astounding great deductions from Mr Sholmes in the past... No doubt this will be no exception. What miracles will unfold before our eyes this time?)\nSholmes:\nSo, my dear fellows, for your delight and wonder, let the curtain rise... ...for Herlock Sholmes's 'Logic and Reasoning Spectacular', Act One!\nThe Great Deduction\nThe game is afoot!\nTopic 1\nCause of Death\nSholmes:\nCareful observation of the victim reveals to us the events that transpired in this disconsolate room last night. Foam at the mouth of the deceased clearly indicates the use of poison. Next to the victim, we notice a large dining plate, which contains, you will observe... ...one half of a sizeable bar of soap. Meaningful? Indubitably. Why is this soap set so purposefully upon the dish? Like the victim's last supper, in fact. Yes... Could it be that the man was about to eat it? Of course, the fork reveals the answer. It appears that the young man's appetite was his undoing. Taking up arms in the form of his cutlery, the victim engaged in a deadly battle for his life. Yet the struggle against his hunger was in vain, for in the end, he couldn't resist devouring the slippery feast! But London's foul soap is besmirched by foul poison. Yes, the victim's life was claimed by poison that tainted the contents of the plate! The soap...and the lather about the young man's mouth are too perfectly matched to ignore. The cause of death was clearly intoxication due to excessive ingestion of foul soap! ...Though personally, I have a greater interest in the taste of foul candlewax, of course.\nTopic 1\nCause of Death\nConclusion\nPoisoning from soap ingestion\nTopic 2\nSuicide or Murder?\nSholmes:\nThe cause of death identified, we proceed to Act Two, where we ponder the next question: Was this suicide or murder? The audience will recall that death occurred during the victim's 'last supper'. Did the man dine and die alone? This single teacup suggests the answer. To draw a conclusion on such meagre evidence would be foolish however, certainly. The careful criminal could have absconded with his own cup to cover his tracks. Well, allow me to lift the veil of doubt, my dear fellow. Indeed. What reveals the answer, of course, is the broken lock! Though forced open now, at the time of the incident, this door was locked. And the sole key was in the victim's pocket. In other words, when the victim consumed the poison, he must have been alone. Alone with his inferior soap, from whence wafted an inferior scent. And with that acrid aroma lingering in the air, the victim met his end...in tragic solitude. We can take comfort only in the fact that his soul was well cleansed on its way to the hereafter.\nTopic 2\nSuicide or Murder?\nConclusion\nNo possible perpetrator present\nSholmes:\nThus concludes the final act of Herlock Sholmes's great deduction!\nSusato:\n.........\nGregson:\n.........\nRyunosuke:\n...There's just one thing, Mr Sholmes...\nSholmes:\nYou are disposed to identifying 'just one thing', aren't you, Mr Naruhodo? Pray, what concerns you?\nRyunosuke:\nWell...no matter how hungry he was, do you really think the man would have eaten soap?\nSholmes:\nIt is quite apparent that this man had barely a penny to his name. It is a curious thing, but to one so destitute, soap can suddenly appear quite irresistibly appetising.\nSusato:\nHow extraordinary!\nSholmes:\nIn truth, I have tried a little soap myself in the past.\nRyunosuke:\nYou've eaten it, you mean?!\nSholmes:\nMy dear fellow, it was some time ago now. My postulation was that it would cleanse my gut.\nSusato:\nAnd did it?\nSholmes:\nAs I writhed in agony on the floor and spilt the contents of my stomach...yes, I believe it did. The experience taught me a valuable lesson: soap is quite poisonous. It has an unpleasant taste and leads to great discomfort. In summary, I cannot recommend it.\nRyunosuke:\n(Believe me, I wouldn't eat it even if you did.)\nSusato:\nThere's something that troubles me as well, actually.\nRyunosuke:\nOh? What's that?\nSusato:\nIt's Mr Natsume.\nSoseki:\nAh!\nSusato:\nI couldn't help noticing him shuddering and quivering out of the corner of my eye. Almost as if Mr Sholmes's deductions touched a nerve somehow.\nSoseki:\nN-N-N-N-N-Nonsense...\nRyunosuke:\n(Well, that clenched teeth episode didn't last...)\nSusato:\nI think...judging by Mr Natsume's reaction... ...the great detective's deductions may need some gentle corrections in order to reach the actual truth.\nRyunosuke:\n(Yes, Mr Sholmes's observations and deductions are sometimes a little too sharp... He has a tendency to hit the nail on the side of the head and drive it in at an obtuse angle. When he does that, it falls to us to straighten things out.) Alright then, let's see what we can do.\nSusato:\nYes, we must pick out the key words in Mr Sholmes's quite brilliant deductions... ...and discreetly exchange them for something that makes a little more sense. If we can do that... ...I'm sure we'll arrive at what Mr Sholmes meant to say in the first place!\nSholmes:\nIn that case...are you ready for the second performance of the day? Once again, my dear fellows, for your continued delight and wonder, let the curtain rise... ...for Herlock Sholmes's 'Logic and Reasoning Spectacular', Act One!\nCourse Correction\nHold it, Mr Sholmes!\nTopic 1\nCause of Death\nConclusion\nPoisoning from soap ingestion\nSholmes:\nCareful observation of the victim reveals to us the events that transpired in this disconsolate room last night. Foam at the mouth of the deceased clearly indicates the use of poison. Next to the victim, we notice a large dining plate, which contains, you will observe... ...one half of a sizeable bar of soap. Meaningful? Indubitably. Why is this soap set so purposefully upon the dish? Like the victim's last supper, in fact. Yes... Could it be that the man was about to eat it? Of course, the fork reveals the answer.\nRyunosuke:\nWell, you can't deny that a fork implies the man was eating something, or about to eat something.\nSusato:\nYes, that's true. If I were to decide to eat some soap, I should prefer to use a fork than to attempt it with chopsticks.\nRyunosuke:\nAnd of course, only half of the bar of soap is left on the plate.\nSusato:\nBut might there not be some other explanation? Something material that proves whether or not the man really ate some soap...\nCould it be that the man was about to eat it? Of course, the fork reveals the answer.\nRyunosuke:\nSome soup on a plate, and a fork in hand... Even so, surely you wouldn't try to eat soap, no matter how hungry you were.\nSusato:\nThat's what we must determine: was the victim eating soap when he died or not? Until we can establish that with some certainty, we shan't make any progress.\nRyunosuke:\n(Talk about a slippery problem...)\nRyunosuke:\nCould it be that the man was about to eat it? Of course, the other piece of soap reveals the answer.\nSholmes:\nIt being the other half of the soap on the table. In short, the victim was not eating soap at all. But it's obvious, really. For no depths of hunger could drive any man to attempt to eat soap. Even I, with my unquenchable thirst for practical knowledge, took only a single bite!\nRyunosuke:\nBut that begs the question of how the man was poisoned. Because there's no sign of any food on the table.\nSholmes:\nAn excellent observation, Mr Naruhodo. And one that furnishes us with the answer we seek. For London's foul soap is besmirched by foul poison. Yes, the victim's life was claimed by poison that tainted the contents of the plate!\nRyunosuke:\nMr Sholmes is still pushing the soap argument, then.\nSusato:\nPerhaps he's suggesting the man licked the soap rather than ate it.\nRyunosuke:\nIf soap in London is that poisonous, I don't think I want to be washing my hands with it. (But there are no signs of any food in this room at all.)\nSusato:\nOf course, food isn't the only thing that passes people's lips, is it?\nYes, the victim's life was claimed by poison that tainted the contents of the plate!\nRyunosuke:\nIf the cause of death was poison, how did it get into the victim's body?\nSusato:\nI think it might be difficult to establish the answer conclusively at this point. But at the very least, the idea of poisoned soap should be discounted, I think. I'm sure there's a far more likely explanation before our eyes here.\nRyunosuke:\n(Something obvious that could explain how poison passed the victim's lips...)\nRyunosuke:\nYes, the victim's life was claimed by poison that tainted the teacup!\nSholmes:\nIndeed! Cups have been the vessel of choice for practising poisoners over the centuries. And it would appear that this victim drank every last drop.\nRyunosuke:\nThere's no sign of food anywhere in the room.\nSholmes:\nWhich leads us to the immutable conclusion: The cause of death was clearly intoxication due to the ingestion of poison contained in this teacup!\nTopic 1\nCause of Death\nConclusion\nPoisoning from soap ingestion\nPoison in the tea\nSolved\nTopic 2\nSuicide or Murder?\nConclusion\nNo possible perpetrator present\nSholmes:\nThe cause of death identified, we proceed to Act Two, where we ponder the next question: Was this suicide or murder? The audience will recall that death occurred during the victim's 'last supper'. Did the man dine and die alone? This single teacup suggests the answer.\nRyunosuke:\nAh, the 'Western vessel for infused hot drinks' again. It's already featured heavily in our deductions so far.\nSusato:\nYes, we can imagine that shortly before his death, Mr Shamspeare was having a drink of tea. There would be nothing remarkable about that. But what troubles me...\nRyunosuke:\n...Is Mr Natsume's reaction when he heard Mr Sholmes suggest it. (There's more to this deduction than it seems...)\nSusato:\nWe must closely examine the scene of the crime again for some more clues!\nDid the man dine and die alone? This single teacup suggests the answer.\nSusato:\nIt's crucial that we determine whether or not there was somebody else present at the time of death. It will tell us if this was a murder or suicide.\nRyunosuke:\nYes, and while the argument that the presence of a single teacup shows he was alone is a good one... (...we need to make sure we look at this from all angles...)\nRyunosuke:\nDid the man dine and die alone? This other teacup suggests the answer. Yes! There were two teacups in this room all along!\nSoseki:\nAh!\nRyunosuke:\nIn other words, this is a strong indication that at the victim's 'last supper'... ...there was a guest present!\nSholmes:\n...At the very least, we can say now with certainty... ...that somebody else was here in this room last night, taking tea with the victim!\nSoseki:\nWh-Wh-What are you TALKING ABOUT?!\nUtterly, Unbelievably, Unjustly Unreasonable!\nSholmes:\nTo draw a conclusion on such meagre evidence would be foolish however, certainly.\nRyunosuke:\nIn which case, what more can we deduce about this possible 'guest' at the table?\nSholmes:\nWell, allow me to lift the veil of doubt, my dear fellow.\nRyunosuke:\nDo you mean to say, you know who exactly was in this room at the time of the victim's death?!\nSholmes:\nIndeed. What reveals the answer, of course, is the broken lock!\nRyunosuke:\n...I'm not sure I like where this deduction is going now.\nSusato:\nI'm afraid it's too late to go back to the halcyon days of eating too much soap.\nRyunosuke:\nBut the identity of the 'guest' who was in here last night when the victim passed away is... Is something I have a very bad feeling about.\nSusato:\nWell, you can try to ignore your feelings, but we cannot ignore the truth, Mr Naruhodo.\nRyunosuke:\n(No, I suppose not. Time to look around again...)\nIndeed. What reveals the answer, of course, is the broken lock!\nRyunosuke:\nWas there somebody else in here last night, or not... Clearly that's a fundamental question that will reveal the truth about this man's passing.\nSusato:\nExactly. So we must make sure we have solid grounds for our conclusion.\nRyunosuke:\n(I must have another look around and make sure there's not more here than meets the eye...)\nRyunosuke:\nIndeed. What reveals the answer, of course, is the pile of familiar books!\nSholmes:\nQuite so! It's no mere coincidence that these three titles are here in this room. It's the link to the truth!\nSoseki:\nAgh!\nRyunosuke:\nMr Natsume, you purchased these books four days ago at a secondhand bookshop.\nSoseki:\nTh-That's just...a c-c-c-coincidence!\nSholmes:\nIn that case, you will be able to bring the same three titles from your own room, will you not? This very moment!\nSoseki:\n.........\nNo! Never! Non-Negotiable!\nRyunosuke:\nIf you can't bring your own copies here, it proves that these three books are in fact yours.\nSoseki:\nHnnnnnngh...\nRyunosuke:\nHaving purchased the books four days ago and returned to your lodgings, you were arrested the very next day. So you could conceivably have brought the books here on that evening, but you never mentioned that.\nSholmes:\nIn other words, you could only have brought these three books here to the victim's room... ...last night, having returned to your lodgings after the trial concluded at the Old Bailey.\nSoseki:\nAh...um...aaah...aaaaaah...\nSholmes:\nIn short...there is only one possible conclusion: The victim died here in his room last night as a result of poisoning.\nRyunosuke:\nAnd that same night, the victim had a visitor.\nSholmes:\nAnd that visitor...\nRyunosuke:\n...Was you, Mr Soseki Natsume!\nSholmes:\nThus concludes the final act of Herlock Sholmes's great deduction!\nTopic 2\nSuicide or Murder?\nConclusion\nNo possible perpetrator present\nSoseki Natsume at the scene\nSolved\nDeduction CompleteElementary!\nSoseki:\nHuuurgh...uuurgh... Not again... Not again... Not again... NOT AGAAAAAAAAAAAAIN!!!\nGregson:\nWell then, Mr Natsume... ...it would appear you're gonna have to accompany me down to the Yard...again.\nSoseki:\nBut, but, but... But wait! HOLD YOUR HORSES!\nGregson:\nYes?\nSoseki:\nDoor! Key! Locked! Entry! Exit! Entirely! Impossible!\nRyunosuke:\n(He's so flustered he's being even stranger than normal...)\nGregson:\nWhat, you think that's an alibi? You could have just made a copy.\nSoseki:\nWha...?\nGregson:\nYou live in the same buildin', after all. You'd have had plenty of opportunity, I'm sure.\nSoseki:\nB-B-B-B-But... MISERY MEEEEEEEEE!\nGregson:\nSorry, sir, you'll get your chance to give your side of the story later.\nSholmes:\nThe facts speak for themselves, Mr Moustache.\nSoseki:\nAaargh...you...you... You horrible Herr Lock Sholmes!\nRyunosuke:\n(He really has found himself an arch-rival now, hasn't he?)\nGregson:\nCome on now, no dilly-dallyin'. Outside! There's a carriage waitin'.\nSoseki:\nLocum Student Mr Naruhodo Esquire! I, I never imagined I'd be in this position again, but... YOU HAVE TO HELP ME! Please! Please! I'm innocent!\nRyunosuke:\n...Alright, I understand. We'll come to your cell later and talk about it.\nSoseki:\nAnd one more thing!\nRyunosuke:\nOh! Yes?\nSoseki:\nMy, my poor little kitty-cat... Please give him his breakfast for me!\nAnd so... ...his evil curse still apparently unbroken... ...Soseki-san found himself once again the prime suspect in a case of murder. Thanks to the incriminating deduction of the great detective.\nSholmes:\nMy dear fellow, that honour belongs to you!\nRyunosuke:\nWell, at least that means Inspector Gregson is no longer here. We can examine the crime scene in more detail now.\nSusato:\nYes, that's right. Ah, and of course...\nRyunosuke:\nWhat?\nSusato:\nHave you forgotten what the inspector mentioned before? It was the landlord, Mr Garrideb, who discovered Mr Shamspeare.\nRyunosuke:\nAh, Mr John Garrideb, yes...\nSusato:\nI expect we could find him in his sitting room on the top floor as usual.\nRyunosuke:\nRight. We must remember to go and talk to him later, then.\nAfter examining meter on wall, teacup, bricked-up window twice, and paper scrap on floor:\n???:\n...Looks like you're havin' a good snoop around, eh?\nRyunosuke:\nInspector Gregson! B-Back so soon?\nGregson:\nAfter I threw that little Japanese fella in the clink, I went and reported this to the investigation division. In five minutes' time, this place will be cordoned off by the Yard.\nRyunosuke:\nOh, I see. Well, we'd better be leaving then.\nSusato:\nPoor Mr Natsume must be feeling very low, being back in a cell again so soon...\nRyunosuke:\nI'm sure. We should probably go...and.........\nSusato:\nWhat's wrong, Mr Naruhodo? KYAAAAAAAAAAAAAAAH!!!\nShamspeare:\n'Out, out, brief candle! Life's but a walking shadow, a poor player... That struts and frets his hour upon the stage, And then is heard no more...' ......... ...Now, how soundeth the next part?\nGregson:\n'It is a tale. Told by an idiot, full of sound and fury, Signifying nothing.'\nShamspeare:\nIndeed! Oh, happy day!\nRyunosuke:\nWa-Wa-Wa-Wa-Wa... ...WALKING DEEEEEEEEEAD!!!\nGregson:\nThe, the fella isn't dead at all?!\nRyunosuke:\nWhat was that nonsense he was saying, though?\nSusato:\nI think... Yes, it was from William Shakespeare's 'Macbeth'. A soliloquy from Act Five, Scene Five.\nRyunosuke:\nShakespeare...\nSo it was... ...that the victim, Mr William Shamspeare...'came back to life'. If the man had indeed been poisoned, it transpired that it hadn't killed him. He was taken by emergency carriage to a nearby hospital for treatment. And Inspector Gregson evicted us from the scene of the crime...whatever that now was.\n21st February\nBriar Road\nSusato:\nWhatever do you think will happen now?\nRyunosuke:\n...Good question. What a strange situation for Mr Natsume. Arrested for murder, but then the victim comes back to life!\nSusato:\nI think perhaps the victim was never dead in the first place. It seems very likely that Mr Shamspeare did consume poison, as we deduced... ...but was it an accident, attempted suicide...or attempted murder? Until the truth can be established, I imagine the police will keep Mr Natsume in custody.\nRyunosuke:\nI suppose so... Let's hope it doesn't come to anything more than a night in the cells... (Oh...what's this? What's that man doing over there? He looks like he's trying to see into Soseki-san's lodgings...)\nSusato:\nIs something wrong, Mr Naruhodo?\nRyunosuke:\nUm, excuse me! Could we have a word?\n???:\nAh!\nRyunosuke:\n(He just ran off...)\nSusato:\nI feel sure that I've seen that man somewhere before. Where was it...?\nRyunosuke:\nHm... (I do too, but I don't remember...)\n21st February\nNaruhodo's Legal Consultancy\n21st February\nThe Garridebs' Room\nRyunosuke:\n(Here we are again. The eccentric landlord's eccentric top floor abode...)\nSusato:\nWe're here because Mr Garrideb's the one who discovered the incident this morning, don't forget.\nGarrideb:\nAh...you chaps, eh?\nRyunosuke:\nYes, good morning, sir.\nGarrideb:\nThank you for your...cooperation in court yesterday.\nRyunosuke:\n(It was quite a trial... As much for Mr Garrideb as anyone, really.)\nGarrideb:\nCame straight back here after all that business at the Bailey yesterday. Didn't expect to wake up to more bally nonsense this morning!\nSusato:\nI wonder...if you wouldn't mind telling us exactly what happened, Mr Garrideb?\nGarrideb:\nYes...I suppose you'd like to know all about that dead loss of an actor chap in the ground floor room.\nRyunosuke:\n(Those were exactly Inspector Gregson's words, weren't they?)\nAfter clearing all Converse options with John Garrideb and examining meter on wall, teacup, bricked-up window twice, and paper scrap on floor in Mr Natsume's Lodgings, Ground Floor:\nRyunosuke:\nWell, we've done as much investigating here as we can, I think. Perhaps we ought to go to the prison and speak with Mr Natsume again.\nSusato:\nA good idea!\n21st February\nLocal Prison, Cell 9\nSusato:\nLook, Mr Naruhodo. Mr Natsume...have the police finished questioning you now?\nSoseki:\nLocum Student Mr Naruhodo Esquire!\nRyunosuke:\nOh! Y-Yes?\nSoseki:\nWhat is he? Tell me! Is he a ghost? Is he here to haunt me?!\nRyunosuke:\nLet me guess... You're talking about Mr Sholmes?\nSusato:\nHe actually calls himself a great detective, Mr Natsume. Not a ghost.\nSoseki:\nBut, but his diabolic deductions... They're not of this world... They've...they've...they've left me... AAAH! Cursed! I'm cursed, I tell you!\nRyunosuke:\n(Well, that sort of hurts...)\nSusato:\nCredit where credit is due, Mr Naruhodo. You were heavily involved in the deduction, too.\nRyunosuke:\nYes, um...moving on... We have some wonderful news!\nSoseki:\nOh?\nSusato:\nThe victim that we all thought was dead...has come back to life again!\nSoseki:\n.........\nRyunosuke:\nNow, in the absolutely worst case, you could only be tried for attempted murder! That's...great, isn't it? Mr Natsume?\nSoseki:\nIT'S TERRIBLE!\nSusato:\nOh!\nSoseki:\nI'm stuck! In this cell! Suffering! For some silly! Wrong end of the stick! 'You did it, didn't you?' 'Confess!' 'You're a killer!' 'Why the moustache?' CONSTANT QUESTIONS!\nRyunosuke:\nI'm sorry to hear that...\nSoseki:\nARGH, THAT SELFISH SHYSTER! Make up your mind! Are you dead or alive? If you were going to come back to life, why bother dying?\nWickedly Wishy-Washy William!\nRyunosuke:\nWell...it seems likely that Mr Shamspeare was never actually dead in the first place.\nSoseki:\nAh, yes, that might make sense... And I'm pleased that he's alive, of course. Our lively debate last night was much fun. I'd be sad to think it was our last.\nSusato:\nOh!\nSoseki:\nOops.\nRyunosuke:\nUm, Mr Natsume...does this mean... ...that you did see the victim last night? You met with Mr Shamspeare, didn't you?\nSoseki:\n......... I'm not saying another word! I demand to have a lawyer present!\nRyunosuke:\nWho do you think I am? Please, Mr Natsume, we need to hear your side of the story!\nSoseki:\nUgh... Why am I cursed like this...?\nAfter clearing all Converse options:\nSoseki:\nOf course... ...Mr Lord-of-the-Manor is worried about the curse on my room as well.\nRyunosuke:\nYou mean Mr Garrideb?\nSoseki:\nYes. He knows that if people keep dying there, he'll never be able to rent it out again.\nRyunosuke:\nWell, that's true. I, for one, wouldn't go near the place.\nSusato:\nAh... Perhaps... ...that may explain why the landlord pays so much attention to the gas lamps and his tenants' movements.\nRyunosuke:\nYou mean...because he's worried about their well-being? (He does seem to have an unusually keen interest in the amount of gas in the pipes... There must be a reason why he keeps such close tabs on the occupants of his let rooms.)\nSoseki:\nWhat do you mean, 'he pays so much attention to the gas lamps'?\nSusato:\nOh dear! No! It's nothing to do with you, Mr Natsume! Please, forget I said anything!\nSoseki:\nOh, now you're talking about me behind my back as well...\nRyunosuke:\nWhat's important is that Mr Shamspeare isn't in fact dead at all. Once he's come round and he's able to tell us what happened, we'll be able to get you released.\nSoseki:\nYes, please! Oh, I do hope you're right!\n???:\nAhem! Excuse me...\nRyunosuke:\nInspector Gregson!\nGregson:\nI couldn't help overhearin' what you just said. And on that note... ...I have some good news and some bad news.\nSoseki:\nOh.\nGregson:\nWhich d'you want first?\nSoseki:\nAlways! Every time! The bad news comes first! 'When hope is all you have, hold onto it!' That's my guiding principle!\nGregson:\nRight, well, in that case...the good news it is!\nSoseki:\nHuh?\nGregson:\nSorry, but it's just a lot easier to explain everythin' that way.\nSoseki:\n...Then why did you ask me my preference?\nGregson:\nAs you might have heard, the victim, Mr Shamspeare, was just unconscious. He's come round now.\nRyunosuke:\nYes...we saw it happen in all its terrifying glory.\nGregson:\nHe's still bein' treated by the doctors, but we've managed to get a written statement from him already.\nSusato:\nOh, isn't that wonderful, Mr Natsume?\nSoseki:\nOh, thank goodness... It's all over, then. I can leave this sombre cell...\nGregson:\nSorry, no. That's not on the cards.\nSoseki:\nWhat?\nSusato:\nWhy ever not, Inspector?\nGregson:\nMr Shamspeare has implicated someone as bein' responsible for what happened last night.\nRyunosuke:\nImplicated someone?\nSusato:\nOh dear!\nSoseki:\nYou, you don't mean...?\nGregson:\nI'm sorry to say I do, yes. He's pointed the finger at you, Mr Natsume.\nSoseki:\nARGH!\nGregson:\n'By sweet poison did he seeketh to end my life. That wicked'st caitiff...Soseki Natsume!'\nRyunosuke:\nNo!\nGregson:\nSo I'm afraid you'll be appearin' in court as planned. You'll be wantin' to make the necessary preparations.\nSoseki:\nNnnnnn... NOOOOOOOOOOOOOOOOOOOOOH!\nRyunosuke:\nAnd so...once again, Soseki-san found himself having to take the dock in the Old Bailey. Whether his room was haunted or whether he was just terribly unlucky, I knew I had no choice... The following day I would represent him in court, and do my utmost to break the curse that blighted him!\nTo be continued...",
  "characters": [
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Susato Mikotoba",
      "age": "16",
      "description1": "A judicial assistant sent to Britain on a study tour. She's the epitome of a refined Japanese lady and a huge help to me always."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Iris Wilson",
      "age": "10",
      "description1": "An extraordinary young girl who lives with Mr Sholmes. She has a degree in medicine and is the author of a popular series of short stories."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Herlock Sholmes",
      "age": "34",
      "description1": "There's not a person in the world who hasn't heard of this famous great detective, whose deductions never fail to surprise."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Olive Green",
      "age": "20",
      "description1": "An art-school student whose ambition is to become an artist. She's just regained consciousness, having been comatose for days after suffering a stab to from the back."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Soseki Natsume",
      "age": "33",
      "description1": "A Japanese scholar sent to London to further his research into the English language. He's just been acquitted of a very serious crime.↳A Japanese scholar sent to London to further his research into the English language. He's just been acquitted of a very serious crime, but now finds himself accused of another."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Tobias Gregson",
      "age": "44",
      "description1": "The detective inspector in charge of Scotland Yard's investigation of the case. He's stern and single-minded in his approach, and a great lover of fish and chips."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "William Shamspeare",
      "age": "31",
      "description1": "The victim of the current case - a failed actor renting a room in the same building as Mr Natsume's lodgings."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "John Garrideb",
      "age": "46",
      "description1": "A retired army man who's the landlord of the lodgings rented by the defendant, Mr Natsume. An old knee injury means he's confined to a chair most of the time."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Barok van Zieks",
      "age": "32",
      "description1": "A prosecutor known as the Reaper of the Bailey. Supposedly, the souls of those he prosecutes are eternally damned, one way or another."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Adron B. Metermann",
      "age": "23",
      "description1": "A young man who works for Altamont Gas. He's a witness to the incident."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Quinby Altamont",
      "age": "38",
      "description1": "The wife of the owner of the Altamont Gas Company. She's a staunch believer in the superiority of the fuel and utterly unforgiving of gas theft."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Duncan Ross",
      "age": "21",
      "description1": "The love of Miss Green's life, who sadly passed away a month ago as a result of gas poisoning."
    }
  ],
  "evidences": [
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Armband",
      "type": "",
      "obtained": "",
      "description1": "An armband I inherited from Kazuma. It identifies the wearer as a defence lawyer throughout the Empire of Japan."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Secondhand Book Receipt",
      "type": "",
      "obtained": "",
      "description1": "A receipt for some books that Mr Natsume purchased at a secondhand bookshop. It was submitted as evidence in the trial the other day."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Nearby Street Map",
      "type": "",
      "obtained": "",
      "description1": "A street map of the neighbourhood where Mr Natsume has his lodgings. It was submitted as evidence in the trial the other day."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Pair of Teacups",
      "type": "",
      "obtained": "",
      "description1": "The teacups used by Mr Shamspeare and Mr Natsume. The one with the green line around the rim was Mr Natsume's.",
      "description2": "The teacups used by Mr Shamspeare and Mr Natsume. There is no tea ring on the inside of Mr Natsume's cup."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Torn-Off End of Envelope",
      "type": "",
      "obtained": "",
      "description1": "A ripped piece of an envelope that was found in Mr Shamspeare's room. The rest of the envelope could not be located.",
      "description2": "A ripped piece of an envelope that was found in Mr Shamspeare's room. It fits perfectly with an envelope in Miss Green's possession."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Bar of Soap",
      "type": "",
      "obtained": "",
      "description1": "A cheap bar of soap that was discovered just outside Mr Shamspeare's window. It's one of two that were found there.",
      "description2": "A cheap bar of soap that was discovered just outside Mr Shamspeare's window. There is a two centimetre diameter circular depression in the middle of one surface."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Crime Scene Photograph",
      "type": "",
      "obtained": "",
      "description1": "A photographic print of the scene taken by police upon their arrival. The victim can be seen unconscious at the table, having been poisoned."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Victim's Medical Report",
      "type": "",
      "obtained": "",
      "description1": "A report issued by Scotland Yard's medical officer. It obviously mentions the poison as well as other details gleaned during the police investigation."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Gas Meter",
      "type": "",
      "obtained": "",
      "description1": "A meter that dispenses gas for a set time after a coin is inserted. It sports a very strong lock, especially with Mr Shamspeare in mind.",
      "description2": "A meter that dispenses gas for a set time after a coin is inserted. The attached coin box sports a very strong lock, and there is a tiny hole in its base."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Handprints on the Wall",
      "type": "",
      "obtained": "",
      "description1": "Traces of handprints on the wall, discovered using the Skin Print Seeker gun. There are multiple prints on either side of a hanging picture."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Capital Offender Article",
      "type": "",
      "obtained": "",
      "description1": "A newspaper article about Selden, a criminal sentenced to receive the death penalty. However, he died of illness in prison whilst his loot remained undiscovered."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Hidden Photograph",
      "type": "",
      "obtained": "",
      "description1": "A photographic print found in Mr Shamspeare's room. It shows the landlord, Mr Garrideb, together with a young man."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Bottle of Poison",
      "type": "",
      "obtained": "",
      "description1": "A bottle found in the possession of Miss Green with traces of the slow-acting poison strychnine inside."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Capital Offender's File",
      "type": "",
      "obtained": "",
      "description1": "Scotland Yard's file about the convicted criminal Selden that includes the newspaper article about him dying of illness in prison."
    },
    {
      "currentChapter": "The Memoirs of the Clouded Kokoro",
      "name": "Miss Green's Card",
      "type": "",
      "obtained": "",
      "description1": "A note in an envelope that seems to have been ripped open rather roughly. It contains instructions to meet with someone who claims to have information about Duncan Ross.",
      "description2": "A note in an envelope that seems to have been ripped open rather roughly. The envelope fits perfectly with a torn-off piece found at the scene of the crime."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "The Memoirs of the Clouded Kokoro\n\n\n\n\n\n\n\n\n\nTranscriptPart 1\n\nPart 2\n\nPart 3\n\nPart 422nd February, 9:23 a.m.\nThe Old Bailey, Defendants' AntechamberExamine evidence\n\n\n\n\n\n\n\n\n\nBar of Soap\n\n\n\n\n\n\n\n\n\nCircular depression\n\n\n\n\n\n\n\nRyunosuke:\n...Oh.\nSusato:\nWhat is it, Mr Naruhodo?\nRyunosuke:\nThis bar of soap... When we first found it, I could have sworn... ...there was some sort of round disk in this depression just here. A reddish one.\nSusato:\nYes, you're right. I remember it, too. But now the depression is completely empty.\nRyunosuke:\n(Where could the disk have gone...?)\nThe details of the bar of soap have been updated in the Court Record.\n\n\n\n\nCircular depression (subsequent times)\n\n\n\n\n\n\n\nRyunosuke:\n...Oh.\nSusato:\nWhat is it, Mr Naruhodo?\nRyunosuke:\nThis bar of soap... When we first found it, I could have sworn... ...there was some sort of round disk in this depression just here. A reddish one.\nSusato:\nYes, you're right. I remember it, too. But now the depression is completely empty.\nRyunosuke:\n(Where could the disk have gone...?)Ryunosuke:\n(The Old Bailey... This place always makes me feel strange. I seem to get chills down my spine and break out in a nervous sweat all at the same time...) Well...I didn't think I'd be back here so soon.???:That's my line!Soseki:\nGOOD MORNING!Ryunosuke:\nAh! Good morning, Mr Natsume.Soseki:\nIt was only two days ago that I was declared not guilty here.Ryunosuke:\n(Yes, we somehow managed to prove he didn't stab Miss Green in the back...)Soseki:\nBUT NOW THIS! ANOTHER MORNING, ANOTHER MURDER! AND HERE I AM AGAIN IN THIS HELLHOLE!Can't Keep Coming to Court!Ryunosuke:\n(I'm beginning to think he's right. It really does seem as though he's cursed.)Susato:\nMr Naruhodo! I'm afraid I have bad news! .........Oh! Mr Natsume... Good morning.Soseki:\n...Yes, morning.Susato:\nSo...here we are again!Soseki:\n...Yes, again.Susato:\n.........Soseki:\n......... JUDICIAL ASSISTANT MISS MIKOTOBA ESQUIRESS! WHAT'S THE BAD NEWS?Susato:\nOh dear... You heard, did you?Soseki:\nIf you come in shouting at the top of your voice...PEOPLE CAN'T HELP HEARING WHAT YOU SAY!Susato:\nOh... I am sorry.Ryunosuke:\nYou've done nothing wrong, Miss Susato. Now, what is it?Susato:\n......... Well...it seems that the prosecution in today's trial... ...will be led by Lord Barok van Zieks.Ryunosuke:\nVan, van Zieks...?Soseki:\nGAAAAARGH! Oh no... Oh no no...Ryunosuke:\n(The so-called 'Reaper of the Bailey'... The most legendary prosecutor in the land... In the trial two days ago, he pursued Soseki-san and I relentlessly. Of course, by the skin of our teeth, we managed to pull through, but still...)Susato:\nPerhaps Mr Natsume's acquittal in the last trial wasn't the end of the matter. After all...Ryunosuke:\nYes, I know what you're thinking. The legend of the Reaper that says... ...nothing can save a person in the dock when Lord van Zieks is the prosecutor.Soseki:\nOh no...Susato:\nThat even if that person is found not guilty...the accused will meet a mysterious end one way or another...Ryunosuke:\n(And we've experienced it firsthand. A man we successfully defended met the most terrifying end after his acquittal...right here in the Old Bailey...)Soseki:\nAGH! DO I HAVE TO PUT UP WITH THOSE ICE-COLD EYES BORING INTO MY SOUL AGAIN?! CURSED BY EVIL SPIRITS AND NOW BY THE REAPER!Pair of Petrifying Perils, Potentially!Susato:\nWell, if it's 'potentially'...at least you appear to have hope, Mr Natsume.Soseki:\nLocum Student Mr Naruhodo Esquire!Ryunosuke:\nAh! ...Yes?!Soseki:\nI'm...I'M INNOCENT! YOU HAVE TO BELIEVE ME! You, more than anyone now...Ryunosuke:\n......... Don't worry. I'll be your steadfast ally every step of the way in this battle. ...I promise! (...And this promises to be a hard battle, I fear...)Susato:\nWell... ...the trial is scheduled to begin shortly. We should move into the courtroom.Ryunosuke:\nLet's go!Susato:\nOh yes, I forgot to say... I'm afraid he won't be able to make it. Mr Sholmes, I mean.Ryunosuke:\n......... That's probably for the best.Susato:\nOh!Ryunosuke:\nIf he were here, I might be tempted to rely on his help. And that could be seen as a weakness. If Lord van Zieks were to notice, he'd prey on it mercilessly. At least, that's my gut feeling.Susato:\nMr Naruhodo...Soseki:\nYou're right... Yes, you're so right. Oh, well said, Locum Student Mr Naruhodo Esquire! Well said!Ryunosuke:\nI swear on this sword at my side, and on the spirit of Kazuma that it harbours... ...I'll show him what a Japanese lawyer can do! I'll set you free...with honour!Susato:\nOh yes!22nd February, 9:40 a.m.\nThe Old Bailey CourtroomJudge:\nIn the name of Her Majesty the Queen, I hereby declare this court to be in session. I now call upon the counsels for the prosecution and defence to declare their willingness to proceed.Van Zieks:\nThe prosecution is ready.Ryunosuke:\nThe defence is ready, My Lord.Van Zieks:\nReadiness for the trial, my learned Nipponese friend, is not what the defence needs. What you need...is readiness for your inevitable defeat.Ryunosuke:\n......... (It's not just in my imagination; it's really there... Lord van Zieks has such an animosity towards us Japanese for some reason...)Susato:\nIt was some time ago now that he first became known as the Reaper of the Bailey, I believe. These past few years, he hasn't appeared in court at all.Ryunosuke:\nYet now he's back in the courtroom. Though for some reason... ...only when I'm defending. (This 'Reaper', with his curious disdain for us Japanese, is a prosecutor shrouded in mystery. Still...this isn't the time to be pondering that. I have to concentrate on Soseki-san's trial.)Judge:\nFurthermore, I now call upon the six ladies and gentlemen of the jury. You have been chosen at random to represent the will of the people in this trial. Are you ready to fulfil your duty?Juror No. 1:\nAbsolutely! I had a feeling this larrikin wasn't innocent before!Juror No. 2:\nI must say that I feel especially ruthless on days when my hat refuses to sit right!Juror No. 3:\nOh...well I rather like how you're wearing your hat. I think the ruthless look is very fetching, actually...Juror No. 4:\nI need to be somewhere at ten o'clock. I have a very important meeting. Let's make this quick.Juror No. 5:\nI couldn't agree more. I need to take home five bob tonight, or the missus will go through the roof!Juror No. 6:\nOh, may the Lord show us all the light here, and lead His flock to a righteous verdict...Susato:\nThe British jury system is so very different to our own, isn't it? It's quite extraordinary to think that the power of judgement is in the hands of six members of the public. And that the judge can only pass sentence when all jurors are in agreement about the defendant's guilt.Ryunosuke:\n(Six citizens of London, chosen at random... Or at least, that's the idea.)Van Zieks:\nThe prosecution would draw attention to the fact that the accused was on trial here but two days ago. Accordingly, where possible, the same jurors have been asked to return for duty today.Judge:\nVery well, let us commence the trial. Lord van Zieks...your opening statement, please.Van Zieks:\nLadies and gentlemen of the jury, it is not the intent of the prosecution to cast doubt over your past decision... However, the innocent verdict afforded to this eccentric Nipponese before...has had dire consequences. Did the accused repent for his wrongdoing in that affair? Far from it. Instead, he used his freedom to perpetrate a most blood-curdling crime! Namely, that of the attempted murder of his neighbouring lodger, an innocent Englishman.Ryunosuke:\n...!Van Zieks:\nTo explain the circumstances of the crime, the prosecution calls its first witnesses to the stand... ...the detective responsible for investigating the scene, and the accused himself!Van Zieks:\nWitnesses, your names and occupations, please.Gregson:\nYes, sir! Tobias Gregson, Detective Inspector at Scotland Yard's homicide division.Soseki:\n......... Ah! Soseki Natsume from the Empire of Japan! My government ordered me to come here as a student to study your language and culture.Judge:\nMr Natsume...Soseki:\nYes! My Lord, sir!Judge:\nI'm quite sure I'm not mistaken... ...that you swore on oath...never to set foot in my courtroom again. I remember it as if it were yesterday.Van Zieks:\nThe day before, in fact, My Lord. But close enough.Soseki:\nUgh...believe me, this is the last place I want to be...Van Zieks:\nInspector, let's hear from you first. Explain the case for the court.Gregson:\nRight you are, sir! The incident occurred at the Garrideb household where the defendant has lodgings... ...in the ground floor room of the victim, Mr William Shamspeare. The defendant has already admitted to visitin' the victim on the night in question. Mr Shamspeare collapsed in his room as a result of poisonin' by strychnine. He was found the followin' mornin' when the landlord, suspectin' somethin' was wrong, broke down the door.Judge:\nThis means, I presume, that the door to the victim's room was locked at the time of the incident?Van Zieks:\nCorrect, My Lord. It was locked from the inside, making entry to or exit from the room impossible.Gregson:\nAlthough the victim, Mr Shamspeare, lives to tell tale... ...he very nearly didn't. The man was halfway to Heaven when we first found him.Judge:\nHmmm...Gregson:\nI was the first officer on the scene, My Lord... ...and I have a photographic print here that I took at the time to show how it looked.Judge:\nYes, a chilling scene indeed. The man looks very much deceased.Gregson:\nThat's right. Everyone present believed that's exactly what he was.Judge:\nVery well, I shall accept this photographic print as evidence for the court.The crime scene photograph has been entered into the Court Record.Judge:\nNow then, Mr Natsume...Soseki:\nAh! Y-Yes...yes...YES?!Judge:\nAs the defendant, do you have anything to say at this juncture?Soseki:\n......... They're, they're haunted... Haunted by evil sp-spirits...Judge:\nGood gracious! What's haunted?Soseki:\nMY LODGINGS! THERE'S BEEN A WHOLE SERIES OF STRANGE HAPPENINGS IN MY LODGINGS! The tenant before me died in mysterious circumstances! A woman was stabbed by no one on the street outside! My neighbour was poisoned! And ME! WHAT ABOUT ME?! I've nearly been killed countless times!Judge:\nKilled, Mr Natsume? How?Soseki:\nEven on that fateful night, it happened. When I returned from Mr Shamspeare's room... ...I lit my gas stove and climbed into bed, but before long... ...the stove went out, AND SOMEBODY TRIED TO KILL ME!Judge:\nYou must always extinguish all fires before retiring for the night, Mr Natsume.Soseki:\nBUT IT'S SO COLD! My, my runny nose would freeze! The point is, I, I didn't poison my neighbour. Oh...why am I being accused of this? Why is my existence so cursed...?Judge:\nThank you, witnesses. I believe I have a reasonably clear picture of events.Van Zieks:\nIf I could raise one more point, My Lord. One more...conclusive point.Judge:\nConclusive? Go on...Van Zieks:\nFortunately, the victim, Mr Shamspeare, has regained consciousness after his ordeal. And he has named the true culprit.Ryunosuke:\n...!Van Zieks:\nThe poison consumed by the victim was administered in a cup of tea that he drank on the night in question. Tea, My Lord, that was brought to the victim's room by the accused.Judge:\nThe accused...? Good grief! Ordaaar! Ordaaar!Ryunosuke:\n(Yes...that's the crux of this whole case. If Soseki-san is innocent, then why...? Why has the victim accused him?)Judge:\nWell, Mr Natsume? What have you to say to this accusation?Soseki:\nThat evening, yes...I did take some freshly brewed tea with me when I visited Mr Shamspeare's room, as a gift. The public water pump outside always freezes at night, so I bought bottled water especially to make it. And this is the result! Never will I touch tea again! Never!Ryunosuke:\nThe public pump was frozen, you say?Susato:\nThat's not information we've heard before.Judge:\nThat will do, thank you. Now, according to our laws, the defence must have the opportunity to cross-examine witnesses at least once. Therefore, I call upon these witnesses now for a formal testimony. ...I presume the prosecution has no objection?Van Zieks:\nNone whatsoever, My Lord.Judge:\nGood. Then you will give your account of events on the night in question to the court now.Soseki:\nYe-Ye-Ye...YEEEEEESSS, MY LORD!Witness Testimony\n- The Catastrophic Night -Soseki:\nIt was around nine o'clock that evening when I visited my neighbour, and I took some tea with me as a gift.\nWe had a heated literary debate over a nice, hot drink. After which I went back to my room, at around eleven.\nArgh! My tea was completely harmless! He couldn't have locked the door behind me otherwise, could he?Gregson:\nStrychnine takes some time to have an effect on the body. People don't keel over immediately after takin' it.\nThe victim would have been perfectly able to lock the door after his guest left. The argument still stands.Judge:\nHm, yes, I see... It all seems relatively straightforward.Susato:\nExcuse me, but...that testimony does raise one rather crucial point, I think. Mr Natsume claims his tea to have been harmless. Presumably, though... ...the teacups have been examined for traces of the poison...haven't they?Ryunosuke:\n(Why didn't I think of that?)Gregson:\nWell, as it happens, no. We haven't been able to.Judge:\nDid I hear you correctly, Inspector? Scotland Yard has failed to examine the suspect substance?Ryunosuke:\nHow could you have overlooked something so important?! Isn't that the first thing you should have done?Van Zieks:\n...My learned Nipponese friend is falsely incensed.Ryunosuke:\n...!Van Zieks:\nThe inspector said Scotland Yard was unable to examine the tea. Not that it was overlooked.Ryunosuke:\nUnable? Why?Gregson:\nIt's simple enough. There was none left. Not a drop. Someone must have been very thirsty indeed.Van Zieks:\nWith current scientific techniques, it's not possible to test for poison under such circumstances.Gregson:\nWe only need a drop, but that one drop does actually have to exist, funnily enough.Judge:\nHmmm...Van Zieks:\nThe lack of examination notwithstanding... ...it appears nothing other than the tea passed the victim's lips on the night in question.Ryunosuke:\n...!Judge:\nI see. Thank you. The matter is clear.Van Zieks:\nCast your eyes over the jury, my learned friend.Ryunosuke:\nWhat?Van Zieks:\nYou can see it in their faces, I'm sure. The recognition of the accused's guilt. Your client's fate is all but sealed. In mere moments from now...you will lose, and your compatriot will be damned for all eternity!Ryunosuke:\n(He's right. I can feel all six of the jurors looking daggers at me. But I can't let them beat me down... I won't...)Judge:\nCounsel for the Defence...proceed with your cross-examination!Ryunosuke:\nYes, My Lord!Cross-Examination\n- The Catastrophic Night -",
      "testimonies": [
        {
          "testimony": "It was around nine o'clock that evening when I visited my neighbour, and I took some tea with me as a gift.",
          "person": "Soseki",
          "present": []
        },
        {
          "testimony": "We had a heated literary debate over a nice, hot drink. After which I went back to my room, at around eleven.",
          "person": "Soseki",
          "present": []
        },
        {
          "testimony": "Argh! My tea was completely harmless! He couldn't have locked the door behind me otherwise, could he?",
          "person": "Soseki",
          "present": []
        },
        {
          "testimony": "Strychnine takes some time to have an effect on the body. People don't keel over immediately after takin' it.",
          "person": "Gregson",
          "present": []
        },
        {
          "testimony": "The victim would have been perfectly able to lock the door after his guest left. The argument still stands.",
          "person": "Gregson",
          "present": [
            "Victim's Medical Report"
          ]
        }
      ],
      "noPresent": false
    },
    {
      "category": "cross_examination",
      "newContext": "Soseki:\nIt was around nine o'clock that evening when I visited my neighbour, and I took some tea with me as a gift.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nWere you and your neighbour good friends, then?\nSoseki:\nArgh! NO! We weren't friends! Not at all! NOT AT ALL! Never...ever!\nRyunosuke:\n(A simple 'no' would have sufficed...) Then, um...why did you decide to pay him a visit?\nSoseki:\nMr Shamspeare fancies himself as having great literary knowledge. As a fellow scholar of English literature, we find much to talk about together.\nVan Zieks:\n...Come now, no Nipponese could understand the finer points of English literature.\nRyunosuke:\nAnd on the night in question, that was the topic of conversation as well, I presume.\nSoseki:\nIt was the day of my last trial, when I was acquitted. I'd just arrived back at my lodgings... ...when I ran into Mr Shamspeare outside on the street. That was at around six o'clock. We exchanged one or two pleasantries, but it soon turned into a heated discussion. He was on his way out at the time, though. So I promised to visit his room that evening at nine to continue our debate. ...But did I have ill intentions? No! Not one! Not two! Not any! Not at all! Never...ever!\nSusato:\nA simple 'no' would have sufficed, I feel...\nVan Zieks:\nThen tell the court what did happen when you visited the victim's room.Soseki:\nWe had a heated literary debate over a nice, hot drink. After which I went back to my room, at around eleven.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nA literary debate...about Shakespeare's works, I think you said, didn't you?\nJudge:\nShakespeare? Ah, a very worthy topic of conversation, I must say.\nSoseki:\nOh yes, My Lord! Romeo! And Juliet! Who was stronger?! ...It was a profoundly pleasurable parley.\nJudge:\nRomeo and Juliet?\nVan Zieks:\n...'Who was stronger'?\nRyunosuke:\n...I know I'm going to regret asking this, but...how did the debate go?\nSoseki:\nWell...we both agreed that we would reach a conclusion more quickly with a reenactment. So we battled it out! In a Greco-Roman style, naturally.\nRyunosuke:\nWhat?\nSoseki:\nMr Shamspeare had all sorts of costumes in his room for just such a contest.\nRyunosuke:\nSo, when you say a 'reenactment', you mean...you were actually in costume?\nSoseki:\nHe as Romeo, I as Juliet. And after a vigorous, wild tussle... ...I, as Juliet, came out on top! A VICTORY I'LL CHERISH FOREVER!\nJudge:\nI dare not imagine the terrible scene of carnage...\nVan Zieks:\nThe fact remains that it was you who prepared the tea and took it to the victim. ...Correct?\nSoseki:\nI boiled the water in my room and made a pot to take with me. I'd heard that he was too poor to have tea himself, you see.\nRyunosuke:\n(It's true...there was no sign of any tea leaves in the man's room.)\nSoseki:\nI wanted to do something nice. To be friendly. So why is everyone looking at me with such suspicion?! MY TEA WAS HARMLESS! OF COURSE IT WAS!\nJudge:\nAnd do you have any basis for that statement, witness?Soseki:\nArgh! My tea was completely harmless! He couldn't have locked the door behind me otherwise, could he?Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYes, there was not a drop of tea left in the victim's room anywhere, was there?\nGregson:\nThat's correct. Anyone would think the fellow had never had a pot of tea before. He must have licked it dry. Which is a pity, because one drop is all we would've needed to analyse it for poison.\nRyunosuke:\nAnd you say that you returned home to your room at eleven o'clock, Mr Natsume?\nSoseki:\nYes! Definitely! By heaven and earth, I swear it!\nGregson:\nThe landlord was able to verify that, as it happens. He confirmed that the defendant went back to his room at eleven that night.\nJudge:\nAnd how is the landlord able to attest to this?\nGregson:\nHe, um...said it was the lamps, I believe.\nJudge:\nThe lamps, Inspector?\nRyunosuke:\n(When tenants return to their rooms and start using gas, the lamps in other parts of the house flicker.)\nSusato:\nYes, Mr Garrideb seems to pay a lot of attention to the comings and goings of his tenants...\nSoseki:\nThere's only one key to Mr Shamspeare's room! I know that for certain! So he must have locked the door himself! From inside his room!\nGregson:\nThe victim has confirmed that to be the case, yes.\nSoseki:\nSO I'M RIGHT! MY TEA WAS HARMLESS! COMPLETELY HARMLESS! IF YOU TAKE POISON, YOU DIE! EVERYONE KNOWS THAT!\nGregson:\nIt's not that simple, I'm afraid.\nSoseki:\nUh! Wh-What do you mean?Gregson:\nStrychnine takes some time to have an effect on the body. People don't keel over immediately after takin' it.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nHow long does it take for symptoms to appear, then?\nGregson:\nAccording to the coroner I was speakin' to at the Yard, about thirty minutes after the poison's consumed. Then the victim suffers violent convulsions, crampin' and stiffness, and eventually dies from asphyxiation.\nRyunosuke:\n(So there's a thirty-minute interval between when the poison is ingested and the onset of symptoms. There seems to be a lot of different types of poison in the world, that's for sure...)\nSusato:\nOh dear... Death by poisoning again. It's always so awful...\nVan Zieks:\nThirty minutes is a long time. Certainly long enough for the victim to have locked the door behind the accused after he left.\nRyunosuke:\n(You can't deny that. And it further degrades Soseki-san's alibi.)\nGregson:\nI have the medical report from the doctor who examined the victim here, My Lord. It spells it out, really. The accused is the only person who could have done it.\nJudge:\nVery well, the court will add this report to the Court Record as evidence.\nThe victim's medical report has been entered into the Court Record.\nSusato:\nOh yes...I see it here. 'Delayed onset of symptoms'...\nRyunosuke:\n(Great...)Press (subsequent times)\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nHow long does it take for symptoms to appear, then?\nGregson:\nAccording to the coroner I was speakin' to at the Yard, about thirty minutes after the poison's consumed. Then the victim suffers violent convulsions, crampin' and stiffness, and eventually dies from asphyxiation.\nRyunosuke:\n(So there's a thirty-minute interval between when the poison is ingested and the onset of symptoms. There seems to be a lot of different types of poison in the world, that's for sure...)\nSusato:\nOh dear... Death by poisoning again. It's always so awful...\nVan Zieks:\nThirty minutes is a long time. Certainly long enough for the victim to have locked the door behind the accused after he left.\nRyunosuke:\n(You can't deny that. And it further degrades Soseki-san's alibi.)\nGregson:\nI have the medical report from the doctor who examined the victim here, My Lord. It spells it out, really. The accused is the only person who could have done it.Gregson:\nThe victim would have been perfectly able to lock the door after his guest left. The argument still stands.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nThe argument still stands, you say?\nGregson:\nThis is what Mr Natsume has been sayin', isn't it? The pair of them drank tea together that night, so if there was poison in it... ...the victim wouldn't have been able to lock the door after the accused left later on.\nSoseki:\nEXACTLY! ARGH! Me and my tea are INNOCENT! SWEET and INNOCENT, I tell you!\nGregson:\nI'm afraid, sir, that doesn't follow. You see, strychnine is a slow-actin' poison. In other words, it takes time for symptoms to appear. So you could have left the room up to thirty minutes after the victim drank the tea. And as long as you did that, Mr Shamspeare could've locked the door after you'd gone.\nSoseki:\nBut, but NO! We drank the tea straight away! The battle over whether Romeo or Juliet was stronger...! That came after the tea.\nVan Zieks:\nDo you have any evidence to support that statement?\nSoseki:\n......... In my great homeland - the Empire of Japan - we have a saying: 'Drink tea while it's hot!'\nRyunosuke:\n(Sure, a proverb will satisfy the prosecution...)\nJudge:\nI'm afraid there's no conclusive proof to support the defendant's assertion. On the contrary, there are sufficient grounds to infer his guilt in this matter!\nSoseki:\nN-N-No...Present Victim's Medical Report\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"The argument still stands, you say?\"Ryunosuke:\n(That's the extent of their testimony, is it?)Susato:\nIf I could voice a personal opinion, Mr Naruhodo...Ryunosuke:\nOf course. Go ahead.Susato:\nMr Natsume is arguing for his innocence so adamantly and so persistently... ...yet Inspector Gregson just brushes what he says aside. It's really quite infuriating!Ryunosuke:\nI agree. So we need to find an inconsistency in what the inspector is saying, I think.Susato:\nI'm afraid so. As things stand, the jurors are sure to find Mr Natsume guilty.Ryunosuke:\n(As I see it, what we need to focus on is the poison and the tea...) Let's listen carefully to this testimony again.Susato:\nYes!Ryunosuke:\nThe argument still stands, you say? I think not, Inspector!Gregson:\n...Come again?Ryunosuke:\nI think you'll find...that you've overlooked a very significant chronological inconsistency here!Gregson:\nA chrono-what? What are you on about?Ryunosuke:\nAccording to this report... ...the victim must have consumed the poison at around... one thirty in the morning. And yet... ...the defendant, Mr Natsume, left the victim's room at eleven.Gregson:\nAh!Ryunosuke:\nYes, that's right... There's more than two hours of missing time there!Gregson:\n...Nnf...Ryunosuke:\nIn other words... ...if there was poison in the tea that Mr Natsume brought to the victim's room... ...how could the victim have fallen ill to it...two and a half full hours after the defendant left?!Gregson:\nUWAAAAAAAAAAAAH!Judge:\nThe defence's argument is entirely reasonable. How do you respond, Lord van Zieks?Van Zieks:\n...Pray forgive the discourtesy if my mind has wandered. I was considering what cuisine would best complement the contents of my hallowed chalice this luncheon.Ryunosuke:\n...!Van Zieks:\nHow could it have happened, you ask? I do hate to shatter illusions, but my Nipponese friend appears to be chasing a phantom idea.Ryunosuke:\nA phantom...?!Van Zieks:\nIs it so hard to imagine that the victim drank his tea after the accused had left? For example, at the time stated in the medical report. Yes...at around half past one.Ryunosuke:Ryunosuke:\nMr Natsume brought the tea with him to drink together with his neighbour! And in Japan, there is a well known saying: 'Drink tea while it's hot!'Van Zieks:Van Zieks:\nAnd in my country, there is an even more apt saying: 'There is nothing more refreshing than cold tea.'Ryunosuke:\nThe, the point is...if there was such a long gap... ...there may be other ways to explain how the victim came to be poisoned! Other possibilities!Judge:\nWhat sort of possibilities, Counsel?Ryunosuke:\n......... Well...for example... The man could have had another visitor!Van Zieks:\nAnother visitor? That's a very bold assertion, my learned friend...from someone who has nothing to substantiate it.Ryunosuke:\nOr...or...the victim could have taken the poison of his own volition!Judge:\nYou suggest this may have been a suicide, Counsel?Van Zieks:Van Zieks:\nMr Shamspeare has categorically denied suicide. The idea can and must be discounted.Ryunosuke:Ryunosuke:\nBut, but he could be lying!Van Zieks:\n.........\n.........\n..................Judge:\nIs something wrong, Lord van Zieks?Van Zieks:\nI was listening to the sound of the carriage pulling up outside the courtroom. Pray, forgive the discourtesy.Ryunosuke:\nCarriage? What carriage?Van Zieks:\nIt would seem...that the key player in this case has just arrived.???:???:'Out, out, brief candle! Life's but a walking shadow...'Shamspeare:\n'...a poor player, that struts and frets his hour upon the stage, and then is heard no more. It is a tale, told by an idiot, full of sound and fury, Signifying nothing.'Judge:\nWho, sir, are you...?Shamspeare:\nWilliam Shamspeare, My Lord. Alas 'twas I, undone by these bitter events. I...am the victim!Ryunosuke:\nWha... What's he doing here?!Van Zieks:\nThe prosecution seeks to call this gentleman to the stand. With his testimony, my learned friend's futile resistance will be utterly crushed.Ryunosuke:\nYou're calling him as a witness?Judge:\nVery well, Counsel. I grant your request with interest. I'm curious to discover what the court shall hear from the victim himself!Shamspeare:\nHappy am I, Shamspeare, to regale thee with my tale of woe, My Lord.Soseki:\nB-But...! I still have my own tale to tell! My own tale of worse woe! I CAN REGALE THE COURT WITH THE TALE OF MY PERFECT INNOCENCE IN PERFECT ENGLISH!Judge:\nThat will do, Mr Natsume. Let the court now hear from the victim!Ryunosuke:\n(Alright, so that's Mr Shamspeare... But who's that other man beside him?)Susato:\nYes, I think... I feel sure that we've caught a glimpse of that man before.Van Zieks:\nState your names and occupations for the court, please, witnesses.Shamspeare:\nA writer of words so sweet, they do scent the breeze. An inventor of ideas so profound, they compose the earth. The unrivall'd poet, the unmatched scribe, William Shakespeare... Were the great bard to be recall'd to life anew, lo, what a magnificent man! Good fellows, I am he who ponders such a miracle... William Shamspeare.Metermann:\nOh, um...the name's Metermann. Adron B. Metermann. I work for the Altamont Gas Company, East End branch office.Susato:\nAh! I remember now! It was yesterday, on Briar Road...Ryunosuke:\nOh yes! (She's right. It's him!)Ryunosuke:\n(Oh...what's this? What's that man doing over there? He looks like he's trying to see into Soseki-san's lodgings...)Susato:\nIs something wrong, Mr Naruhodo?Ryunosuke:\nUm, excuse me! Could we have a word????:\nAh!Ryunosuke:\n(Yes, we spotted him outside Mr Garrideb's house that morning. And he's a gas company employee? What does he have to do with this case?)Judge:\nSo, Mr William Shamspeare...you are the victim in this miserable affair, correct?Shamspeare:\n'O Heaven! O Hell! Do you command me to remember?' That sweet poison that didst cross me and cross mine innocent lips.Van Zieks:\nI subpoenaed him for the trial. With his doctor's permission, naturally. Hearing the testimony of the aggrieved will remove any room for doubt from the jurors' minds, I'm sure.Shamspeare:\nBehold, you have only to rearrange the letters of my name to see that 'me's a seraph'! An angel, indeed! Thus be I noble of mind, sweet of nature and verily, honest of heart. As all heavenly angels be.Ryunosuke:\n(Because there isn't a less contrived meaning in your name. No, not at all...)Susato:\nThe jurors seem to be very moved by this man, I'm afraid.Ryunosuke:\n(They're actually taking this 'seraph' anagram idea seriously...?)Judge:\nThank you, witnesses, for your illuminating introductions.Ryunosuke:\nBut My Lord...what's the man next to Mr Shamspeare doing here? The gasman, I mean.Metermann:\nUh? What? Me? Well now...Van Zieks:\nAllow me to enlighten my learned friend. You recall, I presume, your earlier impertinence? When you suggested that the victim had another visitor to his room on the night in question. And, moreover, that the victim is a compulsive liar.Ryunosuke:\nWhat?! No, no I didn't quite say that...Van Zieks:\nThis young chin-stroker is here to controvert your wild claims. Conclusively. Is that not so...Mr Metermann?Metermann:\nEh? Hang on, no... I'm just here...Judge:\nI hereby call for your formal testimonies. You will tell the court as lucidly as possible what happened on the night in question!Shamspeare:\n'One may smile, and smile, and be a villain...' Yes, it doth pain me, but let the truth be spoken! The truth of that wintry night of my discontent.Metermann:\nHmmm...Witness Testimony\n- The Wintry Night of My Discontent -Shamspeare:\nThe snow lay about. My neighbour did cometh in the evening, bearing a gift of tea.\nBut marry! Bitter was his drink! And when he left, I did fall prostrate on my table!\n'Twas the tea alone did pass my lips that late hour. Nought else.Metermann:\nI was outside this bloke's window in the freezin' cold all night, keepin' an eye on his room.\nNo one else visited his room but that short little round-backed Eastern fella.Ryunosuke:\nWait, what did you say?! You were 'keeping an eye' on Mr Shamspeare's room all night?!Metermann:\nThat's right. 'Course, the bloke's window is all but blocked up, isn't it? But there's a little gap in the bricks where you can see into the room. So I spent the night tryin' to keep my teeth from chatterin' as I peered in through that.Judge:\nThe question is, sir...why?Metermann:\nAh! Well now, that's because he's on my list!Shamspeare:\n'What a piece of work is a man!' ...Wherefore wouldst thou not stare in wonderment?Ryunosuke:\nWhat are you talking about?Shamspeare:\nThis buzzing busybody hath not part in this play. I pray thee...pay him no heed. Make no more ado about his tedious words...Metermann:\nWhat'd you say about me?!Van Zieks:\nCalm yourself. This court is concerned with what happened on the night in question. Nothing more.Judge:\nIndeed, that is so.Van Zieks:\nAnd, as the testimony we have just heard clearly reveals... ...there was no one other than the accused present at the time who could have carried out this crime.Ryunosuke:\n...!Judge:\nWell...I believe this may be the final testimony of the trial. Now, Counsel...the defence may proceed with the cross-examination!Ryunosuke:\nYes...My Lord!Cross-Examination\n- The Wintry Night of My Discontent -",
      "testimonies": [
        {
          "testimony": "The snow lay about. My neighbour did cometh in the evening, bearing a gift of tea.",
          "person": "Shamspeare",
          "present": []
        },
        {
          "testimony": "But marry! Bitter was his drink! And when he left, I did fall prostrate on my table!",
          "person": "Shamspeare",
          "present": []
        },
        {
          "testimony": "'Twas the tea alone did pass my lips that late hour. Nought else.",
          "person": "Shamspeare",
          "present": []
        },
        {
          "testimony": "I was outside this bloke's window in the freezin' cold all night, keepin' an eye on his room.",
          "person": "Metermann",
          "present": []
        },
        {
          "testimony": "No one else visited his room but that short little round-backed Eastern fella.",
          "person": "Metermann",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "cross_examination",
      "newContext": "Shamspeare:\nThe snow lay about. My neighbour did cometh in the evening, bearing a gift of tea.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nTo be clear, by neighbour, you are referring to the defendant, Mr Natsume?\nShamspeare:\nO, indeed, sire! Perchance thou wouldst that I call him 'the man from upstairs'?\nVan Zieks:\nAnd at what time did the moustachioed Nipponese visit you in your room?\nShamspeare:\nOur meeting was promis'd for the hour of nine. And lo, did he come, to tender a gift of fragrant tea.\nJudge:\nDetails which are in accordance with the defendant's own testimony, yes...\nShamspeare:\nAnd we were broil'd in such a literary debate as history hath nought seen before.\nRyunosuke:\nBy which I presume he means...\nSusato:\n...Their discussion about who was the stronger, Romeo or Juliet?\nShamspeare:\nI, Shamspeare, did play the part of young Romeo. Whilst my neighbour play'd the fair Juliet. Each of us dress'd as would our characters be, to bring weight upon our merry experiment.\nJudge:\n...I dare not imagine the scene.\nShamspeare:\n'Frailty, thy name is woman!' Canst thou imagine how dismay'd I was? Yes, I had heard of the Eastern art of ju-jitsu, but... ...ne'er did I dream 'twould be a skill practis'd by the comely maiden!\nRyunosuke:\n(Juliet beat Romeo up? This is not helping our case...)\nVan Zieks:\n...I believe the court has heard enough about your... earth-shattering literary debate. Perhaps you could reiterate your statement about the tea that the accused brought to your room?\nShamspeare:\nMy liege, I am thy servant. Glady, [sic] I would do thy bidding...Shamspeare:\nBut marry! Bitter was his drink! And when he left, I did fall prostrate on my table!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nLet me stop you there! Mr Natsume left your room at eleven o'clock. But it wasn't until after two that the poison made you collapse. That amounts to more than three hours of 'missing time'.\nShamspeare:\n.........\nRyunosuke:\nIf the defendant had really put the poison into your tea... ...that three-hour window of time...is something you're going to have to explain!\nShamspeare:\nGladly. 'Tis an easy task.\nRyunosuke:\nWhat?\nShamspeare:\nI did drink of the tea not while my guest didst tarry, but after he took leave of me. Faith, 'twas stone cold, but...at one hour post midnight, verily were my lips parched.\nRyunosuke:\n\nRyunosuke:\nThat...doesn't sound normal!\nShamspeare:\nNay, 'tis quite ordinary, sire. After all... ...thou wouldst recall our fiery debate. Amidst such argument, there'd be no time for fiery tea.\nRyunosuke:\n(Romeo and Juliet again... And who was stronger...)\nVan Zieks:\nMr Shamspeare, in summary, allow me to confirm. Did you not come here with the intention of naming your attacker?\nShamspeare:\nBut of course...my liege. 'Twas the stoop'd lover of words did attempt to shuffle me off this mortal coil.\nRyunosuke:\n(Ugh...we all know what that means...)Shamspeare:\n'Twas the tea alone did pass my lips that late hour. Nought else.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nSo...you didn't have any kind of evening meal? Dinner? Supper?\nShamspeare:\nHah! Fie on luxury! Fie on gluttony! To eat thrice daily is but a waste of time!\nRyunosuke:\nSorry?\nShamspeare:\nI would that my belly were full...no more oft than the sun doth rise!\nJudge:\nWell... Most heroic eating habits, I must say.\nShamspeare:\nNight and day do I fill my hours with learn'd study of the great bard and playwright. Hence is it that there doth nought in my chamber be than the costumes of mine art.\nVan Zieks:\nThat would appear to be the case...as even a rodent was found starved to death in your room.\nSusato:\nNow I think of it, it's not just food that was conspicuously missing from that room, is it? I don't recall seeing a single play or script anywhere.\nShamspeare:\nFor I...have devour'd them all.\nRyunosuke:\nYou've...eaten them?\nShamspeare:\nEv'ry word be within my skull. ...Didst thou imagine otherwise?\nRyunosuke:\n...Right. That wasn't misleading at all. Now, could you turn around, do you think?\nVan Zieks:\nWhich brings us to the conclusion...that the only way the poison could have passed the victim's lips...is in the tea.\nRyunosuke:\nHaah...Metermann:\nI was outside this bloke's window in the freezin' cold all night, keepin' an eye on his room.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nBut the windows of that house have all been filled in.\nSusato:\nA historical artefact of the now defunct window tax!\nMetermann:\nYeah, you're right there. All bricked up horribly. But, as it happens, there's a little part of the brickwork at the bottom corner that's been opened up. I was lookin' in through that gap.\nSusato:\nYes, there were a few bricks loose, weren't there?\nRyunosuke:\n(And for some strange reason, a couple of bars of soap lined up on the ledge outside as well...)\nMetermann:\nI don't like goin' around pokin' my chin in other people's business. Especially on freezin' cold nights. But them's my orders! So that's what I'll keep doin'! ...As long as there's breath in my body!\nRyunosuke:\n(What's with all the theatricals today?)\nVan Zieks:\nOut of interest, Mr Metermann, after the accused had left and returned to his own lodgings... ...did you see the victim leave the room at all?\nMetermann:\nNo! He never left! He was in that room the whole time as far as I'm concerned!\nVan Zieks:\nAnd we can therefore discount the possibility of suicide.\nRyunosuke:\n...! How can you be sure of that?\nVan Zieks:\nThe police carried out a thorough investigation of the scene and found no receptacle for the poison. And since we know the victim didn't leave his room, and hence didn't dispose of the poison's container himself... ...it's clear that this was no attempted suicide. Only the culprit could have removed the receptacle.\nJudge:\nAh, yes... Lucidly explained, Counsel. Thank you.\nRyunosuke:\n(It really was. You can't argue with the logic...)Metermann:\nNo one else visited his room but that short little round-backed Eastern fella.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYou say a 'short little round-backed Eastern fella'... So you can't be sure it was the defendant, then?\nVan Zieks:\n\nVan Zieks:\nHow many other short little round-backed Nipponese with a moustache do you think there are in London?!\nMetermann:\nWell, of course...it's only a narrow gap and it was quite dark, so I didn't notice the moustache. But he showed up at around nine, so I'm pretty sure of myself.\nRyunosuke:\nAnd when the person you saw arrived, did he and Mr Shamspeare drink tea together?\nMetermann:\n......... Nah, sorry, I couldn't say.\nRyunosuke:\nWhy not?\nMetermann:\nBecause. I couldn't see into the room all that well, could I? But what I did see was the silhouette of that little round-backed fella wearin' a pretty dress. Then the pair of them started some kind of wrestlin' match. I tell you, I didn't know what to make of it.\nRyunosuke:\nHaah...\nSusato:\nI suppose... ...that was the Romeo and Juliet championship battle getting underway...\nVan Zieks:\nMr Metermann... ...allow me to confirm one final time: Apart from the accused, can you state with certainty, that no one else visited the victim on the night in question?\nMetermann:\nNo question! Gasman's honour!Ryunosuke:\n(So that's the entire testimony...)Susato:\nWhat do you think, Mr Naruhodo?Ryunosuke:\nWell...erm... ...I can't see any obvious holes at all, to be honest.Susato:\nNo... Oh dear... If nobody else visited Mr Shamspeare's room that night apart from Mr Natsume... ...I imagine the members of the jury will all conclude the same thing.Ryunosuke:\n(Right. That he's guilty...) Well, all we can do is press these witnesses for more information and hope for a breakthrough.Susato:\nYes!After pressing all statements:???:Juror No. 1:\nMy Looord!Judge:\nGoodness me! Yes, Mr Foreman?Juror No. 1:\nI've kept my mouth shut and listened up to now, but this has gone on long enough. Are you all with me?YEEEEEESSS!Van Zieks:\nAre we to understand...that you ladies and gentlemen of the jury are in agreement with one another? That you've reached a unanimous decision?Juror No. 1:\nToo right, we have!  Are you all with me?YEEEEEESSS!Ryunosuke:\nWait! No! The defence is in the middle of a cross-examination!Juror No. 1:\nTo be honest, I was holding out a bit of hope for you, young man. Especially after you identified those few hours that followed the accused leaving the victim's room.Juror No. 2:\nYes, the three 'missing hours' as you put it.Juror No. 3:\nBut in the end, what difference do they make? None, as far as I can see.Juror No. 4:\nAnd since that's now apparent, there's really no reason to delay our decision any longer.Juror No. 5:\nLike I was saying before: if I don't take five bob home with me tonight, the missus will blow her top!Juror No. 6:\nHm? What's that? Sorry, I didn't quite catch what you said...Judge:\nVery well, let the court be apprised of your decisions. Ladies and gentlemen of the jury, you will state your leanings as to the defendant's culpability!Juror No. 1:\nGuilty!Juror No. 2:\nGuilty!Juror No. 3:\nGuilty!Juror No. 4:\nGuilty!Juror No. 5:\nGuilty!Juror No. 6:\nGuilty!Ryunosuke:\nA-All of you...?Judge:\nWell, it would appear that the jury is indeed unanimous.Van Zieks:\nSo...this time at least, it seems justice will be done. All's well that ends well, as they say. This calls for a toast, I feel... To the guilty being punished!Ryunosuke:\nUgh... UWAAAAAAAAAAAAH!Susato:\nGet up, Mr Naruhodo! Please! The trial isn't over yet!Ryunosuke:\nWh-What do you mean, Miss Susato?Susato:\nWhat about the information I found in this Encyclopaedia of British Law that I have? That obscure right that belongs to the defence in these situations...remember?Ryunosuke:\n......... ...A summation examination... ...Yes, that's right... We don't have a jury in Japanese courts, of course. But here in a British court of law, if we can reverse the decisions of a majority of the jurors... ...we can force the trial to continue. (This trial can't end now. Whatever it takes, I just can't let that happen!) The defence moves to invoke its right to a summation examination, My Lord!Van Zieks:\nWhy am I not surprised...at my learned Nipponese friend's inability to admit defeat? You choose to cling desperately to some archaic rule you barely comprehend instead of accepting the truth.Judge:\nCertainly no other defence counsellor in recent times has exercised the right to a summation examination.Van Zieks:\nBecause they all know that once the jury's mind is set, it cannot be altered.Judge:\nNevertheless, the right remains and must be upheld. The defence counsel's request is granted. This court will proceed with a summation examination, as outlined in the Encyclopaedia of British Law!Ryunosuke:\nThank you, My Lord!Judge:\nAre you and your fellows prepared, Mr Foreman?Juror No. 1:\nBelieve me, My Lord, we know all about this young lad's tenacity. And we're ready for it!Judge:\nVery well. In that case, ladies and gentlemen of the jury, I hereby call upon each of you... ...to state the grounds upon which you find the defendant guilty of the crime for which he stands accused!Judicial Findings\n- The Jurors' Contentions -Juror No. 1:\nThe victim may not be well off, but he's a noble man and straight up! There's no reason to doubt the man.Juror No. 2:\nWell, I do declare the good gentleman has no reason to lie. In fact...I think he's rather splendid.Juror No. 3:\nJust look at the accused by comparison! He's Japanese, stoops all the while, and has a moustache! Very fishy...Juror No. 4:\nThere's no evidence to suggest the gangling actor is a fraudsman. ...For now, at least.Juror No. 5:\nAgh! I really don't care, like! I just need this trial to end quickly!Juror No. 6:\nThree hours of 'missing time' is nothing when you reach my age, you know. Nothing at all.Ryunosuke:\n(I knew it... Every single one of them seems completely convinced...)Susato:\nIt would seem that all the jurors... ...have come to the conclusion that Mr Shamspeare is a fine, upstanding and honest citizen.Ryunosuke:\nIf you ask me, they've all been bewitched by his strange theatrical movements.Susato:\nAnd sadly, nothing Mr Natsume has said appears to have registered at all.Ryunosuke:\nWell...here goes! (Let's not forget... ...I've pleaded with the jury on Soseki-san's behalf before and it worked. So you never know!)Susato:\nBefore we begin... ...it might be an idea for me to remind you exactly how a summation examination works, Mr Naruhodo.Ryunosuke:\nOh.Susato:\nWell, you're still very new to British law, after all.Ryunosuke:\n(That's true, I suppose. And Soseki-san's fate is entirely in my hands now, too. There's always a chance I might have forgotten some crucial detail. Perhaps I should hear Susato-san out. I wonder...should I let her talk me through it again or not bother?)Refresh my memory!\n\n\n\n\n\n\n\nSusato:\nAlright! So, if you remember... ...the key to changing the jurors' minds is the things that they say themselves.\nRyunosuke:\n...Yes, it's coming back to me. First, it's important to listen very carefully to each juror's statement. Then, if it sounds as though one of those statements might contradict another... ...I have to pit the corresponding two jurors against each other to prove one or the other of them wrong!\nSusato:\nYes, that's right. In many ways, it's very similar to a normal cross-examination.\nRyunosuke:\n(Alright then. All that remains now...is to do it!)\nLeads to:\n\"Without further ado, please, Counsel.\"No need!\n\n\n\n\n\n\n\nRyunosuke:\nThank you for the kind offer, Miss Susato... ...but I've been through plenty of these summation examinations already now. I think it's important that we don't delay the start any longer than necessary.\nSusato:\nOf course, I understand. And I'm quite sure you're right. If you're confused by anything at any point, you can turn to me for advice whenever you like. I'll be here for you!\nRyunosuke:\n(The key to this is really listening carefully to each juror's statement... ...finding two that are contradictory, and pitting the corresponding jurors against each other!)\nLeads to:\n\"Without further ado, please, Counsel.\"Judge:\nWithout further ado, please, Counsel. Proceed with the summation examination!Ryunosuke:\n...Yes, My Lord!Jury Examination\n- The Defence's Rebuttal -Juror No. 1:\nThe victim may not be well off, but he's a noble man and straight up! There's no reason to doubt the man.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nWell, there are plenty of people in London who seem noble but poor. Couldn't some of them also be liars?\nJuror No. 1:\nI've no doubt about it. Like that shaky client of yours, for example.\nRyunosuke:\nAbsolutely not! Mr Natsume is no liar!\nJuror No. 1:\nLook, the point is, the only thing that passed the victim's lips that night was that Japanese man's tea. When you take the gasman's testimony into account as well, the truth couldn't be any clearer.\nRyunosuke:\nAh...well... (...that's alarmingly logical.)\nJuror No. 1:\nBut let me be frank here. I'm a gentleman, with a gentleman's values. If it turns out that the old Shakespearean chum is a rotten liar after all... ...I'd gladly change my decision about the defendant. And I'm sure my fellow gentlemen on the jury would do the same. ...Isn't that right?\nJuror No. 3:\nWell, um...yes, perhaps. Though I don't see it happening.\nJuror No. 6:\nEh? What's that? Elderly gent on the end here, you know. You'll have to speak up!\nJuror No. 5:\nLook, I really don't care about all this nonsense. I just need this trial to be over!\nRyunosuke:\n(How many 'gentlemen' do we actually have on the jury, then...?) Alright, sir, I may hold you to that. Don't forget what you said.\nJuror No. 1:\nHmph.\nChanges Juror No. 1's statement to \"Alright, if you can show me that the victim's a liar, I'll reconsider my position!\"Juror No. 1:\nAlright, if you can show me that the victim's a liar, I'll reconsider my position!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\n...Will you stand by that statement?\nJuror No. 1:\nWhat do you take me for? I'm a gentleman, sir. A man of my word. So let me be perfectly clear about this. If it turns out that the old Shakespearean chum is a rotten liar after all... ...I'd gladly change my decision about the defendant. And I'm sure my fellow gentlemen on the jury would do the same. ...Isn't that right?\nJuror No. 3:\nWell, um...yes, perhaps. Though I don't see it happening.\nJuror No. 6:\nEh? What's that? Elderly gent on the end here, you know. You'll have to speak up!\nJuror No. 5:\nLook, I really don't care about all this nonsense. I just need this trial to be over!\nRyunosuke:\n(How many 'gentlemen' do we actually have on the jury, then...?) Alright, sir, I may hold you to that. Don't forget what you said.\nJuror No. 1:\nHmph.Pit against Juror No. 4's statement (after Juror No. 4 changes her statement)\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"Those two statements clearly contradict each other!\"Juror No. 2:\nWell, I do declare the good gentleman has no reason to lie. In fact...I think he's rather splendid.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nAre you saying you believe the man to be trustworthy because he's 'rather splendid'?\nJuror No. 2:\nNo, that's not what I said. The point is, the man is the victim here. What reason would he have to lie? And yes...he is rather splendid.\nRyunosuke:\nSo you say...yet again.\nJuror No. 2:\nMeanwhile the man who stands accused behaves so suspiciously, it's exhausting to look at him! I'm afraid...he's not splendid at all.\nRyunosuke:\n(Splendid logic there, madam. Thank you so much.)Juror No. 3:\nJust look at the accused by comparison! He's Japanese, stoops all the while, and has a moustache! Very fishy...Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nNo no no! Not one of those things is a reason to find the man guilty!\nJuror No. 3:\nBut he is fishy. There's no point dancing around the fact. He's Japanese, he has a moustache and he stoops. You see, you arrive at the conclusion in just three steps. Three steps...like a waltz, in fact! You know, the more I think about it, the more this trial seems like a dance!\nRyunosuke:\n(You seem to be several steps ahead of yourself, though... and you're on the wrong foot!) No! There's nothing but circumstantial evidence here! There's no actual proof of the defendant's guilt!\nJuror No. 3:\nBut the victim's version of events is backed up by what the big-chinned man next to him says, isn't it? One, he saw the Japanese man there. Two, he saw no one else. And three, he saw the Japanese man there. ...Oh! That's another three steps! All this really does seem more and more like a waltz, doesn't it?\nRyunosuke:\n(Right...and the prosecution will waltz its way to victory if I let you speak much more...)Juror No. 4:\nThere's no evidence to suggest the gangling actor is a fraudsman. ...For now, at least.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nA fraudsman? What do you mean by that, madam?\nJuror No. 4:\n......... It really is a most tiresome problem for the company. Most irritating. We can be absolutely certain that a customer is stealing from us, but without hard evidence... ...we can't even threaten to take action for fear of being sued.\nRyunosuke:\n......... I'm sorry, you've lost me a little there. ...Who are you?\nJuror No. 4:\nI'm the wife of Augustus Altamont, owner of the Altamont Gas Company.\nJudge:\nGood gracious! Altamont Gas, you say?\nJuror No. 4:\nGas is the future of energy in this country and around the globe. But proper handling is essential. ...As I'm sure our employee from the East End branch office would be the first to agree.\nMetermann:\nAbsolutely, Lady Quinby! Gotta be used properly! Altamont Gas is the best in the world, of course!\nSusato:\n...Ah, I think we may have solved the mystery of the bow from earlier, Mr Naruhodo.\nRyunosuke:\n(Right... He bowed in deference to his employer's wife, did he?) Ah! So...would I be right in assuming... ...that the reason Mr Metermann was watching what Mr Shamspeare was up to in his room...\nJuror No. 4:\nI'm afraid that there's no end to the lengths the population of the East End will go to in order to steal our gas. So I really have no choice when the company identifies somebody as a possible fraudsman... ...but to dispatch a worker to watch the suspect day and night. We're very thorough in our investigations.\nRyunosuke:\nSo you mean, Mr Shamspeare is...\nJuror No. 4:\nI wouldn't come out and say it in public...but you can finish that sentence with 'a grubby little gas thief'!\nRyunosuke:\n...You have noticed the public gallery in here, have you?\nShamspeare:\n'The eye of man hath not heard, the ear of man hath not seen...' Faith, wouldst thou wound me with thy words...were I to let them penetrate the skin. But seraphs hear not insults, only choirs of angels in song!\nJuror No. 4:\nWe may not have evidence yet. But my workers won't stop buzzing around you until they find it! And when they do...you'll find yourself blasted back to your angelic heights in an Altamont Gas explosion!\nRyunosuke:\n(So Mr Shamspeare has been stealing gas...) I wonder, juror number four, if you wouldn't mind adding that information to your statement?\nJuror No. 4:\nMy pleasure. Was it the bit about ripping that thief apart you enjoyed?\nRyunosuke:\n...A little before the part about abject violence, if it's not too much trouble.\nJuror No. 4:\nYes, of course.\nRyunosuke:\n(This could be it! This could shift the balance...!)\nChanges Juror No. 4's statement to \"The 'victim' puts on a fine performance, but in reality, he's a common thief...of my company's gas!\"Juror No. 4:\nThe 'victim' puts on a fine performance, but in reality, he's a common thief...of my company's gas!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nThat's a bold claim. How can you be so sure?\nJuror No. 4:\nIt's really very simple.\nShamspeare:\nNoble lady of gas, I pray thee! Hold thy tongue!\nJuror No. 4:\nI beg your pardon?\nShamspeare:\nHath that rank-odoured air that doth our darkness illuminate any place in this assembly? Nay! 'Tis of sole import here that someone wouldst extinguish the light of mine own life!\nJuror No. 4:\n...!\nShamspeare:\nVerily, I ne'er recall stealing thy gas. But pray, let the matter rest till anon!\nJuror No. 4:\nWhy, you little...\nMetermann:\nBeggin' your pardon, my lady, but might I suggest you don't say any more at this stage? We need hard evidence first. If I keep secretly watchin' this bloke, I'll get him in the end. He'll slip up!\nRyunosuke:\n(Do you think maybe that secret's out of the bag?)\nJuror No. 4:\nHmph! Oh, this is so frustrating!Pit against Juror No. 1's statement (after Juror No. 1 changes his statement)\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"Those two statements clearly contradict each other!\"Juror No. 5:\nAgh! I really don't care, like! I just need this trial to end quickly!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nYou keep talking about needing to take home some money. What's that all about, sir?\nJuror No. 5:\n...Finnish Lass, that's what it's about.\nRyunosuke:\nWhat's that?!\nJuror No. 5:\nI'm talking about the derby at Hyde Park, aren't I? It was the Queen's Cup last week, wasn't it?\nRyunosuke:\nA...derby?\nJuror No. 5:\nIt was a dead cert, that's the thing! I couldn't lose! So I took my wife's secret savings, like... But then that hopeless old mare went and did the unthinkable! Argh, that stupid Finnish Lass!\nSusato:\n...Oh dear. I think it's clear what happened, isn't it?\nJuror No. 5:\nThis is the day the missus uses her savings for a trip down the pub! So, come on! Let this business lie now! Just give it up!\nRyunosuke:\nNo! That's...not going to happen!Juror No. 6:\nThree hours of 'missing time' is nothing when you reach my age, you know. Nothing at all.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nWhat do you really mean by that, sir?\nJuror No. 6:\nWell, I'm not one to boast, but I get up at five every morning, I do.\nRyunosuke:\nAt five?! You're a really early riser then, aren't you?\nJuror No. 6:\nHm? What's that now?\nRyunosuke:\nI said, you're an early riser!\nJuror No. 6:\nOh well, I wouldn't say that. I mean, I like to while away the hours in the evening reading books as well. But by about two in the morning, I'm usually too tired to go on.\nSusato:\nHe sleeps at two in the morning and gets up at five...? Oh my! That means he only has three hours of sleep each night!\nJuror No. 6:\nHm? What's that, dear?\nSusato:\nONLY THREE HOURS OF SLEEP EACH NIGHT!\nJuror No. 6:\nThat's right, you see. Three hours of missing time, like I said. It's not much, is it?\nRyunosuke:\n(...This really isn't helping.)Susato:\nThe key to summation examinations is identifying contradictions between jurors' statements, Mr Naruhodo.Ryunosuke:\nRight, and once I've found two jurors whose statements can't coexist, I need to pit those jurors against each other. Then hopefully, when they see that what they're saying doesn't make sense, they'll change their leaning.Susato:\nYes. And if you're able to change the minds of a majority of the jurors, the trial will continue. But conversely, if you're unable to do that, the judge will declare the trial over and move to adjudication.Ryunosuke:\n(And I can't let that happen. Somehow or other, I have to turn this trial around!)Ryunosuke:\nThose two statements clearly contradict each other!Judge:\nGood gracious! To whose statements do you refer, Counsel?Ryunosuke:\nJuror number one!Juror No. 1:\nEh? What are you yelling about, lad?Ryunosuke:\nI presume you've heard juror number four's statement? Made by the wife of the owner of Altamont Gas.Juror No. 1:\nWell, yes...Ryunosuke:\nThe victim, who you claim to be a noble, 'straight up' man... ...in fact turns out to be a 'common thief'.Juror No. 1:\nSo the good lady says. But there's no evidence, is there? You and I both heard them say as much!Juror No. 4:\nIt's true, we don't have evidence as such...just yet. But the claims aren't baseless, you know.Juror No. 1:\nWhat?Juror No. 4:\nYou heard me. Seeing as his operation has already been compromised... ...I would suggest that the court hears testimony from our East End branch office employee over there.Metermann:\nI'll do whatever you say, my lady! Gasman's honour!Ryunosuke:\nJuror number one! You say you're a man of your word!Juror No. 1:\n...!Ryunosuke:\nIf I could show that Mr Shamspeare was a liar, you assured me... ...that you would reconsider your decision about the defendant's guilt.Juror No. 1:\n......... Hm, yes, I did say that. And as a man of honour, I'll hold to it. ...As I'm sure the other gentlemen of the jury will!Juror No. 3:\nMe?! Oh, well, yes... Now that we've found out the man's a liar, perhaps we ought to consider the matter further.Juror No. 6:\nWell...if I'm perfectly honest, I haven't heard half of what you've all been saying. So if this means you'll recap a few points, that would suit me down to the ground.Juror No. 5:\nOh no, I'm not having any part of this! I want this trial over and done with!Juror No. 4:\nIn that case, I shall change my leaning.Juror No. 1:\nSo, Mr William Shamspeare...if that is your real name... ...we of the jury demand to know exactly what kind of a man you really are!Ryunosuke:\nThat's...four jurors! Four for 'not guilty'!Susato:\nYes, Mr Naruhodo! Victory!Judge:\nOrdaaar! Ordaaar! Well...this is quite extraordinary, I must say. As a result of the defence's summation examination, the jury's leaning has changed. Now only two jurors say 'guilty', whilst four say 'not guilty'. I therefore declare this court to be in a state of disaccord... ...and order the trial to continue!Van Zieks:\nYou have spoilt the bouquet...Mr Shamspeare.Shamspeare:\n.........Van Zieks:\nThe ladies and gentlemen of the jury now find they are unable to trust you, the victim.Shamspeare:\n......... 'But you gods will give us, Some faults to make us men.' So God mend me, I do swear... This gasman speaketh that which concerns him most: nought but gas! Nought but thin air! Ay, it burneth bright a while, but it hath no substance. And it doth reek foul!Metermann:\nOi, what did you say?!Judge:\nDo I take it, Mr Shamspeare, that you deny the allegations of gas thievery?Shamspeare:\nMost heartily, My Lord! Hast thou forgot? I am as a seraph! An angel! Noble of mind, sweet of nature and verily, honest of heart.Metermann:\nArgh, you flowery-mouthed, pompous beanpole! Just cos I haven't got the evidence yet...Ryunosuke:\nMr Shamspeare! If, in fact, you are NOT noble of mind, sweet of nature or honest of heart... If you are a liar... ...then your testimony should have no sway in this courtroom!Shamspeare:\n.........Judge:\nIt is my considered opinion... ...that at the present time, no other possible culprit of this crime has been identified. All testimony heard by the court thus far heavily implicates the defendant. In short, it would not be unreasonable at this stage for me to rule on the case.Susato:\nOh no...Judge:\nHowever...in light of the fact that the jury has expressed concern about the fidelity of this witness... ...I believe it would be inappropriate for this court not to pursue the point further.Van Zieks:Van Zieks:\nI assure you, My Lord, that would be a waste of the court's time. The gas and this case are unrelated.Ryunosuke:\nJuror number four!Juror No. 4:\nYes?Ryunosuke:\nDidn't you say before that although you had no hard evidence to prove this man has been stealing gas... ...you have strong grounds for suspecting him?Juror No. 4:\nThat's right, we do. ...Don't we, hm, worker?Metermann:\nAbsolutely, Lady Quinby! Gasman's honour!Judge:\nVery well, then. We will hear your testimony now. You will tell the court precisely why you believe the victim, Mr William Shamspeare, has been stealing gas.Metermann:\nYes, My Lord, it'll be my pleasure! On the Altamont Gas name, I swear-Juror No. 4:\nIf I may, My Lord...?Judge:\nGo ahead, madam.Juror No. 4:\nThis worker's testimony may have a significant bearing on the good name of my husband's company. Therefore, I should like to take the stand alongside him, in a supervisory role. If you wouldn't mind.Metermann:\nWahoo! Oh, yeah! Sweet as honey! Yeah, yeah, yeah, yeah, yeah!Judge:\n...Very well. As an exception, I shall honour your request.Juror No. 4:\nThank you, My Lord.Metermann:\nYou wait till the boss gives you an earful! Ooh, it's gonna sting, you mark my words!Judge:\nSo, you will both testify before the court... ...on the subject of the illegal consumption of the Altamont Gas Company's fuel!Juror No. 4:\nYes... ...Is that clear, my good man?Metermann:\nClear as Altamont gas, my lady! ...Which is the clearest in the world!Ryunosuke:\nDo you think the gas has gone to his head, Miss Susato?Susato:\nI think the man is just a very dedicated employee, Mr Naruhodo.Witness Testimony\n- The Altamont Gas Company's Investigation -Metermann:\nI'm proud to be the company's East End branch investigator and meter money collection agent.\nAltamont gas meters accept thruppenny bits, each coin givin' customers about two hours of gorgeous gas!Altamont:\nAnd yet, the meter in Mr Shamspeare's room didn't have a single coin in it!\nThe meter doesn't appear to have been tampered with, though, and the collection agent has the only key.Metermann:\nSomehow, he's usin' all the flamin' gas he wants without payin' a penny! If that's not thievin', what is?!Van Zieks:\n...Pray forgive the discourtesy. The irrelevance of this testimony caused me to turn to my hallowed chalice.Judge:\nWhat do you mean by that remark, Lord van Zieks?Van Zieks:\nDid the moustachioed Nipponese poison the gangling excuse for an actor or didn't he? That is all that should concern this court. And yet now we must listen to this...abhorrence. Clearly what separates the vast British Empire and your Eastern island nation is more than geographical distance.Ryunosuke:\nBut...but this could turn out to be crucial testimony! The cross-examination must go ahead!Van Zieks:\n...Do what you will.Susato:\nLord van Zieks appears to be in a violent mood.Ryunosuke:\nYes...he does. (An attempted poisoning...and an incidence of gas theft with no supporting evidence... It's true that they would appear completely unrelated at first glance. But I wonder... The truth tends to be buried in the most unusual places. And the first step in uncovering it...will be to establish just who and what this man really is!)Cross-Examination\n- The Altamont Gas Company's Investigation -",
      "testimonies": [
        {
          "testimony": "I'm proud to be the company's East End branch investigator and meter money collection agent.",
          "person": "Metermann",
          "present": []
        },
        {
          "testimony": "Altamont gas meters accept thruppenny bits, each coin givin' customers about two hours of gorgeous gas!",
          "person": "Metermann",
          "present": []
        },
        {
          "testimony": "And yet, the meter in Mr Shamspeare's room didn't have a single coin in it!",
          "person": "Altamont",
          "present": []
        },
        {
          "testimony": "The meter doesn't appear to have been tampered with, though, and the collection agent has the only key.",
          "person": "Altamont",
          "present": [
            "Gas Meter (after examining hole on bottom)"
          ]
        },
        {
          "testimony": "All joints on the meter are welded shut, and the lock is made from solid steel. There's no way to dismantle it.",
          "person": "Altamont",
          "present": []
        },
        {
          "testimony": "The meter is designed for coins the exact diameter and thickness of a thruppenny bit. Nothing else will fit.",
          "person": "Altamont",
          "present": [
            "Bar of Soap (after examining circular depression on this statement)"
          ]
        },
        {
          "testimony": "Somehow, he's usin' all the flamin' gas he wants without payin' a penny! If that's not thievin', what is?!",
          "person": "Metermann",
          "present": []
        }
      ],
      "noPresent": false
    }
  ]
}