{
  "previousContext": "Episode III\nThe Return of the Great Departed Soul\nAnime cutscene\nThe grand, end-of-the-century Great Exhibition of London - surely, there is not a soul who has failed to hear of it. Wondrous new works of culture and industry from every corner of the globe had converged on Hyde Park. Welcoming over fifty million visitors, the last great hurrah of this century astonished and delighted people of all nations, and ended on a note of resounding success. But, as regards to the terrible catastrophe that occurred during the festivities, very few are aware my friend, Mr Herlock Sholmes, had a hand in unravelling the matter. For, from the shadows, it was he who earnestly unearthed the facts of the case. And like the centrepiece of the Great Exhibition, which rose high into the skies of Hyde Park, Sholmes's brilliant deductions - as clear and lofty as the Crystal Tower itself - brought the truth to light.\nRendered dialogue\nWe're here at the showground of the Great Exhibition, which is absolutely packed with people... The weather is unusually fine, and we're about to witness a most extraordinary scientific experiment!\n\n\nLadies and gentlemen, the twentieth century will see steam engines and electrical power dominate the world! Horse-drawn carts will give way to the motor car! Ships will sprout wings and take to the skies! And today, we showcase even more advanced technology! A glimpse into the future! A world first! A demonstration of my super-high-voltage instantaneous kinesis machine! A man will literally be disassembled by a pulse of high-voltage electricity, and beamed to another location... ...whereupon his body will be reassembled by a series of complex calculations exactly as it was before! In but a few moments from now... ...this gentleman will, in the blink of an eye, complete an incredible journey through the air... ...to arrive an instant later, on the Crystal Tower behind you!\n22nd October, 9:36 a.m.\nSholmes's Suite\nRyunosuke:\n.........\nIris:\n...Runo! Runo, are you listening?\nRyunosuke:\nOh! Sorry, um...what was that, Iris?\nIris:\nHmph. What's the matter with you? You've been miles away all morning. Didn't you like what I cooked for breakfast?\nRyunosuke:\nNo no, that's not it at all. Um...what were we talking about again?\nIris:\nToday's paper! It's full of news about the Great Exhibition again!\nRyunosuke:\nAh yes...the Great Exhibition... I'd like to go sometime. .........\nIris:\nYou're really not your usual self today. You seem very down. Don't you agree, Hurley?\nSholmes:\nHm...? Did you say something? Iris?\nIris:\nOh gosh! You're even more down!\nSholmes:\n......... UWAAAAAAAAAGH!!! Wh-When did you arrive, Mr Naruhodo?\nRyunosuke:\nI've...been here for about half an hour already. We had breakfast together.\nSholmes:\nWhat?! Why didn't you mention it before?\nRyunosuke:\nI, um...thought you might have known I was here. You know, because...breakfast?\nSholmes:\nHm, Iris is quite right. You're clearly lacking in vim. So much so that I didn't notice your presence.\nRyunosuke:\n(...Thanks.)\nSholmes:\nOf course, I could deduce the reason perfectly well with some simple observations.\nRyunosuke:\nWhat?!\nSholmes:\nLet's see... Yes, for example, your tussled hair this morning, with all its unruly spikes. Clearly it can be deduced therefore, that-\nRyunosuke:\nUm, let me stop you there, Mr Sholmes, because I think I can see where this is going. My hair always looks like this. It always has. Ever since we first met, in fact.\nSholmes:\nOh really? How interesting. It just doesn't look like a haircut as such, I suppose. Ah ha ha ha ha hah!\nRyunosuke:\n(...Thanks again.) ......... It crossed my mind recently...that it's been six months now.\nIris:\nSix months?\nRyunosuke:\nSince I was forbidden from working in court. So I've been wondering how much longer I'm going to be banned.\nIris:\nOh... Well, that would explain why you seem rather glum. Don't you agree, Hurley?\nSholmes:\nHm...? Did you say something? Iris?\nRyunosuke:\n(Ah...back to moping...)\nRyunosuke:\nWhat's the matter with Mr Sholmes today? He seems even more down in the dumps than me.\nIris:\nI know! And the Great Exhibition has opened! You'd think he'd be excited. Oh, why don't we all go to see it together?\nSholmes:\nI want to! Of course I do! But I can't! ...Not for the time being.\nRyunosuke:\nWhy not?\nSholmes:\nWhy not? Why not?! Because! I'm a great detective, after all!\nRyunosuke:\n(So you're embroiled in some tricky case that you can't be distracted from? Is that it?)\nIris:\nI don't remember hearing that you're working on a case, Hurley.\nSholmes:\n.........\nRyunosuke:\n(I suppose I should try to find out what's going on.)\nAfter clearing all Converse options:\nSholmes:\nWell, I must be leaving now.\nRyunosuke:\nYes, understood. See you later, Mr Sholmes!\nSholmes:\nHah! You really are a shameless liar sometimes, my dear fellow!\nRyunosuke:\nWhat?\nSholmes:\nYou seek to put me off my guard and follow me, don't you? Well, you would be wasting your time.\nRyunosuke:\nThe thought hadn't crossed my mind! (But now I'm wondering where you're going...)\nSholmes:\nAh ha ha ha hah! Well then, 'see you later' indeed!\nRyunosuke:\n(Listen to him. He's still laughing on his way out of the door...)\nIris:\nAlright then, Runo! Let's get going!\nRyunosuke:\nOh! Um, Iris... What are you wearing?\nIris:\nI've got changed to go to the Great Exhibition. You're going to take me!\nRyunosuke:\nWhat? But, but I was just about to go to the Supreme Court...\nIris:\nOh! Well that sounds fun, too! You're going to take me there, then!\nRyunosuke:\nAlright, fine. Just...lower that weapon, would you?\nIris:\nOf course! And after the Supreme Court, then we'll go to see the Great Exhibition!\n22nd October\nNaruhodo's Legal Consultancy\n22nd October\nBritish Supreme Court, Lord Chief Justice's Office\nRyunosuke:\nIt's been about six months now since I was last here. But some things never change. Like the sense of foreboding I always seem to feel in this place. (It doesn't seem to be bothering Iris at all, though. She's happily reading over there...)\nIris:\nOh, I love this place! I always find so many interesting books here!\nRyunosuke:\nOf course. I was forgetting that you've been here before. (The time we came here six months ago... ...when Susato-san was given the news that she was to return to Japan.)\n???:\nAh. I understand you wish to speak with me.\nRyunosuke:\nOh! L-Lord Stronghart! I trust you've been k-keeping well?\nStronghart:\nLet's see... Since you've arrived and requested an audience, it's been four hours, thirty-two minutes and... ...twenty-six seconds. I've kept you waiting a while. My apologies.\nRyunosuke:\nOh no, not at all! I like nothing more than standing around, staring into space.\nStronghart:\n...Good to know.\nRyunosuke:\n(...Good to know that doesn't appear to bother him at all.) Mael Stronghart, Lord Chief Justice of London. He's the man who allowed me to start practising as a defence lawyer when I arrived in Britain as a student. You need only savour the air for a moment in this grand office to understand his pre-eminent status.\nStronghart:\nAs you will be aware, the Great Exhibition of London is now underway at last. We're extremely busy as a result. Policing the grounds, guarding the new technologies, dealing with petty crime... And furthermore, as of next month, we shall open the International Forensic Science Symposium.\nRyunosuke:\nOh...I've not heard about that.\nStronghart:\nInvestigating authorities from forty countries around the globe will be taking part. Including from your own land. Forensic science is the future! The world must embrace it! As we're the hosting nation, I have much to do. And it is my highest priority. If others must wait for my attention as a result, so be it.\nRyunosuke:\n(...Well, it's nice to know where I stand.)\nStronghart:\nSo...you wish to consult with me? Of course, I can very well imagine what this is about.\nRyunosuke:\nAh...well, um... Thank you for agreeing to this meeting, My Lord! (I want to be allowed to start working as a defence lawyer again in court. That's what brought me here today. But actually, there's something else playing on my mind, as it happens...)\nIris:\nRuno, just take a deep breath and come out with it!\nAfter clearing all Converse options:\nStronghart:\nWell, I must be leaving for my next engagement. I'm already...eleven hours and sixteen minutes late. ...My colleagues may be starting to fidget.\nRyunosuke:\nE-Eleven hours late? That's...quite something.\nStronghart:\nThat meeting had already started when I arrived back here for this engagement with you. So lateness was inevitable. Time stops for no man.\nRyunosuke:\n(I'm sure it stopped for me during those twelve solid arguments and two hundred and twenty-three reasons...) Oh, yes! Where would I find Lord van Zieks now?\nStronghart:\nI would assume he's at his office.\nRyunosuke:\n(Right, I'll go and ask him about the attack in person. I want to get this straight from the horse's mouth...)\nStronghart:\nAway with you now. I'm leaving Professor Harebrayne's defence entirely in your hands.\nRyunosuke:\nOf, of course, yes! Thank you very much, My Lord!\n22nd October\nProsecutor's Office\nIris:\nOoh! So this is the legendary Reaper's office?\nRyunosuke:\nYes, it appears so.\nIris:\nBrrr, it sends a chill down your spine, doesn't it? What an amazingly deathly atmosphere!\nRyunosuke:\n...Oh, is that...? (That hooded figure was so still, I hadn't noticed his or her presence. I wonder who it is...?)\n???:\nWhat are you doing here?\nRyunosuke:\nAgh!\nVan Zieks:\n.........\nRyunosuke:\n(He's as unwelcoming as I thought he'd be. Actually, maybe even more so...) Oh, I, um... I'm glad to see you're well.\nVan Zieks:\n...I am.\nRyunosuke:\n......... So...who's the person over by the wall being...punished for something or other?\nVan Zieks:\nNo punishment is taking place here.\nRyunosuke:\nOh.\nVan Zieks:\nThat's my apprentice. And he's sitting there of his own free will.\nRyunosuke:\nI didn't know you had an apprentice. (It must be the same person who was pictured in the newspaper...)\nVan Zieks:\nHe's very able in combat. ...A requisite skill for anyone under my tutelage.\nRyunosuke:\nAre you referring to the attack on the Reaper that was reported in the papers?\nVan Zieks:\nThe Reaper? I'd be interested to know the Reaper's true identity myself. Assuming, that is, such a fabled fiend genuinely inhabits our great courtrooms...\nAfter clearing all Converse options:\nVan Zieks:\nAh yes, there's something I've been meaning to ask you...\nRyunosuke:\nOh! What's that?\nVan Zieks:\nThat Nipponese man. Is he faring well?\nRyunosuke:\nSorry?\nVan Zieks:\nThe one arrested twice in succession six months ago. With the stoop. And the moustache. And the jitters.\nRyunosuke:\nAh! Mr Natsume, you mean?\nIris:\n...I'm not sure he'd be very pleased to find out you identified him from that list, Runo.\nRyunosuke:\nHe's fine, thank you. In fact, I received a letter from him by international post only the other day.\nVan Zieks:\nI see. ......... Well, I think we can end our discussion there, don't you? There's little time left before tomorrow's trial. I advise you to spend it investigating the case.\nRyunosuke:\nYes, thank you for the advice. And for the conversation. (I can't believe he's asking after Soseki-san. After a 'Nipponese'! I'm not sure whether to feel happy about that or worried.)\nIris:\nI never imagined that Mr Reaper would be friends with a mad scientist, did you? That's a turn-up for the books!\nRyunosuke:\nA mad scientist? Ah, you mean Professor Harebrayne? (Yes, it might be worth quizzing the professor about his relationship with Lord van Zieks, I think.)\n22nd October\nLocal Prison, Cell 11\nRyunosuke:\nThe warden said cell eleven. That's this one...\nIris:\nOh! There's someone curled up in a ball in the back corner, look!\nRyunosuke:\nWhat's his name again? Professor Albert Harebrayne, wasn't it? ...Um, excuse me! Professor Harebrayne!\nHarebrayne:\n...! Who are you?\nRyunosuke:\nI'm Ryunosuke Naruhodo. I'm a defence lawyer.\nHarebrayne:\nA LAWYER!\nRyunosuke:\nAgh! (Was it something I said?!)\nHarebrayne:\nA, a lawyer, you say? W-W-W-Would you be here... a-a-a-about the experiment? ARE YOU GOING TO DEFEND MY HYPOTHESIS?!\nRyunosuke:\nYour...hypothesis? Sorry, I don't-\nHarebrayne:\nYesterday's demonstration! That demonstration was... That magnificent demonstration was... It was an out-and-out success! By anyone's calculations! B-B-B-But despite that... ...no one listens! No lawyer believes in the science! When it's explained, they all leave...at high velocity! Haah...\nRyunosuke:\n......... (Now's probably not a good time to mention that your zeal made my concentration leave for a while, too...)\nAfter clearing all Converse options:\nRyunosuke:\nSo, Professor, let me just make absolutely sure I've understood you properly. The huge explosion that occurred yesterday... That was an accident, you're saying? You had no intent to harm the victim, who was in fact the sole investor in your work. Is that correct?\nHarebrayne:\nAs correct as two squared is four! I swear it! Yes, it's true that the man perished in a machine of my invention. So I know that I'm far from blameless in all this. But still! I would never use my discoveries, my inventions, to take a person's life! Not in a centillion years! I'm a man of science! It's all I know! You have to believe me! Please! Do you believe me? Do you believe in my hypothesis? Science is the pursuit of truth, you know. I've always believed that. All my life!\nRyunosuke:\n......... I'm afraid I don't know much about science. Or your theories. But I do believe you. And I will fight to prove your innocence with all my might. I'm a man of the law! It's all I know! You have to believe me! Please!\nHarebrayne:\n......... When I went to live in Germany after I graduated, I learnt something very important. Nationality, class, lineage...none of that matters. As long as you try your hardest, you can achieve anything.\nRyunosuke:\nThank you for that, Professor.\nHarebrayne:\nAnd thank you in advance for defending me tomorrow in court!\nIris:\nAlright, Runo, it's time! Time to visit the Great Exhibition!\nRyunosuke:\nSorry?\nIris:\nWell, that's where the incident happened, isn't it?\nRyunosuke:\nYes, I suppose that's true. (Time to investigate at last!)\n22nd October\nThe Great Exhibition Grounds, Foot of the Crystal Tower\nRyunosuke:\nUgh... The showgrounds are a little too big for my liking... We've been walking around in dense crowds for two hours now, and I've felt myself swooning three times.\nIris:\nThere are a lot of people, aren't there? I've almost been trodden on three times, too!\nRyunosuke:\n...Be careful, won't you, Iris? Don't let go of my hand. (We've finally made it through the throngs though, by the look of it. Here we are underneath the public experimentation stage where the explosion happened yesterday.)\n???:\n.........!\n???:\n.........!\nRyunosuke:\n(What's that...? I can hear voices from up on the stage. It sounds like an argument...)\n???:\nRight, I've had it with you this time! I'm warnin' you, I'll arrest you in a minute!\n???:\nOh yeah? Go on then, 'Spector, give it a shot! You ain't got no evidence, an' you know it!\nRyunosuke:\n(Wait... I know those voices.)\n???:\nYou've got a cheeky little mouth on you, young lady! But a night in the cells will teach you some manners!\n???:\nJust try it, I dare ya! If ya want that bag o' chips rammed down yer throat!\nIris:\nYoo-hoo! Gregsy! What are you doing up there?\nGregson:\n......... Ah! AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAH! It's you! Here! You're here! Here you are! You! Here! Your Ladyshiiip! How are you, Your Ladyship? I do hope you're well, Your Ladyship?\nRyunosuke:\n(...Does that make her three times a lady?)\nIris:\nI'm not well at all. It's far too busy everywhere. I wanted to ride in a balloon, but there was a three-hour queue.\nGregson:\nUnbelievable! I'll go an' have a word for you at once, Your Ladyship! You'll be flyin' as high as a kite in no time once I pull some strings for you!\nRyunosuke:\nTobias Gregson, an inspector at Scotland Yard. Until recently, he was suspended from duty, but it would appear he's back in action now. He's actually quite well known, appearing as he does in 'The Adventures of Herlock Sholmes'. And for that reason, he can't say a word wrong to the stories' author, Iris. (But there are limits, surely... Or there should be!)\nGregson:\nWatch it, sunshine!\nRyunosuke:\nS-Sorry...\nGregson:\nWhat gives, then? Don't tell me you're on this case?\nRyunosuke:\nYes, I'm acting for the defence.\nIris:\nSo we're here to investigate!\nGregson:\nHmmm... Dear me, that's the situation, is it?\nRyunosuke:\n(Is it really that troubling?)\n???:\nTsk. A measly five bob? Is that all ya got? Yer a lawyer, ain't ya? Ya could stand to carry a bit more copper around in yer pockets, Mr Narra-'Oddo!\nRyunosuke:\nWha...? Hey! That's my last bit of spending money, that is!\n???:\nYa can 'ave it back, but I'll 'ave to charge ya for all the bother. Three bob.\nRyunosuke:\nThis is Gina Lestrade, a pickpocket, or 'diver', born and bred in the East End of London. In the case that led to my own suspension six months ago... ...this is the young girl I was defending in court.\nGina:\nWot's yer problem, eh, 'Oddo?! 'Diver'? Pickpocket? Wot's wiv all the name-callin'? You wanna bag o' chips rammed down yer throat an' all, do ya?\nRyunosuke:\nI, I thought you were proud to be a diver, Gina? You were just arguing with Inspector Gregson about it, weren't you? I assumed you'd been up to your usual tricks here at the showground.\nGina:\nThat ain't no way to talk to a lady, 'Oddo. 'Alf a year's a long time. People can change. I'm an apprentice now. Learnin' to be a Scotland Yard detective. So you'll 'ave to call me wot everyone else does: It's Inspector Lestrade now!\nRyunosuke:\nIn... Inspector?! (That badge is homemade, surely...)\nGregson:\nThe 'inspector' part isn't entirely accurate. No one calls her that. For what it's worth, anyway. Investigatin' is off the cards for all of us.\nIris:\nWhat's that supposed to mean?\nGregson:\nRight, well, I'll be back up top. You hold the fort down here, alright?\nGina:\nRight...sir.\nRyunosuke:\n(This... This raises a LOT of questions!)\nAfter clearing all Converse options and examining green cloth on ground, device on ground, and large hole in glass in Great Exhibition Grounds, Foot of the Crystal Tower and clearing all Converse options and examining large machine in Great Exhibition Grounds, Experimentation Stage:\nIris:\nRuno, Runo, listen!\nRyunosuke:\nWhat? What is it?\nIris:\nI've been thinking... Hurley might know something, mightn't he?\nRyunosuke:\nAbout what?\nIris:\nAbout Mr Reaper!\nRyunosuke:\n...! About what happened to Lord van Zieks, you mean? (Because it sounds like something very significant occurred after he graduated from university. Something that completely changed his life.) Maybe, but I have no idea where to find Mr Sholmes at the moment. He's in the middle of some big case, isn't he?\nIris:\nHere, this is what you need!\nRyunosuke:\nWhat's this? (Some kind of entrance ticket?) 'Madame Tusspells'? Is this supposed to mean something to me?\nIris:\nYou don't know it?! It's the most popular attraction in London at the moment! It's very close to Baker Street, actually. We could go now, if you like?\nRyunosuke:\nNo no, we don't have time for visiting attractions today, Iris. We have a big trial tomorrow!\nIris:\nBut that's where Hurley is.\nRyunosuke:\nWhat? At, at this popular London attraction?\nIris:\nYes!\nRyunosuke:\nHow is it that you know where he is?\nIris:\nHurley told me. But he told me to keep it a secret from you, Runo.\nRyunosuke:\nMadame Tusspells...? (I don't see how it could be related to the case we're investigating here, but then... ...stranger things have happened. And when they happen, Mr Sholmes is usually at the heart of them.)\n22nd October\nThe Great Exhibition Grounds, Experimentation Stage\nRyunosuke:\nSo that's it, is it? The machine that blew up.\nIris:\nOoh, it must have been a magnificent explosion! And I've seen my fair share.\nRyunosuke:\nYou've seen things like this before, you mean?\nIris:\nOf course! Hurley's always doing experiments that end in a bang. In fact, in his own words, 'Explosions are the very essence of chemistry!'\nRyunosuke:\nAh...that might explain the smell of burning that frequently comes wafting up the stairs.\nIris:\nOne time, he made something that exploded with such force, it took the roof off the building! I wish you'd been there to see it, Runo!\nRyunosuke:\n...It's hard to get too excited about that...given that I now live in the roof.\nIris:\nWell anyway, that's enough about that. It's time to investigate!\nRyunosuke:\nAh look, Inspector Gregson is over there. He seems to be deep in thought about something... whilst eyeing up the machine carefully.\nIris:\nReally? He just looks confused to me.\nRyunosuke:\nIt ripped itself apart magnificently, didn't it?\nIris:\nMagnificently...and mercilessly.\nRyunosuke:\nSo someone stands in the middle of the machine to be disassembled and then 'beamed' through the air...\nIris:\nYes, 'beamed' not 'blasted'. That's the point.\nRyunosuke:\n(Yes, that part's crucial, really.) Is something like that even possible, though, Iris?\nIris:\nOh, Runo. I'm just a child. How should I know?\nRyunosuke:\n(A child when it suits you, you mean...)\nIris:\nFrom what I can tell, I think if you were to pull this lever here-\nGregson:\nSTOOOOOOOOOOOOP! Don't touch that!\nIris:\nAh ha ha! That was practically instantaneous kinesis the way you flew over just now, Gregsy!\nGregson:\nPlease, Your Ladyship... I didn't mean to startle you, but I can't let you touch anything up here.\nIris:\nSo sorry. You can have some of my latest special blend to make up for it.\nGregson:\n*Glug* *Glug glug glug* Aaah! Wonderful! This stuff really is wonderful!\nRyunosuke:\n(It's just like old times, this is...) We're representing Professor Harebrayne in court tomorrow, Inspector. So we should be allowed to examine the scene!\nGregson:\nHah! Listen, sunshine, even I'm not allowed to touch anythin' up here! It's that blasted Special Dispensation for Scientific Equipment Act to blame. It's drivin' me potty!\nRyunosuke:\nOh yes, that special dispensation... (The professor mentioned that, too.)\nGregson:\nMore red tape's all we need. I dunno what the government thinks it's playin' at sometimes.\nIris:\nBut...we're allowed to just look, aren't we?\nGregson:\nEh?\nIris:\nSurely that's alright...isn't it, Gregsy?\nGregson:\n......... 'Course, Your Ladyship! Anythin' you say, Your Ladyship! But please don't get your dainty hands dirty, will you?\nIris:\nDon't worry. We wouldn't dream of touching anything, would we, Runo?\nRyunosuke:\n(She really knows how to get what she wants...)\nAfter clearing all Converse options and examining green cloth on ground, device on ground, and large hole in glass in Great Exhibition Grounds, Foot of the Crystal Tower and clearing all Converse options and examining large machine in Great Exhibition Grounds, Experimentation Stage:\nGregson:\nRight, are you done here, Mr Naruhodo?\nRyunosuke:\nSorry?\nGregson:\nIsn't it about time you were leavin'? Or rather...it IS about time you were leavin'! That lot are here now.\nIris:\nThat lot?\nGregson:\nThe Forensic Investigation Team. They'll be givin' me the heave-ho in a minute, too.\nIris:\nOh dear. Poor Gregsy. Here! Have another cup of my special blend to cheer you up!\nGregson:\n*Glug* *Glug glug glug* Aaah! That hit the spot! Yup, hits it every time!\nRyunosuke:\n(Well, at least I've seen the scene with my own eyes. It looks like this is as far as we're going to get with our investigations here at least...)\nIris:\nI've been thinking... Hurley might know something, mightn't he?\nRyunosuke:\nAbout what?\nIris:\nAbout Mr Reaper!\nRyunosuke:\n...! About what happened to Lord van Zieks, you mean? (Because it sounds like something very significant occurred after he graduated from university. Something that completely changed his life.) Maybe, but I have no idea where to find Mr Sholmes at the moment. He's in the middle of some big case, isn't he?\nIris:\nHere, this is what you need!\nRyunosuke:\nWhat's this? (Some kind of entrance ticket?) 'Madame Tusspells'? Is this supposed to mean something to me?\nIris:\nYou don't know it?! It's the most popular attraction in London at the moment! It's very close to Baker Street, actually. We could go now, if you like?\nRyunosuke:\nNo no, we don't have time for visiting attractions today, Iris. We have a big trial tomorrow!\nIris:\nBut that's where Hurley is.\nRyunosuke:\nWhat? At, at this popular London attraction?\nIris:\nYes!\nRyunosuke:\nHow is it that you know where he is?\nIris:\nHurley told me. But he told me to keep it a secret from you, Runo.\nRyunosuke:\nMadame Tusspells...? (I don't see how it could be related to the case we're investigating here, but then... ...stranger things have happened. And when they happen, Mr Sholmes is usually at the heart of them.)\nProsecutor's Office\nNaruhodo's Legal Consultancy\n22nd October\nMadame Tusspells Museum of Waxworks\nRyunosuke:\nWh-What is this place? L-Look at all these t-terrifying scenes! But why are all the p-people so still? (Guillotines... Ruthless murderers... I know what I'll be dreaming about tonight.)\nIris:\nThey're all wax models. They're amazingly realistic, aren't they? What do you think, Runo? Shocked?\nRyunosuke:\nW-W-WAX MODELS?! .........AAAAAAAAAGH! I, I read about d-dead bodies and wax once...in a m-magazine about strange phenomena. Depending on how c-c-corpses are kept after death, p-parts of them can turn to wax, apparently. It's c-called a...adi...adip... Adipocere!\nIris:\n...Stop talking about creepy things like that, Runo. You're scaring me. Anyway, adipocere doesn't form readily, you know. It's only in very specif-\nRyunosuke:\nAAAAAAAAAAAAGH!\nIris:\nWhat now?\nRyunosuke:\nI've, I've just remembered something else I read, in another m-magazine about strange phenomena. There was an old lady - maybe a w-witch - who used to pour molten wax over c-corpses and put them on display.\nIris:\nNone of the exhibits in here are real. They're all entirely man-made replicas.\nRyunosuke:\nThey can't be! Do you really expect me to believe that? Just look at them!\nIris:\nOh!\nRyunosuke:\nThere's no way anybody could make models of people that are this realistic! And...they're all such gruesome scenes... .........Wait.\nIris:\nWhat is it?\nRyunosuke:\nOh...no... (I must be seeing things...)\nRyunosuke:\nIt's...it's... ...the great detective, Mr Herlock Sholmes! (Mr Sholmes has his own wax statue in here? Really?)\nIris:\nWell he is world-famous, after all!\nRyunosuke:\nIt's an uncanny resemblance, isn't it? It makes my skin crawl to look at it...\nIris:\nI know! But look, Runo. You can kick this Hurley, and he doesn't move a muscle!\nRyunosuke:\nYou can't go around kicking the exhibits, Iris! .........Wait. It, it just moved, I'm sure. And not just a little bit, either!\nIris:\nHm? Really? Did it?\nRyunosuke:\nAnd look closely... ...there are beads of sweat on the face...of this waxwork... model...\n.........\nRyunosuke:\n......... Sh-Shall we move on, Iris? ...Over there, look! There's a great murder scene to enjoy! Much more appealing.\nSholmes:\nSholmes:\nMy dear fellow! I take exception to your recoiling in such a manner, as if you've seen something truly abhorrent!\nRyunosuke:\nMr...Mr Sholmes! (I knew it!)\nSholmes:\nIris, what possessed you?! I strictly forbade you from divulging my temporary waxwork secret to Mr Naruhodo!\nRyunosuke:\nTemporary waxwork? What do you mean?\nSholmes:\nAnd that kick! Could you not have exercised a little more restraint? You winded me!\nIris:\nBut Runo has something he needs to ask you.\nSholmes:\nAh...a question?\nIris:\nAnd I thought you'd probably be getting bored, too. So here we are!\nSholmes:\nHm... Well, I can't deny that your timing was impeccable. A mere two minutes more being stationary like that... ...and my great brain, upon which all my success has been built, would have turned to wax!\nRyunosuke:\n...Thank goodness we arrived in time.\nSholmes:\nIndeed. In many ways, the pair of you just saved the world from an unimaginable loss!\nIris:\nOh, Hurley! You do like to talk nonsense, don't you?\nRyunosuke:\n(He could know something, it's true. About Lord van Zieks, and what happened in the past to change him.)\nSholmes:\nNow that you're here, let's take our time. How can I be of assistance? For you're in luck. I'm suddenly quite taken with the idea of conversing!\nRyunosuke:\nOh...well, actually, I'm in quite a hurry.\nSholmes:\nAnd if my eyes don't deceive me... ...I believe something is afoot within the walls of this very museum. A most fascinating case, if I'm not mistaken.\nRyunosuke:\nReally?\nSholmes:\nMoreover... ...I have a strong suspicion that it is related to the matter about which you've come to me now.\nRyunosuke:\n(But...how could it be?)\nSholmes:\nWe shall speak again presently, my dear fellow. But for now, I must return to my work.\nRyunosuke:\n(What, back to being a temporary waxwork exhibit?)\nSholmes:\n......... Well? What is it you'd like to ask me, then?\nRyunosuke:\nUm. Actually, it's... It's about Lord van Zieks.\nSholmes:\nAh, our friend Mr Reaper. How did you find him? Well, I trust?\nAnd so I filled Mr Sholmes in about everything I'd learnt. About Lord van Zieks... About Professor Harebrayne... And about the strange coincidence that they had been at university together.\nRyunosuke:\nSo I'm wondering what it was that happened to make Lord van Zieks such a different person.\nIris:\nI was sure that you'd know, Hurley.\nSholmes:\n.........\nRyunosuke:\nYou said there was something going on here in this exhibit hall before. That something was afoot. And that you believed it was related to what I wanted to ask you about.\nSholmes:\n.........\nRyunosuke:\nUm, Mr Sholmes...? (He's suddenly clammed up.)\nSholmes:\nWell, it seems we've reached the unavoida-\n???:\nGreetings...\nRyunosuke:\nOh! Ah...hello. (Where did she appear from? And what's she wearing? Could she look any more mysterious?)\n???:\nI hope...you are appreciating my museum?\nRyunosuke:\nSorry? Have we...? Mr Sholmes, do you know this- (Not again!)\nTusspells:\nMy apologies. I am Esmeralda Tusspells. This is my museum of waxwork.\nRyunosuke:\nWha... You... You're THE Madame Tusspells?\nTusspells:\nBien sûr. Though only twenty-six years young, I might add.\nRyunosuke:\n...Is that significant somehow?\nTusspells:\nI'm a 'madame' in name only. It adds a certain...je ne sais quoi.\nRyunosuke:\nRight...\nTusspells:\nFirstly, I must apologise for my waxworks. Or rather, one waxwork in particular.\nRyunosuke:\n(That'll be Mr Sholmes, then.)\nTusspells:\nI was led to believe he was a great detective, but he seems...unable to settle. Next time you move from your designated exhibit...there WILL be toil and trouble.\nIris:\nShe sounds deadly serious.\nRyunosuke:\n(That's a problem. How am I supposed to ask Mr Sholmes about Lord van Zieks now?)\nIris:\nLet's not forget what Hurley said before. About something being afoot right here in the museum, I mean.\nRyunosuke:\nYes, I know, but...\nIris:\nI'm so curious! I want to know what's happening here!\nRyunosuke:\n(Haven't we got enough on our plate already?!)\nRyunosuke:\nUm, I wonder...could I ask you something?\nTusspells:\nBien sûr...\nRyunosuke:\nI'm just curious. Is anything going on in the museum at the moment. [sic] Some kind of incident, perhaps?\nTusspells:\n......... Whoever suggested such a thing to you?\nRyunosuke:\nOh, well, it was... ...your temporary waxwork over there who mentioned it to me a little- Oh! (He's disappeared!)\n???:\n...A wax model is a work of art. Not some tawdry object for trade.\nRyunosuke:\nAh! Th-There you are!\nTusspells:\nLeaving the exhibit again when you should be working? ...Do you wish to be melted down?\nSholmes:\nMy dear Madame Tusspells, save your reprimands. There are more pressing concerns. The wax can wait. It's our ideas about your current problem we must throw into the melting pot instead!\nTusspells:\n...!\nSholmes:\nPersonally, I would advise you not to involve the police.\nTusspells:\nWhy ever not?!\nRyunosuke:\n(She's turned as white as a sheet...)\nSholmes:\nBecause you have at your disposal a great detective, whose services you may employ for a mere fifty shillings. Though please be aware that I prefer- No, I insist upon payment in advance!\nTusspells:\n......... ...Very well. Let us see if the great detective is able to live up to his name, shall we?\nSholmes:\nBefore I engage my analytical processes, I must ask you to clarify something. What, pray, is behind the curtain?\nTusspells:\nThat is the Tusspells Special Exhibit. There is an extra charge to see it.\nSholmes:\nAh, the 'special' exhibit in the House of Horrors... It must depict a special killer then, I presume. Would you be so kind as to draw back the curtain, I wonder?\nTusspells:\nAh! Absolument non! There is nothing amiss behind there!\nSholmes:\nNothing amiss, madame? What about the arm protruding ominously from under the curtain?\nTusspells:\nAh!\nSholmes:\nI strongly encourage you to allow me to see what lies beyond, before the situation worsens.\nTusspells:\n......... Yes, very well. I will draw back the curtains. ...But only a soupçon.\nSholmes:\nI must confess, I peeked behind the curtain earlier. The Tusspells Special Exhibit is a very bleak graveyard scene indeed. And yet somewhat surprisingly... ...the waxwork killer one would expect is nowhere to be seen. What does strike one, however... ...is the portly gentleman lying peacefully on his back on the floor.\nRyunosuke:\nWell, well then perhaps, Mr Sholmes... ...that man on the floor is the ruthless killer himself!\nSholmes:\nI'm afraid not, my dear fellow. He's a perfectly ordinary London gentleman. Not even a waxwork, in fact.\nRyunosuke:\nWhat?\nSholmes:\nAs skilfully made as these waxworks are, they are always distinguishable from real humans. So, allow me to present my two conclusions. The first... ...is that a sizeable business transaction has been taking place in this special exhibit.\nTusspells:\nWhy...? Why would you say that?\nSholmes:\nAnd the second... ...is that the aforementioned transaction is linked to a serious crime!\nTusspells:\nAAAAAAH!\nRyunosuke:\n(She looks as pale as candle wax...)\nTusspells:\nI, I don't understand...\nSholmes:\nSo, Madame Tusspells, as you've agreed to my fee... ...you shall now have the pleasure of seeing this famously great detective - and temporary exhibit - at work.\nThe Great Deduction\nThe game is afoot!\nTopic 1\nWaxwork's Fate\nSholmes:\nTo begin with, we must ask ourselves what exactly is afoot here in this museum? The answer is revealed by the bundle of banknotes protruding so helpfully from your bag. In my estimation, some...two hundred pounds.\nTusspells:\nThat, that is all my own money!\nSholmes:\nSo what does this large sum of money reveal? Ah, not as much as the involuntary glance you cast, it would seem, Madame Tusspells. Yes, the answer lies where your eyes now fall. The significance of the two hundred pounds is revealed by that public notice! 'Waxwork for sale'? Your business has hit hard times, it would seem. In short... ...you sold the infamous killer - the centrepiece of your special exhibit - for the sum of two hundred pounds!\nTusspells:\nNooooooooon!\nSholmes:\nNow...let us explore the next curiosity with which we are presented. Who is the portly gentleman stretched out so peacefully on the floor?\nTusspells:\n.........\nSholmes:\nIt would appear the man has suffered a severe shock. The cause of which...is clearly known to you.\nTusspells:\nAh!\nSholmes:\nUnfortunately, madame, keeping secrets does not appear to be your forte. What dealt the man such a shocking blow was of course... the two hundred pounds! It would appear that you twisted this gentleman around your little finger most effectively.\nTusspells:\nWhat are you suggesting?!\nSholmes:\nHe rashly agreed to purchase the waxwork for the sum of two hundred pounds. Only when he came to hand the money over, did it occur to him what an extortionate amount he was paying. But the money was no longer in his hands. And the result? The scene we see before us. He collapsed in shock. Yes, the killer in this special exhibit fetched a killer price! We can only pray that the gentleman's dreams are not plagued with regret...\nTopic 1\nWaxwork's Fate\nConclusion\nSold for cash\nTopic 2\nWaxwork Location\nSholmes:\nThe question that arises then, is what has become of the waxwork that changed hands? Let us consider that problem for a moment.\nTusspells:\nYou, you cannot possibly...\nSholmes:\nWhat immediately strikes me about this conundrum, is the young man standing over there. Who is this fellow? To find the answer, we need only observe...his neckerchief. Such as is worn by policemen as a secret sign to fellow members of the force that a crime is being perpetrated. Yes, this young man is an undercover policeman, currently investigating this museum. I know him well, in fact. It's Sergeant John Clay.\nTusspells:\nWhat are you talking about?\nSholmes:\nThe man's quite a celebrity. He received triple accolades at last year's policing awards.\nTusspells:\nBut...\nSholmes:\nNext we turn our attention to the old man sat before him with the particularly unsightly visage. I've been watching closely and he hasn't moved a muscle. Almost, in fact...as if he were a waxwork.\nTusspells:\nAh! But, but you...\nSholmes:\nYour reaction only confirms my suspicions, madame. I noticed it at once, of course... Observe! The telltale sign that instantly proves whether or not this old man is a waxwork is the obvious price tag! 'Thruppence'...? A tragically low price, you might say. Though perhaps the going rate for ageing waxworks riddled with cracks. And yet you sold it to the portly gentleman for an exorbitant two hundred pounds! The sort of plucky behaviour that's sure to attract the attention of Scotland Yard... Isn't that so, madame?\nTusspells:\nI, I do not...\nSholmes:\nYes, the waxwork you sold has already been seized by the police and remains in their custody as we speak! The old man must be reunited with his grave in the special exhibit, and not a moment too soon!\nTopic 2\nWaxwork Location\nConclusion\nDiscovered already\nSholmes:\nThus concludes Herlock Sholmes's great deduction...of this horrifying puzzle!\nRyunosuke:\n.........\nIris:\n.........\nTusspells:\n.........\nSholmes:\nI see I've stunned you all into silence.\nIris:\nYou have, Hurley, you have. And you've obviously upset this young lady in the process. Her cauldron looks awfully hot...\nRyunosuke:\nUm...if I could just bring up one point, Mr Sholmes?\nSholmes:\nAh! The notorious Naruhodo 'one point'! I'm all ears, my dear fellow!\nRyunosuke:\nAccording to your deduction, then, the special exhibit featured this old policeman. So...that would mean that he's the particularly ruthless murderer, wouldn't it?\nSholmes:\n......... The killer policeman, Ottermole.\nRyunosuke:\nSorry?\nSholmes:\nIt was a mysterious series of murders that rattled the capital only last year. The police rushed to the scene every time, only to find the culprit had disappeared into the aether.\nIris:\nAnd it turned out the culprit was a policeman himself! A senior officer by the name of Ottermole!\nRyunosuke:\nSo you mean that's who the sinister-looking old man there is supposed to be?\nSholmes:\nIndeed. It is a particularly grim face, is it not? Unforgettable, in fact. Yes, I remember that odious countenance only too well.\nRyunosuke:\nBut is two hundred pounds a lot of money for a wax model?\nSholmes:\nIt would be enough to afford one of the latest steam carriages, if that puts things in perspective?\nRyunosuke:\nS-So...it is quite a lot then.\nTusspells:\n......... Is there anything else you wish to add? Before I melt you down.\nRyunosuke:\n(That bubbling wax is looking more and more ominous...)\nIris:\nUgh...the smell of all that molten wax is starting to worry me.\nRyunosuke:\nMr Sholmes did more or less just accuse her to her face, so... I think I might have to call on your assistance here, Iris, if that's alright? To make some minor corrections to the great detective's great deductions...\nIris:\nOf course it's alright! We'll soon set things straight!\nRyunosuke:\nWell...let's get started then, shall we? Before Madame Tusspells vents her anger!\nSholmes:\nJust what I was waiting to hear, my dear fellow! So, Madame Tusspells, in accordance with our agreement... ...you shall now have the pleasure of seeing this famously great detective - and temporary exhibit - at work.\nCourse Correction\nHold it, Mr Sholmes!\nTopic 1\nWaxwork's Fate\nConclusion\nSold for cash\nSholmes:\nTo begin with, we must ask ourselves what exactly is afoot here in this museum? The answer is revealed by the bundle of banknotes protruding so helpfully from your bag. In my estimation, some...two hundred pounds.\nTusspells:\nThat, that is all my own money!\nSholmes:\nSo what does this large sum of money reveal? Ah, not as much as the involuntary glance you cast, it would seem, Madame Tusspells. Yes, the answer lies where your eyes now fall. The significance of the two hundred pounds is revealed by that public notice!\nRyunosuke:\nShe definitely looked in this direction, it's true.\nIris:\nBut I'm not sure she'd sell any of her waxworks, even for two hundred pounds.\nRyunosuke:\nOh?\nIris:\nShe must pour her heart and soul into making them, don't you think? Over and above the wax. If it were me, I wouldn't sell them for anything.\nRyunosuke:\n......... (For that much money, I would! ...But it sounds like that makes me a bad person.) W-Well anyway... ...I wonder if the two hundred pounds could have some other significance.\nIris:\nLet's follow that furtive glance again and see if there's anything else that could explain it!\nThe significance of the two hundred pounds is revealed by that public notice!\nIris:\nJudging by appearances... ...this man and the two hundred pounds are in no way related at all.\nRyunosuke:\n(The poor man was just in the wrong place at the wrong time, it seems...) But there's no doubt that Madame Tusspells did react to what Mr Sholmes said. The way she automatically looked over this way must tell us something, I'm sure.\nIris:\n...Then let's have more of a look around!\nRyunosuke:\nThe significance of the two hundred pounds is revealed by that ransom note!\nSholmes:\nQuite so. And we must congratulate these criminals on their inventiveness, abducting a waxwork.\nTusspells:\nAgh!\nSholmes:\nTwo hundred pounds is no small ransom fee. Yet you clearly intend to pay it.\nTusspells:\nThe model in question has...special importance. So I put together all the money I have...\nSholmes:\nIn summary, then! The two hundred pounds you have in your handbag...is ransom money! Now...let us explore the next curiosity with which we are presented. Who is the portly gentleman stretched out so peacefully on the floor?\nTusspells:\n.........\nSholmes:\nIt would appear the man has suffered a severe shock. The cause of which...is clearly known to you.\nTusspells:\nAh!\nSholmes:\nUnfortunately, madame, keeping secrets does not appear to be your forte. What dealt the man such a shocking blow was of course... the two hundred pounds!\nRyunosuke:\nSo if the waxwork was kidnapped, where does that leave us in terms of who this man is?\nIris:\nWe could just ask him when he comes around.\nRyunosuke:\n...I think the point of this exercise is to understand the beauty of the deduction process, Iris.\nIris:\nYes, you're right. Hurley's trying so hard, we mustn't let him down.\nRyunosuke:\nWell, there's little doubt that he suffered a shock. That much seems clear. But in that case, what's Madame Tusspells trying to hide? Let's have a closer look around...\nWhat dealt the man such a shocking blow was of course... the two hundred pounds!\nRyunosuke:\nIt must have been a considerable blow to have knocked the man unconscious.\nIris:\nYes, he looks like a very sturdy man, doesn't he? Ooh! Perhaps he was struck on the back of the head with something hard?!\nRyunosuke:\n...Don't sound so excited about it, Iris. (Whatever did leave the man out cold like that, it must have been quite something...)\nRyunosuke:\nWhat dealt the man such a shocking blow was of course... the waxwork hand!\nSholmes:\nIndeed. With a solid waxwork limb, one could deliver a very substantial blow.\nTusspells:\nHow, how could you...?\nRyunosuke:\nThe hand protruding from the bottom of your cape... It ought to be a right hand, but closer inspection reveals that in fact, it's a left hand.\nTusspells:\nAh!\nSholmes:\nAnd somewhat masculine as well. In other words, it does not belong to you, madame. It is the hand of a waxwork model!\nTusspells:\nKYAAAAAAH! Some of the visitors to my museum can be...troublesome. They meddle with the exhibits and cause damage.\nRyunosuke:\nSo you mean, that arm...?\nTusspells:\nYes. This gentleman saw fit to try to remove it as a souvenir.\nSholmes:\nHm, no small keepsake.\nRyunosuke:\nLike taking a whole branch of a cherry tree when you go to view the blossoms...\nTusspells:\nI am afraid I had to teach the man a lesson.\nRyunosuke:\nYou confronted the man and tried to take the arm back.\nSholmes:\nAnd the result? The scene we see before us. He was knocked unconscious. A point we may need to revisit later. But for the time being, we have our conclusion: Yes, the killer in this special exhibit has been kidnapped!\nTopic 1\nWaxwork's Fate\nConclusion\nSold for cash\nKidnapped!\nSolved\nTopic 2\nWaxwork Location\nConclusion\nDiscovered already\nSholmes:\nThe question that arises then, is what has become of the waxwork that changed hands? Let us consider that problem for a moment.\nTusspells:\nYou, you cannot possibly...\nSholmes:\nWhat immediately strikes me about this conundrum, is the young man standing over there. Who is this fellow? To find the answer, we need only observe...his neckerchief.\nRyunosuke:\nAccording to Mr Sholmes... ...the yellow neckerchief is a sign to other policemen that some crime is underway.\nIris:\nA way of communicating with his colleagues without revealing his identity, yes. It's a secret that's closely guarded by Scotland Yard.\nRyunosuke:\n...That Mr Sholmes didn't hesitate to give away.\nIris:\nWell, uncovering secrets is in any true detective's nature, of course.\nRyunosuke:\nRight... Anyway, judging from Madame Tusspells's reaction to Mr Sholmes's deduction... ...I think perhaps we might not have identified the man quite correctly.\nWho is this fellow? To find the answer, we need only observe...his neckerchief.\nRyunosuke:\nAccording to Mr Sholmes, this young gentleman is actually a policeman in plain clothes. And the secret scarf sign appears to back that idea up. It does seem plausible.\nIris:\nBut Madame Tusspells's reaction was strange. Which must mean...\nRyunosuke:\n...That we haven't got to the bottom of who or what this man really is yet.\nRyunosuke:\nWho is this fellow? To find the answer, we need only observe...his shoulder stub.\nSholmes:\nNo such boneless human walks this earth. Of that, I can assure you. In other words, the man standing here - the young Sergeant John Clay... ...is in fact, defying all odds, a waxwork model!\nRyunosuke:\nI seem to remember it was you who concluded he was a real person in the first place, Mr Sholmes.\nTusspells:\nHe has become quite a celebrity in London, being the winner of no less than three policing awards last year. I simply had to make a model of the man.\nSholmes:\nNaturally! What other explanation could there be?\nRyunosuke:\nAnd it was this detective's arm that was pulled off by the man on the floor in the special exhibit, wasn't it?\nSholmes:\nNext we turn our attention to the old man sat before him with the particularly unsightly visage. I've been watching closely and he hasn't moved a muscle. Almost, in fact...as if he were a waxwork.\nTusspells:\nAh! But, but you...\nSholmes:\nYour reaction only confirms my suspicions, madame. I noticed it at once, of course... Observe! The telltale sign that instantly proves whether or not this old man is a waxwork is the obvious price tag!\nRyunosuke:\nA killer policeman...called Ottermole, was it? Was he well known?\nIris:\nIt was all over the papers last year. But I can't say I know what he looks like. It's a very low price, though. Thruppence isn't much money.\nRyunosuke:\n(Only enough for a few measly hours of gas in Mr Garrideb's delightful lodgings, in fact...) So this is the special killer taken from the special exhibit...is it? The waxwork that somebody stole from the museum and tried to ransom for two hundred pounds... ...is this crusty old killer policeman Ottermole? Really?\nIris:\nPerhaps we should have a good look around again and see if another idea crops up!\nThe telltale sign that instantly proves whether or not this old man is a waxwork is the obvious price tag!\nIris:\nIf we just poured a little bit of molten wax on him, we'd soon find out if he was real or not.\nRyunosuke:\nYes...you never know, there may be another way. We've already come this far, so maybe we should stick to logical deductions, don't you think?\nIris:\nAlright, if that's the way you want to do it, then we should examine him in more detail.\nRyunosuke:\n(If anyone saw, they'd think we were obsessed with the elderly...)\nRyunosuke:\nThe telltale sign that instantly proves whether or not this old man is a waxwork is the obvious twitch!\nSholmes:\nEven the most realistic waxworks do not exhibit a twitch. In other words, this splendid old man is in fact a genuine member of Scotland Yard!\nRyunosuke:\n...Slight shift in your choice of adjectives, then...\nSholmes:\nAnd there you have it! Well, Madame Tusspells?\nTusspells:\nWell what? It was me who contacted the police and demanded that someone come in the first place. He is clearly fatigued. He is sound asleep.\nRyunosuke:\nBut then, what's this tag about showing a price of three pence?\nSholmes:\nNo doubt the price tag of the muffler, which the old bobby purchased recently at a local market. And I presume you've observed the scarf tied around his arm? Does that not strike you, Mr Naruhodo?\nRyunosuke:\nYes! The secret sign used by detectives to show that some criminal activity is currently underway.\nTusspells:\nOf course. Because, as you know, there has been just such criminal activity happening here. As you deduced from the very beginning, detective.\nSholmes:\nSo, it would seem that we finally arrive at the truth.\nRyunosuke:\nThe waxwork of the especially ruthless killer from the special exhibit has been kidnapped.\nSholmes:\nAnd Scotland Yard are already investigating. But the model's whereabouts remain a mystery. Thus concludes Herlock Sholmes's great deduction...of this horrifying puzzle!\nTopic 2\nWaxwork Location\nConclusion\nDiscovered already\nStill a mystery!\nSolved\n\n\nDeduction CompleteElementary!\nTusspells:\nAll sorts of people visit my museum here. Men and women, young and old. Sometimes they drop in just for a short time on their way back from the pub. I welcome them all. But if anyone tries to damage my exhibits... I do not take it lightly. Anyway... ...your great deduction was even more enchanting than I had been led to believe.\nSholmes:\nIt was a pleasure, my dear madame. I'm gratified that you enjoyed the spectacle. And as for your 'rough customer', I've no doubt he'll regain consciousness shortly and return home. What concerns me more... ...is the waxwork from the special display...if it was indeed genuinely abducted?\nTusspells:\n......... Yes. Tragically, it was...\nSholmes:\nThen I would ask you to recount to us the events surrounding the stolen waxwork. In as much detail as possible, if you please.\nTusspells:\n...Very well. But after I have told you what I know, I must insist that you return to your work.\nSholmes:\n......... The talents of a great detective could be put to better use, I feel, but as you wish...\nTusspells:\nIt was a series of gruesome murders that had all of London gripped in terror a decade ago. After five victims were killed, the man was arrested, and put to death.\nSholmes:\nAnd now he's immortalised here in wax for all Londoners to admire and enjoy! Though of course, he happens to be absent at present, on account of the abduction.\nRyunosuke:\nBut I don't understand. How is all this related to Lord van Zieks?\nSholmes:\n......... You must first understand, my dear fellow, why it is that the Professor earnt such infamy. It was due to the victims he chose. Some of Whitehall's finest.\nIris:\nWhat do you mean, Hurley?\nSholmes:\nThose murdered by the Professor were some of the highest members of the British aristocracy. Members of the nobility. Even royalty. It sent shockwaves through the country's administration.\nRyunosuke:\nMembers of the... Ah! Wait! Of course! What Professor Harebrayne said! Lord van Zieks is from a family with noble blood!\nIris:\nOh gosh!\nSholmes:\nIt was the fifth victim that led to the Professor's arrest. The last of the killer's prey was a young noble by the name of... ...Klint van Zieks.\nRyunosuke:\nNo! I don't believe it! Van Zieks?!\nSholmes:\nI'm sure you can piece together the rest for yourself. In the wake of his older brother's murder, the young Barok pursued a career as a prosecutor. And eventually...became the Reaper we know today.\nRyunosuke:\n......... I had no idea Lord van Zieks had such a tragic past...\nSholmes:\nWell, I'm afraid that's all I can say on the matter. For the time being at least. After all, I have work to do... ...as a waxwork exhibit.\nTusspells:\nI am afraid I shall have to excuse myself as well.\nRyunosuke:\nOh, yes, of course. It's, it's been a pleasure. Thank you.\n???:\n...Well, none of the predicted scenarios I've been analysing involved you coming to visit me here.\nHarebrayne:\nIt's been too long, it really has. I'm delighted to see you, Barok.\nVan Zieks:\nIt's been ten years. And here we are, meeting in a prison of all places.\nHarebrayne:\nI can't forgive myself for what happened to Mr Asman! I just can't! I, I still can't believe it could happen...\nVan Zieks:\n......... Tomorrow the court will decide.\nHarebrayne:\nYes! I have a young Eastern man acting for my defence. He seems reliable enough, though. It, it was an accident. A terrible accident. He, he, he assures me he can prove it!\nVan Zieks:\nI must warn you...\nHarebrayne:\nOh, I know, I know! I've heard already. You're going to be prosecuting, aren't you?\nVan Zieks:\n...Yes.\nHarebrayne:\n......... Since I returned to England, I've heard lots of stories. Barok, are you really...?\nVan Zieks:\nWhat?\nHarebrayne:\n......... Never mind. I know that you have my best interests at heart.\nVan Zieks:\nMy friend is on trial. ...I wouldn't entrust it to anybody else.\nHarebrayne:\nOf course. I fully understand. Thank you, Barok.\nVan Zieks:\nUntil tomorrow, then. I'll see you in court.\nTo be continued...23rd October, 8:52 a.m.\nThe Old Bailey, Defendants' Antechamber\nRyunosuke:\n(I can't believe it's been six months since I was last allowed to work in court. And now here I am, back at the Old Bailey...)\nHarebrayne:\nAh! M-Mr Naruhodo!\nRyunosuke:\nGood morning, Professor Harebrayne.\nHarebrayne:\nI, I don't understand! It doesn't make any sense! The atmospheric pressure in here is off the charts! I've never felt anything like it! It's, it's crushing me!\nRyunosuke:\nI feel it every time I'm here. That...gravity.\nHarebrayne:\nWell, this is Britain's highest court... But are you telling me it's filled with some kind of device that can actually control air pressure?!\nRyunosuke:\n......... I think it's probably all in the mind.\nHarebrayne:\nAh. Yes, well...you won't let me down, will you, Mr Naruhodo? I'm counting on you in today's trial...to save my life! To save the secret of my super-high-voltage instantaneous kinesis machine from being made public!\nRyunosuke:\nYes, I understand. (I know what I have to do. I have to establish that the explosion two days ago was nothing more than an unfortunate accident.)\nHarebrayne:\nWell, I'm sure there's nothing to worry about, really. Justice will prevail!\n???:\nMy commiserations, Mr Naruhodo. You appear to have been lumbered with a most tiresome case here.\nRyunosuke:\nMr Sholmes! I didn't expect to see you here.\nIris:\nThat was very mean, Runo, leaving me alone at home with Hurley. It took me at least an hour to wake him!\nHarebrayne:\nAh... Oh... Ah... Is it...? Are you...? HEEEEEERLOCK SHOOOOOOLMES?!\nSholmes:\nIndeed, sir. I am he. Heeeeeerlock Shoooooolmes.\nHarebrayne:\nOh, I've heard all about your exploits, even whilst living in Germany.\nIris:\nAh yes. Randst Magazine is on sale in Germany, too.\nHarebrayne:\nThis month's instalment was sublime! Your deduction in 'The Adventure of Silver Blaze' was wonderful!\nSholmes:\nAh yes, a memorable case indeed. It concerned a snake, I seem to recall.\nIris:\nNo, that was 'The Speckled Band.'\nRyunosuke:\nWell, thank you for coming. I do appreciate your support.\nSholmes:\nI'm sorry to disappoint you, my dear fellow, but I'm afraid I can't stay.\nRyunosuke:\nOh.\nSholmes:\nI have urgent business at Madame Tusspells.\nRyunosuke:\nYou mean...your waxwork job?\nSholmes:\nNo no, the waxwork abduction, of course. Madame has engaged my services.\nRyunosuke:\nAh, so you're trying to get to the bottom of that ransom note, are you?\nSholmes:\nThe week's wages depend on it! ...As does the safe return of the waxwork, naturally. As such, I intend to give it my undivided attention.\nRyunosuke:\nOh, well, never mind then. I understand.\nSholmes:\nOf course, with my skills of observation and reasoning, resolving the matter will be as easy as proverbial pie. I shall return forthwith. For until I solve the case, I shall have no money to afford a pie of any description.\nIris:\nOoh, then you must absolutely give it your full attention, Hurley!\nSholmes:\nQuite, Iris, quite. But life is riddled with irony, you know. Whenever I give something my full attention, I have a quite insatiable desire for a pie. One of the universe's intractable mysteries, you might say.\nHarebrayne:\nOh yes! Quite! Definitely! Absolutely! I totally understand!\nRyunosuke:\n(...Is someone a little starstruck?)\nSholmes:\nI wish you the very best of luck, Professor Harebrayne.\nHarebrayne:\nOh! Ah! Ooh! Why, thank you!\nSholmes:\nBefore I depart, Mr Naruhodo...a word in your ear, if you please?\nRyunosuke:\n...? What's this about?\nSholmes:\nAs you have remarkably little grounding in science, I feel I ought to inform you... As compelling as this 'super-high-voltage instantaneous kinesis' hypothesis may be... ...a practical implementation, such as was attempted by the professor at the Great Exhibition, is quite impossible.\nRyunosuke:\nBut, but the professor said the demonstration was a success!\nSholmes:\nYes, it would appear that he fervently believes it was.\nIris:\nI've read Professor Bunnybrain's paper about it, too, Runo. And I have to say... ...I'm sure it can't be done. It could barely be done theoretically, let alone practically.\nRyunosuke:\n(So he's completely barking up the wrong tree?) But how could an experiment that had no possibility of succeeding in fact succeed? That's contradictory.\nSholmes:\nAnd it's that contradiction that will be at the heart of the trial, I've no doubt.\nRyunosuke:\n(What's that supposed to mean?)\nSholmes:\nNow, I must hurry along. I wish you the best of luck, my dear fellow.\nIris:\nSee you later, Hurley! Well, it looks like you're on your own today, Runo. But chin up! You can do it!\nRyunosuke:\nOh! What about you, Iris?\nIris:\nAh, no, I'm afraid I can't help. I have something I need to do.\nRyunosuke:\n...I see.\nIris:\nHehe! It's going to be a big surprise for you when you find out what it is!\nRyunosuke:\nHaah... (That sounds ominous...)\nBailiff:\nCounsel for the Defence! And the defendant! Court is about to be in session. Make your way into the courtroom at once!\nRyunosuke:\nWe're on our way! (An experiment that the laws of science say can't possibly succeed... ...and a scientist who's convinced that it did. That's the riddle you have to unlock here, Ryunosuke! That's the key to this case!)\n23rd October, 9:10 a.m.\nThe Old Bailey Courtroom\nJudge:\nIn the name of Her Majesty the Queen, I hereby declare this court to be in session. We are sitting today for the public trial of Professor Albert Harebrayne. I now call upon the counsels for the prosecution and defence to declare their willingness to proceed.\nVan Zieks:\nThe prosecution is ready.\nRyunosuke:\nThe defence is... The defence is ready, My Lord! ......... (I'm six months out of practice. And what's more... ...I'm without Susato-san today.) ......... (Ugh... Is it just my imagination, or does the air in here feel even more oppressive than usual?)\nJudge:\nSo... ...I must say I recollect the victim of this case all too well. Mr Odie Asman.\nVan Zieks:\nMr Asman was well known as a financier...though that was merely a front for his diverse criminal activities.\nJudge:\nIt was only a month ago that the man appeared in court prosecuted by you, Lord van Zieks. But the jury unanimously found him not guilty.\nRyunosuke:\n(Because every member of the jury had been bribed, by the sound of it. These powerful London criminals are prepared to go to extreme lengths to keep their freedom.)\nJudge:\nBut two days ago, on 21st October, Mr Asman met his end. The work of the Reaper, was it?\nVan Zieks:\n......... If that is how Your Lordship would describe divine retribution... But the fact remains that Mr Asman's death... ...was a direct result of the actions of the accused, Professor Harebrayne.\nJudge:\nVery well, then. Now, ladies and gentlemen of the jury... You have been selected at random to represent the will of the people. Are the six of you ready to fulfil your societal duty?\nJuror No. 1:\nI'm most gratified to have been selected to carry out this important civic duty, My Lord.\nJuror No. 2:\nTo have a man's fate in the palm of one's hand... Oh gosh! Oh golly! It sends shivers down my spine.\nJuror No. 3:\nScience experiments, magic, conjuring tricks, courtroom trials... All are nothing more than performances.\nJuror No. 4:\nAny spurious scholar that defiles the reputation of science deserves to hang!\nJuror No. 5:\nUm, we 'ave to listen to what's said on both sides 'the fence, and um...then settle on one... That's it, isn't it?\nJuror No. 6:\n......... Wasn't like this in my day! Wasn't like this at all!\nRyunosuke:\n......... (That's...that's... ...the police killer Ottermole look-alike...again. And he's as exhausted as ever, it seems.)\nJudge:\nNow, as I'm sure you are all aware... ...the incident we are here to judge today tragically took place at the Great Exhibition, shortly after its opening.\nVan Zieks:\nThough the death toll could have been far worse. With the exception of the victim, no one was killed. Nevertheless, the dream of the science being exhibited rapidly turned into a nightmare for the spectators.\nJudge:\nA tragic turn of events. And as such, the eyes of all London- No, of the whole world will be on this trial. It is our duty to reach a swift and just conclusion, I feel. So...your opening statement please, Lord van Zieks.\nVan Zieks:\nAt the heart of this incident... ...is technology never before demonstrated anywhere in the world.\nJudge:\nOne of science's latest developments, I take it? The government is keen to capitalise on the Great Exhibition to improve Britain's technological advantage.\nVan Zieks:\nThe technology being demonstrated by the accused was described as 'super-high-voltage instantaneous kinesis'.\nJudge:\nGood Lord!\nRyunosuke:\nIt's designed to 'disassemble' human subjects using extremely high-voltage electricity... ...and 'beam' them instantly to another location where they are subsequently reassembled.\nJudge:\nIs...is such a thing even within the realms of possibility?\nJuror No. 1:\nWell I don't believe it, that's for sure.\nJuror No. 2:\nDisassembling people with electricity? My goodness! How shocking!\nJuror No. 4:\nHah! The whole idea is absurd! The hypothesis would never stand up to scrutiny!\nJudge:\nSir, I believe you are a fellow of the Royal Society, are you not? An expert in your field?\nJuror No. 4:\nI am, and my word on the matter can be considered final. Instantaneous kinesis is poppycock!\nRyunosuke:\n(So this expert and Mr Sholmes are in agreement. It's impossible...)\nJudge:\nWhat is the prosecution's view on the matter?\nVan Zieks:\n......... The prosecution would assert... ...that the accused's instantaneous kinesis demonstration was a success.\nRyunosuke:\nWhat?!\nJuror No. 4:\nWhat rot!\nJudge:\nOrdaaar! Ordaaar!\nVan Zieks:\nThe professor's hypothesis is currently under investigation by the British government. If it is deemed to have merit, a substantial research grant would be made available. The accused made use of the invention built on his new hypothesis to take Mr Asman's life... ...in order to be the sole benefactor of the grant.\nRyunosuke:\nBut, but...\nVan Zieks:\nThis disastrous demonstration was no accident. It was carefully designed from the outset to end the life of the victim.\nJudge:\nThank you, Lord van Zieks. The prosecution's stance is clear. But you will now bring forth witnesses to substantiate your claims.\nVan Zieks:\n...Gladly, My Lord. Bailiff! Show the first witnesses to the stand!\nVan Zieks:\nWitnesses, state your names and occupations for the court.\nGregson:\nYes, sir! Tobias Gregson, Detective Inspector at Scotland Yard's homicide division. I was on duty at the demonstration on the day in question and in charge of the followin' investigation.\nHarebrayne:\n......... Albert Harebrayne! S-S-Scientist!\nVan Zieks:\nYou were born in England, but have been carrying out research in Germany in recent years. Correct?\nHarebrayne:\nYes. Yes, that's right. After graduating from university here in Britain, I went to work in Germany...and made an amazing discovery! Which is what brought me back! I had to demonstrate my incredible hypothesis at the Great Exhibition!\nGregson:\nWhat you demonstrated was incredible alright. An incredible explosion!\nHarebrayne:\nBut the science! The science was a success! The instantaneous kinesis worked! E-Everyone saw it! They must have done! Yes, there was the terrible accident, but... ...the demonstration of my hypothesis was a success!\nGregson:\nWell, that much is undeniable. As shown in this photograph taken by the Forensic Investigation Team.\nJudge:\nThis was taken inside the Crystal Tower, I take it? The centrepiece of the exhibition, no less.\nGregson:\nThat's right, My Lord. Seems the victim rammed straight into it.\nJudge:\nHm, I see... Very well, submit the photograph as evidence.\nThe photograph of the victim has been entered into the Court Record.\nGregson:\nAs the court's heard, the victim of the incident was Mr Odie Asman. There have been a number of allegations made against the man, but puttin' them aside for the time bein'... ...he was the man who financed the research for the experiment and the demonstration itself.\nJudge:\nI see. So to summarise the situation... ...the defendant is accused of taking the life of the man who funded his work. Would that be correct?\nGregson:\nExactly.\nRyunosuke:\nBut couldn't it be... ...that the explosion was caused by some malfunction in the apparatus used for the demonstration?\nHarebrayne:\nThat's right! That must be it! My splendid machine... My poor, splendid machine...\nGregson:\nYou saw it yesterday, didn't you? We can't even examine the wreckage thanks to the Special Dispensation for Scientific Equipment Act.\nHarebrayne:\nWHAAAAAAAAAT?! The wreckage?! THE WRECKAGE?!\nJudge:\nBut that being the case, how can the facts be established? How can it possibly be determined whether this was an accident or a deliberate and malicious act?\nVan Zieks:\nExtremely simply, My Lord.\nJudge:\nI beg your pardon?\nVan Zieks:\nIsn't that right, witness?\nHarebrayne:\nWha...? Sorry? ME?!\nVan Zieks:\nNo. Your neighbour.\nGregson:\nYes, sir! It was murder, plain and simple. Anyone could state that with complete certainty.\nRyunosuke:\nWhat?! (How can he possibly think that?)\nJudge:\nThank you, Inspector. I think we had better proceed to formal testimony. You will explain to the court on what grounds you claim this experiment to have been a front for murder!\nWitness Testimony\n- A Front for Murder -\nGregson:\nThe corpse that went crashin' through the Crystal Tower had a broken neck.\nHarebrayne:\nI, I made a minor miscalculation in the angle of the beam projection, that's all! That was my mistake!\nGregson:\nBut the post-mortem examination revealed another injury. A fatal wound.\nThere was a lesion in his chest where he'd clearly been stabbed by somethin' sharp right in the heart!\nSo the victim was killed before he went anywhere. And this fella's the only one who could have done it!\nJudge:\n......... An extraordinary business... In addition to suffering a broken neck, the victim was stabbed in the heart?\nRyunosuke:\n(Information I would really like to have heard from someone other than the judge...)\nGregson:\nThe coroner says death would have been all but instant from a wound like that.\nVan Zieks:\nYou could say, in fact... ...that the victim was killed twice by the accused.\nHarebrayne:\nNo, no and no! That couldn't be further from the truth!\nGregson:\nI have here the experiment plan document that was submitted to the security team. The victim stood himself inside somethin' called 'the birdcage', ready to be 'beamed' instantly... ...to the second level of the Crystal Tower, about twenty-five yards away.\nVan Zieks:\nThe experiment did not go according to plan, however. As the machine was put into operation, there was a large explosion. The blast caused the beam transmitter to point higher than intended. Accordingly, the kinesis resulted in the birdcage materialising in mid-air... ...from where it subsequently fell, crashing through the glass of the Crystal Tower's large round window.\nJudge:\nMy word... One assumes the victim's neck was broken upon impact with the tower, then?\nHarebrayne:\nI'm, I'm so sorry! I didn't mean for this to happen! The machine was just too powerful! But honestly! Really! I swear! It was just an accident! A terrible accident!\nVan Zieks:\nUnfortunately, that excuse can't save you.\nGregson:\nNo, not considerin' the sharp murder weapon that pierced the victim's heart.\nHarebrayne:\nM-Murder weapon?! What are you saying?!\nVan Zieks:\nThis is the autopsy report submitted by the coroner. The prosecution would like it entered into the Court Record.\nJudge:\nYour request is granted, Counsel.\nThe autopsy report has been entered into the Court Record.\nJuror No. 4:\nI was there in person, you know. I saw the whole ludicrous performance. And the only other person on the stage with Mr Asman was that disgraceful excuse for a scientist!\nJuror No. 2:\nThen really, by all accounts it must have been him.\nJuror No. 1:\nHmph. Hard to think otherwise, really.\nJudge:\nVery well. Counsel for the Defence...proceed with the cross-examination, please.\nRyunosuke:\nOh, yes, My Lord! (I need to focus here... It's been a while!)\nCross-Examination\n- A Front for Murder -\nGregson:\nThe corpse that went crashin' through the Crystal Tower had a broken neck.\nHarebrayne:\nI, I made a minor miscalculation in the angle of the beam projection, that's all! That was my mistake!\nGregson:\nBut the post-mortem examination revealed another injury. A fatal wound.\nGregson:\nThere was a lesion in his chest where he'd clearly been stabbed by somethin' sharp right in the heart!\nGregson:\nSo the victim was killed before he went anywhere. And this fella's the only one who could have done it!\nGregson:\nThe weapon the victim was stabbed with must have been left in his body whilst he was beamed through the air!\nRyunosuke:\n(So that's all the testimony I have to work with... I had no idea the victim had been stabbed. That changes everything... Did van Zieks keep that to himself until now on purpose, to gain the advantage? Oh well...I suppose all I can do is press these witnesses for as much new information as possible.)\nRyunosuke:\nYou say that while the weapon remains in the body, there's very little bleeding... Is that unequivocal?\nGregson:\nLook, there was no blood on the experimentation stage, even though that's where the fellow was stabbed. The only explanation for that is if the screwdriver was still in his body, stoppin' any heavy bleedin'.\nVan Zieks:\nIt's common medical knowledge, my learned friend. Even on your side of the world.\nRyunosuke:\n......... Yes, but about this screwdriver... The thing is, we actually saw it at the scene ourselves. On the experimentation stage.\nVan Zieks:\nWhat?\nRyunosuke:\nIt was on the floor by the wreckage of the machine, poking through a metal grille. I went to pick it up, but the detective here stopped me. Isn't that right, Inspector Gregson?\nGregson:\nAh, well, um... Now you come to mention it, yes...\nVan Zieks:\nInspector, are we to understand that you permitted the defence counsel to investigate? That you contravened the Special Dispensation for Scientific Equipment Act?\nGregson:\nEh? No! Not at all! I, I wouldn't do that! I just let him look, nothin' more! I was very clear he wasn't to touch a thing!\nRyunosuke:\nYes, that's true. This screwdriver was in plain sight on the stage. But it shouldn't have been, should it?\nGregson:\nWh-What are you gettin' at?\nRyunosuke:\nIf this tool had still been in the victim's body when the victim was beamed away by the machine... ...then it shouldn't have still been on the stage.\nGregson:\nAh!\nRyunosuke:\nThat's right! It should have been beamed across to the Crystal Tower along with Mr Asman... ...and been found still lodged in the victim's chest!\nGregson:\nUgh... UWAAAAAAAAAGH!\nJudge:\nOrdaaar! Ordaaar! ...How do you explain this, Inspector?\nGregson:\nI...well...um... I don't...\nRyunosuke:\nIt looks as though everything that the victim had on his person moved with him when he was 'beamed'. If the screwdriver was still in his chest when the instantaneous kinesis occurred... ...obviously that should have been beamed to the destination as well!\nGregson:\nYou...\nRyunosuke:\n(This is a strange situation... Even though people are saying that this instantaneous kinesis is a scientific impossibility... ...we're still basing arguments on the assumption that it did actually take place. Alright. Time to tighten the screws here...) My Lord! If the prosecution is unable to explain this inconsistency in its argument... ...we can only conclude that the testimony given in support cannot be relied upon!\nVan Zieks:\n.........\nRyunosuke:\n(Lord van Zieks is stumped!)\n???:\nJudge:\n...Do you have something to say, witness?\nHarebrayne:\nYes...I knew it... It bears out... The equations hold... Mr Naruhodo! ...DON'T WORRY!\nRyunosuke:\n...About what?!\nHarebrayne:\nWithout delving into the details, there is no inconsistency!\nRyunosuke:\nWhat?\nHarebrayne:\nEven if Andrew had been lodged in Mr Asman's chest... ...my trusty tool wouldn't have moved. Andrew remaining on the stage is consistent with my calculations!\nRyunosuke:\nWha... WHAAAAAAAAAT?!\nVan Zieks:\nIt would seem your illusions have been...shattered. Clearly we should hear the accused's explanation. ...Or should I say, this brilliant scientist's explanation?\nJudge:\nHmmm...\nRyunosuke:\n(Just when I'd found an inconsistency in the prosecution's argument... Scientists...)\nJudge:\nVery well! The defendant will testify again. Provide us with the scientific explanation as to why the inconsistency asserted by the defence fails to hold!\nHarebrayne:\nIn the name of Apollo, I will, My Lord!\nWitness Testimony\n- The inconsistency Explained -\nHarebrayne:\nTo be clear, I'm still at the stage of gathering data in my research.\nMy hypothesis states the kinesis cannot transport metal, though. Hence the metal weapon would have stayed put.\nIn other words, the point just raised by Mr Naruhodo isn't an inconsistency at all.\nMr Asman was the patron of my research. Without him, my work wouldn't have been possible.\nNow I have a duty to protect the incredible machine that we built together!\nRyunosuke:\n.........\nVan Zieks:\n.........\nJudge:\n......... So, the thrust of your testimony, Professor, is...?\nVan Zieks:\n...That based upon his hypothesis, metal objects cannot be moved by this method of instantaneous kinesis.\nJudge:\nIn other words...?\nVan Zieks:\nIn other words, since the screwdriver is made of metal, even if it remained lodged in the victim's chest... ...its subsequent discovery on the stage despite the victim being found elsewhere is not an inconsistency.\nJudge:\nAnd therefore...?\nVan Zieks:\nAnd therefore Professor Albert Harebrayne could still have been the killer.\nHarebrayne:\nMy great hypothesis holds, you see! We, we had to make the cage used to contain the subject from wood for that very reason.\nJudge:\nI was not addressing you, witness!\nRyunosuke:\nUm...Professor Harebrayne...\nHarebrayne:\nYes?\nRyunosuke:\nWhose side are you on here?\nHarebrayne:\nI don't take sides, Mr Naruhodo! No no no! My only interest lies in upholding my hypothesis! I'm a scientist, after all!\nRyunosuke:\n......... (Is he working for us or against us? It's very hard to tell...)\nVan Zieks:\nLet's see how you cross-examine this testimony, my Nipponese friend.\nHarebrayne:\nYes, fire away, Mr Naruhodo!\nCross-Examination\n- The Inconsistency Explained -\nHarebrayne:\nTo be clear, I'm still at the stage of gathering data in my research.\nHarebrayne:\nMy hypothesis states the kinesis cannot transport metal, though. Hence the metal weapon would have stayed put.\nHarebrayne:\nIn other words, the point just raised by Mr Naruhodo isn't an inconsistency at all.\nHarebrayne:\nMr Asman was the patron of my research. Without him, my work wouldn't have been possible.\nHarebrayne:\nNow I have a duty to protect the incredible machine that we built together!\nRyunosuke:\n(That's the extent of the testimony then... Thank goodness for that. I don't want him doing any more damage. He's already basically proven that he could have been the culprit. But it seems as though all he really cares about is defending his hypothesis. Still, I wonder... What if his hypothesis is just fundamentally flawed?)\nRyunosuke:\nProfessor Harebrayne, you say that according to your hypothesis... ...nothing made of metal can be beamed by instantaneous kinesis using the machine you made. Is that right?\nHarebrayne:\nYes, that's right. Spot on! Exactly correct!\nRyunosuke:\nIn that case...I'd ask you to have a look at this photograph that was taken at the scene. In particular, I'd like you to pay attention to the victim's face. You can clearly see that Mr Asman is wearing a pair of spectacles...with a metal rim.\nHarebrayne:\nWhat? Metal? No... Metal can't... That's not... M-Metal? NOOOOOOOOOOOO!\nRyunosuke:\nWe've already established that the proposed murder weapon, the screwdriver, was found on the stage. However, if your hypothesis correctly predicted that outcome... ...it should also have predicted...that the metal-rimmed spectacles would be found in the same place!\nHarebrayne:\nAAAAAAAAAAAAH! My hypothesis! MY HYPOTHESIIIIIIIIIS!\nRyunosuke:\nProfessor Harebrayne, this isn't easy for me to say... ...but your hypothesis...is clearly flawed!\nHarebrayne:\nUWAAAAAAAAAGH!!!\nJudge:\nOrdaaar! Ordaaar! Ordaaaaaar!!! Counsel, what is the implication of this?\nRyunosuke:\nIf, on the day in question, the alleged instantaneous kinesis never actually took place... ...then it's entirely possible that the victim was killed somewhere other than on the stage. And in that case...someone other than the defendant could have been the culprit!\nHarebrayne:\nBut, but my hypothesis! My hypothesis is sound! I proved it that day! The experiment was a success! The experiment was proof of all my work!\n???:\nJuror No. 4:\nIf I could say something here, in my capacity as a fellow of the Royal Society...\nJudge:\nYes, juror number four? Go ahead.\nJuror No. 4:\nAs a man of science, there's one thing I simply cannot abide... And that's a fraud who PRETENDS to be a fellow man of science!\nHarebrayne:\nWhat? Wait! Great Scott! Are you suggesting my science is suspect?!\nJuror No. 4:\nIt's just been disproved, hasn't it? In front of all of us. In other words, the whole demonstration was a complete nonsense from start to finish! Believe me, my fellow jurors, when I tell you that this man is a heel, a bounder and a fraud!\nJuror No. 1:\nI say the wreckage of that machine should be stripped down and thoroughly examined!\nHarebrayne:\nNooo! Never! That machine is the essence of my entire hypothesis! It's protected by the Special Dispensation for Scientific Equipment Act!\nJuror No. 6:\nWhat the devil is that blasted act all about, eh? Who made up such a daft rule?!\nRyunosuke:\n(I don't like the way this seems to be going... What's the best way for me to help the professor?)\nRyunosuke:\nProfessor Harebrayne has yet to perfect his invention! That would seem to be the case, yes. But even so...\nVan Zieks:\nEven so, what?\nRyunosuke:\nGoing to such trouble and expense to create a fake machine to display in public... He would have absolutely no reason to do such a thing!\nVan Zieks:\nVan Zieks:\nHe had an obvious reason to do exactly that. For the research grant money.\nRyunosuke:\nAh!\nJuror No. 4:\nIf the government was foolish enough to have deemed the man's ridiculous notion plausible... ...he and his conspirators would have received a handsome sum indeed.\nHarebrayne:\nC-Conspirators?\nJuror No. 2:\nWhat would be the value of such a grant? Ten pounds?\nJuror No. 4:\nYou're an order of magnitude out, madam. Five hundred pounds a YEAR!\nJuror No. 5:\nOoh arrrrrr! Ya could live 'andsome on that much for years!\nJuror No. 4:\nThe Society's noticed an increase in bogus public demonstrations in the field of science recently. And plenty of scientists arguing with each other to get the largest slice of the funding cake. People's greed is plenty motive enough for murder, I assure you!\nHarebrayne:\nNo no no! I haven't deceived anyone! Least of all the government! My hypothesis is sound! The science is sound! Please, you must believe me!\nVan Zieks:\nVan Zieks:\nNo matter how unbelievable this hypothesis may seem to you, ladies and gentlemen... ...the fact remains that the victim was transported instantly to the Crystal Tower. Which means that the experiment...was a success.\nHarebrayne:\nAh, Barok!\nVan Zieks:\nAnd therefore... ...the only person who could possibly have committed this murder...is the accused!\nHarebrayne:\nAh. Barok...\nRyunosuke:\n(Where is this heading? I have no idea...)\nVan Zieks:\nMy Lord, if I may...?\nJudge:\nYes, Lord van Zieks?\nVan Zieks:\nThe prosecution would like to summon new witnesses to the stand.\nJudge:\nNew witnesses? What would be the nature of their involvement?\nVan Zieks:\nThey were spectators of the demonstration at the exhibition. Who were occupying special seats.\nRyunosuke:\nEyewitnesses?\nJudge:\nVery well, the court grants the prosecution's request. I should very much like to hear from eyewitnesses to the incident.\nVan Zieks:\nThe prosecution's stance is clear. This experiment was no postiche. The accused killed the financier victim there on the public stage, before the very eyes of the spectators. Now, my learned friend...\nRyunosuke:\nOh! ...Yes?\nVan Zieks:\nIt's time for you to make your own stance clear.\nRyunosuke:\n(There's clearly a flaw in the professor's hypothesis. I can definitely see that. But where does that leave me...?)\nJudge:\nWe shall take a short recess now. During which time, the prosecution will prepare its new witnesses to take the stand.\nVan Zieks:\n...As you wish, My Lord.\nJudge:\nGood. In that case, court is adjourned for twenty minutes.\nTo be continued...\n23rd October, 10:44 a.m.\nThe Old Bailey, Defendants' Antechamber\nHarebrayne:\nM-Mr Naruhodo... ...what on earth were you playing at just now? Or rather... ...WHAT ON EARTH WERE YOU PLAYING AT ALL ALONG?! MY HYPOTHESIS! MY AMAZING HYPOTHESIS! You've been picking holes in it from the start!\nRyunosuke:\nAh, sorry about that.\nHarebrayne:\nBut you promised me! You, you said you'd prove that dratted explosion was an accident, not murder. You said you'd keep my precious invention from falling into anyone else's hands! But all you've done so far is try to undermine me!\nRyunosuke:\n......... Yes, I did make you a promise, you're right. I said that I'd believe in you and fight for your freedom to the very end. But I also told you I was no scientist. I don't understand your hypothesis. The fact is, there's an undeniable flaw in your logic, isn't there?\nHarebrayne:\nAh! But! If I just run through some equations... Yes, you see! It's because my work is incomplete!\nRyunosuke:\nPerhaps it is. Nevertheless...a man died as a consequence, didn't he?\nHarebrayne:\nOh. OOOOOOOOOH NOOOOOOOOO! ......... You're right. You're so right. It's all my fault... And I have no right to blame you for my failures. I'm a disaster! Not just as a scientist...but as a human being!\nRyunosuke:\nWell...that might be a little over the top.\nHarebrayne:\nAnd while we're on the subject... ...wh-what about Barok? He's being awful!\nRyunosuke:\nClaiming his old university friend to be a murderer, you mean?\nHarebrayne:\nHe's a disaster! Not just as a prosecutor...but as a human being! Oh! But no! Wait! He's the Reaper, isn't he? Perhaps he's not classified as Homo sapiens any more...?\nRyunosuke:\n(...Glad that's cleared up...) ......... Can I double-check something with you?\nHarebrayne:\nAh. Yes? What?\nRyunosuke:\nThe machine and demonstration you prepared... They were based entirely on your hypothesis, I presume? There was no...trickery involved?\nHarebrayne:\n......... I drew the plans for the machine with my very own hands. Every line was painstakingly drawn with the firm belief that science is the only future. So yes, it's true that my hypothesis hasn't reach [sic] maturity yet, but please, Mr Naruhodo...you must believe in it.\nRyunosuke:\n......... Alright, Professor, I understand.\nBailiff:\nCounsel! Defendant! The prosecution's witnesses are ready to take the stand. Court is about to be in session again. Make your way into the courtroom, please!\nRyunosuke:\n(It all hinges on that demonstration. If the professor's hypothesis is sound as he claims... ...it leaves him as the only person who could possibly have killed the victim. But on the other hand, Mr Sholmes was adamant...)\nSholmes:\nA practical implementation, such as was attempted by the professor at the Great Exhibition, is quite impossible.\nRyunosuke:\n(So really, what should I be trying to prove here?)\n23rd October, 11:00 a.m.\nThe Old Bailey Courtroom\nJudge:\nIn the name of Her Majesty the Queen, I hereby reconvene the proceedings of this court. Counsels for the defence and prosecution, are you ready for the new witnesses to testify?\nVan Zieks:\nThe prosecution is ready, My Lord.\nRyunosuke:\nAs is the defence, My Lord.\nJudge:\nSo, Lord van Zieks... ...I believe these next witnesses saw the demonstration on the day in question with their own eyes?\nVan Zieks:\nIndeed they did. And as luck would have it, one of them is a police detective. ...So the testimony we are about to hear can be considered highly reliable.\nRyunosuke:\n(Perfect. A detective of all people...)\nVan Zieks:\nThe prosecution's stance remains unchanged. Though it ended in tragedy, the demonstration on the day in question was scientifically sound. And consequently... ...the sole person with the opportunity to have committed this act of murder... ...is the only other individual to have been present on the stage at the time: the accused.\nJudge:\nThank you, Counsel. The prosecution's position is clear. So, bring forth your witnesses now.\nVan Zieks:\nBailiff, show the witnesses in. The witnesses whose proximity to the incident on the day in question will clarify the truth unequivocally.\nVan Zieks:\nWitnesses, state your names and occupations for the court to hear.\nLune:\nMy name is Balthazar Lune. I am...the impresario of all the hot-air balloons in vicinity of the esperimento stage.\nGotts:\nMein name ist Wilhelm Gottsreich Sigismond Ormstein. I have come to see ze Great Exhibition all ze vay from my home in Bohemia. ...I'm very rich.\nGina:\nInspector Gina Lestrade, Scotland Yard. I'm a great detective. Even 'Erlock Sholmes agrees. I was on security duty at the exhibition...and I got to go up in one o' them balloons! It was amazin'!\nRyunosuke:\n(Gina...again. But she did mention that she'd seen the disaster from up in a balloon actually, didn't she? And she clearly loved every minute of it.)\nVan Zieks:\nThere were three balloons flying near the public experimentation stage when the incident occurred. Two of these witnesses were in one such balloon at the time, and saw events unfold from the skies above.\nLune:\nYou make it sound like they were in the clouds. It was only an altitude of circa sixty feet. Very low.\nGina:\nWell ya can't see nuffin' if ya fly too 'igh, can ya?\nRyunosuke:\n(Sixty feet... About eighteen metres, then.)\nJudge:\nThank you for your introductions. Now, you will give your formal testimony for the court. Kindly describe exactly what you witnessed...especially those of you who had a vantage point above the stage!\nWitness Testimony\n- The View From Sixty Feet Up -\nLune:\nIt was an incidente terribile. I am only grateful that my balloons were not damaged.\nGina:\nThere's this huge bang from the stage, and then the next second, another bang in the sky beside us.\nGotts:\nAnd from amid ze smoke...a cage appeared out of nowhere!\nLune:\nThe cage, it fell from the sky like a stone. And crashed into the Crystal Tower!\nGina:\nI didn't get a good look inside the cage, but no one went near it after it crashed into the tower.\nJudge:\n...A most extraordinary collective account, I must say.\nRyunosuke:\nCould I just clarify something? There's a detail in the witnesses' testimony that I've not heard any mention of until now. Specifically, that there were two explosions?\nVan Zieks:\n...More precisely, two explosions in two separate places, yes. When the demonstration began, the balloon carrying the two witnesses was around...here. There were other balloons in the air nearby at the time carrying other passengers as well, to be clear. Then, as power was supplied to the machine for the demonstration, the first explosion occurred. The so-called 'birdcage' that contained the victim disappeared from the stage, and a moment later... ...the second explosion occurred, directly adjacent to the balloon carrying the witnesses. The birdcage appeared at the site of the explosion, subsequently to plummet down into the Crystal Tower.\nGotts:\nI voz very surprised. Suddenly a cage appeared before my eyes viz a person inside. Ze blast voz so hot, but I didn't vant to miss a sing, so I kept my eyes vide! ...I still have lots of money.\nJudge:\n......... Precisely who is this curious infant?\nVan Zieks:\nI'm told he is a young noble of Bohemian royalty. Apparently he disguised himself in order to steal unnoticed into the Great Exhibition.\nGotts:\nJa, I am here in London on a sightseeing trip viz my elementary school.\nVan Zieks:\nWe will have the benefit of a child's point of view in the testimony.\nRyunosuke:\n(Do we really need that?)\nGotts:\nVen I remove my mask, zis is vot I look like.\nJudge:\nAh yes, I see. A delightful face, I'm sure.\nGotts:\nJa, everybody says so.\nRyunosuke:\n(Great disguise, then...)\nVan Zieks:\n...The point is, the testimony of these witnesses further substantiates the facts for the court. Namely, that despite ending in an explosion, instantaneous kinesis was successfully demonstrated. And furthermore, that until the arrival of the police, no one approached the Crystal Tower where the victim fell. Therefore, only the accused, who was with Mr Asman on the stage, could possibly have committed the murder.\nJudge:\nYes, thank you, Counsel. The prosecution's views on the matter are quite clear. So, the defence's cross-examination now, please.\nRyunosuke:\nY-Yes, My Lord!\nCross-Examination\n- The View From Sixty Feet Up -\nLune:\nIt was an incidente terribile. I am only grateful that my balloons were not damaged.\nGina:\nThere's this huge bang from the stage, and then the next second, another bang in the sky beside us.\nGotts:\nAnd from amid ze smoke...a cage appeared out of nowhere!\nGotts:\nIt voz not ze sky zat exploded. It voz a green balloon zat woz next to ours at ze time.\nLune:\nThe cage, it fell from the sky like a stone. And crashed into the Crystal Tower!\nGina:\nI didn't get a good look inside the cage, but no one went near it after it crashed into the tower.\nRyunosuke:\n(The prosecution really is asserting that the demonstration was genuine... But what if it was actually some kind of switch-around trick instead? That would mean that the victim was never actually on the stage in the first place. The two explosions would have thrown everyone watching into a panic for sure. I think I need to find out more about what exactly people saw at the time...)\nRyunosuke:\nMr Lune, in your testimony... ...you said that all three of the balloons you had operating at the time were undamaged.\nLune:\nSi. That is correct. If they had been caught in the esplosiones, it would have been terribile.\nRyunosuke:\nI wonder...if you might know what this is?\nLune:\nAh...I think it may be... Si, part of a balloon. A burnt piece of the fabric of the envelope.\nRyunosuke:\nSorry? The envelope?\nLune:\nPardon. That is the large, round part of the balloon which becomes filled with hot air. It is made from very thick fabric lined with rubber. You do not want it to rip when you are in the sky.\nRyunosuke:\n(Just as I thought...) This piece of cloth was found near the experimentation stage. In other words, as Master Gotts testified... ...a green balloon did indeed explode that day.\nLune:\nEh?!\nRyunosuke:\nIf all the balloons in the sky above the experimentation stage belonged to you, Mr Lune... ...then your statement that they were all undamaged clearly contradicts the evidence!\nLune:\nNOOOOOOOOO!\nIf a balloon exploded that day, why didn't the man say so?\nMaybe everyone on board was killed...\nOh no! Having just spent ten whole pounds for the experience?! How awful!\nSeems to me like those things crash fifty percent of the time anyway...\nVan Zieks:\nVan Zieks:\nThe instantaneous kinesis did occur! But after the explosion on the stage... ...the point of materialisation shifted to a location occupied by a balloon.\nJudge:\nCausing the balloon to explode? Yes, eminently plausible.\nVan Zieks:\nAn unfortunate traffic accident, as it were. But it changes nothing about the pertinent facts.\n???:\nLune:\nThis, I cannot accept!\nRyunosuke:\nWhy not, Mr Lune?\nLune:\nYou are suggesting that I am a liar! That persons died in a balloon incidente!\nVan Zieks:\nThere's no need to get 'fired up', Mr Lune. The victim was the sole fatality that day.\nLune:\nThat's right! And I prove it! Balthazar Lune is not a liar! There was no such balloon in the sky! It is non possible!\nRyunosuke:\nYou're saying it's impossible? Why?\nVan Zieks:\nThis court has more important matters to discuss than the number of balloons that were operating that day.\nLune:\nAIIIIIIEEE!\nRyunosuke:\nRyunosuke:\nBut we can't ignore the fact that nobody appears to have known anything about this other balloon until now! My Lord! The defence calls for further testimony from Mr Lune!\nJudge:\nI concur. There is clearly more to the truth here than meets the eye. It's imperative that we clear up the issue of this phantom balloon, I feel. Witness, you will give supplementary testimony about the balloons you were operating at the exhibition.\nLune:\nAh...grazie, My Lord!\nWitness Testimony\n- Mr Lune's Balloons -\nLune:\nAs I said, Balthazar Lune is no liar! Every balloon I had in the sky landed safely!\nAll three of my balloons were carrying passengers. If they fell to the ground in an esplosione, what a catastrofe!\nGina:\nBut ya can't get away from the fact that a burnt-up bit o' cloth was found at the scene, can ya?\nThe coppers at the Yard reckoned it was prob'ly some debris thrown from the explosion on the stage.\nLune:\nThis stupido ragazzo is mistaken! My balloons have the red and blue zigzag stripes anyway!\nJudge:\nHmmm...so your assertion is that the balloon this child saw was not one belonging to you?\nLune:\nSi! Exactamente! If he even saw a balloon in the first place. I do not like the sound of it. It is very bad for business! I have a good mind to sue the land of Bohemia!\nGotts:\nIf you attack us, ve vill fight back! It vill be vor! All out vor!\nRyunosuke:\n(...What happened to 'all out war'? Mr Lune certainly doesn't appear to be lying. But that doesn't change the fact that the testimony and evidence are contradictory here...)\nVan Zieks:\nIf the defence is unable to find fault with the witnesses' statements, the court must consider them the truth. ...Think long and hard on that, my learned friend.\nRyunosuke:\n(The situation has clearly changed now. I have to get to the bottom of what happened here, no matter what it takes!)\nJudge:\nCounsel, you may now cross-examine the witnesses.\nCross-Examination\n- Mr Lune's Balloons -\nLune:\nAs I said, Balthazar Lune is no liar! Every balloon I had in the sky landed safely!\nLune:\nAll three of my balloons were carrying passengers. If they fell to the ground in an esplosione, what a catastrofe!\nGina:\nBut ya can't get away from the fact that a burnt-up bit o' cloth was found at the scene, can ya?\nGina:\nThe coppers at the Yard reckoned it was prob'ly some debris thrown from the explosion on the stage.\nLune:\nThis stupido ragazzo is mistaken! My balloons have the red and blue zigzag stripes anyway!\nRyunosuke:\n(As I thought, Mr Lune's testimony just doesn't quite add up... The young Bohemian boy claims to have seen another, fourth balloon. But Mr Lune vehemently denies the possibility. And it's hard to imagine the man in charge could be mistaken about the number that were in the air... Still, this inconsistency must tell us something, I'm sure.)\nRyunosuke:\nUnfortunately, the photograph Master Gotts took can't tell us the colour of the balloon. But it can tell us something else. Something crucially important.\nVan Zieks:\nWhat?\nRyunosuke:\nIt shows that the pictured balloon...wasn't carrying any passengers.\nJudge:\nAh! My goodness, you're right! But surely all the balloons would have been carrying passengers? There would be no sense in it otherwise.\nLune:\nS-Si! They are for pleasure! For seeing the view! MY balloons only fly with passengers!\nRyunosuke:\nWhich tells us that the pictured balloon isn't one of them. So when the incident occurred that day... ...there WAS a fourth balloon in the skies above the experimentation stage! The mysterious green balloon!\nLune:\nI, I know nothing! Niente! I, I can only tell you one thing... If this balloon was not carrying passengers, then it was not one of mine!\nVan Zieks:\nVan Zieks:\nThere are illegal tradesmen everywhere you care to look. Clearly one such 'entrepreneur' decided to capitalise on the opportunity presented by the Great Exhibition. And managed to operate balloon flights on Mr Lune's patch without him realising.\nLune:\nSi... Si! The competizione...trying to steal my profits! I did not notice because of the esperimento that went wrong on the stage!\nRyunosuke:\nThis fourth balloon exploded at the very same moment Mr Asman was 'beamed' from the stage below.\nGina:\nRight...so them scraps that fell to the ground after, an' left them scorch marks... They didn't come from the stage at all! It was bits o' the balloon rainin' down! But cos no one was in it, it didn't get no attention.\nRyunosuke:\n(A mysterious fourth balloon carrying no passengers, silently floating over the experimentation stage...)\nVan Zieks:\nVan Zieks:\nThis photograph shows us nothing more! A stray balloon carrying no one and operated by some rogue trader. Clearly it has nothing to do with the case.\nJudge:\nHmmm... Its relevance does elude me, I must say.\nVan Zieks:\nThe court has seen sufficient evidence and heard ample testimony already. The prosecution calls for this trial to be concluded!\nRyunosuke:\n(Really? Have we really got to the truth yet? No, I can't let this opportunity slip away. The jurors' minds are made up...and not in our favour! What else can this photograph tell us? Is there nothing more we can learn from it?)\nRyunosuke:\nLadies and gentlemen of the jury, wait! Please don't give your decisions yet! The photograph from Master Gotts... ...may well be hiding one more vital clue!\nJuror No. 1:\nWhat's that?!\nJuror No. 3:\nA vital clue?!\nVan Zieks:\nVan Zieks:\nWe're well past the point of mere possibilities. It's time for definitives now. So tell the court... What exactly does this alleged clue in the photograph prove?\nRyunosuke:\nWe can reasonably assume that the pictured balloon was destroyed in the searing heat of the explosion.\nGotts:\nJa! Zat's right! Ja! It voz not my fault!\nVan Zieks:\nEvidently. Because the birdcage from the kinesis machine materialised in the sky where it had been flying. And the balloon, being filled with flammable hydrogen, instantly and explosively ignited.\nRyunosuke:\nRyunosuke:\n...No, that's not what happened.\nVan Zieks:\nWhat?\nJudge:\nIt would appear that this photograph requires closer examination. Counsel for the Defence, you will highlight the location of this alleged 'clue' in the photograph for the court.\nRyunosuke:\nOf course, My Lord. (If you look closely, it's plain enough to see. And what's shown is linked to another piece of evidence we have. In a way that leads to an unbelievable conclusion!) The clue that heavily suggests the real reason the balloon exploded is...\nRyunosuke:\nThe timing of this photograph can only be described as miraculous. If you look, you'll notice there's a bright white line that appears to point directly at the balloon.\nVan Zieks:\nMost likely a ray of light caught incidentally on the film.\nJudge:\n...I'm afraid I can see nothing of the sort.\nRyunosuke:\nIf you look with a magnifying glass, My Lord, it becomes clear what the nature of this bright line really is.\nGoodness, what is that?\nJuror No. 4:\nUndeniably some flash of light, yes.\nJuror No. 2:\nOh golly. Do, do you think it might be lightning?\nJuror No. 1:\nBut it couldn't have been a finer day.\nJuror No. 3:\nI believe we may be looking...at fire!\nJuror No. 6:\nA bolt of fire, heading straight for the balloon...like an arrow!\nJudge:\nIndeed. Even to my ageing eyes, it would appear to be a flame of some sort. My word! Are, are you suggesting this flame struck the hydrogen gas that filled the balloon?!\nVan Zieks:\nVan Zieks:\nThat's absurd! The balloon would have been sixty feet above the ground at the time. No flame could possibly have reached such a height.\nRyunosuke:\nRyunosuke:\nActually, it's my opinion... ...that a particular piece of evidence found at the scene reveals how that is exactly what did happen.\nVan Zieks:\nWhat evidence?!\nJudge:\nIf such evidence exists, Counsel, then for goodness' sake present it, man! Which evidence explains this mysterious streak of flame that appears to be headed directly for the balloon?\nRyunosuke:\nThis was found hidden at the foot of a small ornamental tree near the scene.\nJudge:\nGood Lord! Is that a crossbow?\nRyunosuke:\nAn arrow dipped in oil and set alight could have been shot from this weapon... ...sending a flaming arrow straight into the hydrogen-filled balloon!\nVan Zieks:\nAre you suggesting...that crossbow was used to deliberately...?\nGina:\nBlimey, yer right! That streak o' light in the photo looks just like an arrow, dunnit?\nLune:\nThen...the esplosione of the balloon, it was...\nRyunosuke:\n...Very likely the result of a flaming arrow from this crossbow igniting the hydrogen gas inside it!\nVan Zieks:\nNooo!\nJudge:\nOrdaaar! Ordaaar! Counsel, this is an extraordinary supposition!\nRyunosuke:\nIf the aim was to cause the balloon to explode, the shooter could have used a gun of course. However, there's an obvious reason why that would have been out of the question.\nVan Zieks:\nThe noise of the discharge? Of course...\nRyunosuke:\nThat's right. By using a crossbow, the projectile could be fired at the balloon silently.\nGina:\nWell yeah, if someone 'ad shot a gun off in the exhibition grounds, it would've caused a real panic.\nLune:\nBut with the big esplosione, there was a very big panic anyway, no?\nRyunosuke:\n......... (I don't like this. I should be pleased to have found a plausible new explanation for all this, but something feels wrong...)\nVan Zieks:\nVan Zieks:\nDo you understand the implications of what you're saying, my Nipponese friend?\nRyunosuke:\nIf a flaming arrow did indeed hit the balloon, then obviously it would have exploded. And if the birdcage appeared from the cloud of smoke that ensued...\nGina:\nWot? Wait a minute! Wot are ya really sayin' 'ere? I don't get it. Was, was the birdcage beamed up into the sky after all, or...wot?\nJudge:\nMy goodness me!\nRyunosuke:\n......... (Ah, now I understand. That's what that sinking feeling is about...) I think there's a good chance... ...that the birdcage was actually concealed inside the balloon all along.\nJudge:\nWhat?! Did, did I just hear that correctly, Counsel?\nRyunosuke:\n(There's no going back now. The horse has bolted...) Let's assume, as I said, that the birdcage was hidden inside the green balloon from the start. On stage, when the experiment was started... ...the birdcage in the instantaneous kinesis machine disappeared in a cloud of smoke. At that moment, the flaming arrow was fired from the ground... ...causing the green balloon to explode and drawing the attention of the spectators to the sky above their heads. From amid the smoke, the hidden birdcage then appeared, to fall down and crash into the Crystal Tower. I think you'll all agree it's entirely plausible... ...that what I've just described is the real truth behind the 'miraculous' experiment carried out that day!\nJudge:\nTh-This... I......... GOOOOOOOOOD GRIEF!\nVan Zieks:\nVan Zieks:\nThis is ludicrous! What you've described is no science experiment. It's, it's child's play! A contemptible display of stage magic!\nRyunosuke:\n(Both Mr Sholmes and Iris said that the experiment was a scientific impossibility. In which case, this is the only way to explain what happened that day.)\nVan Zieks:\nAnd in any case...the victim's body was found inside the birdcage in the Crystal Tower. If the instantaneous kinesis didn't take place, how do you explain that?\nRyunosuke:\nAh! Um...\nJuror No. 3:\nIf I may put in a word...as a man of magic myself... Such apparent discrepancies can easily be explained by some simple deception.\nRyunosuke:\nJ-Juror number three!\nJuror No. 3:\nAll that would be needed is a doppelgänger - someone who looked very similar to the victim, Mr Asman... ...and having this other man appear on stage to front the show...as a body double!\nRyunosuke:\nAh...yes! Of course, so in fact... ...Mr Asman must have been inside the birdcage that was concealed inside the balloon right from the start!\nVan Zieks:\nVan Zieks:\nThat balloon would have been filled with hydrogen. Anything hidden inside it would have been scattered to the four winds when it exploded. No one would ever have embarked on such a risky venture.\nJuror No. 4:\nNot necessarily. The explosive force of the balloon gas would very much depend upon the mixture ratio.\nRyunosuke:\nJ-Juror number four!\nJuror No. 4:\nFlying balloons are rarely filled with pure hydrogen, but a mixture of other gases such as helium as well. Helium on its own doesn't explode, but by controlling the gas mixture ratio, the explosive force can be altered.\nVan Zieks:\nThe mixture ratio...?\nJuror No. 4:\nObviously, the victim's body would have suffered some burns. That would be unavoidable. But not to such an extent as to render this whole obscene charade impossible.\nVan Zieks:\n.........\nRyunosuke:\nSo everything that happened can be explained. Logically and scientifically. The explosion that engulfed the stage at the start of the 'experiment' was no accident. It was all part of an elaborate deception...to make it appear that instantaneous kinesis had occurred!\nJudge:\nWell...goodness me...\nRyunosuke:\nAnd if we accept that this is what happened... ...it means that the victim, Mr Asman, was never present on the public experimentation stage to begin with.\nVan Zieks:\nNrgh...\nRyunosuke:\nIn short... ...he couldn't have been killed by the defendant, who was on stage in full view the entire time!\nVan Zieks:\nAAAAAARGH!\nRyunosuke:\n(This will be very hard for the prosecution to counter. Lord van Zieks can't credibly maintain that Professor Harebrayne is a suspect now!)\n???:\nHarebrayne:\nMr Naruhodo...I appreciate your efforts. Thank you.\nRyunosuke:\nP-Professor?!\nHarebrayne:\nBut you can stop now. Just keep your mouth shut, please.\nRyunosuke:\nSorry?\nVan Zieks:\nWhat's all this about...Mr Harebrayne?\nHarebrayne:\n......... I, Albert Harebrayne, hereby confess... ...that it... That it was... That it was me who stabbed Mr Odie Asman! Yes! It was me! With my faithful friend and partner... Andrew the Screwdriver!\nRyunosuke:\nWha......... WHAT ARE YOU DOIIIIIING?!\nJudge:\nOrdaaar! Ordaaar! Ordaaaaaar!!! Defendant! Explain this sudden confession!\nRyunosuke:\nRyunosuke:\nProfessor Harebrayne! What are you talking about?!\nHarebrayne:\nIt's...it's what I've said all along! I must protect my hypothesis! And my precious machine!\nRyunosuke:\n...!\nHarebrayne:\nYou stand there and claim it was all a trick! All an elaborate prank! But where's your proof?! No, y-you'd have to examine the machine if you wanted to prove it. But then it would all be over! My beautiful hypothesis would be laid bare... I mean, the indignity of it!\nRyunosuke:\nIt's clear that you drew the plans for the experiment, but you didn't actually build it. It's quite conceivable that you were duped, Professor. If you'll just let me, I can prove-\nHarebrayne:\nBarok!\nVan Zieks:\nYes?\nHarebrayne:\nI'll cooperate. I'll do whatever you say. I swear it. So, so please... ...ensure the Special Dispensation for Scientific Equipment Act is adhered to and protect my creation!\n.........\nVan Zieks:\n...Pray forgive the discourtesy of filling my hallowed chalice at this critical juncture... Here's to my learned Nipponese friend...\nRyunosuke:\nWha...?!\nVan Zieks:\n...and his upcoming attempt to clarify the defence's position in the light of the accused's confession.\nRyunosuke:\n...!\nVan Zieks:\nDo you intend to formally assert that the experiment was nothing more than a conjuring trick? Because the moment you do... ...the Special Dispensation for Scientific Equipment Act that protects the professor's invention will cease to apply. The prosecution will then demand a rigorous examination of the machinery involved in order to establish the truth.\nRyunosuke:\n.........\nVan Zieks:\nHowever...if you acknowledge that the machine is genuine and instrumental in the victim's murder... ...any chance of investigating will be crushed...and the confidentiality of the professor's hypothesis preserved.\nRyunosuke:\n...!\nJudge:\nWell, Counsel...what is the defence's official position on this matter?\nRyunosuke:\n(What Professor Harebrayne - my client - actually asked of me... ...was to prove that the explosion on stage was an accident and protect the secrecy of his hypothesis. But there's no way to do that without implying the professor's guilt! Do I protect my client's life by asserting his innocence, or do I uphold my client's request but see him condemned? Either way, I can't avoid betraying his trust...)\nVan Zieks:\nYou've been silent long enough! Isn't talking your trade, my learned friend? Or has all knowledge of English escaped your confused Nipponese mind?\nRyunosuke:\n.........\nHarebrayne:\nMr Naruhodo!\nRyunosuke:\n(There's no escape here! I have to make a choice! But it's an impossible one! I have to give up on something...but what?) The defence asserts...that the defendant's instantaneous kinesis machine was in fact...\nRyunosuke:\n......... .........Agh! (No! I can't say it! My client placed his faith in me... I can't just let him down!)\n'What must I give up on?' is not the question you have to ask yourself here. It's 'What can I protect?'\nSusato:\nHello again...Mr Naruhodo. It's been far too long.\nRyunosuke:\nSu... Susato-san! But, but what are you-\nSusato:\nHaiiiiii-YA!\nRyunosuke:\nAAAAAAAAGH! (My first Susato Takedown in six months!)\nSusato:\nThere'll be time to talk later, Mr Naruhodo. For now...we must concentrate on the task at hand!\nRyunosuke:\n(Which is working out not what I have to give up on, but what I can protect!) Professor Harebrayne!\nHarebrayne:\nAh! ...Yes?!\nRyunosuke:\nYesterday you told me that science is the pursuit of truth. Well...my job is to pursue the truth too.\nHarebrayne:\nYes, of course...\nRyunosuke:\nAnd personally, I believe...that you didn't stab Mr Asman. I think you've come to realise something yourself too, haven't you? That your experiment and the machine you built with the victim are questionable! The truth behind that is what we must both pursue now!\nHarebrayne:\nUWAAAAAAAAAAAAAAAAAAAAAAAAGH!\nVan Zieks:\n...So...you've finally opened your eyes.\nRyunosuke:\nWhat?\nVan Zieks:\nAnd as for you... ...Albert. You can't ignore this any longer.\nHarebrayne:\nAh...\nVan Zieks:\nHaving heard my learned friend's assertion... ...don't you have something to say?\nHarebrayne:\n......... B-Barok...\nRyunosuke:\nLord van Zieks...\nSusato:\nGosh, I've never heard him speak that way before.\nHarebrayne:\n......... In truth...there is one thing. Something I've remembered that's of relevance.\nRyunosuke:\nWhat?\nHarebrayne:\nOn the day it happened...just before I began the experiment...I saw a man near the stage. A man holding that crossbow.\nJudge:\nI beg your pardon?!\nRyunosuke:\nProfessor! Did the man have any distinguishing features? What did he look like?\nHarebrayne:\nUh...tall. Taller than me. And, and thin. Thinner than me. With straight hair. Straighter - and whiter - than mine. Let me see... One less lens than me, too. A monocle. A rather stylish, black monocle. But one thing in particular will help to positively identify the man. You see, I know him very well. After all...he's the engineer who built my invention!\nVan Zieks:\nWhat?\nRyunosuke:\nHe...built the machine?\nHarebrayne:\nThat's right. Mr Asman introduced him to me a year ago. He's, he's a man by the name of... ...Enoch Drebber.\nJuror No. 3:\nEnoch?!\nJuror No. 4:\nDrebber?!\nJudge:\nDoes this name mean something? Members of the jury seem flustered...\nJuror No. 4:\nNot a name any scientist wishes to hear. The man's an abomination!\nJuror No. 3:\nNot a name any conjuror wishes to hear, either!\nRyunosuke:\nWho on earth is he?\nJuror No. 4:\nI'm afraid this isn't the first tale of this nature that I've heard in scientific circles in connection with that name. There's talk of other flamboyant experiments that turn out to be nothing but stage trickery in the end. Obviously the rascal is after the government's research grant money.\nJuror No. 3:\nWhen magicians are in need of money, I have heard of them resorting to these underhand tactics. Some acquaintances of mine with...experience of such things have mentioned Enoch Drebber's name before.\nJuror No. 4:\nThe man is both an engineer and a magician. Yes, we're dealing with an unparalleled confidence trickster here! That's Enoch Drebber for you!\nHarebrayne:\nSo it's true then... My invention... My great machine... It was just a grand illusion?\nRyunosuke:\nConsidering what we've just heard about Mr Drebber's character... ...I'm sorry to say that sounds increasingly likely.\nHarebrayne:\nEven though no one else believed it...I wanted to. I wanted to believe that machine would function exactly as my hypothesis predicted.\nVan Zieks:\nWhich is why you were so opposed to it being investigated, I presume.\nHarebrayne:\nI knew that if the machine was examined in detail, its construction would give away my hypothesis. Obviously, I didn't want that to happen. But at the same time... ...I knew that if it was found to be nothing more than a trick... Than a work of deception... ...then everything I'd worked towards...all my research... all my dreams...my whole life would be over! I was terrified at the prospect.\nRyunosuke:\nSo you really had no idea, then, did you? About the true nature of the machine that was built. And the true nature of Mr Drebber.\nHarebrayne:\nI never questioned anything. I, I didn't want to question it.\nRyunosuke:\nIt's entirely possible that Mr Asman and Mr Drebber... ...were working together to use you as a means of fraudulently acquiring the research grant money.\nHarebrayne:\n.........\n...When I announced my invention to the crowds that day, it was the finest moment of my career. I pulled all the levers and turned all the dials in exactly the way Drebber had described... When the smoke suddenly started billowing out, I panicked. I didn't know what was happening.\nHarebrayne:\nBut I really don't know how the whole illusion was made to work. I...don't know anything any more...\nVan Zieks:\nLet me confirm one final point with you, Professor. Do you now consent to the prosecution submitting the necessary paperwork... ...to release your invention from the protection afforded by the Special Dispensation for Scientific Equipment Act?\nHarebrayne:\n......... Yes, please go ahead. I'm...very sorry.\nJudge:\nIt would appear that we shall have to suspend proceedings for the remainder of the day now. Lord van Zieks...\nVan Zieks:\nMy Lord?\nJudge:\nThe court has newly been made aware of another party whose involvement in this matter is critical.\nVan Zieks:\nYes, Mr Drebber...\nJudge:\nGather information about the man. If possible, I should like him served with a subpoena.\nVan Zieks:\nWith pleasure, My Lord.\nJudge:\nNow, Counsel for the Defence...\nRyunosuke:\nYes, My Lord!\nJudge:\n......... When we reconvene, I shall be looking for one thing and one thing alone from you. Evidence...that the defendant is innocent of the crime for which he presently stands accused.\nRyunosuke:\n...I understand.\nJudge:\nGood. In that case...this court is adjourned until tomorrow morning!\n23rd October, 1:36 p.m.\nThe Old Bailey, Defendants' Antechamber\nHarebrayne:\n......... ...Mr Naruhodo...\nRyunosuke:\nAh! Y-Yes?\nHarebrayne:\nI'm...I'm...I'm... I'm so sorry! I was wrong! You were right! I tricked you! You trusted me! I dragged you...into my mess! Oh h-how did it ever come to this...? I'M SOOO SOOO SOOO SOOORRY!\nRyunosuke:\nDid you really have no idea, Professor? About what Mr Drebber was really up to, I mean? About what he was really constructing.\nHarebrayne:\nNaturally! That machine was the embodiment of my hypothesis! Of all my hopes and dreams! I had complete faith in it!\nRyunosuke:\nAlright. In that case, I won't say any more. Now, sadly the murder accusation against you still stands. So we must do as much investigation as we can before the trial resumes tomorrow.\nHarebrayne:\n......... Well, thank you for doing so much for me!\nSusato:\nI'm so sorry for arriving late this morning, Mr Naruhodo.\nRyunosuke:\nA-Arriving late?\nSusato:\nDidn't you receive my postcard? I wanted to let you know when I'd arrive.\nRyunosuke:\nPostcard? What postcard?\nIris:\nI hid it from you, Runo! So it would be a surprise! ...Well? Did it work?\nRyunosuke:\nI was surprised alright! Especially when she threw me to the ground!\nSusato:\nOh dear! I'm so sorry! I, I was just so happy to see you again that...it sort of slipped out.\nRyunosuke:\n(Maybe we could stick to more traditional displays of emotion in future...?)\nIris:\nSusie's train was late into London Victoria this morning, you see. But we made the coachman really whip the horses hard so she didn't miss the whole trial!\nSusato:\nI was watching from the gallery for a while, but in the end...I'm afraid I couldn't contain myself...\nRyunosuke:\nWell, I'm glad you didn't.\nSusato:\nOh!\nRyunosuke:\nHaving you at my side in court gives me the strength I need to win. So...I'm, um, delighted to see you...back in London.\nSusato:\nOh, you're too kind, Mr Naruhodo! I'm delighted to be here! I hope I can continue to be of service to you.\nRyunosuke:\nOf course. So...what's brought you back? Did Professor Mikotoba not protest?\nIris:\nLet's save all that conversation for when we're back at home, shall we? You know I've made one of my most special blends ever for this special occasion!\nSusato:\nOh, Iris, how wonderful! I can't wait!\nRyunosuke:\nSusato-san was back in London. It's hard to describe how happy that made me feel at the time. But despite my elation... ...our tale was about to take yet another extraordinary turn.\nTo be continued...",
  "characters": [
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Susato Mikotoba",
      "age": "16",
      "description1": "A judicial assistant sent to Britain on a study tour. She's the epitome of a refined Japanese lady and a huge help to me always."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Iris Wilson",
      "age": "10",
      "description1": "An extraordinary young girl who lives with Mr Sholmes. She has a degree in medicine and is the author of a popular series of short stories."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Herlock Sholmes",
      "age": "34",
      "description1": "There's not a person in the world who hasn't heard of this famous great detective, whose deductions never fail to surprise."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Mael Stronghart",
      "age": "53",
      "description1": "The Lord Chief Justice, who wields absolute authority in judicial matters, including the appointment of lawyers. He's a thoroughly intimidating man."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Odie Asman",
      "age": "47",
      "description1": "The man who perished in the explosion on the experimentation stage at the Great Exhibition of London.↳The man who perished in the explosion on the experimentation stage. He was Professor Harebrayne's financial backer and the boss of a large criminal organisation."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Albert Harebrayne",
      "age": "33",
      "description1": "A scientist who invented a machine to demonstrate super-high-voltage instantaneous kinesis. However, it exploded in use, and he is now accused of murder.↳A scientist who invented a machine to demonstrate super-high-voltage instantaneous kinesis. He's the defendant of this case and a friend to Lord van Zieks, apparently."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Barok van Zieks",
      "age": "33",
      "description1": "A prosecutor known as the Reaper of the Bailey. Supposedly, the souls of those he prosecutes are eternally damned, one way or another."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Masked Man",
      "age": "??",
      "description1": "An apprentice of Lord van Zieks whose face is always covered by a mask. He has the air of a completely unassailable man."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Gina Lestrade",
      "age": "18",
      "description1": "A mostly reformed pickpocket who's now a self-appointed 'detective inspector'. She's really making waves in her new apprenticeship."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Tobias Gregson",
      "age": "45",
      "description1": "The detective inspector in charge of Scotland Yard's investigation of the case. He's stern and single-minded in his approach, and a great lover of fish and chips."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Esmeralda Tusspells",
      "age": "26",
      "description1": "The proprietress of the Madame Tusspells Museum of Waxwork and the latest in a line of artisans privy to the secret Tusspells technique of capturing a perfect likeness."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Balthazar Lune",
      "age": "42",
      "description1": "The impresario of short pleasure voyages in flying balloons. The balloons above the experimentation state all belonged to this man."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Bohemian Boy",
      "age": "11",
      "description1": "A young boy who came to London to visit the Great Exhibition. His real name is Wilhelm Gottsreich Sigismond Ormstein.↳A young prince from the royal family of Bohemia with an excessively long name. He witnessed the explosion at the Great Exhibition."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Courtney Sithe",
      "age": "39",
      "description1": "Scotland Yard coroner, leader of the Forensic Investigation Team and one of Lord Stronghart's most trusted allies."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Enoch Drebber",
      "age": "35",
      "description1": "A trickster who seems to be both an engineer and a magician. He constructed the machine for Professor Harebrayne's demonstration."
    }
  ],
  "evidences": [
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Armband",
      "type": "",
      "obtained": "",
      "description1": "An armband I inherited from Kazuma. It identifies the wearer as a defence lawyer throughout the Empire of Japan."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Great Exhibition Newspaper",
      "type": "",
      "obtained": "",
      "description1": "A newspaper containing various articles about the world-leading science and technology on show at the Great Exhibition being held in London."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Experiment Sketch",
      "type": "",
      "obtained": "",
      "description1": "A diagram showing the relative positions of the Crystal Tower and Professor Harebrayne's machine that exploded."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Mysterious Contraption → Crossbow",
      "type": "",
      "obtained": "",
      "description1": "A very curious device found behind a tree under the experimentation stage at the exhibition grounds, almost as if it had been hidden there deliberately.",
      "description2": "A weapon found hidden behind a tree under the experimentation stage at the exhibition grounds. It turns out that it's a folding crossbow.",
      "description3": "A crossbow found hidden behind a tree under the experimentation stage at the exhibition grounds. It belongs to Mr Enoch Drebber."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Piece of Green Cloth",
      "type": "",
      "obtained": "",
      "description1": "A torn piece of canvas-like material backed with rubber that was found under the experimentation stage at the exhibition grounds. There are scorch marks at the edges."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Photograph of the Victim",
      "type": "",
      "obtained": "",
      "description1": "A photographic print of the victim taken after he had ostensibly been 'beamed' to the Crystal Tower. It shows an apparent stab wound to the chest."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Autopsy Report",
      "type": "",
      "obtained": "",
      "description1": "The autopsy report of the victim, Mr Asman. His neck was broken from the impact of a violent fall and he was stabbed in the chest with a sharp object."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Screwdriver",
      "type": "",
      "obtained": "",
      "description1": "Professor Harebrayne's trusty screwdriver that he's named 'Andrew'. There are traces of blood at the tip and it matches the shape of the victim's wound.",
      "description2": "A metal screwdriver that was found poking through the grille in the base of what remains of the kinesis machine. It has a very distinctive handle."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Photograph of the Balloon",
      "type": "",
      "obtained": "",
      "description1": "A photograph taken by Gotts whilst he was riding in a balloon. It shows another balloon that he claims was green and exploded moments after he took this shot."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Drebber's Card",
      "type": "",
      "obtained": "",
      "description1": "Mr Enoch Drebber's business card, though it shows only the man's name. There is no address.",
      "description2": "Mr Enoch Drebber's business card, which lists no address for the man. There is a smear of machine oil on the reverse."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Wooden 'Birdcage'",
      "type": "",
      "obtained": "",
      "description1": "The wooden cage that was used for Professor Harebrayne's experiment. This cage, with the victim inside, crashed down into the Crystal Tower.",
      "description2": "The wooden cage that was used for the demonstration. It crashed down, with the victim inside, into the Crystal Tower causing damage to its base."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Photograph of Drebber",
      "type": "",
      "obtained": "",
      "description1": "A photographic print of the engineer, Mr Enoch Drebber. It's hard to make out, but he appears to be wearing a monocle with black glass."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Camera",
      "type": "",
      "obtained": "",
      "description1": "The camera from around the neck of a waxwork in the Madame Tusspells Special Exhibit.",
      "description2": "The actual camera that Mr Drebber had with him ten years ago when he went graverobbing.",
      "description3": "The actual camera that Mr Drebber had with him ten years ago when he went graverobbing. When the lens is extended, dark staining can be seen on the bellows."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Piece of Broken Glass",
      "type": "",
      "obtained": "",
      "description1": "A small fragment of very unusual and thick glass that was found in the folds of the clothing of the Professor waxwork. It would appear to be from the Crystal Tower."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Science Trophy",
      "type": "",
      "obtained": "",
      "description1": "A Royal Society trophy for excellence in science that was found in Mr Drebber's workshop. It's a very prestigious award for a young scientist."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Waxwork Head",
      "type": "",
      "obtained": "",
      "description1": "The head of the Professor waxwork that was stolen from the Madame Tusspells Special Exhibit."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Killer's Autopsy Report",
      "type": "",
      "obtained": "",
      "description1": "The autopsy report of the mass murderer known as the Professor, who was tried and found guilty by closed trial ten years ago."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Post-Explosion Photograph",
      "type": "",
      "obtained": "",
      "description1": "A photographic print of the experimentation stage after it was completely levelled by a time bomb. The metal floor of the stage has been blown open by the explosion."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Drebber's Contract",
      "type": "",
      "obtained": "",
      "description1": "The contract between Mr Asman and Mr Drebber detailing the terms by which they would profit from the kinesis experiment."
    },
    {
      "currentChapter": "The Return of the Great Departed Soul",
      "name": "Ten-Year-Old Article",
      "type": "",
      "obtained": "",
      "description1": "A newspaper article recounting the tale of an eyewitness to the alleged 'resurrection' of the Professor from his grave on the night of his execution."
    }
  ],
  "turns": []
}