{
  "previousContext": "Episode IV\nTwisted Karma and His Last Bow\nAnime cutscene\nPipe in hand, Sholmes looked down at the thick, rolling fog outside our window. 'I wonder exactly how many mysteries are out there, hidden within this bed of fog,' he said. Indeed, a most bizarre incident born of a curious advertisement... a hell-hound's mad gallop through the shadows of a serial murder, an executed man's graveyard resurrection in the dead of night... and a commonplace killing in a small, forgotten room at the edge of town... There is, naturally, always another side to every case of which most remain ignorant. 'And it is that \"other side\" which compels me to the scene of the crime, Wilson. So, quickly now. Take your hat and let's be on our way, my dear fellow. For our adventure is not over yet. Come! The game is afoot!'\nEight days after that earth-shattering trial and Kazuma regaining his memory... ...we were in the foyer of one of London's most luxurious hotels, the Great Waterloo Hotel.\n1st November, 10:24 a.m.\nGreat Waterloo Hotel Foyer\nRyunosuke:\nProfessor Mikotoba is due to arrive at any moment.\nSusato:\nYes! I'm so glad we got here in time! .........\nRyunosuke:\n(Susato-san hasn't been the same since what happened. Not that I'm surprised.)\nSusato:\nThe truth about Kazuma-sama's father...\nRyunosuke:\n...!\nSusato:\nDo you suppose my father knew?\nRyunosuke:\nThat he was actually the mass murderer, the Professor, you mean? (I knew that's what she was thinking about.) There's a good chance, I'd say. I mean... ...they did come here to London together sixteen years ago, didn't they?\nSusato:\nYes, that's true...\nRyunosuke:\n......... Come to think of it, didn't you say... ...that Professor Mikotoba knew about Kazuma going missing in Hong Kong as well?\nSusato:\nThat's right. But for some reason, he wasn't at liberty to talk to me about it.\nRyunosuke:\n(That probably means he knows, then... ...about Kazuma showing up here in London with amnesia, and that he's regained his memory now.)\nSusato:\n.........\n???:\nAh, there she is!\nSusato:\nOh... Father!\nMikotoba:\nHello, Susato! How are you?\nSusato:\nI'm very well, thank you. We're delighted you've arrived safe and sound!\nMikotoba:\nHello, Mr Naruhodo. Very kind of you to take the trouble to meet us here.\nRyunosuke:\nOh no, not at all. It's my pleasure.\n???:\nWe've heard all about your extraordinary exploits here in London, you know. The news has crossed the seas.\nRyunosuke:\nIt, it has?\n???:\nI always look forward to reading the monthly reports that arrive with the steamships from Britain.\nRyunosuke:\nOh...I, I see. Well...thank you very much! (Who is this man? And why do I feel as though I've seen him before?)\n???:\nHm... I take it from your expression that you can't quite place me.\nMikotoba:\nIn that case...how about a little reminder, Seishiro? A firm tap should do it.\n???:\nYes...\nRyunosuke:\n(A, a firm tap? What?)\n???:\nHere we go, then... I hereby pronounce the defendant, Ryunosuke Naruhodo... ...GUILTY!\nRyunosuke:\nAh... OOOOOOH! Y-You're...\nJudge:\nThe court will now hear the trial of Ryunosuke Naruhodo.\nRyunosuke:\nY... Your... ...Your Excellency!\nSusato:\nHello, Judge Jigoku, how are you? It's been a long time.\nJigoku:\nHah hah hah hah hah! Good, you've remembered now! That really did the trick! Guilty! Hah hah hah hah hah!\nRyunosuke:\n(Only I was declared not guilty, wasn't I? And there was no laughing at the time...)\nJigoku:\nSo, London again after all this time... Hard to believe it's been ten years. To be honest, I never thought I'd be back.\nMikotoba:\nNeither did I. I didn't imagine Japan would ever be invited to an international symposium like this. Though, really, I doubt anyone did, to be honest. It's all thanks to you, isn't it, Seishiro?\nJigoku:\nWhat are you talking about, Yujin? Hah hah hah hah hah!\nRyunosuke:\n(Of course, Judge Jigoku... He must complete the set. He's the other man, who sixteen years ago... ...came to London with Kazuma's father and Professor Mikotoba. He's the third visiting scholar.)\nMikotoba:\nWell, all those passport checks and luggage searches at the border took rather a lot of time. I must say, I'm very envious of your ministerial status. You didn't have to go through any of that, did you?\nJigoku:\nAh, I knew you were jealous! Hah hah hah hah hah!\nRyunosuke:\nSorry? Ministerial status?\nMikotoba:\nYes, didn't you know? Seishiro here is also Japan's Minister of Foreign Affairs. It was his personal insistence that allowed you to take Kazuma's place here on this study tour.\nJigoku:\nGuilty as charged! Hah hah hah hah hah!\nRyunosuke:\nOh. Well, thank you very much. (He's really every bit as important as he looks.)\nMikotoba:\nAh yes now, Naruhodo... I received a telegram from Lord Stronghart yesterday.\nRyunosuke:\nOh, you did?\nMikotoba:\nIt appears that...some things came to light in a trial you were involved with eight days ago. About what happened ten years ago. That...tragedy.\nSusato:\n.........\nRyunosuke:\nYes. Could you tell us any more about it?\nAfter clearing all Converse options:\nMikotoba:\nWell, if you'll excuse us now...\nJigoku:\nYes, I'd like to get this trunk up to my room as soon as possible.\nRyunosuke:\nOh, I...I'm so sorry! I shouldn't have held you up here for so long.\nSusato:\nI'll call for the porter, then. Just wait here!\nRyunosuke:\n(Susato-san's gone off at a run!)\nMikotoba:\nI'd like to stay and talk more, but I do have various preparations to make for tomorrow.\nRyunosuke:\nYes, of course! It must be a big responsibility representing our entire country. I wish you the best of luck!\nMikotoba:\n......... Naruhodo... ...I hope you'll keep an eye on Susato for me. Keep looking after her as you obviously have been.\nRyunosuke:\nOh no! I, I mean, if anyone's looking after anyone, it's her looking after me!\nMikotoba:\nWell I do appreciate you being there for her. After all... ...I've been a miserable father to her. I've thoroughly let her down.\nRyunosuke:\nSorry? What do you mean?\nMikotoba:\n......... Well, it was sixteen years ago that I started my long study tour here in Britain, as you know. The very year Susato was born.\nRyunosuke:\n...Yes, I heard.\nMikotoba:\nThe birth of my daughter was the most joyous event of my life, but... Well, sadly it was accompanied by the most tragic event of my life, too.\nRyunosuke:\n(Oh...yes... Susato-san hinted at something like that...)\nSusato:\nIt was a rather turbulent time at home...\nMikotoba:\n...Anyway, I won't bore you with the details. The point is, I became rather less dependable than befits a grown man. And it was then that Seishiro offered me the opportunity to study here in Great Britain.\nJigoku:\nI was too worried about you to leave you behind. So perhaps I was a little heavy-handed when it came to persuading you to accompany me to London.\nMikotoba:\nSo...that's what happened in a nutshell. And that's also the reason why I now feel compelled to give my daughter as many opportunities as I dare. Though the world does not readily afford young women such things, I must say.\nRyunosuke:\nI...completely understand, Professor.\nMikotoba:\n......... Ah, one other thing, Naruhodo... If I may be so bold, I have a favour to ask you.\nRyunosuke:\nOh, really? Of course! What can I do for you?\nMikotoba:\nWell, the thing is, I-\nSusato:\nI'm so sorry that took so long!\nRyunosuke:\nMiss Susato!\nSusato:\nNow then...allow us to take your bags!\nPorter:\nAllow me to take your bags!\nMikotoba:\nOne moment, if you please, porter.\nPorter:\nOf...of course, sir!\nMikotoba:\nThat machine around your neck... It's a camera, I believe?\nPorter:\nQuite right, sir! Just five shillings for a lovely photograph to commemorate a wonderful stay at the hotel, sir!\nMikotoba:\nWell, I think given the occasion, we could justify the expense.\nPorter:\n......... Ah! Yes, yes of course!\nSusato:\n...I'd like to thank you for coming with me, Mr Naruhodo. It's really made Father very happy, I think.\nRyunosuke:\nOh, well, I'm pleased, then. (But we were interrupted before. Professor Mikotoba was about to ask me something.)\nSusato:\nShall we return to Baker Street, then? I expect Iris will have some delicious tea waiting for us!\nRyunosuke:\nYes, let's go. (I'm getting more and more anxious about Kazuma, though. Perhaps I'll try to meet with Lord Stronghart later and ask after him...)\n1st November\nBritish Supreme Court, Lord Chief Justice's Office\nVan Zieks:\nHere's the final draft of the opening address for tomorrow's proceedings. I've supplemented your original with the figures you asked for from the Yard.\nStronghart:\nI see. Excellent work. Thank you.\nVan Zieks:\n...You're welcome, My Lord.\nRyunosuke:\n(What's Lord van Zieks doing here...?)\nSusato:\nMy, there seems to be an awful lot of tension in the air, wouldn't you say?\nRyunosuke:\n(This place is stifling enough as it is. We really don't need any more tension.)\nStronghart:\nMy apologies. I didn't notice you come in. Your small stature and dark dress make you all but invisible to me.\nRyunosuke:\nOh! No no! It's entirely my fault for wearing black, I'm sure.\nSusato:\nFrom now on, you must dress in white from head to toe whenever you come here!\nStronghart:\nNow then, Mr Naruhodo...\nRyunosuke:\nY-Yes, My Lord! I'm right here!\nStronghart:\n.........\nRyunosuke:\n......... (Ugh... Kill me now...)\nStronghart:\nIs something wrong? Perhaps it's a little too hot in here for you.\nRyunosuke:\nOh, no, not at all! I mean, I've never experienced a room at such a perfect temperature!\nStronghart:\nIf you're sure. The beads of sweat carving their way down your face seem to suggest otherwise.\nRyunosuke:\n(Because of the daggers you're staring at me with, mainly.)\nStronghart:\nAs you're no doubt aware, my International Forensic Science Symposium begins tomorrow. In fact, your father arrived in London earlier today, I hear, madam.\nSusato:\nOh! Yes, that's right, My Lord. He's extremely honoured to have been invited.\nStronghart:\nI'll leave the remaining preparations for the meeting room in your capable hands then, Lord van Zieks.\nVan Zieks:\nI will attend at once.\nSusato:\nHe gave you a very cold stare as he left, didn't he?\nRyunosuke:\nI know. But I haven't done anything...have I?\nStronghart:\nThese past few days, my feet have barely touched the ground, I must say. My dedicated right hand of many years was recently put out of action in spectacular fashion.\nRyunosuke:\nOh, I'm sorry to hear that. ...Is your left hand still of service?\nSusato:\nMr Naruhodo! He's talking about Dr Sithe!\nRyunosuke:\nAh! (Of course...) I'm, I'm terribly sorry about that. I was just, um...\nStronghart:\nFear not. You've done nothing wrong. Dr Sithe's own wrongdoing precipitated the situation. You needn't concern yourself with it any further.\nRyunosuke:\n(That would be a lot easier to do if it weren't for the piercing stare you're giving me...)\nStronghart:\nLord van Zieks is doing an admirable job of holding the fort. Though disturbingly, his apprentice has been missing since yesterday.\nRyunosuke:\nO-Oh... (Missing...?)\nSusato:\nWhat's become of Kazuma-sama now...?\n1st November\nSholmes's Suite\n???:\nUèèèèèèèèèèèèè uèèèèèèèèèèèèèèè!\nRyunosuke:\nW-What was that?!\nSusato:\nA, a man screaming! In a most unflattering way!\nRyunosuke:\nDo you think... Could it have been Mr Sholmes?\nSusato:\nOh my! I do hope not...\n???:\nUèèèèèèèèèèèè! I don't-a do it any more!\n???:\nMon ami, mon ami... Stop zis disgraceful display, uh?\nRyunosuke:\nWho, who are these people? (Look at their hair! It's bright red...)\nSusato:\nI think...they must be clients of Mr Sholmes.\nGina:\nRight, you two. Yer comin' wiv me now. Down to the clink.\n???:\nNo! Not in prison! It is dark and damp and I don't-a like it!\n???:\nBof! Ze darkness, it is my friend. I am not scared!\n???:\nUèèè uèèèèèèèèèèèè! But you are always scared of the dark!\n???:\nShut your mouth, you idiot! I will sit quietly in ze dark and plan our next daring 'eist!\n???:\nUèèèèèèèèèèèèèèèèèèèèèèèèèèè! I don't-a like this! I don't-a like it!\nGina:\nWell tough! We'll finish this down the Yard! Now get movin'!\nIris:\nBy then, Ginny! Have fun!\nGina:\nOh yeah, thanks, Iris! And thanks...ya great detective!\nSusato:\nHeehee! Gina makes a fine detective herself, doesn't she?\nIris:\nOh, Susie! And Runo!\nRyunosuke:\nHello, Iris. We're home!\nIris:\nWell? Did you find your daddy?\nSusato:\nYes! We arrived at the hotel just before he and his friend.\nIris:\nOh! Well that's great news. I hope I'll get to see my daddy again soon...\nSusato:\nAh...yes...of course...\nRyunosuke:\n(Dr John H. Wilson...)\n???:\nSo, Iris! All that remains now is that greatest of problems known to man!\nSholmes:\nBut before we concern ourselves with that, I believe some tea is in order, don't you, my dear fellows?\nRyunosuke:\n.........\nSusato:\n.........\nSholmes:\nIs something wrong, Mr Naruhodo? Do I have a crumb or suchlike on my face?\nRyunosuke:\nUh... (Not so much on your face... ...as on your head, I'd say.)\nIris:\nCome along then, everyone. I've brewed a lovely special blend. Time for tea!\nSusato:\nWhatever is going on here today?\nSholmes:\nIn that case, let us sit and drink now. For I am in fact expecting a guest later today.\nAfter clearing Converse options with Herlock Sholmes and clearing all Converse options in British Supreme Court, Lord Chief Justice's Office:\n*Ding-aling-aling*\nSholmes:\nAha! Here is my guest now. My latest client! With money to spend!\nIris:\nOoh, I do hope it's an exciting case, Hurley!\nSholmes:\nRemember, Iris, we are at present gripped by the greatest problem known to man. I must be willing to accept any case, no matter how unstimulating. Save locating a runaway, of course.\nRyunosuke:\n...Don't spare anyone's feelings, will you?\nIris:\nOh dear... I'm afraid that Hurley can lack a little tact, especially just before the rent is due.\n*Thwack!*\n???:\nMr Sholmes! Mr Herlock Sholmes! Please... Oh, please... ...please find my husband! He's run away!\nSholmes:\nTo upset me?\n???:\nI beg your pardon?\nSholmes:\nNever mind. A personal matter. My apologies. What exactly are you trying to say, Mr Naruhodo?\nRyunosuke:\n...I didn't say a word.\nSholmes:\nCome, my dear madam, be seated. Iris, some tea, if you please?\nIris:\nOf course!\nSusato:\n.........\nRyunosuke:\nWhat's the matter, Miss Susato?\nSusato:\nOh, it's...it's just that gentlewoman... I feel sure I've seen her somewhere before. Very recently.\nRyunosuke:\n(...! Yes, now you come to mention it...)\nEvie:\nAs I explained earlier, my name is Evie Vigil. I implore you to take the case, sir! Money is no object. Simply name your figure!\nSholmes:\nMoney and wealth are of little consequence to me, madam. Being offered a case to solve is reward enough.\nEvie:\nOh, Mr Sholmes! You are the picture of benevolence!\nSholmes:\nI will of course make a mental note of your offer, however. For...contingent reasons. I trust you will remember your words also.\nEvie:\nUm...if I might enquire, sir... ...this gentleman and lady would be...?\nRyunosuke:\nOh! Um...me?\nEvie:\nWhat I am about to tell you, I should like to communicate in the strictest confidence, you understand.\nSholmes:\nAh, these are my friends. I assure you, you may say before this pair anything which you may say to me.\nEvie:\nAh...I see...\nSholmes:\nI can vouch for the gentleman personally. After all... ...he's hard of hearing.\nRyunosuke:\n(...Why did I ever get my hopes up?)\nAfter clearing all Converse options:\nSholmes:\nThank you for everything you have shared with us, Mrs Vigil. I believe I have all the information I need to begin my investigation.\nEvie:\nOh, please report to me soon with good news, sir!\nSholmes:\nFear not, madam. In a day or two, I shall be contacting you with a heartening report, I'm quite sure.\nEvie:\nSo soon? Oh, how splendid, Mr Sholmes!\nSholmes:\nGood news should be delivered early, I always say. If you would be so kind as to leave the photograph of your husband in my possession...?\nThe photograph of Mr Vigil has been entered into the Court Record.\nSholmes:\nThank you. Now, allow me to show you the door.\nEvie:\nI can't thank you enough, Mr Sholmes. You've been simply marvellous!\nIris:\nYou know, I think it every time, Hurley... ...but how do you come out with such nonsense? Good news in a day or two? Are you sure?\nSholmes:\nI can't be sure, of course. But then I didn't swear on it. I merely gave the good woman some hope. I hope to be able to give her good news, one might say. After all, the rent must be paid by the end of day tomorrow. If by that time I've successfully located Mr Vigil, we shall be mutually relieved. Wouldn't you agree, Mr Naruhodo?\nRyunosuke:\n...Don't look at me with those pleading eyes.\nSholmes:\nWell, my dear fellow? Did you hear the details of the case?\nRyunosuke:\nYes...my hearing is surprisingly good, actually.\nSholmes:\nExcellent! And what did you make of it?\nRyunosuke:\nWell, I was surprised to learn where her husband worked. At Barclay Prison, I mean...\nSholmes:\nAh, so you noted that?\nSusato:\nOf course. Especially with the mention of Lowgate Cemetery...\nDrebber:\nLowgate Cemetery as at the rear of Barclay Prison. So it was renowned among us students at the university for being haunted by the ghosts of condemned convicts.\nSusato:\nBarclay Prison is where that notorious man was incarcerated!\nRyunosuke:\nThe Professor...\nSholmes:\nAnd now a warder from the prison has mysteriously disappeared, it would seem.\nRyunosuke:\nIt's all very peculiar...\nSholmes:\nIndeed. But nothing you can't handle, I'm quite certain, Mr Naruhodo.\nRyunosuke:\nSorry?\nSholmes:\nRun along to the prison and see what you can glean, would you? It's the prison governor you want. No doubt the man is equally worried.\nRyunosuke:\nBut...aren't you going to go yourself?\nSholmes:\nSurely you needn't ask. I can't possibly be seen out with this hair!\nRyunosuke:\n.........\nSusato:\n.........\nRyunosuke:\n...But didn't you go to Lime Street with that hair?\nSholmes:\nThat was a quite different matter. So, I leave it in your capable hands. Now, if you'll excuse me, I'm rather busy.\nRyunosuke:\n(Of course you are...)\n1st November, 10:24 a.m.\nNaruhodo's Legal Consultancy\nBarclay Prison is on the outskirts of London, backing onto a lonely burial ground. Its four high outer walls loomed quietly before us in the fog. Having requested a meeting, we were shown to the governor's office in the watchtower.\n1st November\nBarclay Prison, Governor's Office\n???:\nThis place is full of hardened criminals. I cannae remember the last time a civilian was doon here. And you dinnae want to talk to an inmate, but to me?\nCaidin:\nD'you ken who I am? I'm the governor, Barry Caidin......... hm?\nRyunosuke:\nOh...yes...it's a pleasure. I'm Ryunosuke Naruhodo, defence lawyer.\nCaidin:\nAnd an Easterner, I see. Does that mean...\nRyunosuke:\nYes, I'm a visiting student of law from the Empire of Japan.\nCaidin:\nJapan?! Did ye say Japan?\nRyunosuke:\nUm...yes?\nCaidin:\nWell there's no any of your kind in here, laddie! Maybe you should try the prison next door, eh?\nSusato:\nI didn't notice another prison next door, sir...\nRyunosuke:\nAnyway, we came to ask you some questions about-\nCaidin:\nI dinnae like to be so direct, but... ...I've no intention of speaking wi' the likes o' you suspicious-looking Easterners. Now get oot of my hair.\nRyunosuke:\n(So as soon as he finds out that we're from Japan, he reacts like this... That surely means...)\nSusato:\nI think...it's because of the Professor case.\nRyunosuke:\nYou think so too? (Ten years ago... ...Genshin Asogi - also known as the Professor - was incarcerated at this prison.) And then, after his execution, he apparently re-merged from his grave in the cemetery behind the prison.\nCaidin:\nI, I might 'ave known! You're sniffing around aboot that case, aren't ya? You're agents, eh? Part of the Professor's great web, no doubt.\nRyunosuke:\nNo! Not at all! We're just-\nCaidin:\nGet gone wi' ya! Before I punch yer lights oot!\nRyunosuke:\nWe're going, we're going! (Clearly the ghost of that killer still haunts this place... We're not going to get anywhere here. Unless we can somehow prove to this man that there's nothing suspicious about us...)\nSusato:\nGovernor Caidin...\nRyunosuke:\nWhat are you thinking, Miss Susato?\nSusato:\nI feel sure that name came up in conversation recently somewhere. I was wondering if whoever mentioned him might have some ideas to help us.\nRyunosuke:\n(Come to think of it, I have the same feeling...)\nGreat Waterloo Hotel\nNaruhodo's Legal Consultancy\nBritish Supreme Court, Lord Chief Justice's Office\nBarclay Prison, Governor's Office\nRyunosuke:\nIf you'd just cast your eyes over this, Governor Caidin...\nCaidin:\nWhat's this then? You cannae pull the wool over my eyes, you good-fer-nothin' Japanese student! ......... Mikotoba? That, that young jock from the forensics laboratory? That Mikotoba?\nRyunosuke:\nYes! Exactly! Him!\nSusato:\nOh dear, perhaps I should have said something sooner... I'm Yujin Mikotoba's daughter, Susato.\nCaidin:\nJings! You're the young man's daughter? And ya did'nae think to mention that afore?\nSusato:\nI, I do apologise...\nCaidin:\nAye, well, ye'd best take a seat then. Can I offer you a cup of tea, perhaps? And dinnae forget to try one of these wee handcuff biscuits!\nSusato:\n.........\nRyunosuke:\nYour father's influence is nothing short of amazing...\nSusato:\nI'm bitterly regretting not announcing who I was from the outset now.\nCaidin:\nSo then...what can I do for you, hen?\nSusato:\nWell...we're currently investigating a case.\nRyunosuke:\nIt's one of your warders, you see. He's gone missing.\nCaidin:\nMissing?\nSusato:\nThat's right. It's surely been reported to you as well, being the prison governor.\nCaidin:\n......... I have'nae heard nothing of the sort. There's no missing persons in my prison!\nSusato:\nOh!\nRyunosuke:\n(But...how can that be?)\nSusato:\nIt's Mr Daley Vigil, your chief warder...\nCaidin:\nEh? Vigil?\nRyunosuke:\nThat's right. His wife came to us and asked us to investigate his disappearance. (Let's skip the part about him only going missing yesterday for now...)\nCaidin:\n.........\nRyunosuke:\n(Clearly that means something to him...)\nSusato:\nWould you be so kind as to tell us what you know, sir?\nCaidin:\nAye... Aye, of course.\nAfter clearing all Converse options:\nCaidin:\nWell... ...I cannae tell you anything else.\nSusato:\nThank you so much for your time, Governor.\nCaidin:\nOh, one moment afore you're away, hen... I'm sure I have it here somewhere... Ah, found it. Here, take this as a wee souvenir of your visit to the prison.\nSusato:\nWhat is it?\nCaidin:\nThat's Vigil's dismissal notice. It's ten years old now of course.\nSusato:\nOh my! Are you sure?\nCaidin:\nAye, it's no trouble at all. It's no the original, mind.\nVigil's dismissal notice has been entered into the Court Record.\nRyunosuke:\nThank you very much, Governor Caidin!\nCaidin:\nWell in return... ...do me a favour and never come back here. That case is closed.\nSusato:\nWell, I think we ought to return to Baker Street for the time being.\nRyunosuke:\nYes, I agree. We need to report back to Mr Sholmes with what we've found out about Mr Vigil. (What will he tell Mrs Vigil, I wonder?)\n1st November\nSholmes's Suite\nRyunosuke:\nWe're back!\n???:\nHello, you two!\nIris:\nI thought you'd be back before long, so I baked some scones for us all.\nRyunosuke:\nAh! So that's what the delicious smell is.\nSholmes:\nGreetings, my dear fellows! You've returned a good deal sooner than I was anticipating.\nRyunosuke:\nUm...hello, Mr Sholmes. .........\nSusato:\nHello, Mr...Sholmes... .........\nSholmes:\nSay nothing. Your thoughts are written all over your faces in any case. It turns out that it may have been advisable to test my hair colour restoration tonic before application.\nSusato:\nOh my...\nSholmes:\nPray, tell me. What of our warder friend? Have you garnered some new information?\nRyunosuke:\nOh, um...yes. Something very surprising, in fact. Though it's not a patch on your hair, to be honest.\nSusato:\nIt most certainly isn't. But still, we discovered that-\n???:\nSHOOOOOOOOOLMES!!!\nGina:\nDrop everyfin', Sholmes! This is more important!\nRyunosuke:\nGina?\nGina:\nI, I can't Adam an' Eve it... *Sniff, sniff...*\nSusato:\nWhat's happened?\nSholmes:\nClearly a very grave matter indeed. For Miss Lestrade made no mention of my hair whatsoever.\nGina:\nIt's...it's the boss...\nRyunosuke:\nWhat do you mean? (Inspector Gregson?)\nGina:\nThe boss is... He's... He's dead.\nRyunosuke:\nWhat...?\nGina:\nThey, they just found 'is body. Shot...wiv a pistol...\nRyunosuke:\nWHAAAAAAAAAT?!\nSusato:\nBut...but... Inspector Gregson?!\nRyunosuke:\n(He was...murdered?!)\nIris:\nNo... Not Gregsy...\nSholmes:\nCome in, my dear girl. Tell us the whole story.\nGina:\n*Sniff, sniff...*\nAfter clearing all Converse options:\nSholmes:\n......... Thank you for informing us, Miss Lestrade. This really is most terrible news. I'm dreadfully sorry...\nGina:\nWot are you sayin' sorry for? You didn't do nuffin'!\nSholmes:\n.........\nGina:\nWell...anyway... ...I'm takin' a cab over to the scene right now. Please come an' all! As soon as ya can! You've gotta 'elp!\nSholmes:\nIt's a detective's lot to appear wherever some sinister plot has unfolded. Little wonder we all look haggard. Sometimes these things are almost too much for the nerves.\nRyunosuke:\nMr Sholmes...\nSholmes:\nWhat use is there in being a great detective if I fail to see something like this coming, hm?! How could I let this happen to Gregson?! To Gregson...\nSusato:\n.........\nSholmes:\nMr Naruhodo, I shall leave at once to begin my investigations.\nRyunosuke:\nOf course, yes. We will, too.\nSholmes:\nIt would be helpful... ...if you could talk to Mr Reaper and see what you can glean. I'm sure you were intending to do so anyway. Until later, then!\nRyunosuke:\n(Inspector Gregson, dead... And Lord van Zieks arrested...)\nIris:\nRuno! Susie! I've called you a hansom. It's waiting outside.\nRyunosuke:\nThanks, Iris. Shall we, Miss Susato?\nSusato:\nYes!\nNaruhodo's Legal Consultancy\n1st November\nRoom on Fresno Street\nRyunosuke:\n(This really is an out-of-the-way part of London. I doubt many people find their way down this back street. So this dust-ridden rented old room is where it happened then...)\nSusato:\nSo this is...where poor Inspector Gregson lost his life.\nRyunosuke:\nYes... And the police are already hard at work investigating, it seems. (I don't see Mr Sholmes anywhere, though... Perhaps his investigations have taken him elsewhere.)\nGina:\nOi! Wot d'ya think yer doin' there?! Every one o' them drawers 'as gotta be taken right out so you can look underneath an' all! I want the space above this ceilin' checked, and don't forget to look inside the chimney stack, too! Blimey! Ain't you lot never gone over an 'ouse lookin' for dough when the owners are out o' town?\nRyunosuke:\n(Gina's obviously got some unique investigative techniques she wants everyone to adopt...)\nGina:\nOh, so you've turned up at last. Mind you, I ain't been 'ere long meself.\nRyunosuke:\nHello again, Gina.\nGina:\nSholmes 'as only just left. Yer lucky ya missed that. 'E went prancin' around in 'ere, pointin' at stuff an' flickin' that 'at of 'is an' then just scarpered.\nSusato:\nOh! He's finished investigating already, you mean?\nGina:\nYeah... 'E didn't stop to say nuffin' to no one. Not even me.\nRyunosuke:\nGina! Would you mind if we investigated, too?\nGina:\n......... Listen, 'Oddo... ...yer a lawyer, right?\nRyunosuke:\nUm...yes. Why?\nGina:\nWell, yer not thinkin' of...tryin' to 'elp that Reaper bloke, are ya?\nRyunosuke:\nOh! (Poor Gina... She's never going to forget, is she? That trial will haunt her forever.)\nSusato:\nGina, if you don't mind me saying... If Lord van Zieks really is responsible for this crime... ...he will be duly and fairly judged in court.\nGina:\n......... I suppose yer right, yeah. Go on then, 'Oddo! Get investigatin'! I wanna know the truth about wot really 'appened 'ere!\nRyunosuke:\nThank you, Gina!\n1st November\nLocal Prison, Cell 1\nRyunosuke:\n(There he is. Lord van Zieks behind bars...)\nSusato:\nSo it's true. He really was arrested...\nRyunosuke:\n(He's sitting with his back to the wall, reading something. I don't think he's noticed us.) Erm...Lord van Zieks!\nVan Zieks:\n...Fancy meeting you here. The last place on Earth I'd like to be, with the last person on earth I'd like to see.\nRyunosuke:\n...I couldn't very well not come. We heard what happened. That you... That Inspector Gregson was...\nVan Zieks:\n......... Go home. This has nothing to do with you.\nRyunosuke:\nBut...\nSusato:\nForgive me, Lord van Zieks, but I must disagree.\nVan Zieks:\n.........\nSusato:\nInspector Gregson was very helpful to us on a number of occasions. We're indebted to him. At the very least we owe it to him to find out the truth about his death. You must help us with our investigations, please!\nVan Zieks:\n......... There's really nothing I can tell you.\nRyunosuke:\nWhat were you just reading at the back of the cell there? Was it something related to the case?\nVan Zieks:\n...This? The Yard isn't quite so cavalier with its information as to share case details with a suspect. This is...a letter from an old acquaintance.\nSusato:\nOh. Who might that be?\nVan Zieks:\nSomeone you know, as it happens. Albert Harebrayne.\nRyunosuke:\n(Of course, yes. I keep forgetting they went to the same university.)\nVan Zieks:\nAnd I would like to read my correspondence in peace. So let's get this over with, shall we? What is it you want to know?\nRyunosuke:\n(Strange... I mean, let's face it, Lord van Zieks never minces his words... ...but they seem to have less bite than usual somehow.)\nAfter clearing all Converse options:\nVan Zieks:\n......... So. It appears our conversation has run dry.\nRyunosuke:\nThere was a two-second silence, that's all.\nVan Zieks:\nWell in any event, if you'll excuse me now. ...I wouldn't like to detain you.\nRyunosuke:\nI was wondering, Lord van Zieks... If you'd like... ...I'd be happy to advocate for you.\nVan Zieks:\n...! ...You trust me, do you?\nRyunosuke:\nYes. I've heard you speak many times in court. I've seen how you treat people. So I'm quite sure that you would never have taken another's life. ...It's just, my feelings can't be used as evidence in a court of law, sadly.\nVan Zieks:\n......... It's a very gracious offer. However... ...I trust no one.\nRyunosuke:\nWhat?\nVan Zieks:\nNot the police, not the judiciary...and not you Nipponese.\nRyunosuke:\nBut please...\nVan Zieks:\nI have no intention of engaging your services.\nRyunosuke:\n......... (The chasm between us is just too wide and too deep, it seems...)\nVan Zieks:\n...I'd appreciate it if you don't visit again. Then neither of us will waste any more time.\nRyunosuke:\n(Perhaps we need to dig a little deeper... ...and find out more about Lord van Zieks and what happened to Inspector Gregson.)\nAfter clearing all Converse options at Local Prison, Cell 1 and clearing all Converse options and examining portrait or desk, board, gun, red wig, chalk outline, candles, and figurine in Room on Fresno Street:\n1st November, 10:24 a.m.\nBritish Supreme Court, Lord Chief Justice's Office\nStronghart:\n...You've made good time.\n???:\nI took an express train back to London.\nRyunosuke:\nI can hear Lord Stronghart. Can you?\nSusato:\nYes, it sounds as though he's talking to someone.\nStronghart:\nIs everything in place?\n???:\nI had a private compartment on the train so I could check all the paperwork.\nRyunosuke:\nI-It's...\nSusato:\nKazuma-sama!\nStronghart:\nAh, your timing is impeccable!\nRyunosuke:\nIt, it is?\nStronghart:\nNo doubt you have heard the sickening news? About the Reaper's latest devilry.\nRyunosuke:\n...Yes.\nSusato:\nI'm sure you don't believe it of course, though, Lord Stronghart. That Lord van Zieks could have done such a thing to Inspector Gregson.\nStronghart:\n......... I believe only in the facts. And the facts in this case point to one thing: The unavoidable accusal of Lord van Zieks for this crime. We must bring charges against the Reaper for taking the life of our legendary detective.\nSusato:\nOh no, surely not!\nStronghart:\nIt's a truly regrettable situation. Tomorrow the forensic science symposium finally begins. At the very least, though, we can show the world our justice system's swift and equitable processes.\nRyunosuke:\nSo does that mean...the trial is tomorrow?\nStronghart:\nPrecisely. In fact, this is a fine opportunity for introductions.\nRyunosuke:\nKazuma...\nKazuma:\n.........\nStronghart:\nAh, but of course! You're already acquainted, aren't you? Mr Asogi here will be present at tomorrow's proceedings... ...leading the prosecution.\nRyunosuke:\nWait... WHAAAAAAT?! (Kazuma...?)\nStronghart:\nAs I'm sure you're aware, he's a very capable practitioner of law.\nSusato:\nKazuma-sama...a prosecutor...?\nAfter clearing all Converse options and examining Kazuma Asogi:\nRyunosuke:\n(It doesn't look like we're going to glean much more here.) Well...thank you very much, Lord Stronghart.\nStronghart:\nRemember, tomorrow's trial will go down in our empire's history. There's much you could learn...from the public gallery.\nRyunosuke:\n...Sorry to have taken up so much of your time. We'll see ourselves out.\nKazuma:\nKazuma:\nBefore you go, Ryunosuke...\nRyunosuke:\nOh...what is it, Kazuma?\nKazuma:\nI just wanted...to thank you.\nSusato:\nKazuma-sama... What...?\nKazuma:\nYou took my determination to heart and brought it with you over the ocean in my stead. And you carried out my role to perfection.\nSusato:\nYou always were intent on studying British law in order to change our own justice system. It was your dream, and Mr Naruhodo didn't want that to die with you!\nKazuma:\nYes. But I had another purpose for coming here.\nSusato:\nOh!\nKazuma:\n......... I actually have a favour to ask.\nRyunosuke:\nW-Which is...?\nKazuma:\nThis trial I'll be prosecuting tomorrow... I'd like you to be there to see how it ends. Right in front of me...as the defence counsel!\nRyunosuke:\n...! (Why? What's this all about?)\nKazuma:\nI know you have what it takes.\nRyunosuke:\nBut...Lord van Zieks would never put his fate in my hands.\nKazuma:\nOn the contrary. He recognises your talent.\nRyunosuke:\nHe does?\nKazuma:\n...It's not easy to see behind the facade sometimes. Here, have a look at this...\nRyunosuke:\nThat's...\nSusato:\nThat's Lord van Zieks and Inspector Gregson!\nRyunosuke:\n(In a photograph that must have been taken some time ago by the look of it. And who's the third person?)\nKazuma:\nIt was displayed very prominently in the detective's office.\nRyunosuke:\nIn Gregson's office, you mean?\nKazuma:\nYes. What I'm trying to say is, if you really think you can trust the Reaper... ...you might find that some straight talking makes him take a different view. Take it.\nGregson's photograph has been entered into the Court Record.\nRyunosuke:\nI don't understand. Why are you giving me this?\nKazuma:\nJust hurry, Ryunosuke! Visiting hours at the prison are almost over.\nRyunosuke:\n(What are you doing, Kazuma...?)\n1st November\nLocal Prison, Cell 1\nRyunosuke:\nLord van Zieks is still reading that letter.\nSusato:\nWe've been gone quite some time, though...\nRyunosuke:\nEither he's an incredibly slow reader...or it's an incredibly long letter... I might even be able to read English faster than he can.\nVan Zieks:\nI was intending to ignore you entirely... ...but I can't turn a deaf ear to such an insulting Nipponese.\nRyunosuke:\nOh! Um...sorry. I didn't think you'd hear that.\nVan Zieks:\nI had the case notes brought to me in secret. I was reading them to pass the time.\nSusato:\nYes, we heard that your trial is set for tomorrow.\nVan Zieks:\nWhich is none of your business.\nRyunosuke:\nSo...have you found a lawyer?\nVan Zieks:\nHow many times must I reiterate the same thing: this is nothing to do with you.\nRyunosuke:\n(In other words, no.)\nSusato:\nWe were just talking to Lord Stronghart and...the prosecutor for your trial has been decided.\nVan Zieks:\nI'd expect nothing less. Though I have no idea who it is.\nRyunosuke:\nIt's...going to be Kazuma Asogi.\nVan Zieks:\n...! Asogi?!\nRyunosuke:\n(That made the colour drain from his face...)\nVan Zieks:\nHaah, well then... ...it seems I'm going to have to engage in conversation with you again after all.\nAfter clearing all Converse options and presenting Gregson's Photograph:\nVan Zieks:\n......... Mister...Naruhodo...\nRyunosuke:\nOh! (That's the first time he's ever used my actual name.)\nVan Zieks:\nI've lost all confidence in my country's justice system. I don't trust the police, the judiciary or lawyers. But there's still one thing I'm willing to believe in.\nRyunosuke:\nWhat's that?\nVan Zieks:\nThat which you see in the eyes of another across the courtroom: a simple determination to know the truth.\nRyunosuke:\nL-Lord van Zieks...\nVan Zieks:\nFrom the very first time we clashed in the Bailey almost a year ago now... ...I couldn't deny it, even though I dearly wished I could. 'Here is a loathsome Nipponese...who has absolute integrity as a lawyer.'\nRyunosuke:\n...!\nVan Zieks:\nThere are only two other men I've known with that same look in their eyes: My brother, Klint. ...And Genshin Asogi.\nRyunosuke:\n(The man he idolised and the man who betrayed his trust in the most hideous way...)\nVan Zieks:\n......... When you showed me that photograph just now, it reminded me...\nRyunosuke:\nYou mean, this photograph?\nVan Zieks:\nBack then I was able to laugh. I was free of the shackles of mistrust that plague me now. I looked to the future with hope. Since then I've protected myself against betrayal by refusing to trust anyone. But at times the mire into which I've sunk makes it almost impossible to breathe.\nRyunosuke:\nI'm...so sorry...\nVan Zieks:\n......... So Mr Naruhodo... ...I want to believe in that look in your eyes. I need to believe in it. ...In tomorrow's trial...will you advocate for me?\nRyunosuke:\n......... Of course I will. It would be an honour.\nSusato:\nI'm so pleased, Mr Naruhodo.\nVan Zieks:\nThen my life is in your hands.\nRyunosuke:\n(For Lord van Zieks... ...that must have been an incredibly hard thing to ask. Which is why I simply cannot let the man down. Tomorrow...in the Old Bailey...against my old friend, Kazuma!)\nTo be continued...2nd November, 8:56 a.m.\nThe Old Bailey, Defendants' Antechamber\nRyunosuke:\n(There's that old familiar feeling again... The crushing pressure of this historic courthouse.) ......... (Actually, no... it's a little different today. There's an even more menacing tension in the air.)\nSusato:\nThere is a menacing tension in the air here today, isn't there? I suppose...\nRyunosuke:\nYes, I think so. It can only be the result of the menacing appearance of the defendant.\nVan Zieks:\nA little more courtesy, if you please.\nSusato:\nOh my! I, I do apologise!\nVan Zieks:\nHowever...you're certainly not mistaken that this trial is far from ordinary.\nRyunosuke:\nWhat do you mean?\nVan Zieks:\nI'm not privy to the details. However... ...I understand that no jury has been selected.\nSusato:\nA trial without a jury?! Well, well that's just like... ...the trial of the Professor ten years ago!\nRyunosuke:\n(A closed court...)\nSholmes:\nGood morning, my dear fellows!\nRyunosuke:\nMr Sholmes!\nSholmes:\nHave you made note of my hair, Mr Naruhodo? An outright victory for science, you must agree!\nRyunosuke:\n......... To be perfectly honest, so much happened yesterday that, well... ...I completely forgot about your little hair problem.\nSholmes:\nHah! What to one man is a 'little hair problem'... ...is to another a day of drinking dubious potion after dubious potion. You have no idea how my stomach ails me this morning!\nSusato:\nOh dear! How awful for you.\nRyunosuke:\nI'm afraid you only have yourself to blame, Mr Sholmes.\nSholmes:\nAnd good morning to you, Mr Reaper. I'm delighted to see you looking so full of vim.\nVan Zieks:\nAnd I you. I see London's celebrated great detective is as active as ever.\nSholmes:\nOh, you exaggerate, my dear fellow. Compared to my paltry engagements with a few trivial cases... ...the Reaper's overbearing presence is a far greater deterrent to the black roots of crime in our capital.\nVan Zieks:\n.........\nSholmes:\nAnd whilst I may not agree with your methods... ...there is at least one point on which I would readily commend you.\nVan Zieks:\nWhat an honour. And that would be...?\nSholmes:\nYour eye for a good lawyer, sir.\nVan Zieks:\n...!\nRyunosuke:\nM-Mr Sholmes!\nSholmes:\nAfter all... ...behind this lawyer there is a very great mind. My own.\nVan Zieks:\nWhat are you trying to say?\nSholmes:\nI wish only to say that you should be prepared for quite a trial, Mr Reaper.\nVan Zieks:\n...!\n???:\nSorry to barge in...\nGina:\n.........\nRyunosuke:\nGina! (What's that on her arm? It's a mourning band, I suppose...)\nSusato:\nFather! Shouldn't you be at the symposium?\nMikotoba:\nIt's been postponed. So I have some free time. I decided to come along with the police inspector to see our country's up-and-coming student in action.\nRyunosuke:\n...!\nMikotoba:\nI shall be very interested to see the fruits of your studies over the past year.\nRyunosuke:\nWell...it's an honour to have you here! (Let's hope there are some fruits to see...)\nGina:\n......... 'Oddo...\nRyunosuke:\nOh! ...Yes, Gina?\nGina:\nWhy d'you agree to this, eh? Why d'you take 'im on?\nRyunosuke:\n...!\nGina:\nThis, this Reaper bloke... Everyone says it was 'im wot... ...wot killed the boss.\nRyunosuke:\n......... I'm sorry, Gina. But I just don't believe that.\nGina:\nWell if it weren't 'im, who was it?!\nRyunosuke:\nI don't know that...yet.\nGina:\nI don't care who calls 'im wot. The Reaper's just a name. 'E's just a person at the end o' the day. An' if it turns out it was 'im wot killed the boss...then God 'elp 'im!\nVan Zieks:\n......... Fiery eyes indeed... Yes, the culprit deserves every ounce of your loathing.\nGina:\nEh?\nVan Zieks:\nAt least that may be some solace to the deceased.\nGina:\n......... P-Please, 'Oddo... ...get whoever did this. For the boss.\nSusato:\nOh, Gina...\nGina:\nI 'ate feelin' this useless, but there's nuffin' I can do. So you've gotta find who done this and make the wretch pay!\nBailiff:\nCounsel for the Defence! And the defendant! Court will be in session shortly. Make your way into the courtroom at once, please!\nRyunosuke:\n(Alright then, here we go...)\nSusato:\nIt's time, Mr Naruhodo! Lord van Zieks!\nOne who lost his treasured brother to a mass murderer... One who lost his treasured father in a foreign court of law... And one who lost the man who helped her escape destitution... All that misfortune...all that pain...on course to collide headlong in this trial. It's time to shine a light on all these dark events. And whatever truth is revealed... ...we're going to have to look it straight in the eye.\n2nd November, 9:20 a.m.\nThe Old Bailey Courtroom\nJudge:\nIn the name of Her Majesty the Queen, I hereby declare this court to be in session. We are here to conduct the fair and just trial of the defendant, Barok van Zieks. Counsels for the defence and prosecution, are you ready to begin?\nRyunosuke:\n...The defence is ready, My Lord.\nKazuma:\nThe prosecution...is more than ready.\nSusato:\nOh, Kazuma-sama...\nRyunosuke:\n(I've been wishing to see you in court again for so long, it feels... But I never pictured it happening like this. I never thought I'd be facing you behind the prosecution's bench.)\nJudge:\nThe so-called 'Reaper of the Bailey'... ...has been a scourge like no other, undermining Her Majesty's justice system. Today we must uncover the truth behind this scourge.\nRyunosuke:\n(In other words... ...this trial is going to be a lot more far-reaching than Inspector Gregson's murder.)\nJudge:\nThe truths revealed by these proceedings may have unpredictable repercussions through the judiciary. Accordingly, they are to be conducted as a closed trial, with no members of the public present. By Her Majesty's direct orders.\nRyunosuke:\nHow will that work, My Lord?\nJudge:\nThe burden of all arbitration and adjudication falls on my shoulders. Therefore, as you will see... ...the jurors' bench shall remain vacant today.\nSusato:\nIf no members of the public are present, might I ask who is currently occupying the gallery, My Lord?\nJudge:\nThey are members of the judiciary, here to witness proceedings and ensure an equitable trial.\nRyunosuke:\nMembers of the judiciary...\nSusato:\nOh my...this is a very unusual trial already.\nJudge:\nThere is of course another, unprecedented aspect to these proceedings on which I must elaborate. The counsels for the prosecution and the defence are both aliens of Great Britain.\nKazuma:\n......... I believe it takes an outsider to see the truth sometimes. And as I stand here in this courtroom now, I'm quite certain... ...this is the reason why I had to come to Britain.\nRyunosuke:\nKazuma...?\nJudge:\nVery well. Let us commence proceedings. Prosecutor Asogi...your opening statement, if you please.\nKazuma:\nCertainly, My Lord. The incident took place on 1st November at just after five o'clock in the afternoon. The location was a building of flats on Fresno Street on the outskirts of the city. The victim's body was discovered there in an old single-room rental property.\nJudge:\nYes, Inspector Tobias Gregson. A name known very well indeed to this court. Not least for his miraculous resolution of one of this country's grimmest cases ten years ago.\nSusato:\nThe Professor case.\nRyunosuke:\nHow sure are you about the time of the incident?\nKazuma:\nSeveral witnesses on the street outside heard the gunshot, and all have reported the same time.\nRyunosuke:\n(Yes, that's what Gina told us, too. There were a number of witnesses.)\nKazuma:\nI have here a plan of the room. The victim was found curled up in one corner. It's believed that he was shot from the front at point-blank range and died instantly.\nJudge:\nHm... How has the range been determined?\nKazuma:\nThere were scorch marks around the entry wound. Such marks are caused by the gunpowder used to fire the bullet. But powder hot enough to leave scorch marks is only ejected a few inches beyond the end of the barrel. In other words, it only happens when the target is at point-blank range.\nJudge:\nI see, yes. Thank you for the detailed explanation, Counsel.\nThe autopsy report has been entered into the Court Record.\nKazuma:\nThe murder weapon was found lying beside the victim.\nJudge:\nAnd have you managed to ascertain the owner of this firearm?\nKazuma:\nNo, My Lord. Not conclusively.\nSusato:\nBravo, Kazuma-sama... ...for not trying to use the gun as evidence when its provenance can't be proven.\nKazuma:\nFurthermore, My Lord... As I've explained, the revolver was fired at extremely close range. The bullet passed through the victim and struck the wall behind him. There is a candelabrum mounted on that wall... ...and the tip of one of the candles in it was found to have been blown off by the projectile.\nSusato:\nWe noticed that too, didn't we?\nRyunosuke:\n(Yes, that's right.)\nJudge:\nThank you for the thorough report, Counsel. The setting of the crime is clear to me. You will submit the plan of the crime scene as evidence, please.\nKazuma:\nAs you wish, My Lord.\nThe crime scene floor plan has been entered into the Court Record.\nJudge:\nIs this Fresno Street room Inspector Gregson's private abode?\nKazuma:\nNo, My Lord. The room is rented to a Mr Hugh Boone. But there is precious little furniture inside, and it is generally in a poor state of repair.\nRyunosuke:\n(So what on earth was Gregson even doing there?)\nSusato:\nPresumably he was investigating some case or other...\nKazuma:\nWhen a policeman was informed of the gunshot from the witnesses and rushed to the scene... ...he found only the deceased inspector and the accused standing alongside holding the revolver. The attending officer arrested the accused on the spot.\nJudge:\nSo...the details of the case are clear.\nKazuma:\nIn that case, the prosecution would like to call its first witness.\nJudge:\nA name please, Counsel.\nKazuma:\nNaturally...the accused himself.\nRyunosuke:\nL-Lord van Zieks?!\nKazuma:\nAs a prosecutor, he believes in the oath of office he's taken and will be compelled to tell the truth.\nJudge:\nVery well, let the defendant take the witness stand!\nKazuma:\nSo, witness...state your name and occupation for the court.\nVan Zieks:\nBarok van Zieks, Old Bailey prosecutor.\nJudge:\nI presume, Lord van Zieks, that you heard Prosecutor Asogi's opening precis.\nVan Zieks:\nI did.\nJudge:\nIt is alleged that you were found at the scene of the crime... ...and that you were arrested by the arriving police officer. Can you confirm this?\nVan Zieks:\nYes, My Lord.\nKazuma:\nThen I'm sure the court would like to hear you explain some things away. Namely why you were there in the room on Fresno Street at the time in question. And what exactly took place.\nVan Zieks:\nI intend to explain away nothing. I will simply tell the truth.\nJudge:\nI must say, Lord van Zieks, I never imagined this day would come. Or rather... ...I didn't want to imagine it would come. But since you became known as the Reaper... ...a part of me has been dreading it.\nVan Zieks:\n.........\nJudge:\nYour formal testimony then, witness!\nWitness Testimony\n- The Facts of the Incident -\nVan Zieks:\nI was investigating Gregson, and my inquiries had led me to that address.\nWhen I first entered the room that day, it was dark inside and I saw no one.\nA moment later, I heard the gunshot. I spun around, and saw the revolver on the floor.\nJust as I picked the firearm up to examine it, the door flew open and I heard a man scream.\nIt was only then that the body of Inspector Gregson appeared before me.\nKazuma:\nThat testimony is the whole truth?\nVan Zieks:\nIt was.\nKazuma:\nSo...you heard a shot being fired in a room with no living occupants... ...and moments later a corpse somehow appeared before your eyes. Is that it? You're right, you haven't explained away anything. In fact that would barely qualify as an excuse.\nVan Zieks:\n......... I thought you were my mute apprentice. Yet it turns out you have a way with words... Prosecutor Asogi.\nJudge:\nHmmm... It would appear to be a singular tale indeed.\nKazuma:\nSingular isn't the word. It's laughable.\nRyunosuke:\n(What's got into Kazuma? He's not behaving like himself at all...)\nSusato:\n.........\nJudge:\nVery well, then. Counsel, you may begin your cross-examination.\nRyunosuke:\nYes, My Lord!\nCross-Examination\n- The Facts of the Incident -\nVan Zieks:\nI was investigating Gregson, and my inquiries had led me to that address.\nVan Zieks:\nWhen I first entered the room that day, it was dark inside and I saw no one.\nVan Zieks:\nA moment later, I heard the gunshot. I spun around, and saw the revolver on the floor.\nVan Zieks:\nJust as I picked the firearm up to examine it, the door flew open and I heard a man scream.\nVan Zieks:\nIt was only then that the body of Inspector Gregson appeared before me.\nRyunosuke:\n(So...that's Lord van Zieks's account.)\nSusato:\nDo you have any thoughts, Mr Naruhodo?\nRyunosuke:\nYes...mainly that it really doesn't ring true in all sorts of ways. Who fired the gun if there was nobody else there? And how did the corpse just appear in front of him?\nSusato:\nSo...you think that Lord van Zieks is lying?\nRyunosuke:\nNo, I don't think that. I mean, if he was going to lie... ...I would expect him to have come up with a more credible story, wouldn't you?\nSusato:\nYes, I completely agree. I think he genuinely doesn't know what really happened himself. So we must do what we can to fill in the gaps.\nRyunosuke:\nYes, first and foremost, we need more information!\nAfter pressing all statements:\nKazuma:\nKazuma:\nSurely the court has heard enough!\nRyunosuke:\n...!\nKazuma:\nMy Lord, the cross-examination has clearly revealed... ...that the accused, Barok van Zieks...is lying on multiple fronts!\nRyunosuke:\nWha... What is THAT supposed to mean?!\nJudge:\n...Good gracious, Counsel!\nThe defendant is lying, you say?\nKazuma:\nIn his testimony just now... ...he claims that he failed to notice the victim's body because the room was dark.\nVan Zieks:\nThat's correct.\nKazuma:\nNo...that's impossible. As proven by this candelabrum.\nRyunosuke:\nHow does that prove anything?\nKazuma:\nIf you examine the tip of the long candle, you can see it has been blown off by a powerful impact.\nJudge:\nOne would assume that the projectile from the firearm passed through the victim and struck the candle.\nKazuma:\nThe problem comes when you consider the other two candles, which are clearly of a different length.\nJudge:\nYes, I can see that only the candle that appears to have been struck by the bullet is long.\nKazuma:\nWe could reasonably expect someone to have lit all three candles together. Which begs the question of why only one has ended up longer than the others.\nRyunosuke:\nThat...must be because that particular candle was extinguished when the others were still burning... ...Ah!\nKazuma:\nThat's right. When the candle was hit by the bullet, it obviously went out. But the other two candles would still have been burning. So the fact is... ...the victim's body would have been illuminated by the light still thrown by the candelabrum! And the accused's claim that he couldn't see the body... clearly contradicts those facts!\nVan Zieks:\n...!\nKazuma:\nAnd now to the next lie.\nRyunosuke:\nThere's more?!\nKazuma:\nThe accused also claims never to have visited the scene of the crime before.\nVan Zieks:\nThat's the truth.\nKazuma:\nIn that almost empty room, the police discovered something very unusual. A board covered from top to bottom in police documents and newspaper cuttings.\nSusato:\nYes, that's right. We saw it, too.\nKazuma:\nIt goes without saying that the contents of the police documents cannot be divulged. However... ...they included a number of reports from various historical cases. The oldest of which...was from ten years ago.\nRyunosuke:\n(Ten years ago? This is starting to sound familiar...)\nKazuma:\nAnd there is a common thread linking all of the documents on that board.\nJudge:\nIndeed? What is this common thread, Counsel?\nKazuma:\nThey all relate to cases prosecuted in court by Barok van Zieks.\nRyunosuke:\nAll of them?\nKazuma:\nAnd furthermore...all those cases are ones in which the defendant was acquitted.\nJudge:\nGood Lord!\nKazuma:\nInterestingly, none of those defendants are alive today. Because all of them have been sent to their graves...by the Reaper.\nRyunosuke:\nAh!\nSusato:\nOh no...\nKazuma:\nIn short! That dingy little room... ...is the Reaper's secret hideout...and his base of operations!\nRyunosuke:\nThe, the Reaper's hideout?!\nKazuma:\nAnd yet the Reaper would claim never to have been to his own secret hideout? No one would believe that. No, the truth is...we've been looking at this backwards.\nJudge:\nBackwards? Explain, Counsel!\nKazuma:\nInspector Gregson was investigating the identity of the Reaper. When he discovered the location of the man's secret hideout...he was killed. As I'm sure everyone can imagine...by the Reaper's hand!\nRyunosuke:\nWha... WHAAAAAAAAAT?!\nJudge:\nOrdaaar! Ordaaar! Orrrdaaar! Very well. I hereby state the current opinion of the court. Barok van Zieks is an outstanding prosecutor who has rendered great service to his country. However, it is with deep regret that I must concur with Prosecutor Asogi's contention... ...that the defendant's testimony exhibits a number of stark inconsistencies with the known facts.\nVan Zieks:\nAll I have done is state the truth as I know it.\nRyunosuke:\n(Kazuma's done a brilliant job as ever. He's drawing on his experience as a defence attorney to build his prosecution case...and it's formidable.)\nJudge:\nCounsel... ...you will submit the board that you just showed the court as evidence. I believe it to be fundamental in establishing the facts surrounding the Reaper's existence.\nKazuma:\nThank you, My Lord.\nThe noticeboard has been entered into the Court Record.\nKazuma:\nAnd now, the prosecution would like to call new witnesses to the stand. Witnesses who saw events unfold on the day in question.\nSusato:\nThey were mentioned in the previous testimony too, if you remember.\nRyunosuke:\nYes. The street sellers who heard the gunshot and went running into the room.\nJudge:\nVery well, lead the witnesses in! The defendant may step down from the witness stand.\nVan Zieks:\nCertainly, My Lord.\nKazuma:\nSo...witnesses. State your names and occupations for the court.\n???:\nNames?! We don't use names. Far too fancy for the likes of uz.\n???:\nWe're just free an' easy. Sell what we like, live where we wanna live...\n???:\nI g-give them all a vacant stare as they w-walk down Fresno, and spin a few w-words into a verse for them.\nJudge:\nAh... Would I be right in assuming that all three of you make your living by selling wares on the street?\nGossip:\nHehe, everyone calls me Gossip. I sell jaunty little titbits to passers-by, you know.\nRyunosuke:\nJaunty little titbits?\nGossip:\nGot an absolute smasher for you, sir. Right up your ginnel, it is! Sixpence is the price, and not a penny less!\nRyunosuke:\n......... Wait! You're, you're actually trying to sell it to me now?\nGossip:\nOh, c'mon sir! Don't tell me you're not interested!\nKazuma:\nTry the man.\nSusato:\nGive him the money and see what it is!\nJudge:\nPay the man, Counsel.\nRyunosuke:\nAlright, alright, sixpence it is.\nGossip:\nYou won't regret it, sir! Now, got your listenin' ears on? Just between uz...a young couple on Sleight Street have just had twins!\nRyunosuke:\n.........\nGossip:\n.........\nRyunosuke:\n.........  Um...is that it?\nGossip:\nNo, that's not it. It's gossip, in't it? It wants to spread. But that bit's up to you and your mouth, of course. I've got more, you know. Want another juicy one? Sixpence a piece, it is. If you're curious...\nRyunosuke:\n(I am curious, yes. About what's going on just under that fat bottom lip of yours. Namely that unusual bruise or whatever it is that's poking out from under your collar...)\nKazuma:\nWhat about the next witness, then? What name do you go by and what do you sell?\nVenus:\nMe? I'm Venus. That's what everyone calls me. Funny, innit? I sell these lovely little fireworks to all the local school kids. Sixpence a pop! What d'you say?\nRyunosuke:\nYou weren't exaggerating with 'little'. Do they actually sell?\nVenus:\nOh yeah. The second years can't get enough of my Venus firecrackers. 'Specially when I tell 'em that if they get a hundred they could blow up the school!\nJudge:\nNot the most savoury of ideas, young lady.\nVenus:\nWhat d'you say then, eh? Wanna part with sixpence for a pop?\nRyunosuke:\nWait, what?! You, you want me to buy one?\nVenus:\nTell you what, I'll let you in on a little secret: If you get a hundred of 'em, you could blow up the whole courtroom!\nKazuma:\nTry the woman.\nSusato:\nGive her the money and see if she's right!\nJudge:\nPay the woman, Counsel.\nRyunosuke:\nAlright, alright, I'll buy one.\nVenus:\nLovely stuff! Right then...this is something a bit extra, just for you: The Venus Special! Only six 'undred pence!\nRyunosuke:\nS-Six hundred!\nVenus:\nIt's a hundred of my regular fireworks. Nothing 'little' about that, is there?\nRyunosuke:\n(And there'd be nothing little about the punishment if I blew up the Old Bailey, either.)\nThe Venus firecracker has been entered into the Court Record.\nKazuma:\nAnd the last witness... What name do you go by and what do you sell?\n???:\nI'm a th-thinker me. Think all sorts of thoughts. I think, therefore I am. I am, therefore I think...I think. Because I stand there on the street, w-watchin' the w-world go on about me, they call me 'The Observator'.\nGossip:\nGet out if it, old man! Everyone calls you Sandwich and you know it.\nKazuma:\nSo...you don't actually sell anything?\nSandwich:\nA p-p-problem shared is a problem halved, as they say. I give advice, I do. And think w-what it means. I d-don't actually sell anything, no...come to think of it.\nKazuma:\nPity.\nRyunosuke:\n(No more purchases today...please.)\nJudge:\nWell, we have quite a cast here, it seems.\nKazuma:\nThey conduct their business on Fresno Street from morning until night, My Lord. And always in the same place: directly adjacent to the crime scene.\nJudge:\nI see. And thus they heard the gunshot, I suppose.\nKazuma:\nNot only that, but they very bravely ran inside to see what was going on and witnessed the crime.\nGossip:\nWell I'll be beggared, I thought! ...Just between uz.\nVenus:\nVenus de Milo, what am I to do? What a terrible thing I saw!\nSandwich:\nW-What I think is...if all w-what we see is light and shadow, p-playing with our eyes...is any of it real?\nJudge:\nVery well. The court will hear the formal testimony of these three witnesses now. You will describe in detail what you witnessed and heard at the time of the incident.\nWitness Testimony\n- The Witnesses' Account -\nGossip:\nWe saw the whole thing from start to finish, we did. Everything from the moment they went in the building.\nVenus:\nIt was less than a minute after the Reaper had gone inside that we all 'eard a big bang.\nSandwich:\nSeems to m-me that quick-to-talk is quick-to-walk. Gossip couldn't wait to go and see what had happened.\nGossip:\nI ran into the room and there he woz. The Reaper, gun in hand, standin' over the dead body!\nVenus:\nI was scared 'alf to death, me. So I ran off to find a copper.\nRyunosuke:\nIf these witnesses were there the whole day and saw everything... ...who did they see going inside the building?\nKazuma:\nOnly the victim, Inspector Gregson, and the accused, Barok van Zieks.\nGossip:\nI've seen pictures of that Reaper in the paper. I know what he looks like. And just between uz...folk love stories like this. I've made meself a tidy sum already.\nRyunosuke:\nBut wait! The room was just one of several flats in the building. Someone from another flat could have done it!\nKazuma:\nAll those flats on Fresno Street are unoccupied.\nGossip:\n'Course they are. They're small, damp, dirty and expensive to boot.\nKazuma:\nThe room in which the inspector was found is the only property in the building that's currently leased.\nSusato:\nAnd we know the leaseholder's name, don't we. It's...Hugh Boone.\nJudge:\nHmmm... The testimony the court has just heard would appear to leave little room for doubt. It's becoming increasingly difficult to see how anyone other than the defendant could have committed the crime.\nRyunosuke:\nNo!\nKazuma:\nThank you for your candour, My Lord.\nJudge:\nCounsel for the Defence, you may proceed to cross-examine the witnesses.\nRyunosuke:\nYes, My Lord! (In a closed court like this without a jury, the judge is the only person whose opinion matters. I have to break down this testimony. Somehow!)\nCross-Examination\n- The Witnesses' Account -\nGossip:\nWe saw the whole thing from start to finish, we did. Everything from the moment they went in the building.\nVenus:\nIt was less than a minute after the Reaper had gone inside that we all 'eard a big bang.\nSandwich:\nSeems to m-me that quick-to-talk is quick-to-walk. Gossip couldn't wait to go and see what had happened.\nGossip:\nI ran into the room and there he woz. The Reaper, gun in hand, standin' over the dead body!\nGossip:\nI slipped over and got blood on my hand, so I quickly wiped it off on the floor.\nVenus:\nI was scared 'alf to death, me. So I ran off to find a copper.\nRyunosuke:\n(...If I can't find any holes in this testimony...)\nSusato:\nI'm afraid the judge will give a ruling of guilty, Mr Naruhodo.\nRyunosuke:\n(The truth is, though, their combined testimony is fairly damning.)\nSusato:\nUnfortunately, there don't seem to be any obvious problems with their statements, do there?\nRyunosuke:\nStill...if Lord van Zieks really is innocent, then I'm almost certain... ...that we'll find something in there that doesn't quite add up.\nSusato:\nYou don't think... ...that one of these three could be the true culprit, do you?\nRyunosuke:\nI don't know. But what I do know... ...is that there's more to this case that has yet to be brought to light!\nRyunosuke:\nSo you wiped off the blood from your hand on the floor of the room... Are you quite sure about that?\nGossip:\nWell, well what else d'you expect me to have done, eh? Doz it really matter?\nKazuma:\nKazuma:\nThe police found no such handprint on the floor during their investigations. What exactly is the defence asserting?!\nRyunosuke:\nRyunosuke:\nIf you listen, you'll find out...Prosecutor Asogi.\nKazuma:\n...!\nRyunosuke:\nCertainly, there was no bloody handprint found...on the floor.\nKazuma:\nWhat are you trying to say?\nRyunosuke:\nThere was a handprint in blood left very clearly at the scene... ...on the back of this noticeboard.\nGossip:\nAh...ah...AAAAAAAAAAAAH!\nJudge:\nAh yes, indeed. Indisputably a handprint in the distinctive colour of blood.\nGossip:\nAye, you're dead right! That's my right hand! I'd know it anywhere!\nKazuma:\nKazuma:\nThe witness very definitely testified that he wiped his hand on the floor. Any handprints on the back of the board are irrelevant!\nRyunosuke:\nRyunosuke:\nNot if the board itself had fallen over onto the floor. In that case, it's quite possible for the witness's handprint to have ended up there.\nKazuma:\n...Just look at the floor plan of the room. The noticeboard was in the opposite corner of the room to the victim, and in an upright position. Even if it had somehow been toppled and was lying on the floor at the time... ...it would have been a considerable distance from the body.\nGossip:\nI fell over when I came across the body. So I woz basically right next to the corpse. Not on the other side of the room!\nKazuma:\nIn other words, the defence's assertion is contradictory!\nRyunosuke:\nYes...it is.\nKazuma:\n...!\nRyunosuke:\nThere's a very definite contradiction here...for which there must be a reason.\nJudge:\nI take it that you've formulated a proper hypothesis, Counsel? Regarding this apparent discrepancy between the witness's account and the handprint found at the scene.\nRyunosuke:\nI have, My Lord. This discrepancy between the witness's account and the location of the handprint is explained by...\nRyunosuke:\nThe real contradiction here is the handprint itself, not where it was found. As the court can see...it's upside down.\nJudge:\nGood gracious! So it is! If the witness had put his hand against the board, the fingers should be pointing upwards.\nKazuma:\nWhat, what does that tell us?\nRyunosuke:\nIt tells one simple fact! When this handprint was made... ...the board must have been lying on the floor as I previously suggested. Which means that after the incident...it must have been moved!\nKazuma:\nWhat?!\nKazuma:\nKazuma:\nYou're claiming that somebody moved the noticeboard after the shooting? Then tell the court who!\nRyunosuke:\nI, I don't know that yet! But the point is... ...when you consider all the testimony we've heard so far, we can now be very clear on one point!\nJudge:\nAnd that would be...?\nRyunosuke:\nThe position of the noticeboard at the time of the incident, My Lord.\nJudge:\nSo, Counsel, I must ask you to clarify your assertion for the court. At the time of the incident, where do you maintain the noticeboard was situated?\nRyunosuke:\nThis is the only possible location!\nJudge:\nImmediately adjacent to the doorway...?\nRyunosuke:\nIf the court would think back to the testimony given by the defendant earlier... ...he said that when he entered the room it was dark, and he couldn't see the body.\nGossip:\nBy 'eck!\nRyunosuke:\nIf the noticeboard had been here, the body would have been completely hidden from view. And the light from the candles would have been blocked, making the room appear darker.\nKazuma:\nKazuma:\nBut the accused also claims that the victim's body simply 'appeared' before him.\nSusato:\nThat's true. Or, in his precise words...\nVan Zieks:\nJust as I picked the firearm up to examine it, the door flew open and I heard a man scream. It was only then that the body of Inspector Gregson appeared before me.\nGossip:\nI don't know about callin' it a 'scream', but he woz talkin' about me and no mistake. Cos it woz me that kicked the door open.\nRyunosuke:\nIf you look again at the floor plan... ...consider what would happen if the door to the room was thrown open with force.\nKazuma:\nThat, that can't...\nRyunosuke:\nThe door struck the noticeboard, knocking it over, and making the victim's body visible.\nJudge:\nGood gracious!\nRyunosuke:\nMy client has told nothing but the truth! He has simply described what he saw.\nKazuma:\nArgh!\nJudge:\nOrdaaar! Ordaaar! Counsel, how has this not come to light before now?\nRyunosuke:\nAfter the incident, somebody must have righted the board and moved it... ...into the position where the police, myself and my colleague saw it when investigating the room.\nJudge:\nWitness! What have you to say for yourself?\nGossip:\nWhaaaaaat? Me, My Lord?\nRyunosuke:\nYou and your fellows were there at the scene before anybody else. It goes without saying that you must know something about the position of the noticeboard!\nJudge:\nThe witnesses in the stand will testify again. You will each explain exactly what you did upon arriving at the scene of the crime!\nGossip:\nEh, stop lookin' over your glasses at me! I get the message.\nWitness Testimony\n- The Mystery of the Moving Board -\nGossip:\nI don't know anythin' about that there noticeboard! I just wiped my hand on it, that's all.\nVenus:\nWell don't look at me. I 'aven't got a clue about it. I was doin' business with some second years at the time.\nSandwich:\nI, I don't know anything about anything. I'm j-just a bystander, me. J-Just a sign at the crossroads of life.\nGossip:\nIt woz that Reaper, I bet. He's got a face that screams 'board'.\nSandwich:\nI c-can't see how this changes anything anyway. The detective still died w-when we heard the gunshot.\nJudge:\nHmmm... So none of you can elaborate further...\nKazuma:\nShaken by the crime they witnessed, and with only the light of a few candles and an oil lamp by which to see... ...we can't expect these witnesses to be able to give a more precise account of what happened.\nVenus:\nThat's right, yeah. It don't pay to expect too much.\nSandwich:\nIt's m-man's endless quest for knowledge that's d-d-destroying the world. That's w-what I think.\nRyunosuke:\n...Do you? Really.\nKazuma:\nIn any case, as the testimony shows... ...even if the noticeboard was moved by somebody following the incident, it makes no difference. When the gunshot rang out, the accused was the only person at the scene.\nRyunosuke:\n...!\nKazuma:\nIn short, the only person who could possibly have committed this crime...is Barok van Zieks! None of this wrangling over the board changes that simple fact.\nJudge:\nQuite so, quite so. Does the defence still wish to cross-examine the witnesses despite the circumstances?\nRyunosuke:\nMost certainly, My Lord.\nJudge:\nVery well. Then you may proceed, Counsel.\nCross-Examination\n- The Mystery of the Moving Board -\nGossip:\nI don't know anythin' about that there noticeboard! I just wiped my hand on it, that's all.\nVenus:\nWell don't look at me. I 'aven't got a clue about it. I was doin' business with some second years at the time.\nVenus:\nMaybe I did sneak along behind Gossip and 'ave a little peek into the room where it all 'appened.\nSandwich:\nI, I don't know anything about anything. I'm j-just a bystander, me. J-Just a sign at the crossroads of life.\nGossip:\nIt woz that Reaper, I bet. He's got a face that screams 'board'.\nSandwich:\nI c-can't see how this changes anything anyway. The detective still died w-when we heard the gunshot.\nRyunosuke:\n(Not much to go on...)\nSusato:\nAs you've pointed out, Mr Naruhodo... ...there's no question that the noticeboard was moved. So somebody must have done it.\nRyunosuke:\nBut it did happen after the event, so... ...maybe Kazuma is right and it's not relevant to the case.\nSusato:\nBut it seems to have been deliberately positioned so as to hide the body from view. So I feel sure that there's some deeper significance to all of this.\nRyunosuke:\nYes, I know what you mean.\nSusato:\nI've no doubt there are more clues to be uncovered. You're on the right track, I can feel it. So follow your instincts!\nRyunosuke:\n...Alright, then.\nRyunosuke:\nI'm afraid that's not necessarily the case.\nSandwich:\nOh...\nRyunosuke:\nAt the scene, we found this key to the winder of the inspector's pocket watch.\nKazuma:\nA key...?\nRyunosuke:\nAnd having wound the pocket watch, we discovered that it in fact still works. You see, the watch didn't stop because it was broken at all. And that fact... ...completely undermines one of the most fundamental premises on which this entire case has been built!\nKazuma:\nWhat?!\nJudge:\nOrdaaar! Ordaaar! Orrrdaaar! B-But Counsel... ...the watch was stopped at almost exactly five o'clock.\nVenus:\nYeah, which is just when we 'eard that gunshot.\nGossip:\nIt is. Exactly the hour.\nRyunosuke:\nThe time that was showing on the watch tells us nothing other than when it wound down. It's merely a coincidence that it happened to be at five o'clock.\nKazuma:\nKazuma:\nEven if that's true... ...the three witnesses here all heard the gunshot at five o'clock. So that's obviously when this crime was committed!\nRyunosuke:\nRyunosuke:\nNo, that doesn't hold!\nKazuma:\nWhy not?\nRyunosuke:\nRecall what Inspector Lestrade said only moments ago:\nGina:\nThe boss used to wind it up every evenin' wivout fail when 'e was waitin' for 'is grub to come at the pub. Said 'e 'adn't missed a day in the last ten years, polishin' it an' windin' it. It meant the world to 'im, that watch did.\nRyunosuke:\nThe victim was in the habit of winding his watch once a day...in the evening. We can reasonably assume, therefore, that he wound the timepiece on the evening before he died as well.\nJudge:\nYes, that would be entirely reasonable.\nRyunosuke:\nBut if that's the case... ...you wouldn't expect the watch to have completely wound down by five o'clock the following day.\nGossip:\nOh! Aye...\nVenus:\nWell 'ow do you explain it then?!\nRyunosuke:\nIn summary, the evening before the day of the incident, when the gunshot rang out in that room... ...the inspector was already unable to wind his watch.\nKazuma:\nYou, you can't mean...\nRyunosuke:\nWhat would stop a man winding his watch if he's been in the habit of winding it every single evening for ten years? The obvious answer...is that he was already dead!\nJudge:\nOrdaaar! Orrrdaaar! Counsel, that is a most extraordinary claim!\nKazuma:\nKazuma:\nExtraordinary isn't the word! It's absurd! You claim he was already dead the night before? Do you really think that Scotland Yard's coroner would have overlooked something like that?!\nRyunosuke:\nAh! W-Well, um...\nSusato:\nOn that subject, there is something rather surprising... There's actually an omission in the coroner's report. The time of death is not noted.\nRyunosuke:\nAh! That's, that's right!\nGossip:\nWait a minute! You're forgetting that my legs went from under me when I kicked the door in.\nRyunosuke:\nWhat do you mean?\nGossip:\nLike I said, I planted my hand in a dirty great puddle of blood.\nKazuma:\nYes. So the victim's blood hadn't dried. It was fresh.\nGossip:\nHe catches on fast, dozn't he?\nRyunosuke:\nRyunosuke:\nBut that blood could be explained in any number of ways! It could have been put there afterwards. Some fresh blood could have been poured over the victim's body after he-\nKazuma:\nKazuma:\nDoes my learned friend think that fresh blood is available on every street corner?\nRyunosuke:\nAh!\nSusato:\nWell, it needn't necessarily have been human blood, of course.\nKazuma:\n...!\nSusato:\nWe've been told previously that Scotland Yard has no way to identify blood as human.\nJudge:\nThe problem is currently being researched. At present, you are correct. It is beyond our abilities.\nRyunosuke:\nSo then...a chicken's blood could have been used, for example.\nSusato:\nIt's certainly a possibility that it wasn't the inspector's blood at all.\nKazuma:\nKazuma:\nBut the gunshot was heard at five o'clock that afternoon. That's beyond question!\nRyunosuke:\nIs it, though?\nKazuma:\nWhat?!\nRyunosuke:\nGiven that the time of death of the victim has already been called into question... ...it isn't beyond the realms of possibility that what these witnesses heard wasn't a gunshot at all.\nVenus:\nOh, please! What are you tryin' to say?\nGossip:\nUz lot know what we heard! And it woz a loud bang that came from that there room!\nSandwich:\nNow y-you listen to me! A street seller's ears are his l-l-livelihood.\nRyunosuke:\nI don't doubt your ears, sir. But all you can state with certainty is that you heard a noise.\nGossip:\nEh?\nJudge:\nExplain yourself then, Counsel.\nRyunosuke:\nA noise that sounds like a gunshot could have been made with...\nRyunosuke:\nSomething like this. The culprit could have set off one of these to fake a gunshot.\nJudge:\nGood gracious! The very fireworks that are sold by the witness?\nVenus:\n...Now 'old on a minute! Are you sayin' I did it?! My pretty little firecrackers only make a little pop anyway. See?\nRyunosuke:\nNot a hundred of them together. The Venus Special that you sell for six hundred pennies sounds like this:\n...*BANG!*\nRyunosuke:\nAs the court can now attest...it sounds very much like a gunshot in fact.\nVenus:\nAgh agh agh agh agh!\nKazuma:\nYou're trying to suggest that somebody set one of those fireworks off at the scene?\nRyunosuke:\nI'm suggesting that somebody knew the defendant was in the room at five that day... ...and sought to implicate him by creating a sound like a gunshot for these pedlars on Fresno Street to hear!\nKazuma:\nKazuma:\nBut even the accused himself has testified that he saw no one else in the room at the time. Whether it was a gun or a firecracker, the only person present to cause that bang was Barok van Zieks!\nVenus:\nOne whiff of a match and my firecrackers go pop. See? It's why people like 'em.\nJudge:\nI fear for your fingers, young lady.\nRyunosuke:\nRyunosuke:\nRecently during my time here in Britain, I've learnt of a very useful invention indeed. Something called a, um...a time bomb.\nJudge:\nGood heavens! A bomb?!\nRyunosuke:\nYes, a device that allows you to blow up whatever you like, whenever you like.\nSusato:\nMr Naruhodo. I worry that your unfortunate phrasing there...may lead to yet another international incident.\nRyunosuke:\nAh! No no no! Wait! ...It's, it's the 'whenever you like' part that's important.\nKazuma:\nA timed device?\nRyunosuke:\nYes! Exactly! A timed device! Something of that nature could have been planted at the scene. A device that was able to produce the sound of a gunshot long after the culprit had left.\nJudge:\nYour extravagant claim will have to be substantiated with evidence, Counsel. What proof do you have to suggest in any way that a timed device was employed to create the gunshot sound?\nRyunosuke:\nAs the court has already discussed, the tip of one of the candles in this candelabrum has been blown off.\nJudge:\nIndeed. Because it was struck by the bullet, which presumably passed through the victim.\nRyunosuke:\nI don't think that's possible, My Lord.\nKazuma:\nNot possible? Why?\nRyunosuke:\nBecause of the scorching. There are gunpowder scorch marks clearly visible on the broken candle.\nJudge:\nThere are? ...Goodness, yes! But is it not the case... ...that there was also scorching on the victim around the bullet entry wound?\nRyunosuke:\nThat's right, there was. But as we heard earlier... ...scorching like that only occurs when the target is at very close range - a matter of centimetres from the gun.\nJudge:\nAh!\nRyunosuke:\nWhich means that the scorching on the candle can't possibly be the result of a gunshot.\nKazuma:\nYou're suggesting it came from the fireworks?\nGossip:\nHow can that be, eh?\nRyunosuke:\nThe fact that there's such visible scorching on the candle... ...suggests that the fireworks must have been right next to it when they exploded. Or to put it another way...the candle and firecrackers were joined together.\nThe culprit somehow attached the firecrackers at a point partway down the candle. After the killer had left the scene... ...the candle slowly burnt down along with the other two... ...until eventually it ignited the fuse of the firecrackers generating a loud...\n...*BANG!*\n.........\nRyunosuke:\nAnd that is how these three witnesses came to believe they'd heard a gunshot at five o'clock.\nJudge:\n......... Well...what a plot... And this implies that the victim could have died earlier than we've been led to believe. The previous day, even.\nGossip:\nNow...now...now just hold your horses! All uz lot here saw the victim goin' into the building, remember?\nSandwich:\nI, I couldn't forget that flame-coloured hair even if I w-wanted to.\nRyunosuke:\nThe person you saw entering the building wasn't the victim at all. ...Consider this.\nGossip:\nAh!\nRyunosuke:\nObviously anybody can wear a wig. So the person that these witnesses saw entering the building fifteen minutes before the incident occurred... ...could easily have been someone else entirely wearing the red hairpiece.\nJudge:\nSomeone else?! Do, do you mean to say...?\nRyunosuke:\nIt was the same person who contrived the firecracker trick. In other words...Inspector Gregson's killer!\n???:\nPfft...\nKazuma:\nHa ha ha ha ha ha hah! Oh, very impressive, Ryunosuke Naruhodo.\nRyunosuke:\nK-Kazuma?!\nKazuma:\nI'm really quite amazed you've come this far. But after all, wasn't I the one who told you... ...that you had all the makings of a great defence lawyer?\nRyunosuke:\n...!\nKazuma:\nI also noted the lack of a time of death in this report. A stark omission. But as far as I'm concerned...this whole country's justice system leaves a lot to be desired!\nJudge:\nOrdaaar! Ordaaar! Orrrdaaar! Prosecutor Asogi! What do you mean by that statement?\nKazuma:\nI hear that many of the leading members of Britain's judiciary are present to observe this trial today. So we cannot allow even the slightest doubt to be overlooked.\nJudge:\n...!\nKazuma:\nThe defence's assertion about the time of death based on the victim's stopped watch is just conjecture. But...while the possibility exists that my learned friend may be correct...we have a duty to explore it.\nJudge:\nHmmm... Well, certainly...I would agree with you.\nKazuma:\nAnd what immediately comes to mind is of course... ...what was Inspector Gregson doing and where did he go on the day before the incident?\nRyunosuke:\nDo you know?\nKazuma:\nThe inspector always carried out his investigative work alone. His movements were treated as confidential within Scotland Yard.\nJudge:\nEven within the Yard?\nKazuma:\nHowever, considering the evidence we've been presented with so far... ...I'd say it's fairly apparent what case the man was pursuing. Wouldn't you, my learned friend?\nSusato:\nI do have a feeling about what case he might have been investigating.\nRyunosuke:\nYes, I agree. Surely... My Lord! The defence believes it can explain to the court... ...the case that was being investigated by Inspector Gregson at the time of his death!\nJudge:\nVery well, Counsel. Present your argument to the court. What evidence is suggestive of the case being investigated by the inspector on the day prior to the incident?\nRyunosuke:\nI believe this red hairpiece points to the answer.\nKazuma:\n...!\nRyunosuke:\nWe might assume it was part of a disguise used to carry out an undercover investigation.\nJudge:\nSurely not! Such a brightly coloured hairpiece would only serve to make the inspector more noticeable.\nRyunosuke:\nYes, that's quite true. It would definitely have made him stand out in a crowd. Except, that is...in a crowd of gentlemen from the Red-Headed League.\nJudge:\nThe, the Red-Headed League?\nKazuma:\nSo...you'd already worked it out.\nJudge:\nWhat on earth is this all about? Is there such an extraordinary league of gentlemen?\nKazuma:\nThe Red-Headed League is currently under investigation for a grand deception.\nJudge:\nA deception of what nature, Counsel?\nKazuma:\nThey've been targeting red-headed men across all of London and tricking them out of small sums of money. Two men were arrested for the misdemeanour only yesterday, in fact.\nRyunosuke:\nMy Lord! The defence calls for those two men to be summoned at once!\nJudge:\nT-Two red-heads?!\nRyunosuke:\nInspector Gregson clearly infiltrated the Red-Headed League using this hairpiece. So it's very likely that he had direct contact with these criminals. And it's quite possible that such contact led to...more serious events.\nKazuma:\n.........\nJudge:\nI concur that we cannot in good conscience leave this new avenue unexplored.\nSusato:\nWell done, Mr Naruhodo!\nRyunosuke:\nWell...it's another possible line of enquiry for us at least.\nJudge:\nThe prosecution will make immediate arrangements for the charged men to appear. Bring these two Red-Headed League conspirators before me, Prosecutor Asogi!\nKazuma:\nAt once, My Lord.\nJudge:\nVery good. We will have a thirty-minute recess. Court is adjourned!\nTo be continued...\n2nd November, 12:33 p.m.\nThe Old Bailey, Defendants' Antechamber\nGina:\nOh, there you are, 'Oddo!\nSholmes:\nWhat kept you, my dear fellow?\nRyunosuke:\nHello, Mr Sholmes. Gina.\nGina:\nYou sure about wot you said in there? That the boss...you know...actually died the day before? It's pretty 'ard to swallow.\nSusato:\nYes, I was shocked by the revelation too, Gina.\nSholmes:\nAs was I! Possibly more shocked than both of you!\nRyunosuke:\n...It's not a competition, Mr Sholmes. (But I was more shocked than all of you put together.)\nSholmes:\nThis is the autopsy report in question, is it?\nRyunosuke:\nYes. It's strange that there's no time of death noted. I suppose there's a simple explanation. Or perhaps...it was a deliberate omission.\nSusato:\nOh dear... If it was deliberate... ...it puts me in mind of the last case we worked on...and Dr Sithe.\nRyunosuke:\nI know. Anyway, it seems that on the day before Lord van Zieks discovered his body... ...Inspector Gregson was investigating the Red-Headed League. So perhaps something happened with them. Come to think of it... ...you had trouble with those league men too, didn't you, Mr Sholmes? You were taken in by their trick.\nSholmes:\nNo no no! Naturally, I wasn't 'taken in' as you put it. My sleuth-hound interest was merely piqued slightly by the rare scent of a weekly four-pound income.\nRyunosuke:\n...And that scent masked the underlying scent of deception, I suppose.\nSusato:\nThe two criminals in question are the pair we saw being arrested yesterday, aren't they? In Mr Sholmes's suite, I mean.\nGina:\nThat's right, Sooze! An' it was me wot took 'em in! Thanks to a tip-off by a good, law-abidin' citizen.\nSholmes:\nIndeed. Yours truly.\nRyunosuke:\n(So it's going to be that pair in the witness stand next, is it?) Something doesn't quite make sense to me, though. The day before Inspector Gregson was found, you hadn't had trouble with the Red-Headed League yet, had you? Why would the inspector have been investigating them?\nSholmes:\nWell, the likely explanation would be... ...that Gregson's own sleuth-hound interest was piqued by the rare scent of a weekly four-pound income.\nGina:\nDon't tar 'im wiv the same brush as you, Sholmes!\nRyunosuke:\nYes, well... Then there's the whole issue of Inspector Gregson being investigated by Lord van Zieks for some reason.\nSusato:\nThe Reaper...the Red-Headed League... Inspector Gregson...Lord van Zieks...\nRyunosuke:\n...And Kazuma.\nSusato:\n...!\nRyunosuke:\nI feel as though he knew we'd arrive at this point somehow.\nSusato:\nGosh! I, I think you're right...\nRyunosuke:\n(What's he really trying to achieve here today?)\nSholmes:\nAll the answers will soon be revealed. ...Observe the time, my dear fellow. This recess will be over very shortly.\nRyunosuke:\nYes, you're right. (Kazuma was determined that he should be the one to prosecute this trial. And he was determined that I should take the defence. Just what is it that he's hoping to make me see, I wonder? I get the feeling we're a long way from the end of this trial yet...) Are you ready then, Miss Susato?\nSusato:\nYes!\n2nd November, 1:00 p.m.\nThe Old Bailey Courtroom\nJudge:\nIn the name of Her Majesty the Queen, I hereby declare this court to be in session again. We resume the closed court hearing of Barok van Zieks, here present, who stands accused of murder. Now then, Prosecutor Asogi...\nKazuma:\nMy Lord?\nJudge:\nHave you summoned the witnesses as requested?\nKazuma:\nYes. The two members of the Red-Headed League who planned and carried out the deception. They arrived not long ago from the local prison by police carriage.\nJudge:\nVery good. Bailiff, usher the two men into the courtroom!\nKazuma:\nThese two men are currently being held by the police on suspicion of attempted extortion. You may omit your occupations. But please state your names now for the court.\nDe Rousseau:\nI am Fabien de Rousseau. A descendant of ze great de Rousseau family from Nice, en France.\nDe Rossi:\nAnd my-a name is Peppino de Rossi! I am the third son of the great familia de Rossi - the landowners from Napoli!\nKazuma:\nThe two men first became acquainted at a boarding school for European nobility.\nDe Rousseau:\nZose who graduate from Temsik are ze future leaders of Europe. ...But! Do you 'ave any idea 'ow boring it is to be born wiz noble blood? ...Alors! I make it my mission to get ze better of ze world by employing ze little grey cells of my brain. Zat is all I am trying to do, uh.\nRyunosuke:\nSo...that's the only reason for this whole grand deception you've been carrying out?\nDe Rousseau:\n...Oui. You could say zat.\nDe Rossi:\nNot bad, ay? He has the grand ideals, but the petty plans! This strange combination is-a the charm of the Hairlarious Brothers! Si, capo?\nDe Rousseau:\n......... Listen to me, Peppino. I 'ave two sings to say to you:\nDe Rossi:\nEh? Che? Are you about to tell me one of your grandi anecdotes? Evviva!\nDe Rousseau:\nFirstly, I want you to stop calling me zis 'capo'. And secondly... ..we are not ze 'Airlarious Brothers. Zis is serious business.\nDe Rossi:\nChe bello! There it is! The capo's trump-a card: the furrowed brow! It is deep, uh, capo? The furrow, and the meaning of your words!\nJudge:\nThe court has been led to believe that under the banner of the 'Red-Headed League'... ...you have conspired to swindle money from unsuspecting members of the public. Is this true?\nDe Rousseau:\nOui. C'est ça.\nJudge:\nAnd what exactly was the nature of this deception by which you planned to defraud?\nDe Rousseau:\n...Alors, I will explain it.\nDe Rossi:\nNo, capo! Leave it to-a me! As you see, we both have the vivid red hair, no? At school, we were teased for this without pity. The capo here, he was many times behind the schoolhouse, crying like the Trevi Fountain. 'Uèèè! Zose dogs! One day ze world will respect us red-'eads!' Every night, he would bury his-a head in his-a pillow and weep for the injustice.\nDe Rousseau:\nC'est bien, Peppino! Enough! I will explain ze rest. Ze first step was ze newspaper advertisement. About one week before ze plan was put into operation, we listed ze same notice in every paper in London.\nRyunosuke:\nYes, we saw that notice. It was this one, I believe. Entitled 'To the Red-Headed League'.\nDe Rousseau:\nOui. C'est ça. I am honoured zat you 'ave seen it.\nRyunosuke:\nIt states that the only condition for joining the league is having flame-coloured hair. And that if you satisfy the interview panel and are admitted into the league... ...you could receive a weekly income of four pounds.\nKazuma:\nOn the date specified, red-headed hopefuls gathered in droves at a park specified in the advertisement. And from each person present, this pair took an application fee of five shillings.\nDe Rousseau:\nAnd wiz ze money, to France! It was a plan most elegant, non?\nKazuma:\nNo, it was most dishonourable. But to be frank, I'm stunned anybody was foolish enough to be taken in by such an obvious trick.\nSusato:\nThe park was described by one witness as 'choked with red-headed folk, like a coster's orange barrow'.\nKazuma:\nAnd the day on which all these men gathered to apply was the day before the victim was discovered. Crucially, these two men spoke face to face with every single person present that day.\nDe Rousseau:\nOui. I 'ave seen more red-'eaded people in one day zan I will see in ze rest of my life.\nDe Rossi:\nSi, si. And-a now, every time I see the capo's hair, I feel sick to my stomach!\nDe Rousseau:\nAnyway, why 'ave we been summoned 'ere today?\nRyunosuke:\nSorry?\nDe Rousseau:\nZe date for our trial was not until tomorrow, I was told.\nKazuma:\nNaturally, neither of these men have been told any details about this trial. They've only been shown this photograph.\nJudge:\nVery good. So, Mr de Rousseau and Mr de Rossi, you will now give your formal testimony for the court... ...on the subject of the gentleman pictured in this photograph.\nDe Rousseau:\nOf course. We are always ready to 'elp wiz ze law.\nWitness Testimony\n- The Man in the Photograph -\nDe Rousseau:\nWe 'ad more zan one thousand red-'eaded people assemble in ze park on Lime Street zat day.\nDe Rossi:\nBut I don't recall the man in this-a photograph. Ay, capo?\nDe Rousseau:\nNon, I don't remember 'im. Obviously 'e is dead now. But I assure you, 'e was not in ze park.\nDe Rossi:\nAllora! This victim is-a nothing to do with us!\nDe Rousseau:\nYou 'ave a lot to answer for, Peppino. It is your fault zat we got caught in ze first place.\nKazuma:\nYou've given sworn testimony that this man in the photograph was not present. Can you be certain?\nDe Rousseau:\nOui, oui. I am quite certain. We did not interview zis man.\nDe Rossi:\nNobody looking like-a this came to the park. This, I can promise!\nJudge:\nIt must be noted that you have been arrested for a grand deception, however. Accordingly, this court has little confidence in your assurances.\nDe Rossi:\n...!  ...Uffa! With this attitude, we get-a nowhere, uh?\nRyunosuke:\n(He's really-a sulking now...)\nKazuma:\nThis confidential document was obtained directly from Scotland Yard. It records an entry from the inspector's private diary dated the day before the incident. It reads, 'Lime Street, Red-Headed League, Undercover.'\nDe Rossi:\nAh! I have the answer! Maybe there was another, similar event in the park on the day in question, ay?\nDe Rousseau:\nZat is ridiculous.\nRyunosuke:\n(There's no question that Inspector Gregson was investigating the Red-Headed League. Which means it's quite possible that's when he was killed!)\nJudge:\nVery well. The defence may proceed with the cross-examination now.\nRyunosuke:\nAh. Yes, My Lord!\nCross-Examination\n- The Man in the Photograph -\nDe Rousseau:\nWe 'ad more zan one thousand red-'eaded people assemble in ze park on Lime Street zat day.\nDe Rossi:\nBut I don't recall the man in this-a photograph. Ay, capo?\nDe Rousseau:\nNon, I don't remember 'im. Obviously 'e is dead now. But I assure you, 'e was not in ze park.\nDe Rossi:\nAllora! This victim is-a nothing to do with us!\nDe Rousseau:\nYou 'ave a lot to answer for, Peppino. It is your fault zat we got caught in ze first place.\nRyunosuke:\n(They haven't told us much we didn't already know...)\nSusato:\nWhat do you think, Mr Naruhodo?\nRyunosuke:\nWell, if it was in the inspector's diary, it seems likely that he must have gone to Lime Street that day. And yet these two both claim they didn't see him...\nSusato:\nI have to say... ...they don't appear to be telling lies.\nRyunosuke:\nWell, they are experts in deception, don't forget. Sounding plausible is their specialty. They may be lying simply to avoid being implicated in this case as well.\nSusato:\nSurely if they were truly experts in deception, they wouldn't have been caught.\nRyunosuke:\n(Well, yes, you do have a point there...) ...It seems to me like we need more information.\nSusato:\nDefinitely!\nRyunosuke:\nI wonder if I could ask you to examine this identification book very closely... ...Miss Lestrade?\nKazuma:\nWhy Miss Lestrade?\nJudge:\nWhat is your intention here, Counsel?\nRyunosuke:\nIs this really a fake, or is it genuine? That's the question. ...Which we can't answer ourselves.\nKazuma:\nKazuma:\nDon't be ridiculous. No Scotland Yard detective would allow his - or her - identification to be stolen.\n???:\nGina:\nThat...that... That IS the boss's! ...No question about it.\nKazuma:\nIt can't be!\nRyunosuke:\nAs I suspected. The 'undercover detective' who attended the Red-Headed League's enrolment on the day in question... ...was the real Inspector Gregson carrying out an incognito investigation!\nDe Rousseau:\nZu... Zut aloooooors!\nJudge:\nO-Ordaaar! Ordaaar!\nGina:\nBut...if the boss 'ad 'is identification stolen... ...'e would've reported it straight away. I mean, 'e was always on at me about it. If ya lose summat, report it at once, 'e'd say.\nRyunosuke:\nCould it be, then... ...that the inspector was physically unable to report it?\nDe Rossi:\nPhysically... Ay?! What are you-a saying?\nKazuma:\nUnable to...? You're, you're not suggesting...?\nRyunosuke:\nYes! It's quite possible that he was killed before he had the chance to report his identification stolen!\nKazuma:\nNo!\nJudge:\nOrdaaar! Ordaaar! Ordaaaaaar!!!\nRyunosuke:\nThe defence posits that the victim was killed the day before his body was discovered, at a different location. Do you two...have anything to say about that?!\nDe Rossi:\nUèèèèèèèèèèèè! I know-a nothing! Uèèèèèèèèè! I done-a nothing! Uèèèèèèèèè!\nDe Rousseau:\nPull yourself together, Peppino! Mon Dieu! You can behave a little more like a master criminal zan zat, non?\nDe Rossi:\nUèèèèèèèèè! Now I wish I had-a returned to Italia! Uèèèèèèèèèèèèèèèèèè!\nDe Rousseau:\nS-Stop crying, Peppino, please! Otherwise I...I...\nGina:\nLumme! Stop yer whinin' an' start talkin'!\nJudge:\nWell...I believe the court will need to hear your story in considerably greater detail.\nDe Rossi:\nI know-a nothing! Uèèèèèèèèè! I done-a nothing! Uèèèèèèèèè!\nKazuma:\nBut you will tell everything! ...Or face the worst possible outcome.\nDe Rousseau:\nUgh... Uuuuuugh...\nJudge:\nYou will dry your eyes and testify again... ...about these identification papers, and the precise circumstances under which you came by them!\nDe Rossi:\nUèèèèèèèèèèèèèèèèèè!\nRyunosuke:\n(For crying out loud...)\nWitness Testimony\n- The Detective and the Identification -\nDe Rousseau:\nZe, ze truth is, we took 'im prisoner and kept 'im for ze night at our secret 'ideout.\nEven though I didn't sink 'e was a real detective, I, I was too scared to let 'im go zat day, just in case.\nDe Rossi:\nWe took the man's identification from him and shut-a him in the room next to ours!\nDe Rousseau:\nZere might 'ave been a little tussle, but we did 'im no 'arm. And ze next mornin', we let 'im go.\nDe Rossi:\nHe spent-a the night in a nice room! It was-a nothing like prison really! Uèèèèèè!\nJudge:\nThis, this is outrageous! You imprisoned the man?!\nDe Rossi:\nBut! No! Si! No! It, it was not-a like a prison! He was-a very comfortable and-a calm and-a happy! Ay, capo?\nDe Rousseau:\n......... It, it was never part of my plan! I swear it!\nDe Rossi:\nUffa! So...so you think it was-a my fault, ay? Just because I got the date of the ferry wrong... by one-a little-a day!\nDe Rousseau:\nI do not sink it was your fault, Peppino. I know it!\nDe Rossi:\nNo no no no! Per favore, capo. Is not-a fair.\nJudge:\nYou shall have plenty of time for squabbling back at the prison, gentlemen.\nDe Rousseau:\nUff! I don't believe zis... 'Ow could 'e 'ave been a real detective...?\nJudge:\nCounsel for the Defence, proceed with the cross-examination!\nRyunosuke:\n(So on the day before the incident... ...Gregson spent the night confined in this pair's hideout...)\nCross-Examination\n- The Detective and the Identification -\nDe Rousseau:\nZe, ze truth is, we took 'im prisoner and kept 'im for ze night at our secret 'ideout.\nDe Rousseau:\nEven though I didn't sink 'e was a real detective, I, I was too scared to let 'im go zat day, just in case.\nDe Rossi:\nWe took the man's identification from him and shut-a him in the room next to ours!\nDe Rousseau:\nZere might 'ave been a little tussle, but we did 'im no 'arm. And ze next mornin', we let 'im go.\nDe Rossi:\nHe tried to escape, but the capo put-a the collare on him and dragged him back...like what he did-a to me, see?\nDe Rossi:\nHe spent-a the night in a nice room! It was-a nothing like prison really! Uèèèèèè!\nRyunosuke:\n(Not much to go on, really...)\nSusato:\nTheir testimony does make me wonder, you know. About this pocket watch belonging to the inspector, I mean.\nRyunosuke:\n(Ah yes, the one he treasured so much, apparently.)\nSusato:\nIf he was confined but not restrained, as the witnesses are implying... ...he would still have been able to wind his watch.\nRyunosuke:\nThat's very true, yes. (So did Inspector Gregson actually die while he was being held captive by these red-heads?)\nSusato:\nIn which case, is it possible that these two young men are responsible for Inspector Gregson's...?\nRyunosuke:\nTo be honest...I find that hard to believe. Perhaps we should try to find out exactly what happened.\nSusato:\nVery wise, Mr Naruhodo, yes.\nRyunosuke:\nSo the day before his body was discovered, Inspector Gregson was taken prisoner while working incognito...\nDe Rousseau:\nNon non! It was not like zat! It was 'ardly a prison. It was an...invitation to stay. It was 'omely.\nRyunosuke:\nHowever you describe it, there's one glaring inconsistency that remains.\nJudge:\nWhat inconsistency is this, Counsel?\nRyunosuke:\nI would ask the court to look closely at this photograph of the victim, Inspector Gregson. You will see...that there is no red ring visible around his neck!\nDe Rossi:\nEh?! But, but that-a makes no sense! It was me who took-a the collare off the man in the morning. And I saw the red bruises on his-a neck, just like I have!\nRyunosuke:\nGiven that the mark is still clearly visible on this witness's neck... ...we'd expect to see bruising on the victim, who put in the collar more recently than Mr de Rossi!\nJudge:\nI-Indeed! That is most peculiar...\nDe Rossi:\nBut what we-a tell you, uh? Uh? We say this...from-a the beginning... Many times! Uèèèèèèèèèèèè!\nDe Rousseau:\nOui, Peppino is right. Ze man in ze photograph... ...'e is someone different to ze man we 'eld captive zat niiiiiiiiight!\nJudge:\nOrdaaar! Ordaaar! Ordaaaaaar!!!\nKazuma:\nIt would appear then, that on the day before the incident... ...the man who visited the park on Lime Street posing as an incognito inspector... ...was not Inspector Gregson at all!\nRyunosuke:\nRyunosuke:\nIf that's true, however, how do you explain the inspector's identification?\nKazuma:\n...!\nRyunosuke:\nThis is a genuine identification book, issued by Scotland Yard. It's inconceivable that someone could have stolen such an important item from the inspector. The prosecution made that assertion itself!\nKazuma:\n...!\nSusato:\nAnd we also know that the inspector had made a note about the Red-Headed League in his diary for that day. Which surely means we can't divorce the two events completely.\nJudge:\nThe inconsistency noted by the defence is most troubling. If it were the real Inspector Gregson whom these two red-headed gentlemen encountered... ...the fact that no bruising can be seen around his neck defies explanation.\nKazuma:\nBut equally, if they actually encountered an imposter... ...how did that person come to be in possession of the real inspector's identification?\nJudge:\nDoes the defence have some plausible explanation, Counsel?\nRyunosuke:\n(The whole thing defies explanation.)\nSusato:\nIt is for precisely these occasions that we keep meticulous notes in the Court Record, Mr Naruhodo. Because those are the facts, and the facts cannot lie!\nRyunosuke:\n(No, the facts can't lie... ...even when they point to something so incredible, it's almost unbelievable!) Well, My Lord, the true identity of the person who turned up in the park for the Red-Headed League's enrolment... ...is revealed by information in the Court Record, I believe.\nJudge:\nGood gracious!\nKazuma:\nVery tantalising, Mr Naruhodo. So, why don't you help us all to see whatever truth it is that you've apparently seen? Who exactly was this 'inspector' that appeared before Mr de Rousseau and Mr de Rossi?\nRyunosuke:\nThough it seems incredible, I admit, the undeniable facts point to only one thing: Since no bruising can be seen on the victim's neck... ...the person who these two red-headed men took prisoner that day cannot have been Inspector Gregson.\nKazuma:\nIn other words, your whole argument up to now has been a waste of time.\nRyunosuke:\nRyunosuke:\nOn the contrary. I haven't finished.\nKazuma:\nWhat?\nRyunosuke:\nThere's no bruising on the victim's neck, so the question immediately posed next is... ...who exactly was this man in the park on Lime Street found to be carrying Inspector Gregson's identification?\nDe Rossi:\nSi... Si! That's-a right! We tell the same story every time: Whoever this man was, the capo dragged him from-a pillar to-a post with the dog collare!\nDe Rousseau:\nMon Dieu, Peppino! I was not so 'arsh as you say, uh?\nDe Rossi:\nSo who was that-a falso inspector, ay? Who was he?!\nKazuma:\nClearly the defence has an idea about that. About the true identity of the man these two imprisoned that night...\nJudge:\nI must ask the counsel for the defence to elaborate posthaste. Who did the witnesses encounter in the park posing as Inspector Gregson?\nJudge:\nGoodness me! Isn't...isn't that...?\nRyunosuke:\nOne of the witnesses who was in the stand in this very courtroom earlier today! A nameless man, whose only occupation appears to be peddling hearsay to passers-by.\nKazuma:\nKazuma:\nWhat on earth would a street seller be doing with a police inspector's identification papers? Witnesses! Is this the man or not?!\nDe Rousseau:\nWhat 'as 'appened to 'is lip?\nRyunosuke:\nAh!\nDe Rossi:\nSi, this-a man is not for the Red-Headed League, ay? He's-a looking for the Twisted Lip League, no?\nKazuma:\nPerhaps rather than making such a rash claim next time... you should bite your lip instead.\nRyunosuke:\nIt seems improbable, yes. But one undeniable fact remains! During his testimony earlier... ...I noted something around the man's neck: a red ring of bruising!\nDe Rousseau:\nEh?\nKazuma:\nWhat?!\nRyunosuke:\nThe defence demands that Mr Gossip be brought back to the stand!\nJudge:\nOrdaaar! Orrrdaaar! ...Bailiff! Bring the aforementioned witness back into the courtroom! Immediately!\nJudge:\nWell I never... An undeniable ring of bruising indeed. And identical...to that of the witness beside him!\nGossip:\nNow what's going on here, eh? I've always had this, me. It's a birthmark, in't it?\nRyunosuke:\nA birthmark, you say?\nKazuma:\nI assume the reason you've been recalled to the stand has been explained to you?\nGossip:\nAye, um...summat about an inspector again. But I'm telling you, you've got it all wrong as usual.\nRyunosuke:\nYou're denying all knowledge of it?\nGossip:\nWell of course I am! Are you trying to kill me with all this nonsense, eh?\nKazuma:\nWell...at least you'll have more stories to peddle back on Fresno Street, won't you? Now, we're going to need you to testify again.\nRyunosuke:\nAnd you, Mr de Rousseau and Mr de Rossi. I'm sure you'll cooperate, won't you?\nDe Rousseau:\nDo we 'ave any choice?\nDe Rossi:\nWe are in big-a trouble, ay, capo?\nJudge:\nThat's quite enough dilatory chatter. Proceed with the testimony!\nWitness Testimony\n- The Inspector and the Identification Revisited -\nDe Rousseau:\nZe man who claimed to be an inspector zat day... was definitely not zis man.\nDe Rossi:\nIs right, si! You think we would-a forget these grand lips, uh?\nGossip:\nI never leave Fresno Street, alright? I've no interest in any Red-Headed League.\nI'm all alone in the world, me. I've no kinfolk or nothing. Why would I be involved in something like that?\nJust look at me, eh. Doz it look like I could carry off a disguise with a face like this?\nJudge:\nIt would certainly appear that we have the wrong man.\nDe Rousseau:\nWhat 'ave I been telling you, uh? Zere was no need for zis pointless testimony.\nRyunosuke:\nUuugh...\nGossip:\nThat's right. I'm just a simple pedlar, remember. Fresno Street's all I know. How would I have come by a police inspector's identification book, eh?\nRyunosuke:\nWell, yes, that's hard to explain, but...\nJudge:\nHmph. A brief cross-examination, I think, Counsel. Very brief.\nRyunosuke:\n(Ugh. Isn't there anyone in this courtroom who thinks I might be on to something?)\nSusato:\nI stand steadfastly at your side as always, Mr Naruhodo!\nKazuma:\n.........\nCross-Examination\n- The Inspector and the Identification Revisited -\nDe Rousseau:\nZe man who claimed to be an inspector zat day... was definitely not zis man.\nDe Rossi:\nIs right, si! You think we would-a forget these grand lips, uh?\nGossip:\nI never leave Fresno Street, alright? I've no interest in any Red-Headed League.\nBoone:\nAye, I rent the room where that fella was found, it's true. For what difference it makes.\nGossip/Boone:\nI'm all alone in the world, me. I've no kinfolk or nothing. Why would I be involved in something like that?\nGossip/Boone:\nJust look at me, eh. Doz it look like I could carry off a disguise with a face like this?\nRyunosuke:\nIf you have no 'kinfolk' as you put it... ...then explain why it is that among the sparce furnishings, we found this photograph in the room?\nBoone:\nAh!\nRyunosuke:\nI presume, as you've been renting the room, that this photograph belongs to you, does it not?\nBoone:\nOh, um...well...\nRyunosuke:\nMr Boone, drop the pretence...and tell the court exactly who you really are!\nBoone:\nI, I don't know what...what you mean. I'm a pedlar! I, I keep telling you so! You really don't need to bother with me. Please, just...just leave it alone!\nKazuma:\nAs the man says... ...leave it alone. Whatever the truth is about this man's life, it has no bearing on this case. Because it's simply not possible that he impersonated Inspector Gregson!\nRyunosuke:\nRyunosuke:\nHow can you be so sure?\nKazuma:\nJust look at the man! No amount of disguise could ever hide those unmissable features!\nRyunosuke:\nRyunosuke:\nBut what if...we were to look at this the other way around?\nKazuma:\nWhat do you mean?\nJudge:\nYes, Counsel, what do you mean?\nRyunosuke:\nWell...there's no denying that Mr Boone's lip is very prominent indeed. But consider the possibility...that his prominent lip is itself part of an elaborate disguise!\nBoone:\n...!\nRyunosuke:\nThen hiding that prominent feature - in other words revealing his true face... ...would make an utterly impenetrable disguise! Wouldn't you agree...Mr Hugh Boone?\nBoone:\nAaah... AAAAAAAAAAAARGH!\nJudge:\nGood- Witness! Are you still hiding the truth from this court?!\nBoone:\n.........\nSusato:\nIf, if that's a disguise, then... ...underneath it, his true identity must be...\nRyunosuke:\nYes, that's right. There's really only one person he could really be. My Lord! The defence believes it can reveal Mr Boone's true identity to the court!\nBoone:\nNo... Please...no...\nJudge:\nVery well then, Counsel... What is the true identity of this pedlar who goes simply by the name of 'Gossip' on the street?\nRyunosuke:\nYour real name...is actually Mr Vigil, isn't it? Mr Daley Vigil.\nBoone:\nYAAAAAAAAAAAAGH!!!\nJudge:\nI don't recall that name, Counsel. Who is this Mr Vigil?\nRyunosuke:\nIt's a name I encountered yesterday, My Lord. It has to do with a certain client of Mr Herlock Sholmes. A young gentlewoman came to the detective asking him to locate her missing husband. The woman in this photograph, in fact. This is Mrs Vigil.\nKazuma:\nW-What?\nRyunosuke:\nFrom what I understand, you haven't returned home since the night before the inspector was found dead.\nBoone:\nErm...\nRyunosuke:\nBut of course on that night, you were being held captive by the two Red-Headed League men.\nKazuma:\nAnd last night, you were put up by the prosecution service in preparation for testifying in this trial. Because we'd been led to believe that you, Miss Venus and Mr Sandwich were all homeless. Being important witnesses in this case, we needed to know where we could find you, of course.\nRyunosuke:\nAnd that explains why you've not only been unable to return home, but also unable to contact your wife... ...who's been beside herself with worry, waiting for you at the Vigil residence.\nBoone:\nNow, now just you hold on a minute! I don't have the first idea-\nRyunosuke:\nWhat I'm talking about? Really?\nBoone:\n...!\nRyunosuke:\nIt's a simple enough matter to confirm my suspicions! All we have to do is pull off that disguise!\nBoone:\nN-No... Please!\nJudge:\nBailiff! Bring soap, a sponge and a washbowl at once! Mr de Rousseau and Mr de Rossi, you will restrain the witness!\nOui, My Lord!\nSi, My Lord!\nBoone:\nUWAAAAAAAAAGH!\nN-No... Stop... Get off... Please...\nDOOOOOOOOOOOON'T!!!\n.........\nJudge:\nWell... ...we are now seeing your true features, I presume?\n.........\nKazuma:\nLift your head, sir. So the court can see your face.\n.........\nJudge:\nIt would appear that the defence counsel's assertion was entirely correct. This has all been a very elaborate deception. So, witnesses, tell the court: have you seen this man before?\nDe Rousseau:\nI, I don't believe it, but...\nDe Rossi:\nSi, there is-a no question. This is-a the inspector we saw in the park!\nJudge:\nExtraordinary!\nRyunosuke:\nOn the day of the Red-Headed League enrolment... ...the man claiming to be Inspector Gregson who appeared before Mr de Rousseau and Mr de Rossi in the park...\nKazuma:\n...Was you, disguised as the inspector! Or rather... ...was you posing as the inspector in no disguise at all!\nVigil:\n.........\nRyunosuke:\nMr Vigil was formerly employed as the chief warder at Barclay Prison.\nJudge:\nThe chief warder? Then your career had promise. Why, you would quite possibly have become the future governor of the prison. What on earth have you been doing peddling tittle-tattle on Fresno Street?\nRyunosuke:\nWell, it's been ten years since Mr Vigil worked at the prison.\nKazuma:\nTen years?\nVigil:\n......... I'm...I'm really dreadfully sorry about all of this. Yes, it's true... I am Daley Vigil.\nKazuma:\nAnd you were the chief warder at Barclay Prison ten years ago...? ......... So where did Mr Hugh Boone come from?\nVigil:\nBoone is...the other me. It's a name I invented.\nJudge:\nWell...evidently there is a great deal under the surface here.\nVigil:\nI'll...explain everything. I'll tell you just how wretched my life has become.\nVigil:\nAs you say, it was ten years ago now that my employment as Barclay's chief warder came to an end. Having left the prison service, I searched for some new occupation by which to earn a wage. But times were hard in London, and I found no suitable engagements at all. In desperation one day, I turned my hand at selling wares on Fresno Street.\nRyunosuke:\nBut your wife appears to know nothing of this. She still maintains that you are the chief warder at Barclay Prison.\nVigil:\nI was utterly determined that my wife should not know of my failings. Which is why I've never told her. I opened an account at the bank under the name of Hugh Boone... ...and I rented the cheapest room I could find on Fresno Street.\nRyunosuke:\nThe scene of the very crime we're investigating.\nVigil:\n...Yes, that's right. A place from which I could emerge every morning at eight as a squalid pedlar... ...and transform myself back every evening at five into a well-dressed man about town before returning home. That quickly became my daily routine.\nKazuma:\nI was puzzled by the lack of furniture in the room... ...but that explains it.\nRyunosuke:\nBut why on earth didn't you just tell us this in the first place?\nVigil:\nI have a wife, sir. And two sons. And without wishing to sound self-conceited, they regard me with some pride. I...couldn't bring myself to disappoint them.\nRyunosuke:\nSo instead you decided to conceal your occupation from them?\nVigil:\n...Yes. I've made such a terrible mess of everything...\nKazuma:\nStill, one thing doesn't add up. No matter how many 'titbits' of information you could sell to passing gentlemen, even at sixpence a piece... ...you couldn't hope to match the salary you must have commanded as chief warder at the prison.\nJudge:\nVery true. To have kept your family in comfort, despite ten years of somewhat misbegotten employment...\nVigil:\n......... That was all thanks to Inspector Gregson.\nRyunosuke:\nWha...? Inspector Gregson?! What on earth...?\nVigil:\nIt was some years after I'd invented Boone and begun my other life as a street seller. He - the inspector, that is - recognised me one day.\nJudge:\nDo you mean to say...the victim was an acquaintance of yours?!\nVigil:\nI knew him from my time working at the prison. When he saw what I'd become, he...was deeply troubled for me and my family. And from that day forward, he visited me on Fresno Street with increasing regularity. Then one day...he asked me if I would carry out a secret assignment for him.\nRyunosuke:\nA, a secret...?! What was it?!\nVigil:\nI was to...impersonate the inspector.\nKazuma:\nWhat?! Impersonate him?!\nVigil:\nWe always met in that little room so the inspector could brief me. 'Visit Orczy's tomorrow and take a statement from the proprietress.' It was always something along those lines. Surveillance work, interviewing people... On those occasions, he would lend me his identification so people would believe who I was. My instructions were to make an impression. To let people know that Inspector Gregson had been at work. And for those services, he compensated me financially.\nJudge:\nA Scotland Yard inspector willingly relinquished his identification into your care with intent to deceive?! That - as I'm sure I need not point out - is a very serious criminal offence.\nKazuma:\nBut why? What was the point of you impersonating him?\nVigil:\nI...I truthfully do not know. All I can say... ...is that the inspector warned me on numerous occasions:\nGregson:\nNow remember, Vigil. I need your solemn word. You don't blab about this to anyone, alright? Ever! Even if... Well, if I end up a croaker.\nVigil:\nIn time, he started to bring papers with him to the room as well. It became something of a second office for him.\nRyunosuke:\nSo...in fact... ...the person who declared himself to be Inspector Gregson at the park on Lime Street was really....\nVigil:\nYes. It was me. Acting on the inspector's orders. As usual, I removed my Boone disguise... ...and then went as instructed to the park, armed with the inspector's identification book. It never occurred to me...that the bruise on my neck might give me away.\n.........\nKazuma:\nWell... ...it would seem this confession completely destroys the defence's case.\nRyunosuke:\n...!\nJudge:\nExplain yourself, Prosecutor Asogi.\nKazuma:\nMy learned friend's assertion was as follows: The victim was killed at another location on the day before his corpse was discovered... ...at the hands of these two Red-Headed League men when they imprisoned the inspector.\nVigil:\nBut no! That can't be! After all...it wasn't the inspector who went to the park that day; it was me!\nSusato:\nOh goodness...\nDe Rousseau:\nFinally, we 'ave clarity. We 'ad nothing to do wiz ze murder of ze inspector. And merci, monsieur de la défense...for proving it.\nRyunosuke:\nWha... AAAAAAAAAAAARGH!\nJudge:\nOrdaaar! Ordaaar! Ordaaaaaar!!! Indeed it would appear that we have reached a de facto conclusion of sorts. These witnesses had no involvement in the murder of the victim... ...as proven, somewhat ironically, by the defence.\nRyunosuke:\nUuugh...\nJudge:\nI hereby call an end to the cross-examination.\n???:\nKazuma:\nPardon me, My Lord, but with your permission... ...I would like to pose one further question to the witness.\nRyunosuke:\nKazuma...?\nJudge:\nWhat question, Counsel?\nKazuma:\nIt concerns the events of ten years ago. I believe you would have been present at a very significant execution that was carried out at the time.\nVigil:\nTen years ago...?\nRyunosuke:\n...! (The execution of the Professor...Genshin Asogi!)\nKazuma:\nI want to know...exactly what your involvement was.\nVigil:\nOh!\nKazuma:\nAnswer me, man!\nVigil:\n...!\nJudge:\nOne moment, Counsel! Is this related to the current case?\nKazuma:\n......... Naturally. It is the prosecution's belief that this case and the events of ten years ago... ...are inextricably linked.\nJudge:\nHmmm... Does the defence concur, Counsel?\nRyunosuke:\n(Kazuma... You're not yourself. You're not as calm and collected as usual.)\nSusato:\nPoor Kazuma-sama. No wonder he's acting this way. Mr Vigil's memories of what happened ten years ago... ...would tell the tale of Genshin Asogi's last moments. His own father...\nRyunosuke:\nI know. I do understand that. (But even so...) Kazu- ...Prosecutor Asogi.\nKazuma:\n...!\nRyunosuke:\nDo you genuinely believe... ...that this question requires an answer in order to learn the truth behind Inspector Gregson's death?\nKazuma:\nI need you to trust me. ...Please.\nRyunosuke:\n......... Very well. Then the defence has no objection.\nJudge:\n...I see. In that case, you will answer the question, witness.\nVigil:\n......... The, the truth is... ...I remember very little of that time.\nKazuma:\nYou've forgotten?!\nVigil:\nI'm sorry to say, yes. As I said, I resigned from my role at the prison ten years ago. But for some peculiar reason...my memory of the events leading up to that moment is extremely hazy.\nKazuma:\n.........\nSusato:\nDoes that not strike you as strange, Mr Naruhodo?\nRyunosuke:\nSorry?\nSusato:\nWell, ten years is a long time... ...but to have forgotten the reason why he left such an important job...\nRyunosuke:\nYes...you're right. (And not only that... ...Mr Vigil's claim contradicts what we already know.)\nKazuma:\nThe human spirit is a fragile thing. It's broken all too easily. Which is why... ...we have a tendency to wrap it up for protection.\nVigil:\nSorry? The, the human spirit...? I'm afraid I don't understand what you mean.\nKazuma:\nWhen we experience pain and suffering that we feel unable to bear... ...we block it out. Obliterate it from our memories. Seal it away. But it never truly leaves us. If the seal is broken, the memories resurface. And when they do...that fragile spirit may finally be crushed.\nVigil:\nBut, but I really don't...\nSusato:\nKazuma-sama...\nKazuma:\nBut if it must be crushed, then so be it! Because the truth will not stay buried! It's coming out...one way or another!\nRyunosuke:\n......... (Right... Now I understand. It's clear what his intentions are. He means to expose the truth...at any cost.)\nSusato:\n.........\nRyunosuke:\n(Perhaps if I pointed out the contradiction in what Mr Vigil claimed earlier... ...it might cause some crucial memories to return to him. ...But should I? Should I present the evidence or not?)\nRyunosuke:\nMr Vigil! I'd like you to look at this... Evidence that clearly contradicts your version of events!\nRyunosuke:\nJust a few moments ago, you made the following statement: 'I resigned from my role at the prison ten years ago.'\nVigil:\nAh...well, yes...\nRyunosuke:\nIn other words, you claim to have left the post of chief warder of your own volition.\nVigil:\nWell...yes, of course. ...Why?\nRyunosuke:\nTell me... ...do you remember seeing this document before?\nVigil:\nNo. No, I don't.\nRyunosuke:\nThis is a dismissal notice ordering the immediate termination of a prison staff member's employment.\nKazuma:\nA dismissal notice...?\nRyunosuke:\nAnd the name on the notice...is yours, Mr Vigil.\nVigil:\nWha...? WHAT?! It's...it's...MINE?!\nKazuma:\nSo you didn't resign from the prison service at all. For some reason...you were dismissed as chief warder from Barclay.\nVigil:\nNo, there's...there's been some mistake. I'm...I'm sure... I'm sure I tendered my resignation! This dismissal notice is nonsense! ...Isn't...it?\nKazuma:\nIf you were forcibly dismissed, there must have been good reason. Clearly...you did something. Mr Vigil! It's time to break the seal and have you remember!\nVigil:\n.........\nKazuma:\n......... According to the few remaining records... ...the final execution that you supervised was on 17th June ten years ago. And on that day, something very serious took place at Barclay Prison.\nVigil:\nThe 17th...of June...\nRyunosuke:\nWas, was that... ...the Professor's execution?\nVigil:\nPro...fessor...\nKazuma:\nAs you were the chief warder at the time, it stands to reason... ...that you would have been present throughout the proceedings.\nVigil:\nIt, it does...sound...familiar...\nKazuma:\nAnd yet! That execution never took place! ...The convict, ostensibly executed earlier that day, later re-emerged from his grave...\nVigil:\nThe convict...came back to life...\nRyunosuke:\nIn the cemetery in the middle of the night. There was a witness.\nSusato:\nHowever, the witness claims that a moment after he saw the convict clambering out of his grave... ...a gunshot rang out from over his shoulder. And the bullet pierced the Professor's chest...killing him instantly. Those may have been the Professor's actual last moments.\nVigil:\nYeees... Yeeeeeesss...\nKazuma:\nSeeing as you were in charge of overseeing executions at the time... ...you must know the truth about what really happened! It's in your head! Somewhere deep down!\nVigil:\n.........\nKazuma:\nWell...Chief Warder Daley Vigil? I know there are memories in your head that can explain what happened on 17th June ten years ago. And now it's time...for you to drag them up!\nVigil:\nAgh... Aaaaaagh...\nRyunosuke:\nMr...Mr Vigil...?\nVigil:\n......... .................. Yes... The whole prison... It was complete chaos... The prisoner escaped... He was killed...in the cemetery... The shocking news ripped through Barclay like a hurricane...\nRyunosuke:\nWha......... WHAAAAAAAAAT?!\nJudge:\nO-Ordaaar! ...Ordaaar! Ordaaar! Do, do you mean to say, Mr Vigil... that your memories of the time have returned?\nVigil:\nMy head, it's... It's like some floodgates have been opened. The images... The screams...\nSusato:\nOh...my goodness...\nVigil:\nThe papers... There...were reports... Articles...about a man who'd seen a ghost...\nRyunosuke:\nYes. Enoch Drebber.\nJudge:\nBut, but surely those reports were exaggerated...\nVigil:\n......... There were traces at the scene...\nSusato:\nTraces of what?\nVigil:\nIn Lowgate Cemetery...at plot number 139... Blood... Lots of blood... That's where the man was buried of course. Obviously...something terrible had happened there.\nJudge:\nThe depths of conspiracy and depravity from which this tale is emerging are quite staggering.\nKazuma:\nI've reviewed the police records from that time extensively. A thorough investigation was conducted by Scotland Yard... ...to ascertain how the convict managed to escape in the first place. And the conclusion reached by the investigating team was... ...that a member of the prison staff must have been involved.\nJudge:\nAre you suggesting... ...that a prison warder abetted the man's bid for freedom?!\nVigil:\nYes... Yes, and I...I was suspected of doing it. Of using that mass murderer's execution...as a way to help him escape...\nRyunosuke:\nYou did what?!\nVigil:\nI remember now. The horror of it all is coming back to me. One evening a few days after the execution, some detectives came to the prison. I was called to the governor's office at the top of the watchtower.\nI'm sorry, Daley, this is a serious business. But I cannae help you noo. As chief warder, you were responsible for overseeing the execution afore, eh? Well, it seems the fellas at Scotland Yard want to have a few wee words with you aboot it. You'd better pack your things, laddie. You're to attend in person.\nVigil:\nAs soon as he told me that,  my mind just went completely blank. And...and the next thing I knew, I...\n(The Professor... The most hated killer in our country's history... And I let him escape. I'm finished... My life......is over!)\nVigil:\nAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAH!\nJudge:\nOrdaaar! Ordaaar! Bailiff! Fetch a doctor at once! Court is adjourned for today with immediate effect!\nSo, with Mr Vigil's collapse, proceedings came to an abrupt end for the day... ...once again overshadowed by the legacy of that notorious killer, appearing like a cursed ghost ship on a foggy ocean. Lord van Zieks, Mr Vigil, Kazuma...and Gregson... All of them bound by invisible chains anchored to the same wreckage in the murky depths of the past. But the miraculous light that had been trying to cut through the gloom and shine on those tragic events... ...was playing on the edges of the truth at last.\nTo be continued...",
  "characters": [
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Susato Mikotoba",
      "age": "16",
      "description1": "A judicial assistant sent to Britain on a study tour. She's the epitome of a refined Japanese lady and a huge help to me always."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Iris Wilson",
      "age": "10",
      "description1": "An extraordinary young girl who lives with Mr Sholmes. She has a degree in medicine and is the author of a popular series of short stories."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Herlock Sholmes",
      "age": "34",
      "description1": "There's not a person in the world who hasn't heard of this famous great detective, whose deductions never fail to surprise."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Yujin Mikotoba",
      "age": "43",
      "description1": "A medical school professor at the Imperial Yumei University. He's an authority in forensic medicine, and Miss Susato's father."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Seishiro Jigoku",
      "age": "43",
      "description1": "The Minister of Foreign Affairs and a judge of the Supreme Court of Judicature in Japan. He's the man who acquitted me when I was once accused of murder."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Mael Stronghart",
      "age": "53",
      "description1": "The Lord Chief Justice, who wields absolute authority in judicial matters, including the appointment of lawyers. He's a thoroughly intimidating man."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Barok van Zieks",
      "age": "33",
      "description1": "A prosecutor known as the Reaper of the Bailey. Supposedly, the souls of those he prosecutes are eternally damned, one way or another."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Gina Lestrade",
      "age": "18",
      "description1": "A mostly reformed pickpocket who's now a self-appointed 'detective inspector'. She's really making waves in her new apprenticeship."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Evie Vigil",
      "age": "36",
      "description1": "A client who has engaged the services of Mr Sholmes. She has asked the great detective to help track down her missing husband."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Daley Vigil",
      "age": "40",
      "description1": "A man who's disappeared without a word to his family. He was the former chief warder of Barclay Prison."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Barry Caidin",
      "age": "51",
      "description1": "The governor of Barclay Prison. It seems he was good friends with Professor Mikotoba during the Japanese man's time in Britain as a visiting student."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Tobias Gregson",
      "age": "45",
      "description1": "A murdered Scotland Yard inspector. He was stern and single-minded in his approach, and a great lover of fish and chips."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Kazuma Asogi",
      "age": "24",
      "description1": "My best friend, who I had believed to be dead. He lost his memory somehow, but has now materialised as a prosecutor in the British courts."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Gossip",
      "age": "??",
      "description1": "A pedlar plying his trade on Fresno Street. He seems to make his money selling interesting items of news to passers-by."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Venus",
      "age": "??",
      "description1": "A pedlar plying her trade on Fresno Street. She seems to make her money selling meagre little fireworks to children."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Sandwich",
      "age": "??",
      "description1": "A mysterious 'signpost' who can be found on Fresno street. He looks familiar somehow..."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Fabien de Rousseau",
      "age": "26",
      "description1": "The fraudster behind the Red-Headed League swindle, who was caught by Mr Sholmes. He derives from the French aristocracy, it seems."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Peppino de Rossi",
      "age": "25",
      "description1": "A lackey of de Rousseau and conspirator in the Red-Headed League swindle. The third son of a great Italian landowner."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Maria Gorey",
      "age": "19",
      "description1": "The daughter of Dr Sithe who's also a coroner like her mother. She carries out all the autopsy work on corpses."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Armband",
      "type": "",
      "obtained": "",
      "description1": "An armband I inherited from Kazuma. It identifies the wearer as a defence lawyer throughout the Empire of Japan."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Red-Headed League Article",
      "type": "",
      "obtained": "",
      "description1": "An advertisement from the newspaper that's entitled 'To the Red-Headed League'. It seems somewhat suspicious in nature."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Photograph of Mr Vigil",
      "type": "",
      "obtained": "",
      "description1": "A photographic print received from Mrs Vigil in order to aid with locating her missing husband. He appears to have no particularly distinctive facial features."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Letter of Introduction",
      "type": "",
      "obtained": "",
      "description1": "A note of introduction on our behalf from Professor Mikotoba to Governor Caidin. Hopefully now he'll be willing to talk to us.",
      "description2": "A note of introduction on our behalf from Professor Mikotoba to Governor Caidin. It's written on the back of a ticket for passage on a steamship."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Dismissal Notice",
      "type": "",
      "obtained": "",
      "description1": "The harsh reprimand incurred by Mr Vigil ten years ago that resulted in him losing his job as chief warder of Barclay Prison."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Red Hairpiece",
      "type": "",
      "obtained": "",
      "description1": "A flame-red wig found at the scene of the crime on Fresno Street. Presumably it belonged to Inspector Gregson..."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Candelabrum",
      "type": "",
      "obtained": "",
      "description1": "A candelabrum from the wall of the room on Fresno Street where the inspector was found dead. The top of one of the candles appears to have been blown off."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Revolver",
      "type": "",
      "obtained": "",
      "description1": "The murder weapon that was found at the scene of the crime on Fresno Street. Probably best to avoid handling it."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Policeman Figurine",
      "type": "",
      "obtained": "",
      "description1": "A small and rather endearing model of a British policeman found at the scene of the crime on Fresno Street.",
      "description2": "A model of a British policeman found at the scene of the crime on Fresno Street. Giving it a twist causes a key-like shaft to pop out from the base."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Framed Photograph",
      "type": "",
      "obtained": "",
      "description1": "A photographic print of a smiling Mrs Vigil in her younger years. It was found on a desk at the scene of the crime."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Gregson's Photograph",
      "type": "",
      "obtained": "",
      "description1": "An old photographic print displayed rather prominently in Inspector Gregson's office, as if it was a treasured memory.",
      "description2": "An old photographic print displayed rather prominently in Inspector Gregson's office. The person on the left is Lord Klint van Zieks."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Autopsy Report",
      "type": "",
      "obtained": "",
      "description1": "Inspector Gregson's autopsy report, stating that death was instant, resulting from a bullet shot at close range.",
      "description2": "The autopsy report from the examination of Inspector Gregson's body. According to the coroner, Dr Gorey, an accurate estimation of the time of death is not possible."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Crime Scene Floor Plan",
      "type": "",
      "obtained": "",
      "description1": "A plan of the small room in the building of flats on Fresno Street where the body of the victim, Inspector Gregson, was found."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Noticeboard",
      "type": "",
      "obtained": "",
      "description1": "A free-standing noticeboard completely covered in notes and articles relating to victims of the Reaper of the Bailey.",
      "description2": "A free-standing noticeboard completely covered in notes and articles relating to victims of the Reaper. There is a bloody handprint on the back side."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Venus Firecracker",
      "type": "",
      "obtained": "",
      "description1": "The Venus Special firecracker consisting of one hundred smaller fireworks at sixpence each. What sort of bang could it make...?",
      "description2": "The Venus Special firecracker consisting of one hundred smaller fireworks at sixpence each. It goes off like a gunshot."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Photograph of the Victim",
      "type": "",
      "obtained": "",
      "description1": "A photographic print of the victim, Inspector Gregson. His body appears to be tightly curled up and there's a red hairpiece on his head."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Gregson's Pocket Watch",
      "type": "",
      "obtained": "",
      "description1": "Inspector Gregson's pocket watch that he wound without fail every single day. It's no longer ticking and the glass over the face is cracked.",
      "description2": "Inspector Gregson's pocket watch that he wound without fail every single day. Having wound it up, it's started ticking again."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Inspector's Identification",
      "type": "",
      "obtained": "",
      "description1": "The identification of a man claiming to be a detective inspector, confiscated by Mr de Rousseau and Mr de Rossi.",
      "description2": "Inspector Gregson's police identification. It's the official warrant card issued to him by Scotland Yard."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Commemorative Photograph",
      "type": "",
      "obtained": "",
      "description1": "A photograph taken in the foyer of the Great Waterloo Hotel on the morning of Professor Mikotoba and Judge Jigoku's arrival in London for the symposium."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "The Asogi Papers",
      "type": "",
      "obtained": "",
      "description1": "The last will and testament of Genshin Asogi that Mr Vigil claims disappeared after the convict's execution. Apparently Mr Asogi described it as 'the only weapon I have left'.",
      "description2": "The last will and testament of Genshin Asogi that Mr Vigil claims disappeared after the convict's execution. It seems there was a third page to it."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Gregson's Trunk",
      "type": "",
      "obtained": "",
      "description1": "Inspector Gregson's metal travelling trunk that was removed from the scene, but subsequently recovered by Gina."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Passport",
      "type": "",
      "obtained": "",
      "description1": "A passport document that was in Inspector Gregson's possession. It was issued for travel to France the day before his body was discovered."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Klint's Autopsy Report",
      "type": "",
      "obtained": "",
      "description1": "The autopsy report of the final victim of the infamous Professor. The report was authored by Dr John H. Wilson.",
      "description2": "The report from the autopsy of the Professor's final victim. It's signed by Dr John H. Wilson who carried out the procedure, though Professor Mikotoba actually penned the report."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Iris's Lucky Charm",
      "type": "",
      "obtained": "",
      "description1": "A little doll of Mr Sholmes in hare form. I've been told to tug its ears if I run out of options in the trial today..."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Great Sword 'Karuma'",
      "type": "",
      "obtained": "",
      "description1": "The illustrious blade passed down through generations of the Asogi clan. The prized sword's tip has a small piece missing."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Evacuation Drill Itinerary",
      "type": "",
      "obtained": "",
      "description1": "A notice about a practice evacuation to be carried out by the crew of the SS Grouse the night before the ship arrived in Dover. It was found in Judge Jigoku's cabin."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Small Component",
      "type": "",
      "obtained": "",
      "description1": "A small machine part that Mr Sholmes found in Judge Jigoku's cabin on the SS Grouse.",
      "description2": "A small machine part that Mr Sholmes found in Judge Jigoku's cabin on the SS Grouse. It's now clear that it's the missing 'crown' of Inspector Gregson's pocket watch. * (This update to the description is entirely optional, and can only be achieved by examining anywhere on this evidence, then the tip on Gregson's Pocket Watch before the former evidence is specifically presented in court. However, this method still occurs in Story Mode.)"
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Telegram from Japan",
      "type": "",
      "obtained": "",
      "description1": "A telegram from Inspector Hosonaga in Japan with details of the telegram he managed to locate by stealing into Judge Jigoku's office."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Mr Asogi's Ring",
      "type": "",
      "obtained": "",
      "description1": "A ring belonging to Genshin Asogi found in Lord Klint van Zieks's stomach during the autopsy. The claws clasping the gem look sharp enough to cause a very nasty scratch."
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Klint van Zieks's Will",
      "type": "",
      "obtained": "",
      "description1": "The last will and testament of Lord Klint van Zieks that has been hidden inside the great sword Karuma for years. A trump card left behind by Genshin Asogi."
    }
  ],
  "turns": []
}