{
  "previousContext": "",
  "characters": [
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Susato Mikotoba",
      "age": "16",
      "description1": "A judicial assistant sent to Britain on a study tour. She's the epitome of a refined Japanese lady and a huge help to me always."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Iris Wilson",
      "age": "10",
      "description1": "An extraordinary young girl who lives with Mr Sholmes. She has a degree in medicine and is the author of a popular series of short stories."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Herlock Sholmes",
      "age": "34",
      "description1": "There's not a person in the world who hasn't heard of this famous great detective, whose deductions never fail to surprise."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Yujin Mikotoba",
      "age": "43",
      "description1": "A medical school professor at the Imperial Yumei University. He's an authority in forensic medicine, and Miss Susato's father."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Seishiro Jigoku",
      "age": "43",
      "description1": "The Minister of Foreign Affairs and a judge of the Supreme Court of Judicature in Japan. He's the man who acquitted me when I was once accused of murder."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Mael Stronghart",
      "age": "53",
      "description1": "The Lord Chief Justice, who wields absolute authority in judicial matters, including the appointment of lawyers. He's a thoroughly intimidating man."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Barok van Zieks",
      "age": "33",
      "description1": "A prosecutor known as the Reaper of the Bailey. Supposedly, the souls of those he prosecutes are eternally damned, one way or another."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Gina Lestrade",
      "age": "18",
      "description1": "A mostly reformed pickpocket who's now a self-appointed 'detective inspector'. She's really making waves in her new apprenticeship."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Evie Vigil",
      "age": "36",
      "description1": "A client who has engaged the services of Mr Sholmes. She has asked the great detective to help track down her missing husband."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Daley Vigil",
      "age": "40",
      "description1": "A man who's disappeared without a word to his family. He was the former chief warder of Barclay Prison."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Barry Caidin",
      "age": "51",
      "description1": "The governor of Barclay Prison. It seems he was good friends with Professor Mikotoba during the Japanese man's time in Britain as a visiting student."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Tobias Gregson",
      "age": "45",
      "description1": "A murdered Scotland Yard inspector. He was stern and single-minded in his approach, and a great lover of fish and chips."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Kazuma Asogi",
      "age": "24",
      "description1": "My best friend, who I had believed to be dead. He lost his memory somehow, but has now materialised as a prosecutor in the British courts."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Gossip",
      "age": "??",
      "description1": "A pedlar plying his trade on Fresno Street. He seems to make his money selling interesting items of news to passers-by."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Venus",
      "age": "??",
      "description1": "A pedlar plying her trade on Fresno Street. She seems to make her money selling meagre little fireworks to children."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Sandwich",
      "age": "??",
      "description1": "A mysterious 'signpost' who can be found on Fresno street. He looks familiar somehow..."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Fabien de Rousseau",
      "age": "26",
      "description1": "The fraudster behind the Red-Headed League swindle, who was caught by Mr Sholmes. He derives from the French aristocracy, it seems."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Peppino de Rossi",
      "age": "25",
      "description1": "A lackey of de Rousseau and conspirator in the Red-Headed League swindle. The third son of a great Italian landowner."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Maria Gorey",
      "age": "19",
      "description1": "The daughter of Dr Sithe who's also a coroner like her mother. She carries out all the autopsy work on corpses."
    }
  ],
  "evidences": [
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Armband",
      "type": "",
      "obtained": "",
      "description1": "An armband I inherited from Kazuma. It identifies the wearer as a defence lawyer throughout the Empire of Japan."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Red-Headed League Article",
      "type": "",
      "obtained": "",
      "description1": "An advertisement from the newspaper that's entitled 'To the Red-Headed League'. It seems somewhat suspicious in nature."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Photograph of Mr Vigil",
      "type": "",
      "obtained": "",
      "description1": "A photographic print received from Mrs Vigil in order to aid with locating her missing husband. He appears to have no particularly distinctive facial features."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Letter of Introduction",
      "type": "",
      "obtained": "",
      "description1": "A note of introduction on our behalf from Professor Mikotoba to Governor Caidin. Hopefully now he'll be willing to talk to us.",
      "description2": "A note of introduction on our behalf from Professor Mikotoba to Governor Caidin. It's written on the back of a ticket for passage on a steamship."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Dismissal Notice",
      "type": "",
      "obtained": "",
      "description1": "The harsh reprimand incurred by Mr Vigil ten years ago that resulted in him losing his job as chief warder of Barclay Prison."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Red Hairpiece",
      "type": "",
      "obtained": "",
      "description1": "A flame-red wig found at the scene of the crime on Fresno Street. Presumably it belonged to Inspector Gregson..."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Candelabrum",
      "type": "",
      "obtained": "",
      "description1": "A candelabrum from the wall of the room on Fresno Street where the inspector was found dead. The top of one of the candles appears to have been blown off."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Revolver",
      "type": "",
      "obtained": "",
      "description1": "The murder weapon that was found at the scene of the crime on Fresno Street. Probably best to avoid handling it."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Policeman Figurine",
      "type": "",
      "obtained": "",
      "description1": "A small and rather endearing model of a British policeman found at the scene of the crime on Fresno Street.",
      "description2": "A model of a British policeman found at the scene of the crime on Fresno Street. Giving it a twist causes a key-like shaft to pop out from the base."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Framed Photograph",
      "type": "",
      "obtained": "",
      "description1": "A photographic print of a smiling Mrs Vigil in her younger years. It was found on a desk at the scene of the crime."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Gregson's Photograph",
      "type": "",
      "obtained": "",
      "description1": "An old photographic print displayed rather prominently in Inspector Gregson's office, as if it was a treasured memory.",
      "description2": "An old photographic print displayed rather prominently in Inspector Gregson's office. The person on the left is Lord Klint van Zieks."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Autopsy Report",
      "type": "",
      "obtained": "",
      "description1": "Inspector Gregson's autopsy report, stating that death was instant, resulting from a bullet shot at close range.",
      "description2": "The autopsy report from the examination of Inspector Gregson's body. According to the coroner, Dr Gorey, an accurate estimation of the time of death is not possible."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Crime Scene Floor Plan",
      "type": "",
      "obtained": "",
      "description1": "A plan of the small room in the building of flats on Fresno Street where the body of the victim, Inspector Gregson, was found."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Noticeboard",
      "type": "",
      "obtained": "",
      "description1": "A free-standing noticeboard completely covered in notes and articles relating to victims of the Reaper of the Bailey.",
      "description2": "A free-standing noticeboard completely covered in notes and articles relating to victims of the Reaper. There is a bloody handprint on the back side."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Venus Firecracker",
      "type": "",
      "obtained": "",
      "description1": "The Venus Special firecracker consisting of one hundred smaller fireworks at sixpence each. What sort of bang could it make...?",
      "description2": "The Venus Special firecracker consisting of one hundred smaller fireworks at sixpence each. It goes off like a gunshot."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Photograph of the Victim",
      "type": "",
      "obtained": "",
      "description1": "A photographic print of the victim, Inspector Gregson. His body appears to be tightly curled up and there's a red hairpiece on his head."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Gregson's Pocket Watch",
      "type": "",
      "obtained": "",
      "description1": "Inspector Gregson's pocket watch that he wound without fail every single day. It's no longer ticking and the glass over the face is cracked.",
      "description2": "Inspector Gregson's pocket watch that he wound without fail every single day. Having wound it up, it's started ticking again."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Inspector's Identification",
      "type": "",
      "obtained": "",
      "description1": "The identification of a man claiming to be a detective inspector, confiscated by Mr de Rousseau and Mr de Rossi.",
      "description2": "Inspector Gregson's police identification. It's the official warrant card issued to him by Scotland Yard."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Commemorative Photograph",
      "type": "",
      "obtained": "",
      "description1": "A photograph taken in the foyer of the Great Waterloo Hotel on the morning of Professor Mikotoba and Judge Jigoku's arrival in London for the symposium."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "The Asogi Papers",
      "type": "",
      "obtained": "",
      "description1": "The last will and testament of Genshin Asogi that Mr Vigil claims disappeared after the convict's execution. Apparently Mr Asogi described it as 'the only weapon I have left'.",
      "description2": "The last will and testament of Genshin Asogi that Mr Vigil claims disappeared after the convict's execution. It seems there was a third page to it."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Gregson's Trunk",
      "type": "",
      "obtained": "",
      "description1": "Inspector Gregson's metal travelling trunk that was removed from the scene, but subsequently recovered by Gina."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Passport",
      "type": "",
      "obtained": "",
      "description1": "A passport document that was in Inspector Gregson's possession. It was issued for travel to France the day before his body was discovered."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Klint's Autopsy Report",
      "type": "",
      "obtained": "",
      "description1": "The autopsy report of the final victim of the infamous Professor. The report was authored by Dr John H. Wilson.",
      "description2": "The report from the autopsy of the Professor's final victim. It's signed by Dr John H. Wilson who carried out the procedure, though Professor Mikotoba actually penned the report."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Iris's Lucky Charm",
      "type": "",
      "obtained": "",
      "description1": "A little doll of Mr Sholmes in hare form. I've been told to tug its ears if I run out of options in the trial today..."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Great Sword 'Karuma'",
      "type": "",
      "obtained": "",
      "description1": "The illustrious blade passed down through generations of the Asogi clan. The prized sword's tip has a small piece missing."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Evacuation Drill Itinerary",
      "type": "",
      "obtained": "",
      "description1": "A notice about a practice evacuation to be carried out by the crew of the SS Grouse the night before the ship arrived in Dover. It was found in Judge Jigoku's cabin."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Small Component",
      "type": "",
      "obtained": "",
      "description1": "A small machine part that Mr Sholmes found in Judge Jigoku's cabin on the SS Grouse.",
      "description2": "A small machine part that Mr Sholmes found in Judge Jigoku's cabin on the SS Grouse. It's now clear that it's the missing 'crown' of Inspector Gregson's pocket watch. * (This update to the description is entirely optional, and can only be achieved by examining anywhere on this evidence, then the tip on Gregson's Pocket Watch before the former evidence is specifically presented in court. However, this method still occurs in Story Mode.)"
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Telegram from Japan",
      "type": "",
      "obtained": "",
      "description1": "A telegram from Inspector Hosonaga in Japan with details of the telegram he managed to locate by stealing into Judge Jigoku's office."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Mr Asogi's Ring",
      "type": "",
      "obtained": "",
      "description1": "A ring belonging to Genshin Asogi found in Lord Klint van Zieks's stomach during the autopsy. The claws clasping the gem look sharp enough to cause a very nasty scratch."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Klint van Zieks's Will",
      "type": "",
      "obtained": "",
      "description1": "The last will and testament of Lord Klint van Zieks that has been hidden inside the great sword Karuma for years. A trump card left behind by Genshin Asogi."
    }
  ],
  "turns": [
    {
      "category": "cross_examination",
      "newContext": "The Resolve of Ryunosuke Naruhodo\n\n\n\n\n\n\n\n\n\nTranscriptAlthough this is technically a separate \"case\", for the purposes of this wiki this transcript will be treated as a continuation of Twisted Karma and His Last Bow.Part 1\n\nPart 2\n\nPart 3Final ChapterThe Resolve of Ryunosuke Naruhodo3rd November, 9:14 a.m.\nThe Old Bailey, Defendants' AntechamberRyunosuke:\n(So...the time's finally come. Today...we unravel everything!) I'll be counting on your support more than ever today, Miss Susato!Susato:\n.........Ryunosuke:\nUm... Miss Susato?Susato:\nAh! Oh no! W-What's the matter, Mr Naruhodo?Ryunosuke:\nUm...nothing? I was just saying that I'll be relying on your support today, but...Susato:\nI'm so sorry! Of course! I, I know I can be rather incompetent at times, but... ...I shan't let you down!Ryunosuke:\n...Would you mind helping me to my feet, then?Susato:\nOh dear! I'm really very sorry!Ryunosuke:\n(Susato-san isn't her usual self at all. But that's hardly surprising, I suppose. She's just found out that her father is the partner of a world-famous detective. Not to mention...)Susato:\nAh! G-Good morning, sir!Ryunosuke:\n...! Lord van Zieks!Van Zieks:\nThank you for all your efforts yesterday.Ryunosuke:\nWha... (Did I hear that correctly?)Van Zieks:\n...What?Ryunosuke:\nOh! Um, no, nothing. Just...I hope we can clear things up today. (I really can't make this man out. His face says 'I hate you' but his words are...almost jovial today. In fact, he hasn't been very Reaper-like at all since this all began yesterday.)Susato:\nLord van Zieks isn't the Reaper, Mr Naruhodo.Ryunosuke:\n...Good point.Van Zieks:\nThe Reaper? I suppose in hindsight... ...I shouldn't have allowed that misconception to go unchallenged.Ryunosuke:\nHuh?Van Zieks:\nIt was my tacit acceptance of the pseudonym... My failure to stop the Reaper becoming something more than a mere legend...that led to all this.Susato:\nBut you're not to blame for that, Lord van Zieks!Ryunosuke:\nIt's only because serious crime in the capital dropped off so sharply when the public started calling you that. That's why you didn't say anything, isn't it?Van Zieks:\n...To be frank, I'm not sure that was the sole reason.Ryunosuke:\nWhat do you mean?Van Zieks:\nThere was a rumour at the time that the Reaper was really the ghost of my late brother.Susato:\n...!Van Zieks:\nThat having been slain by that evil killer, Klint's restless spirit returned as some sort of demigod... ...to wield a deadly blade of justice where I, by dint of the law, could not.Ryunosuke:\nYes...we've heard that story too.Van Zieks:\nWhen I lost him... ...I felt as though I'd lost my guiding light.  I didn't know where to go or what to do. And so... ...in some small way, I wonder if perhaps those rumours made me feel his absence a little less keenly. Even if I knew it was just an illusion. Just some nonsense conjured up by an over-imaginative public.Susato:\nHe was obviously extremely important to you. Lord Klint van Zieks...Ryunosuke:\nWell...what's important now is uncovering the truth. That's all that matters. I...know that you didn't take anyone's life.Van Zieks:\n...!Ryunosuke:\nAnd I intend to prove that beyond a shadow of a doubt in court today.Van Zieks:\n......... I never thought I'd say this... ...but I can see it in your eyes. That burning desire to cut through all the lies and deception. I can't deny it any longer. You...are a lawyer of absolute integrity.Ryunosuke:\n...Thank you.Van Zieks:\nNow tell me... ...why do I detect the scent of expensive tea leaves in the air?Ryunosuke:\nOh! Iris! When did you get here?Susato:\nOh!Iris:\nAh! Um... I brought you one of my special blends. Hurley loves it. He says it helps him to clear his head!Van Zieks:\n...I thank you.Iris:\nOh... Hee hee...Ryunosuke:\n(That's surely the first and last time I'll ever see a sight like this...) You seem different today, Iris.Iris:\nOh...?Ryunosuke:\nSort of...subdued, I suppose.Iris:\nI am not!Ryunosuke:\n(What happened yesterday is obviously still playing on her mind a lot. She's clearly very troubled about having stolen that autopsy report from Dr Sithe's laboratory.)Iris:\nAlright then...good luck to you both! I have to make a move now.Susato:\nOh! You're not staying?Ryunosuke:\nI thought you'd want to watch today's proceedings.Iris:\nWell...I'd like to cheer you on, obviously. But I've got lots to get ready.Ryunosuke:\nGet ready? For what?Iris:\nOh, yes. Would you take this?Ryunosuke:\nIsn't that one of the little felt dolls that's usually dangling from your knapsack?Iris:\nYes! It's a lucky charm! A little Hurley that I made once.Ryunosuke:\nA 'Hurley'? (It looks more like a 'Hareley' to me...)Iris:\nIf for some reason you completely run out of options in the trial today... ...then just pull this little Hurley's ears as hard as you possibly can!Ryunosuke:\nWha...? Pull his ears?Iris:\nThat's right! It's a way to bring good luck. ...I think you might need it!Iris's lucky charm has been entered into the Court Record.Susato:\nY-You think...what we'll need is luck...?Examine evidence\n\n\n\n\n\n\n\n\n\nIris's Lucky Charm\n\n\n\n\n\n\n\n\n\nEars\n\n\n\n\n\n\n\nSusato:\nWhat a charming little rabbity version of Mr Sholmes. Do you suppose this is how Iris sees him?\nRyunosuke:\n.........\nSusato:\nAre you alright, Mr Naruhodo? Your eyes are veritably boring into the poor doll's ears.\nRyunosuke:\nOh, sorry. I was just wondering... What do you suppose would happen if I were to tug its ears with all my might right now?!\nSusato:\nI'm sure that we'll find out...when the time is right. To become a proper gentleman, you really must learn stoic patience!\nRyunosuke:\n(...But I want to know!)Iris:\nI just sneaked a peek inside the courtroom. And...it seemed very different to normal.Van Zieks:\nYes, it would seem... ...that a certain someone has decided to pull out all the stops.Ryunosuke:\nWhat does that mean?Van Zieks:\n.........Susato:\nWhat about Mr Sholmes, Iris?Iris:\nI...don't know. He was out all night and he hadn't come home by the time I left this morning.Susato:\nOh... I see...Ryunosuke:\nWas Professor Mikotoba out all night too, do you think, Miss Susato?Susato:\nYes, it would seem so. I telegrammed the hotel this morning... ...and apparently they didn't come back to their rooms last night at all.Ryunosuke:\n'They'?Susato:\nFather and Judge Jigoku, I mean.Ryunosuke:\nJudge Jigoku, too?Susato:\nThat's right. Nobody appears to have seen either of them since yesterday.Bailiff:\nCounsel for the Defence and the defendant! Court is about to be in session. Please make your way inside the courtroom at once!Iris:\nGood luck then, Runo! Good luck, Susie!Ryunosuke:\nYes...thanks, Iris.Iris:\nAnd you, Mr Reaper. I hope it goes well!Van Zieks:\nOnce again, I thank you for the delicious tea, It was very soothing.Iris:\nOh, I'm so glad!Susato:\nWe must go inside now, Lord van Zieks!Van Zieks:\nHm...Ryunosuke:\n(Lord van Zieks has always been the formidable prosecutor I've had to lock horns with in court. But not today. Today I battle with another in pursuit of the truth. My best friend, Kazuma Asogi, who I trust more than anyone else in the world. Now I understand what it was that drew me here to Britain all those months ago. Now I know exactly what destiny had in store for me. It's all been leading up to this one day... To this one trial... To this one final reckoning!)3rd November, 9:30 a.m.\nThe Old Bailey CourtroomRyunosuke:\nIt feels even more oppressive here than it did yesterday... (There are cold stares piercing me like knives from all sides today.)Susato:\nAh! M-Mr Naruhodo! Look!Ryunosuke:\nL... Lord Stronghart!Kazuma:\n.........Ryunosuke:\n(Kazuma must have known beforehand...)Stronghart:\nThe ramifications of this trial now extend far beyond the murder of one Scotland Yard inspector. In fact, events have come to light that threaten to rock the very foundations of our country's legal system.Kazuma:\nThe escape of a condemned criminal on the night of his execution...the subsequent unlawful shooting of the man... ...and the revelation that prison staff must have been complicit in the jailbreak.Stronghart:\nBritain is currently hosting influential members of the judiciary from countries all around the world. It is imperative that we uncover the truth in these proceedings to avoid international embarrassment. By royal decree, this will continue to be a closed trial... ...and one over which I, Mael Stronghart, exercise total and unequivocal authority.Ryunosuke:\nThe, the six jurors' flames just...Stronghart:\nAs was the case in yesterday's proceedings, those here present in the public gallery... ...are distinguished members of our judiciary, assembled to bear witness to a fair judicial process.Van Zieks:\nIn other words...a collection of your acolytes, Lord Stronghart.Stronghart:\n......... On a personal note, I find this most distressing, Lord van Zieks. You were a prosecutor of exceptional talent. Much like your brother Klint in fact...Van Zieks:\n.........Stronghart:\nIn the name of Her Majesty the Queen, I hereby declare this court to be in session... ...for the trial of Barok van Zieks, who officially stands accused of murder.Van Zieks:\n.........Stronghart:\nCounsels for the prosecution and defense...are you in full readiness to proceed?Ryunosuke:\nThe defence is ready...My Lord.Kazuma:\nAs is the prosecution.Stronghart:\nYesterday's proceedings brought to light a shocking and disturbing fact: There was a side to the victim, Inspector Tobias Gregson, that was unknown to his superiors at Scotland Yard.Kazuma:\nYes, he was carrying out operations in secret, which Scotland Yard knew nothing about.Stronghart:\nAnd in those clandestine operations, he had an accomplice.Kazuma:\nMr Daley Vigil, who would be given the inspector's identification... ...and present himself around the capital in order to establish credible alibis for Gregson. In that way, Gregson appeared to be carrying out his regular Scotland Yard work when in fact he wasn't.Stronghart:\nAt the end of yesterday's session, Mr Vigil, who had been suffering from amnesia, regained his memory. It would appear he buried his memories of the time deep inside himself as a means of self-preservation. Because whilst he was engaged as chief warder at Barclay Prison, he abetted the convict's escape.Kazuma:\nMr Vigil is currently recuperating at St Synner's. He's recovered enough to give a signed statement about his movements on the day prior to the incident. He's formally admitted to posing as Gregson whilst investigating the Red-Headed League.Stronghart:\nWhich brings us to the crucial issue of the victim's time of death. The defence yesterday proposed a suggestion that the victim may have been killed one day earlier. This was based largely on the discovery that the victim's pocket watch had not been wound.Kazuma:\nThe prosecution has something to report on that subject, My Lord.Stronghart:\nReally? Go ahead, Prosecutor Asogi.Kazuma:\nI met once again with the coroner yesterday to discuss the issue. She confirmed that the defence's suggestion could not be ruled out.Ryunosuke:\n...!Kazuma:\nIt's entirely possible that Inspector Gregson was killed on 31st October - the day before his body was discovered. I have here an updated autopsy report that includes the amended details.Stronghart:\nBut the official opinion of the investigation team was made clear yesterday. That the time of death was 5 p.m. on 1st November.Kazuma:\nThere are indications of an attempt to disguise the real time of death, however. It seems that the natural decaying process of the victim's body may have been slowed by keeping it chilled.Stronghart:\nThat's out of the question. There are no refrigeration devices in that part of London large enough to accommodate a human corpse.Ryunosuke:\nMy Lord! This is more than just conjecture. There's evidence to support the idea. We must investigate it thoroughly.Stronghart:\n...Very well. The court will accept the new report as evidence. However, if this updated report is deemed to be accurate... ...it would give renewed significance to the movements of the victim on the day before the Fresno Street incident.Kazuma:\nIt would, yes. Especially since on that day... ...Inspector Gregson was using Mr Vigil to cover up his real movements. It's conceivable that he was killed in the course of his secret activities.Stronghart:\nDo I sense that the prosecution has some information regarding those activities?Kazuma:\nScotland Yard put an enormous effort into investigating that precise matter yesterday.Ryunosuke:\n...!Kazuma:\nI think we should begin by presenting the results of that investigation work. So the prosecution calls its first witness now!Kazuma:\nState your name and occupation for the court.Gina:\nInspector Gina Lestrade, reportin'! Reper...sentive o' Scotland Yard!Kazuma:\n...A self-conferred rank, but never mind.Ryunosuke:\n(Gina? Again?)Gina:\nWot's yer problem, 'Oddo? Wot's wiv that 'Gina? Again?' look, eh?Ryunosuke:\nAh!Gina:\nThe boss meant the world to me. 'E done more for me than anyone else ever did!Stronghart:\nOh? Inspector Gregson, you mean?Gina:\n'E got me out the back slums o' the East End an' took me under 'is wing. Taught me that life can 'ave a purpose. So that's why I'm the best person to be standin' 'ere speakin' for 'im!Susato:\nOh Gina...Ryunosuke:\n(Right, all out of the goodness of Gregson's heart. Not at all that he had his arm twisted by Mr Sholmes. No...)Kazuma:\nWhat's relevant to these proceedings is that the outcome of Scotland Yard's investigations yesterday... ...has revealed that the victim was carrying out some assignment the police knew nothing about.Stronghart:\nVery troubling...Ryunosuke:\n(That face... Lord Stronghart knew!)Kazuma:\nSo...Inspector Lestrade! Let's hear exactly what it says in that report!Gina:\nComin' right up, sir!Witness Testimony\n- The Victim's Movements -Gina:\nAll Yard detectives are s'posed to follow orders an' investigate wot they're told.\nBut a little search o' the boss's office turned up a notebook that 'ad a load of secret meetin's in it.\nAccordin' to that, the boss was lookin' into some smuggled goods dealin's that day.\nLooks like it was a big job an' all. But the coppers weren't on to it yet.\nWot matters most is, there's witnesses wot saw the Reaper at the place, too!Ryunosuke:\nSmuggled goods?!Gina:\nI dunno, do I? I'm just tellin' ya wot was written in the book!Kazuma:\nTobacco, tea, spices, medicines... Goods of all sorts flow into London by illegal channels from across the globe. It's well known that they're disposed of at regular black markets that take place in the capital. But the police are rarely able to locate them in time.Ryunosuke:\nSo Inspector Gregson was investigating one of those black markets?Stronghart:\nIt's been suggested that high-ranking government officials may be involved in black-market activity. No doubt Gregson was trying to avoid details of his investigations being leaked to the involved parties. That would explain why he was operating on his own authority, without the Yard's knowledge.Ryunosuke:\nAnd do we know where the dealings were taking place this time?Kazuma:\nIn a particular room of a certain exclusive London gentleman's club. And on the day in question...the accused is known to have been there. That's the conclusion of Scotland Yard's investigation into the matter.Ryunosuke:\nThat can't be...! (We haven't heard anything about any of this!)Kazuma:\nMembers of the club have testified to it. There's no question: the accused, Barok van Zieks, was present.Stronghart:\nThat would be very significant testimony, then.Susato:\nOh my! But, but... ...Lord van Zieks made no mention of this! At all!Kazuma:\nIn short, Lord van Zieks had ample opportunity to murder the victim.Stronghart:\nVery well, then. Counsel for the Defence, begin your cross-examination!Cross-Examination\n- The Victim's Movements -",
      "testimonies": [
        {
          "testimony": "All Yard detectives are s'posed to follow orders an' investigate wot they're told.",
          "person": "Gina",
          "present": []
        },
        {
          "testimony": "But a little search o' the boss's office turned up a notebook that 'ad a load of secret meetin's in it.",
          "person": "Gina",
          "present": []
        },
        {
          "testimony": "Accordin' to that, the boss was lookin' into some smuggled goods dealin's that day.",
          "person": "Gina",
          "present": []
        },
        {
          "testimony": "Apparently the smuggled goods deal was gonna 'appen at a gentleman's club called 'The Grouse'.",
          "person": "Gina",
          "present": [
            "Letter of Introduction (after examining other side of note)"
          ]
        },
        {
          "testimony": "Looks like it was a big job an' all. But the coppers weren't on to it yet.",
          "person": "Gina",
          "present": []
        },
        {
          "testimony": "Wot matters most is, there's witnesses wot saw the Reaper at the place, too!",
          "person": "Gina",
          "present": []
        }
      ],
      "noPresent": false
    },
    {
      "category": "cross_examination",
      "newContext": "Gina:\nAll Yard detectives are s'posed to follow orders an' investigate wot they're told.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nSo...you follow orders, do you, Gina?\nGina:\nNah, not me. I'm above all that, see.\nRyunosuke:\nOh.\nGina:\nThe boss always 'ad special orders for me. 'Grab us some fish an' chips' or 'Go an' give Toby 'is grub'... That kind o' thing.\nRyunosuke:\n...So 'errands' more than 'orders' then.\nKazuma:\nThis 'detective' is still an apprentice, after all.\nGina:\nYeah, well, this 'apprentice' ain't one to sit around an' wait to be told wot to do...even by the boss. That's why I've been doin' me own investigations into wot 'appened. I didn't find much at first...Gina:\nBut a little search o' the boss's office turned up a notebook that 'ad a load of secret meetin's in it.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nSo you went through Inspector Gregson's things?\nGina:\nYup! As part o' the independent Lestrade investigation!\nRyunosuke:\nI'm sure your superiors would be delighted that you're taking the initiative...\nGina:\nSo I snuck into 'is office when no one else was about. Cos if anyone at the Yard 'ad seen me goin' in there, they'd 'ave turfed me straight out on the street.\nRyunosuke:\n(This is sounding less and less like an investigation and more and more like something else...)\nKazuma:\nThe prosecution understands that it was this very detective who discovered the notebook.\nGina:\nYou got that right! Nuffin' gets past Inspector Lestrade and 'er trusty assistant, Chief Inspector Toby! We found it 'idden in one of 'is desk drawers that 'ad a false bottom.\nRyunosuke:\nThat's...impressive!\nGina:\nSo then I went to 'ide meself where no one could find me so I could 'ave a butcher's at wot was written in it. Cos if anyone at the Yard 'ad found me out, they'd 'ave turfed me straight out on the street.\nRyunosuke:\nHaah...\nGina:\nI've given it in now though, ain't I? An' if it weren't for me, it wouldn't never 'ave been found!Gina:\nAccordin' to that, the boss was lookin' into some smuggled goods dealin's that day.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nDo you have any idea where those dealings were taking place?\nGina:\nYup! It was all there in the boss's notes! Let's see if I can remember... Erm...\nKazuma:\nAs I already said, the illegal dealings were due to take place at a gentleman's club.\nRyunosuke:\nYes, I remember. But I was hoping to find out the name of the club.\nKazuma:\nThat won't be necessary.\nRyunosuke:\nWhat?!\nKazuma:\nIt's conceivable that the club might be used again by the smugglers in future. Therefore...the prosecution has been asked not to reveal the name in these proceedings.\nGina:\nI dunno wot all the fuss is about. It's right 'ere. All I've gotta do is read it out. An' I could, too! I've got this readin' game buttoned up now! Can't I show ya wot I can do? Go on, wot's the 'arm?\nRyunosuke:\n(The judge hasn't signalled his objection yet. I could try to find out... What should I do?)\n\n\n\nInsist\n\n\n\n\n\n\n\nRyunosuke:\nThis is a closed court. The proceedings are confidential. There shouldn't be any possibility of the information being leaked.\nStronghart:\nAs I explained, there is some possibility of politicians being involved in this affair. The prosecution is rightfully exercising caution, I imagine.\nKazuma:\n......... No, My Lord. The prosecution has no objection.\nStronghart:\n...!\nRyunosuke:\nKazuma?\nKazuma:\nThere's no question that Inspector Gregson was looking into these black market dealings. However... ...it's not yet been established that he was on that particular trail on the day in question. If the defence requires to know the club's name, the prosecution has no intention of being obstructive.\nStronghart:\n.........\nGina:\nRight then! I get to show off me readin' skills!\nChanges statement from \"Accordin' to that, the boss was lookin' into some smuggled goods dealin's that day.\" to \"Apparently the smuggled goods deal was gonna 'appen at a gentleman's club called 'The Grouse'.\"\n\n\n\n\nWait and see\n\n\n\n\n\n\n\nRyunosuke:\n(Gina's only just learnt to read. There's a good chance she might make a mistake... I worry she might mix up the letters 'p' and 'q' and 'b' and 'd'...)\nGina:\nThat's enough o' your cheek, 'Oddo! I'm way past 'E' now! I've got all the way to 'V'!\nRyunosuke:\nJust to err on the side of caution, the defence will wait until the witness can read all the letters up to 'Z'!\nGina:\nGrrr...\nKazuma:\nIn that case, let's get back to the witness's testimony, shall we?\nLeads back to cross-examinationGina:\nApparently the smuggled goods deal was gonna 'appen at a gentleman's club called 'The Grouse'.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nThe Grouse? What sort of a club is that?\nGina:\nI ain't got the foggiest. Clubs ain't exactly my thing. But...I am kind o' curious!\nKazuma:\nThey're not places where a foreign student like you would be readily admitted.\nRyunosuke:\nHave you looked in the mirror recently?\nGina:\nI tell ya wot! Me and Chief Inspector Toby could go in undercover!\nRyunosuke:\nCould you, though?\nGina:\nI could pick out a few good marks an' see wot else I could find out while I was in there!\nRyunosuke:\n...I really don't think you should go 'picking' out anything. Anyway, that's where these black market dealings were going to take place, is it?\nGina:\nYeah, it's gotta be. That's wot the lower-rankin' detectives at the Yard reckon.\nRyunosuke:\n(Says the even lower-ranking detective...)Present Letter of Introduction (after examining other side of note)\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"I've read about these clubs that exist here in Britain.\"Gina:\nLooks like it was a big job an' all. But the coppers weren't on to it yet.Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nSo how had Inspector Gregson come to find out about it, in that case?\nGina:\nThat's the question, ain't it? But I'm just an apprentice, so...\nRyunosuke:\nAnd why didn't he inform Scotland Yard of his findings?\nGina:\nYeah, that's wot I was askin' meself. Cos - ya know - I'm just an apprentice.\nRyunosuke:\nWhen it suits you, yes.\nGina:\nAnyway, the point is, somefin' went on at that club, no question.\nRyunosuke:\nYou can't say that for certain though, surely?Gina:\nWot matters most is, there's witnesses wot saw the Reaper at the place, too!Press\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nLord van Zieks was at the club?\nKazuma:\nHe was. Detectives who visited the club yesterday to make inquiries have confirmed it. Several members report having seen the accused being admitted to the room in question as a guest.\nRyunosuke:\n(It looks like there's no disputing that he was there then.)\nSusato:\nWell we know that Lord van Zieks was investigating Inspector Gregson, don't we? Perhaps he'd already discovered the inspector's secret notebook.\nRyunosuke:\n(Which led him to the club, you mean? Maybe...) Presumably then, there are also eyewitnesses who can testify that Gregson was there?\nKazuma:\n......... None have been identified at this time, no.\nRyunosuke:\n(So the all-important victim wasn't seen at this mysterious club...)\nGina:\nOi! Why ain't you askin' Inspector Lestrade 'ere, eh?Ryunosuke:\n(So that's all I've got to work with... Gina's not holding back with that ice-cold stare of hers, is she?)Susato:\nI really don't know what to make of all this.Ryunosuke:\nLord van Zieks told us that he was investigating Inspector Gregson... ...but he never once mentioned that he met the inspector the day before the incident.Susato:\nYou don't think Lord van Zieks could have been lying to us, do you?Ryunosuke:\n...That's not the only way to explain this.Susato:\nOh!Ryunosuke:\nIf everything Lord van Zieks has told us is true... ...then there must be a mistake in this testimony somewhere.Susato:\n...! You mean, there are details we've yet to uncover?Ryunosuke:\nExactly. (A clue perhaps, that even Gina hasn't noticed. That's what we should be looking for here!)Ryunosuke:\nI've read about these clubs that exist here in Britain. As I understand it, they're places where well-to-do gentlemen socialise with friends and colleagues.Kazuma:\nDon't imagine for a second that a foreign student like you would be admitted.Ryunosuke:\n(Seriously, is your mirror cracked or something?) Do we know for sure that the contraband dealings were definitely happening at a club called 'The Grouse'?Kazuma:\n...The police are currently looking for evidence... but haven't found anything definitive yet.Ryunosuke:\nAnd I'm sorry to say that they probably won't.Kazuma:\nWhat do you mean by that?Ryunosuke:\nI mean that the place Inspector Gregson was secretly going to visit on 31st October... ...may not have been a gentleman's club at all.Stronghart:\n...You're showing a very irreverent attitude towards our country's police force there, Counsel. If it wasn't a gentleman's club...then what was it?Ryunosuke:\n...A steamship.Kazuma:\nYou think...it's a ship...?Ryunosuke:\nI have the evidence to prove it here!Stronghart:\nLet me see that. 'This dark-suited young man is not in the least bit untrustworthy.'Ryunosuke:\nAh! Um...the other side, My Lord.Stronghart:\n...Be more specific next time. ...! Ah... This would appear to be a ticket for passage upon a steamship, yes... The SS Grouse...Kazuma:Kazuma:\nSo there's a steamship named the Grouse that happens to share a name with the club. But I'm afraid to say... ...there's a flaw in your logic there.Ryunosuke:\nHow?Kazuma:\nLook at the ticket. Notice the date of arrival in port.Stronghart:\nThe ship arrived at the Port of Dover on 1st November. ...Ah!Kazuma:\nThe day on which the sound like a gunshot was heard on Fresno Street. In other words... ...on the day in question here - 31st October - when the victim was on his clandestine mission... ...that ship hadn't yet docked on British shores!Stronghart:\nThat would certainly make an undercover investigation somewhat challenging.Ryunosuke:Ryunosuke:\nThe fact that the steamship hadn't yet reached Britain... ...substantiates the defence's assertion that the victim was investigating the SS Grouse on the day in question!Kazuma:\nThen show your evidence for that assertion!Ryunosuke:\n...Very well.Kazuma:\n...!Stronghart:\nIn that case, Counsel for the Defence, present your evidence to the court now. Evidence that substantiates your claim that the victim was investigating the SS Grouse on 31st October.Present Passport\n\n\n\n\n\n\n\nRyunosuke:\n\nLeads to:\n\"What's this?\"Present anything else\n\n\n\n\n\n\n\nRyunosuke:\n\nRyunosuke:\nIt's proven...by this evidence here!\nStronghart:\n.........\nRyunosuke:\nYes, this evidence proves it...I think...\nStronghart:\n.........\nRyunosuke:\nThe, the proof is in the pudding?\nStronghart:\nThose three equally nonsensical statements wasted fifteen seconds of the court's time. You will accordingly suffer fifteen seconds' worth of penalty, Counsel.\nRyunosuke:\nUWAAAAAAAAAAAAAAAH! (I need to work on picking a more succinct turn of phrase.)\nSusato:\nI think you might need to work on picking a more appropriate piece of evidence first.\nRyunosuke:\n(I'm sure Gregson was on board that ship the day before his body was found. And we know the SS Grouse stopped at the Port of Dunkirk in France for the night...)\nStronghart:\nI take it from your expression that you intend to risk further penalty.\nLeads back to:\n\"In that case, Counsel for the Defence, present your evidence to the court now.\"Stronghart:\nWhat's this? A passport for travel issued to the victim?Kazuma:\n.........Stronghart:\nDated 31st October? ...What are you suggesting?Ryunosuke:\nI'm suggesting that just one day before the inspector's body was discovered... ...there's a distinct possibility he wasn't even in the country!Kazuma:\n...!Stronghart:\nOrder! Order! This document is for passage to France. It does appear to have been officially authorised.Ryunosuke:\nThe day before the SS Grouse arrived at Dover... ...it docked on the northern coast of France for a night.Susato:\nAccording to my father, who was on board...at the Port of Dunkirk.Stronghart:\nDunkirk, France... What could possibly have taken the victim there?Kazuma:\n......... Ha ha ha ha ha hah! I'm impressed, Ryunosuke Naruhodo! I certainly didn't expect you to get your hands on that passport.Ryunosuke:\nWhat? You mean...you knew about this?!Kazuma:\n......... The prosecution's strategy for this trial has been laid down by the Crown prosecution office: 'On the day before the incident, the victim was investigating contraband dealings at a London club.' That's the outcome of Scotland Yard's investigations and the line the prosecution has been asked to follow. ...But personally, I don't agree. I think the Prosecutor's Office is trying to hide something.Ryunosuke:\nWhat?!Kazuma:\nAnd now that you've expertly disproven their assertion... I intend to reveal what I believe that something to be.Stronghart:\n...What are you playing at, Prosecutor Asogi?Kazuma:\nA courtroom is a forum for the truth, My Lord. Which is why it's my duty to present all the facts, without exception.Stronghart:\nLet me guess... This was your intention from the outset, wasn't it?Kazuma:\nThe reason Inspector Gregson secretly made his way to the steamship docked in France on the day in question... ...was to carry out a mission...for the Reaper!Ryunosuke:\nThe, the Reaper?!Stronghart:\nOrder! Order! What on earth are you saying, Counsel?Kazuma:\nThe prosecution made an assertion in court yesterday:Kazuma:\nInspector Gregson was investigating the identity of the Reaper. When he discovered the location of the man's secret hideout...he was killed. As I'm sure everyone can imagine...by the Reaper's hand!Kazuma:\nBut in reality...the truth is the opposite of that.Ryunosuke:\nWhat?Kazuma:\nInspector Gregson wasn't investigating the Reaper at all. He was in fact...acting FOR the Reaper!Ryunosuke:\nSo...you're saying the mission he was undertaking was...Kazuma:\nObviously...an assassination.Ryunosuke:\n...!Kazuma:\nBarok van Zieks never carried out any of the actual killings. Whenever the Reaper's victims lost their lives, he always had a cast-iron alibi. Which tells us...that he must have had an accomplice.Stronghart:\nAnd you claim...that was Inspector Gregson????:Gina:\nW...Wot the 'ell d'ya think yer sayin', eh? My boss would never o' done nuffin' like that!Kazuma:\nAnd yet...when you consider all the facts, it all makes perfect sense.Gina:\nNo! It, it can't be...Susato:\nWe also arrived at the same conclusion, didn't we? That Inspector Gregson was operating as the Reaper.Ryunosuke:\nEven so...there's no way that the person giving him his orders... ...was Lord van Zieks! (No, the true Reaper is somebody else...) Barok van Zieks is not the Reaper!Kazuma:\nA predictable response...from someone who's advocating for the man.Ryunosuke:\nAnd even if it's true that Gregson was operating as an agent of the Reaper... ...the suggestion that he went aboard the SS Grouse on an assassination mission doesn't follow at all.Stronghart:\nOh? You have some solid reason for doubting the assertion, do you, Counsel?Ryunosuke:\nAbsolutely. It's very simple. On the day in question... ...nobody was killed aboard that steamship.Stronghart:\nHm...Ryunosuke:\n(Professor Mikotoba and Judge Jigoku were on that very ship. If someone had been assassinated, I'm certain we would have heard about it!)Kazuma:\n...Pfft!Ryunosuke:\nWhat's so funny?Kazuma:\nYou're right, of course. No suspicious deaths were reported on board the ship. But I think perhaps you've missed the point. That's precisely why Inspector Gregson himself lost his life!Ryunosuke:\nWhat?!Kazuma:\nGregson did board the SS Grouse that night, with the intention of dispatching his mark. But his mission...ended in failure.Ryunosuke:\nFailure...?Kazuma:\nIt seems that the defence hasn't yet grasped a very important detail here.Ryunosuke:\nWhat are you talking about? (What detail?)Kazuma:\nInspector Gina Lestrade!Gina:\nEh?! Wot?Kazuma:\nThe victim's notebook that you read an excerpt from earlier... That doesn't contain details of secret investigations at all. It describes ten years of assassination plots to be carried out by the Reaper of the Bailey.Gina:\nYer lyin'! Even if all them bludgers wot got taken out 'ad it comin'... ...the boss weren't the Reaper!Susato:\nPoor Gina...Kazuma:\nThere's no question that Tobias Gregson was heavily involved in the Reaper's activities. You may just be an apprentice, but if you've spent any time at Scotland Yard, you must have heard rumours...Gina:\nI ain't 'eard nuffin'! An' I don't believe a word of it!Kazuma:\nThen testify again. As a representative of Scotland Yard. Consider it...your chance to defend your 'boss'.Gina:\nI, I don't...Stronghart:\nI concur. The witness will give a new formal testimony. Miss Lestrade, you will tell the court everything you know about Inspector Gregson's secret notebook!Gina:\n.........Witness Testimony\n- The Reaper's Notebook -Gina:\nYeah, this notebook does 'ave a load o' stuff about wot the Reaper got up to these past ten years.\nNames o' victims, dates an' places an' stuff... An' the last entry in there was 31st October.\nIt said 'Grouse' for the place on that date, and then the name o' the mark.\nThere was a note about 'im bein' a criminal wot got away from the Reaper in court ten years ago or summat.\nBut honest! The boss didn't do none of it! 'E was... 'E was just investigatin' the Reaper, that's all!Stronghart:\nKeep personal opinion out of your testimony, witness. We require only established fact here.Gina:\n.........Ryunosuke:\n(This must be so hard for her.)Kazuma:\nYou can't deny it now, surely...Ryunosuke Naruhodo.Ryunosuke:\nWhat can't I deny?Kazuma:\nThe notebook contained the name of the final mark and the location where the assassination would take place. That's information that the victim could only have known if he was working with the Reaper!Ryunosuke:\nAh!Stronghart:\nSo...who was to be this 'final mark'?Kazuma:\nGo ahead, Inspector Lestrade! Read the name for the court. The name that's written alongside the entry that mentions 'The Grouse' on 31st October.Gina:\nEh? Oh, um... 'Ow d'you read this then...?Ryunosuke:\n(Reading's still not her strong suit...)Gina:\nThat ain't the problem, alright, 'Oddo! It's a funny name. It ain't English. It's 'ard to read.Ryunosuke:\nSo it's someone from overseas?Gina:\nLet me 'ave a bash at it. 'Seh...ish...iro...' is it? Yeah, 'Seishiro... ...Jig...ok...you...' maybe?Ryunosuke:\nWha...? (It, it can't be...) Seishiro Jigoku?Susato:\nBut that's...Judge Jigoku!Stronghart:\nSeishiro Jigoku... Certainly not an English name, you're right.Ryunosuke:Ryunosuke:\nBut that can't be right! I know Judge Jigoku! And I saw him the day before yesterday! Here in London! So I know for a fact that the man hasn't been assassinated!Kazuma:\nAs I said...the Reaper failed.Ryunosuke:\nOh...Kazuma:\nGregson missed his chance to kill his mark and returned to British shores. But the Reaper wouldn't tolerate the mistake. So he killed the inspector...personally.Ryunosuke:\n...!Kazuma:\nThe Reaper of course being the accused...Barok van Zieks!Stronghart:\nIt's...an undeniably logical argument.Ryunosuke:\n(Kazuma... You planned for the trial to go this way all along, didn't you?)???:Van Zieks:\n...Pray forgive the discourtesy of filling my hallowed chalice whilst I stand accused of murder.Ryunosuke:\nL-Lord van Zieks!Kazuma:\nThe accused has no right to speak uninvited in court. You will return to the dock.Van Zieks:\nI say nothing of whether or not I'm the Reaper. That's the task of this court to decide. But there is one thing I can say unequivocally: That girl is no detective.Gina:\nEh? Wha...? Nah, that's right, I ain't. I'm an inspector!Van Zieks:\nRepeating rumours heard around the Yard... Reading entries from a notebook of unconfirmed origin... That's not testimony. It's practically a script. No doubt the rest of this trial will go exactly as you've clearly planned.Kazuma:\n.........Van Zieks:\nYour hatred of me is understandable. In your mind, I'm sure I am the Reaper...who sent your father to the gallows all those years ago.Kazuma:\n...!Van Zieks:\nBut you're in danger of becoming a far more sinister Reaper yourself... ...by attempting to have me condemned with this feeble excuse for testimony.Kazuma:\nWhat did you say?Susato:\nMr Naruhodo, this is our chance!Ryunosuke:\nMy Lord! The defence requests that the defendant be allowed to speak! He may be privy to important information relating to the testimony just given by the witness!Stronghart:\n......... Very well. I'll make an exception and grant the request. The defendant may remain in the witness stand for the cross-examination.Van Zieks:\nThen allow me to toast the court's impartiality.Stronghart:\n...Don't raise your glass in my direction, sir. Counsel for the Defence, begin the cross-examination immediately!Ryunosuke:\nAt once, My Lord!Cross-Examination\n- The Reaper's Notebook -",
      "testimonies": [
        {
          "testimony": "Yeah, this notebook does 'ave a load o' stuff about wot the Reaper got up to these past ten years.",
          "person": "Gina",
          "present": []
        },
        {
          "testimony": "Names o' victims, dates an' places an' stuff... An' the last entry in there was 31st October.",
          "person": "Gina",
          "present": []
        },
        {
          "testimony": "It said 'Grouse' for the place on that date, and then the name o' the mark.",
          "person": "Gina",
          "present": []
        },
        {
          "testimony": "There was a note about 'im bein' a criminal wot got away from the Reaper in court ten years ago or summat.",
          "person": "Gina",
          "present": []
        },
        {
          "testimony": "But honest! The boss didn't do none of it! 'E was... 'E was just investigatin' the Reaper, that's all!",
          "person": "Gina",
          "present": []
        },
        {
          "testimony": "Come on, 'Oddo! 'Elp! You've gotta find a flaw somewhere!",
          "person": "Gina",
          "present": []
        }
      ],
      "noPresent": true
    }
  ]
}