{
  "previousContext": "Although this is technically a separate \"case\", for the purposes of this wiki this transcript will be treated as a continuation of Twisted Karma and His Last Bow.Final ChapterThe Resolve of Ryunosuke Naruhodo3rd November, 9:14 a.m.The Old Bailey, Defendants' AntechamberRyunosuke:(So...the time's finally come. Today...we unravel everything!) I'll be counting on your support more than ever today, Miss Susato!Susato:.........Ryunosuke:Um... Miss Susato?Susato:Ah! Oh no! W-What's the matter, Mr Naruhodo?Ryunosuke:Um...nothing? I was just saying that I'll be relying on your support today, but...Susato:I'm so sorry! Of course! I, I know I can be rather incompetent at times, but... ...I shan't let you down!Ryunosuke:...Would you mind helping me to my feet, then?Susato:Oh dear! I'm really very sorry!Ryunosuke:(Susato-san isn't her usual self at all. But that's hardly surprising, I suppose. She's just found out that her father is the partner of a world-famous detective. Not to mention...)Susato:Ah! G-Good morning, sir!Ryunosuke:...! Lord van Zieks!Van Zieks:Thank you for all your efforts yesterday.Ryunosuke:Wha... (Did I hear that correctly?)Van Zieks:...What?Ryunosuke:Oh! Um, no, nothing. Just...I hope we can clear things up today. (I really can't make this man out. His face says 'I hate you' but his words are...almost jovial today. In fact, he hasn't been very Reaper-like at all since this all began yesterday.)Susato:Lord van Zieks isn't the Reaper, Mr Naruhodo.Ryunosuke:...Good point.Van Zieks:The Reaper? I suppose in hindsight... ...I shouldn't have allowed that misconception to go unchallenged.Ryunosuke:Huh?Van Zieks:It was my tacit acceptance of the pseudonym... My failure to stop the Reaper becoming something more than a mere legend...that led to all this.Susato:But you're not to blame for that, Lord van Zieks!Ryunosuke:It's only because serious crime in the capital dropped off so sharply when the public started calling you that. That's why you didn't say anything, isn't it?Van Zieks:...To be frank, I'm not sure that was the sole reason.Ryunosuke:What do you mean?Van Zieks:There was a rumour at the time that the Reaper was really the ghost of my late brother.Susato:...!Van Zieks:That having been slain by that evil killer, Klint's restless spirit returned as some sort of demigod... ...to wield a deadly blade of justice where I, by dint of the law, could not.Ryunosuke:Yes...we've heard that story too.Van Zieks:When I lost him... ...I felt as though I'd lost my guiding light.  I didn't know where to go or what to do. And so... ...in some small way, I wonder if perhaps those rumours made me feel his absence a little less keenly. Even if I knew it was just an illusion. Just some nonsense conjured up by an over-imaginative public.Susato:He was obviously extremely important to you. Lord Klint van Zieks...Ryunosuke:Well...what's important now is uncovering the truth. That's all that matters. I...know that you didn't take anyone's life.Van Zieks:...!Ryunosuke:And I intend to prove that beyond a shadow of a doubt in court today.Van Zieks:......... I never thought I'd say this... ...but I can see it in your eyes. That burning desire to cut through all the lies and deception. I can't deny it any longer. You...are a lawyer of absolute integrity.Ryunosuke:...Thank you.Van Zieks:Now tell me... ...why do I detect the scent of expensive tea leaves in the air?Ryunosuke:Oh! Iris! When did you get here?Susato:Oh!Iris:Ah! Um... I brought you one of my special blends. Hurley loves it. He says it helps him to clear his head!Van Zieks:...I thank you.Iris:Oh... Hee hee...Ryunosuke:(That's surely the first and last time I'll ever see a sight like this...) You seem different today, Iris.Iris:Oh...?Ryunosuke:Sort of...subdued, I suppose.Iris:I am not!Ryunosuke:(What happened yesterday is obviously still playing on her mind a lot. She's clearly very troubled about having stolen that autopsy report from Dr Sithe's laboratory.)Iris:Alright then...good luck to you both! I have to make a move now.Susato:Oh! You're not staying?Ryunosuke:I thought you'd want to watch today's proceedings.Iris:Well...I'd like to cheer you on, obviously. But I've got lots to get ready.Ryunosuke:Get ready? For what?Iris:Oh, yes. Would you take this?Ryunosuke:Isn't that one of the little felt dolls that's usually dangling from your knapsack?Iris:Yes! It's a lucky charm! A little Hurley that I made once.Ryunosuke:A 'Hurley'? (It looks more like a 'Hareley' to me...)Iris:If for some reason you completely run out of options in the trial today... ...then just pull this little Hurley's ears as hard as you possibly can!Ryunosuke:Wha...? Pull his ears?Iris:That's right! It's a way to bring good luck. ...I think you might need it!Iris's lucky charm has been entered into the Court Record.Susato:Y-You think...what we'll need is luck...?Iris:I just sneaked a peek inside the courtroom. And...it seemed very different to normal.Van Zieks:Yes, it would seem... ...that a certain someone has decided to pull out all the stops.Ryunosuke:What does that mean?Van Zieks:.........Susato:What about Mr Sholmes, Iris?Iris:I...don't know. He was out all night and he hadn't come home by the time I left this morning.Susato:Oh... I see...Ryunosuke:Was Professor Mikotoba out all night too, do you think, Miss Susato?Susato:Yes, it would seem so. I telegrammed the hotel this morning... ...and apparently they didn't come back to their rooms last night at all.Ryunosuke:'They'?Susato:Father and Judge Jigoku, I mean.Ryunosuke:Judge Jigoku, too?Susato:That's right. Nobody appears to have seen either of them since yesterday.Bailiff:Counsel for the Defence and the defendant! Court is about to be in session. Please make your way inside the courtroom at once!Iris:Good luck then, Runo! Good luck, Susie!Ryunosuke:Yes...thanks, Iris.Iris:And you, Mr Reaper. I hope it goes well!Van Zieks:Once again, I thank you for the delicious tea, It was very soothing.Iris:Oh, I'm so glad!Susato:We must go inside now, Lord van Zieks!Van Zieks:Hm...Ryunosuke:(Lord van Zieks has always been the formidable prosecutor I've had to lock horns with in court. But not today. Today I battle with another in pursuit of the truth. My best friend, Kazuma Asogi, who I trust more than anyone else in the world. Now I understand what it was that drew me here to Britain all those months ago. Now I know exactly what destiny had in store for me. It's all been leading up to this one day... To this one trial... To this one final reckoning!)3rd November, 9:30 a.m.The Old Bailey CourtroomRyunosuke:It feels even more oppressive here than it did yesterday... (There are cold stares piercing me like knives from all sides today.)Susato:Ah! M-Mr Naruhodo! Look!Ryunosuke:L... Lord Stronghart!Kazuma:.........Ryunosuke:(Kazuma must have known beforehand...)Stronghart:The ramifications of this trial now extend far beyond the murder of one Scotland Yard inspector. In fact, events have come to light that threaten to rock the very foundations of our country's legal system.Kazuma:The escape of a condemned criminal on the night of his execution...the subsequent unlawful shooting of the man... ...and the revelation that prison staff must have been complicit in the jailbreak.Stronghart:Britain is currently hosting influential members of the judiciary from countries all around the world. It is imperative that we uncover the truth in these proceedings to avoid international embarrassment. By royal decree, this will continue to be a closed trial... ...and one over which I, Mael Stronghart, exercise total and unequivocal authority.Ryunosuke:The, the six jurors' flames just...Stronghart:As was the case in yesterday's proceedings, those here present in the public gallery... ...are distinguished members of our judiciary, assembled to bear witness to a fair judicial process.Van Zieks:In other words...a collection of your acolytes, Lord Stronghart.Stronghart:......... On a personal note, I find this most distressing, Lord van Zieks. You were a prosecutor of exceptional talent. Much like your brother Klint in fact...Van Zieks:.........Stronghart:In the name of Her Majesty the Queen, I hereby declare this court to be in session... ...for the trial of Barok van Zieks, who officially stands accused of murder.Van Zieks:.........Stronghart:Counsels for the prosecution and defense...are you in full readiness to proceed?Ryunosuke:The defence is ready...My Lord.Kazuma:As is the prosecution.Stronghart:Yesterday's proceedings brought to light a shocking and disturbing fact: There was a side to the victim, Inspector Tobias Gregson, that was unknown to his superiors at Scotland Yard.Kazuma:Yes, he was carrying out operations in secret, which Scotland Yard knew nothing about.Stronghart:And in those clandestine operations, he had an accomplice.Kazuma:Mr Daley Vigil, who would be given the inspector's identification... ...and present himself around the capital in order to establish credible alibis for Gregson. In that way, Gregson appeared to be carrying out his regular Scotland Yard work when in fact he wasn't.Stronghart:At the end of yesterday's session, Mr Vigil, who had been suffering from amnesia, regained his memory. It would appear he buried his memories of the time deep inside himself as a means of self-preservation. Because whilst he was engaged as chief warder at Barclay Prison, he abetted the convict's escape.Kazuma:Mr Vigil is currently recuperating at St Synner's. He's recovered enough to give a signed statement about his movements on the day prior to the incident. He's formally admitted to posing as Gregson whilst investigating the Red-Headed League.Stronghart:Which brings us to the crucial issue of the victim's time of death. The defence yesterday proposed a suggestion that the victim may have been killed one day earlier. This was based largely on the discovery that the victim's pocket watch had not been wound.Kazuma:The prosecution has something to report on that subject, My Lord.Stronghart:Really? Go ahead, Prosecutor Asogi.Kazuma:I met once again with the coroner yesterday to discuss the issue. She confirmed that the defence's suggestion could not be ruled out.Ryunosuke:...!Kazuma:It's entirely possible that Inspector Gregson was killed on 31st October - the day before his body was discovered. I have here an updated autopsy report that includes the amended details.Stronghart:But the official opinion of the investigation team was made clear yesterday. That the time of death was 5 p.m. on 1st November.Kazuma:There are indications of an attempt to disguise the real time of death, however. It seems that the natural decaying process of the victim's body may have been slowed by keeping it chilled.Stronghart:That's out of the question. There are no refrigeration devices in that part of London large enough to accommodate a human corpse.Ryunosuke:My Lord! This is more than just conjecture. There's evidence to support the idea. We must investigate it thoroughly.Stronghart:...Very well. The court will accept the new report as evidence. However, if this updated report is deemed to be accurate... ...it would give renewed significance to the movements of the victim on the day before the Fresno Street incident.Kazuma:It would, yes. Especially since on that day... ...Inspector Gregson was using Mr Vigil to cover up his real movements. It's conceivable that he was killed in the course of his secret activities.Stronghart:Do I sense that the prosecution has some information regarding those activities?Kazuma:Scotland Yard put an enormous effort into investigating that precise matter yesterday.Ryunosuke:...!Kazuma:I think we should begin by presenting the results of that investigation work. So the prosecution calls its first witness now!Kazuma:State your name and occupation for the court.Gina:Inspector Gina Lestrade, reportin'! Reper...sentive o' Scotland Yard!Kazuma:...A self-conferred rank, but never mind.Ryunosuke:(Gina? Again?)Gina:Wot's yer problem, 'Oddo? Wot's wiv that 'Gina? Again?' look, eh?Ryunosuke:Ah!Gina:The boss meant the world to me. 'E done more for me than anyone else ever did!Stronghart:Oh? Inspector Gregson, you mean?Gina:'E got me out the back slums o' the East End an' took me under 'is wing. Taught me that life can 'ave a purpose. So that's why I'm the best person to be standin' 'ere speakin' for 'im!Susato:Oh Gina...Ryunosuke:(Right, all out of the goodness of Gregson's heart. Not at all that he had his arm twisted by Mr Sholmes. No...)Kazuma:What's relevant to these proceedings is that the outcome of Scotland Yard's investigations yesterday... ...has revealed that the victim was carrying out some assignment the police knew nothing about.Stronghart:Very troubling...Ryunosuke:(That face... Lord Stronghart knew!)Kazuma:So...Inspector Lestrade! Let's hear exactly what it says in that report!Gina:Comin' right up, sir!Witness Testimony- The Victim's Movements -Gina:All Yard detectives are s'posed to follow orders an' investigate wot they're told.But a little search o' the boss's office turned up a notebook that 'ad a load of secret meetin's in it.Accordin' to that, the boss was lookin' into some smuggled goods dealin's that day.Looks like it was a big job an' all. But the coppers weren't on to it yet.Wot matters most is, there's witnesses wot saw the Reaper at the place, too!Ryunosuke:Smuggled goods?!Gina:I dunno, do I? I'm just tellin' ya wot was written in the book!Kazuma:Tobacco, tea, spices, medicines... Goods of all sorts flow into London by illegal channels from across the globe. It's well known that they're disposed of at regular black markets that take place in the capital. But the police are rarely able to locate them in time.Ryunosuke:So Inspector Gregson was investigating one of those black markets?Stronghart:It's been suggested that high-ranking government officials may be involved in black-market activity. No doubt Gregson was trying to avoid details of his investigations being leaked to the involved parties. That would explain why he was operating on his own authority, without the Yard's knowledge.Ryunosuke:And do we know where the dealings were taking place this time?Kazuma:In a particular room of a certain exclusive London gentleman's club. And on the day in question...the accused is known to have been there. That's the conclusion of Scotland Yard's investigation into the matter.Ryunosuke:That can't be...! (We haven't heard anything about any of this!)Kazuma:Members of the club have testified to it. There's no question: the accused, Barok van Zieks, was present.Stronghart:That would be very significant testimony, then.Susato:Oh my! But, but... ...Lord van Zieks made no mention of this! At all!Kazuma:In short, Lord van Zieks had ample opportunity to murder the victim.Stronghart:Very well, then. Counsel for the Defence, begin your cross-examination!Cross-Examination- The Victim's Movements -Gina:All Yard detectives are s'posed to follow orders an' investigate wot they're told.Gina:But a little search o' the boss's office turned up a notebook that 'ad a load of secret meetin's in it.Gina:Accordin' to that, the boss was lookin' into some smuggled goods dealin's that day.Gina:Apparently the smuggled goods deal was gonna 'appen at a gentleman's club called 'The Grouse'.Gina:Looks like it was a big job an' all. But the coppers weren't on to it yet.Gina:Wot matters most is, there's witnesses wot saw the Reaper at the place, too!Ryunosuke:(So that's all I've got to work with... Gina's not holding back with that ice-cold stare of hers, is she?)Susato:I really don't know what to make of all this.Ryunosuke:Lord van Zieks told us that he was investigating Inspector Gregson... ...but he never once mentioned that he met the inspector the day before the incident.Susato:You don't think Lord van Zieks could have been lying to us, do you?Ryunosuke:...That's not the only way to explain this.Susato:Oh!Ryunosuke:If everything Lord van Zieks has told us is true... ...then there must be a mistake in this testimony somewhere.Susato:...! You mean, there are details we've yet to uncover?Ryunosuke:Exactly. (A clue perhaps, that even Gina hasn't noticed. That's what we should be looking for here!)Ryunosuke:I've read about these clubs that exist here in Britain. As I understand it, they're places where well-to-do gentlemen socialise with friends and colleagues.Kazuma:Don't imagine for a second that a foreign student like you would be admitted.Ryunosuke:(Seriously, is your mirror cracked or something?) Do we know for sure that the contraband dealings were definitely happening at a club called 'The Grouse'?Kazuma:...The police are currently looking for evidence... but haven't found anything definitive yet.Ryunosuke:And I'm sorry to say that they probably won't.Kazuma:What do you mean by that?Ryunosuke:I mean that the place Inspector Gregson was secretly going to visit on 31st October... ...may not have been a gentleman's club at all.Stronghart:...You're showing a very irreverent attitude towards our country's police force there, Counsel. If it wasn't a gentleman's club...then what was it?Ryunosuke:...A steamship.Kazuma:You think...it's a ship...?Ryunosuke:I have the evidence to prove it here!Stronghart:Let me see that. 'This dark-suited young man is not in the least bit untrustworthy.'Ryunosuke:Ah! Um...the other side, My Lord.Stronghart:...Be more specific next time. ...! Ah... This would appear to be a ticket for passage upon a steamship, yes... The SS Grouse...Kazuma:Kazuma:So there's a steamship named the Grouse that happens to share a name with the club. But I'm afraid to say... ...there's a flaw in your logic there.Ryunosuke:How?Kazuma:Look at the ticket. Notice the date of arrival in port.Stronghart:The ship arrived at the Port of Dover on 1st November. ...Ah!Kazuma:The day on which the sound like a gunshot was heard on Fresno Street. In other words... ...on the day in question here - 31st October - when the victim was on his clandestine mission... ...that ship hadn't yet docked on British shores!Stronghart:That would certainly make an undercover investigation somewhat challenging.Ryunosuke:Ryunosuke:The fact that the steamship hadn't yet reached Britain... ...substantiates the defence's assertion that the victim was investigating the SS Grouse on the day in question!Kazuma:Then show your evidence for that assertion!Ryunosuke:...Very well.Kazuma:...!Stronghart:In that case, Counsel for the Defence, present your evidence to the court now. Evidence that substantiates your claim that the victim was investigating the SS Grouse on 31st October.Stronghart:What's this? A passport for travel issued to the victim?Kazuma:.........Stronghart:Dated 31st October? ...What are you suggesting?Ryunosuke:I'm suggesting that just one day before the inspector's body was discovered... ...there's a distinct possibility he wasn't even in the country!Kazuma:...!Stronghart:Order! Order! This document is for passage to France. It does appear to have been officially authorised.Ryunosuke:The day before the SS Grouse arrived at Dover... ...it docked on the northern coast of France for a night.Susato:According to my father, who was on board...at the Port of Dunkirk.Stronghart:Dunkirk, France... What could possibly have taken the victim there?Kazuma:......... Ha ha ha ha ha hah! I'm impressed, Ryunosuke Naruhodo! I certainly didn't expect you to get your hands on that passport.Ryunosuke:What? You mean...you knew about this?!Kazuma:......... The prosecution's strategy for this trial has been laid down by the Crown prosecution office: 'On the day before the incident, the victim was investigating contraband dealings at a London club.' That's the outcome of Scotland Yard's investigations and the line the prosecution has been asked to follow. ...But personally, I don't agree. I think the Prosecutor's Office is trying to hide something.Ryunosuke:What?!Kazuma:And now that you've expertly disproven their assertion... I intend to reveal what I believe that something to be.Stronghart:...What are you playing at, Prosecutor Asogi?Kazuma:A courtroom is a forum for the truth, My Lord. Which is why it's my duty to present all the facts, without exception.Stronghart:Let me guess... This was your intention from the outset, wasn't it?Kazuma:The reason Inspector Gregson secretly made his way to the steamship docked in France on the day in question... ...was to carry out a mission...for the Reaper!Ryunosuke:The, the Reaper?!Stronghart:Order! Order! What on earth are you saying, Counsel?Kazuma:The prosecution made an assertion in court yesterday:Kazuma:Inspector Gregson was investigating the identity of the Reaper. When he discovered the location of the man's secret hideout...he was killed. As I'm sure everyone can imagine...by the Reaper's hand!Kazuma:But in reality...the truth is the opposite of that.Ryunosuke:What?Kazuma:Inspector Gregson wasn't investigating the Reaper at all. He was in fact...acting FOR the Reaper!Ryunosuke:So...you're saying the mission he was undertaking was...Kazuma:Obviously...an assassination.Ryunosuke:...!Kazuma:Barok van Zieks never carried out any of the actual killings. Whenever the Reaper's victims lost their lives, he always had a cast-iron alibi. Which tells us...that he must have had an accomplice.Stronghart:And you claim...that was Inspector Gregson????:Gina:W...Wot the 'ell d'ya think yer sayin', eh? My boss would never o' done nuffin' like that!Kazuma:And yet...when you consider all the facts, it all makes perfect sense.Gina:No! It, it can't be...Susato:We also arrived at the same conclusion, didn't we? That Inspector Gregson was operating as the Reaper.Ryunosuke:Even so...there's no way that the person giving him his orders... ...was Lord van Zieks! (No, the true Reaper is somebody else...) Barok van Zieks is not the Reaper!Kazuma:A predictable response...from someone who's advocating for the man.Ryunosuke:And even if it's true that Gregson was operating as an agent of the Reaper... ...the suggestion that he went aboard the SS Grouse on an assassination mission doesn't follow at all.Stronghart:Oh? You have some solid reason for doubting the assertion, do you, Counsel?Ryunosuke:Absolutely. It's very simple. On the day in question... ...nobody was killed aboard that steamship.Stronghart:Hm...Ryunosuke:(Professor Mikotoba and Judge Jigoku were on that very ship. If someone had been assassinated, I'm certain we would have heard about it!)Kazuma:...Pfft!Ryunosuke:What's so funny?Kazuma:You're right, of course. No suspicious deaths were reported on board the ship. But I think perhaps you've missed the point. That's precisely why Inspector Gregson himself lost his life!Ryunosuke:What?!Kazuma:Gregson did board the SS Grouse that night, with the intention of dispatching his mark. But his mission...ended in failure.Ryunosuke:Failure...?Kazuma:It seems that the defence hasn't yet grasped a very important detail here.Ryunosuke:What are you talking about? (What detail?)Kazuma:Inspector Gina Lestrade!Gina:Eh?! Wot?Kazuma:The victim's notebook that you read an excerpt from earlier... That doesn't contain details of secret investigations at all. It describes ten years of assassination plots to be carried out by the Reaper of the Bailey.Gina:Yer lyin'! Even if all them bludgers wot got taken out 'ad it comin'... ...the boss weren't the Reaper!Susato:Poor Gina...Kazuma:There's no question that Tobias Gregson was heavily involved in the Reaper's activities. You may just be an apprentice, but if you've spent any time at Scotland Yard, you must have heard rumours...Gina:I ain't 'eard nuffin'! An' I don't believe a word of it!Kazuma:Then testify again. As a representative of Scotland Yard. Consider it...your chance to defend your 'boss'.Gina:I, I don't...Stronghart:I concur. The witness will give a new formal testimony. Miss Lestrade, you will tell the court everything you know about Inspector Gregson's secret notebook!Gina:.........Witness Testimony- The Reaper's Notebook -Gina:Yeah, this notebook does 'ave a load o' stuff about wot the Reaper got up to these past ten years.Names o' victims, dates an' places an' stuff... An' the last entry in there was 31st October.It said 'Grouse' for the place on that date, and then the name o' the mark.There was a note about 'im bein' a criminal wot got away from the Reaper in court ten years ago or summat.But honest! The boss didn't do none of it! 'E was... 'E was just investigatin' the Reaper, that's all!Stronghart:Keep personal opinion out of your testimony, witness. We require only established fact here.Gina:.........Ryunosuke:(This must be so hard for her.)Kazuma:You can't deny it now, surely...Ryunosuke Naruhodo.Ryunosuke:What can't I deny?Kazuma:The notebook contained the name of the final mark and the location where the assassination would take place. That's information that the victim could only have known if he was working with the Reaper!Ryunosuke:Ah!Stronghart:So...who was to be this 'final mark'?Kazuma:Go ahead, Inspector Lestrade! Read the name for the court. The name that's written alongside the entry that mentions 'The Grouse' on 31st October.Gina:Eh? Oh, um... 'Ow d'you read this then...?Ryunosuke:(Reading's still not her strong suit...)Gina:That ain't the problem, alright, 'Oddo! It's a funny name. It ain't English. It's 'ard to read.Ryunosuke:So it's someone from overseas?Gina:Let me 'ave a bash at it. 'Seh...ish...iro...' is it? Yeah, 'Seishiro... ...Jig...ok...you...' maybe?Ryunosuke:Wha...? (It, it can't be...) Seishiro Jigoku?Susato:But that's...Judge Jigoku!Stronghart:Seishiro Jigoku... Certainly not an English name, you're right.Ryunosuke:Ryunosuke:But that can't be right! I know Judge Jigoku! And I saw him the day before yesterday! Here in London! So I know for a fact that the man hasn't been assassinated!Kazuma:As I said...the Reaper failed.Ryunosuke:Oh...Kazuma:Gregson missed his chance to kill his mark and returned to British shores. But the Reaper wouldn't tolerate the mistake. So he killed the inspector...personally.Ryunosuke:...!Kazuma:The Reaper of course being the accused...Barok van Zieks!Stronghart:It's...an undeniably logical argument.Ryunosuke:(Kazuma... You planned for the trial to go this way all along, didn't you?)???:Van Zieks:...Pray forgive the discourtesy of filling my hallowed chalice whilst I stand accused of murder.Ryunosuke:L-Lord van Zieks!Kazuma:The accused has no right to speak uninvited in court. You will return to the dock.Van Zieks:I say nothing of whether or not I'm the Reaper. That's the task of this court to decide. But there is one thing I can say unequivocally: That girl is no detective.Gina:Eh? Wha...? Nah, that's right, I ain't. I'm an inspector!Van Zieks:Repeating rumours heard around the Yard... Reading entries from a notebook of unconfirmed origin... That's not testimony. It's practically a script. No doubt the rest of this trial will go exactly as you've clearly planned.Kazuma:.........Van Zieks:Your hatred of me is understandable. In your mind, I'm sure I am the Reaper...who sent your father to the gallows all those years ago.Kazuma:...!Van Zieks:But you're in danger of becoming a far more sinister Reaper yourself... ...by attempting to have me condemned with this feeble excuse for testimony.Kazuma:What did you say?Susato:Mr Naruhodo, this is our chance!Ryunosuke:My Lord! The defence requests that the defendant be allowed to speak! He may be privy to important information relating to the testimony just given by the witness!Stronghart:......... Very well. I'll make an exception and grant the request. The defendant may remain in the witness stand for the cross-examination.Van Zieks:Then allow me to toast the court's impartiality.Stronghart:...Don't raise your glass in my direction, sir. Counsel for the Defence, begin the cross-examination immediately!Ryunosuke:At once, My Lord!Cross-Examination- The Reaper's Notebook -Gina:Yeah, this notebook does 'ave a load o' stuff about wot the Reaper got up to these past ten years.Gina:Names o' victims, dates an' places an' stuff... An' the last entry in there was 31st October.Gina:It said 'Grouse' for the place on that date, and then the name o' the mark.Gina:There was a note about 'im bein' a criminal wot got away from the Reaper in court ten years ago or summat.Gina:But honest! The boss didn't do none of it! 'E was... 'E was just investigatin' the Reaper, that's all!Gina:Come on, 'Oddo! 'Elp! You've gotta find a flaw somewhere!Ryunosuke:(So that's what we have to work with...)Susato:It may help us that Lord van Zieks is in the stand, too.Ryunosuke:Yes, perhaps. I'm sure Gina knows nothing she hasn't already told us. There's no point trying to get more out of her.Susato:...Did you notice how Kazuma-sama reacted to Lord van Zieks's words?Ryunosuke:When he called him an even more sinister Reaper, you mean? Well, I'm sure Kazuma intends to eliminate any shred of doubt that the man is guilty. He's looking for revenge against the person he considers to be his father's killer, after all.Susato:I do worry that if we fail to find a discrepancy in this testimony somewhere... ...the trial may end and adjudication won't go in our favour. Let's listen carefully again to what everybody is saying...Ryunosuke:By you...Kazuma Asogi.Kazuma:Me?Stronghart:Is this some attempt at filibustering, Counsel? Prosecutor Asogi has given no testimony.Kazuma:What are you suggesting I said that was inconsistent?Ryunosuke:You let something slip that you shouldn't have. When I present the relevant piece of evidence, I imagine you'll realise what you've done.Stronghart:Very well then, Counsel, go ahead. What evidence reveals this alleged inconsistency in something Prosecutor Asogi has said?Ryunosuke:This...is a trunk that belonged to Inspector Gregson.Stronghart:A metal construction, is it? It's certainly very heavy. ...! What's this? A bloodstain? And a relatively fresh one, too.Kazuma:...!Gina:Wot?! You, you mean that ain't grease from all the boss's fish an' chips?!Van Zieks:Fresh blood on the inspector's trunk... That suggests that the victim was travelling with that luggage when he was killed.Stronghart:That can't be. There was no mention of any trunk in Scotland Yard's report.Ryunosuke:Yes, there's a reason for that. Immediately after the inspector's body was discovered, one of the street pedlars made off with the trunk... ...hoping to sell it.Gina:But I found it! Me, wiv me nose for trouble!Stronghart:Hmph...Ryunosuke:Which means that nobody should have known anything about the trunk. Unless of course...we're talking about somebody who was present when the victim was killed.Kazuma:.........Ryunosuke:And yet...during the cross-examination of the witness just now, you said this, Kazuma:Kazuma:Because at the time he was making his way to the steamship docked on the northern coast of France. As shown by the passport found in the victim's metal trunk.Ryunosuke:So the question is...how did you know about the inspector's trunk?Kazuma:......... We know the man went on a trip to France. Where else would he have put his passport?Ryunosuke:Ryunosuke:But you knew it was a metal trunk! Answer me honestly, Kazuma! On 31st October...where exactly were you?!Kazuma:......... At the Port of Dunkirk, on board the SS Grouse... Is that the answer you're looking for, Ryunosuke?Ryunosuke:Kazuma! What did you...?! (I hadn't considered the possibility before, but... ...if Kazuma was there on the ship, then...it can only have been for one purpose...)Susato:Oh no, Mr Naruhodo! Surely...surely you don't think...?Kazuma:Ha ha ha ha hah! Come on, Ryunosuke, you know the rules. The only thing that really talks in the courtroom is hard evidence.Ryunosuke:...!Kazuma:As I understand it, Inspector Gregson always took that case with him when he travelled. So as it stands...you've proved nothing.Ryunosuke:Kazuma... ...are you challenging me to prove it, beyond all reasonable doubt? That you were there that day...in the same place as the inspector!Van Zieks:He, he was there? With Gregson?Ryunosuke:There's a clue that you've overlooked! A secret that trunk can tell us. (I can't be sure at this point. I'll need to verify it. But I have a nasty feeling...that I'm going to be right.)Stronghart:The accusation being made is deeply disturbing. But nevertheless...we must test it. The defence will identify for the court where in the trunk this alleged clue is to be found. Where is the evidence that ties Prosecutor Asogi to Inspector Gregson?Ryunosuke:There's a small piece of metal lodged in the wall of the trunk here. Like the tip of a blade.Gina:Eh? A blade?Ryunosuke:Kazuma, slung around your waist as ever today... ...is the esteemed blade Karuma!Kazuma:Of course it is.Ryunosuke:Won't you draw it? Here in this courtroom...for all to see.Kazuma:.........Van Zieks:Exercise caution, my learned friend. That man is the son of London's most notorious killer.Stronghart:Bailiff! Watch Prosecutor Asogi like a hawk!Kazuma:...That won't be necessary.Susato:Oh no!Ryunosuke:The tip...is broken...Van Zieks:...!Ryunosuke:If the fragment of metal from the trunk fits together with the end of the sword... ...the question of who was there with Inspector Gregson will be answered. Agreed...Kazuma Asogi?!Kazuma:Expertly done, Ryunosuke! That's a point to you, and well deserved.Stronghart:Do you mean to tell the court, Prosecutor Asogi...?Kazuma:Yes, on 31st October, I accompanied Inspector Gregson to Dunkirk... ...in order to carry out a mission.Ryunosuke:So the 'additional person' authorised to travel...Kazuma:...Was me.Stronghart:And the mission was...?Kazuma:...The assassination of the mark.Ryunosuke:Wha... WHAAAAAAT?! You mean...you're the killer whose name was omitted from this notebook?! You were following the Reaper's orders...to dispatch Judge Jigoku...?Kazuma:......... Let me make one thing perfectly clear: I have killed no one.Stronghart:Explain.Kazuma:I accepted the assassination mission, yes. And I accompanied Gregson to Dunkirk. But I never had any intention of carrying out the plan.Ryunosuke:You were never going to do it...?Susato:...We can believe Kazuma-sama, I'm sure. After all, Judge Jigoku arrived safely in London the following day.Stronghart:Hmmm...Kazuma:On the 31st, I boarded a train from London with Inspector Gregson. We travelled to Dover, from where we crossed the Channel to Dunkirk. Then we boarded the SS Grouse and made for the cabin deck - as indicated in the plan.Susato:You went to Judge Jigoku's cabin?Kazuma:Exactly. He wasn't there, though. We decided to wait, but...Ryunosuke:But you've already told us you had no intention of going through with it anyway.Kazuma:I didn't come to Great Britain to take anyone's life. So I left Gregson and disembarked the ship. I spent that night at a boarding house in the town, and returned to England the following morning.Ryunosuke:A boarding house...in Dunkirk?Kazuma:My signature will be in the register book. It would be simple enough to verify.Stronghart:Then what became of Jigoku?Kazuma:Gregson was no assassin. So the mark was spared. I'm sure it's easy enough to imagine what happened after that. Gregson returned to England as well, having failed to complete the mission. He met with the Reaper in that room on Fresno Street to report the failure... ...causing the infuriated mastermind to pull the trigger... ...and end his wretched agent's life. That's the real truth behind Inspector Gregson's murder!Van Zieks:Van Zieks:But if you did nothing as you claim... ...how did the tip of your sword come to be lodged in the inspector's trunk?Kazuma:......... I don't need to answer that.Ryunosuke:...!Kazuma:The victim was killed by a gunshot. A small fragment of a Japanese blade isn't relevant to the case. And accordingly...I choose to exercise my right to silence on that matter.Van Zieks:.........Stronghart:Be that as it may, the court will sequester the sword as evidence.Kazuma:......... As you wish, My Lord.The great sword 'Karuma' has been entered into the Court Record.Stronghart:We must take immediate action now... ...to verify whether Seishiro Jigoku remains unharmed.Ryunosuke:What?! R-Remains unharmed?Kazuma:I agree. That should be our first priority. It's recently come to my attention that he hasn't been seen since yesterday.Ryunosuke:...! H-How did you...?Kazuma:When a foreign dignitary invited to Great Britain goes missing for twenty-four hours... ...it's only natural that the question of his safety should arise.Ryunosuke:You don't mean to say... ...that you think Judge Jigoku may have been killed?!Kazuma:The Reaper has more than one assassin at his disposal. And he has the power and influence to give orders from the inside of a prison cell. Isn't that right...Lord van Zieks?Van Zieks:...If I were truly the Reaper, I'd be able to tell you.Stronghart:Order! Order in court! Order! We will take an emergency recess for thirty minutes.Ryunosuke:Now?Stronghart:Guests of the symposium have been told to maintain regular contact with the organiser's office. If the man can't be located within half an hour... ...we will have to assume the worst.Susato:Oh no! Not Judge Jigoku!Kazuma:No one would want to kill a harmless Japanese man who'd only just arrived in the country. Except, that is... ...for the Reaper, wanting to finish off a mark that slipped through the net ten years ago.Stronghart:I would have to agree. Mr Naruhodo, for the defence's sake...Ryunosuke:M-My Lord?Stronghart:...I sincerely hope we are successful. If we're unable to confirm Mr Jigoku's healthy existence in the next thirty minutes, you will face grave difficulties.Ryunosuke:Ah!Stronghart:Court is adjourned for thirty minutes!Susato:Kazuma-sama, the Reaper's assassin... I feel as though I'm in a nightmare.Ryunosuke:I can hardly believe it either. But on the other hand... ...Kazuma isn't in the habit of making up stories.Susato:......... I have such a terrible sense of foreboding. If something awful has happened to Judge Jigoku... ...then I feel as though things will only spiral further and further out of control.Ryunosuke:(I felt it from the moment I stepped into the courthouse this morning. That strange sensation that we were careering towards a foregone conclusion...) Well, in the worst case, we might only have thirty minutes left. Unfortunately though, I don't think there's anything we can do but wait now. We're out of options.Susato:......... Actually, there may be one last hand we can play. Or rather...one last ear.Ryunosuke:Of course! The little Mr Sholmes doll that Iris gave us!Iris:If for some reason you completely run out of options in the trial today... ...then just pull this little Hurley's ears as hard as you possibly can!Ryunosuke:(Perhaps now is the time. What should I do? Pull Hareley's ears or not...)Ryunosuke:Here goes then. I'm going to do it!Susato:Good luck, Mr Naruhodo!Ryunosuke:No looking back... HEEEAVE!!!???:OOOOOOOOOOOOW!Susato:That scream...sounded like Mr Sholmes!Ryunosuke:M-Mr Sholmes?! ...Where are you?Sholmes:Here, my dear fellow! Here!Ryunosuke:It's...it's the felt doll talking!Susato:Pull the ears again, Mr Naruhodo! As hard as you can!Ryunosuke:Alright then. I'll put all my strength into it. HEEEEEEAVE!Sholmes:OOOOOOOOOOOOW! Please, my dear fellows! You don't need to pull my ear off!Susato:Mr Sholmes! Where, where are you?Sholmes:Myself and my trusty partner... ...are presently in the first-class cabin area of the SS Grouse.Ryunosuke:The, the SS Grouse?Sholmes:She left Dover last night, after the final pieces of cargo were loaded. We are currently docked at Dunkirk, but due to be underway again in half an hour.Ryunosuke:You've...taken a ship to France?!Sholmes:Please, even with my athletic prowess, I would struggle to jump the Straits of Dover. After we left Baker Street last night, we hurried by cab to the station and by train to the port... ...in order to board this vessel in time.Ryunosuke:So...you mean...you'd already worked it out? That the steamship was where everything really took place!Sholmes:Mr Naruhodo...pray, what is my name?Ryunosuke:Herlock Sholmes...world-famous great detective!Sholmes:Recited to perfection. Well done.Susato:You're a genius, Mr Sholmes! That's the only word for it!Sholmes:Ow ow ow ow ow! M-Miss Susato! Gently with this genius's ear, please!Susato:Oh my! I'm ever so sorry!???:If I may, Sholmes...?Sholmes:Ah, there you are, Mikotoba.Mikotoba:You may remember that it was in fact I who made the connection to the SS Grouse. At Scotland Yard yesterday, when we examined that notebook and I recalled my steamship ticket.Sholmes:Ah ha ha ha ha hah! But of course it was, my dear fellow! And not once did I controvert that fact. I merely had our court-bound companions utter my name.Mikotoba:......... Yes, you did, didn't you?Ryunosuke:We've just entered a recess. The trial resumes in thirty minutes from now.Susato:And if we're unable to present any new leads then, I'm afraid to say...Sholmes:Do not fret, please. It's for precisely that purpose that my partner and I have made this journey. I have no doubt we shall have welcome news for you within the half hour.Ryunosuke:Thank you, Mr Sholmes! That would be wonderful.Sholmes:Until later, then.Ryunosuke:Yes! You'll be hearing from us if you're not in touch first.Sholmes:Ow ow ow ow ow! I shan't be hearing anything if you keep tugging my ear in that mindless fashion!Mikotoba:Whatever was the idea behind making a receiver operated [sic] in that way in the first place, Sholmes?Sholmes:Why the deuce would I know?! It's Iris's invention, not mine.Mikotoba:Whilst I know how much you enjoy being the hero of the hour, Sholmes... ...we have but half that now before the Grouse puts to sea again. If we don't conclude our investigations rapidly, we shall find ourselves in Naples before long.Sholmes:Hm...there are times, Mikotoba, when you make a surprising amount of sense. So, let us begin!Mikotoba:'First-Class Cabin No. 2'... Yes, this is the one. But I don't believe an investigation of the cabin is going to be plain sailing. (That crewman standing in front of the door is an angry-looking fellow.)???:Why are you loitering here? Who are you?Sholmes:My dear fellow, do you not recognise a world-famous great detective when you see one? The question really ought to be, who are you????:Do you not recognise world-travelling great sailor Tchikin Strogenov when you see?Tchikin:Great detective? Hah! I don't think so.Sholmes:......... Do you see that, Mikotoba? It would appear that this man is a devoted follower of mine.Mikotoba:Goodness me! Is, is that a tattoo? That says 'Sholmes'?!Sholmes:...I must say, whilst such adoration is flattering, naturally, it does leave me a little cold.Tchikin:What are you talking about? Leave! Now!Sholmes:How distressing. My loyal devotee knows me only by name and not by appearance. And yet I already know a great deal about you, sir. You have a brother, I believe. Like yourself, he's a shipman. Currently travelling the world aboard a Russian steamship, in fact.Tchikin:H-How could you know this?!Sholmes:Elementary, my dear Mikotoba.Mikotoba:...I'm sure it was. Three days ago, I was bound for London aboard this ship, you see. We're looking for one of my fellow passengers. A man by the name of Jigoku.Tchikin:There is no one with this name on board.Mikotoba:But we know that he purchased a ticket for passage.Tchikin:......... Ah, you mean Eastern man. He left ship two hours ago. Here at Dunkirk. He said something about emergency, I think.Mikotoba:What?! Are, are you sure? (So Seishiro's realised that we're after him, has he?)Sholmes:His cabin is the one behind you. We should like to investigate, please.Tchikin:No! I have orders not to let even mouse inside!Sholmes:......... Mikotoba, be a good man and draw this sailor's attention away, would you? Make up some excuse so that he leaves the area.Tchikin:......... Doesn't great detective see...? That even sailors have ears. Both left and right.Sholmes:......... Curses! The plan is ruined!Mikotoba:...And you have only yourself to blame, I'm afraid, Sholmes.Tchikin:Forget it. Cabin door is locked. Even if I am not here, you cannot get inside.Sholmes:......... Mikotoba... ...I'm sure you haven't forgotten my 'special talent' have you?Mikotoba:...! (Opening any lock?)Sholmes:...Within a mere five seconds. So if you'd be so kind as to afford me the requisite time, old friend, in your typically accommodating manner.Mikotoba:How could I refuse such a typically unappealing request, old friend? (So I need to distract that burly sailor for five seconds, do I?)Sholmes:Good man! So...the game is afoot!Mikotoba:(Here goes, then. Pardon me in advance!)Ding-aling-aling-aling-aling-aling-aling...Tchikin:You! What are you doing? If we were at sea, that would be very bad problem!???:What's going on down there?! Seaman Strogenov! Report at once!Tchikin:...! Sorry, sir! Nothing to report! It was just stupid trick! ...No, not by me! By world-famous- No! As I told you...Mikotoba:Now, Sholmes! Now!Sholmes:...Done.Mikotoba:Not even five seconds, eh?Sholmes:Well don't stand there gawping at my brilliance, Mikotoba! In we go!Mikotoba:Oh! Yes...3rd NovemberSS Grouse, First-Class Cabin No. 2Mikotoba:Good gracious...Sholmes:It would appear that the occupant of this cabin did indeed disembark rather hurriedly.Mikotoba:Those clothes on the floor there... They're Seishiro's, without question.Sholmes:Well, it seems we are just a little too late.Mikotoba:Yes, by about two hours.Sholmes:Still, whilst we're here, we should investigate thoroughly. There may well be two hours' worth of clues to find in here.Mikotoba:But that burly crewman may return at any moment, Sholmes.Sholmes:Indeed he may. ...Which makes this all the more thrilling!After examining tray with glass, wastebasket, large briefcase, and square mark on wall:Tchikin:You! You are still here?!Mikotoba:Ah, Able Seaman Strogenov. Hello again.Sholmes:...I was beginning to think you'd never materialise.Tchikin:Eh? You...you are waiting for me?Sholmes:Of course! I was expecting you to burst in with a hearty Russian profanity far sooner.Tchikin:I was in trouble with captain because of trick you play before!Mikotoba:(Poor, innocent Tchikin...)Tchikin:It is all your fault! Ship is leaving port soon. Get off! Now!Sholmes:Of course, we shall disembark presently, my dear fellow. But first... ...there is something that must be done.Tchikin:What are you talking about?Sholmes:Why naturally... ...the debunking of your deceit and the baring of the truth!Tchikin:Kakoy?!Sholmes:I'm afraid I see through your lies. For one thing... ...Mr Jigoku has not yet left this vessel at all.Tchikin:Ah!Sholmes:And for another, my dear Seaman Strogenov... ...you know exactly where the man is even as we speak, don't you?Tchikin:......... How, how can you...?Mikotoba:Good gracious, Sholmes! You mean...you've worked it out? All of it?!Sholmes:......... It's really been too long, hasn't it, old friend? Ten years, no less!Mikotoba:...!Sholmes:So...would you care to join me for a dance...of my inimitable logic and reasoning?Mikotoba:......... Nothing would please me more!Tchikin:W-What is this?Sholmes:We have but minutes until the vessel puts to sea. No games now.Time is of the essence!Mr Strogenov, allow me to remind you of your earlier claim: You told us that Jigoku left the ship some two hours ago.Tchikin:Da! That is what I said!Sholmes:Sadly, that was a rather clumsy lie. You see, there is something in this room that quite clearly contradicts it.Tchikin:What?!Mikotoba:Ah! (Yes, of course...)Sholmes:I see you've noted it too,  Mikotoba. Then please, do take the lead... What in this cabin shows the impossibility of Jigoku having disembarked two hours ago? Let's see what the last three years have done to your observational skills then, Mikotoba!Mikotoba:It's been ten years since we last did this, Sholmes, not three.Sholmes:Why, of course it has! Quite! Now, all the clues are here in this cabin for your eyes to see. But as I always say, you must not merely look, but observe. Observe and the answers become clear. So...impress me!Mikotoba:I think I can manage that!What in this cabin shows the impossibility of Jigoku having disembarked two hours ago?Mikotoba:Jigoku didn't disembark two hours ago at all. That was a lie, wasn't it?Sholmes:Of course it was. And I had hoped you would be quicker to point out why. Otherwise...the evidence itself may melt away before our every eyes!Mikotoba:Perhaps you should have cleared away that glass?Sholmes:How curious that the ice shouldn't have melted despite it being abandoned two hours ago?Tchikin:Ah!Sholmes:It would appear that the man was here in this very cabin until moments before our arrival... ...with this well-chilled glass in hand!Mikotoba:(Get your mind off the refreshments, Sholmes.)Sholmes:One might even conclude that somebody informed him of our boarding. Wouldn't you agree, Mr Strogenov?Tchikin:Errr...Mikotoba:But...why would Seishiro run from us?Sholmes:......... Before we consider that question, allow me to confirm one small matter: Would I be correct in saying that these first-class cabins of the SS Grouse... ...are the same ones in which you and Mr Jigoku were accommodated on your voyage from Japan?Mikotoba:Ah! That's...that's right, they are. I was in the cabin next door, and Seishiro was...yes... ...fifty days in this very cabin during our voyage!Sholmes:As I suspected. For you see... ...there are traces in this cabin of a dark secret that Mr Jigoku had to hide.Mikotoba:What traces?Tchikin:I, I know nothing about this!Sholmes:Ah, this is news to you, is it, Mr Strogenov?Mikotoba:Sholmes, what exactly are you getting at?Sholmes:As I said, there are traces in this cabin of some nefarious activity. Something that appears out of place, which I'm quite sure won't have escaped your notice.Mikotoba:(Something out of place in here...?)Sholmes:That's the key to this, Mikotoba. The remnants of the dark deed that took place in here are being masked by something quite incongruous! I must say, I didn't foresee ever doing this dance of deduction with you again, Mikotoba.Mikotoba:No, quite. But life is full of unexpected twists and turns, as we well know. Now then, let's see if I can't uncover the truth here...Sholmes:Yes, you have the floor, my dear fellow!The remnants of the dark deed that took place in here are being masked by something quite incongruous!Sholmes:You must tilt your head to one side and listen carefully to the faint cries of the scene. Hear the evidence calling out for you to find it. 'Here I am,' it cries!Mikotoba:Well, your methods were never conventional. But you know I've always been willing to give them a try! .........Sholmes:Dear God, Mikotoba, open your eyes! It was a metaphorical listening that I was suggesting!Mikotoba:(Ah...)Mikotoba:It's the Rules of Passage in this frame here. They're obviously out of place. The way they're hanging crooked on the wall...as if they were put there in a hurry.Sholmes:Yes, as I'm sure you've already concluded... ...that frame was originally over here. The shape and size are a perfect match.Tchikin:Da! You are right! When did frame move...?Sholmes:Hardly the most observant of crewmen, are you, Mr Strogenov? I would think your captain is quite justified in having his reservations about your reliability.Tchikin:Grrrrrr!Mikotoba:(Oh dear. That really seemed to touch a nerve.)Sholmes:So, Mikotoba...why don't you lift that frame off the wall?Mikotoba:That...that looks... ...like a bullet hole!Tchikin:What?! Who has been shooting walls?Sholmes:I see the projectile has been removed. Clearly the careful occupant of this room has already disposed of it. Now then, Mr Strogenov...Tchikin:Agh!Sholmes:...I have the distinct impression that you're attempting to shield said occupant.Tchikin:I don't know what you are talking about! Why would I try to protect Eastern stranger?Sholmes:Ah, so we're talking about the same man, I see. Good.Tchikin:Ugh!Sholmes:I'm sure we can get to the bottom of this in no time... aren't you? Because there's some very noteworthy evidence that explains the reason why you're lying for the man! Yes, you've been told to keep up this pretence, as clearly shown by...Mikotoba:I really don't know how to approach this one, Sholmes.Sholmes:Ah, my dear Mikotoba, simply keep first principles in mind. Study your subject from every angle... ...and I'm quite sure that you'll see it. In fact, I'd put a wager on it!Mikotoba:So I'm to glare at the fellow from all sides? Well, I can certainly do that...Yes, you've been told to keep up this pretence, as clearly shown by...Mikotoba:So a Russian crewman is aiding a Japanese man to evade capture by an English detective...Sholmes:Nationality needn't come into it. In this respect at least, all humans are the same. Ask yourself what can spur a man to do the bidding of another about whom he knows precious little. There is only one thing in the whole world with such repugnant, bottomless power!Mikotoba:Let's not get carried away now, Sholmes.Mikotoba:It's almost too obvious for words.Sholmes:Quite. The universal language of the world: money.Tchikin:Ah!Mikotoba:And I'd wager that the Eastern fellow in question... ...is Seishiro Jigoku. Yes?Tchikin:Gaaagh!Mikotoba:So, I presume you realise what this means? There are clear signs that a crime has been committed in this cabin. And the way you're going, sir, you'll find yourself accused of being an accomplice.Tchikin:B-But...Sholmes:I believe you know, Mr Strogenov... You know where Mr Jigoku is hiding at this precise moment in time!Tchikin:...!Sholmes:As always, Mikotoba, in matters of deduction, the furtive glance is your unfaltering ally.Mikotoba:Yes, I think you're onto something there, Sholmes. You've found the chink in this burly fellow's armour!Sholmes:We need only follow the man's gaze to know where our prey is hiding... The slightest flicker of the pupils... A minutely delayed blink... Nothing escapes my attention. Even that which is barely perceptible.Mikotoba:You could hardly call this barely perceptible, Sholmes. The man's turned his entire head. It's not exactly what you'd describe as a furtive glance, is it? It's almost too obvious...Sholmes:We shall let your tapping toes decide, my dear fellow!We need only follow the man's gaze to know where our prey is hiding...Mikotoba:So...you really think he's hiding in here as we speak?Sholmes:Curled up in a ball at this very moment! But as I said earlier, we've no time for games today.Mikotoba:No, I quite understand. I'll make this as quick as I can. Seaman Strogenov will be suffering neck fatigue before long, I should think.Mikotoba:You turned immediately to look at this large trunk, didn't you?Tchikin:Aaah!Mikotoba:The truth is, Seishiro Jigoku was unable to escape from the ship in time... ...and is, at this very moment, doing his best to stifle his breath inside this trunk!Sholmes:If he still has a breath to take. I fear he may be running dangerously low on air.Mikotoba:Hm?Sholmes:I imagine he didn't count on us making a nuisance of ourselves for quite so long. I think it would be in everyone's best interests for us to open the trunk as quickly as possible.Mikotoba:B-But how can we? Are you forgetting about the combination lock? We don't know the seven-digit code!Sholmes:The combination lock can't be opened from inside the trunk. Therefore there must have been an arrangement for somebody to open it after our departure.Mikotoba:Of course...Sholmes:In short, before Jigoku hid himself inside that trunk... ...he must have told somebody the seven-digit number for the lock. As I'm sure you can confirm...Mr Strogenov!Tchikin:*Gulp!* No! I know nothing about combination code!Sholmes:Don't move a muscle, my good seaman!Tchikin:Huh?Sholmes:Now, Mikotoba...would you do the honours and open the trunk?Mikotoba:H-How on earth do you expect me...?Sholmes:It's a seven-digit number, remember. Quickly now! We have little time!*Click!*Mikotoba:(That did it! It's open!)???:You had to meddle, didn't you...Jigoku:Well, Yujin, you've found me now.Mikotoba:Seishiro...Mikotoba:...I was really hoping beyond hope not to find you here, you know.Jigoku:But you're not entirely unsurprised, I take it?Mikotoba:No, quite. I just wish it were some other way.Sholmes:...Well? Are you ever going to introduce me?Jigoku:Ah, your reputation precedes you, Mr Sholmes. I've read stories of many of your exploits.Mikotoba:Excuse my manners, Sholmes. This is Mr Jigoku, my old friend and travelling companion.Sholmes:The devil is in the details, Mikotoba. I believe you meant to say: your old friend and travelling companion... ...who made the cowardly decision to flee the country without a word to anyone when things turned sour.Jigoku:...I see my reputation precedes me as well. What an honour.Mikotoba:Well, Seishiro? Are you going to explain all this?Jigoku:You know it all by now, I imagine. What you didn't know, of course, is that three days ago... ...on the night before our arrival in Britain, an attempt was made on my life here on this very ship.Mikotoba:By the Reaper of the Bailey? Yes, I've since heard. Because you were once prosecuted by the Reaper, weren't you? Ten years ago now, mind you.Jigoku:And I had no idea at the time what a dangerous individual he was. Anyway, when we arrived in London to find the symposium was postponed until goodness knows when... ...it became all too apparent to me that I might very well be targeted again.Mikotoba:So you decided to flee the capital, without saying a word to me about it?Jigoku:I'm afraid so, yes. Of course, I realise now... ...that I really ought to have confided in you.???:It's somewhat surprising, I must say...Jigoku:What is?Sholmes:Well, first-class cabins aboard luxury steamships are in very short supply. It's more than a little hard to believe that this one just happened to be available.Jigoku:So says the protagonist of some colourful short stories. Well, I don't care for your opinion. The cabin did just happen to be available. So I purchased a ticket and here I am.Mikotoba:I've just seen for myself the obvious remnants of that incident in this cabin. So you'd already purchased your return ticket before we even docked in Dover, had you? To prevent anyone else taking this cabin and seeing the evidence. Is that it?Jigoku:Yujin...I have nothing to say to you.Sholmes:Well, in a mere five minutes, this ship will set off on its onward voyage and not make port again until Italy. I'm afraid we must insist that you disembark with us at once.Jigoku:...You have no jurisdiction over my movements.Mikotoba:We have this, Seishiro. Take it.Jigoku:What is it?Mikotoba:It's a subpoena from the Old Bailey. You're a man of the law. You know what the ramifications of ignoring a document like this from the British courts would be.Jigoku:...You came prepared then, Yujin.Mikotoba:Come on, let's go.Sholmes:One moment...Mikotoba:What is it, Sholmes?Sholmes:Inside Mr Jigoku's trunk... ...I found this rather fascinating trinket.Mikotoba:What is that? Seishiro...?Jigoku:I can't help you, I'm afraid. Some small component from something. But what, I have no idea.Mikotoba:(By the look on his face...I think he genuinely doesn't know.)Sholmes:Well, let us pocket it as a small souvenir of our brief sojourn in France.The small component has been entered into the Court Record.Mikotoba:(Well, young Naruhodo, I think we've done as much as we can, I'm afraid. The rest will be on the shoulders of you and your assistant!)3rd November, 12:10 p.m.The Old Bailey CourtroomRyunosuke:(Kazuma Asogi... I know you, and I know you wouldn't lie. But still, there's no doubt... ...that you're holding something back. You know more than you're saying!)Stronghart:During the past thirty minutes while this court was adjourned, all possible efforts were expended... ...but sadly Mr Jigoku's whereabouts could not be ascertained.Kazuma:We must accept the unfortunate conclusion that the Reaper has already done the deed.Van Zieks:.........Kazuma:There's no sense in wasting any more of the court's time. The prosecution calls for an immediate verdict.Ryunosuke:Ryunosuke:No. The trial cannot end now.Kazuma:You're a Japanese man, Ryunosuke. You should know when to lay down your sword.Ryunosuke:And you should know never to presume when the battle is won.Kazuma:The court has already been presented with all the evidence and heard all relevant testimony. And there can only be one conclusion: that the accused is guilty!Ryunosuke:All relevant testimony? Far from it. There's still a crucial witness from whom the court is yet to hear a single word of testimony!Stronghart:In that case, call your witness to the stand at once, Counsel.Ryunosuke:...Yes, My Lord. ...Tomorrow. ...If possible.Susato:The witness is already on his way and scheduled to arrive tomorrow.Kazuma:Who on earth is this crucial witness?Ryunosuke:...Seishiro Jigoku. The very man allegedly murdered by the Reaper!Kazuma:J-Judge Jigoku?! You've found him?!Stronghart:But the investigations of every policing resource in the capital suggest that Jigoku is already dead. How in the name of God did you find the man?Ryunosuke:He was located in France during the recess. At the Port of Dunkirk... ...thanks to one of Mr Herlock Sholmes's famous deductions.Stronghart:Herlock Sholmes...Ryunosuke:Inspector Gregson almost certainly met with Mr Jigoku on the night of his death. Because along with Prosecutor Asogi, Gregson was on a mission to assassinate the man.Kazuma:.........Ryunosuke:Which means that Seishiro Jigoku is the sole witness... ...who can clarify exactly what happened aboard the SS Grouse on the 31st October!Stronghart:Well...it would appear that it's too soon to move to adjudication at this point.Kazuma:......... The prosecution concurs. The court must hear Mr Jigoku's testimony. No judgement should be passed until all testimony has been considered.Stronghart:......... In that case, I hereby call the end of today's proceedings. Court will reconvene at the same hour tomorrow. ...No objections from either side?Ryunosuke:No, My Lord!Kazuma:No objections, My Lord.Van Zieks:.........Ryunosuke:(...We live to fight another day...by the skin of our teeth.)Kazuma:.........To be continued...",
  "characters": [
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Susato Mikotoba",
      "age": "16",
      "description1": "A judicial assistant sent to Britain on a study tour. She's the epitome of a refined Japanese lady and a huge help to me always."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Iris Wilson",
      "age": "10",
      "description1": "An extraordinary young girl who lives with Mr Sholmes. She has a degree in medicine and is the author of a popular series of short stories."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Herlock Sholmes",
      "age": "34",
      "description1": "There's not a person in the world who hasn't heard of this famous great detective, whose deductions never fail to surprise."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Yujin Mikotoba",
      "age": "43",
      "description1": "A medical school professor at the Imperial Yumei University. He's an authority in forensic medicine, and Miss Susato's father."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Seishiro Jigoku",
      "age": "43",
      "description1": "The Minister of Foreign Affairs and a judge of the Supreme Court of Judicature in Japan. He's the man who acquitted me when I was once accused of murder."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Mael Stronghart",
      "age": "53",
      "description1": "The Lord Chief Justice, who wields absolute authority in judicial matters, including the appointment of lawyers. He's a thoroughly intimidating man."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Barok van Zieks",
      "age": "33",
      "description1": "A prosecutor known as the Reaper of the Bailey. Supposedly, the souls of those he prosecutes are eternally damned, one way or another."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Gina Lestrade",
      "age": "18",
      "description1": "A mostly reformed pickpocket who's now a self-appointed 'detective inspector'. She's really making waves in her new apprenticeship."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Evie Vigil",
      "age": "36",
      "description1": "A client who has engaged the services of Mr Sholmes. She has asked the great detective to help track down her missing husband."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Daley Vigil",
      "age": "40",
      "description1": "A man who's disappeared without a word to his family. He was the former chief warder of Barclay Prison."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Barry Caidin",
      "age": "51",
      "description1": "The governor of Barclay Prison. It seems he was good friends with Professor Mikotoba during the Japanese man's time in Britain as a visiting student."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Tobias Gregson",
      "age": "45",
      "description1": "A murdered Scotland Yard inspector. He was stern and single-minded in his approach, and a great lover of fish and chips."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Kazuma Asogi",
      "age": "24",
      "description1": "My best friend, who I had believed to be dead. He lost his memory somehow, but has now materialised as a prosecutor in the British courts."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Gossip",
      "age": "??",
      "description1": "A pedlar plying his trade on Fresno Street. He seems to make his money selling interesting items of news to passers-by."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Venus",
      "age": "??",
      "description1": "A pedlar plying her trade on Fresno Street. She seems to make her money selling meagre little fireworks to children."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Sandwich",
      "age": "??",
      "description1": "A mysterious 'signpost' who can be found on Fresno street. He looks familiar somehow..."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Fabien de Rousseau",
      "age": "26",
      "description1": "The fraudster behind the Red-Headed League swindle, who was caught by Mr Sholmes. He derives from the French aristocracy, it seems."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Peppino de Rossi",
      "age": "25",
      "description1": "A lackey of de Rousseau and conspirator in the Red-Headed League swindle. The third son of a great Italian landowner."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Maria Gorey",
      "age": "19",
      "description1": "The daughter of Dr Sithe who's also a coroner like her mother. She carries out all the autopsy work on corpses."
    }
  ],
  "evidences": [
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Armband",
      "type": "",
      "obtained": "",
      "description1": "An armband I inherited from Kazuma. It identifies the wearer as a defence lawyer throughout the Empire of Japan."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Red-Headed League Article",
      "type": "",
      "obtained": "",
      "description1": "An advertisement from the newspaper that's entitled 'To the Red-Headed League'. It seems somewhat suspicious in nature."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Photograph of Mr Vigil",
      "type": "",
      "obtained": "",
      "description1": "A photographic print received from Mrs Vigil in order to aid with locating her missing husband. He appears to have no particularly distinctive facial features."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Letter of Introduction",
      "type": "",
      "obtained": "",
      "description1": "A note of introduction on our behalf from Professor Mikotoba to Governor Caidin. Hopefully now he'll be willing to talk to us.",
      "description2": "A note of introduction on our behalf from Professor Mikotoba to Governor Caidin. It's written on the back of a ticket for passage on a steamship."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Dismissal Notice",
      "type": "",
      "obtained": "",
      "description1": "The harsh reprimand incurred by Mr Vigil ten years ago that resulted in him losing his job as chief warder of Barclay Prison."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Red Hairpiece",
      "type": "",
      "obtained": "",
      "description1": "A flame-red wig found at the scene of the crime on Fresno Street. Presumably it belonged to Inspector Gregson..."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Candelabrum",
      "type": "",
      "obtained": "",
      "description1": "A candelabrum from the wall of the room on Fresno Street where the inspector was found dead. The top of one of the candles appears to have been blown off."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Revolver",
      "type": "",
      "obtained": "",
      "description1": "The murder weapon that was found at the scene of the crime on Fresno Street. Probably best to avoid handling it."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Policeman Figurine",
      "type": "",
      "obtained": "",
      "description1": "A small and rather endearing model of a British policeman found at the scene of the crime on Fresno Street.",
      "description2": "A model of a British policeman found at the scene of the crime on Fresno Street. Giving it a twist causes a key-like shaft to pop out from the base."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Framed Photograph",
      "type": "",
      "obtained": "",
      "description1": "A photographic print of a smiling Mrs Vigil in her younger years. It was found on a desk at the scene of the crime."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Gregson's Photograph",
      "type": "",
      "obtained": "",
      "description1": "An old photographic print displayed rather prominently in Inspector Gregson's office, as if it was a treasured memory.",
      "description2": "An old photographic print displayed rather prominently in Inspector Gregson's office. The person on the left is Lord Klint van Zieks."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Autopsy Report",
      "type": "",
      "obtained": "",
      "description1": "Inspector Gregson's autopsy report, stating that death was instant, resulting from a bullet shot at close range.",
      "description2": "The autopsy report from the examination of Inspector Gregson's body. According to the coroner, Dr Gorey, an accurate estimation of the time of death is not possible."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Crime Scene Floor Plan",
      "type": "",
      "obtained": "",
      "description1": "A plan of the small room in the building of flats on Fresno Street where the body of the victim, Inspector Gregson, was found."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Noticeboard",
      "type": "",
      "obtained": "",
      "description1": "A free-standing noticeboard completely covered in notes and articles relating to victims of the Reaper of the Bailey.",
      "description2": "A free-standing noticeboard completely covered in notes and articles relating to victims of the Reaper. There is a bloody handprint on the back side."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Venus Firecracker",
      "type": "",
      "obtained": "",
      "description1": "The Venus Special firecracker consisting of one hundred smaller fireworks at sixpence each. What sort of bang could it make...?",
      "description2": "The Venus Special firecracker consisting of one hundred smaller fireworks at sixpence each. It goes off like a gunshot."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Photograph of the Victim",
      "type": "",
      "obtained": "",
      "description1": "A photographic print of the victim, Inspector Gregson. His body appears to be tightly curled up and there's a red hairpiece on his head."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Gregson's Pocket Watch",
      "type": "",
      "obtained": "",
      "description1": "Inspector Gregson's pocket watch that he wound without fail every single day. It's no longer ticking and the glass over the face is cracked.",
      "description2": "Inspector Gregson's pocket watch that he wound without fail every single day. Having wound it up, it's started ticking again."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Inspector's Identification",
      "type": "",
      "obtained": "",
      "description1": "The identification of a man claiming to be a detective inspector, confiscated by Mr de Rousseau and Mr de Rossi.",
      "description2": "Inspector Gregson's police identification. It's the official warrant card issued to him by Scotland Yard."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Commemorative Photograph",
      "type": "",
      "obtained": "",
      "description1": "A photograph taken in the foyer of the Great Waterloo Hotel on the morning of Professor Mikotoba and Judge Jigoku's arrival in London for the symposium."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "The Asogi Papers",
      "type": "",
      "obtained": "",
      "description1": "The last will and testament of Genshin Asogi that Mr Vigil claims disappeared after the convict's execution. Apparently Mr Asogi described it as 'the only weapon I have left'.",
      "description2": "The last will and testament of Genshin Asogi that Mr Vigil claims disappeared after the convict's execution. It seems there was a third page to it."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Gregson's Trunk",
      "type": "",
      "obtained": "",
      "description1": "Inspector Gregson's metal travelling trunk that was removed from the scene, but subsequently recovered by Gina."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Passport",
      "type": "",
      "obtained": "",
      "description1": "A passport document that was in Inspector Gregson's possession. It was issued for travel to France the day before his body was discovered."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Klint's Autopsy Report",
      "type": "",
      "obtained": "",
      "description1": "The autopsy report of the final victim of the infamous Professor. The report was authored by Dr John H. Wilson.",
      "description2": "The report from the autopsy of the Professor's final victim. It's signed by Dr John H. Wilson who carried out the procedure, though Professor Mikotoba actually penned the report."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Iris's Lucky Charm",
      "type": "",
      "obtained": "",
      "description1": "A little doll of Mr Sholmes in hare form. I've been told to tug its ears if I run out of options in the trial today..."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Great Sword 'Karuma'",
      "type": "",
      "obtained": "",
      "description1": "The illustrious blade passed down through generations of the Asogi clan. The prized sword's tip has a small piece missing."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Evacuation Drill Itinerary",
      "type": "",
      "obtained": "",
      "description1": "A notice about a practice evacuation to be carried out by the crew of the SS Grouse the night before the ship arrived in Dover. It was found in Judge Jigoku's cabin."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Small Component",
      "type": "",
      "obtained": "",
      "description1": "A small machine part that Mr Sholmes found in Judge Jigoku's cabin on the SS Grouse.",
      "description2": "A small machine part that Mr Sholmes found in Judge Jigoku's cabin on the SS Grouse. It's now clear that it's the missing 'crown' of Inspector Gregson's pocket watch. * (This update to the description is entirely optional, and can only be achieved by examining anywhere on this evidence, then the tip on Gregson's Pocket Watch before the former evidence is specifically presented in court. However, this method still occurs in Story Mode.)"
    },
    {
      "currentChapter": "Twisted Karma and His Last Bow",
      "name": "Telegram from Japan",
      "type": "",
      "obtained": "",
      "description1": "A telegram from Inspector Hosonaga in Japan with details of the telegram he managed to locate by stealing into Judge Jigoku's office."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Mr Asogi's Ring",
      "type": "",
      "obtained": "",
      "description1": "A ring belonging to Genshin Asogi found in Lord Klint van Zieks's stomach during the autopsy. The claws clasping the gem look sharp enough to cause a very nasty scratch."
    },
    {
      "currentChapter": "The Resolve of Ryunosuke Naruhodo",
      "name": "Klint van Zieks's Will",
      "type": "",
      "obtained": "",
      "description1": "The last will and testament of Lord Klint van Zieks that has been hidden inside the great sword Karuma for years. A trump card left behind by Genshin Asogi."
    }
  ],
  "turns": []
}