{
  "previousContext": "Episode 4 Turnabout Reminiscence\nEdgeworth: Kay Faraday... the young lady who calls herself the second Yatagarasu... The piece of cloth that she conjured up has taken me back to many years ago...\nDefendant: Yeah, that's right. I did it. I killed the guy. But it was the Great Thief Yatagarasu that told me to do it!\n???:\nLawyer: I ask the defendant... Just what exactly are you trying to say?\nDefendant: Don't you get it? I know the true identity of the Yatagarasu! ...The Yatagarasu is the man standing over there at the prosecutor's bench!\nProsecutor: Are you saying... that I'm the Yatagarasu?\nDefendant: Don't you dare deny it! You told me to kill him when you snuck into the embassy!\nLawyer: Are you claiming that Mr. Faraday is the Yatagarasu?\nDefendant: That's exactly what I'm saying!\nProsecutor:\nProsecutor: Mr. Rell! I think we've heard just about enough out of you...!\nDefendant: Your Honor! Please listen to me! I'm telling the truth... You've gotta believe meeeeeee!\nJudge: Hmph... In accordance with the defendant's accusation... ...a new prosecutor shall be called to replace Mr. Faraday. This court will be in recess until the new prosecutor is ready.\nEdgeworth: (...It's almost time for me to enter the courtroom. And, so it is that my first assignment as a prosecutor will be... ...as a replacement for a prosecutor who has been accused by the defendant.)\n???: Edgeworth.\nEdgeworth: ! ...Sir.\n???: Have you read over all of the documents regarding this trial?\nEdgeworth: Yes, sir. I've memorized everything there is to know.\n???: Very good. The paperwork for the prosecutor substitution is just about complete. Edgeworth... always bear in mind that as your mentor, I, Manfred von Karma... ...will accept nothing short of perfection.\nEdgeworth: I understand, sir. To have the chance to stand in court at such an early stage in my career... ...I am honored and proud.\nManfred: As I have watched over your studies, I am giving you this very rare chance. Prove yourself. Crush the defendant's pathetic lies into oblivion.\nEdgeworth: .........Yes, sir! (That such a legendary prosecutor will be watching (changed from [is watching over] in the original release) and judging my performance... ...I have to be perfect in every way!)\nEdgeworth: If it is true that the Yatagarasu showed up at the Cohdopian Embassy... ...what could he or she have been after?\nManfred: Hmph... No doubt to steal any suspicious accounting records and release them publicly. Or, more likely, to steal secrets from the Cohdopian Embassy itself... ...since the item that the Yatagarasu stole from there was sent to the police.\nEdgeworth: What was it that the Yatagarasu sent to the police?\nManfred: ...I don't know the details. Anything related to the Yatagarasu is getting the top-secret treatment. Still, I find it very ironic. By returning the stolen item to the police, it was proof positive that the Yatagarasu... ...had infiltrated the embassy on the same day the staff member was killed. Criminals have a way of incriminating themselves, wouldn't you say?\nEdgeworth: That would have to be the first time the Yatagarasu has left evidence behind, correct?\nManfred: Yes, indeed. If you wish to learn more about the Yatagarasu, then I suggest you ask Faraday.\nEdgeworth: Mr. Faraday...?\nManfred: He happens to be the prosecutor in charge of the Yatagarasu case, as well.\nEdgeworth: (He's the prosecutor in charge of both the KG-8 Incident and the Yatagarasu case? Mr. Faraday really has a lot on his plate...)\nManfred: ...What is it, little girl?\n???: ......... ...You're scary, mister.\nManfred: !\nEdgeworth: Did you need something?\n???: Umm... I want to trade these coins with you!\nEdgeworth: A fistful of dimes, quarters, and pennies... but it looks like you've exactly a dollar. Is this what you want?\n???: Thanks! That's exactly what I needed!\nEdgeworth: Could that child be here to watch the trial?\nManfred: How disrespectful for a child like that to be running around inside the courthouse! Does no one have respect for this country's judicial system anymore!?\nBailiff: The paperwork for the prosecutor substitution is complete!\nManfred: Why you! Do you even know how much time there is left before the trial resumes!?\nBailiff: I... I-I'm so sorry!\nManfred: I can have you mopping up this courthouse instead of protecting it in an instant!\nBailiff: ! *gulp*\nEdgeworth: It's no bother, sir. Not being completely prepared could prove to be a perfect handicap for me.\nManfred: Hmph. A proud one you are. You had better collect the evidence from Faraday and prepare yourself. It's time for your debut, Edgeworth!\nManfred: ..................\nEdgeworth: ..................\nManfred: Just what is going on!? Why isn't Faraday here yet!? How is it possible that the defense is not prepared yet, either!?\nEdgeworth: Bailiff... Where is Mr. Faraday?\nBailiff: I-I'm not sure... I wasn't really paying attention...\nJudge: Ah, you must be the one Mr. von Karma recommended... I hear this will be your first trial. I look forward to seeing how you perform. Oh, by the way, was there someone celebrating a birthday during the recess? I could have sworn that I heard a popper going off... Come to think of it... The other day with my grandson...\nEdgeworth: Sir, it looks like the trial is about to resume, however...\nManfred: ...Yes, it will be all but impossible to prove the witness a liar... ...without the evidence from Faraday! What is that blasted buffoon up to!?\n???: I-I-It's an emergency, siiiiiirs!\nJudge: S-Silence!\nManfred: There shall be no yelling in this sacred hall of law! Bailiff! Remove that man from this courtroom at once!\n???: P-Please... wait! You have to listen to me! There's an emergency! Defendant Lobby No. 2...! M-Mr. Faraday and the defendant... Th-The two of them... They're... They're both dead, Your Honor!\nJudge: Wh--!?\nManfred: Wh--!?\nEdgeworth: Wh--!? Whaaaaaaaaaaaaaaat!?\n???: Stay back!\nEdgeworth: Ungh...!\n???: ...No one's allowed on the crime scene... Period.\nEdgeworth: (Just who does this... oddball think he is...?)\n???: This is becoming quite the hotspot...\nEdgeworth: (Isn't she Mr. Rell's defense attorney...?)\n???: H-Hey, you! No running in the hallway, pal!\nEdgeworth: And who are you to tell me what to do? (I'll never find out what's going on like this. It's time for some civil discourse.)\nAfter clearing all Talk options with Tyrell Badd, Calisto Yew, and Dick Gumshoe:\nBailiff: Ms. Yew! There is someone here who wishes to see you...\nYew: ......Who is it?\nBailiff: A Cohdopian Embassy staff member by the name of Manny Coachen.\nYew: Wh--!\nBadd: .........!\nEdgeworth: (What's going on? Detective Badd and Ms. Yew's moods just changed all of a sudden. Wait a second... Wasn't Manny Coachen...!?)\nYew: I'll be right there.\nCoachen: It's nice to see you again... Ms. Yew.\nYew: Why are you here? I have no desire to ever see you again.\nCoachen: Now, now... Actually, would you mind stepping outside for a brief chat?\nYew: ........Fine. Let's go.\nManfred: ...Badd.\nBadd: Von Karma...? It's been a long time.\nManfred: I knew you would show up. You usually do when the Yatagarasu is involved, and I see this case is no exception.\nEdgeworth: Do you know Detective Badd, sir?\nManfred: Yes. He's like an old bloodhound that never leaves the scene of a crime. If only he would get a promotion and move on.\nBadd: It's the crime scene where a detective is most useful and effective.\nManfred: Hmph! It's not like I don't know that. Moving on though, Badd. The man that I just passed by... ...was he not the suspect from the KG-8 Incident!?\nEdgeworth: (So I was right...!)\nManfred: Just what is that man doing, wandering around here!? That Faraday... I can't believe he let such an easy catch get away! Imbecile! I would've proved his guilt in three minutes!\nBadd: Von Karma! ...I think you've said enough for now. It's in poor taste to speak like that about the departed.\nManfred: Hmph... Very well. Back on topic... I'm placing Edgeworth in charge of the investigation here...\n???:\n???: Papa! How can you place him in charge!?\nEdgeworth: Franziska... What are you doing here?\nFranziska: I'm here for summer vacation, what else?\nEdgeworth: (Franziska von Karma... So she is here on vacation from Germany... She is the daughter of Manfred von Karma and a student of his, who's also junior to me.)\nFranziska: You're the one who's junior to me! And don't you forget it!\nEdgeworth: You're not conveniently avoiding the Bar Examination, are you?\nFranziska: Hah... If you were able to pass, then I'll have absolutely no trouble at all. I'll never allow myself to lose to you! Never!\nEdgeworth: (Why does she always have to be this competitive...?)\nFranziska: Anyway... Papa... Are you really assigning Miles Edgeworth to cover the case?\nManfred: Yes, I am. Why do you ask?\nFranziska: Well, you know... I'm close to becoming a prosecutor myself... And I am 100% confident that I can do a better job than him!\nEdgeworth: (That's just like Franziska. She has no problem bad-mouthing someone right in front of them.)\nManfred: ...Badd.\nBadd: Yeah...?\nManfred: These two will be conducting the investigation.\nBadd: What? You want me to let both of these kids loose on the crime scene?\nManfred: Hah. This is a perfect opportunity for them to work on their prosecutorial skills.\nBadd: A crime scene is not a place for children to be messing around in!\nManfred: I'm the one with the authority over this crime scene, Badd. ...And I will not tolerate complaining.\nBadd: ...Knngh...!\nManfred: Edgeworth! Franziska! I leave this case to the two of you.\nEdgeworth: Understood, sir.\nFranziska: Yes, Papa.\nManfred: I'll go take care of the paperwork now. Remember, I'll accept nothing but a perfect report from the both of you. Do not disappoint me.\nBadd: Hold up, Von Karma.........! I still... haven't agreed to this!\nFranziska: Miles Edgeworth...!\nEdgeworth: It's been quite some time, Franziska.\nFranziska: This will be the perfect chance for us... ...to see which of us is truly worthy of the Von Karma name.\nEdgeworth: Would it kill you to at least say hello?\nFranziska: Unngh... Umm... Long time no see.\nEdgeworth: Very good.\nFranziska: Just because you became a prosecutor first doesn't mean you can act all proud!\nEdgeworth: (S-She hasn't changed a bit...)\nFranziska: Miles Edgeworth! As I was saying, we shall see which one of us is worthy of the Von Karma name...\nBadd: For cryin' out loud... I've been reduced to a babysitter...\nEdgeworth: (It looks like Mr. von Karma was successful in convincing the detective. That's just like him; he never fails.) Now, I'd appreciate it if you could quickly run me through the facts, Detective Badd.\nBadd: You're better off checking things out on your own.\nEdgeworth: ...Very well. (Seems like getting help from Detective Badd will be a most arduous task...)\nEdgeworth: (Nngh... Is the only real explanation that they killed each other simultaneously...?)\nFranziska: Miles Edgeworth! You should listen to someone until they are finished talking!\nEdgeworth: Umm... What are you talking about?\nFranziska: I'll only say it one more time... This is a competition to see who is truly worthy of the Von Karma name!\nEdgeworth: A competition...?\nFranziska: The person that figures out the truth first wins.\nEdgeworth: Hmph... So the person who doesn't discover the truth is a dishonor to the name?\nFranziska: Exactly! I don't care that you became a prosecutor before me... ...I simply refuse to hear any more foolish things come from your foolishly, foolish mouth.\nEdgeworth: Hmph... Fine, whatever makes you happy.\nFranziska: Can I take that as you accepting my challenge?\nEdgeworth: Once again... Whatever makes you happy.\nFranziska: Hah... Well then, let's begin the investigation, shall we? I'm going to find the perfect evidence and prettily present it like the professional I am.\nEdgeworth: (Competing to discover the truth behind a crime -- how delightfully... childish.)\nBadd: You kids, over there! Hold it!\nEdgeworth: \"Kid\"!?\nFranziska: Ha! Serves you right, Miles. He just called you a kid...!\nBadd: ...I said \"kids\", kid.\nFranziska: H-How dare you call me a kid as well!?\nBadd: I'll do what I please. And I won't allow you to cause a ruckus on my crime scene. Hey, big guy. You're... going to watch over these two.\nGumshoe: Yes, sir! Detective Badd, sir! Now, do what I say from now on kids, OK!?\nFranziska: You'd better not get in our way, Scruffy! You'll feel the bite of my whip if you do!\nGumshoe: E-Eeek! Th-Then you, p-prosecutor boy! Let's get your investigation started already, alright!?\nEdgeworth: (Great. Now, even THAT detective is treating me like a child...)\nGumshoe: Alright! It's time to get investigating! Get a move on, prosecutor boy!\nEdgeworth: ...My name is Miles Edgeworth. And if you were [sic] to call me \"prosecutor boy\" one more time... ...it will be my duty as a prosecutor to \"look into\" your monthly salary.\nGumshoe: Wh-What!? And what would you do with my salary after you saw how much it was!?\nEdgeworth: That's up to you now, isn't it?\nGumshoe: Really!? Sounds good, pal!\nEdgeworth: (He's so naïve...)\nEdgeworth: Detective Badd, may I have a word with you?\nBadd: ...What is it?\nEdgeworth: It appears that both a knife and a gun were used as murder weapons.\nBadd: ...Yeah, it does.\nEdgeworth: That leads us to our first question of the investigation. Where did the men acquire the weapons?\nBadd: ...The gun was inside of Faraday's bag. It was a piece of evidence that was presented in the trial earlier today. It was used... to kill the Cohdopian Embassy staff member. But... I never heard anything about the knife. Mr. Rell was being held by the police. There's no way he could have brought it in. Which means it's possible that Faraday had the knife on him from the start as well.\nEdgeworth: (Could it have been a piece of evidence that had yet to be presented...? But then, why doesn't Detective Badd know about it? Wait! What if...!?) It's possible that Mr. Faraday brought the knife in under the guise of prosecutorial evidence. He could have then brought it out and attacked Mr. Rell with it.\nBadd: Huh... Maybe you've got a brain in there after all, kid.\nEdgeworth: Nngh...! (Is he going to treat me like a child forever!?)\nBadd: ...It looks like Mr. Faraday attacked Mr. Rell first, who then counterattacked... That's the only logical conclusion you can draw from a scene like this.\nEdgeworth: (Hmm... Not yet. I feel that it's much too early to be drawing conclusions already. I must first find conclusive evidence, so as to protect (changed from [ensure] in the original release) the honor of the Von Karma name.)\nAfter examining gun, Byrne Faraday's left hand, and knife:\nEdgeworth: Mr. Rell's cause of death was from being shot, correct?\nGumshoe: That's what we think, but it's hard to tell with him lying face down.\nEdgeworth: Death is bad enough, but it's truly lamentable that someone would try to hide the truth.\nGumshoe: ...Um, are you sure they were trying to hide something?\nEdgeworth: (I can't confirm Mr. Rell's cause of death with his body positioned like that.) Detective Badd, I'd like to examine the bodies in further detail, if possible...\nFranziska: What's this? You're not able to form a theory with them the way they are?\nEdgeworth: I believe an examination of the bodies is vital to finding the perfect evidence, don't you?\nFranziska: Hmm... I suppose you do have a point. Well!? Hurry up and get on with it!\nBadd: ...Labbie.\nForensics: Yes, sir! We've taken enough photos of the scene, sir.\nBadd: ...And there you have it.\nEdgeworth: ..................\nBadd: ..................\nEdgeworth: D-Do you not approve?\nBadd: ...Of course not.\nEdgeworth: What!?\nBadd: Investigation of a crime scene is the work of a detective. So don't touch a thing. Hey, big fella, turn over the bodies for me, will you?\nGumshoe: O-OK......... Please forgive me, Mr. Faraday, sir...!\nBadd: Gumshoe... do not get emotionally involved. Remember, you're a detective!\nGumshoe: Yes, sir! Understood, sir!\nLeads to examination of bodies\nAfter connecting all possible Logic and examining both wounds, open window, and TV:\nGumshoe: I guess there's not much left to investigate, huh? They really did kill each other...\nEdgeworth: No... We can't conclude that quite yet. There's still something I find very peculiar here. The theory that they simply killed one another is too simplistic in this case. In fact, there is actually a contradiction that shows there is another possibility!\nGumshoe: No way, pal! Really!?\nEdgeworth: Hmph... I suppose I will just have to show you the contradiction (changed from [conflict] in the original release) in this crime scene.\nLeads to examination of bodies\nEdgeworth: Now we come face to face with the contradiction I spoke of, and it is... this! Mr. Faraday used his left hand to write with his fountain pen. Ergo, he is left-handed. And yet, the handgun is in his right hand! Don't you find it odd that the left-handed Mr. Faraday would hold the gun in his right hand? That. lady and gentlemen... is the great contradiction haunting this crime scene!\nGumshoe: Hey, you're right, pal! That does seem kinda strange! But... How could something like that happen?\nEdgeworth: The facts add up to one conclusion, and one alone. Someone else put the gun in Mr. Faraday's hand after he died.\nGumshoe: Someone else...!?\nEdgeworth: Plastic bags scattered on the floor, and a gun in the wrong hand... I sense the presence of a shadowy figure behind this case. A person of vile intent who is serious about keeping the truth from us!\nBadd: Here's the autopsy report.\nFranziska: \"It is probable for that Mr. Rell survived for a short time after he was shot. However, Mr. Faraday died instantaneously from his stabbing.\" Interesting...\nCrime Scene Notes updated in my Organizer.\nFranziska: It looks like we now know everything we need to know about this case.\nEdgeworth: Are you sure we know everything...?\nFranziska: Of course! The incident began with Mr. Faraday attempting to get his revenge. The prosecutor went into a rage from being accused, and tried to kill the defendant... But, the defendant fought back and they ended up killing each other. It's all very clear and simple. There is absolutely no margin for doubt.\nEdgeworth: Do you really believe that to be the truth?\nFranziska: Hah! Are you saying that just because I figured out the truth before you... ...that you don't want to believe it's true?\nEdgeworth: N-Nngh...\nFranziska: It's alright. If you disagree with my argument, then prove me wrong. Well, if there are any contradictions to be found, that is...\nEdgeworth: Don't worry, I will.\nFranziska: Mr. Faraday's death was instantaneous, while Mr. Rell survived for a short time. From this, it is obvious that Mr. Faraday died after he shot Mr. Rell. And Mr. Rell, while on the brink of death, stole Mr. Faraday's knife and stabbed him. Those are the facts of this case.\nEdgeworth: (Mr. Faraday's death was instantaneous, therefore, he must've attacked first... Proving that logic to be false is probably the fastest way to show her that she's wrong. In that case, I should first look for any holes in her theory!)\nFranziska: Mr. Faraday's death was instantaneous, while Mr. Rell survived for a short time.\nFranziska: From this, it is obvious that Mr. Faraday died after he shot Mr. Rell.\nFranziska: And Mr. Rell, while on the brink of death, stole Mr. Faraday's knife and stabbed him.\nFranziska: They struggled, and Mr. Rell used the last of his strength to counterattack Mr. Faraday.\nFranziska: Those are the facts of this case.\nEdgeworth: (There's something strange about Franziska's theory... I should compare her claim with the data I've gathered thus far. I just know there's a contradiction somewhere!)\nEdgeworth: If the two men were fighting, their struggle would've surely caused quite a bit of noise. However, Detective Gumshoe testified that he heard absolutely nothing!\nFranziska: Hah. You place too much faith in that detective's testimony, you know. But for the sake of argument, let's say there wasn't a fight. How, then, did Mr. Rell get his hands on the knife?\nEdgeworth: Mr. Faraday's bag was sitting right here in Lobby No. 2. It is not hard to imagine that perhaps Mr. Rell saw a chance and took it out at some point!\nFranziska: .................. So... What you're saying this: Mr. Rell took a chance when he saw the opportunity, and took the knife from the bag. And then Mr. Faraday shot Mr. Rell after being stabbed...?\nEdgeworth: Hmm......... (Isn't there something... strange in Franziska's statement just now?)\nEdgeworth: It's simply not possible for Mr. Faraday to have shot Mr. Rell after being stabbed!\nEdgeworth: According to the coroner's report, Mr. Faraday died instantaneously, meaning... ..that he died immediately upon being stabbed by the knife! Ergo, he could not possibly have fired the gun after that!\nFranziska: ...Ooh, you got me.\nEdgeworth: But of course.\nFranziska: Well then, if the report is correct, then there is only one correct explanation. If we suppose that Mr. Rell attacked first... ...then Mr. Faraday, who died instantaneously, would have been unable to kill Mr. Rell. Therefore, Mr. Rell must have stabbed Mr. Faraday after he was shot. Then they both died. That is the only explanation that makes logical sense!\nEdgeworth: Negating your opponent's ideas in order to prove your own theory... I see you've been studying, Franziska.\nFranziska: I just wanted to explain it to you as simply as possible. Before you foolishly propose a foolish theory that only a foolish fool like you could.\nEdgeworth: Hmph... How naïve of you to believe that only your opinions are valid... ...and still expect to discover the truth that the crime scene offers you... Franziska... You've still got a ways to go.\nFranziska: What are you talking about!? Are you saying there's a flaw in my logic!?\nEdgeworth: (Mr. Faraday died instantly... And the fact that he did is what gives rise to the contradiction in this scene!) The contradiction here in this crime scene is...!\nEdgeworth: Let me get this straight. What you are arguing is this: Mr. Faraday took the gun from his evidence bag and shot Mr. Rell. Then, the wounded Mr. Rell found an opportunity to take the knife and strike back. Upon being stabbed, Mr. Faraday died on the spot, and Mr. Rell died thereafter. If that's the case, then how do you explain this? Take a good look at the order in which their bodies are piled.\nFranziska: ............N-No...!\nEdgeworth: Mr. Faraday's body is lying on top of Mr. Rell's. Therefore... ...Mr. Rell must have died before Mr. Faraday!\nFranziska: I-Impossible!\nEdgeworth: (Yes, I agree that it seems strange no matter what angle you approach it from... ...which means that the real mystery behind this crime scene that we must solve is--!)\nFranziska:\nFranziska: No...! Not so fast, Miles Edgeworth!\nEdgeworth: What now...?\nFranziska: I simply think that you ought to think a bit more outside the box... And that it's even clearer now that the incident started with Mr. Faraday's murderous intent!\nEdgeworth: (She sure bounced back quickly. An explanation won't be enough this time. It's going to take some very decisive evidence to prove her wrong!)\nFranziska: It was just chance that Mr. Faraday's body fell on top of Mr. Rell's. The two bodies fell into a pile... ...which indicates that they attacked each other at the same time. It really doesn't matter in the slightest that they fell in the opposite order.\nEdgeworth: (I just know that Franziska's explanation isn't absolutely correct. All I have to do is find a hole in her logic! Once I do, I can then present her with the evidence that proves the contradiction!)\nFranziska: It was just chance that Mr. Faraday's body fell on top of Mr. Rell's.\nFranziska: The two bodies fell into a pile...\nFranziska: ...which indicates that they attacked each other at the same time.\nFranziska: That fact indicates that they attacked each other at the same time from close range.\nFranziska: It really doesn't matter in the slightest that they fell in the opposite order.\nEdgeworth: (The fact that the order that they attacked each other in... ...varies from the order they fell in doesn't cause a problem for me. However, there's definitely one certain aspect that I'm having trouble swallowing!)\nEdgeworth: So you believe they killed each other at close range...? Sorry, but that's impossible. Just as it is written in the crime scene notes... ...the firing of the handgun did not leave a gunpowder burn on Mr. Rell's clothes. Therefore... Mr. Rell and the gun... ...must have been separated by a distance of at least two or three yards!\nFranziska: Aaaaah!\nEdgeworth: (Yes... This is by far the biggest contradiction! The two bodies are piled up on each other, yet the gun was fired from a distance. And with there being no chance that Mr. Rell moved that far after being shot... ...that leaves only one possible explanation!)\nFranziska: Wh-What a completely foolish line of foolish thought from a thoroughly foolish fool! If I'm not right... ...then who was it that made the first move with the intent to kill, huh!? Who!?\nEdgeworth: The person that attacked first with murderous intent? That would be...\nEdgeworth: Here in this room... ...contradictions appear no matter which man we claim attacked first. Thus, there can be only one explanation. There was... a third person here!\nFranziska: ...!\nEdgeworth: It was that third person who killed both Mr. Faraday and Mr. Rell... ...and set their bodies up to make it look like a double murder... That third person is the real culprit!\nFranziska: ............ Miles Edgeworth... There's just one thing you're missing.\nEdgeworth: ...Evidence, correct?\nFranziska: Exactly. Everything you've said up until now is nothing but a story played out in your head. However, this is where the real test begins. Can you prove that there was a third person involved in this crime!?\nEdgeworth: ...Of course. (If a third person was [sic] truly here, that fact would resolve the glaring contradiction. The proof that this has all been a set-up, made to look like they killed each other... I'll present it, and lay bare the final piece of the puzzle that's not yet in place! What is the piece of evidence that proves there is a third person involved...?)\nEdgeworth: The gun in Mr. Faraday's hand and the plastic bag with his blood on it... These two items point to the presence of a third person.\nFranziska: How so...?\nEdgeworth: Recall Detective Gumshoe's testimony.\nGumshoe: I was in the hallway the whole time, but I didn't hear a single peep of a struggle.\nEdgeworth: If there wasn't a struggle in this room... ...then there shouldn't be any plastic bags on the ground. Meaning that someone else must've deliberately scattered them around!\nFranziska: ...!\nEdgeworth: Do you not see the possibility in this? Disregarding the gun for the moment... ...there's a high probability of blood splatter when a knife is used on a person. If the culprit held the knife with a plastic bag around it... ...they could use the bag to catch any blood splatter from when they withdrew the knife. Then, by spreading a few more plastic bags around, mixing the bloody one in with them... ...and arranging the room to make it look like there was a struggle between the two... ...they were able to conceal their presence!\nFranziska: Aaaaaaaaah!\nBadd: Looks like... we've still got a long way to go in this investigation...\nEdgeworth: Yes.\n???:\nGumshoe: Wh-What the heck's up with you, pal!?\nYew: Mr. Badd, I advise you to place Detective Gumshoe under arrest.\nGumshoe: Wh...WHAAAAAAAAAAAT!?\nBadd: ......What's the meaning of this?\nYew: Hah! Looks like you're not man enough to discipline your own subordinates.\nBadd: ...Don't you dare...!\nYew: That detective claims he was there, standing in front of the door the entire time... ...but I have it on good authority that it was all a giant lie!\nBadd: ......!\nEdgeworth: ...Ms. Yew! I ask that you please explain that last statement!\nYew: I'll let His Honor explain it himself.\nJudge: I-I saw it with my own eyes, I tell you! During the recess, there was a period of time when there was no one in the hallway!\nGumshoe: Whaaaaaaaaaaat!?\nYew: See, Mr. Badd? So I ask you, why would a detective who was supposedly doing his job the whole time... ...want to fabricate such a lie?\nBadd: ...Gumshoe. Did you... Did you kill Faraday...!?\nGumshoe: N-Noooooooooooooooooo! Of course not, sir!\nFranziska: It would appear that the one who set this whole crime scene up is that detective. ...Which basically renders his testimony a complete lie and wholly invalid. It looks like your \"perfect\" logic has just come tumbling down, Miles.\nEdgeworth: Nngh...\nGumshoe: I was in the hallway the whole time, but I didn't hear a single peep of a struggle.\nEdgeworth: (Was that statement really a lie...?)\nBadd: ...Detective Gumshoe. You're now a suspect in the murder of two men. Now, spit out the truth, or so help me...!\nGumshoe: I...I haven't lied to anyone, sir! Honest! I really was really there... I was in the hallway the whole time!\nEdgeworth:\nEdgeworth: Detective Badd, I ask that you please do not act without my permission. After all, I am the one that is heading up this investigation, am I not?\nBadd: .........Don't talk like you know what's going on, boy...\nEdgeworth: All I want is for this investigation to run perfectly.\nFranziska: Perfection is the only wish of a disciple of Von Karma, after all.\nEdgeworth: Therefore, before you take Detective Gumshoe into custody... ...I'd like to set the record straight on something.\nBadd: ...And what's that...?\nEdgeworth: (Hmm, what should I ask Detective Gumshoe about...?)\nEdgeworth: I suppose the one thing I'd like (changed from [liked] in the original release, correcting the typo) clarified... ...is Detective Gumshoe's motive for committing this crime.\nBadd: Hmph... Motive, huh. Gumshoe... You got a grudge against Faraday or anything...?\nGumshoe: N-No, sir! Not me! Not a single bad thing against Mr. Faraday, sir!\nBadd: ...Is that a fact...?\nYew:\nYew: ...You really have a problem with lying, don't you, Detective Gumshoe?\nGumshoe: I'm telling you... I AM NOT LYING!\nFranziska: The more unnatural you act, the more suspicious you become, you know.\nYew: If you want a motive, Edgeworth, I have one for you right here.\nEdgeworth: Could you please share it with us? However, be forewarned that I won't hesitate to object to flights of fancy... ...because all I'm interested in is the perfect explanation.\nYew: Phwwh! Ahahahahahaha! You're serious, aren't you? ...Fine. You amuse me, so I'll humor you with a little courtroom practice.\nYew: It was... about a week ago. I saw the detective get chewed out by a livid Faraday in front of the precinct. He stood there super pale, as Mr. Faraday yelled, \"That's a salary cut for you, you nitwit!\" A brand new detective suddenly getting his salary cut -- that's reason enough for a grudge. Well? How's that for the \"perfect explanation\"?\nGumshoe: Y-You totally misunderstand me, pal! No matter how mad I get, I could never hold a grudge!\nBadd: .........Quiet. We can't trust anything you say...!\nGumshoe: Sir...\nEdgeworth: (Hmm... There's nothing wrong with the motive she proposed, per se... ...but there are some gaps in her logic that need to be filled in. Ms. Yew's \"perfect explanation\"... ...may not be so \"perfect\" at all...!)\nYew: It was... about a week ago.\nYew: I saw the detective get chewed out by a livid Faraday in front of the precinct.\nYew: He stood there super pale, as Mr. Faraday yelled, \"That's a salary cut for you, you nitwit!\"\nYew: A brand new detective suddenly getting his salary cut -- that's reason enough for a grudge.\nYew: Well? How's that for the \"perfect explanation\"?\nEdgeworth: (Detective Gumshoe certainly had a motive to kill Mr. Faraday. However, there is just one thing I can't wrap my head around in this explanation. I'll just have to force Ms. Yew to explain herself fully!)\nEdgeworth: Alright, if you could clear this one thing up for me...!\nEdgeworth: I understand Detective Gumshoe's potential motive for killing Mr. Faraday... ...however, what about his motive for killing Mr. Rell?\nYew: His motive for killing Rell? Like I would know.\nEdgeworth: Hmph... If there was [sic] no clear motive for both of the murders... ...then I doubt this incident would've occurred. Wouldn't you agree?\nYew: ..................\nEdgeworth: Is there anyone else who might have had a grudge against either of the two men? Or should we look into that ourselves?\nYew: Oh... In that case... .........I have absolutely no idea.\nEdgeworth: .........! (What? But that's impossible! She must know SOMETHING!)\nYew: Phwwh... Wait... Ahahahahahahahahahahahahaha! Can you please not glare at me like that? ...It makes me laugh. Phwwwwwh!\nEdgeworth: (Grr...! I didn't even do anything, and you're already laughing away!)\nYew: Well, anyway... the way I see it, as long as he had a motive to kill one of the two... ...this crime would've played out the way it did anyway.\nEdgeworth: ...Oh? Would you care to explain your logic? And this time, please try to provide a truly perfect explanation.\nYew: Phwwwwh...! Perfect this, perfect that... Stop being so uptight, or is that a requisite trait for being a Von Karma? Ahahahaha!\nFranziska: Miles Edgeworth! I demand that you shut this rude woman up!\nEdgeworth: (...I wish you'd BOTH be quiet for just one second...)\nYew: Ahem... Oh well. I guess I'll just have to explain it to you kids.\nYew: There's no one out there with a motive to kill both Mr. Faraday and Mr. Rell. All you really have to establish is that someone had a grudge against one of the two men. Mr. Rell, who happened to be there, became a witness to Mr. Faraday's murder. Therefore, he was killed out of necessity, and set up to look like they had killed each other.\nEdgeworth: (I wonder if that's really true... Is there no one out there with a grudge against both men? I should take another hard look at the evidence for this morning's case. The second KG-8 Incident, as people are calling it, involving an Embassy staff member... ...and the two men who both wound up as suspects in the case... Is there someone else I'm overlooking who is somehow related to them?)\nYew: There's no one out there with a motive to kill both Mr. Faraday and Mr. Rell.\nYew: All you really have to establish is that someone had a grudge against one of the two men.\nYew: Mr. Rell, who happened to be there, became a witness to Mr. Faraday's murder.\nYew: Therefore, he was killed out of necessity, and set up to look like they had killed each other.\nEdgeworth: (I have to admit, her explanation makes sense. However, there is also something she overlooked in her testimony. I should present that piece of evidence, and see if I can't make her see the truth!)\nEdgeworth: Ms. Yew. I believe there is someone you overlooked in making your statement. Or rather... is it because you'd rather not bring this person up...?\nYew: .........What do you mean?\nEdgeworth: We are looking for someone with a reason to kill both Mr. Faraday and Mr. Rell... I can think of at least one person that fits the bill! He was the suspect in the original KG-8 Incident... ...and a member of the Cohdopian Embassy staff, Mr. Manny Coachen!\nYew: ...!\nEdgeworth: That's right. The very man who came to visit you earlier out in the hallway.\nYew: ..................\nEdgeworth: The man who killed a member of the Cohdopian Embassy staff, Mr. Rell... ...and the man who was the lead prosecutor of the KG-8 Incident, Mr. Faraday... Are you telling me that Mr. Coachen has no reason at all to kill both of these men?\nYew: Well......... I suppose he might have a reason or two...\nGumshoe: You! You covered for me, pal! ...Maybe you're not such a bad guy after all.\nEdgeworth: Don't get ahead of yourself. You're still a suspect, make no mistake about that! The perfect evidence, the perfect testimony... These are the only things I wish to hold.\nGumshoe: B-But I didn't do it...!\nEdgeworth: Hmph... You will stay under my authority, and go investigate Mr. Manny Coachen for me. And remember, I will not be very forgiving should any of this leak out--\n???:\nBadd: You want to investigate Coachen...? You'd just be wasting your time...\nEdgeworth: And why is that?\nBadd: ...Coachen was up in the viewing gallery, watching the trial... or so I was told. Every cop in this place has been keeping an eye on the guy since he arrived...\nFranziska: Then the only real suspect we have is still Detective Gumshoe.\nEdgeworth: ...I suppose so.\nGumshoe: No way... Come on, Detective Badd! You've gotta believe me, sir! I really was in that hallway the whole time, sir! I never took a single step into this room, sir!\nBadd: ...OK, then are you saying... there was someone else who passed through the hallway?\nGumshoe: I-I... No... There was no one else, sir.\nBadd: .........Then why should I believe you didn't do it...!?\nFranziska: That is one incredibly foolish detective. Standing right in front of a crime scene all by himself... It's as good as a confession of guilt.\nEdgeworth: (I have to admit it's a bit strange. Most criminals will fabricate some sort of lie to escape their crimes. And if that detective really wanted to prove that he is innocent... ...you'd think he would at the very least offer up \"I spaced out while on duty\" or the like.)\nBadd: ...Come on, Gumshoe. Time for your interrogation...\nGumshoe: .........Detective Badd...\nFranziska: Miles Edgeworth... I will go ahead and report this to Papa.\nJudge: And that, as they say is that! Right, everyone? Ho ho ho.\nYew: Well, I suppose we should both be getting back to our real jobs now, huh?\nEdgeworth: Before we do, Ms. Yew, there is something I'd like to speak with you about.\nYew: ...What is it?\nEdgeworth: Ms. Yew... I believe that I have proof of your connection to the KG-8 Incident.\nYew: That file is your proof? Very well, then... Why don't you tell me exactly how I'm related to the KG-8 Incident?\nEdgeworth: Your connection to the KG-8 Incident... ...is through the victim!\nYew: .........!\nEdgeworth: The victim's name is Cece Yew. You will note that she has the same last name as you. Can you really still tell me with a straight face that you are not related to this case?\nYew: .........Phwwwwh. Ahahahahahahahahahahahahaha! ...Sorry, but we're not related.\nEdgeworth: Wh--!?\nYew: .........Just kidding. You asked that question with such a serious look on your face... ...that I couldn't help but... Ahahahahahahahahahahahahaha!\nEdgeworth: Mmmrrrrgh...! Ms. Yew, I ask that you please tell me the truth.\nYew: ..................Ahem. Alright. I'll tell you everything I know.\nAfter clearing all Talk options with Calisto Yew:\nYew: Well, this is about all I know. Haha... Sorry. Guess I wasn't much help, huh?\nEdgeworth: That's not true. I'm sorry I made you recall such a painful time in your life.\nYew: Phwwh...... Ahahahahahahaha! Edgeworth, you really are too serious for your own good. You really need to learn to relax. We wouldn't want you to die of stress, would we?\nEdgeworth: ...Thank you for the advice, but there's no need to worry. I work in my own way, and I will catch this criminal in my own way as well. You'll see.\nYew: Ahahahahahahahahahahahahaha! Look at you with your game face on, ready to go!\nEdgeworth: I...! I'm making no such face!\nYew: Did you know? Laughter is the best medicine, Edgeworth. Don't you get tired of making such a serious face all the time?\nEdgeworth: I'm charged with making sure that all the criminals of this world are found guilty. I... have no need for laughter.\nYew: There you go, making that face again. Oh well. I've got to get going. I still have a few loose ends I need to tie up.\nEdgeworth: (.................. The KG-8 Incident and this murder investigation... It is my belief that these two cases are related to each other somehow. Plus, that detective... Detective Gumshoe...It's obvious he's lying, even though the lie is hurting his chances. ...Clearly, this case is far from over. But whether or not that detective is the murderer... ...can only be determined once I've completed my perfect investigation. Mr. von Karma... I swear to uphold your honorable name, or my name isn't Miles Edgeworth!)\nTo be continued\n\nEdgeworth: Sir... What is to become of the trial into the Cohdopian Embassy staff member's murder?\nManfred: Indeed. Since both the suspect and the prosecutor are now dead... ...the case will be dismissed. In other words, the trial ends here prematurely.\nFranziska: Hah... Looks like you'll have to wait just a bit longer for your big debut.\nEdgeworth: ...I suppose it can't be helped.\nManfred: The evidence for this trial will be transferred to you in a little while.\nEdgeworth: ......... Sir, what do you think about the murder of the Cohdopian Embassy staff member... ...and the murders of Mr. Faraday and Mr. Rell?\nManfred: ...What an outrageous circus it has all become. That Faraday brought it all upon himself with his naïveté.\nEdgeworth: An outrageous circus... Right, sir.\nManfred: I grow weary of this topic. Edgeworth, I will have you assigned to a different case.\nEdgeworth: .........\nFranziska: Papa! You'll come and watch my courtroom debut next, won't you?\nManfred: Hmm... I'll consider it.\nEdgeworth: ...Sir, if I may, please allow me to continue with my investigation.\nManfred: Whatever for?\nEdgeworth: I know that there is already a suspect in the murder of Mr. Faraday and Mr. Rell... ...however, there is not enough evidence to prove that it was he who committed the crime. I'd like to continue investigating in order to find the perfect proof of his guilt.\nManfred: The perfect proof? Don't make me laugh! A worthless person like you has no right to claim such a thing as perfection!\nEdgeworth: ..................\nFranziska: .........Umm, Papa? Who do you think is the real culprit behind these murders?\nManfred: ..................\nFranziska: Miles and I, we're competing to see who can find the real killer first. Plus, being able to investigate a real crime scene is a really rare opportunity. It would give us some real-life experience, wouldn't you agree?\nManfred: ...Hmph! If you want to investigate this case that much, then do as you wish.\nEdgeworth: Then, you're allowing us to continue...!?\nManfred: In court, your top priority is to win, and a solid investigation is one of the keys to winning. We have to make sure you become recognized as a first-rate prosecutor, don't we? .........It wouldn't be very interesting otherwise. I'm returning home now. Edgeworth, Franziska! See to it I'm not disturbed, save for the results of your competition.\nEdgeworth: ...Yes, sir!\nFranziska: Of course, Papa!\nEdgeworth: Franziska... Thank you.\nFranziska: What are you thanking me for? Your logic earlier was built on that scruffy detective's lie. That means that the competition is still on!\nEdgeworth: Yes, just as you wished.\nFranziska: Hmph... I couldn't let you get off so easily. Now then, let's see how well you fare on the investigation from here, Miles Edgeworth.\nEdgeworth: (I know I don't have enough information yet. So my first order of business will be to question anyone involved with this case...)\nAfter clearing all Talk options with Dick Gumshoe:\nOfficer: I'm sorry, but I need to take him for questioning now...\nEdgeworth: (I think I've asked him just about everything I needed to... No, wait... Since he became a suspect, there is one piece of evidence I should re-confirm.) Officer, I ask that you wait a second. I still have one thing I'd like to re-confirm with Detective Gumshoe.\nOfficer: Understood! But please make it brief, sir.\nEdgeworth: (I want to hear it from the horse's mouth... I must confirm whether or not his testimony about when the crime occurred is the truth.)\nEdgeworth: You told me earlier that you heard no sound, other than the gunshot, out in the hallway. Is that correct?\nGumshoe: No mistake about it, pal!\nEdgeworth: Hmm... then, you are also claiming that no one passed through the hallway either? Is that also correct?\nGumshoe: ......Yup! Not even a single ant passed through that hall while I was on duty!\nEdgeworth: Hmm... Hmmmmm... You do realize that the lie you're telling is only making life more difficult for yourself.\nGumshoe: Huh? ............Oh. B-But it's true! I didn't see anyone go through the hallway, and I didn't hear anything else, pal! I bet the killer found a way to kill the two guys that's beyond what I can even imagine!\nEdgeworth: ......... (So he intends to continue telling this ridiculous lie... But why would he do so, given the situation he's in? I believe a thorough investigation... ...of the hallway in front of the defendant lobbies is in order.)\nGumshoe: Ack! You...!\nEdgeworth: Nnnghoooooooh!!\n???: *rasp* Phwwwwwwtt!\nFranziska: ...How could you have not noticed that coming?\nEdgeworth: Nnn...nghhhh...! (Wasn't that... the child I changed money for earlier...?)\n???:: Thanks! That's exactly what I needed!\nEdgeworth: Kids... can sometimes be so cruel...\nFranziska: It looks like she dropped something.\nSwiss Roll data jotted down in my Organizer.\nFranziska: Maybe we should arrest the girl? She might turn out to be a valuable lead.\nEdgeworth: Mnrgh... I believe some sort of punishment may need to be dealt the next time we meet... I believe I've asked all that I need to of this man. Now, for Detective Badd and the Judge...\nFranziska: We have to confirm who is correct, the Judge or that scruff-face, right? I suppose we should inspect the hallway in front of Lobby No. 2 next, then.\nEdgeworth: Hmm... I suppose so. Shall we head on over, Franziska?\nCourtroom No. 3\nBadd: So... did you see anything else...?\nJudge: Hmm... No, I don't think so.\nBadd: I see... Well, thanks for your cooperation...\nJudge: Oh, it's nothing. Just doing my duty as a defender of the law.\nBadd: ...That'll be all for now. I'll ask again if I have any other questions.\nJudge: Anytime, Detective. Now, if you'll excuse me, I have a few loose ends I have to tie up... Oh! You're that new prosecutor Mr. von Karma recommended, right?\nEdgeworth: My name is Miles Edgeworth, Your Honor.\nFranziska: And I'm Manfred von Karma's daughter, Franziska von Karma. I'm set to become the successor to my genius father any day now, Your Honor!\nJudge: I see, Mr. New Prosecutor Recommended by Von Karma Miles Edgeworth, and Ms. Gen-- ...Ack...! ...I-I bhit mai tonnge.\nEdgeworth: ...Are you alright, Your Honor?\nFranziska: Please feel free to refer to me as just \"Ms. von Karma\", Your Honor. As for him... Just \"Edgeworth\" is fine.\nEdgeworth: (Apparently, SOMEBODY doesn't feel that I'm worthy of a proper title.)\nJudge: Oho! Very well, then. I shall call you Ms. von Karma and Mr. Prosecutor Edgeworth.\nEdgeworth: ...Your Honor, \"Mr. Edgeworth\" is fine, sir. Now, about your earlier testimony...\nJudge: Yes? What about it, Mr. Edgeworth?\nEdgeworth: I would like to ask you a few questions about what exactly you saw.\nJudge: Alright. After all, it's my duty to clarify my testimony as a defender of the law.\nEdgeworth: I greatly appreciate your cooperation, Your Honor. (Now, the first thing I will need to do is figure out that detective's exact movements.)\nAfter connecting \"Vending machine\" and \"Swiss roll crumbs\" Logic and examining handprint on sofa:\nEdgeworth: Hmm... I think I have a pretty clear picture of what happened here now.\nFranziska: Hmph. Naturally. After all, I'm here, aren't I?\nEdgeworth: Detective Gumshoe must have sat on this bench as he ate a Swiss Roll. And as he ate, he dropped it on the floor, and sullied the bench.\nDet. Gumshoe's Fingerprints data updated in my Organizer.\nFranziska: Ugh! How could he have not cleaned up after himself!? How utterly despicable!\nEdgeworth: Don't dare you whip me again! It wasn't I who made the mess in the first place! Anyway... If it was indeed Detective Gumshoe who bought the Swiss roll... ...that creates a rather interesting contradiction of facts.\nFranziska: A contradiction...? Where?\nEdgeworth: Hmph... I think another look at the special courthouse vending machine is in order.\nAfter connecting all possible Logic, clearing all Talk options with Tyrell Badd and The Judge, and correctly deducing Swiss rolls in vending machine:\nEdgeworth: Hmm... I believe I now have a very firm grasp on what happened here.\nFranziska: Arnngh! ...W-Well, I do, too!\nEdgeworth: Hmph... Alright, Franziska. Would you care to share what conclusions you've come to?\nFranziska: Wh-Why should I do that!? We're still in the middle of a competition, you know! We should be checking to see if your conclusions are wrong first, so you go ahead!\nEdgeworth: (It's almost cute that she's going this far to ensure that she wins... Almost.) Very well. But first, we need to pay His Honor a visit to correct his testimony.\nEdgeworth: Your Honor, if I may, I'd like to test your witness testimony to see how it stands up.\nJudge: D-Do you doubt me!? Am I your new suspect!?\nEdgeworth: ...In a sense, I suppose you could say that.\nFranziska: Even you, a judge... ...are (changed from [is] in the original release, correcting the typo) nothing but a common witness before a Von Karma!\nJudge: Silence in the courtroom! Silence, I say (changed from [said] in the original release)! Mr. New Prosecutor Recommended by Manfred von Karma Miles Edgeworth... ...and Ms. Genius Prosecutor Successor to Manfred von Karma Franzisk...ack...!\nFranziska: ...You bit your tongue again, didn't you?\nJudge: ...Ahem. As a defender of the law, I could never give false testimony! You can even place me under oath if you want!\nEdgeworth: Very well, then. Your testimony, if you please.\nJudge: Hmm...\nJudge: During the recess... I, um... I went to the restroom. There is a window on the hallway side. In other words, I could see into the hallway. As I entered, I saw that detective buying something from the vending machines. But when I was about to exit the restroom, he had completely disappeared! A detective that goes missing while on duty... That sounds mighty suspicious to meeeee!\nEdgeworth: Your Honor... Can you please try to remain calm?\nJudge: Oh! I'm so used to simply listening to testimonies that I got caught up in the excitement.\nEdgeworth: (I'm sorry, Your Honor, but I'm afraid I'm going to have to spoil your fun now.)\nJudge: During the recess... I, um... I went to the restroom.\nJudge: There is a window on the hallway side. In other words, I could see into the hallway.\nJudge: As I entered, I saw that detective buying something from the vending machines.\nJudge: But when I was about to exit the restroom, he had completely disappeared!\nJudge: A detective that goes missing while on duty... That sounds mighty suspicious to meeeee!\nFranziska: It appears that His Honor could not have been mistaken in what he saw.\nEdgeworth: Hmph, I suppose so, given his line of sight. However, Franziska, why do you suppose our lines of sight are so different?\nFranziska: ...If you're referring to my height...\nEdgeworth: C-Can't you hold that whip still for just a second!? Now, about His Honor's testimony... ...I believe his line of sight to be an important factor.\nFranziska: If it's that important, why don't you hurry up and tell him already?\nEdgeworth: (I will, but there is one more thing I need to do if I am to correct His Honor's testimony. I am going to need to retrace Detective Gumshoe's movements!)\nJudge: Wh-What was that finger wag for, Mr. Edgeworth!? And don't you know it's rude to shout \"Objection!\" while someone is giving testimony?\nEdgeworth: Hah. If you truly are a man of the law, then you must always be vigilant. For example, I (changed from [I, myself,] in the original release) never let an opportunity to shout \"Objection!\" pass me by!\nFranziska: Miles Edgeworth. It's one thing to be passionate about your job, but this is real life.\nEdgeworth: (This is what some people may say is the pot calling the kettle black...) Your Honor, I wonder if you might take a look at this for me?\nJudge: What is that filth!? How dare someone dirty the hallway bench like that!? Who is the culprit!? That party is hereby found GUILTY of uncleanliness!!!\nEdgeworth: If you must know, the uncouth bench sullier... ...has already been placed under arrest, thanks to your earlier testimony, Your Honor.\nJudge: Oh? ...Well that's good. But who was it?\nEdgeworth: We were able to discover something from the smudge on the bench. Namely, Detective Gumshoe's fingerprints.\nJudge: Not happy with committing just murder, he had to go and dirty the courthouse, too!? GUILTY!\nEdgeworth: Your Honor. Please calm down. While it's true that the detective is the one who made the mess on the bench... ...we have not yet established that this action is related to the double murder.\nJudge: What do you mean?\nEdgeworth: I believe that the Detective bought a pack of Swiss rolls from the vending machine... ...and then, promptly sat down on the bench to eat one. The cake crumbs and pieces of chocolate on the floor under the bench... ...and Detective Gumshoe's fingerprints prove my conclusions to be true.\nJudge: Oh... But I still don't understand. Is this whole thing related to how I couldn't see him as I was leaving the restroom?\nEdgeworth: Heh... It is indeed! The window in the hallway was built rather high up into the wall... ..at around a grown adult's chest height. As evidence, I submit that Franziska herself was unable to see out of that window.\nFranziska: .........\nEdgeworth: Nnghooooh! (I knew I shouldn't have used her height as evidence!) ...B-Basically, what this means is that the area directly under the hallway window... ...is a blind spot when the hallway is being viewed from the men's restroom!\nJudge: Th-Then!?\nEdgeworth: Hmph... It seems that you have made the connection. If someone were to sit on the bench under the window... Yes, even someone as large as Detective Gumshoe... ...would effectively disappear from sight!\nJudge: Wh-Whaaaaaaaaaaaat!?\nEdgeworth: Hmph. Do you finally see, Your Honor? Your testimony has just proven that Detective Gumshoe was in the hallway the entire time.\nJudge:\nJudge: ...Ah! Sorry! I didn't mean to say it with that much enthusiasm. All I wanted to do was try saying it once. Here, let me try that again... \"Hold it!\"\nEdgeworth: ...Is there something of value that you'd like to say?\nJudge: Yes, actually, there is! I remembered something else just now! Mr. Edgeworth! Please allow me to testify to the court one more time!\nFranziska: Even if we overruled him, he'd just keep on talking, wouldn't he?\nEdgeworth: That might not be a bad thing. The more info the better in a perfect investigation, right?\nJudge: I suppose it's possible you can't see a seated person from the restroom window. However, that doesn't mean that the Detective was sitting there when I looked! Anyway! I forgot to testify earlier about probably the most important detail... As I was leaving the restroom, I heard the loud \"BANG!\" of a gunshot!\nEdgeworth: Gnnnnrrrrrk...\nJudge: How was that!? That is the testimony of one who judges the crimes of others!\nEdgeworth: Your Honor... Could you try to state the important facts first next time!?\nFranziska: I agree! Before you go around judging others, you should learn to judge your own words!\nJudge: Eeeek! ...I-I'm sorry! But honestly, I thought that sound was just a noise popper until just now!\nEdgeworth: (Now that he mentions it, right before we re-started the trial, he did talk about that...)\nJudge: Oh, by the way, was there someone celebrating a birthday during the recess? I could have sworn that I heard a popper going off... Come to think of it... The other day with my grandson...\nEdgeworth: (The most critical point in this argument is when did the Judge look into the hallway? And whether that lines up with when the gun was actually fired.) Your Honor, if I may... I'd like to clarify a few details in your testimony!\nJudge: I suppose it's possible you can't see a seated person from the restroom window.\nJudge: However, that doesn't mean that the Detective was sitting there when I looked!\nJudge: Let's see... I looked into that hallway about 20 minutes before we were to reconvene.\nJudge: Anyway! I forgot to testify earlier about probably the most important detail...\nJudge: As I was leaving the restroom, I heard the loud \"BANG!\" of a gunshot!\nEdgeworth: Your Hon--\nJudge: I cannot allow you to make an objection.\nEdgeworth: What!? Your Honor... I'm really sorry, but... ...I cannot allow you to not allow me to make an objection!\nJudge: Egads! I've been overruled!?\nEdgeworth: Your Honor, there are simply too many holes in your testimony for my taste.\nJudge: Wh-Wh-Wh-What do you mean by that!?\nEdgeworth: You claim that you heard the gunshot during the recess, but that is simply not possible!\nJudge: ! Mr. New Prosecutor Recommended by Manfred von...ack...!\nFranziska: Instead of biting your tongue, why don't you bite your tongue on those preposterous names!?\nJudge: Eek!\nEdgeworth: I see you have no mercy for the elderly either, Franziska.\nFranziska: Hmph. Don't talk back to me, unless you want to be whipped in the back.\nEdgeworth: (With your height, you'd need a step-ladder or four to accomplish that.)\nJudge: Ahem! Mr. Edgeworth. My ears are not that far gone yet, I'll have you know! I can still hear just fine! And I heard the sound of a gunshot loud and clear with my own two ears!\nEdgeworth: Hah... Your Honor, I have here an interesting bit of testimony. It's from Detective Badd. And according to him, he heard the gunshot \"right before the trial was about to start again\".\nJudge: Wh-What did you just say!?\nEdgeworth: Your Honor, you just said... ...that you heard the gunshot \"about 20 minutes before we were to reconvene\". How do you explain this glaring contradiction!?\nJudge: Th-That can't beeeeeee!\nEdgeworth: Unfortunately... that is the truth.\nJudge: B-But! I heard it clear as day! \"BANG!\" The loud sound of a gunshot!\nEdgeworth: (The sound of the gunshot... We keep returning to this point of contention. And that piece of evidence... I always did wonder why I found it where I did. However, now I understand what that gunshot the Judge heard really was!) Unfortunately, Your Honor, this is what really produced the gunshot you heard!\nEdgeworth: I found this object in the hallway earlier.\nJudge: Wh-What is that pink substance?\nEdgeworth: It may not look it, but this is actually a piece of a balloon.\nJudge: I see. And I suppose you would like me to accept that pink balloon into the court record?\nEdgeworth: Your Honor... I present this piece of evidence in order to overrule your testimony!\nJudge: Wh-What!?\nEdgeworth: Your Honor, your argument goes as follows: You saw no one in the hallway when you heard the gunshot. Now, there is no guarantee that the detective was sitting on the bench at that time... ...therefore, you believe he must have been at the crime scene, Defendant Lobby No. 2. ...Am I correct?\nJudge: Yes, that's exactly right.\nEdgeworth: Hmph... Let me ask you something. Do you think that the gunshot you heard was produced by a real gun?\nJudge: !\nEdgeworth: I think I've said enough that even you can figure the rest out on your own. Your Honor. You were fooled by the popping of this balloon into thinking it was a gunshot!\nJudge: Wh-What manner of trickery is thiiiiiiiiiiiiis!?\nFranziska: That was a good effort you put forth, Miles Edgeworth. But if it was [sic] me, I'd have wrapped this thing up before the Judge even testified.\nEdgeworth: (Care to elaborate on how one ends something before it even begins...?)\nJudge: Hmm... Well, to be honest... I did think that the sound was a bit off from a real gunshot sound... But who could've guessed... that someone would pop a balloon in a place like this?\nEdgeworth: (That's true... One doesn't usually think \"balloons\" in conjunction with \"courthouse\".)\n???: Umm... I want to trade these coins with you!\nEdgeworth: (That's it...! That balloon that girl was holding... it explains everything.) Your Honor, if it makes you feel any better, you didn't lie once in your testimony. However, I can't really vouch for its accuracy...\nJudge: Mmnngh... Who knew... that giving testimony could be such a difficult thing to do...? What have I done? I owe Detective Gumshoe a very, very big apology... I will see to it myself that he is released...!\nEdgeworth: Wait... There are still a few things I have yet to resolve about what happened in the hallway. Your Honor, I request your permission to further question Detective Gumshoe.\nJudge: B-But why!? I thought we just cleared his name!?\nEdgeworth: Whether we did just now or not... I still cannot say. The only thing I can do for now is to continue in my quest for the perfect explanation. And to that end... ...I must resolve the remaining issues pertaining to the events that occurred in the hallway!\nJudge: Very well. Bailiff! Please bring Detective Gumshoe into the courtroom!\nEdgeworth: (I must fulfill my mission, and find the perfect explanation to this case!)\nGumshoe: Wh-What is it now!? Is it time for my trial already!? I've already told you a gazillion times, pal! I didn't do it!\nEdgeworth: I'll be the judge of that, Detective Gumshoe.\nFranziska: No, you won't! I'll be the judge of that!\nJudge: No, no, no, no, no! I'M the judge around here! And I'LL be the judge of that!\nGumshoe: Why can't you guys be a little less judgmental...?\nJudge: Yes, well, speaking of hasty judgments, Detective Gumshoe... I'm afraid I must apologize for an error in judgment on my part.\nEdgeworth: Your Honor. I don't believe you should apologize just yet. We have yet to prove he is completely innocent of this crime.\nJudge: I-I guess so...\nGumshoe: ? Um, what are you guys talking about?\nEdgeworth: ...In any case. I would like you to testify as to your actions while you were on guard duty. And please remember, you are not on trial. This is all just a part of the investigation. As such, you may still be found to be innocent... ...however, if you should give false testimony...\nGumshoe: Yeeeeoooow!\nFranziska: My whip will object, loud and clear!\nEdgeworth: If you are found to be lying, you will be held indefinitely. Understood?\nGumshoe: .........I gotcha, pal.\nEdgeworth: (Thinking back on the state of the crime scene and the Judge's testimony... ...it's obvious that Detective Gumshoe is lying. And if I can't break his lie, then we may never get a break in this case!)\nGumshoe: I came down here to this courthouse on Detective Badd's orders. As soon as I got here, he ordered me to stand guard in front of Lobby No. 2. From that time on, until I heard the gunshot, I was in that hallway the whole time! On my honor as a detective, I swear it wasn't me, pal!\nFranziska: He's still singing the same tired tune.\nEdgeworth: Hmph. In that case, I'll just have to change the melody. (I know he's lying, and it's time I pulled the information I need out of him!)\nGumshoe: I came down here to this courthouse on Detective Badd's orders.\nGumshoe: As soon as I got here, he ordered me to stand guard in front of Lobby No. 2.\nGumshoe: From that time on, until I heard the gunshot, I was in that hallway the whole time!\nGumshoe: And until I heard the gunshot, I didn't take a single step away from the Lobby No. 2 door.\nGumshoe: On my honor as a detective, I swear it wasn't me, pal!\nEdgeworth: I have... an objection.\nGumshoe: Wh--!? Wh-Wh-Wh-What is it, pal!?\nEdgeworth: Detective Gumshoe... I wonder if you might recognize this from somewhere?\nGumshoe: Hey! It's one of those things! The Courthouse Special Swiss Rolls, right pal!?\nEdgeworth: Hmph... Precisely. In that case, I suppose... ...that you also recall the sullied hallway bench?\nGumshoe: Hey! You know what!? I think it was probably me that did that!\nJudge: Detective Gumshoe! You know you can't go around dirtying up the courthouse like this!\nFranziska: You inconsiderate, slovenly pig!\nGumshoe: Eeeek! I promise to clean it up later! I swear!\nEdgeworth: Now then, shall we get down to business? About the fact that you didn't move even a single step from in front of that door... If that really were the case, then how were you able to buy a pack of Swiss rolls!?\nGumshoe: Aaaaaack!\nFranziska: Furthermore, if you didn't move a single step from in front of that door... ...how did you manage to get the bench dirty with your grubby hands!?\nGumshoe: Yeeeeeeeeeeeowwwwwwwwch!\nEdgeworth: (It appears that Franziska's whip can do more damage than my words alone can...)\nGumshoe: A-Alright... I confess, pal. I was hungry, so I bought a pack for myself, OK!? I thought I'd get chewed out again if anyone found out about me eating on the job... ...so I didn't want to say anything!\nJudge: Well, unfortunately for you, I saw you do the whole dastardly deed! I clearly saw you buying a pack of Swiss rolls from the vending machine!\nGumshoe: *sigh* OK, OK, I'm sorry for lying! But that's all I'm sorry for, you got that! Because I'm not holding anything else back!\nEdgeworth: (That last statement... It may sound like it makes sense... ...however, there is something I don't quite believe about it!) ...Are you sure you're not withholding further information from us?\nGumshoe: Huh? O-O-O-O-Of course not! I've got nothing else to hide, pal!\nEdgeworth:\nEdgeworth: Hmph. Oh, if only that were true, Detective Gumshoe.\nGumshoe: B-B-B-B-B-But it IS true, pal! I swear there's nothing else!\nEdgeworth: Detective Gumshoe, I'm sure you are aware of the price of a pack of Swiss rolls, correct?\nGumshoe: Huh!? Umm... Remind me again, pal!?\nFranziska: That vending machine out in the hallway... ...is selling packs of two Swiss rolls for $6 a pack.\nGumshoe: Mmmmnnnnrrrrgh...\nEdgeworth: And yet, according to you... ...you didn't have any cash on you until you cashed your $5 annual bonus check. Isn't that right?\nGumshoe: Oooooooooonnngh...\nEdgeworth: Let me ask then, how did you manage (changed from [managed] in the original release, correcting the typo) to purchase a pack all by yourself? Can you provide me with a proper explanation to that?\nGumshoe: Aaaaaaaargh! I told you, I bought it by myself, pal! There wasn't anyone else in that hallway with me... ...so there's no one who could've helped me buy it!\nEdgeworth: .........\nGumshoe: Wait, don't tell me... You've got some kind of proof that there was someone else in the hallway, don't you!?\nEdgeworth: Correct.\nGumshoe: As if you could! I mean, what are the chances of that... Wait, you do...?\nEdgeworth: Of course I do.\nGumshoe: Whaaaaaaaaaaaat!? Hooooooooooow!?\nEdgeworth: (What proof do I have that there must have been someone else there in the hallway...?)\nGumshoe: Hey! You showed that to me not two seconds ago, pal!\nEdgeworth: Ah... I think you're under the mistaken impression that I bought this pack of rolls.\nGumshoe: Wait, if you didn't buy it... then that means you must've stolen it! You thief!\nEdgeworth: Wh--!? I would never do such a thing!\nGumshoe: All you liars are the same; you start out as thieves! You're under arrest, pal!!\nEdgeworth: I believe you meant to assert that all thieves start out as liars. And in that case, what does that say about you, Detective?\nGumshoe: Gnnrk!\nEdgeworth: This particular Swiss roll was dropped by a certain someone.\nGumshoe: .........Oh!\nEdgeworth: There were two rolls in this package. You ate one of them... ...but you then gave the other one to a certain other person, didn't you?\nGumshoe: N-N-N-N-N-N-N-N-No way, pal! You've got it all wrong! I ate both of them...\nEdgeworth: It would appear that we've caught you at last.\nGumshoe: Hey! Don't you dare do anything bad to that girl!\nEdgeworth: (It would appear that they DO know each other after all...) So, why do you continue to come up to me and kick me? Have I wronged you somehow?\n???: I have a name, and it's Kay!\nEdgeworth: Kay what...?\nKay: Kay Faraday!\nEdgeworth: Faraday... Are you perhaps, Mr. Faraday's daughter?\nKay: I'm not a \"you\"! I'm \"Kay\"!\nEdgeworth: Mnnrgh... Kay. You know... good little girls don't kick other people. Especially not hard enough to leave big, nasty bruises like the way you do...\nKay: Well, then you shouldn't have put Gummy under arrest, mister!\nEdgeworth: G-Gummy...?\nJudge: My guess is that she's talking about Detective Gumshoe.\nFranziska: ...What a cute nickname you've given him.\nKay: Gummy didn't do anything wrong!\nGumshoe: Kay...\nEdgeworth: It appears that I will need to speak with her in a bit more detail...\nKay: Rwaaaar!\nEdgeworth: Now then, Kay...\nKay: *hiss!*\nFranziska: ...She's like a stray cat.\nEdgeworth: (I wonder if I should feed her something...?)\nEdgeworth: Kay, I promise to give this to you if you calm down.\nKay: Oh! A Swiss roll!\nEdgeworth: It really belongs to you, though, doesn't it?\nKay: ...Yeah. I was saving it for Daddy.\nEdgeworth: !\nFranziska: !\nJudge: Oh, my...\nEdgeworth: .........Your father... He's...\nGumshoe: Ah! Don't you say another word, pal! She doesn't know yet!\nKay: Thanks for watching out for me, Gummy... But... I... I already know about Daddy. I overheard the guards talking... ...about how Daddy's... he's... not here anymore...\nGumshoe: I'm sorry... I'm sorry I couldn't protect him...\nEdgeworth: Kay...\nKay: I-I'm not gonna cry! I'm not... gonna... ...cryyyyyyyyyyyyyyyyyyyyyy!\nEdgeworth: It's alright... Let it all out... Your father just passed away, after all...\nEdgeworth: I, myself, was also involved in a case at this courthouse when I was a young child... A case in which my father, who was a defense attorney, passed away. All of my dreams of becoming a lawyer were crushed into fine ash on that nightmarish day. Even now, the wound festers deep in the depths of my soul. Ever since that incident... I've dedicated myself to locking away every criminal I can. And now, to have this happen right in front of me...\nEdgeworth: (This child... I feel a certain shared fate, a common bond between us.)\nFranziska: ...Miles Edgeworth! What sort of gentleman are you!? Are you going to just stand there and watch a lady cry?\nEdgeworth: Ah, you're right. Sorry about that. Kay... Here, How about we use this handkerchief here and dry your little eyes?\nKay: *quiver*... ...Uuuugggh... *Hooooonk!*\nEdgeworth: Nnnnghooooooh! My cravat! Don't blow your nose on that!\nKay: ...I feel better now. Thanks.\nAfter clearing all Talk options with Kay Faraday:\nKay: Umm... Sorry... about your ruffly thing.\nEdgeworth: ...*sigh* (Yes, well, now that it's positively drenched in your nasal mucus...) Don't worry, Kay. I have a spare. So here, you can have this one.\nKay: ...Ummmmm... But Daddy said... \"Never take things from a stranger.\"\nEdgeworth: Ah, it's one of the promises you made in your Promise Notebook, correct?\nKay: Yeah! Look, see! It's right here on this page!\nEdgeworth: Hmm... Alright then, I'm not giving this to you. I'm merely allowing you to borrow it. You can take it home, wash it nice and clean, and then give it back to me next time we meet.\nKay: ...OK! Daddy never said I couldn't borrow things from strangers!\nEdgeworth: Now then, Detective Gumshoe...\nGumshoe: Uh oh...\nEdgeworth: I believe it is now crystal clear... ...that you were with little Kay in that hallway!\nGumshoe: Ooooonnngh...\nKay: Grr! I told you to stop being mean to Gummy!!!\nFranziska:\nFranziska: Miles Edgeworth! There is still something you have yet to resolve.\nEdgeworth: I beg your pardon?\nFranziska: You still haven't offered an explanation for why that man would lie to us.\nEdgeworth: Th-That's...! Well...\nKay: ! Gummy... Don't tell me you lied for my sake...?\nGumshoe: Hey, don't worry about it, Kay! Everything's gonna be OK!\nEdgeworth: (Ah, so that's why...)\nFranziska: So, what was Detective Gumshoe's motive for lying? If you can't explain that, then you can't call this a perfect investigation!\nEdgeworth: Hmph. His reason for lying is very simple.\nFranziska: Wh-What!?\nEdgeworth: Here is what I believe to be his reason: From simple observation of the Detective's actions and his interactions with Kay... ...it's obvious the Detective was lying for the young girl's sake. And this piece of evidence will show you exactly why. (Which piece of evidence proves that Detective Gumshoe was lying on account of Kay?)\nFranziska: Mr. Faraday and Kay's Promise Notebook? How does this explain anything?\nEdgeworth: If you could take a look at this page, it's clearly written that Kay should... \"Never take things from a stranger.\" When Detective Gumshoe heard about that promise, he tried to cover for Kay.\nFranziska: ......... What a foolishly foolish fool's fool of a foolish reason for a fool!\nGumshoe: Eeeowwwwww!\nKay: Gummy... You lied because of me, didn't you?\nGumshoe: Because I'm your friend, Kay! That's why!\nKay: Gummy...!\nEdgeworth: ...At long last. Detective Gumshoe, can you please tell me the whole truth now?\nGumshoe: Guess there's no beating you, huh, pal? OK, OK, I'll spill the goods! I'd been standing guard for a while... I was getting really hungry, and that snack vending machine was taunting me.\nFranziska: But all the cash you had on you was $5, and that wasn't enough to buy anything, right? After all, the cheapest item in that machine is a $6 pack of Swiss rolls.\nGumshoe: Yeah... But then, like an angel from heaven, Kay showed up...\nKay: I was thinking about sharing a snack with Daddy... ...so I wanted to buy a Swiss roll. But I only had about a dollar in coins.\nGumshoe: So we pooled my $5 and her $1 together... ...and bought a pack of Swiss rolls together.\nKay: But I was worried... ...about breaking one of my promises. So then Gummy said...\nGumshoe: Mr. Faraday's one scary guy when he gets mad! But, don't worry. You won't get in trouble if I don't tell, right!? Besides, you bought it with me! So you didn't really get it from me, you know?\nKay: ...He told me it'd be OK... And he gave me a whole roll to save and give to Daddy.\nFranziska: ...Who knew that Scruffy could be so considerate...?\nEdgeworth: Indeed... Detective, I take it that you then sat down on the bench and ate the rolls together?\nGumshoe: Yeah, we split the other roll and ate it right then! The sweet taste of that cake's chocolate... I'll never forget it as long as I live, pal!\nEdgeworth: Anyway... Kay, I believe this also belongs to you.\nKay: Oh! That's from the balloon I popped...\nFranziska: It's bad manners to leave garbage lying around, Kay.\nKay: I'm sorry...\nFranziska: Well, I guess I can't blame you for not throwing this one piece away. It was sitting high up on a windowsill where you couldn't see it. So just this once, I forgive you.\nKay: But that balloon... I wanted to surprise Gummy a little, so I popped it on purpose... ...and because of me, Gummy dropped his half of the Swiss roll.\nGumshoe: Aha ha ha! Wow, you really got me there, pal!\nKay: So I thought maybe I should give Gummy this other roll. And then, I saw you picking on Gummy, mister...\nEdgeworth: So you kicked me, is that it?\nFranziska: You sure are a feisty one.\nKay: I'm really sorry, mister...\nEdgeworth: It's alright. I'm perfectly unharmed. But about this Swiss roll... Would it be alright with you... ...if I held onto it until Detective Gumshoe is cleared of all charges and free to go?\nKay: Yeah! Sure! Just make sure you give it to Gummy afterwards, OK!?\nEdgeworth: Of course. I promise.\nEdgeworth: Now then, I believe we have proven beyond the shadow of a doubt... ...that Detective Gumshoe was in the hallway for the entire duration of his duty. Which undeniably proves... ...that Detective Gumshoe could not have committed the double murders.\nYew:\nYew: Actually, it proves just the opposite, Edgeworth. You've just shown... ...that Detective Gumshoe is the only one who could have committed the crime.\nEdgeworth: Wh-What do you mean!?\nFranziska: It's quite rude to eavesdrop, Ms. Yew.\nYew: Phwwh... Ahah... Ahahahahaha! Mnnphwwwwh... I'm getting lectured on manners... ...by a girl with a penchant for whipping people! Phwwwwkkkgh!\nFranziska: Wh-What!? How dare you talk back with such insolence!?\nKay: You're wrong, lady! Gummy's not the bad guy!\nYew: Oh, and what have we here? What is a child doing here in a courthouse? Bailiff! Please take this child away (changed from [in] in the original release)!\nKay: !\nEdgeworth: Wh--!? Ms. Calisto Yew! That girl is Mr. Faraday's...!\nYew: I know. So what? You think that just because she's the victim's daughter... ...she gets to just run wild all around the crime scene? I think it's actually quite dangerous for her, to speak nothing of getting underfoot.\nEdgeworth: I suppose you're right, however...\nYew: As long as we're in agreement on that point, let's get back to the real issue at hand. Now then, Detective, you were in front of the door to Lobby No. 2 the entire time, correct?\nGumshoe: Y-Yeah, but...\nYew: You see! Isn't it obvious that it could only be the detective? He is the only person who could've gone into Lobby No. 2 at the time of the murders!\nEdgeworth: Arngh! (I... have no counterargument to that...!)\nYew: Don't worry, I've already put in the necessary paperwork for his formal arrest.\nEdgeworth: Nnrgh! But the investigation is far from over!\nYew: Oh, that's right. I was going to speak with you about that. Don't you think it's reckless to talk to the suspect out in the open without a guard?\nEdgeworth: Nngh... I suppose it is...\nYew: Well, as someone with more experience in law than you, allow me to share something: Always keep a good eye on a criminal, or you may regret what comes of your negligence.\nFranziska: Oooooh...! Miles, I can't believe you're letting this woman lecture you like this! This is unforgivable as a disciple of Von Karma!\nYew: Ha ha ha. Down, tigress. Now then, I'll be looking forward to the results of your investigation.\nFranziska: So. We're back to square one.\nEdgeworth: Actually, this is our last chance. I can tell that if we fail to solve this case... ...Detective Gumshoe will be formally charged under all of the circumstantial evidence. (This investigation is not over yet. There's still one location we have yet to inspect. It's where Detective Badd and Ms. Yew were at the time of the crime -- Lobby No. 1!)\nTo be continued\n\n",
  "characters": [
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Manfred von Karma",
      "age": "60",
      "gender": "Male",
      "description1": "My mentor who has never known defeat in 35 years. A legendary prosecutor."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Byrne Faraday",
      "age": "40",
      "gender": "Male",
      "description1": "Prosecutor in Embassy staff killing case. Accused by Rell of being the Yatagarasu.",
      "description2": "Prosecutor of the KG-8 Incident. Stabbed to death with knife in Lobby No. 2."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Deid Mann",
      "age": "53",
      "gender": "Male",
      "description1": "Cohdopian Embassy staff member. Was gunned down in front of Embassy by Rell."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Mack Rell",
      "age": "32",
      "gender": "Male",
      "description1": "Embassy staff killing suspect. Arrested on suspicion for the handgun he was carrying.",
      "description2": "Embassy staff killing suspect. He was killed in Lobby No. 2 with the handgun."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Yatagarasu",
      "age": "??",
      "gender": "??",
      "description1": "Real identity is unknown, but claims to be a noble thief. Infiltrated the Embassy."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "??? → Kay Faraday",
      "age": "?? → 10",
      "gender": "??  → Female",
      "description1": "A girl with a balloon. During the recess, she asked me to change some coins for her.",
      "description2": "Mr. Faraday's daughter. It seems she talked with Det. Gumshoe during the recess."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "The Judge",
      "age": "??",
      "gender": "Male",
      "description1": "Judge in Embassy staff killing case.",
      "description2": "Judge in Embassy staff killing case. Testifies no one was in the hallway for a short time."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Dick Gumshoe",
      "age": "26",
      "gender": "Male",
      "description1": "New rookie detective at the precinct. First crime scene. Seems very enthusiastic.",
      "description2": "New rookie det. at precinct. Being held on suspicion of Faraday's and Rell's murder."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Calisto Yew",
      "age": "22",
      "gender": "Female",
      "description1": "Lawyer of embassy staff killing defendant, Rell. I was to battle her in court."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Tyrell Badd",
      "age": "53",
      "gender": "Male",
      "description1": "Eagle-eyed homicide det. Was called in to be expert witness on the Yatagarasu case."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Manny Coachen",
      "age": "24",
      "gender": "Male",
      "description1": "Cohdopian Embassy staff member. He was the suspect in the KG-8 Incident."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Franziska von Karma",
      "age": "13",
      "gender": "Female",
      "description1": "My mentor's daughter. Studying to be a prosecutor in Germany, back on break."
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Prosecutor's Badge",
      "description1": "Proof of my profession. My mentor said it was more chic to keep it in my pocket."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "KG-8 Incident Overview",
      "description1": "Received from my mentor as reference about KG-8."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Det. Gumshoe's Testimony",
      "description1": "Was in hall on guard duty. Other than gunshot, didn't hear a sign of a struggle."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Handgun",
      "description1": "Was Faraday's evidence from Embassy staff killing case. It was found in his hand.",
      "description2": "Found in Faraday's hand. Bullet that killed Rell was fired from a few yards away."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Knife",
      "description1": "I believe Faraday brought this as evidence. It was found in Rell's hand.",
      "description2": "Weapon used to kill Faraday. Has the secret ability to change into key the Yatagarasu sent."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Crime Scene Notes",
      "description1": "Notes pertaining to Byrne Faraday and Mack Rell."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Plastic Bag",
      "description1": "One of the bags strewn on floor of Lobby No. 2. Has Faraday's blood on it."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Mr. Faraday's Fountain Pen",
      "description1": "Fountain pen used by the left-handed Faraday. Looks like it has a quality nib."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Annual Bonus Envelope",
      "description1": "Det. Gumshoe's annual bonus of $5. Literally had no money on him until he cashed this."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Swiss Roll",
      "description1": "Swiss roll dropped by the mysterious young girl. Says \"Courthouse Special\" on it.",
      "description2": "Swiss roll dropped by the mysterious young girl. It's priced at 2 for $6.",
      "description3": "Detective Gumshoe and Kay bought this Swiss roll together."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Det. Badd's Testimony",
      "description1": "He heard the gunshot right before the trial was about to start again."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Det. Gumshoe's Fingerprints",
      "description1": "Left on the hallway bench. Black smudge emits the scent of sweet sugar.",
      "description2": "Left on the hallway bench. Det. Gumshoe apparently sat here as he ate a Swiss roll."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Balloon Piece",
      "description1": "I just know I've seen a pink balloon around... Found on windowsill of the hallway window.",
      "description2": "Balloon popped by Kay. The Judge misheard its popping for a gunshot."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Promise Notebook",
      "description1": "Exchange diary between Mr. Faraday and Kay."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Ms. Yew's Perfume",
      "description1": "Perfume given to Badd by Yew. Same perfume as the one spilled in Lobby No. 1."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Mr. Faraday's Organizer",
      "description1": "Faraday wrote his strategy for winning in here."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Yatagarasu's Key",
      "description1": "Photo of key the Yatagarasu sent. Unusual shape.",
      "description2": "Photo of the key the Yatagarasu sent. Turns into knife."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Surveillance Video",
      "description1": "Video of the Embassy staff member's murder. Gunshot is especially impactful."
    }
  ],
  "turns": [
    {
      "category": "rebuttal",
      "newContext": "Turnabout Reminiscence\n\n\n\n\n\n\n\n\n\nImage Gallery\n\nTranscript\nPart 1\n\nPart 2\n\nPart 3\nSeptember 10, 5:45 PM\nDistrict Court - Defendant Lobby No. 1\nEdgeworth:\nWh-What is this incredibly overpowering sweet scent...!?\nFranziska:\nIt smells like flowers.\nKay:\nUncle Badd! Is this it?\nEdgeworth:\nHm? Isn't that Detective Badd and Kay over there?\nFranziska:\nIt looks like she managed to escape the bailiff.\nBadd:\nNo... That's not quite it...\nKay:\nAww, too bad. But it's so pretty!\nBadd:\nI think... you're still a bit too young to be wearing that. But since you found it... I guess I can let you keep it.\nKay:\nThanks! I'll treasure it, always!\nEdgeworth:\n(Those two seem to get along rather well...)\nBadd:\nOh, here... I've got something else for you...\nKay:\nYay! Thank you, Uncle Badd! ...Earlier, I ate one of these with Gummy.\nBadd:\nGummy...? Oh, you mean Gumshoe...\nKay:\nGummy is... *sniffle* He was trying to be nice to me because I was gonna get in trouble... ...and then he got in trouble because he lied to protect me... Gummy... *hiccup*... I know he didn't kill Daddy...!\nBadd:\n.........Don't cry... Faraday would be sad if he saw you crying...\nKay:\n...I-I'm not crying!\nEdgeworth:\nKay...\nKay:\nOh! it's the mister from before and the lady, too!\nEdgeworth:\nDon't you think it would be a good idea to go home for the time being?\nFranziska:\nYou're not involved in the investigation, so it's for the best if you do.\nKay:\nUmm... Actually, I'm Uncle Badd's assistant! So I'm related to the investigation!\nEdgeworth:\nIs that so, Detective Badd?\nBadd:\n...Yeah, I guess.\nFranziska:\nWhat!? You were just scolding us like kids to not mess up the crime scene... ...and now you let this child run free!? Why!?\nBadd:\n...People are free to investigate things outside of the actual crime scene. Yew also had a few things she wanted to look into... Got a problem with that...?\nFranziska:\nRrrrnnngh!\nEdgeworth:\n(I don't have a problem with that, but I am curious as to what Ms. Yew is looking into.)\nKay:\nUncle Badd! I'm gonna go look somewhere else now, OK!?\nBadd:\nAlright... I'm counting on you...\nKay:\nOh, that's right! Hey, mister!\nEdgeworth:\nHm? Yes, what is it?\nKay:\nI know Gummy really isn't the bad guy... I mean it... So please... find the real bad guy, OK!?\nEdgeworth:\n............ (I won't forgive whoever did this. But in the absence of the perfect piece of testimony and evidence... ...there is no one else who could be the true culprit other than Detective Gumshoe.) ...Hm? She wandered off while I was pondering...\nTalk\n\n\n\n\n\n\n\n\n\nTyrell Badd\n\n\n\n\n\n\n\nEdgeworth:\nDetective Badd, what exactly was Kay searching for?\nBadd:\n...Nothing that concerns you, boy...\nFranziska:\nOh? And I suppose it has something to do with Kay?\nBadd:\n...It does, because she's Faraday's daughter... Anyway... Hurry up and get to the point... I don't have time to waste...\nEdgeworth:\n(It sounds like he'd rather be left alone...) I have something I'd like to confirm with you once again.\nBadd:\n...I... don't have anything to say to you.\nEdgeworth:\nHmph, be that as it may, we still have questions that we need answers to. Now then, first of all, what is the overpowering smell that is permeating this room? Upon entering this room... I thought I was going to suffocate!\nBadd:\n...It's that ultra-strong perfume Yew wears... She spilled some of it... I was... having a bad time of it myself. I didn't think twice and opened the window... but that smell's still here.\nEdgeworth:\nPerfume, huh... (So the sweet scent in the air... is perfume.)\nFranziska:\nWell, it's giving off quite a stench. I bet it's some cheap, no-name brand.\nBadd:\n...She said... it's a famous brand from overseas.\nFranziska:\n............ It's a knock-off. Yes, definitely a knock-off.\nBadd:\n...No disrespect, but... she forced one of those bottles on me. ...Here, little girl. You can have it...\nFranziska:\nHmph. I was born for a much more expensive and refined perfume! However, seeing as how you just happen to have a spare, I suppose I'll take it. Miles Edgeworth! You will hold on to this bottle without fail!\nEdgeworth:\n...Arnngh. (Why can't she ever be honest about her wants...?)\nMs. Yew's Perfume data jotted down in my Organizer.\nEdgeworth:\n(So now we have the perfume Ms. Yew wears... Just fantastic.)\nBadd:\n.........Is that all you wanted to talk about? If so, I'm going back to investigating.\nEdgeworth:\nActually, I still have a few other things I wish to inquire about.\nBadd:\n.........Tch...\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nDuring the recess\n\n\n\n\n\n\n\nEdgeworth:\nSo you were in this room the entire recess?\nBadd:\n...Like I said... ...I made a call to the precinct to get that big lug down here. But other than that... I was waiting for the recess to end in here.\nFranziska:\nAt least your story is consistent.\nEdgeworth:\nEarlier, you started that you were in this lobby with Ms. Yew.\nBadd:\n...Yeah, I ran into her in the hallway... She said she wanted to talk to me about something, so we came in here...\nEdgeworth:\nThen, what you're saying is that until Detective Gumshoe's arrival... ...you and Ms. Yew were in two different locations?\nBadd:\n.........Hmm... Guess I am...\nEdgeworth:\n(Interesting...)\nFranziska:\nSpeaking of that lawyer... She seems to have a great dislike for you.\nBadd:\nOof...\nEdgeworth:\n(Let's see... Ms. Yew is the sister of the victim of the KG-8 Incident. And, as I recall, Detective Badd was the lead detective on the case.) I wonder if the reason for her disdain isn't simply because you failed to guard Cece... ...but because you were the lead detective on the case.\nBadd:\n! ...You knew...?\nEdgeworth:\nHmph. I also know that today's trial involving the Cohdopian Embassy staff member... ...is being referred to as the second KG-8 Incident.\nBadd:\n.........\nEdgeworth:\nNow then, Detective. I believe it's time you were honest with me... ...and told me the truth behind your relationship with Ms. Yew and Mr. Faraday... ...and the KG-8 Incident!\nBadd:\n..................If you already know that much... I guess it'd be alright to tell you.\n\n\n\n\nKG-8 Incident (appears after \"During the recess\")\n\n\n\n\n\n\n\nEdgeworth:\nNow then, I'd like to ask you a few questions about the KG-8 Incident.\nBadd:\n...It's not exactly a happy story... Other than the people who were directly involved... ...you two will be the first to hear what I'm about to tell... The honest truth behind the KG-8 Incident!\nEdgeworth:\n!\nBadd:\nFaraday, Yew, and I... As you already know, we three were involved with the KG-8 Incident. Faraday and I, we were originally on the trail of a smuggling ring.\nEdgeworth:\nYou mean the smuggling case involving one of the Amano Group's secretaries...?\nBadd:\nHmph, that trial was just a front!\nFranziska:\nA façade...?\nBadd:\nYeah... But the case became tainted! All because the witness who was going to testify... ...about the Amano Group's ties to the smuggling ring, Cece Yew, was killed!\nEdgeworth:\nThen, what became of the secretary who was arrested?\nBadd:\n...His name... was Colin Devorae... To be honest... the guy didn't know a thing about the smuggling ring... But... he confessed to knowing about it anyway... Devorae was probably being intimidated by the big boss man... Just another scapegoat.\nEdgeworth:\n(The \"boss man\" of the Amano Group...? He can't seriously mean Mr. Ernest Amano... ...That can't be right. It's probably just Detective Badd's personal hypothesis. What is he trying to do, suspecting Mr. Amano of being involved with smuggling...?)\nFranziska:\nI suppose it would've been quite difficult to secure an acquittal after he confessed. But the man who killed Cece Yew, Manny Coachen, was a completely different person. But since he's already been acquitted once of her murder... Mr. Faraday, how could you have let him go!?\nEdgeworth:\nIf I remember correctly... ...I heard that Mr. Faraday had an important piece of evidence stolen from him.\nBadd:\n.........That wasn't Faraday's fault. It was mine... I wasn't vigilant enough. Faraday, Cece... I was supposed to protect them both...\nEdgeworth:\n(Ms. Yew did mention that as well... About how Detective Badd was supposed to guard her sister...)\nBadd:\nBut... even I, who was supposed to protect them... ...I fell into their trap...\nFranziska:\nWhat kind of a trap...?\nBadd:\n...Hmph... The holes in this jacket are a testament to that trap.\nEdgeworth:\n! Y-You mean... you were fired upon!?\nFranziska:\nY-You were shot at that many times in one gunfight...?\nBadd:\n.........No. Only about half of these... are from that case... But... the reason I continue to wear this jacket is to remind myself... ...of the lessons I learned... from the KG-8 Incident...\nEdgeworth:\n...I see.\nBadd:\nI couldn't protect Cece Yew... and the suspect was found not guilty. We had hit a brick wall... as far as the law was concerned... And that's when she came to the courtroom... the victim's sister... ...That's when I first met Calisto Yew...\n\n\n\n\nRelation to Yew (appears after \"KG-8 Incident\")\n\n\n\n\n\n\n\nEdgeworth:\nAbout when you first met Ms. Yew... It was on the day the verdict of the KG-8 Incident was handed down, was it not?\nBadd:\nYes... Faraday and I... We apologized to her from the bottom of our hearts... It was all we could do... But... \"Just saying you're sorry won't bring my sister back!\" she said... ...and then she gave me a hard slap across the face...\nFranziska:\nWell... She certainly had a lot of self-control to stop at just a slap. If it was [sic] me... not even a hundred lashes would've been punishment enough!\nBadd:\n...I suppose not... Yew said it herself... that she never wanted to see either of us ever again.\nEdgeworth:\nBut after that, you've seen her many times over, correct?\nBadd:\n...Yeah. Faraday and I... Even after the KG-8 Incident had come to a close... ...we continued to hunt down the smuggling ring, and got involved in a variety of cases. But... it was no use... We cracked so many different cases... ...but the result was always the same. We couldn't find the real mastermind behind the ring.\nEdgeworth:\n(Is the ring... really that big...?)\nBadd:\nIt was in the pursuit of the ring... that we met Yew once again... ...It was during another trial... related to the smuggling ring... Faraday was the prosecutor... and I, as the lead detective... ...took to the witness stand. Yew... she appeared out of the blue as the defense attorney...\nEdgeworth:\nHer client was related to the smuggling ring, and she was defending them...?\nBadd:\nYeah... Yew... was pursuing the ring as best she could as a lawyer. I think she defended Rell this time... for the same reason...\nEdgeworth:\n(Come to think of it, Ms. Yew did say something to the same effect...)\n\n\nYew:\nI... phwwh... have my own agenda. Phwwwh... I'm still on the hunt for leads regarding the KG-8 Incident, alright?\nEdgeworth:\nAnd for that, you have not a single qualm about defending a known killer...?\nYew:\n.........Don't put words in my mouth. I said no such thing.\nEdgeworth:\n.........\nYew:\nThe only way I had to get close to Mr. Rell was to be his lawyer. I had no intention of covering for him, ever. So don't you dare suggest I was going to.\n\n\nFranziska:\nHmph. It doesn't matter what her reason is... helping a criminal is just despicable!\nBadd:\n...You're so naïve... little girl. I could've stolen this lollypop from you, that's how naïve you are!\nFranziska:\nH-How dare you insult the daughter of a Von Karma!\nBadd:\nJust like us, Yew felt that she had hit the limit of what the law could do. ...That's all.\nEdgeworth:\n...The law is merely a tool. There is no limit to it, only the skill of the craftsman.\nBadd:\nYou two... are still too young... But one day, you'll know what I mean...\nEdgeworth:\n..................\nBadd:\nBut enough sidetracking... What matters... is that we met Yew again... in pursuit of the smuggling ring. ...That's all.\n\n\n\n\nRelation to Faraday\n\n\n\n\n\n\n\nEdgeworth:\nSo what was your relation to Mr. Faraday? You even seem to know Kay fairly well.\nBadd:\nI met him... when he was a rookie prosecutor... Known him ever since. And Kay... I've known her... since the day she was born. ...Faraday and I... we cracked quite a few cases together...\nEdgeworth:\nHmm, but you two seem to have made no progress at all in the Yatagarasu case.\nBadd:\n..................\nFranziska:\nDid we touch a nerve?\nBadd:\n...Hmph. I only have one thing... to say to you. ...No one knew more about the Yatagarasu... ...than me and Faraday... That's why... I was called upon to testify in today's trial... ...To prove... that Rell was not the real Yatagarasu... Which I would've done... if he hadn't turned around and accused Faraday... After the accusation, I was asked to testify, but this time... ...to prove or disprove the accusation... But I guess I won't be doing that either.\nEdgeworth:\n(I sense that there's more to that statement than meets the eye. Perhaps a bit more digging into the Yatagarasu is what's necessary.)\n\n\n\n\nYatagarasu (appears after \"Relation to Faraday\")\n\n\n\n\n\n\n\nEdgeworth:\nYou claim to know much about the Yatagarasu... Would you care to share what you know with me?\nBadd:\nHmph... What you two should be looking for right now... ...is proof... of murderous intent towards Faraday and Rell...!\nEdgeworth:\nI agree, which is exactly why I am asking you about the Yatagarasu.\nBadd:\n...What?\nEdgeworth:\nThe KG-8 Incident and this \"second\" KG-8 Incident... Both of these cases are tied to the smuggling ring... ...and in both of these cases, the witness who was to testify about the ring was murdered. However, there is one point in which they differ. And that is the presence or absence of the Great Thief Yatagarasu.\nBadd:\n.........\nEdgeworth:\nMr. Rell claimed to be the Yatagarasu, however, in the middle of the trial... ...he suddenly declared Mr. Faraday to be the real Yatagarasu. Then, during the recess, they were both killed. Don't you find that to be the least bit odd?\nFranziska:\nMiles Edgeworth! Stop beating around the bush and just spit it out already!\nEdgeworth:\nI believe that there must be some reason that... ...the two men suspected of being the Yatagarasu were both killed at the same time.\nBadd:\n...A reason... huh...\nEdgeworth:\nAnd so, in order to catch Mr. Faraday's and Mr. Rell's cold-blooded killer... ...I feel that I need to learn as much as I can about the Yatagarasu.\nBadd:\n.........If it will help you solve this case... Then I'll tell you! I'll tell you the reason why we've never caught the Yatagarasu!\nFranziska:\nWhat was that sudden outburst for!? You almost made me whip you by accident!\nEdgeworth:\nNnghooh! (It still \"accidentally\" whipped me anyway...)\nBadd:\nThere are three main reasons why the Yatagarasu will always be one step ahead! First! The Yatagarasu always knows the exact location of the target object. Second! The Yatagarasu always knows exactly how to disarm the security system. Third! The Yatagarasu doesn't leave a single shred of evidence behind, ever!\nEdgeworth:\nI see. So those are the Yatagarasu's special traits.\nFranziska:\n...Sounds like an incredibly elusive thief.\nBadd:\n...The Yatagarasu... ...has never been caught on tape... never tries to draw anyone's attention... ...and would never do something... as low-brow as commit murder...! That's how I knew... that Rell wasn't the real Yatagarasu right away.\nFranziska:\nBut you can't use that sort of logic on its own to prove that he wasn't.\nBadd:\nHmph... Listen, little girl. I'm not done talking yet...\nFranziska:\nGnrrk!\nBadd:\nWhat's different about this time... was that evidence related to the smuggling ring... ...was sent to the police... And the sender was none other than the one who infiltrated the Cohdopian Embassy... ...the Yatagarasu...\nEdgeworth:\nThe Yatagarasu sent the evidence?\nBadd:\nUntil now, the Yatagarasu... ...would always publicize any corrupt dealings through the mass media... ...but not this time... The evidence this time... ...was something only Faraday and I... and a select few others knew about...\nEdgeworth:\nIn that case, how can you be so sure that it was the Yatagarasu who sent it?\nBadd:\nThat's easy... A special card that only the Yatagarasu uses was attached... That's how I can be so sure...\nEdgeworth:\nAnd just what sort of card is it?\nBadd:\n...Here, take a look at this article... Whenever the Yatagarasu wants to publicize something... ...a white card is sent along with the stolen information... But... when we questioned Rell about what was sent along with the white card... ...Rell had no idea what it was.\nEdgeworth:\n(Ahh, and that's how Detective Badd knew that Mr. Rell was a phony...) Thank you very much. I have a much better understanding of the Yatagarasu now.\nBadd:\nHmph...\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nSwiss Roll\n\n\n\n\n\n\n\nBadd:\nThat snack has quite a history attached to it for me...\nEdgeworth:\n...I'm not sure I follow.\nBadd:\nOur recently departed Faraday loved the Courthouse Special Swiss Rolls... ...and his daughter, Kay, also seems to have taken a liking to them. The three of us used to sit around eating them together...\nEdgeworth:\n..................\nBadd:\nI guess that's why we wanted to get Detective Gumshoe into them, too. But look at the sticky situation that came out of that.\nFranziska:\nActually, the biggest reasons for the sticky situation we find ourselves in are... ...the absolute poverty of that scruff-face, and his unnecessary soft-heartedness!\nEdgeworth:\n(...Unforgiving as always, I see.)\n\n\n\n\nDet. Badd's Testimony\n\n\n\n\n\n\n\nBadd:\nIt's just as I said... I have nothing further to add.\nEdgeworth:\n..................\nBadd:\nBut if there's one thing a detective honors, it's that... ...you must have confidence in, and take responsibility... for anything you say... That's what it means to be a detective...\nEdgeworth:\n(In other words, you're just another stubborn horse, aren't you, Detective?)\n\n\n\n\nMs. Yew's Perfume\n\n\n\n\n\n\n\nBadd:\nI'm not a big fan... of perfume...\nEdgeworth:\nSo, exactly what kind of relationship do you have with Ms. Yew?\nBadd:\nLike I told you... ...we're connected through the victim of the KG-8 Incident, her younger sister. I was supposed to protect her... ...but I failed in my duties; just another pathetic detective... After that... Coachen's not guilty verdict... ...sparked our pursuit of the case. Me as [sic] detective, and she as a lawyer.\nEdgeworth:\n(In other words, they're still working together...)\nExamine\n\n\n\n\n\n\n\n\n\nPainting above sofa\n\n\n\n\n\n\n\nEdgeworth:\nThat expensive painting is ill-suited to be hanging on the wall of this room.\nFranziska:\nI wonder if a guard detail should be placed on it?\nEdgeworth:\nWhy do you say that?\nFranziska:\nWell, a desperate, low-paid detective might make off with it someday. You never know.\nEdgeworth:\n(She may be thinking about hiring a guard... ...but it's obvious she isn't factoring in that guard's salary whatsoever.)\n\n\n\n\nOpen window (before talking to Tyrell Badd)\n\n\n\n\n\n\n\nEdgeworth:\n(One of the windows in this lobby is open as well... The air-conditioner is working just fine in this room, so why did they open it, I wonder?)\n\n\n\n\nOpen window (after talking to Tyrell Badd)\n\n\n\n\n\n\n\nEdgeworth:\nI can still smell that perfume, even with the window being left open to air out the room.\nFranziska:\nAre you sure they didn't just forget to close the window, Miles?\nEdgeworth:\n......Hmm. Yes, well, I hadn't thought of that.\nFranziska:\nYou've still got a long way to go if you think you can best me, Miles Edgeworth.\n\n\n\n\nPlant\n\n\n\n\n\n\n\nEdgeworth:\nThis decorative plant's leaves are shinier than the ones on the plant in Lobby No. 2.\nFranziska:\nThat's probably because it's next to the windows where it's easier to photosynthesize.\nEdgeworth:\nYou may be right. Plus, the curtains are always drawn in Lobby No. 2.\nFranziska:\nThe caretakers of this courthouse don't think enough about the plants, do they?\nEdgeworth:\n(That's because they're the courthouse's caretakers, not a bunch of botanists.)\n\n\n\n\nClosed window\n\n\n\n\n\n\n\nEdgeworth:\n(I can see down into the courthouse courtyard from here.)\nFranziska:\nWhat is that mess supposed to be!? It's like an optical illusion...!\nEdgeworth:\nI believe it's supposed to be postmodern in design.\nFranziska:\nMore like \"thoughtlessness in design\".\nEdgeworth:\n(I can't disagree there.)\n\n\n\n\nTV\n\n\n\n\n\n\n\nEdgeworth:\nThis television is the same model as the one in Defendant Lobby No. 2.\nFranziska:\nLooks like the two rooms are basically the same in terms of layout and supplies.\nEdgeworth:\nYes. (Hmm... The two rooms are basically the same, huh...)\n\n\n\n\nTea dispenser\n\n\n\n\n\n\n\nFranziska:\nWhat an incredibly strong-scented herbal tea.\nEdgeworth:\nI fear that more than being relaxing, this scent may make one a bit heady instead.\nBadd:\n...Yew put in a special request for that.\nFranziska:\nNo wonder she's so violent, if she's been drinking this stuff the whole time.\nEdgeworth:\n(Neither woman should be allowed to comment on this particular topic. Ever.)\n\n\n\n\nRight half of table\n\n\n\n\n\n\n\nEdgeworth:\nIt may not look like much, but I find that ordinary tables like this one are very useful.\nFranziska:\nI think it's time they bought a new one. I wonder if they will replace this table if I hit it enough with my whip?\nEdgeworth:\n(A much too heavy-handed method if I ever saw one...)\nPartner\n\n\n\n\n\n\n\nFranziska:\nYes, what is it?\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nNotice anything?\n\n\n\n\n\n\n\nFranziska:\nWhat is this... smell that has permeated the air!?\nEdgeworth:\nHmm... It's sweet and flowery. Although, at this strength, I'm likely to suffocate from it.\nFranziska:\nI can't conduct an investigation under these circumstances! We need to open a window and air this room out! I demand that you open a window right now! Hurry!\nEdgeworth:\nFranziska, one of the windows is already open.\nFranziska:\n.........I can see that.\nEdgeworth:\n(Hmm... I wonder... Is it just a coincidence that one of the windows in this room is already open, too...?)\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nSwiss Roll\n\n\n\n\n\n\n\nFranziska:\nScruffy seems to have taken a real liking to that little girl.\nEdgeworth:\nIndeed. For him to cover for her to the point of taking the blame for the murders... ...despite only knowing her for such a short period of time...\nFranziska:\n...He must be a frightfully big softie. He may be a fool, but I guess I can recognize his soft side as one good point about him. ...Which means he is about as unlikable and thankless as a small child now in my mind.\nEdgeworth:\n(Which really means that your opinion of him hasn't changed a bit, has it?)\n\n\n\n\nMs. Yew's Perfume\n\n\n\n\n\n\n\nFranziska:\nI have no interest in that perfume, or in that woman. Here we are, trying to be serious, and all she does is break out into laughter. It's borderline rude!\nEdgeworth:\n(Hmm... Franziska seems to hold some ill-will towards Ms. Yew. Although... ...between whipping people all the time, and laughing when people are being serious... ...I'm not sure which one I find more annoying.) Aaargh!\nFranziska:\nYou were thinking something bad about me just now, weren't you!?\nEdgeworth:\n(I take that back. Ms. Yew is slightly less annoying due to the lack of physical pain.)\nAfter clearing all Talk options with Tyrell Badd:\nBailiff:\nExcuse me, Mr. Edgeworth!\nEdgeworth:\nYes?\nBailiff:\nHis Honor would like to transfer the evidence from today's trial over to you. So if you could please head over to the courtroom, it'd be much appreciated, sir!\nEdgeworth:\nUnderstood. I'll be there shortly. Detective Badd... What does the law mean to you?\nBadd:\n.............................. Finding the answer to that question is the only reason I'm still alive...\nEdgeworth:\n(I became a prosecutor to find the answer to that question myself... ...and to play a part in ensuring that all criminals everywhere are found guilty!)\nHallway\nExamine\n\n\n\n\n\n\n\n\n\nSofa\n\n\n\n\n\n\n\nFranziska:\nThe bench is covered with ants. The janitor is going to have a tough time with this.\nEdgeworth:\nIt would appear that they're coming in through the open window up there. (Ants are unusual creatures. We can learn so much from their diligence and zeal.)\n\n\n\n\nOrange vending machine\n\n\n\n\n\n\n\nEdgeworth:\nThis vending machine is stocked with a variety of base food products. Yet, despite their banality, they're priced extraordinarily high.\nFranziska:\nI have no interest in anything that is unrelated to the case, Miles.\nEdgeworth:\nHold on, I wouldn't dismiss it yet. Clues are often found in the most surprising of places. No matter how insignificant it may seem, we should give all things due consideration.\nFranziska:\nI suppose... In that case, Miles Edgeworth... ...you will buy me one of those ham sandwiches! For evidence's sake, of course!\nEdgeworth:\n.........I believe that preserving the crime scene takes precedence, Franziska.\n\n\n\n\nBlue vending machine\n\n\n\n\n\n\n\nFranziska:\nMiles Edgeworth, prepare me some change.\nEdgeworth:\nAnd what if I refuse?\nFranziska:\nWell, aren't we stingy? I'm shocked that you're unwilling to part with a few coins!\nEdgeworth:\nThink what you will. Besides, we can't go around changing the state of the crime scene.\nFranziska:\nHmph, you don't have to treat me like a child! I already knew that, you know!\nEdgeworth:\n(Oh? Then why did you bother asking for change in the first place?)\n\n\n\n\nPoster\n\n\n\n\n\n\n\nFranziska:\nI don't believe it! This judge has it all wrong. The star of the courtroom isn't him; it's me, Franziska von Karma!\nEdgeworth:\n(As long as she doesn't turn evil, I suppose I can live with \"just another megalomaniac\".)\n\n\n\n\nFire extinguisher\n\n\n\n\n\n\n\nFranziska:\nThat extinguisher looks like it would be good at extinguishing any bad memories... With a solid smack across the back of a person's head.\nEdgeworth:\nAre you saying you have memories you'd like erased at your tender age?\nFranziska:\nI am perfect. Therefore, I don't have anything I want to erase from my mind. I was talking about you, Miles Edgeworth.\nEdgeworth:\n..................I have no intention of revisiting the past.\nFranziska:\nOh? That's too bad. Well, if you ever want my help erasing memories...\nEdgeworth:\n...I'll be sure to ask.\nPartner\n\n\n\n\n\n\n\n\n\nNotice anything? (when not in Defendant Lobby No. 1)\n\n\n\n\n\n\n\nFranziska:\nAll that's left to investigate is Defendant Lobby No. 1. If there is anything left to be found, we'll find it there.\nEdgeworth:\n(Perhaps I should head over to Lobby No. 1 and see what I turn up...)\nDefendant Lobby No. 2\nTalk\n\n\n\n\n\n\n\n\n\nCalisto Yew\n\n\n\n\n\n\n\nYew:\nWhat is it, Edgeworth?\nEdgeworth:\nNngh... Nothing in particular, however...\nYew:\nPhwwh...! \"Nngh,\" he says!\nEdgeworth:\nNngh...?\nYew:\nAhahaha! You did it again! What IS that supposed to be? Your mating call!?\nEdgeworth:\n(Is everything I do humorous to this woman?)\nYew:\nLook, Edgeworth, I'm incredibly busy right now. I've got a mountain of things to figure out and check up on. If you want to talk, you're just going to have to wait until later, OK?\nEdgeworth:\n(Hmph. I'll just continue with my investigation, then.)\n\n\n\n\nForensics\n\n\n\n\n\n\n\nFranziska:\nMr. Lab Technician! I want to know what you found!\nForensics:\nOh! I've found some fingerprints that I can't show to any kids.\nFranziska:\nWhose fingerprints are they?\nForensics:\nI think they're the victim's!\nEdgeworth:\nAnd what kind of prints are they?\nForensics:\nThe kind that Detective Badd told me not to show you kids!\nEdgeworth:\nNngh! (Argh! That only makes me all the more curious!)\nExamine\n\n\n\n\n\n\n\n\n\nSofa\n\n\n\n\n\n\n\nEdgeworth:\nYou must be tired, Franziska. Care to take a short break on that sofa?\nFranziska:\nSurely you jest! Me? Sit on that tiny, dirty, disgusting thing?\nEdgeworth:\n(But that detective said he could sleep \"all 25 hours of the day\" on this...)\n\n\n\n\nPlastic bags on ground\n\n\n\n\n\n\n\nEdgeworth:\nI wonder if the killer used these plastic bags in a flash of inspiration?\nFranziska:\nWith THAT detective? I somehow doubt he's that quick-witted.\nEdgeworth:\nSo you're saying that this crime was thought out in advance...?\nFranziska:\nWith THAT detective? I somehow doubt he's capable of making such a complex plan.\nEdgeworth:\nFranziska... When will you learn to take responsibility for your statements?\n\n\n\n\nBodies\n\n\n\n\n\n\n\nFranziska:\nIt seems that detective has more brains than he looks in some regards.\nEdgeworth:\nDo you really think so? Because, to me, in order to pull off a crime of this magnitude... Let's just say that I doubt he has enough mental prowess to be successful at such a thing.\nFranziska:\nHah, don't think that kind of subjective commentary is going to prove anything. If you have a theory, then prove it to me with evidence.\nEdgeworth:\nOf course. That has been my intention all along.\n\n\n\n\nTea set, plastic bags on table, or chairs\n\n\n\n\n\n\n\nFranziska:\nWas this table here all along?\nEdgeworth:\nI suppose so.\nFranziska:\n\nFranziska:\nWell, clearly, it's out of place. When you take the sofa into consideration, that table is much too tall!\nEdgeworth:\n...I get the impression the two are not meant to be used as a set, Franziska.\nFranziska:\n! I-I knew that!\nEdgeworth:\n(*sigh* It seems she's lost her calm sense of judgement in her eagerness to defeat me...)\n\n\n\n\nBag on table\n\n\n\n\n\n\n\nEdgeworth:\nSo this was the bag I was to receive with the evidence for today's trial in it...\nFranziska:\nAha! I have it! The killer hid himself inside this bag and that's how he snuck into this courthouse!\nEdgeworth:\nThe suspect that was arrested is hardly the type of man to carry a bag of this kind. Besides which, I doubt there is enough space inside this bag for him to hide in.\nFranziska:\nOoh... Just shut up!\n\n\n\n\nOpen window\n\n\n\n\n\n\n\nEdgeworth:\nI suppose it's impossible to enter or exit through these windows thanks to these bars.\nFranziska:\nI suppose you're right.\nEdgeworth:\n...Actually, that's not true. I bet a person of small stature could slip in. Franziska, would you care to help me test my theory?\nFranziska:\n..................\nEdgeworth:\nUnnnrgh! (Drat. I must remember to be more tactful around the vertically challenged!)\n\n\n\n\nTV\n\n\n\n\n\n\n\nFranziska:\nThat is one tiny TV.\nEdgeworth:\nDetective Gumshoe was rather shocked at this, and said it is \"huge\" compared to his own.\nFranziska:\nHah, anything you compare with something he owns will always seem grandiose.\nEdgeworth:\n(Speaking of grandiose, I'd say that ego of yours could use a little deflating.)\n3rd Floor Lobby\nTalk\n\n\n\n\n\n\n\n\n\nKay Faraday\n\n\n\n\n\n\n\nKay:\nOh, sorry, mister. I'm a little busy right now!\nEdgeworth:\nDoing what...?\nKay:\nUm... Well, I'm looking for something. Uncle Badd told me to, so that's what I'm going to do.\nFranziska:\nLet's go. I don't want to interfere with the girl, lest Detective Badd get angry.\nEdgeworth:\nYes, agreed.\nExamine\n\n\n\n\n\n\n\n\n\nWater fountain\n\n\n\n\n\n\n\nEdgeworth:\nIt appears I won't be drinking out of this until it's been repaired.\nFranziska:\nIf you want a drink of water, just find a tap. It's all the same.\nEdgeworth:\nNo, actually, the water from this is apparently something special. There was a man here who was practically bathing in it.\nFranziska:\n............ I know.\nEdgeworth:\nAh, then obviously we are both thinking the same thing.\nFranziska:\nI suppose we'll just have to wait then.\nEdgeworth:\nYes.\nSeptember 10\nDistrict Court - Courtroom No. 3\nJudge:\n...Oh, it's you, Mr. Edgeworth. ...*sigh*...\nEdgeworth:\n(It appears that His Honor is still a bit dispirited...)\nJudge:\nFor the first time today, I experienced what it's like to stand at the witness stand... *sigh* I now have a greater appreciation... for just how hard it is to give testimony.\nFranziska:\nWell, there's no reason for you to be all depressed about it, Your Honor. As a judge, no one expects you to think about anything other than the verdict.\nEdgeworth:\nFranziska, there is no need to further depress His Honor.\nFranziska:\nBut I'm not trying to, Miles.\nEdgeworth:\nYour Honor...\nJudge:\nEhh...\nEdgeworth:\nYour Honor, I've come to collect the evidence that was to be transferred to me.\nJudge:\nHe...\nEdgeworth:\nYour Honor. The evidence...?\nJudge:\nI...\nEdgeworth:\nYour Honor!\nJudge:\nOh! Y-You! Yes, can I help you!?\nEdgeworth:\n...I'd like to collect the evidence now, sir.\nFranziska:\nYour Honor... Do you think you can stay focused long enough to at least do your job!?\nJudge:\nY-Yes, I'm sorry! And I would, except that the defense attorney has yet to arrive.\nEdgeworth:\nShe is busy with the investigation, so let's keep this brief, shall we?\nJudge:\nVery well. In that case, please confirm that all the pieces of evidence are present. Furthermore, the evidence that was used in the murders of Mr. Faraday and Mr. Rell... ...are also included, so please go ahead and use them in your investigation into their case.\nEdgeworth:\nUnderstood, Your Honor. (The pieces of evidence that were used in the murder of those two men... This could be a very good chance for me to find new leads regarding their case. And maybe even something that will finally lead me to the truth!)\nJudge:\nI've placed all of the evidence over at the Prosecutor's Bench for you.\nEdgeworth:\nI see. Thank you very much. I will go and confirm that they are all accounted for.\nTalk\n\n\n\n\n\n\n\n\n\nThe Judge\n\n\n\n\n\n\n\nJudge:\n*siiiiiigh*... *siiiiiiiiiiiiiiiiigh*...\nEdgeworth:\nIt would appear that the Judge is still a bit dispirited.\nFranziska:\n......... Stop that! You're being so depressing!!\nJudge:\nMuhwooooohh!\nEdgeworth:\nYou should listen to her, Your Honor, before things go from bad to worse. (...Although, it can't really get much worse for him, other than to be whipped by her.)\nExamine\n\n\n\n\n\n\n\n\n\nProsecutor's bench\n\n\n\n\n\n\n\nEdgeworth:\nSo this is the evidence related to today's Cohdopian Embassy trial from Mr. Faraday's bag.\nFranziska:\nYou mean the evidence bag that was on the table in Lobby No. 2, right?\nEdgeworth:\nYes. Finally, we can now take a look at the evidence itself, and not just data about them. Let's be sure to thoroughly examine them while we have the time.\nFranziska:\nAgreed. I want to take a good look at all of the evidence from the Embassy murder, too.\nEdgeworth:\n...And why is that?\nFranziska:\nBecause! I still don't fully understand what today's trial was about!\nEdgeworth:\nGnwaaah! Don't point your crop at me just because you don't know something!\nFranziska:\nAnd don't you try to order me around just because Papa chose you today!\nEdgeworth:\n(I see someone is still sore about not being picked by Mr. von Karma...)\nFranziska:\n...It's all so... real to see the knife up close.\nEdgeworth:\nSo, we have the knife, the gun, an envelope... and what's this organizer doing here...?\nJudge:\nOh! That's right! I completely forgot to tell you!\nEdgeworth:\nAbout what, Your Honor?\nJudge:\nThey found Mr. Faraday's personal organizer inside that evidence bag of his. Detective Badd requested it be passed along to you. He said it would help the investigation.\nEdgeworth:\nDetective Badd said that...?\nFranziska:\n...What a strange stroke of luck.\nEdgeworth:\nWell, never look a gift horse in the mouth. We might as well flip through it, too. (I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\nGun\n\n\n\n\n\n\n\nEdgeworth:\nThis gun... It was originally used to kill the Cohdopian Embassy staff member. When the crime was reported... ...the responding police found Mr. Rell still holding it, which led to his immediate arrest.\nFranziska:\nAnd then... this gun took the original shooter's life. How ironic.\nEdgeworth:\nIndeed. (There doesn't seem to be anything else we can learn from this piece of evidence.)\n\n\n\n\nKnife\n\n\n\n\n\n\n\nEdgeworth:\nIt's the knife that was used to kill Mr. Faraday...\nFranziska:\nWho would've thought that such a beautiful piece of art... ...could be used for such a cruel act!?\nEdgeworth:\n(And it's never crossed your mind that you use your riding crop for the wrong purpose?)\n\n\n\n\nOrganizer\n\n\n\n\n\n\n\nEdgeworth:\nMr. Faraday's organizer... It appears he was in the habit of using it.\nFranziska:\nIt looks like he wrote his strategy for getting Mr. Rell convicted down in here.\nEdgeworth:\nIt appears that Mr. Faraday honestly believed that Mr. Rell was the killer in the case. And it would also appear that he had proof that Mr. Rell was not the Yatagarasu. Hmm... And he apparently also had a very definitive piece of evidence. Yes, I believe that Mr. Faraday was well prepared... ...to discredit any claim Mr. Rell may have made about being the real Yatagarasu.\nFranziska:\nAnd he had a way to prove that Mr. Rell was the guilty party in the Embassy murder.\nEdgeworth:\n(This organizer is a clue straight from Mr. Faraday. I'll have to take my time and give it a thorough read later.)\nMr. Faraday's Organizer data jotted down in my Organizer.\nFranziska:\nLook, there's a picture stuck between these pages here.\nEdgeworth:\nIt appears to be... a key.\nFranziska:\nAnd a rather ornate one at that. Just look at the design on the handle.\nEdgeworth:\nThe craftsmanship is superb... Could this be the \"Yatagarasu's Key\" Mr. Faraday mentioned in his organizer?\nFranziska:\nThe Yatagarasu's... Key?\nEdgeworth:\nDetective Badd said something earlier...\n\n\nBadd:\nWhat's different about this time... was that evidence related to the smuggling ring... ...was sent to the police... And the sender was none other than the one who infiltrated the Cohdopian Embassy... ...the Yatagarasu...\nEdgeworth:\nThe Yatagarasu sent the evidence?\nBadd:\nUntil now, the Yatagarasu... ...would always publicize any corrupt dealings through the mass media... ...but not this time... The evidence this time... ...was something only Faraday and I... and a select few others knew about...\n\n\nFranziska:\nMr. Faraday must've been trying to keep this secret key safe.\nEdgeworth:\nAs the prosecutor on both the Yatagarasu and smuggling ring cases, that's to be expected.\nYatagarasu's Key data jotted down in my Organizer.\n\n\n\n\nOrganizer (subsequent times)\n\n\n\n\n\n\n\nEdgeworth:\nMr. Faraday's organizer... It appears he was in the habit of using it. (This organizer is a clue straight from Mr. Faraday. I'll have to take my time and give it a thorough read later.)\n\n\n\n\nEnvelope\n\n\n\n\n\n\n\nEdgeworth:\nI took a quick look through these documents before the trial started.\nFranziska:\nWell, I wasn't even afforded the opportunity to skim it.\nEdgeworth:\nHmm...I suppose I should explain it to you then.\nFranziska:\nYes, you should. Perfectly and in its entirety, if you please.\nEdgeworth:\nOn the night of September 8th, an Embassy staff member was killed in front of the Embassy. The staff member died of shock due to being shot in the heart. Mack Rell was brought in that night as a suspect and thoroughly questioned... ...because the murder weapon was found on him, for which he was arrested on the spot.\nFranziska:\nA simpleton of a man, that's what he was.\nEdgeworth:\nHmph... Perhaps he was, for the weapon wasn't the only incriminating evidence we had. Mr. Rell was caught in the act on film by a security camera.\nFranziska:\nHe was an even bigger simpleton than I'd thought. I can't believe he didn't notice a security camera!\nEdgeworth:\nThe Cohdopian Embassy's security system is supposedly very well designed. He may have simply not been aware that there was a camera in the area.\nFranziska:\nSo... have you seen the contents of the video for yourself?\nEdgeworth:\nYes, the surveillance video the security camera took... ...was played during the trial by Mr. Faraday. You can clearly identify Mr. Rell on it. Even the sound of the gunshot was crystal clear.\nFranziska:\nSo the footage included sound, huh? I don't think I'd ever want to see the moment of someone's death in real life.\nEdgeworth:\nMe neither.\n\n\nAfter examining knife and organizer:\nEdgeworth:\nHmm, that's odd...\nFranziska:\nWhat is it?\nEdgeworth:\nMr. Faraday didn't mention anything about a knife in his organizer.\nFranziska:\n...That certainly is odd.\nEdgeworth:\nThe weapon that was used to kill the Cohdopian Embassy staff member was the gun. But if that's the case... ...then where did the knife that was used to murder Mr. Faraday come from!?\nFranziska:\nIsn't it obvious? It was brought into the courthouse by Mr. Rell! That's the only logical conclusion, right?\nEdgeworth:\nNo, because it's not that easy to smuggle a weapon like that in here. Every person who enters the courthouse doors is checked thoroughly for contraband. Furthermore, the suspect was handcuffed... ...making it impossible for him to bring a knife as large as this inside.\nFranziska:\nIn that case... how do YOU suppose this knife ended up inside the courthouse!?\nEdgeworth:\n.................. (I need to think carefully here... There is nothing related to the knife written anywhere in Mr. Faraday's organizer... However... it is a fact that this knife... ...came from Mr. Faraday's evidence bag. ...Conversely, there is one item listed in Mr. Faraday's organizer... ...that no one has claimed to have seen today! So in order to solve this mystery... ...I believe I will need to take another good look at the evidence.)\nFranziska:\nMiles Edgeworth... Can I take the fact that you have yet to answer me... ...to mean that you don't have an answer for me?\nEdgeworth:\nActually, I do know the answer, Franziska.\nFranziska:\nWhat!? Then what is it!?\nEdgeworth:\nOne of the pieces of evidence we've been holding has been hiding a secret of its own. And it was through this piece of evidence that the knife was brought into the courthouse!\n\n\n\nPresent Yatagarasu's Key\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"This 'Yatagarasu's Key' Mr. Faraday mentions in his organizer...\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nFranziska:\nI don't see how that answers my question at all.\nEdgeworth:\nEvery piece of evidence has some secretive aspect about it...\nFranziska:\nOh? Then I demand to know what the secret is to this one!\nEdgeworth:\nGnrk! (Alright, maybe there is no secret to this one... I need to think carefully here... There is nothing related to the knife written anywhere in Mr. Faraday's organizer... However... it is a fact that this knife... ...came from Mr. Faraday's evidence bag. ...Conversely, there is one item listed in Mr. Faraday's organizer... ...that no one has claimed to have seen today! I believe I need to take another good look at the evidence.) The knife was definitely brought in somehow...\nLeads back to:\n\"And it was through this piece of evidence that the knife was brought into the courthouse!\"\n\n\nEdgeworth:\nThis \"Yatagarasu's Key\" Mr. Faraday mentions in his organizer... This is how the knife was brought into the courthouse.\nFranziska:\nYou're not making any sense, Miles Edgeworth!\nEdgeworth:\nHmph... You just need to look a bit closer, Franziska, to see what I mean. Don't the color and ornamentation of the key's handle remind you of anything?\nFranziska:\n..................They do remind me of the knife...\nEdgeworth:\nVery good. Both the Yatagarasu's Key in this photo and the murderous knife... ...have this very unique design on their handles. Furthermore, even though Mr. Faraday mentions the Yatagarasu's Key... ...the only object we found at the crime scene was the knife.\nFranziska:\nY-You don't seriously mean to say...!?\nEdgeworth:\nIt appears that you've finally caught up. And yes, I DO mean to say that these two pieces are, in fact, one and the same!\nFranziska:\nBut that's impossible!\nEdgeworth:\nEven if that is what you believe, we should still investigate this possibility.\nFranziska:\nNnrgh...\nEdgeworth:\nNow then, let us examine this knife in a little more detail.\nLeads to examination of knife\n\n\n\nExamine blade\n\n\n\n\n\n\n\nEdgeworth:\nIt's the weapon that was used to kill Mr. Faraday... The handle and the blade itself both have beautiful designs worked into them.\nFranziska:\nLook! There's even a flower-shaped design in this gold section here. If this hadn't been used as a tool for murder, I'd want it for myself.\nEdgeworth:\n(...She seems to be drawn to the embellishments. Too bad this isn't mine to give.)\n\n\n\n\nExamine button at bottom of handle\n\n\n\n\n\n\n\nFranziska:\nI can't believe it turned into a key! To think there was such a trick to this thing...!\nEdgeworth:\nSo the weapon used to kill Mr. Faraday is actually the key the Yatagarasu stole... (This piece of information is more critical than anything we've learned up until now!)\n\n\nAfter examining button at bottom of handle:\nYatagarasu's Key data updated in my Organizer.\nFranziska:\n...Frankly, I'm shocked.\nEdgeworth:\nMr. Faraday only mentioned the key aspect of this piece of evidence in his organizer. It's possible that even he had no idea the key was hiding a knife blade inside.\nFranziska:\nBut if that's true... ...then only someone who knew about the key to knife trick... ...could have killed Mr. Faraday!\nEdgeworth:\nEven among law enforcement, this key was top secret... We're looking for someone who knew even more about the key than even Mr. Faraday... Meaning that the only person it could be is the one who sent the key in the first place... The Great Thief Yatagarasu!\nFranziska:\n! .........Then maybe Mr. Rell really was the Yatagarasu... ...and he was the one who killed Mr. Faraday. Isn't that one possible scenario?\nEdgeworth:\nNo, not really... Especially since Mr. Faraday... ...was absolutely convinced that Mr. Rell was not the Yatagarasu. Besides, as Detective Badd said earlier...\n\n\nBadd:\nBut... when we questioned Rell about what was sent along with the white card... ...Rell had no idea what it was.\n\n\nFranziska:\nI see... Alright then, I guess the person who knows the trick behind this key... ...is someone else, and that person is the real Yatagarasu.\nEdgeworth:\nHmm... It seems that this key is truly the key to solving this case.\nKnife data updated in my Organizer.\n\n\n\n\nProsecutor's bench (subsequent times)\n\n\n\n\n\n\n\nEdgeworth:\n(I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\n\nDefense attorney's bench\n\n\n\n\n\n\n\nEdgeworth:\n(Evidence that Ms. Yew prepared is just sitting here on this table.)\nFranziska:\nYou know you can't just walk off with it, right?\nEdgeworth:\nOf course I do. (Ms. Yew must've been caught off-guard by her client's sudden accusation... I wonder how she would've defended Mr. Rell in that case if he was [sic] still alive?)\nExamine evidence\n\n\n\n\n\n\n\n\n\nHandgun (after examining gun on prosecutor's bench)\n\n\n\n\n\n\n\n\n\nTrigger\n\n\n\n\n\n\n\nEdgeworth:\nThe trigger -- such a small piece of metal, and yet, it can take a whole life away... I wished that I never had to lay eyes on another gun again...\nFranziska:\nWhat's this? Are you afraid of guns, Miles?\nEdgeworth:\n...It's not that at all! It's just...\nFranziska:\nWell! I am not afraid of these things in the least!\nEdgeworth:\n(Where does she find the gall to say things like that...?)\nPartner\n\n\n\n\n\n\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nEvidence transfer\n\n\n\n\n\n\n\nFranziska:\nIt looks like your debut trial fizzled out thanks to it being declared a mistrial. Too bad.\nEdgeworth:\n.........\nFranziska:\nBut now you can take your time bidding the evidence they transferred to you goodbye.\nEdgeworth:\nHmph... It's much too early to shelve the pieces that were given to me.\nFranziska:\nOh? How do you figure?\nEdgeworth:\nTwo of the pieces were used to kill Mr. Faraday and Mr. Rell. Naturally, having all of them makes it easier for me to examine them more thoroughly.\nFranziska:\nArgh! Y-Yes, of course.\nEdgeworth:\nDon't tell me... You forgot about that fact, didn't you, Franziska?\nFranziska:\nI don't have to answer the characteristically foolish question of a foolish fool! Now, hurry up and check the evidence already!\nEdgeworth:\nTrust me, I will. In due time.\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nKnife or Yatagarasu's Key (after examining knife and organizer on prosecutor's bench)\n\n\n\n\n\n\n\nFranziska:\nSo the knife that was used to kill turns out to be the Yatagarasu's Key... It must've taken great skill to combine both aspects into one object so well... Make no mistake, I think this is the key to the whole case.\nEdgeworth:\nSo you're saying... ...that this key is the golden key to unlocking the secrets behind this case!?\nFranziska:\n..................\nEdgeworth:\nGnnnrk!\nFranziska:\nNo lame puns in my presence!\nEdgeworth:\n(Hmm... Perhaps that was just a bit too corny...)\nAfter examining everything on prosecutor's bench:\nEdgeworth:\nThat's odd. We're short one piece of evidence. And the piece that's missing is the surveillance video that was played in court!\nFranziska:\nThe surveillance video...? How could a piece of evidence just disappear? Where did it go?\nEdgeworth:\n(The video showing the moment in which Mr. Rell committed the murder... Where could it have gone indeed!?)\nJudge:\nAre you done with your inspection of the evidence?\nEdgeworth:\nYes, I'm finished. However, Your Honor, I am missing a single piece of prosecutorial evidence.\nFranziska:\nYour Honor... Were you derelict in your duties?\nJudge:\nWh-What!? No! I dare not lick my duties! What do you take me for!?\nEdgeworth:\nNo, Your Honor. The most important piece of evidence in today's trial... ...the surveillance video, is not amongst the evidence you laid out for me.\nJudge:\nHmm... But I brought Mr. Faraday's whole bag with me from the crime scene. Maybe the tape is still somewhere at the crime scene...?\nEdgeworth:\n.................. (There's something wrong here... Something about this missing piece of evidence... It would appear that for me to find the answers I seek... ...I will have to pay another visit to the scene of the crime, Defendant Lobby No. 2!)\nDefendant Lobby No. 1, before examining everything on prosecutor's bench in Courtroom No. 3\nTalk\n\n\n\n\n\n\n\n\n\nTyrell Badd\n\n\n\n\n\n\n\nBadd:\nYou're in the way, boy. Move.\nEdgeworth:\nYou look terribly busy, however, I was wondering what you're busy with.\nBadd:\nJust looking for something. It's got nothing to do with you...\nFranziska:\nWhat is with your terrible attitude...!?\nEdgeworth:\n(I guess I'm out of luck. I really should get back to what I need to do, anyway.)\nExamine\n\n\n\n\n\n\n\n\n\nTea dispenser\n\n\n\n\n\n\n\nFranziska:\nWhat an incredibly strong-scented herbal tea.\nEdgeworth:\nI fear that more than being relaxing, this scent may make one a bit heady instead.\nSeptember 10, 6:00 PM\nDistrict Court - Defendant Lobby No. 2\nEdgeworth:\nHm? That's Detective Badd... but who is he with...?\nFranziska:\nI've never seen that officer before.\nBadd:\nSo, did you find it...?\n???:\nNo, not yet, and I've looked everywhere.\nBadd:\nI see... Well, then... please continue with the search...\n???:\nUnderstood. I'll continue the search. Heh. So you're the one running this show. Prosecutors like you shouldn't even be allowed at crime scenes!\nEdgeworth:\nHow dare you!? Just who do you think you are...!? What was that all about, and who was that man just now!?\nFranziska:\nWhoever he was, I've never seen a more impudent officer in my life.\nEdgeworth:\n(Does he even know that we're standing right here behind him?)\nBadd:\n.........I know you're standing right behind me. What do you want... kids?\nEdgeworth:\n!\nFranziska:\nIt looks like you were paying attention after all.\nBadd:\n...Of course I was. ...I have eyes... in the back of my head...\nEdgeworth:\n(Ah, so that mirror isn't for vanity's sake... It's for him to keep an eye out on who or what is behind him at all times.) So tell me, Detective Badd, who was that rude man just now?\nBadd:\n...The guy came here... from the Republic of Zheng Fa to study... He's Agent Lang. He's trying everything he can... to revive the lost honor of his family... He's traveling the world... to study different philosophies of detainment... from scratch...\nEdgeworth:\nBy visiting various police departments around the world? He has a lot of dedication.\nBadd:\nHe's still just a rookie cop... but I sense a strong grudge of some sort from him. The guy's... more useful than Gumshoe. .........Even if he is rude.\nFranziska:\nWell, he sure has a lot of guts to come to this country and give prosecutors a hard time.\nEdgeworth:\n(I agree, however, I can think of one young lady that statement also applies to.) Anyway, what was that agent looking for, Detective Badd?\nFranziska:\nEarlier, that little girl was poking around in Lobby No. 1 as well.\nBadd:\n...Like I said before, it's got nothing to do with the two of you.\nEdgeworth:\nHmph... I highly doubt that it has nothing to do with me.\nBadd:\n...Hmph.\nEdgeworth:\n(Fine, if this is the game I must play, then I will take this opportunity... ...to draw out what he's been hiding and what happened in this room straight from him.)\nTalk\n\n\n\n\n\n\n\n\n\nTyrell Badd\n\n\n\n\n\n\n\nEdgeworth:\nEarlier, you were in Lobby No. 1, and now you're here in Lobby No. 2... You are quite the busy man, Detective Badd.\nBadd:\n\"Multiple returns to a crime scene brings [sic] about success\"... That's what we detectives say.\nEdgeworth:\nI see... In that case, you wouldn't mind if I asked about what happened again, correct?\nBadd:\nI don't have anything left to say to you, boy...\nEdgeworth:\n(Nngh! \"Boy\"!? You'll see. I WILL draw my answer from you, one way or another!)\nFranziska:\nWould it kill you to help us even a tiny bit in our investigation!?\nBadd:\n...I gave Faraday's notebook... ...to the Judge earlier... ...That's help enough... don't you think...?\nFranziska:\nArngh!\nEdgeworth:\nPlease, we are asking you for just a bit more of your cooperation.\nBadd:\n...Don't push me, kid...\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nTime of the murder\n\n\n\n\n\n\n\nEdgeworth:\nI'd like to ask once again about what happened around here at the time of the crime.\nBadd:\n...I refuse to answer. ...Any more investigating you do... would be a waste of time. Besides... how am I supposed to answer questions about things I don't know about?\nFranziska:\nThings you don't know about? But aren't you supposed to know everything?\nEdgeworth:\nHe should... (Wait, is it possible...? Maybe he doesn't know about the trick behind that piece of evidence! I should try showing it to him. It may prove to be the key to getting some answers from Detective Badd!)\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nKnife or Yatagarasu's Key\n\n\n\n\n\n\n\nLeads to:\n\"Detective Badd. Did you know of the existence of the item in this photograph?\"\n\n\n\n\nMr. Faraday's Organizer\n\n\n\n\n\n\n\nBadd:\nFaraday...\nEdgeworth:\nIt sounds like you lost someone close to you.\nBadd:\n...He was a battle-buddy. We fought through a lot together... A boy with a silver spoon in his mouth couldn't possibly understand society's dark underbelly.\nEdgeworth:\nGrr... (Although, honestly, I suppose he's right. I don't have anyone I relate to in that way... Well, it's not as though I long for someone like that... Nor am I good at getting close...)\nExamine\n\n\n\n\n\n\n\n\n\nClosed window\n\n\n\n\n\n\n\nEdgeworth:\n(The curtains are shut tight.)\nFranziska:\nThe color of those curtains is rather gloomy. For a place where people's lives are in the balance... ...they could've chosen to hang something a little more cheery, you know...?\nEdgeworth:\nI know, however, I think the designer had more things to think about than the lobbies.\nFranziska:\nHmph. Well, as a Von Karma... ...I would afford any location related to the law extra attention to detail.\nEdgeworth:\n(A bit obsessive, aren't we...)\nPartner\n\n\n\n\n\n\n\n\n\nNotice anything?\n\n\n\n\n\n\n\nFranziska:\nIt looks like Detective Badd is searching for something.\nEdgeworth:\nIndeed. I'm curious as to what it could be myself. (Maybe I should just ask him...)\nEdgeworth:\nDetective Badd. Did you know of the existence of the item in this photograph?\nBadd:\n...Hmph. Of course I did. It's my job to know everything related to the Yatagarasu case.\nEdgeworth:\nIn that case, let me ask you something. Did you know that the knife that killed Mr. Faraday and this Yatagarasu's Key... ...are one and the same?\nBadd:\nWhat!? ...That's impossible!\nFranziska:\nIt looks like he didn't know after all.\nEdgeworth:\nThe piece of evidence which we call the Yatagarasu's Key... ...is actually a well-camouflaged knife.\nBadd:\n......\nEdgeworth:\nMr. Faraday was planning to use this Yatagarasu's Key... ...to prove that Mr. Rell was not the real Yatagarasu. Isn't that correct?\nBadd:\nI guess so.\nEdgeworth:\nHowever, Mr. Faraday had no idea that it was, in fact, a knife.\nBadd:\nYeah, I have to admit, neither one of us knew that fact. And if neither of us knew, then no one in law enforcement knew either. How did we miss something as big as this!?\nEdgeworth:\nI noticed that since a little while ago, you appear [sic] to be searching for something. I presume that this key is what you were searching for.\nBadd:\n...! ...Yeah, that's right...\nEdgeworth:\nAnd why were you searching for it?\nBadd:\nBecause... I promised Faraday... I promised that I'd protect that key with my life... But after he was killed, the key disappeared from Faraday's evidence bag... Who would've thought... that the key... is what took Faraday's life...!?\nEdgeworth:\nDetective Badd. So that we may find the truth, please, testify for me once more.\nBadd:\n...Alright. But it doesn't matter how many times I tell you about what happened... Nothing'll change...\nTalk\n\n\n\n\n\n\n\n\n\nTyrell Badd\n\n\n\n\n\n\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nTime of the murder\n\n\n\n\n\n\n\nLeads to:\n\"Detective Badd. I ask that you please testify once more...\"\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nKnife or Yatagarasu's Key\n\n\n\n\n\n\n\nBadd:\nFaraday...\nEdgeworth:\nIt sounds like you lost someone close to you.\nBadd:\n...He was a battle-buddy. We fought through a lot together... A boy with a silver spoon in his mouth couldn't possibly understand society's dark underbelly.\nEdgeworth:\nGrr... (Although, honestly, I suppose he's right. I don't have anyone I relate to in that way... Well, it's not as though I long for someone like that... Nor am I good at getting close...)\nEdgeworth:\nDetective Badd. I ask that you please testify once more... ...about what happened in Lobby No. 2 and what you experienced in Lobby No. 1.\nBadd:\n...My answer is still the same. And this... is the last time I'm going to do this...\nEdgeworth:\nThat's fine, because I only need this one last time to clear everything up. (And find the truth behind this case!)\nTestimony\n-- Det. Badd's Movements --\nBadd:\n...I was in Lobby No. 1... talking with Yew.\n...We were talking about... some trivial things.\n...I heard the gunshot... right before the trial was about to reconvene.\nWhen we heard it, Yew and I immediately dashed out into the hallway together!\nI saw Gumshoe goofing around there... and then we all ran in to Lobby No. 2.\nFranziska:\nIt sounds like the exact same story he told us before...\nEdgeworth:\nIndeed. However, I feel that we have yet to draw out all the information that we can.\n\nEdgeworth: Edgeworth: Why did Ms. Yew choose Lobby No. 1? Badd: ......... Edgeworth: Answer me! Badd: ...Who knows. She just said that she had something she wanted to talk to me about... ...and we walked into Lobby No. 1 together... That's all... Edgeworth: (So his answer remains the same as before, I see...)\nEdgeworth: Edgeworth: I was hoping you could expand on what exactly you were discussing with Ms. Yew. Badd: ......... Trivial stuff... It was nothing important. Edgeworth: That's for me to decide. Badd: ......... Edgeworth: ......... Badd: ......... Edgeworth: (Alright, I suppose that's for him to decide. Moving on then.)\nEdgeworth: Edgeworth: Until you heard the gunshot, did you notice anything else that was out of the ordinary? Badd: ...I didn't hear any other strange sounds... until that gunshot... Edgeworth: (If the gunshot Detective Badd heard was really the one from the murder... ...that would give that other piece of evidence an entirely different meaning...!) I ask that you please amend your testimony with that statement just now! Badd: Sure... Adds statement \"...I didn't hear any other strange sounds... until that gunshot...\"\nEdgeworth: Edgeworth: Detective Badd... You honestly don't remember hearing anything else? Badd: ...Yeah. Edgeworth: Is it possible you were so involved in your conversation that you missed something? Badd: ...I've been a detective for a long time, and even if I were involved in something... ...I've got quite the habit of keeping tabs on everything that goes on around me... If there had been some other strange sound, you can be sure I would've heard it... Edgeworth: (Hmm... I suppose with this detective, that's probably very likely...) Badd: So, the gunshot...\nEdgeworth: Edgeworth: And why did the two of you dash out into the hallway straight away? Badd: ...Because we clearly heard the sound of a gunshot... And we knew it came from somewhere nearby... Edgeworth: And how did you know that it was a gunshot? Badd: Hmph... In my line of work, you hear enough of them to know. Edgeworth: (I suppose it's only natural for a detective to know what a real gunshot sounds like...) Badd: But given the circumstances... ...the only person I could think of whose life would've been in danger was Faraday. That's why I ran out into the hallway right away and headed for where he was...\nEdgeworth: Edgeworth: Detective Gumshoe was there in the hallway? Badd: Yeah... Edgeworth: Why didn't you attest to that earlier!? Badd: When I saw Gumshoe, it was after I had heard the gunshot. Having seen him then didn't change the fact that he still could've done the deed. Edgeworth: Arngh!\nEdgeworth: It sounds exactly like what Detective Badd told us before, however...\nFranziska: Is there something in particular we should be asking the detective about?\nEdgeworth: There just might be... (No one knew that the knife is actually the Yatagarasu's Key... Reflecting on that... ...perhaps there are other things that we know now, but Detective Badd doesn't yet. Yes, that should be my angle of attack!)",
      "testimonies": [
        {
          "testimony": "...I was in Lobby No. 1... talking with Yew.",
          "person": "Badd",
          "present": []
        },
        {
          "testimony": "...We were talking about... some trivial things.",
          "person": "Badd",
          "present": []
        },
        {
          "testimony": "...I heard the gunshot... right before the trial was about to reconvene.",
          "person": "Badd",
          "present": []
        },
        {
          "testimony": "...I didn't hear any other strange sounds... until that gunshot...",
          "person": "Badd",
          "present": [
            "Balloon Piece"
          ],
          "source": {
            "evidence_span": "Balloon popped by Kay. The Judge misheard its popping for a gunshot.",
            "testimony_span": "I didn't hear any other strange sounds",
            "is_self_contained": "yes",
            "context_span": ""
          }
        },
        {
          "testimony": "When we heard it, Yew and I immediately dashed out into the hallway together!",
          "person": "Badd",
          "present": []
        },
        {
          "testimony": "I saw Gumshoe goofing around there... and then we all ran in to Lobby No. 2.",
          "person": "Badd",
          "present": []
        }
      ],
      "summarizedContext": "The witness Portsman is describing his whereabouts at the time of the crime.",
      "noPresent": false,
      "labels": [
        "behavioral"
      ],
      "reasoning": [
        "Fact 1: The witness claims he did not hear any other strange sounds.",
        "Fact 2: The evidence suggests a balloon popped, making a sound similar to a gunshot.",
        "Prop 1: If a person hears a sound similar to a gunshot, they will not claim they did not hear any strange sounds."
      ]
    },
    {
      "category": "rebuttal",
      "newContext": "Badd:\n...I was in Lobby No. 1... talking with Yew.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nWhy did Ms. Yew choose Lobby No. 1?\nBadd:\n.........\nEdgeworth:\nAnswer me!\nBadd:\n...Who knows. She just said that she had something she wanted to talk to me about... ...and we walked into Lobby No. 1 together... That's all...\nEdgeworth:\n(So his answer remains the same as before, I see...)\nBadd:\n...We were talking about... some trivial things.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nI was hoping you could expand on what exactly you were discussing with Ms. Yew.\nBadd:\n......... Trivial stuff... It was nothing important.\nEdgeworth:\nThat's for me to decide.\nBadd:\n.........\nEdgeworth:\n.........\nBadd:\n.........\nEdgeworth:\n(Alright, I suppose that's for him to decide. Moving on then.)\nBadd:\n...I heard the gunshot... right before the trial was about to reconvene.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nUntil you heard the gunshot, did you notice anything else that was out of the ordinary?\nBadd:\n...I didn't hear any other strange sounds... until that gunshot...\nEdgeworth:\n(If the gunshot Detective Badd heard was really the one from the murder... ...that would give that other piece of evidence an entirely different meaning...!) I ask that you please amend your testimony with that statement just now!\nBadd:\nSure...\nAdds statement \"...I didn't hear any other strange sounds... until that gunshot...\"\nBadd:\n...I didn't hear any other strange sounds... until that gunshot...\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nDetective Badd... You honestly don't remember hearing anything else?\nBadd:\n...Yeah.\nEdgeworth:\nIs it possible you were so involved in your conversation that you missed something?\nBadd:\n...I've been a detective for a long time, and even if I were involved in something... ...I've got quite the habit of keeping tabs on everything that goes on around me... If there had been some other strange sound, you can be sure I would've heard it...\nEdgeworth:\n(Hmm... I suppose with this detective, that's probably very likely...)\nBadd:\nSo, the gunshot...\nPresent Balloon Piece\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Detective Badd... Does this balloon fragment remind you of anything?\"\nBadd:\nWhen we heard it, Yew and I immediately dashed out into the hallway together!\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nAnd why did the two of you dash out into the hallway straight away?\nBadd:\n...Because we clearly heard the sound of a gunshot... And we knew it came from somewhere nearby...\nEdgeworth:\nAnd how did you know that it was a gunshot?\nBadd:\nHmph... In my line of work, you hear enough of them to know.\nEdgeworth:\n(I suppose it's only natural for a detective to know what a real gunshot sounds like...)\nBadd:\nBut given the circumstances... ...the only person I could think of whose life would've been in danger was Faraday. That's why I ran out into the hallway right away and headed for where he was...\nBadd:\nI saw Gumshoe goofing around there... and then we all ran in to Lobby No. 2.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nDetective Gumshoe was there in the hallway?\nBadd:\nYeah...\nEdgeworth:\nWhy didn't you attest to that earlier!?\nBadd:\nWhen I saw Gumshoe, it was after I had heard the gunshot. Having seen him then didn't change the fact that he still could've done the deed.\nEdgeworth:\nArngh!\nEdgeworth:\nIt sounds exactly like what Detective Badd told us before, however...\nFranziska:\nIs there something in particular we should be asking the detective about?\nEdgeworth:\nThere just might be... (No one knew that the knife is actually the Yatagarasu's Key... Reflecting on that... ...perhaps there are other things that we know now, but Detective Badd doesn't yet. Yes, that should be my angle of attack!)\nEdgeworth:\nDetective Badd... Does this balloon fragment remind you of anything?\nBadd:\n...It's the same color... as the one Kay was holding...\nFranziska:\nOh? So you knew about that girl's balloon?\nBadd:\nYeah... I was sitting with her up in the gallery... During the recess... just before we split up, I filled that balloon up for her.\nEdgeworth:\nWell, as you may have already surmised, this piece did indeed come from Kay's balloon.\nBadd:\nSo? What about the balloon...?\nEdgeworth:\nI wonder if you might remember hearing this balloon pop at some point?\nBadd:\n...What are you getting at?\nEdgeworth:\nHmph... This fragment was found in the hallway, right in front of Lobby No. 2. Furthermore... ...it was the sound of this balloon popping that the judge mistook as a gunshot.\nBadd:\n...Oh? So the sound that the judge heard... was not actually a gunshot, huh...\nFranziska:\nOn top of that, His Honor said that he heard the balloon pop... ...about 20 minutes before the trial was to reconvene.\nEdgeworth:\nYes, which means that His Honor heard the balloon pop in the hallway... ...when you were in Lobby No. 1, Detective Badd! And if you were in Lobby No. 1 at that time... ...you were close enough that you should have heard the balloon popping as well!\nBadd:\n...So?\nEdgeworth:\nWh--!? Don't give me a \"So?\"!\nFranziska:\nWe just proved that there is a flaw in your testimony!\nBadd:\nThe crackling of the truth... is louder than the sound of your sweet naïveté cracking... And since you kids don't seem to know, let me fill you in on something! Did you ever stop to think why the doors and walls of this place seem so rugged? That's because they were designed to keep secrets from being leaked!\nFranziska:\nFranziska:\nWh-What... is that supposed to mean!?\nBadd:\n...The doors and walls are super thick... the windowpanes are double-layered... To top it all off... even the curtains are made of a special sound-absorbing material.\nEdgeworth:\n! Then, you mean...!?\nBadd:\nSince I was shut up inside Lobby No. 1, there was no way I could've heard that sound!\nFranziska:\nN-No!\nEdgeworth:\nGnnrk! (I knew that's what he was going to say!)\nFranziska:\nThen that means that scruff-face's testimony is completely useless! If the rooms are soundproof, then of course he wouldn't hear any sign of a struggle!\nEdgeworth:\nNnghooooh!\nBadd:\n...That's also why it's only natural... ...that I didn't hear the balloon popping... ...Now do you get it... kids?\nFranziska:\nMiles! I thought WE were supposed to be the ones finding flaws in his logic... ...not the other way around!\nEdgeworth:\nThe... other way around...? (It's not possible to hear the sound of a balloon popping if one were in Lobby No. 1. However, if we examine this situation in reverse... ...a person standing in the hallway should not be able to hear the real gunshot either. And yet, Detective Gumshoe claims to have heard it while he was standing in the hallway.) Detective Badd... If that is the case, how exactly did you hear the gunshot?\nBadd:\n...What do you mean, \"how\"...? I just did...\nEdgeworth:\nHmph... It would appear... ...that you have yet to realize the contradiction in your own words.\nBadd:\n...Oh? How so...?\nEdgeworth:\nIf the rooms are as soundproof as you say they are... ...then how did the sound of the gunshot enter your ears?\nBadd:\n...! I see what you mean... I guess I'm more out of it... from Faraday's murder than I had thought...\nFranziska:\nWhich means what, exactly, Miles!? In the end, what does it all boil down to!?\nEdgeworth:\nIt boils down to this: There must be a reason... ...as to how detectives Badd and Gumshoe heard a gunshot they theoretically couldn't have.\nFranziska:\nIt looks like we need to examine the state of the crime scene again, huh?\nEdgeworth:\n...! (The state of the crime scene...? Wait! Can it be...!?)\nBadd:\n...It's that ultra-strong perfume Yew wears... She spilled (Dissipating the smell - A window in Lobby No. 1 was opened to allow the perfume Ms. Yew spilled to dissipate.) some of it...\nGumshoe:\nUwaah! And way too noisy (Very loud television - Lobby No. 2's television. It looks like it was set to an incredibly high volume.)!\nFranziska:\nThe surveillance video...? How could a piece of evidence just disappear (Missing evidence - Where did the surveillance tape from Mr. Faraday's bag disappear off to?)? Where did it go?\nConnect \"Lobby No. 2 window\" and \"Dissipating the smell\" Logic\n\n\n\n\n\n\n\nLeads to:\n\"It's simply not possible for the killer to have escaped through barred windows...\"\nEdgeworth:\n(It's simply not possible for the killer to have escaped through barred windows... ...and yet, the fragrance of the perfume managed to escape from Defendant Lobby No. 1. Of course! Incorporeal things can move freely through these open, barred windows (Open windows - The criminal couldn't have made it through, but what about incorporeal things?)!)\nConnect \"Very loud television\" and \"Open windows\" Logic\n\n\n\n\n\n\n\nLeads to:\n\"Now then, what else besides a smell can go both in and out of an open, barred window...?\"\nEdgeworth:\n(Now then, what else besides a smell can go both in and out of an open, barred window...? The answer... is sound! So, no matter how careful the killer was, if the windows were open, the jig would be up. And since the windows in both Defendant Lobby No. 1 and the hallway were open... ...that explains how the sound of a gunshot could be heard (Gunshot could be heard - Windows were open, so the gunshot could be heard, but where did it originate from?) in both locations!)\nConnect \"Missing evidence\" and \"Gunshot could be heard\" Logic\n\n\n\n\n\n\n\nLeads to:\n\"The missing piece of evidence is a video...\"\nEdgeworth:\n(The missing piece of evidence is a video... ...that shows the moment in which Mr. Rell killed the Embassy staff member. The sound of the gunshot left quite an impression on me when it was played during the trial. The video should have been returned to Mr. Faraday's evidence bag for the recess... ...and brought back here. If it disappeared after that time... ...then it's possible that the tape is still here in this room. Eureka! The evidence that the missing evidence created for me... ...is the gunshot sound that no one should've been able to hear in the first place!)\nFranziska:\nMiles... What have you been thinking about? Stop wasting time thinking, and let's start looking again!\nEdgeworth:\nIt's not a waste of time to think, for I have figured out where we should look.\nFranziska:\nAnd where would that be!?\nEdgeworth:\nI believe we should examine... the television!\nBadd:\nThe TV...? ...Well, you kids have fun... Go ahead and examine whatever you like...\nBegin Investigation\nDefendant Lobby No. 2\nLeads to examination of open window/TV\nTalk\n\n\n\n\n\n\n\n\n\nTyrell Badd\n\n\n\n\n\n\n\nBadd:\n...Go ahead and do your investigating. Just don't mess up the crime scene... ...You hear me, boy?\nExamine\n\n\n\n\n\n\n\n\n\nOpen window or TV\n\n\n\n\n\n\n\nEdgeworth:\n(I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\nVideo player\n\n\n\n\n\n\n\nLeads to:\n\"It's a video player...\"\n\n\n\n\nOpen window\n\n\n\n\n\n\n\nEdgeworth:\nThe window is wide open.\nFranziska:\nThe scent of flowers is being blown in from the outside. I think it softens the heavy air in here somewhat.\nEdgeworth:\nHmm... Windows in both Lobby No. 1 and No. 2 were opened.\nFranziska:\nMaybe they were trying to air out the room, just like in Lobby No. 1. Or maybe they sought to ease some of the tension through some fresh air.\nEdgeworth:\nWith Mr. Faraday and Mr. Rell in the same room, I imagine the latter to be the case. (But was there really a need to open the window just for that?)\n\n\n\n\nTV monitor\n\n\n\n\n\n\n\nEdgeworth:\nEarlier, when Detective Gumshoe touched this... ...it made a most terrible racket.\nFranziska:\nYou mean when Scruffy turned the television on, right?\nEdgeworth:\nActually, come to think of it... ...I don't think Detective Gumshoe actually touched the television at all. Furthermore... ...it seemed more like when a video feed suddenly stops. ...At least, it did to me.\nFranziska:\nI wonder why that is...?\nPartner\n\n\n\n\n\n\n\n\n\nNotice anything?\n\n\n\n\n\n\n\nFranziska:\nWe've already checked everything in Lobby No. 2, you know!\nEdgeworth:\nNot quite. There is still one more thing we have yet to thoroughly inspect. Because Detective Badd gave Detective Gumshoe an angry lecture for touching it... ...no one has examined it since.\nFranziska:\nAre you talking about the television?\nEdgeworth:\nPrecisely. And that is where I believe the last piece of evidence awaits us!\nEdgeworth:\nIt's a video player... And there seems to be a video tape inside.\nFranziska:\nIt looks like it. The tape must have stopped on its own when it reached the end.\nEdgeworth:\nThis tape... Could it not be the missing surveillance tape?\nFranziska:\n...! I suppose, but...!\nEdgeworth:\nDetective Badd, would it be alright with you if I verified the contents of this video?\nBadd:\nSure... Knock yourself out...\nFranziska:\nAlright, then let's rewind this and see what we have.\nBadd:\nIf I remember correctly... the footage of Rell killing the Embassy staff member... ...should be at about... the 30 minute mark... from the start of the tape...\nEdgeworth:\nUnderstood. This should be about right. Now then, let's see...\nFranziska:\nNngh... This is...! This is the footage of Mr. Rell shooting the Embassy staff member...!\nEdgeworth:\nI knew it... The missing piece of evidence, the surveillance video, was here all along!\nSurveillance Video data jotted down in my Organizer.\nBadd:\n...This sound... What's the meaning of this...?\nEdgeworth:\n(It appears that Detective Badd has figured out the true source of the gunshot he heard!) With this, I think we can figure out the trick behind this double murder!\nFranziska:\n! Do you mean that you've figured it all out, then?\nEdgeworth:\nYes. All I have to do now... ...is show what the gunshot detectives Badd and Gumshoe heard was... ...and through where they heard it from!\nFranziska:\n.........Nngh! Fine! In that case, show me what you've deduced!\nLeads to examination of open window/TV\nExamine\n\n\n\n\n\n\n\n\n\nOpen window or TV\n\n\n\n\n\n\n\nEdgeworth:\n(Now, to show what the gunshot detectives Badd and Gumshoe heard was... ...and through where they heard it from! I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\nExamine\n\n\n\n\n\n\n\n\n\nOpen window\n\n\n\n\n\n\n\nEdgeworth:\n(Just as with the spilled perfume in Lobby No. 1... ...if the windows were open, that piece of evidence's sound would also dissipate out...! Now, to show what the gunshot detectives Badd and Gumshoe heard was... ...and through where they heard it from!)\n\n\n\n\nVideo player\n\n\n\n\n\n\n\nFranziska:\nSo someone left this video on play the whole time, huh?\nEdgeworth:\nI suppose so... Other than the killing, there's hardly a sound on the rest of tape.\nFranziska:\nThen why did the television make that loud noise when Scruffy got near it?\nEdgeworth:\nThat's probably because the tape had run out and stopped its playback.\nFranziska:\n...It's not just bad luck, that detective has the worst timing in the world, too.\nEdgeworth:\n(Someone purposefully left this video on play... The question is \"why\"...?)\n\n\n\n\n\nDeduce open window\n\n\n\n\n\n\n\nEdgeworth:\n(Is this spot somehow connected to any of the evidence I hold...?)\n\n\n\nPresent Surveillance Video\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"If the door and windows to the crime scene, namely, this room that we're in, were closed...\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThis piece of evidence... will clear away the last remaining contradiction in this case!\nFranziska:\nMiles... I believe that piece... ...may actually be proof of a different last of sorts. It proves that today... will be your last day as a prosecutor!\nEdgeworth:\nGnnrk! (It appears that I've made a mistake... However, I know that the last riddle and its answer lies [sic] somewhere within this room! I need to calm down and think it through once more.)\nLeads back to examination of open window/TV\nPartner\n\n\n\n\n\n\n\n\n\nCrime scene oddity\n\n\n\n\n\n\n\nFranziska:\nSo the evidence that we thought to be missing was actually at the crime scene.\nEdgeworth:\nThis surveillance video was placed into the video player by someone.\nFranziska:\nPerhaps it was Mr. Faraday. Maybe he wanted to check something on it.\nEdgeworth:\nThat is very plausible. However, if that were the case, it raises an interesting question.\nFranziska:\nOh?\nEdgeworth:\nI'm sure you remember what happened. When that detective went to turn the television on, it made an incredibly loud sound. If you had simply wanted to check something, would you have set the volume so high?\nFranziska:\nI suppose not.\nEdgeworth:\nIf you can understand that much, the rest is easy.\nFranziska:\nWell, don't keep me waiting... Explain this crime scene's biggest contradiction to me, now!\nEdgeworth:\nHmph. With pleasure.\nEdgeworth:\nIf the door and windows to the crime scene, namely, this room that we're in, were closed... ...the killer could've used the gun and no one would've been the wiser.\nFranziska:\nThat's true. This courthouse does seem to be well-designed for such a thing, as it were.\nEdgeworth:\nHowever, what happened in reality was... ...Detective Gumshoe, Detective Badd, and Ms. Yew... All three of them heard the gunshot.\nFranziska:\nWell, the windows in Lobby No. 1, No. 2, and the hallway were open... ...so naturally, the people in those locations could hear it.\nEdgeworth:\nAh, but then, why would the criminal open the window in the first place?\nFranziska:\n...To allow the gunshot to be heard... I suppose.\nEdgeworth:\nCorrect. That's the only logical conclusion we can draw from this.\nFranziska:\nBut why was that necessary in the first place? I want a real answer, Miles! I demand satisfaction!\nEdgeworth:\nVery well. I believe that the killer wanted to manipulate our perception of a certain fact. (What was it that the killer wanted to manipulate our perception of?)\nCrime scene\n\n\n\n\n\n\n\nEdgeworth:\nThe killer wanted to manipulate our thoughts regarding the real crime scene.\nFranziska:\nSo you're suggesting... that the killing really took place in a different location?\nEdgeworth:\nYes.\nFranziska:\nIn that case, would you care to explain to me how someone... ...was able to carry two adult, male bodies all the way here without anyone noticing? Furthermore, given that the scruff-face was in the hallway the entire time... ...I believe you've just created your own contradiction, Miles.\nEdgeworth:\nY-Yes, well... (I suppose a mistake is a mistake... However, the whole reason why the killer left the window open... Was it not to mislead us on that particular fact...?)\nLeads back to:\n\"What was it that the killer wanted to manipulate our perception of?\"\nWhen the crime took place\n\n\n\n\n\n\n\nLeads to:\n\"The killer wanted to fabricate the time of death to their precise wishes!\"\nMurder weapon\n\n\n\n\n\n\n\nEdgeworth:\nThe killer wanted to manipulate our thoughts regarding the murder weapon.\nFranziska:\nMiles... We already know that the murder weapons... ...are genuine! The forensic scientists have already proven that!\nEdgeworth:\nNngh! (It would appear that I've made a miscalculation... However, the whole reason why the killer left the window open... Was it not to mislead us on that particular fact...?)\nLeads back to:\n\"What was it that the killer wanted to manipulate our perception of?\"\nEdgeworth:\nThe killer wanted to fabricate the time of death to their precise wishes! And they used the gunshot in the surveillance video to do so!\nFranziska:\n! So that's why the tape was left running!\nBadd:\nYou mean... the gunshot I heard... was from this video!?\nEdgeworth:\nYes. Which means that the murders really occurred at an earlier time than we thought!\nBadd:\n..................!\nEdgeworth:\n(It must have been during the recess, but before Detective Gumshoe was on guard duty. Someone who has no alibi for that time period... ...and planned this crime out in advance... That person is the real killer...!)\nInvestigation Complete\nBailiff:\nMr. Edgeworth!\nEdgeworth:\nYes, what is it?\nBailiff:\nMs. Yew is asking for you. She's in the courtroom. She says that she's identified the murderer, but that she wants to clarify something...\nFranziska:\nIt looks like Ms. Yew is still investigating something.\nEdgeworth:\nUnderstood. Please tell her that I will be right over.\nBadd:\n...I'll come along. I want to hear what she has to say...\nEdgeworth:\nIt would appear that the time has come... to uncover the truth!\nTo be continued\n3rd Floor Lobby, before presenting Knife or Yatagarasu's Key and clearing Talk option with Tyrell Badd\nTalk\n\n\n\n\n\n\n\n\n\nCalisto Yew\n\n\n\n\n\n\n\nYew:\nWhat is it, Edgeworth?\nEdgeworth:\nNngh... Nothing in particular, however...\nYew:\nPhwwh...! \"Nngh,\" he says!\nEdgeworth:\nNngh...?\nYew:\nAhahaha! You did it again! What IS that supposed to be? Your mating call!?\nEdgeworth:\n(I-Is everything I do humorous to this woman?)\nYew:\nLook, Edgeworth, I'm incredibly busy right now. I've got a mountain of things to figure out and check up on. If you want to talk, you're just going to have to wait until later, OK?\nEdgeworth:\n(Hmph. I'll just continue with my investigation, then.)\nPartner\n\n\n\n\n\n\n\n\n\nNotice anything? (when not in Defendant Lobby No. 2)\n\n\n\n\n\n\n\nFranziska:\nIt looks like Detective Badd is searching for something.\nEdgeworth:\nIndeed. I'm curious as to what it could be myself. (Maybe I should just ask him... Detective Badd should still be in Defendant Lobby No. 2... (removed in 2024 re-release))\nSeptember 10, 6:15 PM\nDistrict Court - Courtroom No. 3\nEdgeworth:\nKay... What are you doing here?\nKay:\nOh, hello, mister! I'm still investigating!\nEdgeworth:\nBut the object you're looking for has already...\n???:\nBadd:\nKay... don't mind him... Please continue with your investigation...\nKay:\nOK! You got it!\nEdgeworth:\n...Detective Badd, haven't we already found what you were looking for?\nBadd:\nIf it means I can keep her in the dark just a little longer... any little task will do.\nFranziska:\nOh? You're more sympathetic than I thought.\nBadd:\n.........Hmph...\nYew:\nI've been waiting for you, Edgeworth.\nEdgeworth:\nI've also been waiting... for the moment in which we can finally lay this case to rest.\nYew:\n...Phwwh! Ahahahahaha! \"The moment in which we can finally lay this case to rest\"? Wasn't that when we placed Detective Gumshoe under arrest...? Phwwwwwh. I think we've more than solved this case already... Phwwwwhhkkk... Don't you?\nFranziska:\nWe'll see. It all depends on whether or not your logic holds.\nYew:\nOh, I see we even have a viewer in the gallery! And... why, even Mr. Badd is here!\nFranziska:\nA... A viewer in the gallery!? I'm hardly just a by-stander!\nBadd:\n...I have a duty... to see this case through to the end... No matter how it turns out...\nYew:\n.........Oh? Is that right? Anyway... I thought you might like to hear what I've slaved away to find out. I've taken statements on every single person's movements... ...during the time when our suspect was in the hallway. I also confirmed that there is no possible route of escape from Lobby No. 2. Therefore, the killer must without a doubt be... Detective Gumshoe!\nEdgeworth:\nAnd that's all you have?\nYew:\nYeah, that's all there is to my conclusion, and this case!\nEdgeworth:\nSorry, but I beg to differ. In a trial, there is always time for a rebuttal, and we ARE standing in a court of law. It'd be more than appropriate to follow the rules of court, in this case, don't you think?\nYew:\nPhwwh... Ahahahahahaha! How absolutely like a rookie to think such a thing. But alright... I'll play along and give you a proper testimony.\nEdgeworth:\n(If my logic is correct, then I've already won. All I have to do now is to prove it... by showing who the real killer is!)\nArgument\n-- Ms. Yew's Argument --\nYew:\nEveryone, sans the suspect, has an alibi for when the gun went off.\nFurthermore, the areas around the crime scene have all been thoroughly investigated, right?\nI also confirmed that there is no possible escape route from Lobby No. 2.\nWhich leaves us with one unshakable conclusion, that Detective Gumshoe is the killer.\nYew:\nPhwwwh... Now that you have your testimony. I expect a good rebuttal, Edgeworth.\nEdgeworth:\n...Hmph, but of course. (There is no need to confront her logic head on right now. I should instead focus on drawing out any trump cards she has up her sleeve.)\n\nEdgeworth: Edgeworth: The suspect...? But I thought that Detective Gumshoe's alibi has already been proven. Yew: Ahahahahahahaha! Are you joking, Edgeworth? Edgeworth: I assure you, this is no joke. Yew: Look, I know you heard from the judge earlier... ...that the detective was in the hallway with Mr. Faraday's daughter eating a Swiss roll. Edgeworth: Yes, that is correct. Yew: But see, that was 20 minutes before the real gunshot went off, right? And the problem is, there's no one else who can corroborate what he did since the snacking. Edgeworth: Hmm... (I see she's done her research well. Before pressing all other statements Edgeworth: (Which means that I should focus on drawing out whatever trump cards she's withholding.) Leads back to rebuttal After pressing all other statements Leads to: \"Hmm... I suppose we've really reached the end now.\" Edgeworth: (Which means that I should focus on drawing out whatever trump cards she's withholding.) Leads back to rebuttal Leads to: \"Hmm... I suppose we've really reached the end now.\"\nEdgeworth: Edgeworth: Whether they have been thoroughly investigated or not is for me to decide. Yew: Phwwwwh... Ahahahahaha! The scrunched eyebrows and lines on your forehead are back! Anyway, even if you believe it hasn't been exhaustive, the crime scene, Lobby No. 2... ...has no way out other than the hallway Detective Gumshoe was standing in. And because he claimed to be there, that makes him the only possible suspect! Edgeworth: But isn't it also possible that someone escaped through a window and into the garden? Yew: Phwwwwwwwwwwwh! Ahahahahahahahahahahahahaha! That's the first place everyone looked, silly! The police aren't a bunch of lazy bums! They looked into every possibility, you know. Isn't that right, Mr. Badd? Badd: .........Yeah. There wasn't a scrap of evidence... to suggest someone used... one of the windows... There also weren't... any footprints or anything... in the courtyard garden... Edgeworth: (I suppose they really did check everything that could be relevant to the case.)\nEdgeworth: Edgeworth: Are you absolutely positive that there are no possible routes of escape? Yew: Of course I'm sure. Edgeworth: And why are you so certain? Yew: This is a courthouse, the place where criminals are brought to be judged. If there was [sic] (changed from [were] in the original release) an escape route, I'm sure every criminal would be using it to escape. It's just common sense! Phwwh,,, Ahahahahahahahaha! Franziska: Miles Edgeworth! I suggest you use a bit more of it in the future! Edgeworth: Gnnrk!\nEdgeworth: Edgeworth: You may think it's unshakable, but to me, there are still too many unanswered questions. For example, who was it that placed the gun in Mr. Faraday's hand? Yew: Ahahahahahahaha! But you're the only one still wondering that! Detective Gumshoe probably had no idea which hand Mr. Faraday used to write with. Even if you know someone, it doesn't mean you'll know which hand they write with, right? I mean... I certainly don't care about that sort of thing. Ahahahah! Edgeworth: Hmph... (I'm not about to let her get a rise out of me with such a flippant statement. Before pressing all other statements Edgeworth: (Besides which, my first order of business is to press more information out of her!) Leads back to rebuttal After pressing all other statements Leads to: \"Hmm... I suppose we've really reached the end now.\" Edgeworth: (Besides which, my first order of business is to press more information out of her!) Leads back to rebuttal Leads to: \"Hmm... I suppose we've really reached the end now.\"\nEdgeworth: (There is no need to confront her logic head on right now. I should instead focus on drawing out any trump cards she has up her sleeve.)",
      "testimonies": [
        {
          "testimony": "Everyone, sans the suspect, has an alibi for when the gun went off.",
          "person": "Yew",
          "present": []
        },
        {
          "testimony": "Furthermore, the areas around the crime scene have all been thoroughly investigated, right?",
          "person": "Yew",
          "present": []
        },
        {
          "testimony": "I also confirmed that there is no possible escape route from Lobby No. 2.",
          "person": "Yew",
          "present": []
        },
        {
          "testimony": "Which leaves us with one unshakable conclusion, that Detective Gumshoe is the killer.",
          "person": "Yew",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "rebuttal",
      "newContext": "Yew:\nEveryone, sans the suspect, has an alibi for when the gun went off.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThe suspect...? But I thought that Detective Gumshoe's alibi has already been proven.\nYew:\nAhahahahahahaha! Are you joking, Edgeworth?\nEdgeworth:\nI assure you, this is no joke.\nYew:\nLook, I know you heard from the judge earlier... ...that the detective was in the hallway with Mr. Faraday's daughter eating a Swiss roll.\nEdgeworth:\nYes, that is correct.\nYew:\nBut see, that was 20 minutes before the real gunshot went off, right? And the problem is, there's no one else who can corroborate what he did since the snacking.\nEdgeworth:\nHmm... (I see she's done her research well.\n\n\n\nBefore pressing all other statements\n\n\n\n\n\n\n\nEdgeworth:\n(Which means that I should focus on drawing out whatever trump cards she's withholding.)\nLeads back to rebuttal\n\n\n\n\nAfter pressing all other statements\n\n\n\n\n\n\n\nLeads to:\n\"Hmm... I suppose we've really reached the end now.\"\nYew:\nFurthermore, the areas around the crime scene have all been thoroughly investigated, right?\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nWhether they have been thoroughly investigated or not is for me to decide.\nYew:\nPhwwwwh... Ahahahahaha! The scrunched eyebrows and lines on your forehead are back! Anyway, even if you believe it hasn't been exhaustive, the crime scene, Lobby No. 2... ...has no way out other than the hallway Detective Gumshoe was standing in. And because he claimed to be there, that makes him the only possible suspect!\nEdgeworth:\nBut isn't it also possible that someone escaped through a window and into the garden?\nYew:\nPhwwwwwwwwwwwh! Ahahahahahahahahahahahahaha! That's the first place everyone looked, silly! The police aren't a bunch of lazy bums! They looked into every possibility, you know. Isn't that right, Mr. Badd?\nBadd:\n.........Yeah. There wasn't a scrap of evidence... to suggest someone used... one of the windows... There also weren't... any footprints or anything... in the courtyard garden...\nEdgeworth:\n(I suppose they really did check everything that could be relevant to the case.)\nYew:\nI also confirmed that there is no possible escape route from Lobby No. 2.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nAre you absolutely positive that there are no possible routes of escape?\nYew:\nOf course I'm sure.\nEdgeworth:\nAnd why are you so certain?\nYew:\nThis is a courthouse, the place where criminals are brought to be judged. If there was [sic] (changed from [were] in the original release) an escape route, I'm sure every criminal would be using it to escape. It's just common sense! Phwwh,,, Ahahahahahahahaha!\nFranziska:\nMiles Edgeworth! I suggest you use a bit more of it in the future!\nEdgeworth:\nGnnrk!\nYew:\nWhich leaves us with one unshakable conclusion, that Detective Gumshoe is the killer.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou may think it's unshakable, but to me, there are still too many unanswered questions. For example, who was it that placed the gun in Mr. Faraday's hand?\nYew:\nAhahahahahahaha! But you're the only one still wondering that! Detective Gumshoe probably had no idea which hand Mr. Faraday used to write with. Even if you know someone, it doesn't mean you'll know which hand they write with, right? I mean... I certainly don't care about that sort of thing. Ahahahah!\nEdgeworth:\nHmph... (I'm not about to let her get a rise out of me with such a flippant statement.\n\n\n\nBefore pressing all other statements\n\n\n\n\n\n\n\nEdgeworth:\n(Besides which, my first order of business is to press more information out of her!)\nLeads back to rebuttal\n\n\n\n\nAfter pressing all other statements\n\n\n\n\n\n\n\nLeads to:\n\"Hmm... I suppose we've really reached the end now.\"\nEdgeworth:\n(There is no need to confront her logic head on right now. I should instead focus on drawing out any trump cards she has up her sleeve.)\nAfter pressing all statements:\nEdgeworth:\n(Hmm... I suppose we've really reached the end now. I already have my trump card ready. All that remains is to play it! But before I do... ...I think I should inquire into a little something about her argument.) You said earlier that you confirmed the alibis of every person other than the suspect. However, I don't recall either Franziska or myself speaking with you about the subject.\nYew:\nAh, but there were witnesses. For you, there is your mentor who gave you an alibi.\nEdgeworth:\nI see...\nYew:\nAs for the little missy... Phwwwwh... She came to the courthouse during the recess... ...phwwh... and was stopped by a security guard... at the door to the hallway... She gave him quite a whipping for that, or so I heard.\nFranziska:\n...! I'm the daughter of Manfred von Karma. And I will not be forcibly stopped by a guard, or a bailiff, or anyone else!\nEdgeworth:\n(Wait, so basically, the only reason Franziska bothered to show up today... ...was because she found out that I was to be the replacement prosecutor...?) By the way, Ms. Yew... ...what about everyone's alibis before Detective Gumshoe was assigned to guard duty?\nYew:\nWhat about them?\nEdgeworth:\nHave you looked into what people were doing during that span of time?\nYew:\nPhwwwh... What kind of idiot do you take me for? It doesn't matter when the killer went into Lobby No. 2. From the time we heard the gunshot... ...to the time Mr. Badd and I arrived on the scene as we dashed from Lobby No. 1... ...the only person who could've committed the crime was Detective Gumshoe!\nEdgeworth:\nYes, let's talk about when you and Detective Badd heard that gunshot, shall we? I suppose that if we go by your logic, then Detective Gumshoe is the only one. However, what if the crime had occurred... ...at an entirely different time than when that gunshot you heard went off? What then?\nYew:\n...!\nEdgeworth:\nThat gunshot was a trap meant to manipulate our perception of when the crime took place\nYew:\nYew:\nSadly, your explanation is very lacking, Edgeworth. The gunshot we heard in Lobby No. 1... Care to explain how that could've been fabricated?\nPresent Surveillance Video\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"That tape...!?\"\nPresent anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nIt was fabricated through this, of course.\nYew:\nPhwwwwh! Ahahahahaha! It's a joke, I get it! Your deadpan delivery is great! Of course, if you're actually serious... well, that's less of a laughing matter.\nEdgeworth:\nArngh! (Alright, so I was mistaken! The gunshot they heard in Lobby No. 1... What was it that they mixed it up with...? All I have to do is present that piece of evidence!)\nLeads back to:\n\"The gunshot we heard in Lobby No. 1...\"\nYew:\nThat tape...!?\nEdgeworth:\nYes, it's exactly what you think it is. This is the surveillance tape of Mr. Rell the prosecution presented in today's trial. This was found loaded in the video player in Lobby No. 2... ...that was connected to the large television that had its volume turned all the way up.\nYew:\nYou can't honestly mean that the sound we heard was the gunshot in the video...\nEdgeworth:\nAh, but I do. Which leads me to my next point. The murders occurred much earlier than when anyone heard the \"gunshot\"!\nYew:\n...!\nBadd:\n...That's the only thing I can think of, too...\nEdgeworth:\nAfter committing double homicide... ...the killer took the surveillance video out from Mr. Faraday's evidence bag... ...turned the television's volume all the way up, and left the video to play. If played from the beginning, it would take 30 minutes for the gunshot sound to come on. And since we now know that this method of time manipulation is possible... ...it opens up the possibility that the killer is someone other than Detective Gumshoe!\nYew:\nYew:\nSounds from a television doesn't [sic] amount to much here. But of course, Mr. Prosecutor Edgeworth, and Little Miss von Karma... ...already knew that much from the very beginning, right?\nFranziska:\nO-Of course we knew! Didn't we, Miles!?\nEdgeworth:\nYes, of course. We know about the soundproof quality of this courthouse's rooms. (Of course, I'm not about to admit we had no idea until only a little while ago...)\nYew:\nThat's right, and if the rooms are soundproof, then we should not have been able to hear it. And yet, we heard the gunshot clear as day!\nEdgeworth:\n.........And?\nYew:\nA-And!? Th-That's it, end of story!\nEdgeworth:\nHmph... But it's not.\nYew:\n!\nEdgeworth:\n(How should I explain why she was able to hear a gunshot from a soundproof room?)\nThe door was open.\n\n\n\n\n\n\n\nEdgeworth:\nThe door to Lobby No. 1 was open!\nYew:\nPhwwh! Phww......... Ahahahahahahahaha! You... You really... phwwwh... love to make me laugh, don't you? Sorry, but the door to Lobby No. 1 where Mr. Badd and I were was closed tight. Isn't that right, Mr. Badd?\nBadd:\n...Yeah.\nEdgeworth:\nWh--!? (I was mistaken...?)\nFranziska:\nMiles Edgeworth... you have sullied the name of Von Karma. That logic just now... ...was unforgivably bad!\nEdgeworth:\nArngh! (I need to carefully think this through once more... There is a reason as to why they were able to hear it so clearly. Now then...)\nLeads back to:\n\"How should I explain why she was able to hear a gunshot from a soundproof room?\"\nThe window was open.\n\n\n\n\n\n\n\nLeads to:\n\"There is, actually, one common point between Lobby No. 1 and Lobby No. 2.\"\nThere was a hole in the wall.\n\n\n\n\n\n\n\nEdgeworth:\nThere was a hole in the wall!\nFranziska:\nMiles, I don't think that such a hole exists. Because if it did, I think the two of them would've noticed the crime going on next door!\nYew:\nAhahahahahahaha! That's exactly right! Besides, if there's a hole to be found, it's probably in your logic.\nFranziska:\nHmph... I was just thinking the exact same thing.\nEdgeworth:\nGnnrk! (Whose side are you on, Franziska!? I need to carefully think this through once more... There is a reason as to why they were able to hear it so clearly. Now then...)\nLeads back to:\n\"How should I explain why she was able to hear a gunshot from a soundproof room?\"\nEdgeworth:\nThere is, actually, one common point between Lobby No. 1 and Lobby No. 2. And it is that despite the fact that both rooms have air conditioners installed... ...a window was open in each!\nYew:\n...!\nEdgeworth:\nNow, we know that the window in Lobby No. 2 was opened by the killer... ...however, a window in Lobby No. 1 was also opened.\nYew:\nYew:\nAhaha! It's probably just coincidence that they were both open at the time.\nEdgeworth:\nEdgeworth:\nHmph. It was no mere coincidence, I assure you. (Why was the window opened in Lobby No. 1? The answer is that a certain person did something to cause the window to be opened. And the person who triggered that action... that person is the real guilty party! The real killer in this double murder is...!)\nPresent Calisto Yew profile\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Ms. Calisto Yew!\"\nPresent anyone else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThis person... is the real culprit behind this case!\nFranziska:\nWhat sort of nonsense...!? Be serious here, Miles Edgeworth!\nEdgeworth:\nArngh! (That must not be the correct person... I must carefully think this through once more.)\nLeads back to:\n\"Why was the window opened in Lobby No. 1?\"\nEdgeworth:\nMs. Calisto Yew! I hereby formally indict you of the murder of Mr. Faraday and Mr. Rell!\nBadd:\n...!\nFranziska:\nWhat!?\nYew:\nY...You indict... me!?\nFranziska:\nAre you serious, Miles!? Why do you think she is the killer...!?\nEdgeworth:\nI don't understand her motive just yet... ...but of course I'm serious. Because she is the only one who could've done it. Well, Ms. Yew. Do you still feel like laughing now?\nYew:\nHa, hahaha... Of course I do, Edgeworth.\nEdgeworth:\n! (My argument must not be tight enough yet...)\nYew:\nAlthough, I never thought things would spiral into this. But I'll have you know I'm enjoying this dance... quite a bit! I guess this means it's time for my own rebuttal now, right?\nTestimony\n-- Ms. Yew's Rebuttal --\nYew:\nYou argue that the window was opened, however, do you have proof it was I who did that?\nFurthermore, do you have proof that the tape was used in committing the crime?\nFrankly, I'm shocked at you for going around accusing people of murder like this.\nEspecially with logic as full of holes as yours!\nEdgeworth:\n(This is where it really starts. I mustn't let my guard down for even a second, or the truth will blow away. Now is the time to put the patented Von Karma \"perfect proof\" to the test!)\n\nEdgeworth: Edgeworth: Evidence? All I'd need to do is have some prints analyzed and we'd know straight way! Yew: Hmph... Be my guest. Edgeworth: (She sounds as though she has the room to maneuver... which means... ...even if we were able to lift prints, they'd only show that it was someone else, but... ...why that someone else was forced to open the window... hmph, that's simple logic. Why don't I try presenting that piece of evidence? I have nothing to lose.) Yew: Phwwwwwh, what's wrong? The scrunched eyebrows, lines on your forehead, they're all back! More importantly, are you going to be OK not running a fingerprint analysis? Edgeworth: Yes, I'll be fine. Yew: Oh! Well, in that case, I'll just continue with my testimony, alright?\nEdgeworth: Edgeworth: I thought I just proved that it was. Yew: Sure you proved that the tape was there at the (added in 2024 re-release) scene of the crime... ...however, that doesn't prove that it was actually used in said crime. Edgeworth: ...Unfortunately for you, Ms. Yew... ...the fact that the tape was there at the crime scene is in itself very important. Yew: How so? Edgeworth: Hmph... By the very existence of that tape at the crime scene... ...it proves the possibility that the \"when\" of the crime could have been fabricated. And that possibility alone renders all alibis and witness reports irrelevant. Basically, it means that we will need to re-examine every person's movements again! Yew: ......... Edgeworth: Whether the tape was used in the crime or not, that we can re-evaluate afterwards. Yew: Knnrh...! So in conclusion, you're admitting that you can't prove that it was at this point!\nEdgeworth: Edgeworth: Even if you're shocked, that is of no concern to me. I do things my own way. Yew: Oh...? Franziska: I see that you're not laughing, for a change. Yew: ...Because I'm shocked. Edgeworth: Again, you being shocked is of no concern to me. Let us continue with the testimony! Yew: Ahah! Alright, but let me say just one thing. You shouldn't go around accusing people.\nEdgeworth: Edgeworth: Full of holes...? Hmph... Well, I suppose it might be. Yew: Oh? Admitting to your faults now, are we? Edgeworth: \"At this point in time\", is what I meant to say. Yew: Should I take that to mean that you're just a sore loser? Ahahahahahaha! Edgeworth: No matter how full of holes my logic may be right now, if I plug them one at a time... ...I will ultimately make my way to the truth. Yew: What a paradox! Take care to not fall into one of those holes before you fill it up. Ahahahahahahahahahaha!\nFranziska: Miles, you remember, don't you? About why a window in Lobby No. 1 was opened?\nEdgeworth: Yes, of course I do. (And that's how I'll attack! I'll present the reason why the window had to be opened!)",
      "testimonies": [
        {
          "testimony": "You argue that the window was opened, however, do you have proof it was I who did that?",
          "person": "Yew",
          "present": [
            "Ms. Yew's Perfume"
          ]
        },
        {
          "testimony": "Furthermore, do you have proof that the tape was used in committing the crime?",
          "person": "Yew",
          "present": []
        },
        {
          "testimony": "Frankly, I'm shocked at you for going around accusing people of murder like this.",
          "person": "Yew",
          "present": []
        },
        {
          "testimony": "Especially with logic as full of holes as yours!",
          "person": "Yew",
          "present": []
        }
      ],
      "noPresent": true
    },
    {
      "category": "rebuttal",
      "newContext": "Yew:\nYou argue that the window was opened, however, do you have proof it was I who did that?\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nEvidence? All I'd need to do is have some prints analyzed and we'd know straight way!\nYew:\nHmph... Be my guest.\nEdgeworth:\n(She sounds as though she has the room to maneuver... which means... ...even if we were able to lift prints, they'd only show that it was someone else, but... ...why that someone else was forced to open the window... hmph, that's simple logic. Why don't I try presenting that piece of evidence? I have nothing to lose.)\nYew:\nPhwwwwwh, what's wrong? The scrunched eyebrows, lines on your forehead, they're all back! More importantly, are you going to be OK not running a fingerprint analysis?\nEdgeworth:\nYes, I'll be fine.\nYew:\nOh! Well, in that case, I'll just continue with my testimony, alright?\nPresent Ms. Yew's Perfume\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"I'm sure you've seen this before, haven't you, Ms. Yew?\"\nYew:\nFurthermore, do you have proof that the tape was used in committing the crime?\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nI thought I just proved that it was.\nYew:\nSure you proved that the tape was there at the (added in 2024 re-release) scene of the crime... ...however, that doesn't prove that it was actually used in said crime.\nEdgeworth:\n...Unfortunately for you, Ms. Yew... ...the fact that the tape was there at the crime scene is in itself very important.\nYew:\nHow so?\nEdgeworth:\nHmph... By the very existence of that tape at the crime scene... ...it proves the possibility that the \"when\" of the crime could have been fabricated. And that possibility alone renders all alibis and witness reports irrelevant. Basically, it means that we will need to re-examine every person's movements again!\nYew:\n.........\nEdgeworth:\nWhether the tape was used in the crime or not, that we can re-evaluate afterwards.\nYew:\nKnnrh...! So in conclusion, you're admitting that you can't prove that it was at this point!\nYew:\nFrankly, I'm shocked at you for going around accusing people of murder like this.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nEven if you're shocked, that is of no concern to me. I do things my own way.\nYew:\nOh...?\nFranziska:\nI see that you're not laughing, for a change.\nYew:\n...Because I'm shocked.\nEdgeworth:\nAgain, you being shocked is of no concern to me. Let us continue with the testimony!\nYew:\nAhah! Alright, but let me say just one thing. You shouldn't go around accusing people.\nYew:\nEspecially with logic as full of holes as yours!\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nFull of holes...? Hmph... Well, I suppose it might be.\nYew:\nOh? Admitting to your faults now, are we?\nEdgeworth:\n\"At this point in time\", is what I meant to say.\nYew:\nShould I take that to mean that you're just a sore loser? Ahahahahahaha!\nEdgeworth:\nNo matter how full of holes my logic may be right now, if I plug them one at a time... ...I will ultimately make my way to the truth.\nYew:\nWhat a paradox! Take care to not fall into one of those holes before you fill it up. Ahahahahahahahahahaha!\nFranziska:\nMiles, you remember, don't you? About why a window in Lobby No. 1 was opened?\nEdgeworth:\nYes, of course I do. (And that's how I'll attack! I'll present the reason why the window had to be opened!)\nEdgeworth:\nI'm sure you've seen this before, haven't you, Ms. Yew?\nYew:\nAhah! Edgeworth! I never knew you were into wearing that kind of perfume! It's not exactly what I'D recommend for boys, you know?\nEdgeworth:\nWh--!? Th-This isn't mine!\nFranziska:\nThat's right, it's mine. And I received it from Detective Badd, you see.\nEdgeworth:\nMs. Yew, you can pretend all you like, but we know at least this much is (changed from [much] in the original release) for sure! That you are the one who gave this bottle of perfume to Detective Badd (changed from [this bottle of perfume was given to Detective Badd by you] in the original release)!\nYew:\nKphwwh... Ahahahahahaha! And that YOU'RE super easy to rile up (changed from [Because it gets really strong, really fast] in the original release)! So? What about the perfume?\nEdgeworth:\nWhile you were in Lobby No. 1, you made a big show of spilling some of this perfume. That's according to Detective Badd.\nBadd:\n.........\nYew:\n...Phwwwwh. Oh, I know.\nEdgeworth:\nYou also knew that if you spilled it, he would naturally move to open a window!\nYew:\nYew:\nCome now, I've already told you that's all just a big coincidence. After we opened the window in Lobby No. 1, I just left it open, you know? So maybe it was just dumb luck that we heard the gunshot through the window!\nEdgeworth:\nEdgeworth:\nThe timing of when you were going to spill the perfume is something you could control. And the most important fact about this case is when people were made to hear the shot. Furthermore, it would've been pointless if you didn't have an alibi for yourself at the time!\nBadd:\n! You mean...?\nEdgeworth:\nMs. Yew, you were the one who called Detective Badd into Lobby No. 1... ...when you saw him bring Detective Gumshoe into the hallway. Is that correct?\nYew:\n.........\nEdgeworth:\nAll of today's premeditated events could only have been thought up by you, Ms. Yew!\nYew:\n...Grr! ...Ha, hahaha. You accuse me of murder on the fact that I spilled a little perfume. Well, allow me to say this much. I couldn't have killed Mr. Faraday.\nEdgeworth:\nWould you care to testify as to why?\nYew:\nHahahahaha... Look, I've had a lot of fun today, really. ...But I grow weary of this game of cat and mouse. Let's make this the last testimony, and wrap up this absurd case once and for all!\nTestimony\n-- Why It Couldn't Be Me --\nYew:\nAccusing someone of murder over a spilled bottle of perfume is a bit over the top.\nBut I suppose forgery of evidence is to be expected of a disciple of Von Karma.\nIn any case, it simply could not have been me who killed Mr. Faraday.\nAfter all, I don't even know where the knife that was used to kill him came from.\nFranziska:\nMiles, her testimony... is flawless.\nEdgeworth:\n...Yes, but no matter what sort of trick she may try to pull, she won't escape me! (And if I'm lacking in information, I'll just draw it out of her!)\n\nEdgeworth: Edgeworth: I think I already explained the significance of that earlier. Yew: You only confirmed that I did spill some perfume. But that's all. That you would accuse me of murder based on a simple spill... Don't you dare complain when I sue you for defamation of character! Ahahaha! Edgeworth: Do as you like... but as for me, I believe. Yew: You \"believe\"? Edgeworth: I believe... that you are the true culprit in this case! Yew: Phwwwwwwwwh... My, you're enthusiastic! Of course, I should've guessed...\nEdgeworth: Edgeworth: I formally request that you desist in your attack against my mentor! Franziska: Yes! Or we'll sue you for defamation! Yew: Ahah! All I'm doing is telling the truth. Well, maybe more like spreading gossip. Although, your adamant denials are, shall we say, just adding fuel to the fire. Edgeworth: How dare you...!? Franziska: ...Say such a thing!? Badd: ...Calm down, little girl...! Don't let her... get to you... Franziska: .........Nnrgh! Yew: Aww, why did you have to ruin my fun...? Phwwwwwwwh... Well, shall I continue?\nEdgeworth: Edgeworth: And why exactly could you not have killed him? Yew: Ahah! I was just about to testify to that. ...You're such an impatient man... Phwwwh... I'm not really into that, you know, Edgeworth! Edgeworth: Arngh! Your preferences have no bearing on what is at hand! Yew: Ahahaha! Feeling a little uncomfortable, are we? Edgeworth: Grrrrrrnngh! Franziska: Franziska: Ms. Yew! You will desist in this tomfoolery and return to your testimony! And Miles! If you're going to lose your cool, then I won't show you any mercy. Edgeworth: Ahem... Sorry. Ms. Yew, please continue with your testimony. Yew: ..................Sure. As I was saying, I couldn't have possibly killed Mr. Faraday.\nEdgeworth: Edgeworth: (At this rate, she will inevitable escape! But if she really was the one who killed Mr. Faraday... ...then she must have known about the existence of the knife!) I'm sorry, Ms. Yew. Maybe you weren't aware... ...however, the knife that was used to kill Mr. Faraday was taken from his evidence bag. Franziska: ! Miles... What do you think you're doing...!? Edgeworth: Hmph. I'm drawing the truth out of her, that's what I'm doing. Yew: Huh? But I don't recall a knife being presented at the trial earlier today. Edgeworth: Well, I suppose that's because the evidence was something Mr. Faraday had yet to use. Yew: .........Ahahahahahahahaha! Ah! So that's what you're trying to do! Look, why don't you cut it out with the lies. I've already figured you out. There was no knife inside Mr. Faraday's evidence bag. The only evidence he had yet to present was the key the Yatagarasu had sent. And unless a key can magically turn into a knife, you really don't have a leg to stand on. Edgeworth: ! Yew: ...Phwwwwh... Did you really think you could trap me? Come now, be honest. Edgeworth: Heh, I never intended to do such a thing. It was all a misunderstanding on my part. In any case, I wonder if you might append what you just said to your testimony? Yew: Sure... Why not? I'll (changed from [II'll] in the original release, correcting the typo) even say it as many times as you'd like. Adds statement \"There was a key in his evidence bag, but you can't kill anyone with a simple key!\"\nEdgeworth: Edgeworth: Ms. Yew, I would just like to confirm something with you one more time. Yew: Oh? About what's going to happen to Detective Gumshoe after this? Edgeworth: I don't need to ask you about that... because he isn't the killer! Yew: Phwwh! Looks like the number of wrinkles on your forehead have [sic] increased yet again! Ahahahahahahahahahahaha! Edgeworth: .........That issue aside, Ms. Yew, I'd like to ask you about what was inside the bag. You are sure it was the Yatagarasu's Key, correct? Yew: Phwwwh... Yes, I'm sure. Which is why I'm completely baffled as to where that knife could've come from. Edgeworth: (...I think I've just spotted the road to a perfect victory.)\nFranziska: Miles, her testimony... is flawless. Edgeworth: ...Yes, but no matter what sort of trick she may try to pull, she won't escape me! (And if I'm lacking in information, I'll just draw it out of her!)\nEdgeworth: Finally, it would appear that you have revealed your true identity, Ms. Yew...! Franziska: Miles... Her final statement...! Edgeworth: Yes, I know. All I have to do now is to present the evidence! (But what is this... ominous feeling that I can't shake...?)",
      "testimonies": [
        {
          "testimony": "Accusing someone of murder over a spilled bottle of perfume is a bit over the top.",
          "person": "Yew",
          "present": []
        },
        {
          "testimony": "But I suppose forgery of evidence is to be expected of a disciple of Von Karma.",
          "person": "Yew",
          "present": []
        },
        {
          "testimony": "In any case, it simply could not have been me who killed Mr. Faraday.",
          "person": "Yew",
          "present": []
        },
        {
          "testimony": "After all, I don't even know where the knife that was used to kill him came from.",
          "person": "Yew",
          "present": []
        },
        {
          "testimony": "There was a key in his evidence bag, but you can't kill anyone with a simple key!",
          "person": "Yew",
          "present": [
            "Knife",
            "Yatagarasu's Key"
          ],
          "source": {
            "evidence_span": [
              "Has the secret ability to change into key the Yatagarasu sent.",
              "Turns into knife."
            ],
            "testimony_span": "you can't kill anyone with a simple key",
            "is_self_contained": "yes",
            "context_span": ""
          }
        }
      ],
      "summarizedContext": "The witness Yew argues that she cannot be the killer.",
      "noPresent": false,
      "labels": [
        "physical"
      ],
      "reasoning": [
        "Fact 1: The witness claims the key cannot kill anyone.",
        "Fact 2: The evidence suggests the key can turn into a knife.",
        "Prop 1: If an item can turn into a knife, it can kill someone."
      ]
    }
  ]
}