{
  "previousContext": "Episode 4 Turnabout Reminiscence\nEdgeworth: Kay Faraday... the young lady who calls herself the second Yatagarasu... The piece of cloth that she conjured up has taken me back to many years ago...\nDefendant: Yeah, that's right. I did it. I killed the guy. But it was the Great Thief Yatagarasu that told me to do it!\n???:\nLawyer: I ask the defendant... Just what exactly are you trying to say?\nDefendant: Don't you get it? I know the true identity of the Yatagarasu! ...The Yatagarasu is the man standing over there at the prosecutor's bench!\nProsecutor: Are you saying... that I'm the Yatagarasu?\nDefendant: Don't you dare deny it! You told me to kill him when you snuck into the embassy!\nLawyer: Are you claiming that Mr. Faraday is the Yatagarasu?\nDefendant: That's exactly what I'm saying!\nProsecutor:\nProsecutor: Mr. Rell! I think we've heard just about enough out of you...!\nDefendant: Your Honor! Please listen to me! I'm telling the truth... You've gotta believe meeeeeee!\nJudge: Hmph... In accordance with the defendant's accusation... ...a new prosecutor shall be called to replace Mr. Faraday. This court will be in recess until the new prosecutor is ready.\nEdgeworth: (...It's almost time for me to enter the courtroom. And, so it is that my first assignment as a prosecutor will be... ...as a replacement for a prosecutor who has been accused by the defendant.)\n???: Edgeworth.\nEdgeworth: ! ...Sir.\n???: Have you read over all of the documents regarding this trial?\nEdgeworth: Yes, sir. I've memorized everything there is to know.\n???: Very good. The paperwork for the prosecutor substitution is just about complete. Edgeworth... always bear in mind that as your mentor, I, Manfred von Karma... ...will accept nothing short of perfection.\nEdgeworth: I understand, sir. To have the chance to stand in court at such an early stage in my career... ...I am honored and proud.\nManfred: As I have watched over your studies, I am giving you this very rare chance. Prove yourself. Crush the defendant's pathetic lies into oblivion.\nEdgeworth: .........Yes, sir! (That such a legendary prosecutor will be watching (changed from [is watching over] in the original release) and judging my performance... ...I have to be perfect in every way!)\nEdgeworth: If it is true that the Yatagarasu showed up at the Cohdopian Embassy... ...what could he or she have been after?\nManfred: Hmph... No doubt to steal any suspicious accounting records and release them publicly. Or, more likely, to steal secrets from the Cohdopian Embassy itself... ...since the item that the Yatagarasu stole from there was sent to the police.\nEdgeworth: What was it that the Yatagarasu sent to the police?\nManfred: ...I don't know the details. Anything related to the Yatagarasu is getting the top-secret treatment. Still, I find it very ironic. By returning the stolen item to the police, it was proof positive that the Yatagarasu... ...had infiltrated the embassy on the same day the staff member was killed. Criminals have a way of incriminating themselves, wouldn't you say?\nEdgeworth: That would have to be the first time the Yatagarasu has left evidence behind, correct?\nManfred: Yes, indeed. If you wish to learn more about the Yatagarasu, then I suggest you ask Faraday.\nEdgeworth: Mr. Faraday...?\nManfred: He happens to be the prosecutor in charge of the Yatagarasu case, as well.\nEdgeworth: (He's the prosecutor in charge of both the KG-8 Incident and the Yatagarasu case? Mr. Faraday really has a lot on his plate...)\nManfred: ...What is it, little girl?\n???: ......... ...You're scary, mister.\nManfred: !\nEdgeworth: Did you need something?\n???: Umm... I want to trade these coins with you!\nEdgeworth: A fistful of dimes, quarters, and pennies... but it looks like you've exactly a dollar. Is this what you want?\n???: Thanks! That's exactly what I needed!\nEdgeworth: Could that child be here to watch the trial?\nManfred: How disrespectful for a child like that to be running around inside the courthouse! Does no one have respect for this country's judicial system anymore!?\nBailiff: The paperwork for the prosecutor substitution is complete!\nManfred: Why you! Do you even know how much time there is left before the trial resumes!?\nBailiff: I... I-I'm so sorry!\nManfred: I can have you mopping up this courthouse instead of protecting it in an instant!\nBailiff: ! *gulp*\nEdgeworth: It's no bother, sir. Not being completely prepared could prove to be a perfect handicap for me.\nManfred: Hmph. A proud one you are. You had better collect the evidence from Faraday and prepare yourself. It's time for your debut, Edgeworth!\nManfred: ..................\nEdgeworth: ..................\nManfred: Just what is going on!? Why isn't Faraday here yet!? How is it possible that the defense is not prepared yet, either!?\nEdgeworth: Bailiff... Where is Mr. Faraday?\nBailiff: I-I'm not sure... I wasn't really paying attention...\nJudge: Ah, you must be the one Mr. von Karma recommended... I hear this will be your first trial. I look forward to seeing how you perform. Oh, by the way, was there someone celebrating a birthday during the recess? I could have sworn that I heard a popper going off... Come to think of it... The other day with my grandson...\nEdgeworth: Sir, it looks like the trial is about to resume, however...\nManfred: ...Yes, it will be all but impossible to prove the witness a liar... ...without the evidence from Faraday! What is that blasted buffoon up to!?\n???: I-I-It's an emergency, siiiiiirs!\nJudge: S-Silence!\nManfred: There shall be no yelling in this sacred hall of law! Bailiff! Remove that man from this courtroom at once!\n???: P-Please... wait! You have to listen to me! There's an emergency! Defendant Lobby No. 2...! M-Mr. Faraday and the defendant... Th-The two of them... They're... They're both dead, Your Honor!\nJudge: Wh--!?\nManfred: Wh--!?\nEdgeworth: Wh--!? Whaaaaaaaaaaaaaaat!?\n???: Stay back!\nEdgeworth: Ungh...!\n???: ...No one's allowed on the crime scene... Period.\nEdgeworth: (Just who does this... oddball think he is...?)\n???: This is becoming quite the hotspot...\nEdgeworth: (Isn't she Mr. Rell's defense attorney...?)\n???: H-Hey, you! No running in the hallway, pal!\nEdgeworth: And who are you to tell me what to do? (I'll never find out what's going on like this. It's time for some civil discourse.)\nAfter clearing all Talk options with Tyrell Badd, Calisto Yew, and Dick Gumshoe:\nBailiff: Ms. Yew! There is someone here who wishes to see you...\nYew: ......Who is it?\nBailiff: A Cohdopian Embassy staff member by the name of Manny Coachen.\nYew: Wh--!\nBadd: .........!\nEdgeworth: (What's going on? Detective Badd and Ms. Yew's moods just changed all of a sudden. Wait a second... Wasn't Manny Coachen...!?)\nYew: I'll be right there.\nCoachen: It's nice to see you again... Ms. Yew.\nYew: Why are you here? I have no desire to ever see you again.\nCoachen: Now, now... Actually, would you mind stepping outside for a brief chat?\nYew: ........Fine. Let's go.\nManfred: ...Badd.\nBadd: Von Karma...? It's been a long time.\nManfred: I knew you would show up. You usually do when the Yatagarasu is involved, and I see this case is no exception.\nEdgeworth: Do you know Detective Badd, sir?\nManfred: Yes. He's like an old bloodhound that never leaves the scene of a crime. If only he would get a promotion and move on.\nBadd: It's the crime scene where a detective is most useful and effective.\nManfred: Hmph! It's not like I don't know that. Moving on though, Badd. The man that I just passed by... ...was he not the suspect from the KG-8 Incident!?\nEdgeworth: (So I was right...!)\nManfred: Just what is that man doing, wandering around here!? That Faraday... I can't believe he let such an easy catch get away! Imbecile! I would've proved his guilt in three minutes!\nBadd: Von Karma! ...I think you've said enough for now. It's in poor taste to speak like that about the departed.\nManfred: Hmph... Very well. Back on topic... I'm placing Edgeworth in charge of the investigation here...\n???:\n???: Papa! How can you place him in charge!?\nEdgeworth: Franziska... What are you doing here?\nFranziska: I'm here for summer vacation, what else?\nEdgeworth: (Franziska von Karma... So she is here on vacation from Germany... She is the daughter of Manfred von Karma and a student of his, who's also junior to me.)\nFranziska: You're the one who's junior to me! And don't you forget it!\nEdgeworth: You're not conveniently avoiding the Bar Examination, are you?\nFranziska: Hah... If you were able to pass, then I'll have absolutely no trouble at all. I'll never allow myself to lose to you! Never!\nEdgeworth: (Why does she always have to be this competitive...?)\nFranziska: Anyway... Papa... Are you really assigning Miles Edgeworth to cover the case?\nManfred: Yes, I am. Why do you ask?\nFranziska: Well, you know... I'm close to becoming a prosecutor myself... And I am 100% confident that I can do a better job than him!\nEdgeworth: (That's just like Franziska. She has no problem bad-mouthing someone right in front of them.)\nManfred: ...Badd.\nBadd: Yeah...?\nManfred: These two will be conducting the investigation.\nBadd: What? You want me to let both of these kids loose on the crime scene?\nManfred: Hah. This is a perfect opportunity for them to work on their prosecutorial skills.\nBadd: A crime scene is not a place for children to be messing around in!\nManfred: I'm the one with the authority over this crime scene, Badd. ...And I will not tolerate complaining.\nBadd: ...Knngh...!\nManfred: Edgeworth! Franziska! I leave this case to the two of you.\nEdgeworth: Understood, sir.\nFranziska: Yes, Papa.\nManfred: I'll go take care of the paperwork now. Remember, I'll accept nothing but a perfect report from the both of you. Do not disappoint me.\nBadd: Hold up, Von Karma.........! I still... haven't agreed to this!\nFranziska: Miles Edgeworth...!\nEdgeworth: It's been quite some time, Franziska.\nFranziska: This will be the perfect chance for us... ...to see which of us is truly worthy of the Von Karma name.\nEdgeworth: Would it kill you to at least say hello?\nFranziska: Unngh... Umm... Long time no see.\nEdgeworth: Very good.\nFranziska: Just because you became a prosecutor first doesn't mean you can act all proud!\nEdgeworth: (S-She hasn't changed a bit...)\nFranziska: Miles Edgeworth! As I was saying, we shall see which one of us is worthy of the Von Karma name...\nBadd: For cryin' out loud... I've been reduced to a babysitter...\nEdgeworth: (It looks like Mr. von Karma was successful in convincing the detective. That's just like him; he never fails.) Now, I'd appreciate it if you could quickly run me through the facts, Detective Badd.\nBadd: You're better off checking things out on your own.\nEdgeworth: ...Very well. (Seems like getting help from Detective Badd will be a most arduous task...)\nEdgeworth: (Nngh... Is the only real explanation that they killed each other simultaneously...?)\nFranziska: Miles Edgeworth! You should listen to someone until they are finished talking!\nEdgeworth: Umm... What are you talking about?\nFranziska: I'll only say it one more time... This is a competition to see who is truly worthy of the Von Karma name!\nEdgeworth: A competition...?\nFranziska: The person that figures out the truth first wins.\nEdgeworth: Hmph... So the person who doesn't discover the truth is a dishonor to the name?\nFranziska: Exactly! I don't care that you became a prosecutor before me... ...I simply refuse to hear any more foolish things come from your foolishly, foolish mouth.\nEdgeworth: Hmph... Fine, whatever makes you happy.\nFranziska: Can I take that as you accepting my challenge?\nEdgeworth: Once again... Whatever makes you happy.\nFranziska: Hah... Well then, let's begin the investigation, shall we? I'm going to find the perfect evidence and prettily present it like the professional I am.\nEdgeworth: (Competing to discover the truth behind a crime -- how delightfully... childish.)\nBadd: You kids, over there! Hold it!\nEdgeworth: \"Kid\"!?\nFranziska: Ha! Serves you right, Miles. He just called you a kid...!\nBadd: ...I said \"kids\", kid.\nFranziska: H-How dare you call me a kid as well!?\nBadd: I'll do what I please. And I won't allow you to cause a ruckus on my crime scene. Hey, big guy. You're... going to watch over these two.\nGumshoe: Yes, sir! Detective Badd, sir! Now, do what I say from now on kids, OK!?\nFranziska: You'd better not get in our way, Scruffy! You'll feel the bite of my whip if you do!\nGumshoe: E-Eeek! Th-Then you, p-prosecutor boy! Let's get your investigation started already, alright!?\nEdgeworth: (Great. Now, even THAT detective is treating me like a child...)\nGumshoe: Alright! It's time to get investigating! Get a move on, prosecutor boy!\nEdgeworth: ...My name is Miles Edgeworth. And if you were [sic] to call me \"prosecutor boy\" one more time... ...it will be my duty as a prosecutor to \"look into\" your monthly salary.\nGumshoe: Wh-What!? And what would you do with my salary after you saw how much it was!?\nEdgeworth: That's up to you now, isn't it?\nGumshoe: Really!? Sounds good, pal!\nEdgeworth: (He's so naïve...)\nEdgeworth: Detective Badd, may I have a word with you?\nBadd: ...What is it?\nEdgeworth: It appears that both a knife and a gun were used as murder weapons.\nBadd: ...Yeah, it does.\nEdgeworth: That leads us to our first question of the investigation. Where did the men acquire the weapons?\nBadd: ...The gun was inside of Faraday's bag. It was a piece of evidence that was presented in the trial earlier today. It was used... to kill the Cohdopian Embassy staff member. But... I never heard anything about the knife. Mr. Rell was being held by the police. There's no way he could have brought it in. Which means it's possible that Faraday had the knife on him from the start as well.\nEdgeworth: (Could it have been a piece of evidence that had yet to be presented...? But then, why doesn't Detective Badd know about it? Wait! What if...!?) It's possible that Mr. Faraday brought the knife in under the guise of prosecutorial evidence. He could have then brought it out and attacked Mr. Rell with it.\nBadd: Huh... Maybe you've got a brain in there after all, kid.\nEdgeworth: Nngh...! (Is he going to treat me like a child forever!?)\nBadd: ...It looks like Mr. Faraday attacked Mr. Rell first, who then counterattacked... That's the only logical conclusion you can draw from a scene like this.\nEdgeworth: (Hmm... Not yet. I feel that it's much too early to be drawing conclusions already. I must first find conclusive evidence, so as to protect (changed from [ensure] in the original release) the honor of the Von Karma name.)\nAfter examining gun, Byrne Faraday's left hand, and knife:\nEdgeworth: Mr. Rell's cause of death was from being shot, correct?\nGumshoe: That's what we think, but it's hard to tell with him lying face down.\nEdgeworth: Death is bad enough, but it's truly lamentable that someone would try to hide the truth.\nGumshoe: ...Um, are you sure they were trying to hide something?\nEdgeworth: (I can't confirm Mr. Rell's cause of death with his body positioned like that.) Detective Badd, I'd like to examine the bodies in further detail, if possible...\nFranziska: What's this? You're not able to form a theory with them the way they are?\nEdgeworth: I believe an examination of the bodies is vital to finding the perfect evidence, don't you?\nFranziska: Hmm... I suppose you do have a point. Well!? Hurry up and get on with it!\nBadd: ...Labbie.\nForensics: Yes, sir! We've taken enough photos of the scene, sir.\nBadd: ...And there you have it.\nEdgeworth: ..................\nBadd: ..................\nEdgeworth: D-Do you not approve?\nBadd: ...Of course not.\nEdgeworth: What!?\nBadd: Investigation of a crime scene is the work of a detective. So don't touch a thing. Hey, big fella, turn over the bodies for me, will you?\nGumshoe: O-OK......... Please forgive me, Mr. Faraday, sir...!\nBadd: Gumshoe... do not get emotionally involved. Remember, you're a detective!\nGumshoe: Yes, sir! Understood, sir!\nLeads to examination of bodies\nAfter connecting all possible Logic and examining both wounds, open window, and TV:\nGumshoe: I guess there's not much left to investigate, huh? They really did kill each other...\nEdgeworth: No... We can't conclude that quite yet. There's still something I find very peculiar here. The theory that they simply killed one another is too simplistic in this case. In fact, there is actually a contradiction that shows there is another possibility!\nGumshoe: No way, pal! Really!?\nEdgeworth: Hmph... I suppose I will just have to show you the contradiction (changed from [conflict] in the original release) in this crime scene.\nLeads to examination of bodies\nEdgeworth: Now we come face to face with the contradiction I spoke of, and it is... this! Mr. Faraday used his left hand to write with his fountain pen. Ergo, he is left-handed. And yet, the handgun is in his right hand! Don't you find it odd that the left-handed Mr. Faraday would hold the gun in his right hand? That. lady and gentlemen... is the great contradiction haunting this crime scene!\nGumshoe: Hey, you're right, pal! That does seem kinda strange! But... How could something like that happen?\nEdgeworth: The facts add up to one conclusion, and one alone. Someone else put the gun in Mr. Faraday's hand after he died.\nGumshoe: Someone else...!?\nEdgeworth: Plastic bags scattered on the floor, and a gun in the wrong hand... I sense the presence of a shadowy figure behind this case. A person of vile intent who is serious about keeping the truth from us!\nBadd: Here's the autopsy report.\nFranziska: \"It is probable for that Mr. Rell survived for a short time after he was shot. However, Mr. Faraday died instantaneously from his stabbing.\" Interesting...\nCrime Scene Notes updated in my Organizer.\nFranziska: It looks like we now know everything we need to know about this case.\nEdgeworth: Are you sure we know everything...?\nFranziska: Of course! The incident began with Mr. Faraday attempting to get his revenge. The prosecutor went into a rage from being accused, and tried to kill the defendant... But, the defendant fought back and they ended up killing each other. It's all very clear and simple. There is absolutely no margin for doubt.\nEdgeworth: Do you really believe that to be the truth?\nFranziska: Hah! Are you saying that just because I figured out the truth before you... ...that you don't want to believe it's true?\nEdgeworth: N-Nngh...\nFranziska: It's alright. If you disagree with my argument, then prove me wrong. Well, if there are any contradictions to be found, that is...\nEdgeworth: Don't worry, I will.\nFranziska: Mr. Faraday's death was instantaneous, while Mr. Rell survived for a short time. From this, it is obvious that Mr. Faraday died after he shot Mr. Rell. And Mr. Rell, while on the brink of death, stole Mr. Faraday's knife and stabbed him. Those are the facts of this case.\nEdgeworth: (Mr. Faraday's death was instantaneous, therefore, he must've attacked first... Proving that logic to be false is probably the fastest way to show her that she's wrong. In that case, I should first look for any holes in her theory!)\nFranziska: Mr. Faraday's death was instantaneous, while Mr. Rell survived for a short time.\nFranziska: From this, it is obvious that Mr. Faraday died after he shot Mr. Rell.\nFranziska: And Mr. Rell, while on the brink of death, stole Mr. Faraday's knife and stabbed him.\nFranziska: They struggled, and Mr. Rell used the last of his strength to counterattack Mr. Faraday.\nFranziska: Those are the facts of this case.\nEdgeworth: (There's something strange about Franziska's theory... I should compare her claim with the data I've gathered thus far. I just know there's a contradiction somewhere!)\nEdgeworth: If the two men were fighting, their struggle would've surely caused quite a bit of noise. However, Detective Gumshoe testified that he heard absolutely nothing!\nFranziska: Hah. You place too much faith in that detective's testimony, you know. But for the sake of argument, let's say there wasn't a fight. How, then, did Mr. Rell get his hands on the knife?\nEdgeworth: Mr. Faraday's bag was sitting right here in Lobby No. 2. It is not hard to imagine that perhaps Mr. Rell saw a chance and took it out at some point!\nFranziska: .................. So... What you're saying this: Mr. Rell took a chance when he saw the opportunity, and took the knife from the bag. And then Mr. Faraday shot Mr. Rell after being stabbed...?\nEdgeworth: Hmm......... (Isn't there something... strange in Franziska's statement just now?)\nEdgeworth: It's simply not possible for Mr. Faraday to have shot Mr. Rell after being stabbed!\nEdgeworth: According to the coroner's report, Mr. Faraday died instantaneously, meaning... ..that he died immediately upon being stabbed by the knife! Ergo, he could not possibly have fired the gun after that!\nFranziska: ...Ooh, you got me.\nEdgeworth: But of course.\nFranziska: Well then, if the report is correct, then there is only one correct explanation. If we suppose that Mr. Rell attacked first... ...then Mr. Faraday, who died instantaneously, would have been unable to kill Mr. Rell. Therefore, Mr. Rell must have stabbed Mr. Faraday after he was shot. Then they both died. That is the only explanation that makes logical sense!\nEdgeworth: Negating your opponent's ideas in order to prove your own theory... I see you've been studying, Franziska.\nFranziska: I just wanted to explain it to you as simply as possible. Before you foolishly propose a foolish theory that only a foolish fool like you could.\nEdgeworth: Hmph... How naïve of you to believe that only your opinions are valid... ...and still expect to discover the truth that the crime scene offers you... Franziska... You've still got a ways to go.\nFranziska: What are you talking about!? Are you saying there's a flaw in my logic!?\nEdgeworth: (Mr. Faraday died instantly... And the fact that he did is what gives rise to the contradiction in this scene!) The contradiction here in this crime scene is...!\nEdgeworth: Let me get this straight. What you are arguing is this: Mr. Faraday took the gun from his evidence bag and shot Mr. Rell. Then, the wounded Mr. Rell found an opportunity to take the knife and strike back. Upon being stabbed, Mr. Faraday died on the spot, and Mr. Rell died thereafter. If that's the case, then how do you explain this? Take a good look at the order in which their bodies are piled.\nFranziska: ............N-No...!\nEdgeworth: Mr. Faraday's body is lying on top of Mr. Rell's. Therefore... ...Mr. Rell must have died before Mr. Faraday!\nFranziska: I-Impossible!\nEdgeworth: (Yes, I agree that it seems strange no matter what angle you approach it from... ...which means that the real mystery behind this crime scene that we must solve is--!)\nFranziska:\nFranziska: No...! Not so fast, Miles Edgeworth!\nEdgeworth: What now...?\nFranziska: I simply think that you ought to think a bit more outside the box... And that it's even clearer now that the incident started with Mr. Faraday's murderous intent!\nEdgeworth: (She sure bounced back quickly. An explanation won't be enough this time. It's going to take some very decisive evidence to prove her wrong!)\nFranziska: It was just chance that Mr. Faraday's body fell on top of Mr. Rell's. The two bodies fell into a pile... ...which indicates that they attacked each other at the same time. It really doesn't matter in the slightest that they fell in the opposite order.\nEdgeworth: (I just know that Franziska's explanation isn't absolutely correct. All I have to do is find a hole in her logic! Once I do, I can then present her with the evidence that proves the contradiction!)\nFranziska: It was just chance that Mr. Faraday's body fell on top of Mr. Rell's.\nFranziska: The two bodies fell into a pile...\nFranziska: ...which indicates that they attacked each other at the same time.\nFranziska: That fact indicates that they attacked each other at the same time from close range.\nFranziska: It really doesn't matter in the slightest that they fell in the opposite order.\nEdgeworth: (The fact that the order that they attacked each other in... ...varies from the order they fell in doesn't cause a problem for me. However, there's definitely one certain aspect that I'm having trouble swallowing!)\nEdgeworth: So you believe they killed each other at close range...? Sorry, but that's impossible. Just as it is written in the crime scene notes... ...the firing of the handgun did not leave a gunpowder burn on Mr. Rell's clothes. Therefore... Mr. Rell and the gun... ...must have been separated by a distance of at least two or three yards!\nFranziska: Aaaaah!\nEdgeworth: (Yes... This is by far the biggest contradiction! The two bodies are piled up on each other, yet the gun was fired from a distance. And with there being no chance that Mr. Rell moved that far after being shot... ...that leaves only one possible explanation!)\nFranziska: Wh-What a completely foolish line of foolish thought from a thoroughly foolish fool! If I'm not right... ...then who was it that made the first move with the intent to kill, huh!? Who!?\nEdgeworth: The person that attacked first with murderous intent? That would be...\nEdgeworth: Here in this room... ...contradictions appear no matter which man we claim attacked first. Thus, there can be only one explanation. There was... a third person here!\nFranziska: ...!\nEdgeworth: It was that third person who killed both Mr. Faraday and Mr. Rell... ...and set their bodies up to make it look like a double murder... That third person is the real culprit!\nFranziska: ............ Miles Edgeworth... There's just one thing you're missing.\nEdgeworth: ...Evidence, correct?\nFranziska: Exactly. Everything you've said up until now is nothing but a story played out in your head. However, this is where the real test begins. Can you prove that there was a third person involved in this crime!?\nEdgeworth: ...Of course. (If a third person was [sic] truly here, that fact would resolve the glaring contradiction. The proof that this has all been a set-up, made to look like they killed each other... I'll present it, and lay bare the final piece of the puzzle that's not yet in place! What is the piece of evidence that proves there is a third person involved...?)\nEdgeworth: The gun in Mr. Faraday's hand and the plastic bag with his blood on it... These two items point to the presence of a third person.\nFranziska: How so...?\nEdgeworth: Recall Detective Gumshoe's testimony.\nGumshoe: I was in the hallway the whole time, but I didn't hear a single peep of a struggle.\nEdgeworth: If there wasn't a struggle in this room... ...then there shouldn't be any plastic bags on the ground. Meaning that someone else must've deliberately scattered them around!\nFranziska: ...!\nEdgeworth: Do you not see the possibility in this? Disregarding the gun for the moment... ...there's a high probability of blood splatter when a knife is used on a person. If the culprit held the knife with a plastic bag around it... ...they could use the bag to catch any blood splatter from when they withdrew the knife. Then, by spreading a few more plastic bags around, mixing the bloody one in with them... ...and arranging the room to make it look like there was a struggle between the two... ...they were able to conceal their presence!\nFranziska: Aaaaaaaaah!\nBadd: Looks like... we've still got a long way to go in this investigation...\nEdgeworth: Yes.\n???:\nGumshoe: Wh-What the heck's up with you, pal!?\nYew: Mr. Badd, I advise you to place Detective Gumshoe under arrest.\nGumshoe: Wh...WHAAAAAAAAAAAT!?\nBadd: ......What's the meaning of this?\nYew: Hah! Looks like you're not man enough to discipline your own subordinates.\nBadd: ...Don't you dare...!\nYew: That detective claims he was there, standing in front of the door the entire time... ...but I have it on good authority that it was all a giant lie!\nBadd: ......!\nEdgeworth: ...Ms. Yew! I ask that you please explain that last statement!\nYew: I'll let His Honor explain it himself.\nJudge: I-I saw it with my own eyes, I tell you! During the recess, there was a period of time when there was no one in the hallway!\nGumshoe: Whaaaaaaaaaaat!?\nYew: See, Mr. Badd? So I ask you, why would a detective who was supposedly doing his job the whole time... ...want to fabricate such a lie?\nBadd: ...Gumshoe. Did you... Did you kill Faraday...!?\nGumshoe: N-Noooooooooooooooooo! Of course not, sir!\nFranziska: It would appear that the one who set this whole crime scene up is that detective. ...Which basically renders his testimony a complete lie and wholly invalid. It looks like your \"perfect\" logic has just come tumbling down, Miles.\nEdgeworth: Nngh...\nGumshoe: I was in the hallway the whole time, but I didn't hear a single peep of a struggle.\nEdgeworth: (Was that statement really a lie...?)\nBadd: ...Detective Gumshoe. You're now a suspect in the murder of two men. Now, spit out the truth, or so help me...!\nGumshoe: I...I haven't lied to anyone, sir! Honest! I really was really there... I was in the hallway the whole time!\nEdgeworth:\nEdgeworth: Detective Badd, I ask that you please do not act without my permission. After all, I am the one that is heading up this investigation, am I not?\nBadd: .........Don't talk like you know what's going on, boy...\nEdgeworth: All I want is for this investigation to run perfectly.\nFranziska: Perfection is the only wish of a disciple of Von Karma, after all.\nEdgeworth: Therefore, before you take Detective Gumshoe into custody... ...I'd like to set the record straight on something.\nBadd: ...And what's that...?\nEdgeworth: (Hmm, what should I ask Detective Gumshoe about...?)\nEdgeworth: I suppose the one thing I'd like (changed from [liked] in the original release, correcting the typo) clarified... ...is Detective Gumshoe's motive for committing this crime.\nBadd: Hmph... Motive, huh. Gumshoe... You got a grudge against Faraday or anything...?\nGumshoe: N-No, sir! Not me! Not a single bad thing against Mr. Faraday, sir!\nBadd: ...Is that a fact...?\nYew:\nYew: ...You really have a problem with lying, don't you, Detective Gumshoe?\nGumshoe: I'm telling you... I AM NOT LYING!\nFranziska: The more unnatural you act, the more suspicious you become, you know.\nYew: If you want a motive, Edgeworth, I have one for you right here.\nEdgeworth: Could you please share it with us? However, be forewarned that I won't hesitate to object to flights of fancy... ...because all I'm interested in is the perfect explanation.\nYew: Phwwh! Ahahahahahaha! You're serious, aren't you? ...Fine. You amuse me, so I'll humor you with a little courtroom practice.\nYew: It was... about a week ago. I saw the detective get chewed out by a livid Faraday in front of the precinct. He stood there super pale, as Mr. Faraday yelled, \"That's a salary cut for you, you nitwit!\" A brand new detective suddenly getting his salary cut -- that's reason enough for a grudge. Well? How's that for the \"perfect explanation\"?\nGumshoe: Y-You totally misunderstand me, pal! No matter how mad I get, I could never hold a grudge!\nBadd: .........Quiet. We can't trust anything you say...!\nGumshoe: Sir...\nEdgeworth: (Hmm... There's nothing wrong with the motive she proposed, per se... ...but there are some gaps in her logic that need to be filled in. Ms. Yew's \"perfect explanation\"... ...may not be so \"perfect\" at all...!)\nYew: It was... about a week ago.\nYew: I saw the detective get chewed out by a livid Faraday in front of the precinct.\nYew: He stood there super pale, as Mr. Faraday yelled, \"That's a salary cut for you, you nitwit!\"\nYew: A brand new detective suddenly getting his salary cut -- that's reason enough for a grudge.\nYew: Well? How's that for the \"perfect explanation\"?\nEdgeworth: (Detective Gumshoe certainly had a motive to kill Mr. Faraday. However, there is just one thing I can't wrap my head around in this explanation. I'll just have to force Ms. Yew to explain herself fully!)\nEdgeworth: Alright, if you could clear this one thing up for me...!\nEdgeworth: I understand Detective Gumshoe's potential motive for killing Mr. Faraday... ...however, what about his motive for killing Mr. Rell?\nYew: His motive for killing Rell? Like I would know.\nEdgeworth: Hmph... If there was [sic] no clear motive for both of the murders... ...then I doubt this incident would've occurred. Wouldn't you agree?\nYew: ..................\nEdgeworth: Is there anyone else who might have had a grudge against either of the two men? Or should we look into that ourselves?\nYew: Oh... In that case... .........I have absolutely no idea.\nEdgeworth: .........! (What? But that's impossible! She must know SOMETHING!)\nYew: Phwwh... Wait... Ahahahahahahahahahahahahaha! Can you please not glare at me like that? ...It makes me laugh. Phwwwwwh!\nEdgeworth: (Grr...! I didn't even do anything, and you're already laughing away!)\nYew: Well, anyway... the way I see it, as long as he had a motive to kill one of the two... ...this crime would've played out the way it did anyway.\nEdgeworth: ...Oh? Would you care to explain your logic? And this time, please try to provide a truly perfect explanation.\nYew: Phwwwwh...! Perfect this, perfect that... Stop being so uptight, or is that a requisite trait for being a Von Karma? Ahahahaha!\nFranziska: Miles Edgeworth! I demand that you shut this rude woman up!\nEdgeworth: (...I wish you'd BOTH be quiet for just one second...)\nYew: Ahem... Oh well. I guess I'll just have to explain it to you kids.\nYew: There's no one out there with a motive to kill both Mr. Faraday and Mr. Rell. All you really have to establish is that someone had a grudge against one of the two men. Mr. Rell, who happened to be there, became a witness to Mr. Faraday's murder. Therefore, he was killed out of necessity, and set up to look like they had killed each other.\nEdgeworth: (I wonder if that's really true... Is there no one out there with a grudge against both men? I should take another hard look at the evidence for this morning's case. The second KG-8 Incident, as people are calling it, involving an Embassy staff member... ...and the two men who both wound up as suspects in the case... Is there someone else I'm overlooking who is somehow related to them?)\nYew: There's no one out there with a motive to kill both Mr. Faraday and Mr. Rell.\nYew: All you really have to establish is that someone had a grudge against one of the two men.\nYew: Mr. Rell, who happened to be there, became a witness to Mr. Faraday's murder.\nYew: Therefore, he was killed out of necessity, and set up to look like they had killed each other.\nEdgeworth: (I have to admit, her explanation makes sense. However, there is also something she overlooked in her testimony. I should present that piece of evidence, and see if I can't make her see the truth!)\nEdgeworth: Ms. Yew. I believe there is someone you overlooked in making your statement. Or rather... is it because you'd rather not bring this person up...?\nYew: .........What do you mean?\nEdgeworth: We are looking for someone with a reason to kill both Mr. Faraday and Mr. Rell... I can think of at least one person that fits the bill! He was the suspect in the original KG-8 Incident... ...and a member of the Cohdopian Embassy staff, Mr. Manny Coachen!\nYew: ...!\nEdgeworth: That's right. The very man who came to visit you earlier out in the hallway.\nYew: ..................\nEdgeworth: The man who killed a member of the Cohdopian Embassy staff, Mr. Rell... ...and the man who was the lead prosecutor of the KG-8 Incident, Mr. Faraday... Are you telling me that Mr. Coachen has no reason at all to kill both of these men?\nYew: Well......... I suppose he might have a reason or two...\nGumshoe: You! You covered for me, pal! ...Maybe you're not such a bad guy after all.\nEdgeworth: Don't get ahead of yourself. You're still a suspect, make no mistake about that! The perfect evidence, the perfect testimony... These are the only things I wish to hold.\nGumshoe: B-But I didn't do it...!\nEdgeworth: Hmph... You will stay under my authority, and go investigate Mr. Manny Coachen for me. And remember, I will not be very forgiving should any of this leak out--\n???:\nBadd: You want to investigate Coachen...? You'd just be wasting your time...\nEdgeworth: And why is that?\nBadd: ...Coachen was up in the viewing gallery, watching the trial... or so I was told. Every cop in this place has been keeping an eye on the guy since he arrived...\nFranziska: Then the only real suspect we have is still Detective Gumshoe.\nEdgeworth: ...I suppose so.\nGumshoe: No way... Come on, Detective Badd! You've gotta believe me, sir! I really was in that hallway the whole time, sir! I never took a single step into this room, sir!\nBadd: ...OK, then are you saying... there was someone else who passed through the hallway?\nGumshoe: I-I... No... There was no one else, sir.\nBadd: .........Then why should I believe you didn't do it...!?\nFranziska: That is one incredibly foolish detective. Standing right in front of a crime scene all by himself... It's as good as a confession of guilt.\nEdgeworth: (I have to admit it's a bit strange. Most criminals will fabricate some sort of lie to escape their crimes. And if that detective really wanted to prove that he is innocent... ...you'd think he would at the very least offer up \"I spaced out while on duty\" or the like.)\nBadd: ...Come on, Gumshoe. Time for your interrogation...\nGumshoe: .........Detective Badd...\nFranziska: Miles Edgeworth... I will go ahead and report this to Papa.\nJudge: And that, as they say is that! Right, everyone? Ho ho ho.\nYew: Well, I suppose we should both be getting back to our real jobs now, huh?\nEdgeworth: Before we do, Ms. Yew, there is something I'd like to speak with you about.\nYew: ...What is it?\nEdgeworth: Ms. Yew... I believe that I have proof of your connection to the KG-8 Incident.\nYew: That file is your proof? Very well, then... Why don't you tell me exactly how I'm related to the KG-8 Incident?\nEdgeworth: Your connection to the KG-8 Incident... ...is through the victim!\nYew: .........!\nEdgeworth: The victim's name is Cece Yew. You will note that she has the same last name as you. Can you really still tell me with a straight face that you are not related to this case?\nYew: .........Phwwwwh. Ahahahahahahahahahahahahaha! ...Sorry, but we're not related.\nEdgeworth: Wh--!?\nYew: .........Just kidding. You asked that question with such a serious look on your face... ...that I couldn't help but... Ahahahahahahahahahahahahaha!\nEdgeworth: Mmmrrrrgh...! Ms. Yew, I ask that you please tell me the truth.\nYew: ..................Ahem. Alright. I'll tell you everything I know.\nAfter clearing all Talk options with Calisto Yew:\nYew: Well, this is about all I know. Haha... Sorry. Guess I wasn't much help, huh?\nEdgeworth: That's not true. I'm sorry I made you recall such a painful time in your life.\nYew: Phwwh...... Ahahahahahahaha! Edgeworth, you really are too serious for your own good. You really need to learn to relax. We wouldn't want you to die of stress, would we?\nEdgeworth: ...Thank you for the advice, but there's no need to worry. I work in my own way, and I will catch this criminal in my own way as well. You'll see.\nYew: Ahahahahahahahahahahahahaha! Look at you with your game face on, ready to go!\nEdgeworth: I...! I'm making no such face!\nYew: Did you know? Laughter is the best medicine, Edgeworth. Don't you get tired of making such a serious face all the time?\nEdgeworth: I'm charged with making sure that all the criminals of this world are found guilty. I... have no need for laughter.\nYew: There you go, making that face again. Oh well. I've got to get going. I still have a few loose ends I need to tie up.\nEdgeworth: (.................. The KG-8 Incident and this murder investigation... It is my belief that these two cases are related to each other somehow. Plus, that detective... Detective Gumshoe...It's obvious he's lying, even though the lie is hurting his chances. ...Clearly, this case is far from over. But whether or not that detective is the murderer... ...can only be determined once I've completed my perfect investigation. Mr. von Karma... I swear to uphold your honorable name, or my name isn't Miles Edgeworth!)\nTo be continued\n\n",
  "characters": [
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Manfred von Karma"
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Byrne Faraday"
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Deid Mann"
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Mack Rell"
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Yatagarasu"
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "??? → Kay Faraday"
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "The Judge"
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Dick Gumshoe"
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Calisto Yew"
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Tyrell Badd"
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Manny Coachen"
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Franziska von Karma"
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Prosecutor's Badge",
      "description1": "Proof of my profession. My mentor said it was more chic to keep it in my pocket."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "KG-8 Incident Overview",
      "description1": "Received from my mentor as reference about KG-8."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Det. Gumshoe's Testimony",
      "description1": "Was in hall on guard duty. Other than gunshot, didn't hear a sign of a struggle."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Handgun",
      "description1": "Was Faraday's evidence from Embassy staff killing case. It was found in his hand.",
      "description2": "Found in Faraday's hand. Bullet that killed Rell was fired from a few yards away."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Knife",
      "description1": "I believe Faraday brought this as evidence. It was found in Rell's hand.",
      "description2": "Weapon used to kill Faraday. Has the secret ability to change into key the Yatagarasu sent."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Crime Scene Notes",
      "description1": "Notes pertaining to Byrne Faraday and Mack Rell."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Plastic Bag",
      "description1": "One of the bags strewn on floor of Lobby No. 2. Has Faraday's blood on it."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Mr. Faraday's Fountain Pen",
      "description1": "Fountain pen used by the left-handed Faraday. Looks like it has a quality nib."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Annual Bonus Envelope",
      "description1": "Det. Gumshoe's annual bonus of $5. Literally had no money on him until he cashed this."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Swiss Roll",
      "description1": "Swiss roll dropped by the mysterious young girl. Says \"Courthouse Special\" on it.",
      "description2": "Swiss roll dropped by the mysterious young girl. It's priced at 2 for $6.",
      "description3": "Detective Gumshoe and Kay bought this Swiss roll together."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Det. Badd's Testimony",
      "description1": "He heard the gunshot right before the trial was about to start again."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Det. Gumshoe's Fingerprints",
      "description1": "Left on the hallway bench. Black smudge emits the scent of sweet sugar.",
      "description2": "Left on the hallway bench. Det. Gumshoe apparently sat here as he ate a Swiss roll."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Balloon Piece",
      "description1": "I just know I've seen a pink balloon around... Found on windowsill of the hallway window.",
      "description2": "Balloon popped by Kay. The Judge misheard its popping for a gunshot."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Promise Notebook",
      "description1": "Exchange diary between Mr. Faraday and Kay."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Ms. Yew's Perfume",
      "description1": "Perfume given to Badd by Yew. Same perfume as the one spilled in Lobby No. 1."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Mr. Faraday's Organizer",
      "description1": "Faraday wrote his strategy for winning in here."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Yatagarasu's Key",
      "description1": "Photo of key the Yatagarasu sent. Unusual shape.",
      "description2": "Photo of the key the Yatagarasu sent. Turns into knife."
    },
    {
      "currentChapter": "Turnabout Reminiscence",
      "name": "Surveillance Video",
      "description1": "Video of the Embassy staff member's murder. Gunshot is especially impactful."
    }
  ],
  "turns": [
    {
      "category": "rebuttal",
      "newContext": "Turnabout Reminiscence\n\n\n\n\n\n\n\n\n\nImage Gallery\n\nTranscript\nPart 1\n\nPart 2\n\nPart 3\nSeptember 10, 4:45 PM\nDistrict Court - 3rd Floor Lobby\nExamine evidence\n\n\n\n\n\n\n\n\n\nPlastic Bag\n\n\n\n\n\n\n\n\n\nBloodstain\n\n\n\n\n\n\n\nEdgeworth:\nIt would appear that this bag was actively used in the murder of Mr. Faraday.\nFranziska:\n! Wait... Isn't it possible that the killer left his fingerprints on the inside of this then!?\nEdgeworth:\nSorry, but it looks like the killer was very careful not to leave any evidence behind.\nFranziska:\n...Sounds like we have a very clever killer on our hands. Which means that, on second thought, maybe that detective didn't do it after all.\n\n\n\n\n\nMr. Faraday's Fountain Pen\n\n\n\n\n\n\n\n\n\nCap\n\n\n\n\n\n\n\nEdgeworth:\nHmm... It seems Mr. Faraday was in the habit of using very nice fountain pens.\nFranziska:\nReally? Because my papa uses fountain pens that are much, much nicer than this. The way he signs his name with those pens makes his signature look like pure art.\nEdgeworth:\n(...I'm surprised Mr. von Karma has to sign anything. I thought he'd have a crest stamp made!)\n\n\n\n\nNib\n\n\n\n\n\n\n\nEdgeworth:\nHmm... This looks like a quality nib.\nFranziska:\nHmph. Well, my ballpoint pen is much easier to write with.\nEdgeworth:\n...You're obviously still too young to appreciate the finer points of a fountain pen.\nFranziska:\n! Don't treat me like a child!\nEdgeworth:\n(Nngh...! I wouldn't have to if you would only grow up!)\nEdgeworth:\nSir... What is to become of the trial into the Cohdopian Embassy staff member's murder?\nManfred:\nIndeed. Since both the suspect and the prosecutor are now dead... ...the case will be dismissed. In other words, the trial ends here prematurely.\nFranziska:\nHah... Looks like you'll have to wait just a bit longer for your big debut.\nEdgeworth:\n...I suppose it can't be helped.\nManfred:\nThe evidence for this trial will be transferred to you in a little while.\nEdgeworth:\n......... Sir, what do you think about the murder of the Cohdopian Embassy staff member... ...and the murders of Mr. Faraday and Mr. Rell?\nManfred:\n...What an outrageous circus it has all become. That Faraday brought it all upon himself with his naïveté.\nEdgeworth:\nAn outrageous circus... Right, sir.\nManfred:\nI grow weary of this topic. Edgeworth, I will have you assigned to a different case.\nEdgeworth:\n.........\nFranziska:\nPapa! You'll come and watch my courtroom debut next, won't you?\nManfred:\nHmm... I'll consider it.\nEdgeworth:\n...Sir, if I may, please allow me to continue with my investigation.\nManfred:\nWhatever for?\nEdgeworth:\nI know that there is already a suspect in the murder of Mr. Faraday and Mr. Rell... ...however, there is not enough evidence to prove that it was he who committed the crime. I'd like to continue investigating in order to find the perfect proof of his guilt.\nManfred:\nThe perfect proof? Don't make me laugh! A worthless person like you has no right to claim such a thing as perfection!\nEdgeworth:\n..................\nFranziska:\n.........Umm, Papa? Who do you think is the real culprit behind these murders?\nManfred:\n..................\nFranziska:\nMiles and I, we're competing to see who can find the real killer first. Plus, being able to investigate a real crime scene is a really rare opportunity. It would give us some real-life experience, wouldn't you agree?\nManfred:\n...Hmph! If you want to investigate this case that much, then do as you wish.\nEdgeworth:\nThen, you're allowing us to continue...!?\nManfred:\nIn court, your top priority is to win, and a solid investigation is one of the keys to winning. We have to make sure you become recognized as a first-rate prosecutor, don't we? .........It wouldn't be very interesting otherwise. I'm returning home now. Edgeworth, Franziska! See to it I'm not disturbed, save for the results of your competition.\nEdgeworth:\n...Yes, sir!\nFranziska:\nOf course, Papa!\nEdgeworth:\nFranziska... Thank you.\nFranziska:\nWhat are you thanking me for? Your logic earlier was built on that scruffy detective's lie. That means that the competition is still on!\nEdgeworth:\nYes, just as you wished.\nFranziska:\nHmph... I couldn't let you get off so easily. Now then, let's see how well you fare on the investigation from here, Miles Edgeworth.\nEdgeworth:\n(I know I don't have enough information yet. So my first order of business will be to question anyone involved with this case...)\nTalk\n\n\n\n\n\n\n\n\n\nCalisto Yew\n\n\n\n\n\n\n\nEdgeworth:\nMs. Yew.\nYew:\nOh, it's you, Edgeworth. And who... are you? Wait... you were at the crime scene just now, weren't you?\nFranziska:\n...You should be disbarred for not knowing who I am. I am Franziska von Karma, and I am about to become the successor to the family name.\nYew:\nAbout to? I guess that means that for now, you're still just another kid. In which case, it's only natural that I didn't know who you are.\nFranziska:\nWh--!?\nEdgeworth:\nWh-Why are you whipping ME!?\nYew:\nPhwwwwwwwwh... Anyway, it looks like they're planning to hold the evidence a bit longer. If there's one thing I can't stand, it's waiting.\nEdgeworth:\nI'm terribly sorry, but I have a few (changed from [but a few] in the original release) more questions to ask of you.\nYew:\nPhwwh... Ahahahahaha! Look at you -- eyebrows scrunched, with lines on your forehead... And that, \"To ask of you\"! Ahahahahaha!\nEdgeworth:\nWh-What exactly is so funny!?\nYew:\nMnnpphwwwh... Sorry! I'm just bad at dealing with a super-serious atmosphere.\nEdgeworth:\n(Apparently, they failed to teach you proper behavior at a crime scene in law school.)\nYew:\nAh... Hoo. I feel much better now. So, what is it you want to talk about?\nEdgeworth:\nI'd like to inquire as to where you were at the time of the murder.\nYew:\nWe were in Defendant Lobby No. 1 the whole time, up until we heard the gunshot. And by \"we\", I mean Mr. Badd. If you don't believe me, feel free to ask him yourself.\nEdgeworth:\nYou were with Detective Badd? Why?\nYew:\nWe had a little something to discuss, that's all.\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nDetective Badd\n\n\n\n\n\n\n\nEdgeworth:\nSo, I take it that you are acquaintances with Detective Badd?\nYew:\nYeah, he was the detective in charge of the KG-8 Incident.\nEdgeworth:\n! Detective Badd is also related to that incident!?\nYew:\nThat's right. He was the one who was supposed to protect my sister, Cece. But you know how that turned out, don't you Edgeworth?\nFranziska:\nMiles Edgeworth! I have no idea what you two are talking about! I've heard of the KG-8 Incident from my papa... ...but how does that case relate to you, Ms. Yew?\nYew:\nThe victim of that case, Cece Yew, was my little sister.\nFranziska:\n.........!\nEdgeworth:\n..................\nYew:\nAhahahaha! You're making that super-serious face again! I'm fine... Really. I just make it a point to rub some more salt in his wounded pride every time I see him!\nEdgeworth:\n(The way she talks about doing that as she laughs away is kind of creepy...)\nYew:\nOh, speaking of Mr. Badd, he and Mr. Faraday... ...I'd say they met up just about every single time the Yatagarasu made a move. It was practically a given that the two would meet up at every one of the crime scenes.\nEdgeworth:\nI see. He did mention that he is in charge of the Yatagarasu investigation earlier. (Maybe I should ask her what she knows about the Yatagarasu in more detail...)\n\n\n\n\nYatagarasu (appears after \"Detective Badd\")\n\n\n\n\n\n\n\nEdgeworth:\nMs. Yew. I was wondering if you could tell me about the Yatagarasu.\nYew:\nThe Yatagarasu, huh... I don't really know much about that character myself. But I do get a lot of consultation requests from companies to defend them.\nEdgeworth:\nRequests from companies...?\nYew:\nThe Yatagarasu isn't some petty thief out for money, you know.\nFranziska:\nHmph. Alright then. Perhaps the Yatagarasu is in the business of stealing people's lives?\nYew:\n............ You're not very funny, or witty, are you, little Miss. von Karma?\nFranziska:\nGrr.........!\nEdgeworth:\nFranziska! Be careful about who you whip! Choose carefully, or we may be sued by... Nnghhoooh!\nFranziska:\nThere. I chose carefully, just like you wanted.\nYew:\nPhwwh... Mnnphwwwwwwh! Ahahahahaha!\nFranziska:\n.........?\nYew:\nAhah... Ahahahahahahahahaha! Th-That just now... was hilarious, little missy!\nFranziska:\nHmph. Of course it was.\nEdgeworth:\n(.........What is wrong with these two women!? Why does my pain give them delight?)\nFranziska:\nAnd? So, in the end, what is the Yatagarasu? I have to say, I had never even heard of this thief when I was in Germany.\nYew:\nThe Yatagarasu deals in information. Namely, in digging out dirt about back-room dealings and the like of companies. The Yatagarasu is a vigilante who steals such info and then makes it public for all to see.\nFranziska:\nHmph. Vigilante or not, this person sounds like just another criminal to me.\nYew:\nI suppose you could put it that way, too. But either way, I get a lot more clients now, thanks to that thief.\nEdgeworth:\n(...Sounds like Ms. Yew is profiting nicely.)\n\n\n\n\nTime of the murder\n\n\n\n\n\n\n\nEdgeworth:\nYou claim that at the time of the murder, you were with Detective Badd...\nFranziska:\n...But don't you lawyers usually discuss the trial with your clients during a recess?\nYew:\nWe do, and that's what I was planning to do. But Mr. Faraday was being rather threatening and he dragged Mr. Rell away. After that, Mr. Badd came into Lobby No. 1, so we just stayed there and talked.\nEdgeworth:\nAnd what did you talk with Detective Badd about?\nYew:\nPhwwwh... Nothing interesting. I just insulted him some... ...talked about how the trial was going... and then I insulted him some more.\nEdgeworth:\n(Bloody... When she's not laughing, her mouth seemingly spews nothing but insults.)\nYew:\nAnyway, Mr. Badd and I were in Defendant Lobby No. 1 when the murders occurred... ...so I really can't tell you anything about the hallway or Lobby No. 2.\nEdgeworth:\nI see.\n\n\n\n\nMack Rell\n\n\n\n\n\n\n\nEdgeworth:\nI'd like to ask you a few questions about your client, Mr. Mack Rell. Now, your client first claimed to be the Yatagarasu, is that correct?\nYew:\nYeah... Once I heard that it was the Yatagarasu that had made off with the evidence from KG-8... ...I began to ask Mr. Rell all sorts of questions, but to no avail. Turns out, Mr. Rell was not the Yatagarasu. He had just made that up.\nEdgeworth:\nHe made it up...?\nYew:\nMr. Rell's crime was caught on tape by the security cameras... ...but there is no footage of him sneaking into the Cohdopian Embassy itself.\nFranziska:\nHold on for just one second! Then, you mean to say that you knew that he was not the real Yatagarasu... ...and that he was just another cold-blooded killer? And you were ready to defend him!?\nYew:\nYes, that's right.\nEdgeworth:\nI see... So a defense lawyer is actually just someone whose job is to cover for criminals.\nFranziska:\nThat's why defense lawyers are so detestable! But they are no match for us Von Karmas!\nYew:\n.........Phwwh... Ahahahaha! I don't believe it! You're serious! Why don't you save that face for something really worth being serious about? And Edgeworth, do you remember what I said earlier? I... phwwh... have my own agenda. Phwwwh... I'm still on the hunt for leads regarding the KG-8 Incident, alright?\nEdgeworth:\nAnd for that, you have not a single qualm about defending a known killer...?\nYew:\n.........Don't put words in my mouth. I said no such thing.\nEdgeworth:\n.........\nYew:\nThe only way I had to get close to Mr. Rell was to be his lawyer. I had no intention of covering for him, ever. So don't you dare suggest I was going to.\nEdgeworth:\n...I'm sorry. Forgive my rashness.\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nKG-8 Incident Overview\n\n\n\n\n\n\n\nYew:\nMy sister was killed in that incident... And the defendant, Manny Coachen, got off scot-free due to a lack of evidence! It's so frustrating... The prosecution was a breath away from putting him away.\nEdgeworth:\n(She's not laughing at this particular topic... Although, it's to be expected.)\nYew:\n...Phwwwh! I can't believe what a forceful face you're making! Ahahahaha! That face is totally killing me!\nEdgeworth:\n(Nngh... Well that moment of seriousness was short-lived...)\n\n\n\n\nDet. Gumshoe's Testimony\n\n\n\n\n\n\n\nYew:\nCircumstantial evidence and a motive... It all points to that detective, doesn't it? On top of that, even his testimony turned out to be a lie. Well, that's what you get when you trust a criminal. They're all just liars in the end.\nEdgeworth:\n(All criminals are liars...? Well, at least we agree on something.) But that detective is telling a lie that is nothing but a disservice to himself...\nYew:\n...Phwwwh. You're really too naïve, Edgeworth.\nEdgeworth:\nHmph. You don't understand. If I should leave even the smallest mystery unsolved... ...I can't really claim to have conducted the perfect investigation.\nYew:\nPhwwh... \"The perfect investigation\"...!\nEdgeworth:\n(Speaking of... I fear that why she laughs when she does is a mystery I may never solve.)\n\n\n\nAfter clearing all Talk options:\nEdgeworth:\n(Hmm... I suppose I've gotten all I can out of Ms. Yew. I should move on and speak with Detective Gumshoe now.)\n\n\n\n\nDick Gumshoe (before clearing all Talk options with Calisto Yew)\n\n\n\n\n\n\n\nGumshoe:\nIt wasn't me, I tell ya! I didn't do anything wrong!\nOfficer:\nYes, I understand. So let's just calm down, OK buddy?\nEdgeworth:\n(I doubt I'll get anything useful from the detective while he is this agitated...)\n\n\n\n\nDick Gumshoe (after clearing all Talk options with Calisto Yew)\n\n\n\n\n\n\n\nEdgeworth:\nDetective Gumshoe.\nGumshoe:\nHey... It's you, pal! You're here. ...Yeeeeeooowwch!\nFranziska:\n...As am I.\nEdgeworth:\n(I don't think you needed to whip him to let him know that...)\nGumshoe:\nI-I didn't do it, pal! I swear on my honor as a detective! I really didn't!\nEdgeworth:\nYour words are useless. I place my trust only in the evidence, Detective. Once the investigation is fully over, and should we find out that you are the killer... ...there will be no mercy to be had for you.\nGumshoe:\nH-Have a heart, pal!\nEdgeworth:\nHmph. But you're not worried, right? After all, you have nothing to worry about, if you really are innocent, that is.\nGumshoe:\nThat's right! Hey, pal! Go and do your perfect investigation and get the real killer for me, will you?\nEdgeworth:\nHmph... I would've done so, even had you not requested me to, Detective.\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nMotive for murder\n\n\n\n\n\n\n\nEdgeworth:\nSo you and Mr. Faraday had a small \"meeting\" last week, did you? And what exactly did you do to make him so angry?\nGumshoe:\nI just asked Detective Badd the same thing myself, pal. Turns out, he was mad at me because on my very first day as a detective... ...I reported in at my usual post instead of the Criminal Affairs Department. By the time I got down to Criminal Affairs, I was really, really late. And that's when he gave me that huge speech...\nFranziska:\nI remember doing the same exact thing in elementary school. On the first day of school every year, I'd always wind up going to my old classroom.\nEdgeworth:\n(How pathetic for the Detective to be compared to a mere schoolchild.)\n\n\n\n\nDuring the recess\n\n\n\n\n\n\n\nEdgeworth:\nYou claimed to be standing guard in front of the door to Lobby No. 2 during the recess. However, when did you receive the order to do so, and from whom?\nGumshoe:\nUmm... earlier, at around 3:20. and from Detective Badd, pal. Today's trial took a really crazy turn... ...so I was told to make sure nothing happened to Mr. Faraday.\nFranziska:\nAnd yet, something did happen to him, correct? It looks like it was a total waste of manpower to assign you to guard duty.\nGumshoe:\nOwww! Your words sting worse than your whip, pal...\nEdgeworth:\n(So it was Detective Badd who ordered him to stand guard, huh...)\n\n\n\n\nNext step (appears after \"During the recess\")\n\n\n\n\n\n\n\nEdgeworth:\nNow then, Detective Gumshoe... Is there anything else you'd like to tell me?\nGumshoe:\n............N-Nope, not a thing, pal.\nFranziska:\nIn that case, allow us to take a look at what you are carrying on your personage.\nGumshoe:\nAh! Wait! You can't do that!\n\n\nFranziska:\n...There's nothing of any particular value here.\nGumshoe:\nWell, my handcuffs and badge were confiscated by Detective Badd, so, you know...\nEdgeworth:\nAnd what is that open envelope I see sticking out of your coat pocket?\nGumshoe:\nAh! Hands off, pal!\nFranziska:\nJust show it to us already!\nGumshoe:\nYeoooow!\nEdgeworth:\n\"Annual Bonus Check Within: $5.00 total\"... Except there is no check inside.\nGumshoe:\nYou've had your look, now give it back, pal! It's my first bonus as a brand-new detective! I just got it and cashed it today! I had literally no cash on me up until I did, you know. So that envelope is really special to me! Now give it back!\nFranziska:\nYou don't need rubbish like this. Don't worry, we'll throw it away for you later.\nGumshoe:\nHow could you...!?\nAnnual Bonus Envelope data jotted down in my Organizer.\n\n\n\n\nNext step (subsequent times)\n\n\n\n\n\n\n\nEdgeworth:\nNow then, Detective Gumshoe... Is there anything else you'd like to tell me?\nGumshoe:\n............N-Nope, not a thing, pal.\nFranziska:\nIn that case, allow us to take a look at what you are carrying on your personage.\nGumshoe:\nAh! Wait! You can't do that!\n\n\nFranziska:\n...There's nothing of any particular value here.\nGumshoe:\nWell, my handcuffs and badge were confiscated by Detective Badd, so, you know...\nEdgeworth:\nAnd what is that open envelope I see sticking out of your coat pocket?\nGumshoe:\nAh! Hands off, pal!\nFranziska:\nJust show it to us already!\nGumshoe:\nYeoooow!\nEdgeworth:\n\"Annual Bonus Check Within: $5.00 total\"... Except there is no check inside.\nGumshoe:\nYou've had your look, now give it back, pal! It's my first bonus as a brand-new detective! I just got it and cashed it today! I had literally no cash on me up until I did, you know. So that envelope is really special to me! Now give it back!\nFranziska:\nYou don't need rubbish like this. Don't worry, we'll throw it away for you later.\nGumshoe:\nHow could you...!?\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nAnnual Bonus Envelope\n\n\n\n\n\n\n\nEdgeworth:\nA bonus of $5.00? Even for a new, rookie detective, that's a bit low.\nGumshoe:\nYeah, even though I just got promoted, I guess I caught the attention of the higher-ups!\nFranziska:\nAt that amount, I'd have preferred to not receive one at all.\nGumshoe:\nYou just don't get it, pal! You don't get how great it feels to get your first bonus!\nEdgeworth:\nI suppose not. I have yet to receive my own bonus as a prosecutor.\nFranziska:\nHmph. Well, I received mine from my papa last December, like I do every year.\nEdgeworth:\n...That's not a bonus. That's a Holiday gift.\nFranziska:\n.........Whatever you want to call it, Miles.\n\n\n\n\nAnything else\n\n\n\n\n\n\n\nEdgeworth:\nI'd like to ask you a little about this...\nGumshoe:\nI'm not saying a peep, pal! 'Cause I'm not the killer, OK!?\nEdgeworth:\nYou misunderstand. I wasn't going to ask you about that...\nGumshoe:\nAll I've ever wanted to do was to become a detective, pal! So I'd never want to be a killer!\nEdgeworth:\n(It seems that he doesn't want to talk about anything unrelated to his predicament...)\n\n\n\n\n\n\nOfficer by water fountain\n\n\n\n\n\n\n\nOfficer:\nI-I can't stop the water, sir!\nEdgeworth:\nIt seems that the man who was here earlier broke it by drinking from it too much.\nFranziska:\nBunch of fools who pretended to not see the foolishly foolish actions of a foolish fool!\nEdgeworth:\nWell then, why don't you lend the officer a hand?\nFranziska:\nHmph. As if I should have anything to do with this. Besides, that water-drinking fool's mouth is the thing that officer should be covering. Let's give that officer a description of the water guzzler later.\nEdgeworth:\n(She seems to have quite the grudge... It sounds to me like someone wanted a drink...)\n\n\n\n\nOfficer in front of center door\n\n\n\n\n\n\n\nOfficer:\nUuuu...nnngh...\nEdgeworth:\nWhat's the matter, officer?\nOfficer:\nI've been standing here for forever, sir, and I really need to go to the bathroom...\nEdgeworth:\nWhy don't you just make a quick trip? The nearest one isn't that far, is it?\nOfficer:\nN-No, it's a short way down the hall beyond these doors, but... ...I don't want to be blamed for anything that might happen while I'm gone! So, I-I'm gonna hold it!!!\nEdgeworth:\n(...Perhaps Detective Gumshoe can be a positive influence on the force after all.)\n\n\n\n\nOfficer by courthouse model\n\n\n\n\n\n\n\nOfficer:\nWow! This thing is so incredibly detailed! My inner modeling fanboy is impressed!\nEdgeworth:\n(Hmm... I'm not exactly a fan of plastic models, per se... ...but even I can sense the superb quality of this model.)\nFranziska:\nI simply cannot comprehend how that man can feel so much love for such a trifle.\nEdgeworth:\nOh...? I-I see...\nFranziska:\nYou're a disciple of my father. So you would do well to guard yourself against an interest in such unproductive things.\nEdgeworth:\n(Yes, perhaps I should take up whipping people like the young lady over here...)\n\n\n\n\nOfficer on sofa\n\n\n\n\n\n\n\nOfficer:\nSir! Nothing to report, sir! ...ZZZzzz...\nEdgeworth:\nIs there no one who will make this man take responsibility for his actions on the job!?\nFranziska:\nLooks like we have no choice but to report this to Papa. Then, this guard can have fun in a waking nightmare after being awakened from his dream.\nEdgeworth:\n...Actually, let's not. I kind of feel sorry for him now.\nExamine\n\n\n\n\n\n\n\n\n\nBulletin board\n\n\n\n\n\n\n\nFranziska:\nMiles Edgeworth!\nEdgeworth:\nYes?\nFranziska:\nWhat is the meaning of this bulletin board!? Why are there so few trials posted!?\nEdgeworth:\nHmm... It would appear that the entire week is devoted to Mr. Rell's trial.\nFranziska:\nIs the crime rate really that low in this country? Or maybe... ...the police lack the proper motivation to get out there and catch the criminals?\nEdgeworth:\n...I'm afraid I can't comment on that, however... ...I can say I have my doubts about the younger detectives.\nFranziska:\nSounds to me like they're in need of a stricter hand. And I'll start my discipline regiment with that pathetic, filthy-coated detective.\nEdgeworth:\n(*sigh* I feel bad for the big guy... and yet, I can find no suitable reason to stop her...)\n\n\n\n\nCenter door\n\n\n\n\n\n\n\nOfficer:\nThis area is restricted to authorized personnel only, sir.\nFranziska:\nIf I'm not \"authorized personnel\", then what, may I ask, do you think I am?\nOfficer:\n...Um, the younger sibling of a dysfunctional relationship...?\nFranziska:\nI'm not the younger one! He is! Now get that straight in your head!!\nEdgeworth:\n(I believe there is a more objectionable part you should be upset over, Franziska.)\n\n\n\n\nCourthouse model\n\n\n\n\n\n\n\nFranziska:\nIt's an incredibly detailed model, isn't it?\nEdgeworth:\nI heard that it cost as much to make that as it cost to build the courthouse itself.\nFranziska:\nWhat was the point of making such an expensive model!?\nEdgeworth:\nI felt the exact same way upon hearing it.\nFranziska:\nUgh. It's so hard to understand such foolishness!\nEdgeworth:\nAgreed.\n\n\n\n\nBookshelf\n\n\n\n\n\n\n\nEdgeworth:\nIt's a bookshelf... Hm? What's this...? \"Judges' Trial Exchange Log\"? It appears to be a journal where the various judges share their thoughts and ideas. (The real daily lives of the judges are laid out here on these pages...)\nFranziska:\n...There's nothing about the court in here! It's just page after page of unrelated drivel!\nEdgeworth:\nJudging by the content, they are very enthusiastic about the courthouse's daily menu. ...And it would appear that fried oysters are a favorite.\nFranziska:\nI have no use for such foolishly foolish words from that foolishly foolish crowd.\nEdgeworth:\n(Someone please assure me that this is not the true state of this country's judiciary.)\nPartner\n\n\n\n\n\n\n\nFranziska:\nYes, what is it?\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nToday's trial\n\n\n\n\n\n\n\nFranziska:\nIt feels like there's a whole backside to this case we're not seeing.\nEdgeworth:\n(And here we had thought that it was a case where the two men had killed each other.)\nFranziska:\nWe're lacking in information. And as a Von Karma, I can hardly call this a perfect investigation.\nEdgeworth:\nIndeed, it is as you say.\nFranziska:\nAck...! I can't believe we agree on something...!\nEdgeworth:\n(Just what is so revolting about agreeing...?)\nFranziska:\nAnyway! Our first move should be to speak with everyone related to this case!\nEdgeworth:\nIndeed. Even if you had not said it, I was planning to do so anyway.\nFranziska:\n...!\nEdgeworth:\nArgnk! (What was that lash for!?)\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nProsecutor's Badge\n\n\n\n\n\n\n\nFranziska:\nDo you think you can win this competition by simply showing that to me?\nEdgeworth:\nNot at all. In fact, I was planning to thank you. I wouldn't be a prosecutor today without you and your father.\nFranziska:\n...I didn't really do much. You became a prosecutor first, that's all. But just you wait and see, Miles Edgeworth. Very soon, I'll be a prosecutor, too!\nEdgeworth:\nGood, then we can both send criminals away together as colleagues!\nFranziska:\nHmph... But you can be sure that I will always get more convictions than you.\nEdgeworth:\n(It's almost cute that she's going this far to insist that she'll always win... Almost.)\n\n\n\n\nKG-8 Incident Overview\n\n\n\n\n\n\n\nFranziska:\nThe KG-8 Incident, huh... The defendant was acquitted in that case, but I don't think we've seen the last of it.\nEdgeworth:\nThe fact that he was acquitted on a lack of evidence is just revolting. It's inexcusable!\nFranziska:\nWell, if it was [sic] my papa, he would've been found guilty in three minutes flat.\nEdgeworth:\nHeh... Indeed. We would do well to watch and study more from our mentor... ...so that we may secure a conviction for all those we try. That will be our rule.\nFranziska:\n...What's all this \"we\" business? Don't lump me in with you, Miles. Any suspect I come across... will confess everything to me before we even reach the trial! Hmph... I'll show you exactly who is the superior prosecutor!\nEdgeworth:\n(.........Clearly, only one of us is playing to win here.)\n\n\n\n\nHandgun or Knife\n\n\n\n\n\n\n\nFranziska:\nIt's one of the weapons in this case... I pity Mr. Faraday. It's bad enough to be killed with evidence that he prepared himself... ...but to also be killed in a courthouse of all places... ...and right in the middle of one of the trials he was running, too...\nEdgeworth:\nIt just goes to show that nothing in life is predictable.\n\n\n\n\nAnnual Bonus Envelope\n\n\n\n\n\n\n\nFranziska:\nScruffy's annual bonus envelope? What a useless piece of evidence.\nEdgeworth:\nYes, well, obvious point aside, what do you think about the low amount of money?\nFranziska:\nA pathetic amount for a pathetic detective. I think it rather suits him.\nEdgeworth:\nBut don't you think it's a bit too low, even for an officer like him?\nFranziska:\nBy his pay, I can tell he's a fool that I'd never trust anything to. A foolish fool like him would only blotch my record with foolishly foolish mistakes. Well, not that it matters. I'll never have to work with that pathetic fool anyway.\nEdgeworth:\n(That was a bit harsh... even for you, Franziska...)\n\n\n\n\nAnything else\n\n\n\n\n\n\n\nEdgeworth:\nI was wondering what you think of this piece of evidence.\nFranziska:\nAsking people for help is breaking the rules, Miles. As I said earlier, this is a competition! A battle of wits! If you want to ask someone for an opinion, you should start with yourself!\nEdgeworth:\n(...In other words, you have no real opinions about this piece of evidence, do you?)\nAfter clearing all Talk options with Dick Gumshoe:\nOfficer:\nI'm sorry, but I need to take him for questioning now...\nEdgeworth:\n(I think I've asked him just about everything I needed to... No, wait... Since he became a suspect, there is one piece of evidence I should re-confirm.) Officer, I ask that you wait a second. I still have one thing I'd like to re-confirm with Detective Gumshoe.\nOfficer:\nUnderstood! But please make it brief, sir.\nEdgeworth:\n(I want to hear it from the horse's mouth... I must confirm whether or not his testimony about when the crime occurred is the truth.)\nTalk\n\n\n\n\n\n\n\n\n\nDick Gumshoe\n\n\n\n\n\n\n\n\n\nPresent Det. Gumshoe's Testimony\n\n\n\n\n\n\n\nLeads to:\n\"You told me earlier that you heard no sound, other than the gunshot, out in the hallway.\"\nEdgeworth:\nYou told me earlier that you heard no sound, other than the gunshot, out in the hallway. Is that correct?\nGumshoe:\nNo mistake about it, pal!\nEdgeworth:\nHmm... then, you are also claiming that no one passed through the hallway either? Is that also correct?\nGumshoe:\n......Yup! Not even a single ant passed through that hall while I was on duty!\nEdgeworth:\nHmm... Hmmmmm... You do realize that the lie you're telling is only making life more difficult for yourself.\nGumshoe:\nHuh? ............Oh. B-But it's true! I didn't see anyone go through the hallway, and I didn't hear anything else, pal! I bet the killer found a way to kill the two guys that's beyond what I can even imagine!\nEdgeworth:\n......... (So he intends to continue telling this ridiculous lie... But why would he do so, given the situation he's in? I believe a thorough investigation... ...of the hallway in front of the defendant lobbies is in order.)\nGumshoe:\nAck! You...!\nEdgeworth:\nNnnghoooooooh!!\n???:\n*rasp* Phwwwwwwtt!\nFranziska:\n...How could you have not noticed that coming?\nEdgeworth:\nNnn...nghhhh...! (Wasn't that... the child I changed money for earlier...?)\n???::\nThanks! That's exactly what I needed!\nEdgeworth:\nKids... can sometimes be so cruel...\nFranziska:\nIt looks like she dropped something.\nSwiss Roll data jotted down in my Organizer.\nFranziska:\nMaybe we should arrest the girl? She might turn out to be a valuable lead.\nExamine evidence\n\n\n\n\n\n\n\n\n\nSwiss Roll\n\n\n\n\n\n\n\n\n\nFront side\n\n\n\n\n\n\n\nEdgeworth:\n\"Courthouse Special Swiss Rolls\"... Is this being sold somewhere on the premises?\nFranziska:\nI don't recall seeing a restaurant of any sort in this courthouse...\nEdgeworth:\nI somehow doubt you'd find junk food like this on a restaurant menu, Franziska...\nFranziska:\nWell then, where do they sell these things, huh!?\nEdgeworth:\nUmm... a convenience store, I suppose...\nFranziska:\nWell, I'm sure there's no convenience store in this courthouse, Miles Edgeworth!\nEdgeworth:\nGnnnrk! (...Where in the world did this come from?)\nEdgeworth:\nMnrgh... I believe some sort of punishment may need to be dealt the next time we meet... I believe I've asked all that I need to of this man. Now, for Detective Badd and the Judge...\nFranziska:\nWe have to confirm who is correct, the Judge or that scruff-face, right? I suppose we should inspect the hallway in front of Lobby No. 2 next, then.\nEdgeworth:\nHmm... I suppose so. Shall we head on over, Franziska?\nTalk\n\n\n\n\n\n\n\n\n\nDick Gumshoe\n\n\n\n\n\n\n\nEdgeworth:\nMay I have a word with you, Detective Gumshoe?\nGumshoe:\nArgh... What in the world am I supposed to do, pal...?\nFranziska:\nI don't think he'll be of much use right now. Let's continue with the investigation.\nEdgeworth:\nI suppose so. I propose we go and inspect the hallway he was standing guard in next.\nPartner\n\n\n\n\n\n\n\n\n\nNotice anything?\n\n\n\n\n\n\n\nFranziska:\nThat scruff-face's movements during the recess are really suspicious.\nEdgeworth:\nOh? I suppose you noticed it too, then.\nFranziska:\nOf course I did. Scruffy is giving us a testimony that is nothing but harmful to himself. Normally, criminals would tell the opposite type of lie in an attempt to escape.\nEdgeworth:\nYes... That is exactly the same point I'm having trouble understanding. (It seems that I need to expose what he was really up to during the recess. And to do that, I should head to the hallway where he was supposedly standing guard.)\nCourtroom No. 3\nExamine\n\n\n\n\n\n\n\n\n\nWitness stand\n\n\n\n\n\n\n\nEdgeworth:\nIt's the witness stand.\nFranziska:\nI'll make sure that each and every person that ever stands here will be found guilty!\nEdgeworth:\nThere are others besides the defendant that stand at this podium, you know.\nFranziska:\nI don't care! Just make sure you never end up standing at one of these... ...or you'll be sorry!\nEdgeworth:\n.........I'll keep that in mind.\n\n\n\n\nViewing gallery\n\n\n\n\n\n\n\nFranziska:\nIt's the viewing gallery. This is where the riffraff sit when they come to watch.\nEdgeworth:\nIt's situated at the same height as the Judge's bench... I wonder if that's to represent the intense scrutiny of each and every case from all sides?\nFranziska:\nMiles Edgeworth! Are you or are you not man enough to stand up to all those eyes!?\nEdgeworth:\nWhat sort of--!? Of course I'm man enough!\n\n\n\n\nProsecutor's bench\n\n\n\n\n\n\n\nFranziska:\nAny day now, I'll be taking my rightful place behind this bench.\nEdgeworth:\nBy that time, I should already be standing here.\nFranziska:\nIt'd be downright disgraceful if I beat you to it, wouldn't it?\nEdgeworth:\nIf that were to happen, Franziska... ...I'll eat my cravat.\n\n\n\n\nDefense attorney's bench\n\n\n\n\n\n\n\nEdgeworth:\nIt's the defense attorney's bench. .................. (I'd probably be standing on this side of the courtroom if that incident hadn't happened.)\nFranziska:\nWhat are you thinking about? Lately, the more wrinkly your face becomes, the less I'm able to read what you're thinking.\nEdgeworth:\nWell, I never--! I'll have you know, I don't have a single wrinkle upon my youthful brow!\n\n\n\n\nJudge's bench\n\n\n\n\n\n\n\nFranziska:\nThis must be the Judge's desk. You can tell by the gavel sitting on top.\nEdgeworth:\nI had a dream once that I was being squashed from above by this gavel.\nFranziska:\nYou're such a weakling, Miles Edgeworth.\nEdgeworth:\nYou have no idea how frightening it was.\n\n\n\n\nJudge's chair\n\n\n\n\n\n\n\nEdgeworth:\nThe Judge's chair... It must be wonderful to be able to sit the whole time.\nFranziska:\nYes, as apposed to us prosecutors and defense attorneys who have to stand. I think it'd only be fair if the Judge had to stand the whole time, too.\nEdgeworth:\nHis Honor is an old man. He should be afforded some comforts...\nFranziska:\nHmph! Fine, he can enjoy his chair, but he'll share in our pain through my lashes!\nEdgeworth:\n(I fear for the Judge if Franziska were to ever become a real prosecutor...)\nSeptember 10\nDistrict Court - Hallway\nBadd:\nSo... did you see anything else...?\nJudge:\nHmm... No, I don't think so.\nBadd:\nI see... Well, thanks for your cooperation...\nJudge:\nOh, it's nothing. Just doing my duty as a defender of the law.\nBadd:\n...That'll be all for now. I'll ask again if I have any other questions.\nJudge:\nAnytime, Detective. Now, if you'll excuse me, I have a few loose ends I have to tie up... Oh! You're that new prosecutor Mr. von Karma recommended, right?\nEdgeworth:\nMy name is Miles Edgeworth, Your Honor.\nFranziska:\nAnd I'm Manfred von Karma's daughter, Franziska von Karma. I'm set to become the successor to my genius father any day now, Your Honor!\nJudge:\nI see, Mr. New Prosecutor Recommended by Von Karma Miles Edgeworth, and Ms. Gen-- ...Ack...! ...I-I bhit mai tonnge.\nEdgeworth:\n...Are you alright, Your Honor?\nFranziska:\nPlease feel free to refer to me as just \"Ms. von Karma\", Your Honor. As for him... Just \"Edgeworth\" is fine.\nEdgeworth:\n(Apparently, SOMEBODY doesn't feel that I'm worthy of a proper title.)\nJudge:\nOho! Very well, then. I shall call you Ms. von Karma and Mr. Prosecutor Edgeworth.\nEdgeworth:\n...Your Honor, \"Mr. Edgeworth\" is fine, sir. Now, about your earlier testimony...\nJudge:\nYes? What about it, Mr. Edgeworth?\nEdgeworth:\nI would like to ask you a few questions about what exactly you saw.\nJudge:\nAlright. After all, it's my duty to clarify my testimony as a defender of the law.\nEdgeworth:\nI greatly appreciate your cooperation, Your Honor. (Now, the first thing I will need to do is figure out that detective's exact movements.)\nBegin Investigation\nHallway\nTalk\n\n\n\n\n\n\n\n\n\nTyrell Badd\n\n\n\n\n\n\n\nEdgeworth:\nDetective Badd, I have something I wish to inquire about...\nBadd:\n.........\nFranziska:\nHey! How about doing some actual work, you!\nEdgeworth:\n...I wish to inquire into Detective Gumshoe's movements during the recess.\nBadd:\n...You're getting in the way of the investigation.\nEdgeworth:\nI have an order from Mr. von Karma himself. Plus, I still hold investigative authority!\nBadd:\n...Tch.\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nDetective Gumshoe\n\n\n\n\n\n\n\nEdgeworth:\nSo I hear you were the one who called for Detective Gumshoe to come down here.\nBadd:\n...Faraday... That guy was just accused... you know? I just knew something was gonna happen... My detective's instinct told me.\nFranziska:\nA lot of good it did you. You couldn't even protect one, lone prosecutor with it.\nBadd:\n............!\nFranziska:\n!\nEdgeworth:\n\nEdgeworth:\n...Franziska, I think you need to apologize.\nFranziska:\n...Arghn...! ...I'm sorry.\nEdgeworth:\nI'm terribly sorry, Detective Badd. Please continue.\nBadd:\n.........Hmph. I used the phone on the first floor... and called the precinct... I told them to send somebody over. ...And that detective's the one that showed up.\nEdgeworth:\nHmm... And only upon his arrival did you set Detective Gumshoe to stand guard, Detective Badd?\nBadd:\n...Yeah. I waited for him on the first floor... After he got here, we came up to these defendant lobbies together. ...As we entered this hallway, we ran into Yew... She told us... that Faraday was really mad... ...and that he'd dragged Rell off to Lobby No. 2 to have a word or something... And... that Faraday had said... to not let anyone interrupt them. ...So what choice did I have? ...All I could do was tell the big lug to stand guard outside.\nEdgeworth:\nAnd around what time did all of that take place?\nBadd:\nLet's see... I think it was about... 30 minutes before I heard the gunshot. After giving the big lug his assignment... he never left the hallway, not once...\nFranziska:\nOh? And how can you make such a claim?\nBadd:\nHmph... One of the guards out in this floor's main lobby swore to me he didn't.\nEdgeworth:\nIf the detective never left the hallway... then where did he disappear off to?\nFranziska:\nHmph. That's simple. He must have gone into Lobby No. 2, just as I suspected.\nBadd:\nYew and I... We were in Lobby No. 1 next door. ...The only one without an alibi... is Gumshoe...\nEdgeworth:\n(Hmm... It would seem that I am still missing some key pieces of information.)\n\n\n\n\nThe gunshot\n\n\n\n\n\n\n\nEdgeworth:\nDetective Badd, you also heard the gunshot, did you not?\nBadd:\n...Yeah. I heard it when I was in Defendant Lobby No. 1... That's why I... came running towards Lobby No. 2 together with Yew...\nEdgeworth:\nHow much time elapsed between you hearing the gunshot and your arrival on the scene?\nBadd:\n...Less than a minute.\nEdgeworth:\nWhat were your movements upon hearing the gunshot?\nBadd:\nI grabbed the big lug, who was just walking around in the hall... ...and raced into Lobby No. 2... And that's when we discovered the bodies... in that order.\nFranziska:\nThat makes you the discoverer of the crime scene, right?\nBadd:\n...Yeah. I guess it does... little miss.\nFranziska:\nI am about to become a prosecutor very soon! You will treat me with the dignity I deserve, or else!\nBadd:\nHmph. You wave that thing around any more... ...and I'll have you arrested for obstruction... little miss.\nFranziska:\nYou wouldn't dare!\nBadd:\nHa ha... Just joking.\nFranziska:\nGnnnngh...\nEdgeworth:\n(Detective Badd is really something if he can make Franziska behave...!)\nBadd:\n...Are we... about done?\nEdgeworth:\n(Is there anything else I should ask him about...?)\n\n\n\nTime he heard the gunshot\n\n\n\n\n\n\n\nLeads to:\n\"I'd like for you to tell me the exact time you heard the gunshot.\"\n\n\n\n\nPlace he heard the gunshot\n\n\n\n\n\n\n\nEdgeworth:\nDetective Badd... Where were you when you heard the gunshot?\nBadd:\n...How many times are you going to ask that? I was in Defendant Lobby No. 1 when I heard the gunshot...\nEdgeworth:\n(Hmm... It's exactly the same as what he said earlier when I asked...)\nBadd:\n...Now, get out of here. ...You're getting in the way.\nEdgeworth:\n\nEdgeworth:\nI-I'm not through questioning you yet!\nLeads back to:\n\"Is there anything else I should ask him about...?\"\n\n\n\n\nSituation around the gunshot\n\n\n\n\n\n\n\nEdgeworth:\nI'd like to know a little more about the circumstances under which you heard the gunshot.\nBadd:\n...Like I said, I was in Lobby No. 1 with Yew. ...I have nothing else to add.\nEdgeworth:\n(Well, his testimony certainly corroborates with what Ms. Yew said...)\nFranziska:\nMiles, you already asked him about that, remember?\nEdgeworth:\nHmm... (I suppose I should ask about something else...)\nLeads back to:\n\"Is there anything else I should ask him about...?\"\n\n\nEdgeworth:\nI'd like for you to tell me the exact time you heard the gunshot.\nBadd:\n...It was around the end of the recess, and the trial was about to start again... I think. He was supposed to make time for himself to transfer the evidence he was holding... ...but I got the sense he wasn't gonna show for the hand-off... So I figured I should go get him, or he'd be late... And just as I thought that... Bang...! The sound of a gunshot hit my eardrums...\nEdgeworth:\n(So he heard the gunshot right before the trial was about to re-start, huh...)\nDet. Badd's Testimony jotted down in my Organizer.\n\n\n\n\nThe gunshot (subsequent times)\n\n\n\n\n\n\n\nEdgeworth:\nDetective Badd, you also heard the gunshot, did you not?\nBadd:\n...Yeah. I heard it when I was in Defendant Lobby No. 1... That's why I... came running towards Lobby No. 2 together with Yew...\nEdgeworth:\nHow much time elapsed between you hearing the gunshot and your arrival on the scene?\nBadd:\n...Less than a minute.\nEdgeworth:\nWhat were your movements upon hearing the gunshot?\nBadd:\nI grabbed the big lug, who was just walking around in the hall... ...and raced into Lobby No. 2... And that's when we discovered the bodies... in that order.\nFranziska:\nThat makes you the discoverer of the crime scene, right?\nBadd:\n...Yeah. I guess it does... little miss.\nFranziska:\nI am about to become a prosecutor very soon! You will treat me with the dignity I deserve, or else!\nBadd:\nHmph. You wave that thing around any more... ...and I'll have you arrested for obstruction... little miss.\nFranziska:\nYou wouldn't dare!\nBadd:\nHa ha... Just joking.\nFranziska:\nGnnnngh...\nEdgeworth:\n(Detective Badd is really something if he can make Franziska behave...!)\nBadd:\n...Are we... about done?\nEdgeworth:\n(Is there anything else I should ask him about...?)\n\n\n\nTime he heard the gunshot\n\n\n\n\n\n\n\nLeads to:\n\"I'd like for you to tell me the exact time you heard the gunshot.\"\n\n\n\n\nPlace he heard the gunshot\n\n\n\n\n\n\n\nEdgeworth:\nDetective Badd... Where were you when you heard the gunshot?\nBadd:\n...How many times are you going to ask that? I was in Defendant Lobby No. 1 when I heard the gunshot...\nEdgeworth:\n(Hmm... It's exactly the same as what he said earlier when I asked...)\nBadd:\n...Now, get out of here. ...You're getting in the way.\nEdgeworth:\n\nEdgeworth:\nI-I'm not through questioning you yet!\nLeads back to:\n\"Is there anything else I should ask him about...?\"\n\n\n\n\nSituation around the gunshot\n\n\n\n\n\n\n\nEdgeworth:\nI'd like to know a little more about the circumstances under which you heard the gunshot.\nBadd:\n...Like I said, I was in Lobby No. 1 with Yew. ...I have nothing else to add.\nEdgeworth:\n(Well, his testimony certainly corroborates with what Ms. Yew said...)\nFranziska:\nMiles, you already asked him about that, remember?\nEdgeworth:\nHmm... (I suppose I should ask about something else...)\nLeads back to:\n\"Is there anything else I should ask him about...?\"\n\n\nEdgeworth:\nI'd like for you to tell me the exact time you heard the gunshot.\nBadd:\n...It was around the end of the recess, and the trial was about to start again... I think. He was supposed to make time for himself to transfer the evidence he was holding... ...but I got the sense he wasn't gonna show for the hand-off... So I figured I should go get him, or he'd be late... And just as I thought that... Bang...! The sound of a gunshot hit my eardrums...\nEdgeworth:\n(So he heard the gunshot right before the trial was about to re-start, huh...)\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nKG-8 Incident Overview\n\n\n\n\n\n\n\nEdgeworth:\nThe KG-8 Incident... I heard that you were involved in this case as well.\nBadd:\n...Yeah.\nEdgeworth:\n............\nBadd:\n............\nEdgeworth:\n...Th-That's all you have to say?\nBadd:\n...It was an unpleasant case that I don't wish to recall... I've got a lot of regrets I'll never forget related to that. Regrets I'll take to the grave.\nEdgeworth:\n(Does he really have that many regrets...? On the other hand, thinking back on what I know, I suppose he just might...)\n\n\n\n\nMr. Faraday's Fountain Pen\n\n\n\n\n\n\n\nBadd:\nFaraday...\nEdgeworth:\nIt sounds like you lost someone close to you.\nBadd:\n...He was a battle-buddy. We fought through a lot together... A boy with a silver spoon in his mouth couldn't possibly understand (changed from [understand] in the original release) society's dark underbelly.\nEdgeworth:\nGrr... (Although, honestly, I suppose he's right. I don't have anyone I relate to in that way... Well, it's not as though I long for someone like that... Nor am I good at getting close...)\n\n\n\n\nDet. Badd's Testimony\n\n\n\n\n\n\n\nBadd:\nIt's just as I said... I have nothing further to add. But if there's one thing a detective honors, it's that... ...you must have confidence in, and take responsibility... for anything you say... That's what it means to be a detective...\nEdgeworth:\n(In other words, you're just another stubborn horse, aren't you, Detective?)\n\n\n\n\nAnything else\n\n\n\n\n\n\n\nEdgeworth:\nDetective Badd, I'd like to ask you about this piece of evidence.\nBadd:\n..................\nFranziska:\nHmph. What a narcissist! He'd rather look at his face than the evidence!\nBadd:\n...Don't trust your eyes all the time, little girl... I can see the evidence... and keep an eye on the two of you with this mirror...\nFranziska:\nWhat--!? Then why don't you answer!?\nBadd:\nBecause I've got nothing to say... That's all.\nEdgeworth:\n...Understood. (Why couldn't he have just said that at the beginning?)\n\n\n\nAfter clearing all Talk options:\nBadd:\n...Are we done here? I don't have any time to waste...\nFranziska:\n\nFranziska:\nOh, come on. All you're doing is standing in front of this door, doing nothing.\nBadd:\n.........Hmph.\nEdgeworth:\n(I get the sense that he is somewhat investigating this crime scene... Or rather, that he is keeping us under surveillance... But to what end...?) ...Detective Badd, may I ask that you cooperate with us for just a bit longer?\nBadd:\n...I don't have anything else to say.. to the two of you... You guys... were the ones who said you wanted to investigate in the first place.\nFranziska:\nFine then! Be obstinate! We'll just do as we please! Come on, Miles!\nEdgeworth:\n...You may no longer be willing to help us, however... ...may I ask for the forensic scientists' cooperation?\nBadd:\n.........Do as you like...\n\n\n\n\nJudge\n\n\n\n\n\n\n\nEdgeworth:\nYour Honor, I'd like to ask you a few questions, if you don't mind. Where were you at the time of the murder?\nJudge:\nI-I-I-Do you suspect me of something!?\nEdgeworth:\nNo, nothing of the sort, Your Honor...\nJudge:\nAhem! V-Very well, you may continue with your testimony.\nEdgeworth:\n...Your Honor, it's your testimony I'm after.\nJudge:\nOh! I had no idea you were chasing after me or my testimony...\nEdgeworth:\n(I'm beginning to sense that I might want to avoid being in a trial run by this judge...)\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nTime of the murder\n\n\n\n\n\n\n\nLeads to:\n\"Let's see here... Now then, how should I put this...?\"\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nProsecutor's Badge\n\n\n\n\n\n\n\nEdgeworth:\nToday's trial may have ended abruptly, but we will meet again.\nJudge:\nHo ho ho. I'm looking forward to that day, Mr. Edgeworth.\nFranziska:\nWhen I become a prosecutor, you might even see me in your courtroom a few times. I hope you'll treat me with even greater respect than now.\nJudge:\nI-I only ask that you please do not bring a whip into my courtroom!\nFranziska:\nHmph. I'm afraid that issue is not up for negotiation.\nEdgeworth:\n(As long as the whip can't reach his seat, I'm sure His Honor will be safe... I think.)\n\n\n\n\nSwiss Roll\n\n\n\n\n\n\n\nJudge:\nOh! It's a Courthouse Special Swiss Roll! It has such a nice, fluffy texture, and just the right amount of sweetness to it. And it's made from all-natural ingredients... ...so of course, it's easy to digest as well!\nEdgeworth:\nHmm... I see...\nJudge:\nActually, they decided only recently to sell these rolls as the Courthouse Special. Of course, I've been sending in my special requests all along. Why don't you try sending in a request once in a while?\nEdgeworth:\n(I suppose I'll just have to think of a good suggestion by the next time I come here...)\n\n\n\n\nDet. Badd's Testimony\n\n\n\n\n\n\n\nJudge:\nYou wish to ask about Detective Badd? Well, he is one well-honored detective. He doesn't say much and he doesn't really like people, but he has quite a few wounds.\nEdgeworth:\nYes, I figured as much...\nFranziska:\nHe has such a bad habit of randomly treating people as though they were children.\nJudge:\nAh, but if you were in pursuit of a criminal, there's no one I'd trust more with my life. Even in the middle of a fierce gunfight, Detective Badd doesn't lose his cool.\nEdgeworth:\nAren't you exaggerating just a bit? I mean, what detective doesn't value his or her life?\nJudge:\nNo, no, you don't understand. He got all those holes in his jacket from all the gunfights he's gotten in fighting crime! You should learn about him if you want to be a part of the world of law enforcement.\nEdgeworth:\n(Something tells me that I should strive to stay on that detective's good side...)\n\n\n\n\nAnything else\n\n\n\n\n\n\n\nEdgeworth:\nYour Honor, I'd like for you to please take a look at this piece of evidence.\nJudge:\nVery well. The court will accept this into evidence.\nEdgeworth:\nN-No, wait! That's not what I showed it to you for!\nJudge:\nHmm... Mr. Edgeworth. If I may, I suggest you bone up on court procedure a bit more. When evidence is shown before me, it goes into evidence. That is the law of the court.\nEdgeworth:\nYour Honor... I'm sorry to say this, however, that rule does not apply to the outside world.\nJudge:\nHmm, come to think of it, I suppose court is not in session right now.\nEdgeworth:\n(...Being passionate about one's work is one thing, but to confuse it with real life...)\n\n\n\nJudge:\nLet's see here... Now then, how should I put this...? When you get to be my age... you need to pay more frequent visits to the restroom.\nEdgeworth:\nHmm...\nJudge:\nIf you go take a look through the window at the end of this hall, you'll see a small window. That is the window to the men's restroom. In other words, you can see clearly into this hallway from the men's restroom.\nEdgeworth:\n..................\nJudge:\nWhen I was going into the restroom, that detective... Gumshoe, is it...? Well, he was standing in front of the vending machines buying something from it.\nEdgeworth:\n...Hmm...\nJudge:\nHowever! And this I couldn't believe... When I was about to exit the restroom... ...there was not a soul in the hallway anymore!\nEdgeworth:\nYour Honor... If you could please calm down and explain it to me rationally...\nJudge:\nOh! I'm really sorry. Please let me regain my composure... It was really suspicious! That's what my finely-honed judge's intuition said! Although, well, until the murders occurred, I just sort of brushed it off. Ho ho ho.\nEdgeworth:\n(Apparently, this judge doesn't understand the concept of \"staying calm\"... \n\n\n\nIf open window has been examined\n\n\n\n\n\n\n\nEdgeworth:\nHmm... The restroom window, huh...\nFranziska:\nI wonder if you can really see the men's bathroom window from that one there?\nEdgeworth:\nYou can. I'm looking at it right now.\nFranziska:\n...I demand that you show me this view at once!\nEdgeworth:\nI suspect that her height is what's limiting her ability to see...\n\n\nEdgeworth:\n(That's probably all I'm going to find out from His Honor...)\nJudge:\nMr. Edgeworth, may I return to my other duties now?\nEdgeworth:\nYes, I'm sorry to have held you up. Thank you for your cooperation, Your Honor.\nJudge:\nHo ho ho. Anytime, Mr. Edgeworth! Anytime!\nFranziska:\nThe judges in this country seem rather friendly.\nEdgeworth:\nYes... if not a little wishy-washy. However, I hear that they are known to hand down very fair verdicts.\n\n\n\n\nOfficer under vending machine\n\n\n\n\n\n\n\nEdgeworth:\nDid you find something, officer?\nForensics:\nI think there's a 5 dollar bill back there! ...Come on... ...Just a little more...\nFranziska:\nIs there no one working this crime scene who isn't a total waste of living tissue?\nEdgeworth:\nUnfortunately, there doesn't seem to be a single person we can deem useful here.\n\n\n\n\nOfficer by door\n\n\n\n\n\n\n\nEdgeworth:\nHave you found any suspicious fingerprints, officer?\nForensics:\nNope. Just the fingerprints of those involved with the case, sir.\nFranziska:\nI guess we know all of the players in this case then, huh?\nEdgeworth:\nIt would appear that way... but I have the nagging feeling that we're missing something. (And I suspect that what we're missing is hiding right here in this crime scene somewhere!)\nExamine\n\n\n\n\n\n\n\n\n\nSofa\n\n\n\n\n\n\n\nEdgeworth:\n(I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\nCactus\n\n\n\n\n\n\n\nEdgeworth:\n...Unnrgh!\nFranziska:\nWhat's the matter?\nEdgeworth:\nI pricked myself on one of this cactus's needles. I didn't think the needles on this thing would be so sharp.\nFranziska:\nWell? What did you expect? Can you imagine how bad it would be if you were hit on the head by one of these? Anyway, this cactus seems to be unrelated to our case.\nEdgeworth:\nDo you really think so? Because I believe that this cactus sitting on this windowsill (Windowsill cactus - Potted cactus sitting on the hallway window's windowsill. Its needles are dangerous.) is completely related.\nFranziska:\n...Oh? Well then, I look forward to your explanation on how exactly it is related.\n\n\n\n\nPink object\n\n\n\n\n\n\n\nEdgeworth:\nHm? What... is this? It's a pink-colored piece of trash (Pink piece of trash - Piece of pink trash found on the windowsill of the hallway window. Made of rubber.)... made of rubber. Hmm... I feel like I've seen something like this before...\nFranziska:\nWell, all I see is a piece of garbage. But you know... the fact that there is a litterer running loose inside this courthouse... It's simply unforgivable!\nEdgeworth:\nAck-! It's not like it was I who littered!\nFranziska:\nRubbish belongs in a rubbish bin!\nEdgeworth:\nGnnnrk!\n\n\n\n\nOpen window\n\n\n\n\n\n\n\nEdgeworth:\nI can look outside... however, I doubt the killer could've escaped through here.\nFranziska:\nOf course not. This IS the third floor, after all.\nEdgeworth:\nHmm... It appears that bars were installed on this to prevent people from falling out.\nFranziska:\nBars? What bars?\nEdgeworth:\n...Can you not see them from your vantage point?\nFranziska:\n.........\nEdgeworth:\nWh--!? (I must remember not to bring up that taboo subject again...)\n\n\n\n\nOpen window (after clearing Talk option with the Judge)\n\n\n\n\n\n\n\nEdgeworth:\nSo that window on the other side belongs to the men's restroom...\nFranziska:\n...I can't see it.\nEdgeworth:\nAt your height? I'm not surprised.\nFranziska:\n.........!\nEdgeworth:\nNnghoooooooh! (I guess short people have feelings too!)\n\n\n\n\nAnts\n\n\n\n\n\n\n\nEdgeworth:\nThe ants are hard at work carrying their food home. It's a marvel that they can pick up such comparatively large objects to their size.\nFranziska:\nWell, if you want to carry the mighty Von Karma name and not be squished under it... ...you'd better work extra hard, just like these ants.\nEdgeworth:\n.........The same goes for you, Franziska.\n\n\n\n\nSofa\n\n\n\n\n\n\n\nEdgeworth:\nAnts are pouring out of the hole in this bench as well. I wonder if the inside of this bench consists of nothing but ants...?\nFranziska:\nDon't you dare continue with that gross line of thought!\nEdgeworth:\nUnnrk! I-I'm sorry.\n\n\n\n\nHandprint\n\n\n\n\n\n\n\nEdgeworth:\nThe dirt on this bench... It smells like some sort of sweet substance.\nFranziska:\nI can't believe there is someone going around dirtying the courthouse! For shame!\nEdgeworth:\n\nEdgeworth:\nC-Calm down, Franziska... Now, take a good look. Doesn't this smudge look kind of like a handprint to you?\nFranziska:\n...I suppose it could be.\nEdgeworth:\nWhich means... ...that perhaps we can lift the prints of the person who sullied this bench!\nFranziska:\nI see... And then, we'll know the identity of our mystery slob.\nEdgeworth:\nYou there! The lab technician! Could you please find out who this handprint belongs to?\nForensics:\nSir! Yes, sir!\n\n\nForensics:\nI've got the results of the fingerprint analysis, sir!\nEdgeworth:\nAnd? Do we know who they belong to?\nForensics:\nSir! The fingerprints belong to Detective Gumshoe!\nEdgeworth:\nOh...? Interesting. Good work, officer.\nDet. Gumshoe's Fingerprints data jotted down in my Organizer.\nFranziska:\nAnd there you have it...\nEdgeworth:\nYes, I suppose so.\nFranziska:\nNow we know the identity of the person who dirtied the bench...!\nEdgeworth:\n(.........I sense that you and I will be using this information in very different ways...)\n\n\n\n\nHandprint (subsequent times)\n\n\n\n\n\n\n\nEdgeworth:\nSo the one who sullied the bench turns out to be Detective Gumshoe. We know thanks to the fingerprints he left.\nFranziska:\nWhat a slob, dirtying the bench like this! That scruff-face is going to receive a good whipping from me when next we meet!\nEdgeworth:\n(As if he isn't being punished enough by everything that's going on, Franziska...)\n\n\n\n\nPile of ants on ground\n\n\n\n\n\n\n\nFranziska:\nWhat are these black speckles?\nEdgeworth:\nI believe it's a pile of ants, eating away.\nFranziska:\nOooh... That detective...! He claims that not a single ant slipped by him... ...and yet, here is a whole hill of them!\nEdgeworth:\nGnaaack! Wh-What are you hitting ME for!?\nFranziska:\nAs a replacement for that pathetic detective!\nEdgeworth:\nNngh... (Perhaps I should add this deduction to the detective's growing tab of pay cuts...)\nFranziska:\nAnyway, I wonder what the ants are eating?\nEdgeworth:\nFrom the look and sweet smell of it, pieces of cake and chocolate from a Swiss roll (Swiss roll crumbs - Found on the floor under the bench. A hill of ants are attracted to their sweet scent.).\nFranziska:\n...Miles Edgeworth... The courthouse is to be kept pristine at all times!\nEdgeworth:\nNnghooooh! I-It wasn't me that dropped food on the ground!\nFranziska:\nThe courthouse! Must be! Kept clean!\nEdgeworth:\nNnnghooooooh!\n\n\n\n\n\nSofa (after examining  cactus, pink object, handprint, and pile of ants on ground)\n\n\n\n\n\n\n\nEdgeworth:\n(I already checked this area earlier, but it never hurts to take another look.)\n\n\n\n\nVending machine on left\n\n\n\n\n\n\n\nFranziska:\nHmm... It would appear that this vending machine (Vending machine - A vending machine that sells Courthouse Special goods. A few sweet items are for sale.) sells snacks and various other foods.\nEdgeworth:\nJust lovely. What will they think of next?\nFranziska:\n\"Don't be a jerk in court like these beef jerks!\" ......One packet for $9. \"Defendant's Fresh Milk!\" ......One half-pint for $7. \"Stay neutral as the Swiss do until the end with these!\" ......For $6. ...They're awfully overpriced.\nEdgeworth:\n(The line-up is simply awful. Period.)\nFranziska:\nSpeaking of snacks... I wonder if that Swiss roll the little girl dropped is from this machine?\nEdgeworth:\nHmm, I was wondering about that myself.\n\n\n\nHot dog\n\n\n\n\n\n\n\nEdgeworth:\n\"When you're in hot water, you might need a hot dog.\" .................. Hmm... It looks like this slogan was decided through a public contest. And the winner was... Prosecutor Winston Payne...?\nFranziska:\nHmph. What a pathetic slogan. No presence at all! Now, if it was [sic] up to me, it would read... \"If you leave matters in a Von Karma's hands, everyone in court will be found guilty dogs!\"\nEdgeworth:\n............\nEdgeworth:\n\nFranziska:\nOverruled!\n\n\n\n\nBeef jerky\n\n\n\n\n\n\n\nEdgeworth:\n\"Don't be a jerk in court like these beef jerks!\" I see...\nFranziska:\n\nFranziska:\nMiles Edgeworth! Wouldn't you agree that it's a very clever pun?\nEdgeworth:\nDo you really think they put that much effort into the product name?\nFranziska:\nEven a foolish fool could understand the foolish thinking of the fool who made it up! You're acting so foolishly that I got so thoroughly mad, and am now utterly famished!\nEdgeworth:\n......If you wanted a pack of these, all you had to do was ask like a normal person.\n\n\n\n\nHam sandwich\n\n\n\n\n\n\n\nEdgeworth:\n\"Don't let the prosecution and the defense make a ham sandwich out of you!\"...?\nFranziska:\nIt sounds like it's directed at that ham of a Judge.\nEdgeworth:\nWell, it certainly isn't directed at me. I can out-maneuver him any day.\n\n\n\n\nOrange juice\n\n\n\n\n\n\n\nEdgeworth:\n\"When it's looking bad, blind your opposition with some OJ!\" Are they promoting violence?\nFranziska:\nDon't worry. My whip will make sure that anybody following this advice won't be for long.\nEdgeworth:\n(Compared to the sting of a whip, the sting of orange juice may not be so bad...)\n\n\n\n\nMilk\n\n\n\n\n\n\n\nEdgeworth:\n\"Defendant's Fresh Milk!\"... What exactly is that supposed to mean?\nFranziska:\nI bet it means that the milk is freshly milked by various defendants on trial right now.\nEdgeworth:\nNo, I think it might mean that this was milked right here from the various defendants.\nFranziska:\nMiles Edgeworth... You can't possibly be serious!\nEdgeworth:\n...Of course not.\n\n\n\n\nSwiss rolls\n\n\n\n\n\n\n\nFranziska:\n\"Stay neutral as the Swiss do until the end with these!\" ...The end of what?\nEdgeworth:\nWell, I assume it means the end of the trial. I suppose this means that one should eat these during a recess...?\nFranziska:\nYou can't eat during a trial, so I suppose the only time you can eat them is now, huh!\nEdgeworth:\nI wouldn't mind if you wanted to eat one now. They come in packs of two, after all.\nFranziska:\nHmph. We're in the middle of an investigation! Besides, I don't have $6 on me!\nEdgeworth:\nIf you want, we can pool our money and buy a pack together.\nFranziska:\nIf I have to split it with you, then I don't want it!\n\n\n\n\n\nOrange vending machine (subsequent times)\n\n\n\n\n\n\n\nEdgeworth:\n(I already checked this area earlier, but it never hurts to take another look.)\n\n\n\n\nBlue vending machine\n\n\n\n\n\n\n\nFranziska:\nIt doesn't look like there's anything contradictory left in this area...\nEdgeworth:\nHmm... I suppose not. (Perhaps I should check somewhere else.)\n\n\n\n\nPoster\n\n\n\n\n\n\n\nFranziska:\n...He's making a most ridiculous-looking face.\nEdgeworth:\nThat may be, but at least he doesn't look like someone who would tell a lie on purpose.\nFranziska:\nI suppose. But to a Von Karma, evidence is the only thing that carries any weight.\nEdgeworth:\nOf course. At any rate, this poster seems to be of no use to us right now.\n\n\n\n\nFire extinguisher\n\n\n\n\n\n\n\nEdgeworth:\nThere are no signs that this fire extinguisher was used in the crime.\nFranziska:\nIf you could already tell from a distance, then why are you wasting your time examining it?\nEdgeworth:\nFranziska, let's not try to rush absolute genius.\nLogic\n\n\n\n\n\n\n\n\n\nConnect \"Windowsill cactus\" and \"Pink piece of trash\"\n\n\n\n\n\n\n\nEdgeworth:\nThis pink, rubbery substance... I saw this in a different form earlier today. I believe this is a piece of a popped balloon.\nFranziska:\nI suppose that's possible.\nEdgeworth:\nThe balloon probably got a little too close to our friend, the windowsill cactus.\nFranziska:\n...That would be the logical conclusion, yes.\nBalloon Piece data jotted down in my Organizer.\n\n\n\n\nConnect \"Vending machine\" and \"Swiss roll crumbs\"\n\n\n\n\n\n\n\nEdgeworth:\nThese bits of chocolate and cake... Could they not have come from a Swiss roll?\nFranziska:\nA Swiss roll? Why would a courthouse sell a thing like that?\nEdgeworth:\nIt may not seem like the right venue... however, it IS being sold right over there.\nFranziska:\nThe vending machine...? Ah, I see. \"Stay neutral as the Swiss do until the end with these!\" Two for $6!? Talk about expensive.\nEdgeworth:\n(Leaving the fact that it's on the expensive side aside... ...the fact that the cake crumbs and chocolate bits were found in this hallway... ...suggests that they came from a Swiss roll that was purchased from this machine.)\nPartner\n\n\n\n\n\n\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nNotice anything?\n\n\n\n\n\n\n\nFranziska:\nThis is a pretty spacious hallway, but it's nothing compared to the ones at home.\nEdgeworth:\nIndeed... (...because the house itself (changed from [Mr. von Karma's house] in the original release) is a bit TOO spacious.)\nFranziska:\nHowever, even with this much space, there's nowhere for that scruff-face to hide. Well, other than the crime scene just beyond those doors.\nEdgeworth:\nFranziska, I believe it's much too early to draw any conclusions. (It was already proven that Detective Gumshoe was in this hallway the entire time. Now all we need to do is gather more information. And to do that, I'll just have to examine everything I see here by myself.)\n\n\n\n\nHallway window (after clearing Talk option with the Judge)\n\n\n\n\n\n\n\nFranziska:\nSo, according to the Judge, someone looking through the restroom window... ...that you can see from the window at the end of this hall, can see into this hall? I wonder exactly how true that statement is, don't you?\nEdgeworth:\nWell, it IS possible to get a pretty clear view of this hallway from that restroom.\nFranziska:\n...Is there really a men's bathroom window through the window at the end of this hall?\nEdgeworth:\nOf course. ...Can you not see it?\nFranziska:\n...!\nEdgeworth:\nArrnngh!\nFranziska:\nI demand that you show me this view at once!\nEdgeworth:\n(I suppose I should go examine that window once again anyway...)\n\n\n\n\nThe crime scene (after examining cactus, pink object, pile of ants on ground, and orange vending machine)\n\n\n\n\n\n\n\nFranziska:\nWe've gathered so much information, but they feel like just random fragments to me. I wonder what really happened here?\nEdgeworth:\n(Random fragments...? No matter how unrelated they may seem at first, they might actually fit together somehow.)\nFranziska:\n.........I grow tired of your inner monologues! Say something!\nEdgeworth:\nArnngh! (I'm going to end up in pieces before I can piece the logic together, thanks to that whip (changed from [thanks to that whip before I can piece the logic together] in the original release).)\nAfter connecting \"Vending machine\" and \"Swiss roll crumbs\" Logic and examining handprint on sofa:\nEdgeworth:\nHmm... I think I have a pretty clear picture of what happened here now.\nFranziska:\nHmph. Naturally. After all, I'm here, aren't I?\nEdgeworth:\nDetective Gumshoe must have sat on this bench as he ate a Swiss Roll. And as he ate, he dropped it on the floor, and sullied the bench.\nDet. Gumshoe's Fingerprints data updated in my Organizer.\nFranziska:\nUgh! How could he have not cleaned up after himself!? How utterly despicable!\nEdgeworth:\nDon't dare you whip me again! It wasn't I who made the mess in the first place! Anyway... If it was indeed Detective Gumshoe who bought the Swiss roll... ...that creates a rather interesting contradiction of facts.\nFranziska:\nA contradiction...? Where?\nEdgeworth:\nHmph... I think another look at the special courthouse vending machine is in order.\nExamine\n\n\n\n\n\n\n\n\n\nOrange vending machine\n\n\n\n\n\n\n\nEdgeworth:\n(I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\nDeduce Swiss rolls\n\n\n\n\n\n\n\nEdgeworth:\n(Is this spot somehow connected to any of the evidence I hold...?)\n\n\n\nPresent Annual Bonus Envelope\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nAbout Detective Gumshoe's finances, he said that until this morning... ...he didn't have even a single penny on his personage.\nFranziska:\nJust how poor is that guy!?\nEdgeworth:\nIf his bonus really was only $5... ...then, he should not have been able to purchase a pack of Swiss rolls! However, facts being as they are, we found cake crumbs on the floor.\nFranziska:\n...Meaning Scruffy must've bought a pack somehow.\nEdgeworth:\nIndeed... (That detective should not have been able to purchase a pack, and yet he did... The question is, \"How?\")\nSwiss Roll data updated in my Organizer.\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThere is clearly a contradiction here!\nFranziska:\n...Do you think so?\nEdgeworth:\n...I think there is one.\nFranziska:\n......\nEdgeworth:\n...I think there should be one.\nFranziska:\nDo not anger me with a foolish game of semantics, Miles!\nEdgeworth:\nGnnnuurk! (Nngh... I'd better look a bit more carefully through my evidence once again...)\nLeads back to examination of orange vending machine\n\n\n\n\n\n\nOrange vending machine (after correctly deducing Swiss rolls on vending machine)\n\n\n\n\n\n\n\nEdgeworth:\n(I already checked this area earlier, but it never hurts to take another look.)\nExamine evidence\n\n\n\n\n\n\n\n\n\nSwiss Roll\n\n\n\n\n\n\n\n\n\nFront side (after correctly deducing Swiss rolls on vending machine)\n\n\n\n\n\n\n\nEdgeworth:\nI can't believe they're selling Swiss rolls like these in vending machines these days.\nFranziska:\nYes, and I can't believe it's $6 for two... I mean, who charges that much for a commoner's junk food!?\nEdgeworth:\nFranziska... If you want one, all you have to do is buy one for yourself.\nFranziska:\nWh--!? I'm working right now! It won't do for me to eat while there's a case to be solved!\nEdgeworth:\nGnnnrgh! (Your idea of working must be vastly different from my own!)\nPartner\n\n\n\n\n\n\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nCrime scene oddity\n\n\n\n\n\n\n\nFranziska:\nMiles Edgeworth! That contradiction you were talking about... I demand that you show it to me at once!\nEdgeworth:\nHmm... (If Detective Gumshoe really did buy a pack of Swiss rolls for himself... ...that fact creates a contradiction with what I know about this case!) Hmph... Are you telling me that you haven't figured it out yourself, yet, Franziska?\nFranziska:\nO-Of course I've figured it out! But I thought I'd let you have the glory, just this once.\nEdgeworth:\n(She really doesn't like to lose, does she...?)\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nSwiss Roll (after correctly deducing Swiss rolls on vending machine)\n\n\n\n\n\n\n\nFranziska:\nIt looks like this Swiss roll was bought from the vending machine in the hallway. I heard that it has a nice, fluffy texture, and just the right amount of sweetness. And it's made from all natural ingredients... ...so of course, it's easy to digest as well! ...Or so I've heard. ..................\nEdgeworth:\n.................. ...Franziska, if you want one, I'd appreciate it if you would just tell me so.\nFranziska:\nI-I never said I wanted one! And besides, if I did, I'd make you prepare me some milk to go along with it!\nEdgeworth:\n(At that time, I hope you will be more direct, instead of playing these mind-games.)\nAfter connecting all possible Logic, clearing all Talk options with Tyrell Badd and The Judge, and correctly deducing Swiss rolls in vending machine:\nInvestigation Complete\nEdgeworth:\nHmm... I believe I now have a very firm grasp on what happened here.\nFranziska:\nArnngh! ...W-Well, I do, too!\nEdgeworth:\nHmph... Alright, Franziska. Would you care to share what conclusions you've come to?\nFranziska:\nWh-Why should I do that!? We're still in the middle of a competition, you know! We should be checking to see if your conclusions are wrong first, so you go ahead!\nEdgeworth:\n(It's almost cute that she's going this far to ensure that she wins... Almost.) Very well. But first, we need to pay His Honor a visit to correct his testimony.\nSeptember 10, 5:15 PM\nDistrict Court - Courtroom No. 3\nEdgeworth:\nYour Honor, if I may, I'd like to test your witness testimony to see how it stands up.\nJudge:\nD-Do you doubt me!? Am I your new suspect!?\nEdgeworth:\n...In a sense, I suppose you could say that.\nFranziska:\nEven you, a judge... ...are (changed from [is] in the original release, correcting the typo) nothing but a common witness before a Von Karma!\nJudge:\nSilence in the courtroom! Silence, I say (changed from [said] in the original release)! Mr. New Prosecutor Recommended by Manfred von Karma Miles Edgeworth... ...and Ms. Genius Prosecutor Successor to Manfred von Karma Franzisk...ack...!\nFranziska:\n...You bit your tongue again, didn't you?\nJudge:\n...Ahem. As a defender of the law, I could never give false testimony! You can even place me under oath if you want!\nEdgeworth:\nVery well, then. Your testimony, if you please.\nJudge:\nHmm...\nTestimony\n-- What I Saw at Recess --\nJudge:\nDuring the recess... I, um... I went to the restroom.\nThere is a window on the hallway side. In other words, I could see into the hallway.\nAs I entered, I saw that detective buying something from the vending machines.\nBut when I was about to exit the restroom, he had completely disappeared!\nA detective that goes missing while on duty... That sounds mighty suspicious to meeeee!\nEdgeworth:\nYour Honor... Can you please try to remain calm?\nJudge:\nOh! I'm so used to simply listening to testimonies that I got caught up in the excitement.\nEdgeworth:\n(I'm sorry, Your Honor, but I'm afraid I'm going to have to spoil your fun now.)\n\nEdgeworth: Edgeworth: Your Honor... Why exactly did you pay a visit to the restroom, if I may ask? Judge: Oh! Well, isn't it obvious!? What else do you go to the restroom for!? Or, maybe... I-I-I-I-I knew it...! You suspect me of some sort of tomfoolery, don't you! Edgeworth: Please stay calm, Your Honor! (This is going to be much harder than I anticipated...) Judge: I-I'm sorry... You're right... I need to think things through with a level head. I'm just nervous because so much has happened today with this trial. Let's see... I announced a recess, and a time for us to reconvene... But having done all that, I still wasn't able to go the restroom right away. Edgeworth: And why couldn't you? Judge: Mr. Faraday had been accused, so I had paperwork to process regarding a new prosecutor. Once I had finished that, I was finally able to make a mad dash to the restroom. Edgeworth: (At least he stayed consistent on the \"going to the restroom\" part of his testimony...)\nEdgeworth: Edgeworth: Your Honor, did you really go to the men's restroom? Judge: Wh-Wh--!? What is the meaning of that statement!? Edgeworth: I simply meant... that perhaps you went to a restroom on a different floor. Judge: I had to go for such a long time... It was all I could do to dash to the closest one to the courtroom. Edgeworth: (Hmm... I suppose that's only natural, given his circumstances...) Judge: I ran from the courtroom, through this floor's main lobby and down the hallway. Once you enter, you can see there's a window just above the urinals. Edgeworth: And it was through that window that you witnessed Detective Gumshoe, Your Honor? Judge: Yes, exactlyyyyyyy! Edgeworth: Y-Your Honor! There is no need to yell! I can hear you just fine! Judge: Oh! I guess I put a little too much into that last answer. Now then, let's continue with the testimony.\nEdgeworth: Edgeworth: Are you sure that the person you witnessed was Detective Gumshoe, Your Honor? Judge: Yes, I'm absolutely sure. It's hard to miss someone of his stature, even from as far away as the restroom. Besides, I can't think of anyone else with that kind of hairstyle and big, beige coat. Edgeworth: Well, I was simply wondering if you were mistaken in what you saw... Judge: What!? Preposterous! My eyes are sharp as can be! Ready to see through lies to the truth! Although, recently, things do seem to be a bit fuzzier than they used to be... Edgeworth: (Clearly, his eyes are not the only things that have gone fuzzy!) Judge: But allow me to say with all the honor and dignity of a judge... ...I am not mistaken in what I saw!\nEdgeworth: Edgeworth: He disappeared? But Your Honor, didn't you just say... ...\"I saw that detective buying something from the vending machines\"? Judge: Why, yes! Yes, I did! The restroom window looks over the courtyard and right into the hallway. But! Just as I was about to exit, I took another look, and there was no one in sight! .................. That led me to the only solution to this mystery. That detective must've gone into the crime scene, Lobby No. 2 at that pooooooooooint! Edgeworth: (So he looked into the hallway from the restroom, and over the courtyard, did he...?)\nEdgeworth: Edgeworth: Your Honor, I ask that you please remain calm. Judge: Nononononononononono! I-I-I-I'm cerfectly palm! Edgeworth: (You're being anything but \"perfectly calm\"!)\nFranziska: It appears that His Honor could not have been mistaken in what he saw.\nEdgeworth: Hmph, I suppose so, given his line of sight. However, Franziska, why do you suppose our lines of sight are so different?\nFranziska: ...If you're referring to my height...\nEdgeworth: C-Can't you hold that whip still for just a second!? Now, about His Honor's testimony... ...I believe his line of sight to be an important factor.\nFranziska: If it's that important, why don't you hurry up and tell him already?\nEdgeworth: (I will, but there is one more thing I need to do if I am to correct His Honor's testimony. I am going to need to retrace Detective Gumshoe's movements!)",
      "testimonies": [
        {
          "testimony": "During the recess... I, um... I went to the restroom.",
          "person": "Judge",
          "present": []
        },
        {
          "testimony": "There is a window on the hallway side. In other words, I could see into the hallway.",
          "person": "Judge",
          "present": []
        },
        {
          "testimony": "As I entered, I saw that detective buying something from the vending machines.",
          "person": "Judge",
          "present": []
        },
        {
          "testimony": "But when I was about to exit the restroom, he had completely disappeared!",
          "person": "Judge",
          "present": [
            "Det. Gumshoe's Fingerprints"
          ]
        },
        {
          "testimony": "A detective that goes missing while on duty... That sounds mighty suspicious to meeeee!",
          "person": "Judge",
          "present": []
        }
      ],
      "noPresent": false
    },
    {
      "category": "rebuttal",
      "newContext": "Judge:\nDuring the recess... I, um... I went to the restroom.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYour Honor... Why exactly did you pay a visit to the restroom, if I may ask?\nJudge:\nOh! Well, isn't it obvious!? What else do you go to the restroom for!? Or, maybe... I-I-I-I-I knew it...! You suspect me of some sort of tomfoolery, don't you!\nEdgeworth:\nPlease stay calm, Your Honor! (This is going to be much harder than I anticipated...)\nJudge:\nI-I'm sorry... You're right... I need to think things through with a level head. I'm just nervous because so much has happened today with this trial. Let's see... I announced a recess, and a time for us to reconvene... But having done all that, I still wasn't able to go the restroom right away.\nEdgeworth:\nAnd why couldn't you?\nJudge:\nMr. Faraday had been accused, so I had paperwork to process regarding a new prosecutor. Once I had finished that, I was finally able to make a mad dash to the restroom.\nEdgeworth:\n(At least he stayed consistent on the \"going to the restroom\" part of his testimony...)\nJudge:\nThere is a window on the hallway side. In other words, I could see into the hallway.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYour Honor, did you really go to the men's restroom?\nJudge:\nWh-Wh--!? What is the meaning of that statement!?\nEdgeworth:\nI simply meant... that perhaps you went to a restroom on a different floor.\nJudge:\nI had to go for such a long time... It was all I could do to dash to the closest one to the courtroom.\nEdgeworth:\n(Hmm... I suppose that's only natural, given his circumstances...)\nJudge:\nI ran from the courtroom, through this floor's main lobby and down the hallway. Once you enter, you can see there's a window just above the urinals.\nEdgeworth:\nAnd it was through that window that you witnessed Detective Gumshoe, Your Honor?\nJudge:\nYes, exactlyyyyyyy!\nEdgeworth:\nY-Your Honor! There is no need to yell! I can hear you just fine!\nJudge:\nOh! I guess I put a little too much into that last answer. Now then, let's continue with the testimony.\nJudge:\nAs I entered, I saw that detective buying something from the vending machines.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nAre you sure that the person you witnessed was Detective Gumshoe, Your Honor?\nJudge:\nYes, I'm absolutely sure. It's hard to miss someone of his stature, even from as far away as the restroom. Besides, I can't think of anyone else with that kind of hairstyle and big, beige coat.\nEdgeworth:\nWell, I was simply wondering if you were mistaken in what you saw...\nJudge:\nWhat!? Preposterous! My eyes are sharp as can be! Ready to see through lies to the truth! Although, recently, things do seem to be a bit fuzzier than they used to be...\nEdgeworth:\n(Clearly, his eyes are not the only things that have gone fuzzy!)\nJudge:\nBut allow me to say with all the honor and dignity of a judge... ...I am not mistaken in what I saw!\nJudge:\nBut when I was about to exit the restroom, he had completely disappeared!\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nHe disappeared? But Your Honor, didn't you just say... ...\"I saw that detective buying something from the vending machines\"?\nJudge:\nWhy, yes! Yes, I did! The restroom window looks over the courtyard and right into the hallway. But! Just as I was about to exit, I took another look, and there was no one in sight! .................. That led me to the only solution to this mystery. That detective must've gone into the crime scene, Lobby No. 2 at that pooooooooooint!\nEdgeworth:\n(So he looked into the hallway from the restroom, and over the courtyard, did he...?)\nPresent Det. Gumshoe's Fingerprints\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Wh-What was that finger wag for, Mr. Edgeworth!?\"\nJudge:\nA detective that goes missing while on duty... That sounds mighty suspicious to meeeee!\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYour Honor, I ask that you please remain calm.\nJudge:\nNononononononononono! I-I-I-I'm cerfectly palm!\nEdgeworth:\n(You're being anything but \"perfectly calm\"!)\nFranziska:\nIt appears that His Honor could not have been mistaken in what he saw.\nEdgeworth:\nHmph, I suppose so, given his line of sight. However, Franziska, why do you suppose our lines of sight are so different?\nFranziska:\n...If you're referring to my height...\nEdgeworth:\nC-Can't you hold that whip still for just a second!? Now, about His Honor's testimony... ...I believe his line of sight to be an important factor.\nFranziska:\nIf it's that important, why don't you hurry up and tell him already?\nEdgeworth:\n(I will, but there is one more thing I need to do if I am to correct His Honor's testimony. I am going to need to retrace Detective Gumshoe's movements!)\nJudge:\nWh-What was that finger wag for, Mr. Edgeworth!? And don't you know it's rude to shout \"Objection!\" while someone is giving testimony?\nEdgeworth:\nHah. If you truly are a man of the law, then you must always be vigilant. For example, I (changed from [I, myself,] in the original release) never let an opportunity to shout \"Objection!\" pass me by!\nFranziska:\nMiles Edgeworth. It's one thing to be passionate about your job, but this is real life.\nEdgeworth:\n(This is what some people may say is the pot calling the kettle black...) Your Honor, I wonder if you might take a look at this for me?\nJudge:\nWhat is that filth!? How dare someone dirty the hallway bench like that!? Who is the culprit!? That party is hereby found GUILTY of uncleanliness!!!\nEdgeworth:\nIf you must know, the uncouth bench sullier... ...has already been placed under arrest, thanks to your earlier testimony, Your Honor.\nJudge:\nOh? ...Well that's good. But who was it?\nEdgeworth:\nWe were able to discover something from the smudge on the bench. Namely, Detective Gumshoe's fingerprints.\nJudge:\nNot happy with committing just murder, he had to go and dirty the courthouse, too!? GUILTY!\nEdgeworth:\nYour Honor. Please calm down. While it's true that the detective is the one who made the mess on the bench... ...we have not yet established that this action is related to the double murder.\nJudge:\nWhat do you mean?\nEdgeworth:\nI believe that the Detective bought a pack of Swiss rolls from the vending machine... ...and then, promptly sat down on the bench to eat one. The cake crumbs and pieces of chocolate on the floor under the bench... ...and Detective Gumshoe's fingerprints prove my conclusions to be true.\nJudge:\nOh... But I still don't understand. Is this whole thing related to how I couldn't see him as I was leaving the restroom?\nEdgeworth:\nHeh... It is indeed! The window in the hallway was built rather high up into the wall... ..at around a grown adult's chest height. As evidence, I submit that Franziska herself was unable to see out of that window.\nFranziska:\n.........\nEdgeworth:\nNnghooooh! (I knew I shouldn't have used her height as evidence!) ...B-Basically, what this means is that the area directly under the hallway window... ...is a blind spot when the hallway is being viewed from the men's restroom!\nJudge:\nTh-Then!?\nEdgeworth:\nHmph... It seems that you have made the connection. If someone were to sit on the bench under the window... Yes, even someone as large as Detective Gumshoe... ...would effectively disappear from sight!\nJudge:\nWh-Whaaaaaaaaaaaat!?\nEdgeworth:\nHmph. Do you finally see, Your Honor? Your testimony has just proven that Detective Gumshoe was in the hallway the entire time.\nJudge:\nJudge:\n...Ah! Sorry! I didn't mean to say it with that much enthusiasm. All I wanted to do was try saying it once. Here, let me try that again... \"Hold it!\"\nEdgeworth:\n...Is there something of value that you'd like to say?\nJudge:\nYes, actually, there is! I remembered something else just now! Mr. Edgeworth! Please allow me to testify to the court one more time!\nFranziska:\nEven if we overruled him, he'd just keep on talking, wouldn't he?\nEdgeworth:\nThat might not be a bad thing. The more info the better in a perfect investigation, right?\nTestimony\n-- What I Saw, Pt. 2 --\nJudge:\nI suppose it's possible you can't see a seated person from the restroom window.\nHowever, that doesn't mean that the Detective was sitting there when I looked!\nAnyway! I forgot to testify earlier about probably the most important detail...\nAs I was leaving the restroom, I heard the loud \"BANG!\" of a gunshot!\nEdgeworth:\nGnnnnrrrrrk...\nJudge:\nHow was that!? That is the testimony of one who judges the crimes of others!\nEdgeworth:\nYour Honor... Could you try to state the important facts first next time!?\nFranziska:\nI agree! Before you go around judging others, you should learn to judge your own words!\nJudge:\nEeeek! ...I-I'm sorry! But honestly, I thought that sound was just a noise popper until just now!\nEdgeworth:\n(Now that he mentions it, right before we re-started the trial, he did talk about that...)\nJudge:\nOh, by the way, was there someone celebrating a birthday during the recess? I could have sworn that I heard a popper going off... Come to think of it... The other day with my grandson...\nEdgeworth:\n(The most critical point in this argument is when did the Judge look into the hallway? And whether that lines up with when the gun was actually fired.) Your Honor, if I may... I'd like to clarify a few details in your testimony!\n\nEdgeworth: Edgeworth: In that case, do you concede that you were overconfident in your last testimony? Judge: N-Now hold on there! I just said that it's possible you can't see a seated person from the restroom this time! But you know something? I don't think you know when the prints you referenced were left on that bench, do you!? Edgeworth: Nngh! Judge: While you have proven that it's possible the Detective was sitting... ...I still have a problem with just when those fingerprints were left. Edgeworth: (He's right. I have yet to prove when the fingerprints were left on that bench... While he feigns ignorance. His Honor has seen a lot of life... This Judge... I mustn't underestimate him!)\nEdgeworth: Edgeworth: As we established, you went to the restroom during the recess. However, at what point in the recess did you look into that hallway? Judge: Hmm... After I called for a recess, I handled the change of prosecutor paperwork... Maybe about 20 minutes until we reconvened...? Yes, that sounds about right. Edgeworth: Hmph... Just as I expected. Judge: Wh-What were you expecting? And I demand to know what that all-knowing smile is for! Edgeworth: Your Honor... That statement you made just now is very important. I'd like for you to append it to your testimony. Judge: A-Alright. If you insist. Adds statement \"Let's see... I looked into that hallway about 20 minutes before we were to reconvene.\"\nEdgeworth: Edgeworth: Hmm... Twenty minutes before we reconvened... Very well, what did you do after that? Judge: Let's see... I had to make some preparations, so I rushed straight back to the courtroom. I also had to track down a few pieces of paperwork for the various bailiffs. Edgeworth: So you rushed back to the courtroom, despite having just heard a gunshot? Judge: Well, at the time... I thought it was just the sound of a noise popper. I really couldn't think of any other explanation than someone having a birthday party. But now... Now that this has happened... Edgeworth: I see... (Thinking back, the Judge did mention something to that effect when we reconvened...)\nEdgeworth: Edgeworth: If it's something that forgettable, I don't need to hear it! Judge: Eek! B-But! All I did was forget to mention it! Franziska: That sort of excuse may work on other people, but not on a Von Karma! Judge: Oh! But it's such an important piece of testimony! Please give me a chance to present it! Edgeworth: Hmm... I suppose I have no choice in the matter.\nEdgeworth: Edgeworth: Your Honor, about what you just said... Judge: I know! I couldn't believe it myself! But I heard it! \"BANG!\" went the gunshot! I heard it loud and clear! And then I had a knee-jerk reaction, \"Aah!\" and jumped into the air! Like this! Yes, just like this! With a quick, \"Aah!\" Edgeworth: ......Your Honor. Please remain calm when you're trying to explain yourself to me. Judge: Yes, sir! Sorry about that. Now then, I must gather myself, yes... When I heard the gunshot, there was no one in the hall! I should know! I looked! There was no one theeeeeeere! Edgeworth: (This judge's emotion circuits appear to be stuck on \"overreact\".)\nFranziska: At this point, nothing stands out to me as a contradiction in his testimony... Edgeworth: Hmph... Franziska. If I'm correct, this testimony is hardly precision quality. Franziska: ...I know that. And that's why I said, \"At this point.\" Edgeworth: Hmm... I think my first line of attack will be to draw more information from His Honor.\nEdgeworth: I believe... that we've finally found the flaw in His Honor's testimony. Franziska: Yet sadly, he's completely oblivious to it. But I guess I can't really expect him to be aware of it. Well!? What are you waiting for!? Hurry up and fill him in! ...At least that thing finally came in handy. Edgeworth: Indeed. Now let's see what happens... ...when I present it to His Honor!",
      "testimonies": [
        {
          "testimony": "I suppose it's possible you can't see a seated person from the restroom window.",
          "person": "Judge",
          "present": []
        },
        {
          "testimony": "However, that doesn't mean that the Detective was sitting there when I looked!",
          "person": "Judge",
          "present": []
        },
        {
          "testimony": "Let's see... I looked into that hallway about 20 minutes before we were to reconvene.",
          "person": "Judge",
          "present": [
            "Det. Badd's Testimony"
          ]
        },
        {
          "testimony": "Anyway! I forgot to testify earlier about probably the most important detail...",
          "person": "Judge",
          "present": []
        },
        {
          "testimony": "As I was leaving the restroom, I heard the loud \"BANG!\" of a gunshot!",
          "person": "Judge",
          "present": []
        }
      ],
      "noPresent": false
    },
    {
      "category": "rebuttal",
      "newContext": "Judge:\nI suppose it's possible you can't see a seated person from the restroom window.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nIn that case, do you concede that you were overconfident in your last testimony?\nJudge:\nN-Now hold on there! I just said that it's possible you can't see a seated person from the restroom this time! But you know something? I don't think you know when the prints you referenced were left on that bench, do you!?\nEdgeworth:\nNngh!\nJudge:\nWhile you have proven that it's possible the Detective was sitting... ...I still have a problem with just when those fingerprints were left.\nEdgeworth:\n(He's right. I have yet to prove when the fingerprints were left on that bench... While he feigns ignorance. His Honor has seen a lot of life... This Judge... I mustn't underestimate him!)\nJudge:\nHowever, that doesn't mean that the Detective was sitting there when I looked!\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nAs we established, you went to the restroom during the recess. However, at what point in the recess did you look into that hallway?\nJudge:\nHmm... After I called for a recess, I handled the change of prosecutor paperwork... Maybe about 20 minutes until we reconvened...? Yes, that sounds about right.\nEdgeworth:\nHmph... Just as I expected.\nJudge:\nWh-What were you expecting? And I demand to know what that all-knowing smile is for!\nEdgeworth:\nYour Honor... That statement you made just now is very important. I'd like for you to append it to your testimony.\nJudge:\nA-Alright. If you insist.\nAdds statement \"Let's see... I looked into that hallway about 20 minutes before we were to reconvene.\"\nJudge:\nLet's see... I looked into that hallway about 20 minutes before we were to reconvene.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nHmm... Twenty minutes before we reconvened... Very well, what did you do after that?\nJudge:\nLet's see... I had to make some preparations, so I rushed straight back to the courtroom. I also had to track down a few pieces of paperwork for the various bailiffs.\nEdgeworth:\nSo you rushed back to the courtroom, despite having just heard a gunshot?\nJudge:\nWell, at the time... I thought it was just the sound of a noise popper. I really couldn't think of any other explanation than someone having a birthday party. But now... Now that this has happened...\nEdgeworth:\nI see... (Thinking back, the Judge did mention something to that effect when we reconvened...)\nPresent Det. Badd's Testimony\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Your Hon--\"\nJudge:\nAnyway! I forgot to testify earlier about probably the most important detail...\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nIf it's something that forgettable, I don't need to hear it!\nJudge:\nEek! B-But! All I did was forget to mention it!\nFranziska:\nThat sort of excuse may work on other people, but not on a Von Karma!\nJudge:\nOh! But it's such an important piece of testimony! Please give me a chance to present it!\nEdgeworth:\nHmm... I suppose I have no choice in the matter.\nJudge:\nAs I was leaving the restroom, I heard the loud \"BANG!\" of a gunshot!\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYour Honor, about what you just said...\nJudge:\nI know! I couldn't believe it myself! But I heard it! \"BANG!\" went the gunshot! I heard it loud and clear! And then I had a knee-jerk reaction, \"Aah!\" and jumped into the air! Like this! Yes, just like this! With a quick, \"Aah!\"\nEdgeworth:\n......Your Honor. Please remain calm when you're trying to explain yourself to me.\nJudge:\nYes, sir! Sorry about that. Now then, I must gather myself, yes... When I heard the gunshot, there was no one in the hall! I should know! I looked! There was no one theeeeeeere!\nEdgeworth:\n(This judge's emotion circuits appear to be stuck on \"overreact\".)\nBefore pressing second statement\n\n\n\n\n\n\n\nFranziska:\nAt this point, nothing stands out to me as a contradiction in his testimony...\nEdgeworth:\nHmph... Franziska. If I'm correct, this testimony is hardly precision quality.\nFranziska:\n...I know that. And that's why I said, \"At this point.\"\nEdgeworth:\nHmm... I think my first line of attack will be to draw more information from His Honor.\nAfter pressing second statement\n\n\n\n\n\n\n\nEdgeworth:\nI believe... that we've finally found the flaw in His Honor's testimony.\nFranziska:\nYet sadly, he's completely oblivious to it. But I guess I can't really expect him to be aware of it. Well!? What are you waiting for!? Hurry up and fill him in! ...At least that thing finally came in handy.\nEdgeworth:\nIndeed. Now let's see what happens... ...when I present it to His Honor!\nEdgeworth:\nYour Hon--\nJudge:\nI cannot allow you to make an objection.\nEdgeworth:\nWhat!? Your Honor... I'm really sorry, but... ...I cannot allow you to not allow me to make an objection!\nJudge:\nEgads! I've been overruled!?\nEdgeworth:\nYour Honor, there are simply too many holes in your testimony for my taste.\nJudge:\nWh-Wh-Wh-What do you mean by that!?\nEdgeworth:\nYou claim that you heard the gunshot during the recess, but that is simply not possible!\nJudge:\n! Mr. New Prosecutor Recommended by Manfred von...ack...!\nFranziska:\nInstead of biting your tongue, why don't you bite your tongue on those preposterous names!?\nJudge:\nEek!\nEdgeworth:\nI see you have no mercy for the elderly either, Franziska.\nFranziska:\nHmph. Don't talk back to me, unless you want to be whipped in the back.\nEdgeworth:\n(With your height, you'd need a step-ladder or four to accomplish that.)\nJudge:\nAhem! Mr. Edgeworth. My ears are not that far gone yet, I'll have you know! I can still hear just fine! And I heard the sound of a gunshot loud and clear with my own two ears!\nEdgeworth:\nHah... Your Honor, I have here an interesting bit of testimony. It's from Detective Badd. And according to him, he heard the gunshot \"right before the trial was about to start again\".\nJudge:\nWh-What did you just say!?\nEdgeworth:\nYour Honor, you just said... ...that you heard the gunshot \"about 20 minutes before we were to reconvene\". How do you explain this glaring contradiction!?\nJudge:\nTh-That can't beeeeeee!\nEdgeworth:\nUnfortunately... that is the truth.\nJudge:\nB-But! I heard it clear as day! \"BANG!\" The loud sound of a gunshot!\nEdgeworth:\n(The sound of the gunshot... We keep returning to this point of contention. And that piece of evidence... I always did wonder why I found it where I did. However, now I understand what that gunshot the Judge heard really was!) Unfortunately, Your Honor, this is what really produced the gunshot you heard!\nPresent Balloon Piece\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"I found this object in the hallway earlier.\"\nPresent anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nFranziska:\nMiles Edgeworth... I have no idea what you are trying to say with that piece.\nEdgeworth:\nFranziska... You're just still too young to understand.\nFranziska:\nStop trying to fool me, and start being mature enough to admit when you're wrong!\nEdgeworth:\nGnnrrk! (Perhaps that was not the piece I needed to show...)\nLeads back to:\n\"Unfortunately, Your Honor, this is what really produced the gunshot you heard!\"\nEdgeworth:\nI found this object in the hallway earlier.\nJudge:\nWh-What is that pink substance?\nEdgeworth:\nIt may not look it, but this is actually a piece of a balloon.\nJudge:\nI see. And I suppose you would like me to accept that pink balloon into the court record?\nEdgeworth:\nYour Honor... I present this piece of evidence in order to overrule your testimony!\nJudge:\nWh-What!?\nEdgeworth:\nYour Honor, your argument goes as follows: You saw no one in the hallway when you heard the gunshot. Now, there is no guarantee that the detective was sitting on the bench at that time... ...therefore, you believe he must have been at the crime scene, Defendant Lobby No. 2. ...Am I correct?\nJudge:\nYes, that's exactly right.\nEdgeworth:\nHmph... Let me ask you something. Do you think that the gunshot you heard was produced by a real gun?\nJudge:\n!\nEdgeworth:\nI think I've said enough that even you can figure the rest out on your own. Your Honor. You were fooled by the popping of this balloon into thinking it was a gunshot!\nJudge:\nWh-What manner of trickery is thiiiiiiiiiiiiis!?\nFranziska:\nThat was a good effort you put forth, Miles Edgeworth. But if it was [sic] me, I'd have wrapped this thing up before the Judge even testified.\nEdgeworth:\n(Care to elaborate on how one ends something before it even begins...?)\nJudge:\nHmm... Well, to be honest... I did think that the sound was a bit off from a real gunshot sound... But who could've guessed... that someone would pop a balloon in a place like this?\nEdgeworth:\n(That's true... One doesn't usually think \"balloons\" in conjunction with \"courthouse\".)\n???:\nUmm... I want to trade these coins with you!\nEdgeworth:\n(That's it...! That balloon that girl was holding... it explains everything.) Your Honor, if it makes you feel any better, you didn't lie once in your testimony. However, I can't really vouch for its accuracy...\nJudge:\nMmnngh... Who knew... that giving testimony could be such a difficult thing to do...? What have I done? I owe Detective Gumshoe a very, very big apology... I will see to it myself that he is released...!\nEdgeworth:\nWait... There are still a few things I have yet to resolve about what happened in the hallway. Your Honor, I request your permission to further question Detective Gumshoe.\nJudge:\nB-But why!? I thought we just cleared his name!?\nEdgeworth:\nWhether we did just now or not... I still cannot say. The only thing I can do for now is to continue in my quest for the perfect explanation. And to that end... ...I must resolve the remaining issues pertaining to the events that occurred in the hallway!\nJudge:\nVery well. Bailiff! Please bring Detective Gumshoe into the courtroom!\nEdgeworth:\n(I must fulfill my mission, and find the perfect explanation to this case!)\nSeptember 10\nDistrict Court - Courtroom No. 3\nGumshoe:\nWh-What is it now!? Is it time for my trial already!? I've already told you a gazillion times, pal! I didn't do it!\nEdgeworth:\nI'll be the judge of that, Detective Gumshoe.\nFranziska:\nNo, you won't! I'll be the judge of that!\nJudge:\nNo, no, no, no, no! I'M the judge around here! And I'LL be the judge of that!\nGumshoe:\nWhy can't you guys be a little less judgmental...?\nJudge:\nYes, well, speaking of hasty judgments, Detective Gumshoe... I'm afraid I must apologize for an error in judgment on my part.\nEdgeworth:\nYour Honor. I don't believe you should apologize just yet. We have yet to prove he is completely innocent of this crime.\nJudge:\nI-I guess so...\nGumshoe:\n? Um, what are you guys talking about?\nEdgeworth:\n...In any case. I would like you to testify as to your actions while you were on guard duty. And please remember, you are not on trial. This is all just a part of the investigation. As such, you may still be found to be innocent... ...however, if you should give false testimony...\nGumshoe:\nYeeeeoooow!\nFranziska:\nMy whip will object, loud and clear!\nEdgeworth:\nIf you are found to be lying, you will be held indefinitely. Understood?\nGumshoe:\n.........I gotcha, pal.\nEdgeworth:\n(Thinking back on the state of the crime scene and the Judge's testimony... ...it's obvious that Detective Gumshoe is lying. And if I can't break his lie, then we may never get a break in this case!)\nTestimony\n-- While I was on Duty --\nGumshoe:\nI came down here to this courthouse on Detective Badd's orders.\nAs soon as I got here, he ordered me to stand guard in front of Lobby No. 2.\nFrom that time on, until I heard the gunshot, I was in that hallway the whole time!\nOn my honor as a detective, I swear it wasn't me, pal!\nFranziska:\nHe's still singing the same tired tune.\nEdgeworth:\nHmph. In that case, I'll just have to change the melody. (I know he's lying, and it's time I pulled the information I need out of him!)\n\nEdgeworth: Edgeworth: So, was it really Detective Badd who called you down here? Gumshoe: You bet it was, pal! I was left in charge of the precinct while everyone was out, and this call comes in... \"I want you down here in one minute flat!\" he said! Well, I thought this was my big chance, my first case, so I made a mad dash down here! Although, I couldn't exactly get here in a minute flat... Edgeworth: So how long did it take you? Gumshoe: Umm... About ten minutes, I guess. Edgeworth: And what was Detective Badd doing when you finally made it? Gumshoe: He was waiting for me down on the first floor in the entranceway, pal!\nEdgeworth: Edgeworth: And by \"he\", you mean...? Gumshoe: Detective Badd, of course! And, this being my first time at this courthouse... ...he also walked with me up to the 3rd floor hallway in front of the defendant lobbies! Edgeworth: And did you meet anyone along the way? Gumshoe: Hmm... Well... Just as we entered the hallway, we ran into Ms. Yew. When he heard from Ms. Yew that Mr. Faraday was not to be interrupted... ...that's when Detective Badd told me to stand guard in the hallway, pal! Edgeworth: (So far, Detective Gumshoe's testimony is matching up with Detective Badd's...)\nEdgeworth: Edgeworth: You claim to have been in that hallway the \"whole time\"... ...however, is it not a fact that you did something while you were in that hallway? Gumshoe: O-Of course I did something! I guarded the door to Lobby No. 2, pal! What else!? Edgeworth: Very well, then. And what exactly does guarding that door entail? Gumshoe: Umm... Well, to put it simply... Oh, I know! It was my job to stand in front of the door without moving an inch! Edgeworth: Oh? Detective Gumshoe, you mean to tell me... ...that you didn't take a single step away from the door to Lobby No. 2? Is that really what you wish to testify to the effect of? Gumshoe: You got it, pal! I didn't take a single step away from that door, just like I was ordered not to! Franziska: .................. Judge: .................. Edgeworth: .................. Gumshoe: Wh-Why is everyone so quiet all of a sudden? Edgeworth: Because we are all in shock... ...and in awe of your utter stupidity. Franziska: Scruffy! If you're going to lie, at least tell us a more believable one! Gumshoe: Yeeeeowch! B-But I... I'm not lying... Edgeworth: (I should hurry up and bring this insipid testimony to a close.) Changes statement from \"From that time on, until I heard the gunshot, I was in that hallway the whole time!\" to \"And until I heard the gunshot, I didn't take a single step away from the Lobby No. 2 door.\"\nEdgeworth: Edgeworth: I'm only going to ask you one more time, Detective Gumshoe. Are you sure you stood in front of the door to Lobby No. 2 the entire time? Gumshoe: Yup! After I was told to by Detective Badd... ...I stood guard in front of that door without a single break! S-So believe me when I say that I was in that hallway the whole time already, pal! Franziska: .................. Judge: .................. Edgeworth: .................. Gumshoe: Wh-Why did everyone go quiet all of a sudden again...? Edgeworth: Apparently, someone has a bit of trouble reading between the lines. Gumshoe: Wh-What's that supposed to mean!? I don't...! Franziska: Be quiet! Gumshoe: Yeeeeowch! Edgeworth: (I should hurry up and bring this insipid testimony to a close.)\nEdgeworth: Edgeworth: Would you also be willing to swear that there was no one else in that hall besides you? Gumshoe: Wh-Wh-Wh-Wh-Wh-Wh-Wh-What are you talking about!? I just swore to you that I was doing my job, pal! Edgeworth: Oh? Then what are you acting so nervous for? Gumshoe: Wh-Wh-Wh-Wh-Wh-What!? I'm not nervous at all, pal! Anyway! Not a single person other than myself was in that hall the whole time! Edgeworth: (I should just let it go... Pursuing this train of thought at this time would just be a waste of time...)\nFranziska: He's still singing the same tired tune. Edgeworth: Hmph. In that case, I'll just have to change the melody. (I know he's lying, and it's time I pulled the information I need out of him!)\nFranziska: To have such a foolishly foolish contradiction... ... in such a foolishly foolish testimony is just plain old foolish. Edgeworth: ...Indeed. However, in the pursuit of the perfect investigation, I'm afraid we have to deal with it. By squashing it under the weight of the evidence!",
      "testimonies": [
        {
          "testimony": "I came down here to this courthouse on Detective Badd's orders.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "As soon as I got here, he ordered me to stand guard in front of Lobby No. 2.",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "From that time on, until I heard the gunshot, I was in that hallway the whole time!",
          "person": "Gumshoe",
          "present": []
        },
        {
          "testimony": "And until I heard the gunshot, I didn't take a single step away from the Lobby No. 2 door.",
          "person": "Gumshoe",
          "present": [
            "Swiss Roll",
            "Det. Gumshoe's Fingerprints"
          ]
        },
        {
          "testimony": "On my honor as a detective, I swear it wasn't me, pal!",
          "person": "Gumshoe",
          "present": []
        }
      ],
      "noPresent": false
    }
  ]
}