{
  "previousContext": "Episode 5Turnabout Ablaze\nEdgeworth: Two cards. One of the black raven... ...and one of the white raven. A country torn in two. One to the west... ...and one to the east. When those which were split are made whole again... ...the truth will reveal itself.\nI-It's the Yatagarasu! The Yatagarasu's here!\nEdgeworth: You... accursed Yatagarasu! Kay! You...!\nEdgeworth: (It's so nice, almost dreamlike, to finally have the chance to relax and sip some tea. Especially after what a whirlwind the past few days have been.) On my return flight, I was dragged into a case involving an Interpol agent's murder. The next day, I investigated a kidnapping and a murder at the Gatewater Land theme park. And later that night, a detective's dead body welcomed me back to my office... ...along with a thief who was out to pilfer files related to a case from 10 years ago. (How did I manage to find myself in the middle of so many cases back to back? Well, at least I have today. All I ask is that I be allowed to spend it quietly.)\n???: Mr. Edgewooooorth! This is big! Big, I tell you! ...Hey, what's wrong with you? Where's your enthusiasm...?\nEdgeworth: And suddenly, the phrase \"the fragility of dreams\" comes to mind...\nKay: What are you talking about, \"fragile dreams\"!? Come on, let's go! The fake Yatagarasu isn't going to just find herself, you know!\nEdgeworth: Well, if you must know... it's possible that I was paid a visit last night by your \"fake\".\nKay: Say what?\nEdgeworth: .........\nEdgeworth: Unfortunately for us, the thief managed to escape. But even now, we're still looking for this criminal. However, I must warn you that we've only had a few hours to search so far... ...so I must insist that you be patient on this one, Kay.\nKay: Wh-What's with you today...? Are you sure you aren't sleep-talking to me right now? Anyway, I've got something much more important that I want you to see!\nEdgeworth: Oh, and that is?\nKay: Take a look at this!\nEdgeworth: \"On March 14th, I will be there to steal your dirtiest secret.\" That's quite a bold declaration to send to an embassy... (I suppose it was inevitable that a newspaper would catch wind of this.)\nKay: The date the card mentions is today!\nEdgeworth: Today, huh...\nKay: Come on, we've gotta hurry! The embassy awaits!\nEdgeworth: I suppose it IS quite an urgent matter... ...however, do you know which country's embassy we should be investigating?\nKay: Well, it's some really special country, and I'm actually really fuzzy on the details... But never mind that! Where's all your energy!? Why are you so lackadaisical today!?\nEdgeworth: I'm not, Kay. You're just too wound up.\nKay: Well, then you should get too wound up, too! Because this just might be our chance to catch that woman!\nEdgeworth: You mean Ms. Yew? (The woman who killed Kay's father, Byrne Faraday, seven years ago... Calisto Yew... She claimed to be the Great Thief Yatagarasu... ...and then disappeared from the courtroom.)\nKay: Argh! She makes me so mad! The phony! Everyone knows that the real Yatagarasu would never send something like a calling card! Until a company's underhanded dealings are made public... ...the target is always totally unaware that the Yatagarasu has paid them a visit. That's what makes the real Yatagarasu so awesome!\nEdgeworth: Hmm... The Yatagarasu's card that's shown in this article... It looks to me as though it could be genuine.\nKay: See, that's the thing. Whoever it is, that person isn't the real deal, but has knowledge of the Yatagarasu. If this isn't a clue that that woman's involved, then nothing is! Come on, Mr. Edgeworth! Out the door you go!\nEdgeworth: Wait, there are a few preparations I must make before we go... (There's something interesting about this card we found last night here in my office... It's of a different color than the one in the article, which makes me wonder why.)\nKay: What's up? Any reason why you're boring a hole through the newspaper with your eyes?\nEdgeworth: No... No reason at all. Very well. Seeing as how Ms. Yew is also someone of a special nature to me... ...I agree there is some merit to be found in investigating this.\nKay: I knew you'd come around!\n???: By the light of this night's glorious moon... We are ready!\nPink Princess: Ready to embark on our nightly outing.\nSteel Samurai: And this is where... ...our tale begins!\nEdgeworth: Heh... What a coincidence. Who would've thought that a Steel Samurai stage show... ...would ever be held at such an elegant theater inside a foreign embassy?\nKay: Yeah! The climax was really awesome! \"Steel Samurai Sushi Slash (changed from [Slice] in the original release)!\" I got chills down my spine when he pulled that move out!\nEdgeworth: I suppose it really is more impactful to watch a show in person than on television.\nKay: I have to say, though, this embassy is set up kinda funny. I mean, they have two countries sharing the same building!\nEdgeworth: Well, as you said yourself, this place and the countries it houses are very special. Even this theater is special in that it is a neutral zone shared by the two countries.\nKay: Umm... So, let me get this straight... The Steel Samurai show just now is being sponsored by one of the two countries. The one that's called the Kingdom of Allebahst, right?\nEdgeworth: Yes, it would appear that the Steel Samurai is very popular in that country as well.\nKay: Seems that way! But you know who I'M really into? The Jammin' Ninja! The Republic of Babahl is sponsoring a Jammin' Ninja stage show! That's something for fangirls like me! We've totally gotta see that too, Mr. Edgeworth! The Jammin' Ninja's show is gonna kick the Steel Samurai show's rear end!\nEdgeworth: (You know, ever since I first met this girl, I've always had this inkling... ...that what she really wants to be... ...is not a thief, but rather, a ninja...)\nKay: So anyway, about today's event... umm... What's it called again?\nEdgeworth: \"The Kingdom of Allebahst versus The Republic of Babahl Goodwill Jubilee\". The small, European countries of the Kingdom of Allebahst... ...and the Republic of Babahl. These two countries used to be a single entity that was abundant with nature. And it was called... the Principality of Cohdopia. ..................\nKay: Hm? Is everything alright, Mr. Edgeworth?\nEdgeworth: Yes, I'm alright. Moving on... After a period of civil unrest, the country split in two, though signs of their past remain. For example, their flags preserve the flower and butterfly motifs to this day. ......... (Cohdopia, huh... The KG-8 Incident... and what was referred to as the second KG-8 Incident... ...in which an Embassy staff member was murdered... Both of these cases were related to the Principality of Cohdopia. In the seven years that have passed, the country may have split into two... ...however, the Yatagarasu still sent a calling card here. What could it all mean?) .........\nKay: Mr. Edgeworth... I know you're thinking about something!\nEdgeworth: Oh, excuse me. What were we talking about again?\nKay: Argh, if you could please stop spacing out on me! Anyway, we were talking about the Allebahst versus Babahl Goodwill Jubilee. The two countries have had a pretty bad relationship with each other... ...but supposedly, they've been trying really hard to make up recently. That's why they decided to hold this event.\nEdgeworth: (If that's the case, then why the \"versus\"...?)\nKay: Also, both countries claim to own the real \"Primidux Statue\", a national treasure to both. They're planning to have them publicly evaluated today, to see which one's the real deal.\nEdgeworth: Kay, need I remind you to take care and not succumb to your thieving desires?\nKay: Well, when it comes to treasure, I can't help myself. You know that!\nEdgeworth: (Nngh... She had better be saying that in jest...)\nKay: Hey! I can read your body language, you know! And you've got it all wrong! Look! I'm here to do some investigating! INVESTIGATING, I tell you!\nEdgeworth: Heh, I know. And although we don't know if the Yatagarasu will really make an appearance... ...I suppose we should still spend some time examining this place.\nAfter examining pamphlets:\nEdgeworth: I suppose I'll just help myself to one of these...\nEmbassy Guide stuck into the pages of my Organizer.\nEdgeworth: (Hm? What is all the hubbub?) Ack!\nKay: Hey, look! It's the Steel Samurai! And he's got his son, the Iron Infant, with him!!\nEdgeworth: May I speak with you for a second? (...It's... the Steel Samurai...)\nSteel Samurai: .........\nEdgeworth: .........\nKay: Mr. Edgeworth! What are you glaring at him for!?\nEdgeworth: Ahem, please excuse me. It's just that I've never seen a super-hero up close before.\nSteel Samurai: .........\nKay: It looks like he's written something down for you!\nEdgeworth: \"To Edgeworth, From Steel Samurai Daddy: Married Man of Neo Olde Tokyo\"\nKay: Wow, an autograph! Pretty cool that you got one, huh, Mr. Edgeworth!?\nEdgeworth: Heh...\nSteel Samurai's Autograph received.\nGuard: Mr. Steel Samurai! Ambassador Alba is waiting for you!\nReporter: And now the Steel Samurai... ...will proceed to enter the Kingdom of Allebahst to shake the hand of the ambassador. The Steel Samurai isn't only here for the two countries tonight... ...but rather, can be thought of as a goodwill ambassador from our own country as well!\nKay: There he goes. Off to spread goodwill to the world.\nEdgeworth: He really does seem like a goodwill ambassador, doesn't he?\nCameraman: OK! We're shooting the next segment now! Cue camera!\nReporter: In just a few seconds, the Jammin' Ninja stage show is set to begin. After the show, the Jammin' Ninja will enter the Republic of Babahl. He is set to meet with the Ambassador of Babahl at that time.\nKay: AHH! The Jammin' Ninja's show is about to start! We've gotta get back to our seats!\nEdgeworth: Regrettably... I don't have much of an interest in ninjas...\nKay: Well, this show will change your mind! Come on, we have to hurry! If we miss even a second of the Jammin' Ninja's awesome playing, I'll never forgive you!\nEdgeworth: (Nngh... I suppose you're not about to give me much of a choice here, are you, Kay?)\nKay: Ahhh! I could listen to that \"A Ninja Marked for Death's Lullaby\" song all day! His superb playing and that sad melody really brought a tear to my eye! And his heart-wrenching voice! Now THAT'S the Jammin' Ninja's greatest weapon!\nEdgeworth: ..................\nKay: Ahh! Those pieces of Jammin' Ninja merchandise over there! I've got to have them! I especially want the hair sticks they're selling exclusively at these shows. They're exactly like the ones the heroine, Princess Misola, wears in her hair!\nEdgeworth: ...Anyway.\nKay: Anyway!? ANYWAY!? Hold it right there, Mr. Edgeworth!\nEdgeworth: Yes?\nKay: You're thinking of going home, aren't you!?\nEdgeworth: Well, it doesn't seem likely that the Yatagarasu will be making an appearance tonight. Most likely, it was simply a prank.\nKay: No way! I just know the Yatagarasu will show!\nEdgeworth: But I thought you said that the Yatagarasu doesn't send calling cards.\nKay: Yeah, I did, but...\nEdgeworth: I figured from the very beginning that this would wind up being a wild goose chase.\nKay: But that card she sent was a genuine fake calling card!\nEdgeworth: A genuine fake...?\nKay: Well, how can I word this...? The Yatagarasu's mark that's on the calling card is exactly the same as my mark. Get it now?\nOfficer: W-We've got a problem! Th-The Yatagarasu has been spotted in Allebahst!\nEdgeworth: What!?\nKay: You hear that, Mr. Edgeworth!? Hah! So you finally decided to show yourself, you phony! Hey, what gives!?\nGuard: I'm sorry but I will need to search you before you may enter.\nKay: What the!? Hey! The Steel Samurai just waltzed straight on through without one! Now if you don't hurry up and let me through, my phony is going to escape!\nEdgeworth: Kay, a country's embassy is considered to be a part of the country itself. If you don't go through the proper procedures to enter the country...\nKay: Mr. Edgeworth! I'm going to enter through Babahl and climb over the wall into Allebahst!\nEdgeworth:\nEdgeworth: You would tell a prosecutor straight out that you intend to illegally enter another... Kay, are you listening to me!?\nKay: Kay Faraday, and I'm coming through!\nGuard: Yes, and welcome!\nEdgeworth: Someone stop her! Anyone!\nEdgeworth: *huff, huff, huff*... Kay... Where are you? Don't tell me you really did find some way over this fence... Ack!\nGuard: Fire! This is too big for us to handle! Looks like the Yatagarasu came to Babahl, too!\nEdgeworth: You... accursed Yatagarasu! Kay! You...! You had better be alright, wherever you are!\nKay: I told you! It wasn't me!\nShih-na: ..................\nEdgeworth:\nEdgeworth: *huff, huff, huff*... Kay! Are you alright!?\nKay: Do I look alright to you!? Now, can you do something about this woman!?\nGumshoe: Mr. Edgeworth...\nEdgeworth: Detective Gumshoe! What is the meaning of this!?\nGumshoe: *sigh* Well, sir... it's um, this.\nEdgeworth: He's...!\nKay: It wasn't me! He was already dead when I ran in here, hot on the heels of the fake Yatagarasu! Look, I only came in here because I saw a suspicious person at the open-air stage!\nEdgeworth: A suspicious person?\nKay: A long, black coat and a hood over their head -- I dare you to tell me that's not suspicious! When I saw that person, I immediately thought that they must be the fake Yatagarasu. So I chased after them into the Embassy, then into here, and then lost sight of them... But I just KNOW that person is the one who did it!\nShih-na: What are you so worked up over? There is no reason for you to be this loud.\nEdgeworth: Correct me if I'm wrong, but you're Agent Lang's secretary... ...Shih-na, I believe your name is, correct?\nShih-na: ..................\nEdgeworth: And if you are making an arrest... ...I assume you have evidence that it was Kay who committed the crime, is that also correct?\nShih-na: ..................\nEdgeworth: You refuse to answer!?\nShih-na: I don't need to answer.\nEdgeworth: !\nShih-na: You are merely a prosecutor in this country, meaning you have no investigative authority.\nGumshoe: H-Hey, pal! Just what the heck does what you just said mean!? If it happened here, it's under Mr. Edgeworth's jurisdiction. The end. And seeing as how this building is sitting on our soil, we can investigate wherever we'd like!\nEdgeworth: Unfortunately, Detective, embassies are a different matter.\nGumshoe: Huh?\nEdgeworth: This office is considered to be a part of the Republic of Babahl. Which means that anything that happens in here... ...defaults to the control of the Babahlese government and Babahlese law... ...giving them exclusive extraterritorial rights.\nGumshoe: Extraterrestrial (changed from [Extraterristrial] in the original release, correcting the typo) rights? Sir, do you really believe that the truth is out there!?\nEdgeworth: *sigh* Basically, our country's laws do not apply inside the embassy of another country. That's what was agreed to by our respective governments. Our authority to investigate was effectively nullified the second we entered this place. Which means we can do little here in this situation...\nGumshoe: N-No way, sir!\nShih-na: Please leave this matter in Interpol's hands and go home.\nEdgeworth: N...Nnnnngh...\nGumshoe: M-Mr. Edgeworth...\nKay: H-Hey, you're not...!? Mr. Edgeworth!\n???:\n???: In that case... allow me to join your investigation.\nGumshoe: M-Ms. von Karma! Eeek!\nFranziska: Ambassador Palaeno, I truly appreciate you allowing me to join the investigation.\nPalaeno: It's really nothing. Manny was my secretariat, so of course I want to help you as much as I can. In fact, it's a blessing that Interpol agents were able to make it so quickly.\nEdgeworth: Franziska...\nFranziska: Well, well. I never imagined that I'd meet you here of all places. This is an embassy, meaning that you have no authority to conduct...\nEdgeworth:\nFranziska: A-Already!? What is it!?\nEdgeworth: Ambassador Palaeno.\nPalaeno: Hm? And you are?\nEdgeworth: I'm Miles Edgeworth, public prosecutor. I ask that you please allow me to investigate this case as Ms. von Karma's assistant.\nGumshoe: A...Assistant?\nFranziska: Miles!? What the heck do you think you're...!?\nEdgeworth: Please, I implore you, Ambassador Palaeno.\nPalaeno: Very well. I'll be counting on the two of you, Ms. von Karma and Mr. Edgeworth.\nGumshoe: Umm... What did you mean by you'll be Ms. von Karma's assistant...?\nEdgeworth: I don't exactly have a choice, do I, Detective? If I don't become Franziska's assistant, I can't participate in this investigation.\nFranziska: Hmph. There you go again, running at the mouth with that aloof expression on your face.\nEdgeworth: Franziska, please...\nFranziska: I don't know what you're planning quite yet... ...but at least I do know one thing -- that you are now my subordinate. Just remember that my whip is always ready to wake you, should you have a brain lapse.\nEdgeworth: Of course. I'll keep that in mind.\nShih-na: ...If you are done playing games...!\nEdgeworth: Right. let's begin the investigation.\nEdgeworth: By the way, Detective... I suppose it's a bit late to be asking, but why are you here?\nGumshoe: Well, better late than never, I guess, sir. I was placed on guard duty for the Babahlese Embassy today!\nEdgeworth: And why are our police guarding an embassy?\nGumshoe: Well, on account of the card they got from the Yatagarasu... ...they called us up and asked for our help, sir. Oh, and because we've been searching for the Yatagarasu these past seven years! It was a more or less mutually beneficial arrangement, if you ask me!\nEdgeworth: Except for how mutually unbeneficial this has all turned out to be, I suppose. It looks like you failed to competently perform your guard duty yet again.\nGumshoe: Ack...!\nEdgeworth: Look forward to your next salary negotiation... although, it's out of my hands.\nGumshoe: But sir! If it gets cut any more, I won't be able to buy even instant (changed from [packet] in the original release) noodles anymore...\nAfter connecting \"Locked safe\" and \"Key used at Embassy\" Logic:\nEdgeworth: We know for a fact that the Yatagarasu's Key was used at this embassy. Furthermore, we found it in the victim, Mr. Coachen's pocket. Which leads me to think that perhaps it is the key to the personal safe in this office.\nGumshoe: Good thinking, sir! Let's go try it out!\nEdgeworth: ...It appears I was correct. (The key that was left to us in the victim's pocket... It literally turned out to be the key to the next piece of the truth!) Hmm... What do we have here?\nGumshoe: Hey! There's nothing inside! D-Do you think the Yatagarasu made off with everything, sir?\nEdgeworth: No, Detective, I believe all we need is a closer look.\nLeads to examination of safe\nEdgeworth: What is this here?\nGumshoe: It looks like the ripped corner of a piece of paper, sir.\nEdgeworth: No, I don't think it's ripped; it seems more, to me, like it's stuck in the safe.\nGumshoe: Hey, you're right! It won't budge an inch, not even when I tug on it! But I don't think I've ever seen paper stuck on the inside of a safe before...\nEdgeworth:\nEdgeworth: Detective, I think you have it backwards. It's not the paper that's strange... It's the safe.\nGumshoe: What do you mean?\nEdgeworth: What I mean is that the secret to this safe is that...\nEdgeworth: Even just eye-balling it, you can see that the inside is a bit too shallow. Furthermore, with the unnatural way the paper is stuck at the back of the safe... ...I'd say that there is an extra bit of space behind the back wall of this safe! In other words, this safe has a second compartment.\nGumshoe: Wh-Whaaaaaaat!?\nFranziska: I suppose that you are correct in asserting that the paper is stuck in an unnatural manner. However, if what you say is correct and there is a second compartment... ...how do we go about opening the door to it then? As you can see, there is no other lock or keyhole in sight.\nEdgeworth: Actually, there is one more spot of interest to me on this safe.\nFranziska: Oh?\nEdgeworth: Yes, and I believe that spot is the keyhole to our mystery second lock!\nFranziska: The safe and its locks... Alright then, since you are so sure of yourself, show me how you deduced your answer!\nLeads to examination of safe\nEdgeworth: Doesn't the shape of this keyhole remind you of something, Franziska?\nFranziska: The shape? It does look very familiar... However, I believe it's simply a latch hole for the safe's lock mechanism. It's just for keeping the door shut, nothing more.\nEdgeworth:\nEdgeworth: Is that so? The person who used this safe... ...Mr. Coachen, made sure this safe had two compartments, in order to hide something. Do you honestly think someone like that would allow the keyhole to the hidden half... ...to look so obviously like a keyhole that even the average person could figure it out?\nFranziska: ! ...You can't be serious...! Are you saying that this hole is the keyhole to the hidden compartment of this safe?\nEdgeworth: That's precisely what I'm saying.\nFranziska: ...!\nEdgeworth: And I will prove to you right now... ...that the Yatagarasu's Key is the key that will open it!\nFranziska:\nFranziska: The Yatagarasu's Key!? Miles Edgeworth! This had better be a very bad joke!\nEdgeworth: Sorry, but this is no joke. The Yatagarasu's Key... ...is the very key that will open the second compartment of this safe.\nFranziska: We know that this key opens the first compartment of the safe. But the keyhole you're talking about... ...is of an entirely different shape than that of the key!\nLeads to examination of Yatagarasu's Key\nEdgeworth: Let's go over this again, shall we? The Yatagarasu's Key... ...was originally made to open Mr. Coachen's safe in the Cohdopian Embassy. We confirmed that as fact by opening the door to his safe with it. Now, let's take a look at the back end of the key. Looking at the knife portion head on, what do you see?\nFranziska: What are you talking... Aaah!\nEdgeworth: It appears that you've come to understand what I'm talking about. When viewed head-on, the knife's blade is the exact same shape as the keyhole! The real function of the knife portion is to act as the key to the hidden portion of the safe.\nFranziska: B-But that's... preposterous!\nEdgeworth: Because it looks like a knife and was used like one to kill Mr. Faraday seven years ago... ...we fell under the misconception that it was always meant to be a knife. But for both the safe and its key to conceal such clever tricks... ...whatever is hidden inside the secret section must be of incredible importance.\nFranziska: .........Then, it's even possible that what I've been searching for is inside! Scruffy! Hurry up and open that safe!\nGumshoe: Eeeek! Y-Yes, sir! Opening it now, sir!\nEdgeworth: These items... They're...!\nGumshoe: It's a bunch of funny-shaped things. I guess they're pieces of art, huh, siiiiir!?\nFranziska: You're in the way! Now, move, Scruffy!\nGumshoe: I didn't think I was in the way... *sniffle*\nFranziska: These pieces of art...! They're identical to ones that have been stolen from various countries around the world!\nEdgeworth: I figured as much... These are the treasures this section of the safe was to hide from view! Hmm... I believe a more thorough examination is required.\nLeads to examination of safe\nEdgeworth: Take a good look at these documents, Franziska.\nFranziska: It says that there are three pages in total, and yet, there are only two here.\nEdgeworth: Correct. Now take a look at the smuggling activity document in your possession. Tell me, is it not possible that your page was taken from this set of three?\nFranziska: Well, well... It certainly looks that way.\nEdgeworth: By putting our multi-part puzzle together, we seem to have arrived at an answer. And it seems that you have now found what you were looking for.\nFranziska: Yes, and with this, it has become crystal clear... ...that Mr. Coachen himself was responsible for the mass smuggling of Babahlese ink!\nEdgeworth: Babahlese ink?\nFranziska: Babahlese ink is a special product of the Republic of Babahl. However, due to a special reason, only a limited volume is ever exported.\nEdgeworth:\nEdgeworth: And that reason is...?\nFranziska: That's classified. It's on a need to know basis, and you don't need to know. In any case, it seems that the head of the smuggling ring was our victim, Mr. Manny Coachen.\nEdgeworth: His base was in an embassy, thus, it was hard for both our country and his to interfere. Making it the ideal conditions under which to run a smuggling operation.\nFranziska: Argh... but it's so frustrating. I lost the person I was to rain judgment down upon with my Whip of Justice.\nEdgeworth: Well, even if he is dead, we still have a responsibility to look into his misdeeds.\nFranziska: You expect me to whip a dead man? ...Well, I'm not interested.\nEdgeworth: Franziska... You must know... ...that Manny Coachen was the suspect in the KG-8 Incident...\nFranziska: Of course I know! On top of being the head of the smuggling ring... ...there is the matter of what really happened in that case that needs to be resolved.\nAfter connecting \"Motif on knife handle\" and \"Butterfly of Babahl\" Logic, and examining golden statue and knife rack:\nShih-na: ...Are you done investigating?\nEdgeworth: ..................\nShih-na: You realize now, don't you? That this girl is the only one it could be. Now come along quietly, Yatagarasu... Kay Faraday. You are under arrest for the murder of Manny Coachen.\nKay: M...Mr. Edgeworth! Please, you have to believe me! I didn't do it! I chased the fake Yatagarasu in here... and he... he was already...\nShih-na: You have the right to remain silent. Anything you say can and will be used against you.\nEdgeworth:\nEdgeworth: I'd like to help you reduce the number of mistaken arrests Interpol makes.\nShih-na: ...What is that supposed to mean?\nEdgeworth: I believe I told you that Kay Faraday is not the culprit of this crime.\nShih-na: ...Very well. I suppose I have no choice. I'll show you just how foolish your claims are!\nShih-na: Even your police confirmed that the Yatagarasu infiltrated the Babahlese embassy tonight. Utilizing the confusion caused by the fire, the Yatagarasu snuck into this embassy. Furthermore, this girl claims to be the Yatagarasu. And most importantly, other than her, there was no one else in here with the body.\nEdgeworth: Your reason for suspecting Kay is because you think she is the Yatagarasu?\nShih-na: ...Exactly. But it isn't just me. She calls herself the Yatagarasu.\nKay: Argh! Look, how many times do I have to tell you!? I was only out to capture the fake Yatagarasu!\nShih-na: Imposter or not... it matters not. A Yatagarasu is a Yatagarasu.\nEdgeworth: Very well. Then I shall prove that Kay is not the Yatagarasu who killed Mr. Manny Coachen!\nShih-na: ...Go ahead and try. Show me what the prosecutors of this country are made of.\nShih-na: Even your police confirmed that the Yatagarasu infiltrated the Babahlese embassy tonight.\nShih-na: Utilizing the confusion caused by the fire, the Yatagarasu snuck into this embassy.\nShih-na: Furthermore, this girl claims to be the Yatagarasu.\nShih-na: She wanted to steal documents regarding smuggling, so she killed Mr. Coachen for the key.\nShih-na: And most importantly, other than her, there was no one else in here with the body.\nEdgeworth: (So Agent Shih-na suspects Kay of murder simply because Kay is the Yatagarasu. But if I can prove that the Yatagarasu's goal is not related to murder... ...then I may be able to begin to reason with her!)\nEdgeworth: Agent Shih-na. I regret to inform you, but there is a flaw in your logic.\nShih-na: Oh?\nEdgeworth: Even if you claim that she is the killer, and the Yatagarasu... ...I am certain that securing the smuggling documents is not the motive behind the murder! The key to the safe in this room was found on Mr. Coachen's body. Furthermore, the Yatagarasu would not be so stupid as to leave without the documents.\nShih-na: .........!\nEdgeworth: By the simple fact that the documents were still in the safe when we looked... ...it's obvious that the killer's target was not the safe at all!\nShih-na:\nShih-na: Then perhaps she didn't know that Mr. Coachen had the key on him.\nEdgeworth:\nEdgeworth: If that's the case, then why would she have needed to kill him? Because I can think of no reason for her to kill him if she had not known that fact!\nShih-na:\nShih-na: Need, reason... All of this is simply our conjecturing after the fact. It's entirely possible that she accidentally killed him when she was sneaking him.\nEdgeworth: .........!\nShih-na: Perhaps she didn't notice the safe's second compartment before returning the key.\nEdgeworth: Arngh!\nShih-na: But the fact still remains... that Mr. Coachen was stabbed to death.\nEdgeworth:\nEdgeworth: But you have no definitive proof that it was Kay who committed the act!\nShih-na:\nShih-na: ...Actually, I do. I saw her holding the knife she used on the victim with my own eyes.\nEdgeworth: Wh-What...!?\nShih-na: ...Allow me to tell you a bit more about the evidence that will put her away behind bars.\nShih-na: The knife wound on the body is consistent with the blade of the knife. The knife with the butterfly handle is the murder weapon, which the killer was holding. I assume she obtained the knife from the display rack and used it on the victim. The knife is a part of a special 3-piece set, which has a design like no other. The evidence and testimony, it all points to the girl. There is no counterargument.\nEdgeworth: Nnnnnrrrrrgh... Th-That is your definitive evidence...!?\nShih-na: You see now that she is definitely the killer, right?\nKay: No! Mr. Edgeworth, you've gotta believe me! I saw a suspicious person in a long black coat outside the Embassy, I swear!\nEdgeworth: And you came in here because you were chasing this suspicious person?\nKay: That's right. I ran into this office only because I was chasing after that person... But when I entered the room, it was pitch black. I couldn't see a thing. I felt something on the ground next to my foot, so I turned on the lights, but then...\nKay: Aaaaaaaaaaaaaaaaaah!\n???: ...Who's there!?\nShih-na: This is...\nShih-na: I came to this room upon hearing the girl's scream. And when I saw her holding the knife, I immediately restrained her.\nEdgeworth: So the object Kay felt by her feet on the floor was the murder weapon...!?\nShih-na: I had the knife analyzed right away, but we failed to find anyone's (changed from [anyone] in the original release, correcting the typo) prints on it.\nKay: But the suspicious person in the black coat who came into this room before me...!\nShih-na:\nShih-na: You continue to insist there was such a person, but if there was, where did they go?\nKay: That... I don't know. But I know they came in here!\nShih-na:\nShih-na: That sounds like the desperate excuses of a suspected killer, not a trustworthy testimony. You understand, don't you? We can't trust this girl's words, Mr. Edgeworth.\nEdgeworth: Gnnrk! (She has a point. Even if Kay's words are the truth... ...I must show that they are with some solid evidence!)\nKay: Mr. Edgeworth... I really didn't...!\nEdgeworth: ! Kay... Don't worry. If you didn't do it, then there must exist a way for me to prove that.\nShih-na:\nShih-na: Still not giving up, I see. In that case, try to counter my argument, if you can.\nEdgeworth: Don't worry, I can and I will!\nShih-na: The knife wound on the body is consistent with the blade of the knife.\nShih-na: The knife with the butterfly handle is the murder weapon, which the killer was holding.\nShih-na: I assume she obtained the knife from the display rack and used it on the victim.\nShih-na: The knife is a part of a special 3-piece set, which has a design like no other.\nShih-na: The evidence and testimony, it all points to the girl. There is no counterargument.\nEdgeworth: Agent Shih-na's proof is the Babahlese knife that Kay was allegedly holding.\nGumshoe: Yeah... So, um, how are you going to prove that Kay didn't do it, sir?\nEdgeworth: If Agent Shih-na wants to suspect Kay merely because Kay was the only one here... ...then I must show with evidence that Kay couldn't have committed the murder!\nGumshoe: Um, but do you have such evidence, sir?\nEdgeworth: Yes. There is one piece of evidence that seems very unnatural to me. ...And I believe it is my duty to point that out to Agent Shih-na.\nEdgeworth: So the murder weapon was the knife with the butterfly design on it. But is that really the truth?\nShih-na: What are you getting at?\nEdgeworth: I'd like for you to take a look at this. There is blood on the blade, and yet, there's not a speck of blood on the handle. This signifies that at the time of the crime, a different handle was attached to this blade. The knife that Kay was holding... ...had its handle switched, and was, in fact, not the real murder weapon!\nShih-na: It wasn't... the real murder weapon!?\nEdgeworth: This knife can be taken apart. Shall we give it a go?\nLeads to examination of Babahlese knife\nEdgeworth: As you can see, the Babahlese knife has now been disassembled into two parts. The killer must have pulled the murder weapon out of the victim's body... ...and proceeded to swap the knife's original handle with this butterfly one. It was all to create the illusion that Mr. Coachen was killed with the butterfly-themed knife!\nShih-na: Uurrnngh... Aaaaaaaaaaaaaah!\nEdgeworth: (This should clear up any and all suspicion surrounding Kay.)\nBabahlese Knife Handle data jotted down in my Organizer.\nShih-na: Your argument isn't airtight yet!\nEdgeworth: How so?\nShih-na: It's possible... that the girl herself is the one who switched the handles.\nEdgeworth:\nEdgeworth: Don't be ridiculous! For what purpose would she do such a thing!?\nShih-na: I don't care to know how a criminal thinks. The way they view the world is beyond the comprehension of a normal person like myself. Therefore, I wouldn't put anything past them, no matter how odd it may seem.\nEdgeworth:\nEdgeworth: ...Heh. The truth is right there in front of you, and this knife will show you the way! You will come to see that Kay is not and could not have been Mr. Coachen's killer!\nLeads to examination of Babahlese knife\nShih-na: What is this mark on here?\nEdgeworth: It's the mark of a flower. I assume you know what this means?\nShih-na: No, not really. Butterflies rest on flowers all the time to drink their sweet nectar.\nEdgeworth: ...And so they do. (However, would this butterfly really drink the nectar of this flower? The answer is clearly... not a chance! Now to prove the relationship between the butterfly and the flower with this!)\nShih-na: ! Y-You can't be serious...!\nEdgeworth: Hmph... It appears that you've made the connection. The flower on this blade is designed after a certain country's national symbol. That's right... The Kingdom of Allebahst. In other words... This blade is from one of Allebahst's ornamental knives!\nShih-na: Aah!\nEdgeworth: This part of the knife handle... ...has Babahl's national symbol of the butterfly on it. Therefore, it is undeniably Babahlese in origin! But as we both know, you can't kill someone with just a knife handle. Incidentally, when exactly did the murder occur again, Agent Shih-na?\nShih-na: Ack! After the fire had broken out...\nEdgeworth: That's right. Kay entered the Babahlese Embassy after the fire had taken place. Furthermore, she had not been to the Allebahstian side of the building before then. On top of that, not a single person passed between the two countries during the fire... ...which means that Kay could not have transported an Allebahstian object over here! This makes it impossible for her to be the true killer!\nShih-na: ..................!\nGumshoe: Whooooop! Way to go, Mr. Edgeworth, sir! What a great victory!\nEdgeworth: ..................\nFranziska: ..................\nShih-na: ..................\nGumshoe: Huh? Hey, why is everyone so quiet...?\nEdgeworth: (I'm happy we got this far and cleared Kay's name... ...but what worries me now is what will happen next.)\nFranziska:\nFranziska: What is the meaning of this!? An Allebahstian knife, here...!?\nEdgeworth: Do you mean... how did this find its way to the Republic of Babahl? It didn't just find its way over. Rather, we should focus on how it was smuggled over!\nKay: You know what!? My brain hurts thinking about it while we're just standing around! Thinking while you're on the run? Now THAT'S the way a real Great Thief operates!\nEdgeworth: Kay...?\nKay: Oh, thanks a bunch, Mr. Edgeworth! For proving me innocent, I mean! You believed in me the whole time, right? Tell me you did!\nEdgeworth: Umm, not really, but...\nKay: Ha ha. Come on, you don't have to be shy about it!\nShih-na:\nShih-na: ...Your argument is still not airtight.\nEdgeworth: Would you care to elaborate?\nShih-na: I understand now that the girl didn't commit the murder. However, there is still the possibility that she is the Yatagarasu.\nKay: That again!? Look, how many times do I have to explain it to you!? I am the real Yatagarasu! I'm not like that fake one that goes around setting fires, OK!?\nShih-na: Whether you're the real deal or a fake, it doesn't really matter. All I have to say is this: I have my suspicions that this girl is the one who started the fire.\nEdgeworth:\nEdgeworth: Preposterous! On what grounds do you suspect her of such a thing!?\nShih-na: The fact that she calls herself the Yatagarasu. That in itself is the (changed from [a] in the original release) most elegant proof.\nKay: Ms. Shih-na.\nShih-na: Yes?\nKay: I... have no intention of taking back any of what I've said.\nShih-na: ...?\nKay: I am the Great Thief Yatagarasu. And I refuse to allow some imposter to claim that name as their own! The path of justice that my father pointed me towards... I will walk it the best I can!\nShih-na: It's not good to be so stubborn. I hope you can understand that.\nKay: Thanks a lot for the concern, Ms. Shih-na! Let me share something with you, too, as a token of my appreciation! Those sunglasses totally do nothing for you, so I'll steal them from you next time, OK!?\nShih-na: Wh--!?\nKay: Well, I guess we'd better get going!\nFranziska: Going...? To where?\nKay: To the Kingdom of Allebahst! If we don't go, we won't know for sure, right?\nFranziska: I suppose not... We won't get anywhere simply by standing here thinking. To see where the Allebahstian knife came from... ...we'll have to pay the Allebahstian Embassy a visit. Let's go, Miles Edgeworth. As you are my subordinate... I will not tolerate you bringing the investigation to a halt.\nEdgeworth: Hmph... Understood.\nTo be continued\nMIB: Count off!\n1! 1! 1! 1! 1! 1! 1! 1! ...1! 1!\nMIB: Shifu! 99 callouts! So all 99 members are most likely here and accounted for, sir!\nLang: ...Hey, you. Yeah, you, the second #1 from my right.\nOfficer: Sir! Yes, sir!?\nLang: Here... A birthday present for you.\nOfficer: Wha...??\nMIB: Shifu! I didn't know that you knew all of our birthdays...!\nOfficer: What a kind heart you have! Shifu, you are more of a man than we'll ever be, sir!\nOfficer: Umm... I'm really sorry, but it's not my birthday...\nLang: Lang Zi says: \"A cub who disrespects others soon feels the disciplinary bite of an elder.\" That present isn't for you. It's for your younger brother's wife's younger brother. ...Tell him I said \"hi\", and \"happy birthday\", won't you?\nOfficer: Y...Yes, sir!\nMIB: Shifu! I can't believe you remember that much about each of us!\nOfficer: Shifu! I... I'm so moved that I can't stop crying!\nEdgeworth: (...I should probably leave them to their \"alone time\".)\nLang: Alright, meeting's over. Everyone... head for your posts! Dismissed!\nSir!\nLang: Yo, were you guys there the whole time? I got a call from Shih-na, and she's already filled me in. It sounds like you're out to get in my way again.\nEdgeworth: I have absolutely no intention of interrupting your investigation. I simply request that you grant me permission to investigate the Allebahstian Embassy.\nLang: Hmph. And what if I say no?\nFranziska:\nFranziska: Agent Lang! This man is my subordinate. As I have received permission from the ambassador, he is to be extended the same rights.\nLang: Sorry, sis, but it's not that simple. Allebahst has the strictest immigration regulations in the world, or didn't you know? Even among my elite men, about only half of them were admitted into the country. Besides, any more cooks in the kitchen, and we might spoil the soup, if you get what I mean.\nFranziska: How dare you make such assumptions!?\nLang: Don't take this the wrong way, but I thought I was in charge of Allebahst, Ms. von Karma.\nFranziska: Grrr!\nLang: Look, try to understand, OK? Things over in Allebahst are a bit of a mess right now.\nEdgeworth: What do you mean by \"a bit of a mess\"?\nLang: No one told you? We had an \"incident\" in Allebahst as well. This is what we call a decision based on the investigation, Mr. Prosecutor.\nKay: Look, Wolfy! Just let us in already!\n???:\n???: Is there a problem here, Agent Lang?\nLang: Not really. Just having a \"discussion\" about whether or not to let these guys in.\nFranziska: Ambassador Alba, I ask that you please allow these people to join the investigation.\nAlba: Having a debate because of my country... I'm terribly sorry for placing you good people in that kind of situation... It is all because I lacked the strength to govern well.\nEdgeworth: Please, it is nothing of the sort, Ambassador...\nAlba: You weakling, Quercus! Curse your frailty and inability to affect change in your country!\nEdgeworth: Wh-What are you--!?\nAlba: The thing is, investigations conducted in my country have been under Agent Lang. And it is my judgment that in order to minimize disruption in the investigation... ...I should leave everything up to Agent Lang.\nLang: ...There, you see?\nKay: Oh, no way!\n???:\nPalaeno: Ambassador Alba, I ask you to please reconsider letting them into Allebahst.\nAlba: What's that...?\nPalaeno: My very own secretary has been murdered in the Babahlese Embassy. And he was apparently caught up in some very shady dealings completely unbeknownst to me. So I ask for your cooperation in our investigation. These aren't much, but I hope they can cover your travel expenses to Babahl someday.\nLang: Alright, alright. I get it. Even if you beg Ambassador Alba, I still have to give the final OK anyway.\nKay: Alright! You hear that, Mr. Edgeworth!? We're in!\nLang: Not so fast, my little crow-girl. You're still a witness in the Babahl murder. So I'd like you to please stay in the Republic of Babahl.\nEdgeworth: Detective Gumshoe. Please take good care of Kay for me.\nGumshoe: Yes, sir!\nLang: Sounds good to me. The fewer troublemakers, the better.\nKay: ......... *rasp!*\nGumshoe: *rasp!*\nKay: Hey, Mr. Edgeworth.\nEdgeworth: Yes?\nKay: So I wanted to ask for a while now, but... ...that lady over there, is she who I think she is!?\nEdgeworth: Ah, that's right. I didn't introduce the two of you yet.\nFranziska: Franziska von Karma, the prosecutorial prodigy. ...It's nice to see you again.\nKay: Ooh, I knew it! You're the whip lady!\nFranziska: .........You may address me as Ms. von Karma.\nKay: Ms. von Karma, I leave the investigation of Allebahst in your hands!\nFranziska: Thanks. Rest assured, I will outsmart both the smuggling ring and the Yatagarasu!\nEdgeworth: (The smuggling ring, huh... Perhaps I should ask Franziska a bit more about them before I head into Allebahst. Ah, and I mustn't forget to thank Ambassador Palaeno for all that he has done for me.)\nAfter talking with Franziska von Karma and Colias Palaeno:\nEdgeworth: Well, shall we get going?\n???:\nEdgeworth: What's wrong, Kay?\nKay: I didn't get permission to enter Allebahst... ...so we're going to go gather whatever info we can over on the Babahlese side, OK!?\nEdgeworth: Alright, I'm counting on you two.\nKay: Right, and I'm counting on you and Ms. von Karma to sniff out clues in Allebahst! Oh, and Mr. Edgeworth! If you happen to come across my phony, you let me know, OK!? If you tell me, I'll rush on over straight away no matter where you are!\nEdgeworth: .................. I'll let you know when the time comes.\nEdgeworth: (...Hm?) Gwoooooooh!\nFranziska: What do you think you're doing to my subordinate!?\nEdgeworth: Y...You're...!\n???: Edgey...! Oh, thank the heavens you're here...! I'm in a really, really big pickle, Your Lordship! The Raven, it appeared, poof! And then disappeared, swoosh! And though I am the Steel Samurai, my sword, it... Waaaaaaaaah! I'm so confused, I don't know what anything means anymore!\nFranziska: Who is this fruitcake!?\nLarry: I am Larry of the House of Butz: Married Man of Neo Olde Tokyo, m'lady!\nFranziska: Now I remember. This... person is one of your friends, isn't he, Miles?\nEdgeworth: Yes, frighteningly enough... he is.\nLarry: Hey! What's up with that answer!? Your best bud is in a bind, and you act like it's no big deal!\nEdgeworth: What sort of \"bind\" are we talking about here...?\nLarry: The suspect kind! I accidentally became a suspect in a murdeeeeeer!\nEdgeworth: I see. That is quite the bind.\nFranziska: ...Not that we're in the least bit surprised.\nEdgeworth: Yes, I pretty much expected this news... ...from the instant I saw this unlucky face. (His name is Larry Butz. I've known him since grade school, and for as long as I've known him... ...he has been the world's largest source of Trouble with a capital T.)\nLarry: Hey! What kind of introduction is that!? You're so mean, Edgey! If you're not careful, you might find your tiny number of friends go down by one!\nEdgeworth: That was uncalled for. Besides, you're............ Wait, hold on. Laaaaaaryyyy! It was you!? YOU'RE the one who wrote my Steel Samurai autograph!?\nLarry: Hm? Oh, you didn't notice earlier? I even winked at you through my headpiece.\nFranziska: .........What's going on? And why are you beet-red?\nEdgeworth: Sorry... but could you not speak to me right now...?\n???:\nLang: Oh, sorry, am I interrupting your comical, yet melodramatic play?\nEdgeworth: ! .........Aha. So this is the incident you mentioned earlier.\nLang: Mr. Prosecutor, this man... this childhood friend of yours... is our prime suspect. Of what, you ask? Of the murder of a man who had snuck into this embassy, Mask☆DeMasque II!\nEdgeworth: Mask☆DeMasque II...? .................. (Only Larry could get himself into yet another mess as fine as this. But no matter what the facts seem to say, Larry is not the type to commit murder. Still, it's a rather daunting stroke of misfortune I've struck. I have to prove... that Larry Butz is innocent of all wrongdoing!)\nMIB: Shifu! We've identified the victim!\nLang: Good work. I'll take that report now.\nEdgeworth: Agent Lang, would you mind if I took a peek at it as well?\nLang: What did I tell you earlier, Mr. Prosecutor? Don't get in my way! There's only enough flesh here to feed one wolf, and that one is me! So, no, you may not take a \"peek\".\nEdgeworth: But Agent Lang...!\n???:\nBadd: ...Agent Lang. Will you... allow an investigator such as myself... to take a look?\nLang: Ah, yes. Of course. ...You, let the detective see the file.\nEdgeworth: You're... Detective Badd!\nBadd: You're... the prosecutor, Mr. Edgeworth, right?\nEdgeworth: Fancy meeting you here, Detective.\nBadd: You weren't expecting me...? Ever since that day seven years ago... I've chased after the Yatagarasu... non-stop. I even pressured Interpol... into keeping me in the loop... in case a card was ever found.\nEdgeworth: (What incredible dedication to the case.)\nLang: Detective Badd knows the Yatagarasu's M. O. very well. And his passion for the chase hasn't died down in these seven long years. It's something... I can respect. But, Detective Badd, I must ask: are you going to make an ally out of this prosecutor?\nBadd: My only goal is to arrest the Yatagarasu. If he can get to the bottom of this case, then I'm willing to share info with him.\nEdgeworth: I am in your debt, Detective Badd.\nAfter clearing all Talk options:\nEdgeworth: In any case, I believe it's high time for me to start my investigation.\nAfter correctly deducing spear and golden statue, and examining knife rack, paper in hand, Mask☆DeMasque II's head, sword, and flowers on windowsill:\nEdgeworth: Hmm... I guess that about wraps up my investigation. Hm? That's...\nLarry: Yo! Pink Princess! How're you feeling? Still feeling ill?\nPink Princess: ..................\nFranziska: ...And yet another strange character comes out of the woodwork.\nEdgeworth: And so the Pink Princess also comes to pay the Allebahstian Embassy a visit. (I believe I may need to speak with her as well...)\nAfter clearing all Talk options with Wendy Oldbag:\nOfficer: Prosecutor von Karma! I've brought the police dog, as you requested, sir!\nFranziska: Good work. You may leave now, Officer.\nEdgeworth: Hmm... This dog...\nFranziska: I requested the assistance of a dog in our search for the Yatagarasu.\nLang: Looks like you guys have some pretty bright dogs in this country, too.\n???: Woof! Woof!\nLang: Hey... You're a real cutie, aren't you? Yeah! That's a good boy!\nBadd: ...That's the police dog Gumshoe's been taking care of... I think its name is... Missile.\nFranziska: What a fitting name for a police dog that dashes out in front and attacks.\nEdgeworth: (That action alone isn't exactly what's going to solve the case for us, you know.)\nFranziska: Now, Missile. I want you to find some clues! Go!\nMissile: Woof!\nFranziska: Good dog. You really are quite bright, aren't you? ...Unlike a certain someone I know. Now, what do we have here? What... is this? It looks like a small hot dog, but...\nEdgeworth: Hm? Wait, Franziska, isn't that... an official Samurai Dog?\nMissile: Grrraaaaaaarh!\nFranziska: Ah! No! Bad Missile! .........He ate it. I wonder if it's alright for him to eat that?\nEdgeworth: It's just a meat-substance snack featuring the Steel Samurai. I'm sure he'll be fine.\nFranziska: That's quite a bit of information you gathered there in a single, quick glance.\nEdgeworth: (We should really be focusing on why there was a Samurai Dog there in the first place.)\nFranziska: Hm? It looks like that snack wasn't all Missile found.\nEdgeworth: Oh? And what do we have... here...?\nFranziska: It appears to be a lady's undershirt. I wonder if Ambassador Alba might have an interest in cross-dressing?\nEdgeworth: I somehow doubt that. It doesn't look like the shirt would even fit him. (A Samurai Dog and a lady's undershirt... What are these two items doing in a room like this? Given the circumstances, the lady's undershirt could only belong to one person. I suppose I should get this over with and ask the owner of said undershirt about it...)\nLady's Undershirt data jotted down in my Organizer.\nEdgeworth: If you could please take a look at this brown-colored undershirt...\nOldbag: Oh, Edgey-poo... What is the meaning of this!?\nEdgeworth: ?\nOldbag: Why did you steal that thing from my bags...? All you had to do was ask, and I would've gladly given you as many as you'd like!\nEdgeworth: Nnnrghk! Th-Thanks, but no thanks! This shirt was found here at this crime scene.\nOldbag: What!?\nEdgeworth: Come now, why don't you just confess... and explain what it's doing here.\nOldbag: I know nothing! NOTHING, I tell you!\nEdgeworth: What!?\nOldbag: Oh, I admit that I used the fireplace to dry that shirt! But I can't really help the fact that I had to, you know! Wearing that Pink Princess costume was like being in a sauna! And on top of that, I get fingered as a suspect!? You're too cruel, Edgey-poo!\nEdgeworth: Are you claiming that you never once set foot inside this room?\nOldbag: Of course I am! If I had been the one to find the body, do you think I'd be as calm and relaxed as I am!? I tell you, it's always like this! It's always my fault for some reason or another. That weekly tabloid article is missing? The camera is missing? That lawyer always makes sure it's my fault they're missing. Speaking of missing, there's the matter of my husband. Can you believe when we got married, he said, \"I guess I'm stuck marrying you.\" What kind of way to propose is that!? What he should've done is he should've whispered in my ear, \"I don't deserve you... but I can't help it. Will you marry me?\" Honestly, men these days!\nEdgeworth: Umm... Well... (I don't believe she is lying about her actions... So I can safely assume she really was drying her shirt by the fireplace on her break. And somehow, the undershirt managed to move from the next room into this one (Undershirt from next door - The undershirt was found in the office fireplace, but how did it get there?)...) I assume the Samurai Dog was also yours...?\nOldbag: Ah, that brilliant mind of yours. You really can see through everything about me!\nEdgeworth: (And so the feeling of dread continues... But I suppose I should ask for more details...)\nAfter connecting all possible Logic and clearing \"Samurai Dogs\" Talk option with Wendy Oldbag:\nEdgeworth: (It would appear that the answer has made itself known.)\nLang: You're making quite a confident face there, Mr. Prosecutor. Bring it on! I'm ready to counter any argument you may have!\nEdgeworth: Very well, then. If you are prepared... ...I'll show you exactly where my deductions have led me!\nLarry: Good! I'm counting on you, Edgey!\nEdgeworth: Leave it to me, Larry. My first attack will be... to expose your lie for what it really is.\nLarry: M-My liiiiiiiiiiiiiiiiiiiie!?\nEdgeworth: I know that there is still something you are keeping from the rest of us.\nLarry: Wh-What's wrong with you!? Why is it you won't believe me no matter what I say, Edgey!? Curse you! I should just hurry up and die already if that's how it's gonna be! I'll confess to every murder in the whole world, and then kill myself... ...and throw everything into mass confuuuuuuuuusion!\nLang: Heh, you made some wonderful friends as a child, I see.\nEdgeworth: Larry, I only have one thing to say to you.\nLarry: Even if you make that face at me, it's no use! A man who is ready to die is strong-willed, you know!\nEdgeworth: Larry, it doesn't matter what sort of harebrained trouble you've caused... ...I only ask that you do not lie to me. If you cause an innocent person to be judged unfairly because of some insipid lie... ...I will never forgive you!\nLarry: E...Edgey...\nEdgeworth: Although, allow me to say... ...that I consider you to be among the innocent in this case. And that I will draw the real killer out. You can trust me on this.\nLarry: Alright. I... I... This time... This time, I'll tell you the whole truth, OK!? What happened, what didn't happen, the works!\nEdgeworth: Just what happened will do! Now then, if you would please testify as to what you did up on the roof tonight.\nLarry: After the show, I left the pushcart in the Rose Garden, and came into the embassy. Then, they took a picture of me shaking hands with the ambassador. After that, and until my next appearance, I had some free time, so I wandered around. That's when I spotted the chimney. A chimney like that is a rare thing, you know. So then, I wanted to play Santa and decided to give it a try.\nEdgeworth: Larry, I thought I just finished telling you to not lie anymore.\nLarry: Umm......... But it's... kinda, ultra-embarrassing.\nEdgeworth: And what exactly is so ultra-embarrassing that you can't tell me!?\nLarry: Edgey, man! I just said it was embarrassing, so of course I can't just blurt it out! So you're just gonna have to reason it ouuuuuuuuuuuuut of me!\nFranziska: As your superior, I command you to hurry up and expose this man's lie!\nEdgeworth: I have every intention to, for I'm not about to let us waste time on such a trifling matter.\nLarry: After the show, I left the pushcart in the Rose Garden, and came into the embassy.\nLarry: Then, they took a picture of me shaking hands with the ambassador.\nLarry: After that, and until my next appearance, I had some free time, so I wandered around.\nLarry: That's when I spotted the chimney. A chimney like that is a rare thing, you know.\nLarry: So then, I wanted to play Santa and decided to give it a try.\nEdgeworth: As I suspected, you do have something to hide, Larry. But what could be so embarrassing that you'd be willing to go to jail for it!?\nFranziska: This man's mind is a complete mystery to me.\nEdgeworth: I believe it's a secret to everyone of a normal mindset how Larry's mind works. However, taking into account his usual, women-obsessed way of thinking... ...I believe that his lie this time is also related to a woman, and this is what I intend to prove.\nEdgeworth: Actually, I believe in the case of this man, playing Santa is actually quite a big deal.\nLang: Are you saying that your buddy isn't exactly made of Santa-quality stuff?\nEdgeworth: Precisely. You hit the nail on the head, Agent Lang.\nLarry: Hey, Edgey! That's so incredibly mean!\nEdgeworth: Tell me something, Larry. Did you know that Santa's job is to deliver presents to people all over the world?\nLarry: Of course I know that! I DID graduate from junior high, you know!\nEdgeworth: In that case, it's your turn to tell me something. I want you to tell me to whom you were delivering a present to.\nLarry: Umm... I was, ah... delivering a present to a child not basking in the warm glow (changed from [glow] in the original release) of love?\nEdgeworth:\nEdgeworth: That must be the most elegant description of you I've ever heard, but a lie is still a lie.\nLarry: Y-You sure know how to kick a guy when he's down, you know that!?\nEdgeworth: In any case, the person you wished to deliver a present unto was most certainly this!\nLang: Heh, interesting tastes you have there, Mr. Suspect.\nLarry: D-D-Don't spread lies about me! I totally didn't want to see Ms. Oldbag so much that I'd try to go down a chimney! Owww!\nFranziska: I advise you to stop right there in your bashing of a lady.\nEdgeworth: Well, I must admit that I, myself, hardly ever have the want to run into that lady. However... what if you were misinformed, and under the wrong impression? Then what?\nLang: Define \"wrong impression\".\nEdgeworth: I simply mean that the man before you thought to enter the old lady's room... ...without knowing one very important fact. And that fact... is best summed up with this!\nEdgeworth: This is something the old lady received from her employer for the night. The girl who normally plays the Pink Princess... Mindy, was it again? It seems that this man is quite taken with that actress.\nLarry:\nLarry: But that's not true, Edgey!\nEdgeworth: ...?\nLarry: She's the one with the hots for me! I just know it! I can feel her sexy beam piercing my heart when she's watching me! Seeeeeexy beam, I tell you!\nFranziska: You filthy, despicable, inconsiderate, fickle, idiotic, cowardly... ...apparition of a man! You haven't matured at all since we last met!\nLang: Hey, Mr. Prosecutor.\nEdgeworth: Yes?\nLang: This guy... He's got bigger problems than just getting involved in murders, I take it?\nEdgeworth: I suppose you could put it that way.\nLarry: Hey! What the heck, man!? I don't get you guys at all! Why do you all have to make me out to be some sort of bad guy!?\nEdgeworth: To return to the original topic, I propose that at least this much has been made clear. Without any knowledge that Ms. Mindy had fallen ill... ...Larry tried to make his way into the Pink Princess's room. That much we know for sure!\nLarry:\nLarry: Hey, Edgey... Looks like I've got the hang of this court thing now.\nEdgeworth: But we're not in court at the moment...\nLarry: Shut up! I see what's going on here, and it looks just like what you do in court!\nLang: I guess old boy here still has something he'd like to say. Lang Zi says: \"Until the root of the tongue dries, one never knows the whole truth.\" You shouldn't form conclusions until everything is out in the open, which is why I'll listen.\nLarry: Alright! Then get ready to listen to me defeat Edgey in a battle of wits!\nEdgeworth: (Larry, have you forgotten that should I \"lose\", your victory prize will be your arrest?)\nLarry: So you think that all I wanted to do was to go visit Mindy? Well, I dressed up as Santa and climbed up to the chimney, but the smoke was really thick. It was a case of mistaken identity, and that mistake made me late for the speech. Then, to top it all off, I became a suspect in a murder. THAT'S what you really meant. But why would I ever put myself through so much humiliation on purpose!?\nEdgeworth: ..................\nLang: ..................\nLarry: ..................Hey! Someone say something!\nEdgeworth: Larry, are you seriously trying to submit this, not as a confession, but as testimony?\nLarry: So what if I am!? Is there something wrong with that!? My claim is a claim claiming my claim. Do you have a problem with that!?\nOldbag: So it was you! You're my stalker! But I should warn you, it doesn't matter what kind of flattery you throw at me. I'm the devoted type of woman who's wholly focused on one man, and one man only! And as long as Edgey-poo is alive, I can't just drop him and be unfaithful! No, I can't! Although, earlier, I was tempted just a tiny-winy bit by that wolf-man! But that was just a test of my love for my dear Edgey-poo, which I passed with flying colors! But from now on, I will stay completely true to my beloved Edgey-poo for the rest of eternity! I swear it!\nLarry: Aaaaah! I-I'm so inspired!\nFranziska: You're such an inconsiderate, cowardly, idiotic, and all-around completely worthless man!\nEdgeworth: (I thought I heard something ominous just now, but perhaps it was just my imagination.) I believe there is nothing further for me to prove at this point...\nLarry: What do you mean!? Of course you've still got something to prove! You still have to show some proof that I was trying to meet up with Mindy!\nEdgeworth: \"Proof\", you say?\nLarry: Remember, Edgey!? Everything is evidence in court, right!?\nEdgeworth: You mean, \"Evidence is everything in court,\" Larry, but I understand your point.\nLarry: Yeah, see! I'm totally a pro at this now!\nEdgeworth: Very well. If you wish to see the evidence... ...then let me show you the last piece of evidence you'll ever wish to see.\nLarry: So you think that all I wanted to do was to go visit Mindy?\nLarry: Well, I dressed up as Santa and climbed up to the chimney, but the smoke was really thick.\nLarry: It was a case of mistaken identity, and that mistake made me late for the speech.\nLarry: Then, to top it all off, I became a suspect in a murder. THAT'S what you really meant.\nLarry: But why would I ever put myself through so much humiliation on purpose!?\nEdgeworth: (This whole testimony is one giant confession of all that he's done tonight. He's practically begging me to show why he bothered to put himself through all of this.)\nEdgeworth: Larry, don't even think about denying that you have knowledge of this letter.\nLarry: H-H-H-H-H-Hey! Wh-Wh-Wh-Wh-Wh-Why are you showing that thing to me!?\nFranziska: \"Wéndy, I'll be descending on you from above tonight. Your loving knight\" Well, isn't that just romantic?\nEdgeworth: But you weren't able to \"descend on her from above\", were you... Mr. Loving Knight?\nLarry: Aaaaaaaaaaaarghn! I-I have no idea what you're talking about! I don't remember a thing!\nEdgeworth:\nEdgeworth: You can pretend to be ignorant all you'd like, but it's written right here. This letter proves that you were not out to meet the old lady... ...but rather, that you were attempting to pay Ms. Mindy a visit! (What part of this letter shows that the person Larry had intended to meet was Mindy?)\nEdgeworth: Larry, I suggest you take up penmanship lessons. That is... ...if you never wish to experience this level of embarrassment ever again.\nLarry: Wh-Wh-Wh-What the heck!? What are you talking about!? Speak English!\nEdgeworth: You wrote \"Mindy\" so sloppily that it became \"Wéndy\" to the average eye.\nLarry: ...Hey, stop picking on me... It's so embarrassiiiiiiiiiing!\nLang: There, there. Isn't that what childhood friends are for? They're the best, aren't they? ...For punching. But that will have to wait until we're off of this crime scene.\nLarry: Eek! Edgey! Save me from the scary man!\nEdgeworth: Sure, if you're willing to make amends. Starting with your incredibly embarrassing mistake!\nLarry: .........That... That... That wasn't me!\nEdgeworth: Come again?\nLarry: It's a fake! Someone's out to get me, so they made that fake letter... ...to set me uuuuuuuuup!\nFranziska: Accept your defeat graciously!\nLarry: But... you guys are being so mean...\nEdgeworth:\nEdgeworth: ...Penmanship analysis.\nLarry: What's that?\nEdgeworth: No matter who, all people have certain unique features to their handwriting. Ergo, all we have to do is compare the handwriting in this letter to a sample of yours... ...and we'll know soon enough who it was that sent this letter.\nLarry: I...I...I... I'll never write another thing in my life!\nEdgeworth:\nEdgeworth: Tsk, tsk, tsk... It's no use, Mr. Loving Knight. For you've already graciously provided me with a sample of your handwriting!\nEdgeworth: This autograph and our mysterious letter... If we compare the handwriting, we'll know the answer to our questions soon enough.\nLarry: Gnn...nnn... Nnnnnnnn...!\nEdgeworth: Confess now, Larry... to your miserable failure!\nLarry: I...I'm soooooooooooooooooooooooooooooooooooooooooorry! I... I... I did it... It was me causing trouble again... I admit it. You hit the nail right on the head... Edgey...\nEdgeworth: (So, he finally confesses...)\nLarry: I saw the Pink Princess being carried around in a stretcher, and got worried, alright!? I wanted to go into Mindy's room, but the doctors wouldn't let me in. So what choice did I have!? It was the chimney or bust, Edgey!\nFranziska: Your mind jumped from the door to the chimney? What a criminally overactive imagination.\nLarry: Well, at least I was honest and wrote Mindy a letter, and stuck it under the door. That way, she wouldn't be so shocked when I came down through the chimney!\nEdgeworth: (Except for the fact that the letter was an utter failure at conveying said sentiment...)\nLarry: I'm really, really sorry...\nEdgeworth: Larry, you may be a shameful, good-for-nothing blight on the face of humanity... ...however, I always knew you weren't the killer. I told you to trust me... ...because, at the very least, I can attest to that about you.\nLarry: Edgey... You're... Aaaack!\nFranziska: We've lost a lot of valuable time because of you...!\nLarry: Owwwwwwwww!\nFranziska: In any case, I believe we can say that we now know exactly what happened. Mr. Larry Butz sought to climb down the chimney... ...not for access to the crime scene... ...but to enter the room of the elderly lady next door.\nLang:\nLang: Great job, Mr. Prosecutor. Although, I still find it a bit unbelievable that the two of you are friends.\nEdgeworth: ..................\nLang: But the suspicion on that guy over there... ...isn't completely resolved yet, so don't get any funny ideas about running off, OK?\nLarry: Owwwww...w? H-Hey... What--? Edgey... What does the wolf-man mean when he says I'm not off the hook yet?\nEdgeworth: .........He means the murder weapon. Larry, did you forget? There are two layers of suspicion hanging over your head.\nLang: That's exactly what I mean. We can't only rely on the words of the suspect, after all. We may have figured out where he was and what he was doing all night... ...but the blood-stained Samurai Sword that was left at the crime scene... As long as there is no satisfactory explanation for that... ...this wolf will refuse to ease up on his bite!\nLarry: Eeeeeek! Edgey! That guy... He looks like he's seriously about to take a bite out of me!\nEdgeworth: I'm well aware. And you should be as well, that this upcoming battle will be crucial.\nLang: Thanks to the cooperation of our lovely bumbler... ...I've been dealt a very nice hand, and a sweet trump card. Looks like we're about to enter the final bout! Now, Mr. Prosecutor! Let's see what you've got!\nEdgeworth: (I can easily point out the contradiction in the supposed \"murder weapon\"... ...but the real problem for me is figuring out what the real murder weapon is. This will be a high-stakes gamble! But this is one game I can't afford to lose!)\nLang: I was the one who found the body of the victim, DeMasque II. Beside him was the Samurai Sword... glittering red, and offering up the scent of blood. It was supposed to be in the Steel Samurai's dressing room, but I found it here instead. Plus, I found the murder weapon's owner, the suspect, Larry Butz in here, too.\nEdgeworth: Isn't it a bit far-fetched to accuse someone simply on the basis of ownership?\nLang: But this owner wanted to sneak onto the crime scene. I think that's plenty to go on, don't you?\nEdgeworth:\nEdgeworth: If you're alluding to his reason for being by the chimney, we've already established that!\nLang:\nLang: Hold on there, Mr. Prosecutor. You two are long-time friends, right? Who's to say you didn't fabricate the evidence to give him an alibi?\nEdgeworth: .........You're accusing me of fabricating evidence?\nLang: You think I can believe anything you produce? Forging evidence is all you prosecutors do!\nEdgeworth: .........! (This man has some serious issues with prosecutors...)\nLarry: But come on, I can't think up something as complicated as that! Right, Edgey!?\nEdgeworth: Larry, I can agree because I know you and your personality well. However, Agent Lang knows nothing about you... or me, for that matter. (I sense his hatred for my entire profession emanating from his entire being. Meaning that the only way I can prove Larry's innocence is to present irrefutable evidence.)\nLang: I was the one who found the body of the victim, DeMasque II.\nLang: Beside him was the Samurai Sword... glittering red, and offering up the scent of blood.\nLang: Beside him was the Samurai Sword... covered in the victim's blood.\nLang: I suspect he beat the victim to death with that thing.\nLang: It was supposed to be in the Steel Samurai's dressing room, but I found it here instead.\nLang: Plus, I found the murder weapon's owner, the suspect, Larry Butz in here, too.\nEdgeworth: (It's simply not possible that the Samurai Sword is the real murder weapon. So I should focus on proving that point to Agent Lang first.)\nEdgeworth: Do you know what this is, Agent Lang?\nLang: Heh, it's a long spear, right? We used to use those a lot in my country a long time ago. Piercing, mowing people down... Spears are the weapon of heroes throughout history.\nFranziska: It's the next most effective weapon after the whip.\nEdgeworth: (I think the whip is in a slightly different category...)\nLang: So, what's your point? Are you going to tell me that the spear is the real weapon?\nEdgeworth: No. I simply want you to take a look at this section here.\nLang: The way it's bent...?\nEdgeworth: Precisely. Apparently, a certain troublemaker hit it against a wall in this embassy earlier. And as you can clearly see, the insides of the Steel Samurai's weapons are hollow. In other words, they're replicas that aren't strong enough to deliver a damaging blow... ...let alone the multiple strikes necessary to bludgeon someone to death. And yet, there is not even a dent in the Samurai Sword. How do you explain that!?\nLang: A...Aiyaaaaaaaaaaaaaaaaa!\nLarry: Oh, yeah... The sword and the spear are made of the same stuff, so they bend easily! But I wish they'd make them out of better stuff! Because the spear got bent... ...I wasn't able to do my special \"Early Summer Rain Jab!\" move! Man, I got such an earful from the director of the play for not doing it in the show!\nEdgeworth: (The Steel Samurai's special move was changed tonight because of him...!?)\nSamurai Spear data updated in my Organizer.\nLarry: Yeoooooooooowch!\nFranziska: That's more than enough of your whiny whimpering! Now... back on the topic of the spear.\nEdgeworth: Yes, let's return to the real topic of discussion. (This is where the real gamble begins. I don't have a real strategy, per se... ...so all I can do for now is let the chips fall where they may.)\nFranziska: Using guesswork and taking risks in place of real logic is hardly the Von Karma way. It's neither smart nor very clever.\nEdgeworth: Ms. von Karma, as you know, unlike your father, I am not a genius prosecutor. Plus, I doubt his record of a 40-year win streak will ever be broken.\nFranziska: ..................\nEdgeworth: But perhaps, it is for the best if it remains unbroken. For no one should've conceived of the notion to \"convict all defendants\" in the first place!\nFranziska:\nFranziska: What a foolishly foolish statement from a foolish fool who hates to lose... It's the job of a prosecutor to make sure that all defendants are found guilty in court. There is nothing more important in this world than a perfect victory!\nEdgeworth:\nEdgeworth: That may be your opinion, however, I don't believe that's all we are.\nLang: .........!\nEdgeworth: As a prosecutor, what I pursue is not the perfect victory, but the perfect truth. And if that means that the bridge I must cross will crumble beneath my feet... ...then let it crumble as I walk on towards the truth!\nLang:\nLang: You're good at keeping me entertained, Mr. Prosecutor! But you know... humans are delicate creatures. The slightest bump and we expire. I'd like you to consider, if you will, the possibility that... ...the sword was used in such a way that the attack killed DeMasque II without bending it.\nEdgeworth: ..................\nLang: So, what do you think of my hypothetical scenario? I think you know what to do here, right? And what you need!\nEdgeworth: Of course. (What I need is evidence even he (changed from [Agent Lang] in the original release) can't refute! This is it! It's time to bring this to a close!)\nLang: It's possible to use the Samurai Sword to kill someone. And under these circumstances, it's the only logical conclusion. We searched the Embassy, top to bottom, but the victim's blood is only on that weapon. So isn't it only natural that suspicion would fall onto the owner of said weapon?\nEdgeworth: How long do you intend to cling onto that preposterous theory?\nLang: As long as I want, because we examined every corner within the walls of this Embassy. There's no stone we've left unturned! And we have managed to come up with only one logical conclusion! That the only place inside this embassy with the victim's blood on it is this sword.\nEdgeworth:\nEdgeworth: You left no stone unturned? Is that a fact?\nLang:\nLang: If you've got something to say, then say it in the only way I respect, Mr. Prosecutor!\nEdgeworth: Yes, of course. In that case, allow me to make it all crystal clear for you!\nLang: It's possible to use the Samurai Sword to kill someone.\nLang: And under these circumstances, it's the only logical conclusion.\nLang: We searched the Embassy, top to bottom, but the victim's blood is only on that weapon.\nLang: So isn't it only natural that suspicion would fall onto the owner of said weapon?\nEdgeworth: ...I can prove to you... the possibility that the murder weapon is something else... ...but I cannot do so on my strength alone.\nFranziska:\nFranziska: Miles Edgeworth. What are you running straight into a quagmire for? I thought you said that you were busy in pursuit of the perfect truth. And if that's the case, then show me this perfect truth, if it exists at all!\nEdgeworth: Don't worry. Thanks to you, I've already prepared myself to do just that.\nFranziska: There's no need to thank me. I'm simply doing what any good superior would.\nEdgeworth: Heh... I suppose you are. Very well, then. I will show you the possibility of a different murder weapon.\nEdgeworth: If you believe that there is no other door of possibility left to open... ...then allow me to force one open for you!\nLang:\nLang: Hmph! And how do you plan to do that?\nEdgeworth: By showing you what may possibly be the real murder weapon.\nLang:\nLang: Ha! Ha ha ha ha! The \"real\" murder weapon? I hate to repeat myself... ...but my men have already searched every last inch of this embassy! And they've concluded that nothing else could've been used as the weapon! Knowing these facts, do you still want to press forward with your little hypothesis?\nEdgeworth: Of course. Because it's not possible that your men inspected everything in their investigation.\nLang:\nLang: What are you talking about!? I don't appreciate mind games, and I don't appreciate it when people like you slander my men!\nEdgeworth:\nEdgeworth: I'm not slandering them, I assure you! I'm merely pointing out that their investigative dragnet has a few holes in it! Namely, that there is something your men couldn't even lay a finger on. And that item is the real murder weapon!\nLang: Aaaaaaaalright then! I'll play along for now! This \"real\" weapon that killed DeMasque II... What exactly is it!?\nEdgeworth: The real murder weapon, which not a single person has yet to touch, is this!\nEdgeworth: .........The national treasure of Allebahst.\nLang:\nLang: You mean the Primidux Statue?\nEdgeworth: Yes, and as you know, only the ambassador and his secretariat may touch it. Which, I believe, means that neither you nor your men were able to examine it, correct?\nLang:\nLang: Ha... ha ha ha ha... You know very well that if we did that, there'd be an international incident... ...between the Kingdom of Allebahst and the Republic of Babahl. The two countries' precarious relationship teeters in the balance... ...over a stupid fight related to a sovereignty statue! But I'll be damned if I let something go unexamined!\nEdgeworth:\nEdgeworth: Agent Lang, if you could take a look at this... The direction the statue is facing just before and after the crime are different...! And there is only one conclusion I can draw from that.\nLang: .................. Go look for Ambassador Alba, and get him to give us the OK to examine the statue.\nMIB: Shifu! You can't listen to this infidel's words! He is most definitely trying to trick you! Shifu! Please, let's be rational about this!\nLang: Grr! Lang Zi says: .........Just go already!\nMIB: Y-Yes, sir!\nMIB: Shifu...\nLang: Yeah?\nMIB: I'm really sorry, sir, but I was unable to convince the ambassador. I was unable to obtain permission for us to examine the Primidux Statue.\nLang: ...Hmph. I see.\nFranziska: Wait...! But then, the investigation is at a standstill! Agent Lang! I will go and speak with the ambassador personally!\nLang: Save your breath. He may act all weak and frail, but that old man's one tough cookie. But I guess you've gotta be tough when you're representing a whole country, you know?\nEdgeworth: Agent Lang...\nLang: What do you want? Let's just hurry up and examine the statue already.\nMIB: Wh--!? But Shifu! What about causing an international incident!?\nLang: Quiet! I'll take the fall if I have to later!\nEdgeworth:\nEdgeworth: Agent Lang, the hypothesis is mine, so if someone is to take the responsibility, let it be me!\nLang: Responsibility? If we're going to talk in such heavy terms, maybe I should let you. It'd be a real problem for my men if something were to happen to me. Alright then... Less talk and more investigating!\nEdgeworth: (If we want to know the truth, we can't stop here! Action must be taken!) Agent Lang, I'd like to run a Luminol chemiluminescence test on the statue.\nLang: A Luminol test...? Ah, good thinking. If the statue is the murder weapon, then some of the victim's blood should be on it. Okaaaaaaaaaaaaaay! Let's get the forensics team in here!\nLang: Heh! Looks like you hit the jackpot, Mr. Prosecutor. I guess this means that this is the real weapon that killed DeMasque II.\nEdgeworth: Indeed...!\nLang: But I wouldn't celebrate yet if I were you. This doesn't let your friend off the hook. It doesn't prove that he didn't kill DeMasque II, so the charge remains!\nEdgeworth: ...We are hardly done examining this statue, Agent Lang! Knowing that it IS the real weapon, I believe further examination is required.\nLang: Hah, you think so? OK then, knock yourself out!\nLeads to examination of Allebahst's Primidux Statue\nEdgeworth: ...Nngh.\nLang: And what do we have here? This dirty smudge... It looks like... a handprint? Heh heh heh heh... Haaa hahahahahahaha! What's a definitive bit of evidence like you doing under here!? Looks like we've got some fingerprints to analyze!\nEdgeworth: Gnrk! (Worst case scenario, these prints belong to Larry... But it looks like it's too late for me to do anything about that now...!)\nLang: Hey! Forensics guy! I want results on these fingerprints ASAP, you hear me!?\nForensics: Agent Lang! I have the analysis results, sir!\nLang: Good! And!?\nForensics: Sir! About the prints we lifted from the bottom of the statue... Well, um... You know the victim of the murder in the Babahlese Embassy...? The prints belong to him, to Mr. Manny Coachen, sir!\nLang: But that's--! Wh-What's going on around here!?\nEdgeworth: No... That's... impossible! (Each Primidux Statue can only be handled by someone of that country. But by the very fact that Mr. Coachen's fingerprints are on this one... ...it leads me to only one conclusion...!) This statue... is actually Babahl's Primidux Statue!\nFranziska: Impossible! It can't be...!\nLang: A...! Aaaaaaaaaaiiiiiiiiiiya!\nEdgeworth: (Larry never once set foot on Babahlese soil, so he was free to go... However... this new piece of information only served to confuse us even further. The ringleader of a smuggling operation was killed with an Allebahstian knife in Babahl... ...and DeMasque II was killed on Allebahstian soil with Babahl's national treasure... ...and the mystery of the Great Thief Yatagarasu, who visited both countries. The pieces were there, but I had yet to see the big picture they were to form.)\nTo be continued\n\n",
  "characters": [
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Kay Faraday"
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Byrne Faraday"
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Calisto Yew"
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Dick Gumshoe"
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Shih-na"
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Franziska von Karma"
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Colias Palaeno"
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Manny Coachen"
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Shi-Long Lang"
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Quercus Alba"
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Larry Butz"
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Tyrell Badd"
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Mask☆DeMasque II"
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Ex-Security Lady"
    }
  ],
  "evidences": [
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Prosecutor's Badge",
      "description1": "Proof of my profession. However, I prefer to keep it in my pocket."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Embassy Guide",
      "description1": "Two countries share this building with borders."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Steel Samurai's Autograph",
      "description1": "Autograph with a sketch of his face and weapon."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Notes on Coachen's Body",
      "description1": "COD: single stab to base of neck. The body wasn't badly burnt by the fire."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Yatagarasu's Key",
      "description1": "The Yatagarasu stole this from this embassy 7 years ago. It is also a knife."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Knife → Babahlese Knife → Allebahstian Knife",
      "description1": "Covered in victim's blood, the blade matches the wound. Butterfly motif is noteworthy.",
      "description2": "1 of a set of 3 ornamental knives. Covered in victim's blood, blade same as wound.",
      "description3": "The blade is definitely Allebahstian. Was this carried across country lines?",
      "description4": "Blade determined to be Allebahstian. The flower motif's petals are separate."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Babahl's Primidux Statue",
      "description1": "Both countries claim to own real one. Nat. treasure. Only Amb. and Secret. can touch.",
      "description2": "It was a fake, but was swapped with the real one. Is originally from Allebahst."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Cohdopian Paper Document",
      "description1": "Accounting doc related to smuggling. Proof someone in 1 of the countries is ringleader.",
      "description2": "Doc related to smuggling of Babahlese ink. It appears to point to Mr. Coachen."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Babahlese Knife Handle",
      "description1": "Swapped with the real murder weapon's handle, its blade has yet to be found."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Counterfeit Bills",
      "description1": "Made with Babahlese ink, they are in circulation in Zheng Fa. It's hard to tell they're fake.",
      "description2": "Bills circulating in Zheng Fa. Made by Coachen. They were all burned up in Babahl."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Babahlese Ink",
      "description1": "Special whitcrystal oil-based ink. Limited export because of some specific reason.",
      "description2": "Special whitcrystal oil-based ink. Limited export because of its use in counterfeiting."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "DeMasque II's Note",
      "description1": "Request for the theft of the Primidux Statue with a map to where the statue is.",
      "description2": "Request to steal the Primidux Statue. Same shape as notepad in Babahl office.",
      "description3": "Request to steal the Primidux Statue. Handwriting matches that of Manny Coachen."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Samurai Sword",
      "description1": "Weapon that's used on stage. Is thought to be what killed DeMasque II."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Photo with Steel Samurai",
      "description1": "Taken in front of Allebahst's Statue before murder."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Passionflowers",
      "description1": "Two large flowers in bloom. The vines are supported by stakes and are still growing.",
      "description2": "Two large flowers in bloom. Ambassador Alba takes great care in growing them."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Samurai Spear",
      "description1": "Weapon that's used on stage. Larry hit it against a wall and bent it. It's hollow.",
      "description2": "Because he bent it, Larry couldn't do the \"Early Summer Rain Jab!\" special attack."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Allebahst's Primidux Statue",
      "description1": "Both countries claim to own real one. Nat. treasure. Only Amb. and Secret. can touch.",
      "description2": "Both countries claim to own real one. Nat. treasure. Signs it was moved during murder.",
      "description3": "Bloodstained weapon used to kill DeMasque. Originally from Babahl's secretariat's office.",
      "description4": "Used to be real, but has been swapped with a fake from Babahl. Was used as a weapon."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Stand-In Request",
      "description1": "Request for Ms. Oldbag to stand in for Mindy, the Pink Princess actress who fell ill."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Letter from a Stalker",
      "description1": "For Ms. Oldbag. Has mistakes from bad penmanship."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Lady's Undershirt",
      "description1": "Found in office fireplace. There's only 1 person here who would own such a shirt.",
      "description2": "Found in office fireplace. Ms. Oldbag was drying it in the fireplace next door."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Samurai Dogs",
      "description1": "Present for embassy staff. Ms. Oldbag took and ate a few from the dressing room."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Silhouette Lantern",
      "description1": "Runs on whitcrystal oil, which burns green. It's a Babahlese souvenir."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Pick",
      "description1": "Found at the Open-Air Stage, it looks like a guitar pick. It's also wet for some reason."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Ms. Yew's Perfume",
      "description1": "This was left behind by Calisto Yew 7 years ago. Kay has been safe-guarding it."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Fountain Spouts",
      "description1": "Part of the Rose Garden pool. Auto-refills the water when the water level is too low."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Photo of Yatagarasu",
      "description1": "Taken from a building nearby at the moment of border crossing during the fire.",
      "description2": "Photo taken after the first fire on the 4th and 5th floors had taken place."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Fires in Babahl",
      "description1": "Two fires broke out in Babahl today."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Amb. Palaeno's Testimony",
      "description1": "Spilled Babahlese ink onto back wall while burning files in fireplace. Left ashes there."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Wire",
      "description1": "A good length of wire that was found wound up inside Babahl's grandfather clock."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Revolving Fireplace Wall",
      "description1": "There are signs that the revolving fireplace wall on Babahl's side has been used."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Hair Sticks → Crossbow Arrows",
      "description1": "Hair sticks with a candy stripe pattern on them. There is some dirt on the tips.",
      "description2": "Thought to be hair sticks, they're passionflower support stakes from Allebahst office.",
      "description3": "Neither hair sticks nor support stakes, they're actually crossbow arrows."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Trump Card",
      "description1": "Evidence from KG-8. Card containing orders from boss of smuggling ring to Coachen."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Video Tape",
      "description1": "Evidence from KG-8. Faraday had obtained it once, but Ernest Amano had it stolen.",
      "description2": "Evidence from KG-8. Footage showing Coachen entering the KG-8 Incident's crime scene."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Counterfeit Plate",
      "description1": "This was found from within the fake Primidux Statue Alba smuggled into his country."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Amb. Alba's Wound",
      "description1": "Mr. Alba claims it's proof he was stabbed by DeMasque II, so it was justified defence."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Commemorative Photo",
      "description1": "Taken at Theatrum Neutralis. The murder weapon can be seen in Mr. Alba's bouquet."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Security Footage",
      "description1": "Footage of the entranceways into Babahl and Allebahst from the Theatrum Neutralis."
    },
    {
      "currentChapter": "Turnabout Ablaze",
      "name": "Pushcart",
      "description1": "Steel Samural pushed this to Allebahst from the dressing room. The bulge is unnatural.",
      "description2": "Steel Samurai pushed this to Allebahst from the dressing room. There is blood inside."
    }
  ],
  "turns": [
    {
      "category": "rebuttal",
      "newContext": "Turnabout Ablaze\n\n\n\n\n\n\n\n\n\nTranscript\nPart 1\n\nPart 2\n\nPart 3\nMarch 14, 9:21 PM\nOpen-Air Stage\nEdgeworth:\n(I've left the DeMasque II investigation to Franziska and returned to Babahl. I suppose my first order of business should be to look into Babahl's statue...)\nKay:\nMr. Edgewoooorth!\nEdgeworth:\nSo, Kay, what's the situation?\nKay:\nOh, it's great! Investigating is so much fun!\nEdgeworth:\n(...In other words, they've made absolutely no progress.)\nGumshoe:\nW-We weren't goofing off! Honest, sir! We've been investigating our hearts out!\nEdgeworth:\nVery well, then. Would you care to give me an update on your investigation?\nGumshoe:\n...Ummmmm... Oh! We've had a really fun time, sir!\nEdgeworth:\n(I knew it. Zero progress...) In any case, Detective Gumshoe...\nGumshoe:\nYes, sir?\nEdgeworth:\nYou have permission to enter the Allebahstian Embassy, is that correct?\nGumshoe:\nYup! As a local detective, I'm helping out with investigations on both sides, sir!\nEdgeworth:\nGood. In that case, I can leave these... pieces of evidence with you. They belong to the lady under the Pink Princess's mask.\nGumshoe:\nThe Pink Princess? What kind of lady was playing her, sir?\nEdgeworth:\nThe kind that was also playing the role of the Pink Badger yesterday.\nGumshoe:\nUgh! Ooonnngh... Understood, sir... If I happen to run into her, I'll give them back to her. And if I don't... then I guess I'll unload them somewhere...\nEdgeworth:\n(He doesn't seem all that enthused to go find her, but I can't blame him.)\nEvidence that has lost their value given to Detective Gumshoe.\nEdgeworth:\nNow then, I don't believe I'll be needing this anymore either.\nKay:\nWhaaaat!? Are you really going to throw that autograph away!?\nEdgeworth:\nYes, because that Steel Samurai was a fake.\nSteel Samurai's Autograph scrunched up into a ball and disposed of.\nKay:\nWait, what? What do you mean by \"fake\"?\nEdgeworth:\n(Now then, I believe it's time for a little housekeeping.)\nUnnecessary evidence has been removed. Remaining evidence has been re-arranged.\nApproach road to Theatrum Neutralis\n\n\n\n\n\n\n\nKay:\nHey, you're not going back to Allebahst already, are you?\nEdgeworth:\nNo, not yet. I still need to gather a bit more information first.\nApproach door to Babahlese Embassy\n\n\n\n\n\n\n\nKay:\nThey're having a real time of it cleaning up after the fire.\nEdgeworth:\nHmm... I suppose we should stay out here and investigate the stage some more then.\nTalk\n\n\n\n\n\n\n\n\n\nDick Gumshoe\n\n\n\n\n\n\n\nGumshoe:\nMr. Edgeworth!\nEdgeworth:\nYou look like you're enjoying yourself, Detective.\nGumshoe:\nWell, I don't have much else that I enjoy as much as a good investigation, sir!\nEdgeworth:\nSo... what did you find out?\nGumshoe:\nAh, well... Ha ha ha ha ha. Ha ha ha ha ha.........\nEdgeworth:\n(I take it he has found nothing of any particular use... as usual.)\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nInvestigation update\n\n\n\n\n\n\n\nGumshoe:\nHey, Mr. Edgeworth! I got something really interesting from Ambassador Palaeno!\nEdgeworth:\nOh? And what is the something \"interesting\"?\nGumshoe:\nThis, sir.\nKay:\nWow, that's so pretty! I'm so jealous! That's a real treasure here!\nEdgeworth:\nWhy does the flame burn green, Detective?\nGumshoe:\nSo apparently, if you burn the special \"whitcrystal oil\" that they only make in Babahl... ...it burns this green color, sir.\nEdgeworth:\nInteresting. So it's a special property of the oil. (I suppose this is a ploy to force people to visit Babahl should the oil run out...)\nKay:\nHey, Gummy! What about these silhouettes?\nGumshoe:\nThey stuck some cutouts on the outside of the lantern so it'd project the images.\nEdgeworth:\nOh...? Silhouettes, huh? They are rather pretty, aren't they? ......... (Wait, what am I doing? I was supposed to be asking for an update on the investigation.)\nGumshoe:\nHey, what's wrong, sir?\nEdgeworth:\nThere's something I want you to investigate for me. Do you think you can do that much?\nGumshoe:\n...Uh-huh... You got it, sir!\nKay:\nHey, that's not fair! Why is Gummy getting to do all the fun stuff!?\nGumshoe:\nAh, well, that's because I'M Mr. Edgeworth's partner.\nKay:\nAh! I can't believe you took advantage of the confusion and stole my role as assistant!\nEdgeworth:\nI expect the two of you to get along and work together like professionals on this.\nSilhouette Lantern data jotted down in my Organizer.\n\n\n\n\nInvestigation update (subsequent times)\n\n\n\n\n\n\n\nGumshoe:\nHey, Mr. Edgeworth! I got something really interesting from Ambassador Palaeno!\nEdgeworth:\nOh? And what is the something \"interesting\"?\nGumshoe:\nThis, sir.\nKay:\nWow, that's so pretty! I'm so jealous! That's a real treasure here!\nEdgeworth:\nWhy does the flame burn green, Detective?\nGumshoe:\nSo apparently, if you burn the special \"whitcrystal oil\" that they only make in Babahl... ...it burns this green color, sir.\nEdgeworth:\nInteresting. So it's a special property of the oil. (I suppose this is a ploy to force people to visit Babahl should the oil run out...)\nKay:\nHey, Gummy! What about these silhouettes?\nGumshoe:\nThey stuck some cutouts on the outside of the lantern so it'd project the images.\nEdgeworth:\nOh...? Silhouettes, huh? They are rather pretty, aren't they? ......... (Wait, what am I doing? I was supposed to be asking for an update on the investigation.)\nGumshoe:\nHey, what's wrong, sir?\nEdgeworth:\nThere's something I want you to investigate for me. Do you think you can do that much?\nGumshoe:\n...Uh-huh... You got it, sir!\nKay:\nHey, that's not fair! Why is Gummy getting to do all the fun stuff!?\nGumshoe:\nAh, well, that's because I'M Mr. Edgeworth's partner.\nKay:\nAh! I can't believe you took advantage of the confusion and stole my role as assistant!\nEdgeworth:\nI expect the two of you to get along and work together like professionals on this.\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nProsecutor's Badge\n\n\n\n\n\n\n\nGumshoe:\nHey, it's your Prosecutor's Badge! This thing's really important, right? So what would happen if you lost it, sir?\nEdgeworth:\nWhy are you asking me such an ominous question?\nGumshoe:\nWell, because I've lost my police badge before, sir! I just wanted to tell you to be careful, sir! Because writing the explanation section on those requisition forms is really annoying!\nEdgeworth:\n(I believe SOMEONE needs to take his own advice a bit more...)\n\n\n\n\nSamurai Dogs\n\n\n\n\n\n\n\nGumshoe:\nWow, those look really good, sir! Can I have one!?\nEdgeworth:\nDon't you dare line your stomach with the evidence! (Come to think of it... ...the dog Detective Gumshoe takes care of just up and ate a Samurai Dog earlier as well. Poor little dog, slowly coming to resemble his handler...)\n\n\n\n\nSilhouette Lantern\n\n\n\n\n\n\n\nGumshoe:\nThat's a souvenir from Babahl; it's a silhouette lantern.\nEdgeworth:\nBy the by, how much is it?\nGumshoe:\nIt was really expensive, sir! About as expensive as my coat!\nEdgeworth:\nOh? I see. So it's about the average price of a cheap souvenir.\nGumshoe:\nOuch, sir!\n\n\n\n\n\n\nColias Palaeno\n\n\n\n\n\n\n\nPalaeno:\nAh, so you're back now, are you, Mr. Edgeworth? You must be tired. Here, with these, you can eat whatever you'd like.\nEdgeworth:\nAnd these are...?\nPalaeno:\nDiscount tickets for our cafeteria! They open tomorrow at 10 in the morning.\nEdgeworth:\n...I appreciate the concern, however, these coupons do nothing for me right now.\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nOpen-air stage\n\n\n\n\n\n\n\nEdgeworth:\nThis open-air stage... What function does it serve exactly?\nPalaeno:\nWell, normally, we use it for a variety of events. It's all to attract that extra bit of attention to Babahl. I heard that tonight, over in the Allebahst rose garden... ...Ambassador Alba was to give a speech. And you know what? Manny told me that I really should give a speech, too.\nEdgeworth:\nMr. Coachen told you that?\nPalaeno:\nYes, he did. Which is why I thought I should give a speech of my own. But, unfortunately, I wasn't able to.\nEdgeworth:\nBecause of the fire the Yatagarasu started?\nPalaeno:\nExactly.\n\n\n\n\nManny Coachen (appears after \"Open-air stage\")\n\n\n\n\n\n\n\nEdgeworth:\nAmbassador Palaeno, there's just one thing I'd like to ask you about.\nPalaeno:\nYes? Oh, and don't worry. You can ask me more than just one thing! How about two or three? In exchange, I expect you'll be coming to Babahl, yes?\nEdgeworth:\nTh-Thank you, but just the one thing is all I require. Manny Coachen... I'd like to ask you about this man who was your secretary.\nPalaeno:\n! S-Sure. I'll tell you what I know.\nEdgeworth:\nThank you for your cooperation, Ambassador.\nPalaeno:\nHe was... well... If I had to put it in one word, he was an able man. If there was ever anything I needed as an ambassador, he was able to get it for me. To think that a man like that... ...had a hand in a smuggling ring right under my nose, going completely unnoticed... Actually, I suppose because he was an able man, I was unable to detect his dirty dealings.\nEdgeworth:\n(Hmm... It sounds like Mr. Coachen had a very sharp mind.)\nPalaeno:\nRecently, Manny had been really busy. Since I became the Babahlese representative at the Country Unification Council... ...he's been working tirelessly to cover my work for me.\nEdgeworth:\nI'm sorry, but what is this \"Country Unification Council\"?\nPalaeno:\n...Oh, well you see, had tonight's events proceeded without a hitch... ...our two countries were to re-unify and become one again. But I guess with how things turned out, that dream won't be realized any time soon.\nEdgeworth:\nHmm... I suppose not.\n\n\n\n\nPrimidux Statue\n\n\n\n\n\n\n\nEdgeworth:\nAmbassador Palaeno, I'd like to ask you a little more about the Primidux Statues.\nPalaeno:\nOh, I see! Well, let me ask you this! Did you know that Allebahst and Babahl used to be one country called Cohdopia?\nEdgeworth:\nYes, I know that much about your history.\nPalaeno:\nWell, the Primidux Statue belonged to the founders of Cohdopia. ...At least, that's how the story goes. It was bequeathed unto the king of Cohdopia as a symbol of the country's wealth.\nEdgeworth:\nSo it was meant as a symbol of sovereignty, and the right to rule, I take it...?\nPalaeno:\nYes, that's right! Which is why both countries are so adamant about their claim. \"We hold the real statue, therefore, we hold the right to rule\" is the reasoning. It's pretty petty when you think about it though, I suppose.\nEdgeworth:\nBut if Allebahst and Babahl were to re-establish relations... ...shouldn't that put an end to the squabbling over the statue?\nPalaeno:\n...I have no reason to believe so. The Primidux Statue is even more important now as a key to diplomacy.\nEdgeworth:\n(I wonder if Ambassador Palaeno knows... ...about what has happened to the very important \"key to diplomacy\". Perhaps I should try showing him this \"key\" and see what he has to say about it.)\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nBabahl's Primidux Statue or Allebahst's Primidux Statue\n\n\n\n\n\n\n\nEdgeworth:\nAmbassador Palaeno, if you could please take a look at this for me.\nPalaeno:\n..................\nEdgeworth:\nThe Primidux Statue sitting in Allebahst right now actually belongs to Babahl.\nPalaeno:\n...So it would appear. I received a call from Ms. von Karma about this earlier.\nEdgeworth:\nThen you will understand why I wish to inspect Babahl's Primidux Statue immediately... ...because the statue currently in your country's possession...\nPalaeno:\nYes, well, I've already inspected it myself. And it is definitely Allebahst's statue. I know because... it's the real statue.\nEdgeworth:\n...Then you're saying that Babahl's was a replica?\nPalaeno:\nI'm embarrassed to say it's true, even though I knew that someday it would be exposed. I received my orders from the leaders of Babahl... ...and I was to negotiate with Ambassador Alba at this event. I was to negotiate with him and fix the results of the evaluation tonight... ...to say that we could not determine which statue was the real one.\nEdgeworth:\n\nEdgeworth:\nWhy are you telling me this?\nPalaeno:\nWell, because you already figured it out. Our statue is just a hollow gold shell. Even if Babahl were to lose face, the re-unification of the country is what's important. I'm right in thinking that, aren't I? I'm not making a mistake, right?\nEdgeworth:\nIf you don't know yourself, then I won't pretend to know either.\nPalaeno:\nI never thought that by being betrayed by my own secretary... ...the real symbol of wealth would be given to me. Isn't it simply ironic?\n\n\n\n\nAllebahstian Knife\n\n\n\n\n\n\n\nPalaeno:\nOh, dear... If people were to find out that a murder occurred at our embassy... ...the number of tourists would plummet, as would our revenues! It'd be a disaster! What are we going to do...?\nEdgeworth:\n(He really does seem worried. Perhaps I should refrain from bringing this up...)\n\n\n\n\nYatagarasu's Key\n\n\n\n\n\n\n\nPalaeno:\nSo this key can become a knife? That's some trick!\nEdgeworth:\nThis key was originally stolen from your embassy seven years ago...\nPalaeno:\nYes, yes... My, this is fascinating.\nEdgeworth:\n...Are you listening to me at all, Ambassador?\nPalaeno:\nWow, this is really, very fascinating!\nEdgeworth:\n(He's so absorbed in playing with the key that my voice is failing to reach him...)\n\n\n\n\nCounterfeit Bills\n\n\n\n\n\n\n\nPalaeno:\nI can't believe that Babahlese ink was being used in such an evil scheme... And if people were to find out, that would really tarnish the global image of Babahl. Ah, this is really bad. Really, really bad. Ooh, Babahl's in a bind now... *sigh*\nEdgeworth:\n......... (It is just me or do his words not match his facial expressions?)\n\n\n\n\nBabahlese Ink or Silhouette Lantern\n\n\n\n\n\n\n\nPalaeno:\nBabahlese ink consists mostly of whitcrystal oil. When lit, the oil in the ink burns a bright yellow-green. It makes for a great science experiment. Here, give it a try with this!\nEdgeworth:\nYes, well, I understand your enthusiasm, but, the amount you gave me earlier is enough.\nPalaeno:\nI see... That's too bad. In that case, why don't you have a few more of these coupons? I've got plenty!\nEdgeworth:\nI-I have plenty of those, too! (Where is he conjuring those from?)\nExamine\n\n\n\n\n\n\n\n\n\nBush on left side\n\n\n\n\n\n\n\nKay:\nHey, do you detect the scent of treasure coming from this bush?\nEdgeworth:\nThe scent of treasure? Not at all.\nKay:\nArgh! Mr. Edgeworth, you're totally not with it!\nEdgeworth:\nI'm not \"with it\"...?\nKay:\nNo! And it's important for both thieves and prosecutors to be energetic!\nEdgeworth:\nPerhaps for a thief like you, but that level of energy is unbecoming of a prosecutor.\nKay:\nYou really think so? That prosecutor we met at Gatewater Land seemed to be pretty active.\nEdgeworth:\nWell, he's not a prosecutor anymore. See how everything just naturally balances out?\n\n\n\n\n(Step)ladder\n\n\n\n\n\n\n\nEdgeworth:\nHmm... A ladder.\nKay:\nActually, that's a step-ladder.\nEdgeworth:\nThey're the exact same thing.\nKay:\nNo way! From their structure up, they're totally different! But of course, from a thief's perspective, the best kind of ladder is the rope-ladder. A step-ladder is much too heavy to carry around, after all.\nEdgeworth:\n(And from a prosecutor's perspective, any type of ladder is guilty... ...of being dangerous during an earthquake.)\n\n\n\n\nCement bags\n\n\n\n\n\n\n\nEdgeworth:\nBags full of cement powder are stacked up here. I suppose they're for the renovation.\nKay:\nYeah, because I don't smell a drop of gold here, or any other treasure for that matter.\nEdgeworth:\nKay, the only scent you should detect in a place like this is the smell of sweat.\nGumshoe:\nHey, Mr. Edgeworth! That was a pretty good play on words there!\nKay:\nAck! Gummy! Don't randomly jump into one of our dialogues like that!\nEdgeworth:\nWere you eavesdropping on us, Detective Gumshoe...?\nGumshoe:\nNo, it's not like that, sir...\n\n\n\n\nStage\n\n\n\n\n\n\n\nEdgeworth:\nIt would appear that the stage is also scheduled to be renovated.\nKay:\nYou know, I would love to perform on a stage like this. Something like \"The Greatest Great Thief Show\"!\nEdgeworth:\n(I should think it would be a bad idea for a thief to show their face to the world...)\n\n\n\n\nTraffic cone\n\n\n\n\n\n\n\nKay:\nSo how come so many traffic cones are red and white?\nEdgeworth:\nThat's because they're highly visible from a great distance.\nKay:\nOh, is that why!? So then, the reason you wear that wine-red suit is for visibility [sic] sake...?\nEdgeworth:\nPlease don't compare me to a ragged, plastic traffic cone!\n\n\n\n\nSafety sign\n\n\n\n\n\n\n\nEdgeworth:\nThere is a sign here warning passers-by to take precautions around this renovation site.\nKay:\nThey're really going all out, huh? There's construction going on everywhere.\nEdgeworth:\nI believe Ambassador Palaeno said it was to attract more tourists and visitors.\nKay:\nBut what can they do with the new stuff they're building? Hey, what do you think they should do, Mr. Edgeworth?\nEdgeworth:\n...How about transforming it into a courthouse?\nKay:\nHey, be serious!\nEdgeworth:\n(...But I was being serious.)\n\n\n\n\nBush on right side\n\n\n\n\n\n\n\nKay:\nThis bush looks like the perfect place to hide some sort of treasure, you know?\nPalaeno:\nAh, but there is no treasure inside those things...\nKay:\nOh... Too bad.\nPalaeno:\nBut we do have a lot of treasures back in Babahl.\nKay:\nSounds great! I'll be sure to pay you guys a visit sometime for a five-finger discount!\nPalaeno:\nSure, sure. We welcome you anytime.\nEdgeworth:\n(Are you sure you really want to invite a thief into your country with open arms?)\n\n\n\n\nScaffolds\n\n\n\n\n\n\n\nKay:\nJust looking at these scaffolds makes me want to climb them!\nEdgeworth:\nI recommend that you do not try. There was a fire burning here until not too long ago.\nKay:\nYeah, but I think enough time has passed, so it should be alright! Thief Child says: \"If there is a height to be scaled, then scale it you must.\"\nEdgeworth:\nStarting from \"Thief Child\", would you care to explain what you just said?\nPartner\n\n\n\n\n\n\n\nKay:\nYes?\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nAbout investigating\n\n\n\n\n\n\n\nEdgeworth:\nHow is the investigation going in the Babahlese secretariat's office, Kay?\nKay:\nHmm... Well, even though we found a few treasures, they've all been pretty much burnt to a crisp. A treasure is a terrible thing to waste.\nEdgeworth:\nA-Anyway, is there anything else I should know about?\nKay:\nUmm... Oh! That's right! You know what I found in that office? A wooden bear carving! It's sooooo cute! Can I have it? Huh? Can I?\nEdgeworth:\nNo, of course you can't! (By the sound of things, it appears that there has been no progress in the investigation.)\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nProsecutor's Badge\n\n\n\n\n\n\n\nKay:\nOh! This is a Prosecutor's Badge! This proves that you're a real prosecutor, right, Mr. Edgeworth!?\nEdgeworth:\nHeh... Precisely.\nKay:\nWell, I've got one too! Mine's the Yatagarasu's Badge!\nEdgeworth:\nBut if you walk around with that on your scarf all the time... ...all you're doing is proclaiming to the world that you're a thief.\nKay:\nLike I said! The Yatagarasu is noble! And because I'm full of righteousness, there's no need for me to be all sneaky!\nEdgeworth:\n(Even if you are honorable, a thief is a thief... right?)\n\n\n\n\nEmbassy Guide\n\n\n\n\n\n\n\nKay:\nThere are two embassies in this one building, huh?\nEdgeworth:\nWell, they used to be a single country so it's understandable.\nKay:\nSo with them trying to make up, does it mean that they'll become a single country again? If they do, I hope they'll always be good friends, and never fight again.\nEdgeworth:\nBefore that can happen, I believe we need to solve this case. Otherwise, nothing will come of these gestures, not even friendship.\n\n\n\n\nYatagarasu's Key\n\n\n\n\n\n\n\nKay:\nThis is...\nEdgeworth:\nYour father, Byrne Faraday... He had planned to use this as evidence in that trial seven years ago.\nKay:\nBut he was killed by it when it was turned into a weapon, huh...?\nEdgeworth:\n(Curses...! I shouldn't have made her recall such a tragic event... How could I have been so careless!?)\n\n\n\n\nCounterfeit Bills\n\n\n\n\n\n\n\nKay:\nSo I guess these counterfeits were made with Babahlese ink. Come to think of it, I remember hearing on the news the other day... ...that the Republic of Zheng Fa, where these bills are coming from, is in an economic mess.\nEdgeworth:\nIt's common knowledge that money rules the hearts of men. And when that money turns out to be fake, all-encompassing confusion is the result.\nKay:\nHah! And that's when the Yatagarasu makes her stand! I'm going to use my Iron Fists of Justice on each and every counterfeiter! You'll see!\nEdgeworth:\n...I appreciate your sense of justice, however... ...I would appreciate it if you wouldn't go running into the heart of any more raging fires.\nKay:\nNngh... Yes, Mr. Edgeworth... I'll try...\n\n\n\n\nSamurai Dogs\n\n\n\n\n\n\n\nKay:\nIt's a box of Samurai Dogs, right? Ah, but see, I'm a Jammin' Ninja fan! So, while I would love to have one... I'm going to be strong and resist the urge!\nEdgeworth:\nWell then, how about we slowly enjoy them after we crack this case?\nKay:\nOK, fine, you twisted my arm! Let's indulge!\n\n\n\n\nAnything else\n\n\n\n\n\n\n\nEdgeworth:\nKay, about this piece of evidence...\nKay:\nHuh!? May I... really have it? Hmm... But you know, as the Yatagarasu, it'd be bad if I couldn't get this by myself!\nEdgeworth:\nSorry, but I have no intention of giving you this piece of evidence.\nKay:\nOh, really? I guess I misunderstood!\nEdgeworth:\n(I feel like I've had a very similar conversation with someone else before...)\nAfter clearing Talk option with Dick Gumshoe and presenting Babahl's Primidux Statue or Allebahst's Primidux Statue to Colias Palaeno:\nKay:\nHey, where are you going? Are you heading back to Allebahst?\nEdgeworth:\nYes, but before I do, I suppose I should give you a summary of what's happened.\nKay:\n...Oh, I see. So there's been a murder in both countries using an object from the other country...?\nEdgeworth:\nThat's the gist of it. Babahl is just as strict as Allebahst... ...in their inspection of the people and things that enter their country. Meaning that somehow, both murder weapons were smuggled into the two countries. That's the only logical conclusion that can be drawn. Perhaps the key to the weapon smuggling is the person who traversed both countries...\nKay:\nYou mean the fake Yatagarasu!?\nEdgeworth:\nIn one way or another, the Yatagarasu is connected... Of this I am sure! Now then, where was the Yatagarasu first spotted?\nPalaeno:\nI believe it was the rose garden on the Allebahstian side of the embassy. The garden is just on the other side of this boundary. It's where Ambassador Alba was to give a speech tonight. At least, that's where I heard the Yatagarasu had appeared.\nEdgeworth:\nIn that case, I believe it's vital that I investigate the rose garden posthaste.\nKay:\nWait, before you go... Take a look at this, Mr. Edgeworth!\nEdgeworth:\nWhat... is it?\nKay:\nMy guess is that it's a guitar pick. I picked it up just now over there. Do you think it'll be of any use?\nEdgeworth:\n(There is a little water on it... but how did the water get on it? It doesn't look like there's anything it could get wet from around here...)\nKay:\nI was thinking, they have concerts here at this open-air stage from time to time, right?\nEdgeworth:\nAlright, I'll find its owner later...\nPick data jotted down in my Organizer.\nKay:\nOh, yeah! There's one more thing... Mr. Edgeworth, would you be willing to hold onto this?\nEdgeworth:\nWhat is this?\nKay:\nIt's Ms. Yew's perfume. It's the bottle that woman left behind and that I found seven years ago. I thought that one day, it'd be of some use in tracking her down... ...so I kept it safe all this time.\nEdgeworth:\nThank you. I'd be honored to hold onto it for you.\nMs. Yew's Perfume data jotted down in my Organizer.\nTalk\n\n\n\n\n\n\n\n\n\nColias Palaeno\n\n\n\n\n\n\n\n\n\nPresent Allebahst's Primidux Statue\n\n\n\n\n\n\n\nPalaeno:\nThis statue resembles that hero, the Steel Samurai, don't you think? I was thinking, what would you say to changing its name to the \"Steel Samurai Statue\"? It just might attract a few more tourists to our country if I did, right?\nEdgeworth:\nI-I'm not sure what to think... (I thought that thing was a national treasure...)\nPartner\n\n\n\n\n\n\n\n\n\nPresent Ms. Yew's Perfume\n\n\n\n\n\n\n\nKay:\nThis is one of Ms. Yew's possessions that I found seven years ago... I thought that maybe it'd be of some use one day, so I took really good care of it.\nEdgeworth:\nThank you, Kay. I'll be sure to put it to good use. You'll see.\nKay:\nYeah! Now let's go catch that woman!\nEdgeworth:\nWe will. However, Kay, you need to look before you leap. You tend to lose your cool when it comes to anything related to that woman.\nKay:\nI'll be alright! I'm not exactly all that calm normally anyway!\nEdgeworth:\nI-I don't think that's something most people boast about, Kay.\nTheatrum Neutralis\nApproach door to Allebahstian Embassy\n\n\n\n\n\n\n\nEdgeworth:\nI think I'll be returning to the investigation in Allebahst now, but...\nKay:\nI know, I know. I'll go back to Babahl and do some more investigating here!\nTalk\n\n\n\n\n\n\n\n\n\nGuard by left door\n\n\n\n\n\n\n\nEdgeworth:\nMay I enter the Allebahstian Embassy?\nGuard:\nIf it's only you, then yes.\nKay:\nWhy won't you guys let ME in?\nGuard:\nI'm just following the rules, madam, so I'd appreciate it if you would cooperate.\nKay:\nWell then! I guess I have no choice but to climb over the wall from the Babahlese side...\nEdgeworth:\nKay, please don't run off and do any more dangerous things tonight!\nKay:\nIt was just a joke, Mr. Edgeworth! A joke!\nEdgeworth:\n(Don't tell me that AFTER my heart skipped a beat...!)\n\n\n\n\nGuard by right door\n\n\n\n\n\n\n\nGuard:\nWelcome back, Mr. Edgeworth. Please accept these, courtesy of Ambassador Palaeno. \nEdgeworth:\nTh-That's alright. I appreciate the sentiment, however, I must decline.\nKay:\nOh, come on. You might as well take them since he was nice enough to offer!\nGuard:\nThank you, and I hope you'll visit our embassy's cafeteria to redeem them.\nEdgeworth:\n(... It appears that Ambassador Palaeno isn't the only one adamantly handing these out.)\nExamine\n\n\n\n\n\n\n\n\n\nFlag by left door\n\n\n\n\n\n\n\nEdgeworth:\nIt's the national flag of Allebahst, and it features the country's flower crest. Comparing the knife to the crest, it's apparent the knife was extremely well crafted.\nKay:\nYeah, every detail of the flower is there on the knife handle's flower. In my professional opinion, this knife is worth quite a bit of money!\nEdgeworth:\nKay, that's a very valuable piece of evidence.\nKay:\nI know that! You're going to use this to find and steal the truth, right!?\nEdgeworth:\nI suppose you could put it that way. Now then, let's continue investigating.\n\n\n\n\nWindow by left door\n\n\n\n\n\n\n\nEdgeworth:\nI can see the courtyard and the Allebahstian Embassy through this window.\nKay:\nIt's a really stately and pretty embassy, isn't it? Especially that chimney! Just looking at it makes me want to use it to sneak my way in! Kinda like how Santa does it!\nEdgeworth:\n(..................!)\nKay:\nHey, are you alright? What's wrong, Mr. Edgeworth?\nEdgeworth:\nI'm beginning to think that you may have what it takes to become a royal troublemaker...\n\n\n\n\nCenter door\n\n\n\n\n\n\n\nEdgeworth:\nWe saw the show just beyond these doors, but it's been quite a number of hours now...\nKay:\nMr. Edgeworth, have I ever told you that you talk like an old fogey?\nEdgeworth:\nI was merely reminiscing! Is that such a crime!?\n\n\n\n\nTable\n\n\n\n\n\n\n\nEdgeworth:\nThere is a flat-panel, a VCR, and a row of Steel Samurai videos on this table.\nKay:\nAren't they worried that if they leave the tapes out on that table like that... ...the Yatagarasu will make off with them?\nEdgeworth:\nI honestly doubt the Yatagarasu would want to steal Steel Samurai video tapes.\nKay:\nAh, but that's where you're wrong! The fake Yatagarasu may not want to steal them... ...but you never know with the real Yatagarasu!\nEdgeworth:\nPlease stop eyeing the tapes with that look of want in your eyes, Kay.\n\n\n\n\nWindow by right door\n\n\n\n\n\n\n\nEdgeworth:\n(The Babahlese Embassy is just outside this window. It appears the renovations are going well.)\nKay:\nHey! I see Ambassador Palaeno out there!\nEdgeworth:\nHe's carrying wood planks for the renovations himself. Very commendable.\nKay:\n1, 2 , 3... 4! He's carrying four of them!? Wow! He may not look it, but I guess Ambassador Palaeno has got some real muscles!\nEdgeworth:\nPerhaps a bit of physical strength is required to be the ambassador of a country.\n\n\n\n\nFlag by right door\n\n\n\n\n\n\n\nEdgeworth:\nIt's the national flag of Babahl, and it features the country's butterfly crest.\nKay:\nUsing a butterfly as a national symbol makes Babahl just seem so cute! It goes along perfectly with Ambassador Palaeno's smiling face!\nEdgeworth:\nAnd what about the flower of Allebahst?\nKay:\nWell, by the looks of Ambassador Alba... ...it almost seems like the poor flower needs to be watered...\nEdgeworth:\n(I suppose an ambassador is the face of a country, but Kay is being too literal about it.)\nOpen-air stage (before approaching door on left side in Theatrum Neutralis)\nExamine\n\n\n\n\n\n\n\n\n\nWheelbarrow\n\n\n\n\n\n\n\nEdgeworth:\nA variety of tools are laid out here. I assume they're for the renovation work.\nKay:\nHey, it's a wheelbarrel!\nEdgeworth:\nYou mean a \"wheelbarrow\"?\nKay:\nBut it makes so much more sense my way! Ancient people probably wheeled barrels, right?\nEdgeworth:\nI highly doubt that's where the word came from...\nKay:\nJust let me have one for once, OK!?\n\n\n\n\nCement bags\n\n\n\n\n\n\n\nEdgeworth:\nBags full of cement powder are stacked up here. I suppose they're for the renovation.\nKay:\nYeah, because I don't smell a drop of gold here, or any other treasure for that matter.\nEdgeworth:\nKay, the only scent you should detect in a place like this is the smell of sweat.\nKay:\nThe smell of sweat? That's Gummy's coat, isn't it!?\nEdgeworth:\nI think you might be mistaken... Besides, that was a bit rude, wasn't it?\nKay:\nWas not! I was trying to say that Gummy is a really hard worker! The fact that you took my sentence completely the wrong way makes you rude!\nEdgeworth:\nM-Me, rude? Perish the thought.\n\n\n\n\nBush on right side\n\n\n\n\n\n\n\nKay:\nThis bush looks like the perfect place to hide some sort of treasure, you know?\nEdgeworth:\nIf treasure could be found so easily, wouldn't everyone be able to live life a bit easier?\nKay:\nAww... Don't dash my dreams. ...Ah!!\nEdgeworth:\nWh-What is it!? Don't tell me you actually found something...!?\nKay:\nWhoops, false alarm.\nEdgeworth:\n(Argh! How could I have let myself get caught up in her wild delusions...?)\nMarch 14, 9:58 PM\nRose Garden\n???:\nI see you're back, Miles Edgeworth. How are things in Babahl? Although, I can't really say I expect much from Scruffy and that girl.\nEdgeworth:\nThe investigation into Manny Coachen's death hasn't really progressed any... ...however, the investigation into the Yatagarasu has.\nFranziska:\nAh, yes, the Yatagarasu. Even now, I find it hard to believe. A person who can freely traverse between the two countries at will? Preposterous.\nEdgeworth:\nWell, that's what I came here to investigate. I heard that this is where witnesses claim to have seen the Yatagarasu.\nFranziska:\nThat's correct. Ambassador Alba was to give a speech tonight here in Allebahst. And that's when the Yatagarasu appeared. The shadow of the mysterious thief appeared, and just as suddenly, it vanished... After that, there was the fire at the Babahlese Embassy that the Yatagarasu started.\nEdgeworth:\n(I vow that not a single feather from the Yatagarasu shall escape my diligence!)\nBegin Investigation\nRose Garden\nTalk\n\n\n\n\n\n\n\n\n\nShi-Long Lang\n\n\n\n\n\n\n\nLang:\nHave you finished checking out all the bystanders?\nMIB:\nYes, sir! And we found... ...14 counts of pickpocketing, 16 counts of illegal parking, and 1 person ran a light, sir!\nLang:\nDon't tell me you didn't find out anything related to the case...\nMIB:\nSir! Not a single thing, sir!\nLang:\n...Well, for now, let's just get those other lawbreakers down to the precinct.\nEdgeworth:\n......... Agent Lang.\nLang:\nWell, if it isn't Mr. Prosecutor.\nEdgeworth:\nI would just like to thank you for your assistance earlier.\nLang:\nMake no mistake. It's not like I was trying to help you with what I did.\nEdgeworth:\n......... After I left, did you receive word from Ambassador Alba?\nLang:\nWe're to wrap up our bodyguard assignment at the end of today. Oddly enough, we received word from HQ to return home on an urgent matter. Heh, as if I can be so easily called away from this case after I've come this far. I swear that I'll find the truth, and drag it out screaming into the light. You're with me on that, right, Mr. Prosecutor?\nEdgeworth:\n..................\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nYatagarasu's appearance\n\n\n\n\n\n\n\nEdgeworth:\nYou were working as Ambassador Alba's bodyguard at the time... ...so naturally, you witnessed when the Yatagarasu appeared, correct?\nLang:\nYeah, I saw the thief alright. With my own two eyes. The Yatagarasu was always there, lurking in the shadows. But when the spotlights were turned on for Ambassador Alba's speech... ...a shadow appeared. That's when cries of, \"It's the Yatagarasu!\" rang out. The next second, the spotlight went out... ...and by the time we got the area lit again, the deft thief had vanished. When we investigated afterwards, we found that the reason the lights went out... ...was because someone had unplugged the extension plug for all the outdoor electronics. Whether it was someone doing it on purpose... ...or simply a guest who had tripped over it, we don't know. But one thing is for certain. The Yatagarasu was here!\nEdgeworth:\nSo you're saying that, basically, all you saw was the thief's silhouette?\nLang:\nYes...\nFranziska:\n\nFranziska:\nIf all you saw was a shadow... ...then it's entirely possible that the shadow belonged to someone else.\nLang:\nHah! Good thinking, sis. You just might be right. If it weren't for the fact that there was no one else with that same shape. Not among the staff or the audience members. My men have already done a thorough check of everyone, so I know I'm right!\nEdgeworth:\n(Someone else's shadow...? That sounds like a plausible hypothesis...)\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nProsecutor's Badge\n\n\n\n\n\n\n\nLang:\nLang Zi says: \"There is no value in trusting those who bear this mark.\" Let me fill you in on what I hate the most in this world. People who go around showing off that Badge! Sorry, but that's one opinion I'm never going to budge on.\nEdgeworth:\n.........\n\n\n\n\nNotes on Coachen's Body\n\n\n\n\n\n\n\nLang:\nLang Zi says: \"Inevitably, all who have evil in their hearts find themselves in Hell.\" But we haven't found all the pieces of the truth yet. I've come too far to go home before I see it all with my own two eyes.\nEdgeworth:\nIn that case, our goals are the same, so shouldn't we be cooperating with each other?\nLang:\nTch. We're on two different pages, you and I. And I don't trust any living thing that calls itself a prosecutor, got it?\n\n\n\n\nAllebahstian Knife\n\n\n\n\n\n\n\nLang:\nIt's covered in blood. The sight of blood... brings out my wild side. What about you? Any special reaction to blood?\nEdgeworth:\nNo, not especially.\nLang:\nTch. This is why you prosecutors are all worthless.\nEdgeworth:\n(How does that have any bearing on how good or bad of a prosecutor someone is...?)\n\n\n\n\nCohdopian Paper Document\n\n\n\n\n\n\n\nEdgeworth:\nAgent Lang, about this piece of evidence...\nLang:\nThat thing stinks to high heaven!\nEdgeworth:\nExcuse me?\nLang:\nLike all wolves, I've got a good sense of smell. And there's one nasty funk coming from that document. It's the smell of some dirty scoundrels' greed.\nEdgeworth:\n(...I wouldn't mind having his sense of smell if it helps in investigations this much.)\n\n\n\n\nCounterfeit Bills or Babahlese Ink\n\n\n\n\n\n\n\nEdgeworth:\nAgent Lang, I'd like for you to take a look at this piece of evidence.\nLang:\nIf we follow the trail that this piece leads us down, we'll eventually get to the truth.\nEdgeworth:\nIn that case, then why don't we cooperate and help one another?\nLang:\nNo can do. I can't just trust someone working as a prosecutor that easily.\n\n\n\n\nDeMasque II's Note\n\n\n\n\n\n\n\nEdgeworth:\nAgent Lang, what do you think about this piece of evidence?\nLang:\nHe may be the second, but he's just a peon imitating someone else. Just look at what happened to him, all because he was out for the national treasure. Lang Zi says: \"One should always know one's place in life.\"\nEdgeworth:\n(I guess Lang Zi had a lot to say in life, and on a lot of mundane topics as well...)\n\n\n\n\nAnything else\n\n\n\n\n\n\n\nEdgeworth:\nAgent Lang, I'd like to ask your opinion on this piece of evidence.\nLang:\nAre you joking? You're asking for MY opinion!?\nEdgeworth:\nOur mutual goal is to search for the truth, in which case, wouldn't cooperation be best?\nLang:\nLang Zi says: \"Only cooperate with those you can trust.\" Sorry, but I'm not one to place my trust in you prosecutor scum so easily.\nEdgeworth:\n(I'll take that as a \"no\".)\n\n\n\n\n\n\nMIB\n\n\n\n\n\n\n\nEdgeworth:\nHow is the investigation proceeding on your end...?\nMIB:\n...Lang Zi says... .........That's top secret.\nFranziska:\nIf you're going to attempt to imitate your superior, at least do it well!\nEdgeworth:\n(I don't suppose he believes in the accidental leakage of information...)\nExamine\n\n\n\n\n\n\n\n\n\nChair\n\n\n\n\n\n\n\nEdgeworth:\nI suppose Ambassador Alba sat in this chair?\nFranziska:\nAmbassador Alba... is very elderly. The chair was prepared for him should he have gotten tired during his speech.\nEdgeworth:\nIn that case, why didn't he plan to make his speech sitting down in the first place?\nFranziska:\n...The ambassador is also quite prideful, that's why.\nEdgeworth:\n(He sounds like my old principal from grade school who'd speak at assemblies.)\n\n\n\n\nSpeech stand\n\n\n\n\n\n\n\nEdgeworth:\nSo this is where Ambassador Alba was to give his speech.\nFranziska:\nThe stage was set up nicely, however, where was the audience supposed to sit?\nEdgeworth:\nHmm... Perhaps they were supposed to sit around the edge of the pool?\nFranziska:\nThat's such poor planning, if there was no place other than a spot or two by the pool. They really should've made seating arrangements, like how the gallery is set up in court.\nEdgeworth:\nIndeed. You can sense that consideration for the viewers was taken with those.\nFranziska:\nSo in the end, the speaker and his audience were to stand the whole time, huh?\nEdgeworth:\nYes... Although, I suspect the audience would've liked to sit down after a while.\n\n\n\n\nSpotlights\n\n\n\n\n\n\n\nEdgeworth:\nThere is an overturned spotlight here.\nFranziska:\nWhen the Yatagarasu appeared... ...the audience that was waiting for the speech to start panicked. I suppose that's when someone must've knocked it over.\nEdgeworth:\n(I'm having a tough time visualizing the mass confusion that took place here...)\nFranziska:\nI thought to use my whip to capture the Yatagarasu... ...however, there were people in my way, and I was unable to land even a single lash.\nEdgeworth:\n(...I suppose this means that some other poor saps were hit instead?)\n\n\n\n\nStatue of man\n\n\n\n\n\n\n\nEdgeworth:\nHm? This statue bears a resemblance to the Primidux Statue.\nFranziska:\nThe plaque says, \"King Primidux and the Battlefield\". \"In order to save the queen, King Primidux put his life on the line and went to war.\"\nEdgeworth:\nSo \"Primidux\" was actually a person of royal blood? I thought he was simply someone imitating a character from an ancient legend...\nFranziska:\nWell, what surprises me is that a real person who looked like the Steel Samurai existed.\nEdgeworth:\n...I suppose there's that, too.\n\n\n\n\nBush on lower left side\n\n\n\n\n\n\n\nEdgeworth:\nThese are some beautiful roses here. They appear to be well-maintained.\nFranziska:\nYou're being too nice, Miles Edgeworth. The arrangement is devoid of any design sense. Roses only truly shine when they are grouped by color; one color per location. They lose their beauty when they're all mixed together like this.\nEdgeworth:\n(I can't tell if she's being sarcastic or not...  On second thought, there's a rather serious look on her face. I'd better leave it be.)\nFranziska:\nThey should really re-think the proper balance of these roses.\nEdgeworth:\n(Of all the people to comment on the \"proper balance\" of things...)\n\n\n\n\nPool\n\n\n\n\n\n\n\nEdgeworth:\nThere are roses scattered on the surface of the water, creating a pleasant fragrance.\nFranziska:\nIt's not just for aesthetics; this pool's water is also used in putting out fires.\nEdgeworth:\nI see... Oh! The pool stopped filling itself automatically.\nFranziska:\nThe fountain spouts are set to stay open until the pool's water reaches a certain level.\nEdgeworth:\nIf this water is used to put out fires, I suppose it must be refilled to its normal level. (Which suggests that this pool was recently used somehow in this embassy... I guess I'll take some notes about it, just in case.)\nFountain Spouts data jotted down in my Organizer.\nEdgeworth:\nN...Nnnnggghhhhoooooooooooh!\nLarry:\nU...Uwaaaaaaaaaaaaaaaaaaaah!\nFranziska:\nHow dare you surprise me like that!?\nLarry:\nI-I'm sorry... Oh, hey, Edgey! Thanks for what you did back there!\nEdgeworth:\nYour gratitude alone is enough. More importantly, Larry... this pool is not for your personal enjoyment!\nLarry:\nI know that! Do you really think that I'm the type to just jump into a pool and swim around for fun!?\nEdgeworth:\n\nEdgeworth:\n.................. Alright then. Did you, by chance, fall into the pool?\nLarry:\nNice guess... but no dice. So you know my son, right, Edgey?\nEdgeworth:\nYour son...?\nLarry:\nI guess I kinda lost sight of him when I shook hands with the ambassador. And I'm pretty sure he was around here when I last saw hiiiiiiiiiim!\nFranziska:\nY-You imbecile! How can you be so flippant at a time like this!? What are you going to do if your son fell into the pool!? And how old is this child of yours, anyway!?\nLarry:\nHuh? Oh, umm... How old is he again?\nEdgeworth:\n\nEdgeworth:\nLarry, this is the first I've heard of a son. Who exactly is the mother?\nLarry:\nThe mother? Oh, that chick... the Pink Princess!\nFranziska:\nThe... Pink... Princess...?\nEdgeworth:\n\nEdgeworth:\n...Ms. von Karma. I was a bit confused by this man's words for a bit there... ...however, I believe what he is looking for is the doll of the Iron Infant.\nLarry:\nYup! Because I'm the Steel Samurai through and through. Heart and soul! And the Iron Infant is my cute little son!\nFranziska:\nY-You have given a whole new meaning to the phrase \"an astounding fool\"...\nEdgeworth:\nLarry. We have not seen hide nor hair of the Iron Infant. But rest assured that if we should find him, we'll let you know. Now, get out of there.\nLarry:\nSounds good! In that case, I'll go search over there!\nEdgeworth:\nHey! Wait! (.........*sigh* Well, it's not as if he'll get very far swimming around in that pool... And though he's unrelated to the murders, he sure knows how to cause a lot of trouble.)\n\n\n\n\nPool (subsequent times)\n\n\n\n\n\n\n\nEdgeworth:\n(It would appear that this pool served its function tonight as an emergency water reservoir. The pool even refills itself to the preset water level. ...And when the planets align, a Steel Samurai appears from its depths.)\n\n\n\n\nStatue of woman\n\n\n\n\n\n\n\nEdgeworth:\nHmm... A statue of a woman. I wonder if the lady is pouring water...\nFranziska:\nIt says that it's a statue of \"The Queen Who Spoke of Love to King Primidux\". Hmph... Well, Miles Edgeworth. It seems that you are lousy at reading a woman's heart!\nEdgeworth:\n(I open my mouth about a statue and she somehow made the leap to that...?)\n\n\n\n\nBush on lower right side\n\n\n\n\n\n\n\nEdgeworth:\nIs it possible that the Yatagarasu hid in these bushes...?\nFranziska:\nOf course not! They're rose bushes! You've been spending so much time with Scruffy and that girl, they're rubbing off on you. But it's alright. I'll wake you out of your stupor. Now, the next time you feel like sleep-talking, remember that I'll whip you for real.\nEdgeworth:\n(All I tried to do was offer up a possibility, and this is what I get...?)\nPartner\n\n\n\n\n\n\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nThe investigation\n\n\n\n\n\n\n\nFranziska:\nTonight, in this very rose garden, the Allebahstian ambassador, Quercus Alba... ...was to give a commemorative speech. A very key commemorative speech at that. And including Agent Lang, the security detail was very tight. But, as if to mock our efforts, the Yatagarasu appears. Then, just like that, the thief vanishes and starts a fire at the Babahlese Embassy.\nEdgeworth:\nInteresting... And are you sure it was the Yatagarasu who appeared here?\nFranziska:\nOf course. But to have slipped by such tight security... ...and then disappear into thin air... We will need to conduct a very thorough investigation of this area.\nEdgeworth:\nYes, my thoughts exactly. (In order to find out the truth behind what happened here... ...I should start by gathering as much information as I can.)\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nAllebahstian Knife\n\n\n\n\n\n\n\nFranziska:\nWould you mind not pointing that in my direction? It's dangerous. And anyway, why are you showing it to me?\nEdgeworth:\nI have no particular reason...\nFranziska:\n!!\nEdgeworth:\nGnnrk!\nFranziska:\nIf you have no reason! Don't you bring that dangerous object near me! Do you understand!?\nEdgeworth:\n! (I-Is she really that oblivious to the irony in that statement? She lets loose that dangerous whip of hers for no reason all the time!)\nAfter clearing Talk option with Shi-Long Lang and examining statue of man, pool, and statue of woman:\nEdgeworth:\nThe suddenly appearing and disappearing shadow of the Yatagarasu... I believe I've figured out its true origin.\nFranziska:\nI expected no less from my subordinate. Now, let's hear what you know on the subject. What really cast the shadow of the Yatagarasu?\nPresent statues\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"The suddenly appearing and disappearing shadow of the Yatagarasu...\"\nPresent anywhere else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nFranziska, if you could take a look at this. Don't you find it to be a bit suspicious?\nFranziska:\nNot at all.\nEdgeworth:\n.............................. Hmph... As I thought. For you see, I was merely testing you just now.\nFranziska:\nWe have no time to waste on your pompous talk, so get on with your explanation already!\nEdgeworth:\nNghhooooh! (Gnrk... I guess Franziska just couldn't understand my point. I need to think this through again. Now, the Yatagarasu's shadow... There really is only one thing that can explain how it was cast, and it must be this!)\nLeads back to:\n\"What really cast the shadow of the Yatagarasu?\"\nEdgeworth:\nThe suddenly appearing and disappearing shadow of the Yatagarasu... Is it not possible that it was created by this statue?\nFranziska:\nFranziska:\nAre you playing me for a fool, Miles Edgeworth!? This statue bears absolutely no resemblance to the shadow of the Yatagarasu!\nEdgeworth:\nYou are correct, however, this statue is but one part of the whole picture.\nFranziska:\nWhat do you mean by \"only one part\"...?\nEdgeworth:\nWhat is the other part to the real form of the Yatagarasu's shadow?\nPresent other statue\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"It's... another statue?\"\nPresent anywhere else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nFranziska, if you could take a look at this. Don't you find it to be a bit suspicious?\nFranziska:\nNot at all.\nEdgeworth:\n.............................. Hmph... As I thought. For you see, I was merely testing you just now.\nFranziska:\nWe have no time to waste on your pompous talk, so get on with your explanation already!\nEdgeworth:\nNghhooooh! (Gnrk... I guess Franziska just couldn't understand my point. I need to think this through again. Now, the Yatagarasu's shadow... There really is only one thing that can explain how it was cast, and it must be this!)\nLeads back to:\n\"What is the other part to the real form of the Yatagarasu's shadow?\"\nFranziska:\nIt's... another statue?\nEdgeworth:\nThe Yatagarasu's shadow was made from the shadows of these two statues.\nFranziska:\nMade? What do you mean by that?\nEdgeworth:\nRight now, the spotlights are all over the place. This is because they were moved when the guests were in a panicked state. However, if we were to restore the lights to where they were when the thief appeared...\nFranziska:\nYou believe that the two shadows will create the Yatagarasu's shadow?\nEdgeworth:\nPrecisely. Now then, watch as I reveal the true form of the Yatagarasu! First, if we set up a spotlight to cast a shadow of \"King Primidux and the Battlefield\"... ...the shadow of the king's statue would appear on the backdrop of the stage. Likewise, if we set a light up on \"The Queen Who Spoke of Love To King Primidux\"... ...her silhouette would also appear on the backdrop to the stage.\nFranziska:\nAha! So if we were to combine the two shadows...!\nFranziska:\n............ It looks nothing like the Yatagarasu's shadow! Miles Edgeworth! How do you explain this grotesque shape!?\nEdgeworth:\nC-Calm down, Franziska! The way the light needs to be shone on the queen's statue is wrong...\nFranziska:\nWhat do you mean by that?\nEdgeworth:\nI believe that the whole of the king's shadow needs to be used for this to work. However, in the case of the queen, I don't believe her whole shadow is needed. Rather, the person who created the shadow only used one part of her shadow.\nFranziska:\nOnly one part?\nEdgeworth:\nYes, and that one part alone is enough to fill in the rest of the Yatagarasu's shadow.\nFranziska:\nWhy didn't you say that in the first place!?\nEdgeworth:\nYou're right. I-I apologize...\nFranziska:\nNow, what part of the queen's statue was used to complete the Yatagarasu's shadow?\nPresent left hand\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Think back to what is missing in our shadow.\"\nPresent anywhere else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThis... is that part!\nFranziska:\nAnd how exactly should we shine the light on this part to complete the shadow? Because I can't see how this would fit in at all.\nEdgeworth:\n(Nngh......... Alright, perhaps I was wrong.) Franziska, it's not there we should be shining a light on, but a different location.\nFranziska:\nMiles Edgeworth! Why are you withholding the correct information from me!?\nEdgeworth:\nArngh! P-Please forgive my transgression...\nFranziska:\nVery well. Just don't mess up again!\nLeads back to:\n\"Now, what part of the queen's statue was used to complete the Yatagarasu's shadow?\"\nEdgeworth:\nThink back to what is missing in our shadow. Five long, thin areas, correct? Now, what does that remind you of?\nFranziska:\nAh!\nEdgeworth:\nThat's right. It can only be the shadow of the queen's left hand. Franziska, can we please adjust the spotlight's position... ...so that it only shines on the queen's left hand?\nFranziska:\nAlright. Let's give it a try and see what we get.\nFranziska:\nIt's...!\nLang:\nHmph... Yeah, this is exactly like the shadow I saw.\nEdgeworth:\nThe culprit must've changed the spotlights' positioning beforehand... ...and then pulled the plug after people saw what the culprit wanted them to see. In their panic, the guests must have moved the spotlights around... ...which we can assume was also a part of the culprit's plan. By the time the lights came back on, the Yatagarasu's shadow had vanished.\nFranziska:\nWhich means that the shadow was a construct from the very beginning.\nEdgeworth:\nSo you see, the Yatagarasu never did visit Allebahst tonight. The only country that thief visited was Babahl, although it can be assumed... ...that the Yatagarasu had an accomplice in Allebahst.\nFranziska:\nAn accomplice? But who...?\nEdgeworth:\nI haven't figured that out yet, but I assume it was the person who set up the shadow show. (I sense that the biggest clue yet to solving this case is the existence of this accomplice!)\nInvestigation Complete\n???:\n.........How's the investigation going?\nEdgeworth:\nDetective Badd, have you come to join us in investigating the Yatagarasu?\nBadd:\nI've left the murder... in Agent Lang's charge... And my only target... from the very beginning is the Yatagarasu... so yes...\nEdgeworth:\nSo... what have you found out?\nBadd:\n...I got a piece of evidence.\nEdgeworth:\nMay I see it...?\nBadd:\n...Sure, but you might regret it...\nFranziska:\nWe're here because we are ready to face whatever may come. ...So if you please.\nBadd:\n...When people heard the commotion, bystanders... started gathering. And one woman... claimed, \"I'm tellin' ya I'm a genuine international journalist!\"... She gave me... an interesting picture.\nEdgeworth:\nA journalist...?\nBadd:\nWell, actually... she's a freelance... cameraman. This... is the photo I got from her.\nEdgeworth:\nWh-What in the world!?\nFranziska:\nThe Yatagarasu... is flying through the air...!\nBadd:\n...The times, they are a-changing... It's... not just man... ...but evidence... even they lie to us now...\nEdgeworth:\nWh-When was this photo taken?\nBadd:\n...Apparently, right after the fires... on the fourth and fifth floors were put out... It was taken... from a near-by building... that you can see the embassy from.\nEdgeworth:\nI see. So this was taken after the fire...\nPhoto of Yatagarasu data jotted down in my Organizer.\nBadd:\nThe blur in this picture... took off from the Babahlese Embassy... ...flew over the boundary... and headed for the Embassy of Allebahst...\nFranziska:\nFranziska:\nThis is simply not possible! People are incapable of flight!\nEdgeworth:\nIs that a fact? I've had the \"pleasure\" of dealing with a case involving a \"flying person\" once.\nFranziska:\n.............................. Actually, come to think of it, I've come across a case like that as well. Two, actually.\nBadd:\n...Maybe it happens more often than we think...\nEdgeworth:\n(Am I up to the task of solving the mystery behind this photograph? Well, the Yatagarasu took off from the Babahlese Embassy, so I should start from there.) Franziska, I need to return to the Babahl investigation for a bit.\nFranziska:\n...Alright.\nApproach road to Theatrum Neutralis\n\n\n\n\n\n\n\nFranziska:\nI'll continue investigating on this side of the building.\nEdgeworth:\nAlright, I'm counting on you.\nTalk\n\n\n\n\n\n\n\n\n\nShi-Long Lang\n\n\n\n\n\n\n\nLang:\n...Hah! What a farce. Turns out that what I thought was the Yatagarasu's shadow was some statues' instead.\nEdgeworth:\nIt's nothing to be embarrassed about. Everyone was in a panic.\nLang:\n...And here I thought you'd come over to throw some sarcastic remark in my face.\nEdgeworth:\nOf course not. You and I, we're both of one mind in pursuit of the truth.\nLang:\nHmph... But are we really of one mind though...?\nEdgeworth:\nI'll be returning to the Babahl investigation now. I'll contact you if I find anything.\nLang:\n.........You sure are as stubborn as a rock.\n\n\n\n\nTyrell Badd\n\n\n\n\n\n\n\nBadd:\n...So the Yatagarasu was just a shadow...\nFranziska:\nThe calling card that was sent is what threw everyone off and made them assume things.\nEdgeworth:\nIt's possible that all of the events tonight were part of the overall plan.\nBadd:\nI'm... going to continue investigating on the Allebahstian side... You two... As I always say... don't do anything stupid, alright...?\nFranziska:\nI wonder if he's alright? It's unusual for him to be so nice.\nEdgeworth:\nI think it's simply that he is concerned for our well-being, Franziska.\nPartner\n\n\n\n\n\n\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nNotice anything?\n\n\n\n\n\n\n\nFranziska:\nI wonder what that photo earlier was all about...?\nEdgeworth:\nIndeed... (That photo certainly was \"interesting\"...) I believe this necessitates a need to investigate the Babahlese Embassy some more.\nFranziska:\nI suppose we have no choice if we are to conduct the perfect investigation.\nEdgeworth:\nI suppose so. (I will have to pass through the Theatrum Neutralis to reach the Babahlese Embassy.)\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nPhoto of Yatagarasu\n\n\n\n\n\n\n\nFranziska:\nThis is simply not possible! People are incapable of flight!\nEdgeworth:\nWell, I had the \"pleasure\" of dealing with a case involving a \"flying person\" once.\nFranziska:\nActually, come to think of it, I've come across a case like that as well. Two, actually.\nTheatrum Neutralis\nKay:\nWelcome back, Mr. Edgeworth! Now come on! Let's get back to our investigation!\nEdgeworth:\nYes, let's.\nPartner\n\n\n\n\n\n\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nThe investigation\n\n\n\n\n\n\n\nKay:\nIs there really any place left we haven't checked out yet in the Babahlese Embassy?\nEdgeworth:\nInterpol was conducting its investigation when you were being held by Agent Shih-na. Because of that, I was unable to examine the fireplace and the secretariat's desk.\nKay:\nTrue... And since he's here, we should talk with Ambassador Palaeno some more, too! He looks so sad and lonely since Mr. Coachen died...\nEdgeworth:\nYes, he does... and you are correct. I have a few issues I still need to discuss with him. We should make the best of this opportunity.\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nPhoto of Yatagarasu\n\n\n\n\n\n\n\nKay:\n......... I've only got one thing to say to this. The real Yatagarasu can't fly through the air!\nEdgeworth:\n.........\nRose Garden\nFranziska:\nI see you're back. Well, let's continue with the investigation, shall we?\nEdgeworth:\nYes, let's.\nMarch 14, 10:37 PM\nBabahlese Embassy - Secretariat's Office\nKay:\nTo think, after all that running around, we're right back where we started.\nEdgeworth:\nIt would appear that way...\nPalaeno:\nHi, Mr. Edgeworth. Have you found Manny's killer yet?\nEdgeworth:\nI'm terribly sorry, Ambassador Palaeno, but I have yet to find his killer.\nPalaeno:\nThen I guess his murder... really was the work of the Yatagarasu...\nKay:\nLet's get one thing straight. It was the work of the FAKE Yatagarasu. The real Yatagarasu is a noble vigilante who is only out to steal the truth...\nPalaeno:\nMs. Faraday... Please don't make such a sad face. If there's anything I can do for you, all you have to do is ask, alright?\nKay:\nMr. Palaeno...\nEdgeworth:\nActually, there is one thing you can do. Will you allow us to take another look around? We didn't have enough time to conduct a thorough investigation earlier.\nPalaeno:\nOh, sure! Please feel free to investigate to your heart's content.\nEdgeworth:\nAlso, there are a few questions I'd like to ask you personally, Ambassador.\nPalaeno:\nIf it will bring a smile back to Ms. Faraday's face, then I'll gladly answer anything.\nKay:\nThank you, Mr. Palaeno! You're a total gentleman!\nPalaeno:\nHa ha ha. You don't have to waste such nice words on me, little miss!\nKay:\nHey, Sir Palaeno!\nEdgeworth:\n(...Those two sure got chummy awfully quickly.)\nKay:\nYou know, it's easy to say we're going to investigate, but where should we begin?\nEdgeworth:\nWe should probably start by comparing the state of this room before and after the fire. And then, we should look into the matter of the suspicious person you spotted.\nKay:\nYeah. When I came into this room, that person was already gone. But I'm willing to bet that the person I was chasing is Mr. Coachen's killer.\nEdgeworth:\nWe don't know that yet; however, it's hard to believe that person is unrelated. Furthermore, because the key the Yatagarasu stole seven years ago was found here... ...it signals that perhaps Ms. Yew is also somehow involved.\nKay:\nI knew it! That woman is almost definitely Mr. Coachen's killer!\nEdgeworth:\nYet again, we don't know that! (There are too many mysteries to be solved here (changed from [in this case] in the original release).) Speaking of the Yatagarasu and mysteries... ...I received a most mysterious photo from Detective Badd.\nKay:\nUncle Badd!? He's taking part in the investigation, too!?\nEdgeworth:\nYes. He has been chasing after the Yatagarasu for all these years.\nKay:\nUncle Badd.........\nEdgeworth:\nNow then, I was told that this photo was taken just after the fire...\nKay:\nWh-What--!? This kinda looks like the person in the long coat I was chasing...! Does this mean... that I was chasing the fake Yatagarasu after all?\nEdgeworth:\nI don't know the answer to your question, but I don't think people can fly either...\nKay:\nBut this could be how that person escaped!\nEdgeworth:\nWell, we'll need to investigate a bit more before we can say anything about that. In any case, let's not dawdle any more and pick up our investigation where we left off.\nBegin Investigation\nBabahlese Embassy - Secretariat's Office\nTalk\n\n\n\n\n\n\n\n\n\nColias Palaeno\n\n\n\n\n\n\n\nEdgeworth:\nNow then, Ambassador, I'd like to ask about your movements before the fire broke out.\nPalaeno:\nBefore the fire...? Which fire are you talking about?\nEdgeworth:\nWhich one? There was more than one tonight?\nPalaeno:\nHuh? ...Oh, I see. I guess you didn't hear about it. We had two fires here at the Babahlese Embassy tonight. What a bother all of that was!\nKay:\nWait, but the only fire we know about is the one after the Jammin' Ninja's show!\nPalaeno:\nAh, well, the first occurred at the start of the Jammin' Ninja's show. Luckily, only the fourth and fifth floors of our embassy caught on fire. Not wanting to cause a panic among the theatergoers, we decided to keep it internal.\nEdgeworth:\nThen the fire after the Jammin' Ninja's show was the second one of the night?\nPalaeno:\nExactly.\nEdgeworth:\nSo the fire I witnessed was the second one... (Come to think of it, didn't Detective Badd make reference to the first fire...?)\n\n\nEdgeworth:\nWh-When was this photo taken?\nBadd:\n...Apparently, right after the fires... on the fourth and fifth floors were put out...\n\n\nEdgeworth:\n(I suppose this means that the photo was taken just after the first fire was put out.)\nPhoto of Yatagarasu data updated in my Organizer.\nKay:\nSo then, what was the extent of the damage in the second fire?\nPalaeno:\nThe second fire was contained to this floor, the third floor. I think it was left over embers from the fire on the floors above it that caused it.\nEdgeworth:\nThat's... how should I put this... a very bad stroke of luck...\nPalaeno:\nMy office on the fifth floor, Manny's office here... ...and Manny himself... all gone in the blink of an eye.\nFires in Babahl data jotted down in my Organizer.\nKay:\nI feel so sorry for you, Mr. Palaeno...\nPalaeno:\nOops, look at me going on and on. Now then, what was it you wanted to ask again?\nEdgeworth:\nWe were discussing what your actions and whereabouts for today were. And, if you happened to know, what Mr. Coachen's actions and whereabouts were as well.\nPalaeno:\nYes, very well. Let's see, I've been quite busy all day from morning until now. First I woke up and then I brushed my teeth. After that, I had a roll for breakfast...\nEdgeworth:\n\nEdgeworth:\nFascinating... How about if you just skip to the relevant parts for me.\nPalaeno:\nOh! You'd like a condensed version? Alright, I can do that for you!\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nMorning activities\n\n\n\n\n\n\n\nEdgeworth:\nSo what did Mr. Coachen and you do this morning?\nPalaeno:\nWell, originally, we were supposed to meet and shake hands with the Jammin' Ninja. But Manny and I wanted to turn it into a photo op, so we were here tidying up his office.\nEdgeworth:\nYou helped clean Mr. Coachen's office...? Why were you not cleaning your own?\nPalaeno:\nOh, I think I forgot to mention this, but my office is currently undergoing renovations (Renovations - The Babahlese Embassy is undergoing renovations from top to bottom.). Which is why both the Primidux Statue and the Babahlese knife set are down here.\nEdgeworth:\nI see.\nPalaeno:\nOh, but the tidying didn't take much, really. We just burned some files we no longer needed and expired coupons in the fireplace.\nKay:\nI bet cleaning up the fireplace must've been a real pain though, huh?\nPalaeno:\nAh, about that... I kind of forgot to clean the ashes out. Ha ha ha... I guess I'm up a creek without Manny here to get angry at me.\nEdgeworth:\n\nEdgeworth:\nAn ambassador like yourself has been on the receiving end of a secretary's anger?\nPalaeno:\nOh, he was very good at being very mad. Why, even just this morning, he got mad at me. I spilled some Babahlese ink onto the back wall when I was burning the files, you see... ...and he got mad at me, saying that I should treat the ink with more respect.\nEdgeworth:\n......... (Talk about the boss getting bossed around... (changed from [Apparently, orders go up the chain of command around here] in the original release).)\nAmb. Palaeno's Testimony jotted down in my Organizer.\nPalaeno:\nThat's about it for what we did this morning. Just some cleaning.\nEdgeworth:\n(Don't tell me you had no other work to do... being an ambassador and all.)\n\n\n\n\nMorning activities (subsequent times)\n\n\n\n\n\n\n\nEdgeworth:\nSo what did Mr. Coachen and you do this morning?\nPalaeno:\nWell, originally, we were supposed to meet and shake hands with the Jammin' Ninja. But Manny and I wanted to turn it into a photo op, so we were here tidying up his office.\nEdgeworth:\nYou helped clean Mr. Coachen's office...? Why were you not cleaning your own?\nPalaeno:\nOh, I think I forgot to mention this, but my office is currently undergoing renovations. Which is why both the Primidux Statue and the Babahlese knife set are down here.\nEdgeworth:\nI see.\nPalaeno:\nOh, but the tidying didn't take much, really. We just burned some files we no longer needed and expired coupons in the fireplace.\nKay:\nI bet cleaning up the fireplace must've been a real pain though, huh?\nPalaeno:\nAh, about that... I kind of forgot to clean the ashes out. Ha ha ha... I guess I'm up a creek without Manny here to get angry at me.\nEdgeworth:\n\nEdgeworth:\nAn ambassador like yourself has been on the receiving end of a secretary's anger?\nPalaeno:\nOh, he was very good at being very mad. Why, even just this morning, he got mad at me. I spilled some Babahlese ink onto the back wall when I was burning the files, you see... ...and he got mad at me, saying that I should treat the ink with more respect.\nEdgeworth:\n......... (Talk about the boss getting bossed around... (changed from [Apparently, orders go up the chain of command around here] in the original release).)\nPalaeno:\nThat's about it for what we did this morning. Just some cleaning.\nEdgeworth:\n(Don't tell me you had no other work to do... being an ambassador and all.)\n\n\n\n\nAfternoon activities\n\n\n\n\n\n\n\nEdgeworth:\nNow then, if you could tell me what you and Mr. Coachen did this afternoon...\nPalaeno:\nWell, Manny and I went down together to the Theatrum Neutralis. We had to be there for the start of the Steel Samurai stage show. After the show started, I went back to my office on the fifth floor alone.\nEdgeworth:\n(So they were together until the start of the Steel Samurai show.)\nPalaeno:\nA little while later, after I had straightened myself up a bit, I returned to the theater... ...because I was to take part in the photo op on-stage at the end of the show.\nEdgeworth:\nHmm......... (There WAS a commemorative photo op at the end...)\nPalaeno:\nIt was a fantastic photo of the 3 of us -- Ambassador Alba, the Steel Samurai, and myself. After the photo shoot, I went back to my office on the fifth floor... ...to prepare for my handshake photo op with the Jammin' Ninja.\nEdgeworth:\n(...He seems to be rather overworked for an ambassador.)\nPalaeno:\nWhen I got to my office, that's when the first fire broke out and I escaped down the stairs. My office was completely destroyed, but thankfully, no one was hurt. I admit I ran away from the first fire as fast as my legs could carry me... ...but during the second one, I pitched in and helped the embassy staff put it out.\nEdgeworth:\nSo you didn't see Mr. Coachen again after the start of the Steel Samurai show?\nPalaeno:\nYes, that's right. The next time I saw him, he was lying there, in an eternal sleep.\nEdgeworth:\nI see......... Ambassador Palaeno, I thank you very much for your help.\nPalaeno:\nI'm sorry I couldn't be of more assistance, Mr. Edgeworth. If there is anything else, please don't hesitate to ask, alright?\n\n\n\n\nMr. Coachen's Ink (appears after examining ink bottle on desk)\n\n\n\n\n\n\n\nEdgeworth:\nI wonder if you might tell me what you noticed about Mr. Coachen's bottle of ink?\nPalaeno:\nUmm... I just thought of it right now, but... ...during the second fire, Manny was worried about his office, so he came rushing back to it. I called out to him, and when I received no reply, I used my spare key to open the door... ...but when I did, I was greeted by roaring green flames. The flames were so big that I wasn't able to see into the room at all.\nEdgeworth:\n\nEdgeworth:\nThe fire was green...? What was the cause...?\nPalaeno:\nWell, whitcrystal oil burns green when it's lit, as you can see by this lantern.\nEdgeworth:\nHmm... And Babahlese ink is made from the same oil, which means it would also burn green.\nPalaeno:\nYou know... ...I, too, had thought it was Manny's ink that had caught on fire. So that's why I was surprised to find out there was still a bottle of ink left on his desk!\nKay:\nThe case of the perplexing green flames... Talk about a mystery!\nEdgeworth:\n(What exactly was it that caught on fire in here...?)\n\n\n\n\nJob for DeMasque II (appears after correctly deducing orange paper in desk)\n\n\n\n\n\n\n\nEdgeworth:\nI believe that you said you might have an idea as to why Mr. Coachen hired DeMasque II.\nPalaeno:\nActually, I fear it may be my fault. As I was telling you earlier... ...we were to determine which statue was the real one as a part of today's event.\nKay:\nBut because of the Yatagarasu and the fire here, that got canceled, didn't it?\nPalaeno:\nHa ha ha... I'm actually relieved the rest of the event has been canceled. For you see, Babahl's statue... well, it's just a replica.\nEdgeworth:\nAnd did Mr. Coachen know that about Babahl's Primidux Statue?\nPalaeno:\nOf course he knew! That's why he was the only person I could consult with. We'd have to do something once our statue was revealed as a replica. As to be expected, I was very nervous today, as this would impact our country's authority.\nEdgeworth:\nYes, I understand.\nPalaeno:\nWell, when I told Manny my concerns, he said, \"Let me handle it. It'll be alright. I'll find a way to make sure you're the ambassador of the re-united Cohdopia.\" At the time, I thought he was just trying to cheer me up... ...but when I saw that note, I realized he was serious...\nEdgeworth:\n\nEdgeworth:\nMr. Coachen... conducted a lot of business behind your back. I assume he did all that to ensure that you are the next Cohdopian ambassador.\nPalaeno:\nBut... why was he trying so hard, I wonder? He was so much better at getting things done than I ever was or will be...\nEdgeworth:\n(I don't have an answer yet as to why he was trying so hard (changed from [know the answer to why he was trying so hard yet] in the original release)... ...but I suspect he had an ulterior motive in mind beyond just simple kindness.)\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nAllebahstian Knife\n\n\n\n\n\n\n\nPalaeno:\nOh, dear... If people were to find out that a murder occurred at our embassy... ...the number of tourists would plummet, as would our revenues! It'd be disaster! What are we going to do...?\nEdgeworth:\n(He really does seem worried. Perhaps I should refrain from bringing this up...)\n\n\n\n\nFires in Babahl\n\n\n\n\n\n\n\nPalaeno:\nI lost a lot of things to those fires... Things like the many, many coupons we had printed... ...discount tickets for the cafeteria, and...\nEdgeworth:\n(I should think that those blasted coupons were not the biggest victim here...)\n\n\n\n\nAmb. Palaeno's Testimony\n\n\n\n\n\n\n\nPalaeno:\nEverything this morning happened exactly as I said it did in my statement. Manny and I wanted to do a photo shoot with the Jammin' Ninja, so we tidied his office. That's about it. I can't think of anything else of interest.\nEdgeworth:\n(If this guy is to be believed, an ambassador's job consists only of wasting time.)\nExamine\n\n\n\n\n\n\n\n\n\nWindow\n\n\n\n\n\n\n\nEdgeworth:\nYou can see the Allebahstian Embassy through this window.\nKay:\nSo where were you when you were investigating over there, Mr. Edgeworth?\nEdgeworth:\nHmm... Ah, you can see it from here. I was there on the fifth floor. That's where DeMasque II was killed.\nKay:\nWhat!? You don't mean THE Mask☆DeMasque II!? Aww... Poor guy. As a fellow second-generation thief, I can't just turn a blind eye to this!\nEdgeworth:\n(...Even though DeMasque II was merely an impostor of the original?)\n\n\n\n\nDesk\n\n\n\n\n\n\n\nEdgeworth:\nIt appears that this area was heavily damaged by the fire.\nKay:\nYeah. I guess we should hurry up and get started examining everything.\nEdgeworth:\n(I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\nOpen drawer\n\n\n\n\n\n\n\nLeads to:\n\"It would appear that this desk also fell victim to the fire.\"\n\n\n\n\nChair\n\n\n\n\n\n\n\nEdgeworth:\nThat looks like a very comfortable chair.\nKay:\nWell, it doesn't look all that broken, so why don't you try sitting in it?\nEdgeworth:\nNo, I'd better not. It's very important that we preserve the crime scene at all times.\nKay:\nWait, but you're always touching all sorts of things at crime scenes!\nEdgeworth:\nThat's because I am a prosecutor, and it's a part of my job to examine things.\nKay:\nAnd my job is to be a Great Thief!\nEdgeworth:\nWhich is exactly why you are not allowed to touch anything.\n\n\n\n\nPhone\n\n\n\n\n\n\n\nKay:\nSo I guess embassy phones are just like normal phones, huh?\nEdgeworth:\nWell, what did you imagine them to look like?\nKay:\nI thought that Babahl's would look like a flower, and the receiver would be a butterfly! That way, it'd look like the butterfly receiver was sucking nectar from the flower base!\nEdgeworth:\nIf any country had a flower phone, it would be Allebahst, don't you think?\nKay:\nOh! Then maybe the phone I envisioned would've been from when they were Cohdopia?\nEdgeworth:\nThere's really no point in asking me about something that never existed in the first place.\nKay:\nHmph! You know what you lack, Mr. Edgeworth? Curiosity and an imagination!\n\n\n\n\nInk bottle\n\n\n\n\n\n\n\nEdgeworth:\nThere is a bottle of Babahlese ink on Mr. Coachen's desk.\nKay:\nAnd it looks like there's still a lot of ink left inside.\nEdgeworth:\nThe seal is unbroken, so the fire probably couldn't get into the bottle to burn up the ink.\nKay:\nHey, Mr. Palaeno! It looks like your precious Babahlese ink is alright after all!\nPalaeno:\nWhat!? ...That's odd.\nEdgeworth:\n\nEdgeworth:\nAmbassador, what do you mean by that?\nPalaeno:\nUmm, well, it's just that there is something strange about the ink.\nEdgeworth:\nWould you mind elaborating on that statement for me please?\n\n\n\n\nInk bottle (subsequent times)\n\n\n\n\n\n\n\nEdgeworth:\n(It's Mr. Coachen's bottle of Babahlese ink. There's quite a bit of it left. I suppose he was the type to use the ink in both a legal and an illegal capacity.)\n\n\n\n\nBurned papers\n\n\n\n\n\n\n\nEdgeworth:\nIt looks like... a bunch of flyers with coupons attached to them.\nKay:\nBabahl sure gives away a lot of different coupons! Maybe I should create one of my own! I could call it the \"Great Thief Coupon\"!\nEdgeworth:\nAnd what kind of discount would that net you?\nKay:\nThe five-finger kind, what else? And I'd steal an extra thing or two for the bearer.\nEdgeworth:\n...Things such as?\nKay:\nSuch as the truth! What else would I steal?\nEdgeworth:\nWhat I wouldn't give to have a mountain of your coupons right about now.\n\n\n\n\nBooks\n\n\n\n\n\n\n\nEdgeworth:\nThere is only one book left standing here... \"Treasures of the World\"...\nKay:\nWait, what!? Let me see that! .........Un-huh... I see... Aaah! The most important part was blackened by the fire! Why, cruel fate... why?\nEdgeworth:\n(It looks like the map of where the treasures are located has been burnt.)\n\n\n\n\nNameplate\n\n\n\n\n\n\n\nEdgeworth:\n\"Manny Coachen\"... His name is written here on this nameplate.\nKay:\nWhy would you put a nameplate with your name on it in your own office?\nEdgeworth:\nI suppose it's to inform people in case they walked into the wrong room by mistake.\nKay:\nDo you think maybe it's also there to remind you of your own name if you forget?\nEdgeworth:\nWell, either way, it's never a bad thing to set a nameplate on one's desk.\n\n\nEdgeworth:\nIt would appear that this desk also fell victim to the fire.\nKay:\nBut it doesn't look too damaged... Ooh, I think we can riffle through this drawer a bit!\nEdgeworth:\nHmm... I suppose we really should take a look.\n\n\n\nExamine\n\n\n\n\n\n\n\n\n\nPen with paper\n\n\n\n\n\n\n\nEdgeworth:\nIt seems that the contents of this drawer survived the fire rather well.\nKay:\nNow THAT'S a sturdy desk! I guess that's the value of solid wood construction. Let's see if there's anything useful left in here, Mr. Edgeworth!\n\n\n\n\nOrange paper\n\n\n\n\n\n\n\nEdgeworth:\nThis is a rather unusual shape for a notepad. I suppose this must be another souvenir from somewhere.\n\n\n\n\n\nDeduce orange paper\n\n\n\n\n\n\n\nEdgeworth:\n(Is this spot somehow connected to any of the evidence I hold...?)\n\n\n\nPresent DeMasque II's Note\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"The shape of this notepad... matches the shape of this note we found.\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nIt would appear that this piece of evidence is related.\nKay:\nTo what exactly...?\nEdgeworth:\n(Alright, so perhaps it wasn't related after all.)\nKay:\nOh, wait! Don't tell me...! Is it something that thieves can't see...?\nEdgeworth:\nHmph... Why don't we say that's it, and move on?\nKay:\nI was just joking you know, Mr. Edgeworth! It's just my way of saying that when you make a mistake, you should just admit to it!\nEdgeworth:\nArngh! (It appears that she noticed after all... I really should carefully re-examine this area for clues.)\nLeads to examination of desk\n\n\nEdgeworth:\nThe shape of this notepad... matches the shape of this note we found.\nKay:\nHey, you're right! What is it? It looks like something straight out of Monument Valley!\nPalaeno:\nAh, yes, that notepad is a souvenir from somewhere in your country. We've been collecting them for the purpose of studying them, you see.\nEdgeworth:\nYes, I do. You do seem to be quite passionate about it...\nPalaeno:\nOh, would you like to see MY souvenir collection? I'd love to show it to you!\nEdgeworth:\n(Are you sure they haven't been burnt to a crisp by the fires...?) Ambassador Palaeno, I wonder if you might recognize the handwriting on this note?\nPalaeno:\nHmm... This... looks like Manny's handwriting.\nEdgeworth:\nI see. In that case...\nKay:\nOoh, did you figure something out?\nEdgeworth:\nThis note was found in Allebahst... ...specifically, it was found being firmly grasped by the murdered DeMasque II!\nKay:\nDeMasque II!? Then this note...!\nEdgeworth:\nYes, it was a request from Mr. Coachen for DeMasque II to steal the Primidux Statue.\nPalaeno:\nWhat!? Manny... tried to steal Allebahst's Primidux Statue?\nEdgeworth:\nWe would know for sure if we could run a handwriting analysis. Ambassador! Do you have any documents that were handwritten by Mr. Coachen?\nPalaeno:\nY-Yes, I can gather a few and give them to you.\nEdgeworth:\n(I'll have to ask Detective Gumshoe later to run the analysis.)\nPalaeno:\nI can't believe that Manny... would even think of doing something like this...\nEdgeworth:\nDo you have any idea as to why he would've requested the theft of the statue?\nPalaeno:\n...There is one possibility, but mind you, it's just my personal speculation.\nEdgeworth:\nAnything you can tell me would be of great help, Ambassador.\n\n\n\n\n\nDesk (subsequent times)\n\n\n\n\n\n\n\nEdgeworth:\n(I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\n\nDesk (after examining ink and correctly deducing orange paper in desk)\n\n\n\n\n\n\n\nEdgeworth:\n(I already checked this area earlier, but it never hurts to take another look.)\n\n\n\n\nFireplace\n\n\n\n\n\n\n\nEdgeworth:\nA fireplace, huh...? So Babahl's offices have them, too.\nKay:\n\"Too\"...?\nEdgeworth:\nThere is a fireplace in relatively the same location in the Allebahstian office. However, we found something there that I'd rather not recall ever again. (I still can't believe that we found that lady's undershirt in the fireplace.)\nKay:\n...? If it was that traumatizing, why don't you try creating new memories with this fireplace? You could climb inside, and we can play hide and seek!\nEdgeworth:\n...And come out covered in soot? I think not.\nKay:\nArgh! You really have no sense of fun, Mr. Edgeworth!\n\n\n\n\nSafe\n\n\n\n\n\n\n\nEdgeworth:\nThis safe wasn't open at the time of the fire.\nKay:\nYou could tell because the inside wasn't burnt, right?\nEdgeworth:\nYes, and thanks to this safe's fire resistance, the smuggling evidence was preserved.\nKay:\nAren't safes great!? They always hold the wonderful promise of treasures within!\nEdgeworth:\n(Well, this one certainly did have a few inside...)\n\n\n\n\nBody outline\n\n\n\n\n\n\n\nEdgeworth:\n(It appears that Mr. Coachen's body has been taken in for an autopsy. The white outline is all that is left to tell the tale of his murder.)\n\n\n\n\nBurnt pile near safe\n\n\n\n\n\n\n\nEdgeworth:\nAmbassador Palaeno, what exactly used to be here?\nPalaeno:\nThat used to be a stack of brand-new pamphlets. But it looks like they were all burned up. I guess we'll just have to reprint them. But no matter how fast we reprint them, they always disappear so quickly.\nEdgeworth:\nIs the Babahlese tourism industry really that hot right now?\nPalaeno:\nOf course! Although, recently, the most popular vacation destination has been the Republic of Borginia. But we refuse to lose to them, so we've been hard at work promoting Babahl!\nEdgeworth:\nInteresting. Well, I've just recently returned from a trip to Borginia myself.\nPalaeno:\nOh? And how did you like it?\nEdgeworth:\n...I-It was alright. (I probably shouldn't bring up the fact that I was a suspect on the flight home.)\n\n\n\n\nButterfly on wall\n\n\n\n\n\n\n\nEdgeworth:\nThe national symbol of Babahl is drawn here. There's nothing especially strange about it.\nKay:\nIs it just me, or did the butterfly gain an antenna since we last saw it?\nEdgeworth:\nEven if it did, would it really have any bearing on our case, Kay?\n\n\n\n\nBroken ceiling fan\n\n\n\n\n\n\n\nEdgeworth:\nIt's the charred remains of a fallen ceiling fan.\nKay:\nOh! I've seen a few of these before! They spin around and around, and play music!\nEdgeworth:\n...I believe you're thinking of a musical mobile for babies.\nKay:\nYes, that's it!\nEdgeworth:\nBut they're nothing alike.\nKay:\nThey're totally alike! They spin those babies right round, like a record!\nEdgeworth:\nI... see... I guess I can see how you might think that...\n\n\n\n\nGolden statue\n\n\n\n\n\n\n\nEdgeworth:\nSo this is the real Primidux Statue...\nKay:\nThis... is really valuable, right?\nEdgeworth:\n...That's what they say.\nKay:\n.........\nEdgeworth:\n\nEdgeworth:\nKay! You're not seriously considering the theft of this statue, are you...?\nKay:\nNo way, Mr. Edgeworth! I wasn't thinking about anything like that! I was just calculating, in my head, how much the statue is worth.\nEdgeworth:\n(Hmm... That sounds mighty suspicious to me.)\n\n\n\n\nKnife rack\n\n\n\n\n\n\n\nEdgeworth:\n(We still don't know where the blade of the Babahlese knife went. Could it be that the killer walked away with it...?)\n\n\n\n\nShelves\n\n\n\n\n\n\n\nKay:\nIt looks like all of the souvenirs suffered some damage from the fire. I just don't believe it! Murder on top of arson!? What a disgrace to the name of the Yatagarasu!\nEdgeworth:\nThe fake Yatagarasu is guilty of much more than just theft, it seems.\nKay:\nI know! Because if it were me, my first priority would've been to loot this bookshelf!\nEdgeworth:\nYou would steal ordinary souvenirs that you can buy virtually anywhere?\nKay:\nYou can't buy them anywhere! Each one is specific to a location and has its own value! And items that have memories attached to them are the most valuable of all!\nEdgeworth:\nBut could you really rob someone of their valuable memories, just like that...?\nKay:\n! ...N-No! Because even if I take the souvenir, I can't take the owner's memories!\n\n\n\n\nBurnt objects by clock\n\n\n\n\n\n\n\nEdgeworth:\nAmbassador Palaeno, would you happen to know what these charred remains are of?\nPalaeno:\nHmmmmmmmm... I don't know, actually. But I don't think there was anything there that should've been flammable.\nEdgeworth:\n(And so it remains a mystery to what was burned here...)\n\n\n\n\nGrandfather clock\n\n\n\n\n\n\n\nEdgeworth:\nHmm... A grandfather clock. This one resembles the one in Allebahst.\nPalaeno:\nOh, that clock has been with us since back when we were still Cohdopia.\nKay:\nThat is one big clock! Hey, does this one have a bird that pops out like a cuckoo clock?\nPalaeno:\nHa ha... I'm sorry, but no. Oh, but I'm sure you'll love its chime!\nKay:\nReally!? It's going to be 11 soon, so maybe I'll get to hear it then!\nEdgeworth:\nIs it that time already? Time sure flies by when I'm involved in an investigation.\nKay:\nOh, it's not that late. The night's only just begun!\nEdgeworth:\n...Kay, it's not good for you to stay up late, you know.\nKay:\nYes, gramps!\nAfter clearing all Talk options with Colias Palaeno:\nGumshoe:\nOh! Here you are, Mr. Edgeworth!\nEdgeworth:\nDetective Gumshoe, have you collected the information that I requested?\nGumshoe:\nYup! Got it all right here, sir! Here you go, Kay. Feel free to take a look! It's for you, after all.\nKay:\nWhat is all this, Gummy...?\nGumshoe:\nIt's all the information on this room that I got from the Embassy and Interpol people. Now we know exactly how this room was before and after the fire!\nEdgeworth:\nGood work, Detective.\nGumshoe:\nAww, it was nothing, sir! I'm an expert at getting people to talk!\nKay:\nWow... You two remind me so much of my father and Uncle Badd...\nEdgeworth:\nWhat do you mean?\nKay:\nAs prosecutor and detective, your dynamic is just like theirs back in the day.\nEdgeworth:\n.........\nKay:\nWell, don't you worry! I'm going to find my own wonderful partner someday! And when I do, I'm going to become a good Yatagarasu, just like my father, right?\nEdgeworth:\nEdgeworth:\nPlease don't ask me questions to which I have no answers to, Kay. However, I can say that is truly a wonderful thing to find a partner you can trust.\nKay:\nHeh heh, you bet! So, what now, Mr. Edgeworth?\nEdgeworth:\nWell... I'd like to ask you for a favor.\nKay:\nYes?\nEdgeworth:\nThat gadget... Mr. Thief, is it? That thing you call your secret weapon.\nKay:\nOh, you mean \"Little Thief\"! Heh, you're coming to rely on it, aren't you?\nEdgeworth:\nEdgeworth:\nI-I don't need a crutch like that! I'm only asking because I need it for the investigation! From the information Detective Gumshoe gathered, and the ambassador's testimony... ...I'd like you to please re-create this room as it was during the third floor fire.\nKay:\nYou got it! Alright, here we go! Dark skies of evening, when no other bird dares take wing, one alone remains all-seeing! Now, witness the true power of a real, modern-day Robin Hood!\nEdgeworth:\nIt seems there are other things besides what the ambassador mentioned that have changed. It's possible that we might find the escape route the person Kay saw used as well.\nPalaeno:\nOooh! Wh-What is this? Is it some sort of light show I was not told about?\nKay:\nThis is the power of a true vigilante! It's re-creating the room with the info I inputted!\nPalaeno:\nReally!? That is certainly one interesting device you have there, Ms. Faraday!\nEdgeworth:\nAhem. I believe it's about time we returned to our investigation.\nTalk\n\n\n\n\n\n\n\n\n\nDick Gumshoe\n\n\n\n\n\n\n\nEdgeworth:\nDetective, you took part in the initial Babahl investigation, correct?\nGumshoe:\nYup, sure did! I also helped put out both fires, sir! But that first fire took me by surprise! I had a tough time escaping the fifth floor. First, I tried the elevator, but I guess someone else had the same idea 'cause it was in use. If I hadn't remembered to use the stairs at that point, I'd have been burnt to a crisp!\nPalaeno:\n\nPalaeno:\nWait! That's odd... We always warn our staff that in the case of a fire, it's dangerous to use the elevator.\nEdgeworth:\nOh...?\nKay:\nMaybe someone rode it in a fit of panic?\nEdgeworth:\nDetective, did you see the \"Yatagarasu\" that came into the Babahlese Embassy at all?\nGumshoe:\nI didn't personally... ...and the other staff members told me they never got a good look at the person, either, sir.\nEdgeworth:\nHmm... I wonder if you could tell me a bit more about what you discovered, Detective?\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nDuring the fire\n\n\n\n\n\n\n\nGumshoe:\nThe second fire broke out around the time the Yatagarasu was spotted in Allebahst. That's also when a suspicious person was spotted in Babahl, which caused some panic.\nEdgeworth:\n\nEdgeworth:\nSo no one was able to get a good look at this \"Yatagarasu\" that entered Babahl?\nGumshoe:\nYeah. All they saw was a mysterious person wearing a long coat. But that's not enough to make a positive ID, you know?\nEdgeworth:\nStill, it was enough to make the people who received the calling card panic even more.\nKay:\nA person in a long coat... Sounds like the exact same person I saw...\nEdgeworth:\nThe Yatagarasu that appeared in Allebahst was proven to be just a fabrication, a shadow. In light of that fact, the Yatagarasu that appeared in Babahl is also suspect.\nKay:\nYou can't be serious! Not when we're this close to capturing the fake... I mean, Calisto Yew...!\nEdgeworth:\n(So the Yatagarasu appeared, caused mass confusion, killed Mr. Coachen, then disappeared.)\n\n\n\n\nWhat you saw\n\n\n\n\n\n\n\nEdgeworth:\nBy the way, Detective, why did you not chase after the Yatagarasu?\nGumshoe:\nI-I did! But, well... this embassy is huge, sir! I got separated from the other staff members I was with, and was lost for a while there...\nEdgeworth:\n\nEdgeworth:\nYou didn't even memorize the layout of the building you were to guard, Detective!?\nGumshoe:\nEeeeek! I'll be sure to do that from now on, siiiiir! But you know, it was thanks to me being lost that I was able to come to Kay's rescue!\nEdgeworth:\nOh? Is that a fact?\nGumshoe:\nYeah! It was when I was lost and wandering around in the third floor hallways, sir! When I heard a scream, I headed towards it right away!\nKay:\nOh! That's probably from when I found Mr. Coachen's body!\nGumshoe:\nYeah. I thought it sounded like her, so I got real worried and ran as fast as I could!\nKay:\nAnd it was thanks to Gummy that Ms. Shih-na wasn't able to take me away! He covered for me until you got here, Mr. Edgeworth!\nEdgeworth:\nOh? I see. (So he CAN be useful once in a blue moon.)\nGumshoe:\nStill, it's too bad that Agent Shih-na got here before I did.\nEdgeworth:\nHmm... I wonder where Agent Shih-na was before you found her here?\nGumshoe:\nWell, just before I got to this room, I saw her coming out of the room next door (Shih-na's location - She was in the room next to Mr. Coachen's office up until she tried to arrest Kay.).\nEdgeworth:\nAgent Shih-na mentioned something about chasing the Yatagarasu herself earlier.\nGumshoe:\nWell, she apparently helped in putting out the first fire. Then during the second fire I heard she was busy chasing the Yatagarasu.\nEdgeworth:\nShe seems to be a very dedicated agent. You would do well to learn from her.\nGumshoe:\nWhy are you pointing at me when you say that, sir...?\n\n\n\n\n\nPresent\n\n\n\n\n\n\n\n\n\nFires in Babahl\n\n\n\n\n\n\n\nGumshoe:\nThose were some fires, sir. And we don't exactly have the manpower to fight it ourselves when they're THIS bad. So about the only thing we could do was to try and catch the arsonist. I feel so helpless thinking about it. I mean, we can't prevent this sort of thing. We can only do something after it's happened...\nEdgeworth:\nAt least it's better than doing nothing. ...Isn't that right, Detective Gumshoe?\nGumshoe:\n...I guess so, sir.\nExamine\n\n\n\n\n\n\n\n\n\nFlames\n\n\n\n\n\n\n\nLeads to:\n\"These must have been the large green flames Ambassador Palaeno saw.\"\n\n\n\n\nChair\n\n\n\n\n\n\n\nEdgeworth:\nThat looks like a very comfortable chair.\nKay:\nWell, it doesn't look all that broken, so why don't you try sitting in it?\nEdgeworth:\nNo, I'd better not. It's very important that we preserve the crime scene at all times.\nKay:\nWait, but you're always touching all sorts of things at crime scenes!\nEdgeworth:\nThat's because I am a prosecutor, and it's a part of my job to examine things.\nKay:\nAnd my job is to be a Great Thief!\nEdgeworth:\nWhich is exactly why you are not allowed to touch anything.\n\n\n\n\nDesk\n\n\n\n\n\n\n\nEdgeworth:\nIt appears that the desk is largely unchanged from before the fire.\nKay:\nYeah, it just got a little burnt, that's all.\nEdgeworth:\nIt's a very fine desk. I'm sure that even now it's still usable.\nKay:\nIf it's that great, why don't you trade your desk with it?\nEdgeworth:\nNo.\nKay:\nIt was just a suggestion! You didn't have to get all mono-syllabic on me, you know!\n\n\n\n\nPamphlets\n\n\n\n\n\n\n\nKay:\nSo, Babahl is really into pushing their tourism industry, huh?\nEdgeworth:\nYes, it would appear that way.\nKay:\nYou know, I'd really love to take a trip. Hey! Why don't we take one after this case!?\nEdgeworth:\n...Do you already have a destination in mind?\nKay:\nHmm... Well, ideally, I'd like to go someplace where I can continue my thief training!\nEdgeworth:\nWell, if you want to learn the fine art of stealth... ...perhaps you should visit the studio where they make the Jammin' Ninja TV show.\nKay:\nHey! That's actually a really great idea, Mr. Edgeworth!\nEdgeworth:\n(...I can't believe she took me seriously.)\n\n\n\n\nGolden statue\n\n\n\n\n\n\n\nKay:\nSo, by this time, the Primidux Statues had already been swapped, right?\nEdgeworth:\nThey must have been, as this one is covered in soot.\nKay:\nWhat lousy timing! And just as the two countries were about to become friends again, too! It would've been better if I had stolen it than for it to get caught up in that fire...\nEdgeworth:\nKay, I think I understand your sentiment...\nKay:\n...\"However, if you were to engage in theft, I can't look the other way\"... right?\nEdgeworth:\nIf you could please stop stealing my lines!\n\n\n\n\nKnife rack\n\n\n\n\n\n\n\nKay:\nIt looks like one of the Babahlese knives was already missing before the fire began.\nEdgeworth:\nSo it would seem. Especially since the other two knives' handles were burned away.\nKay:\nThe remaining handle was swapped out with the handle from the real murder weapon... ...and Babahl's national treasure was stolen. Poor Babahl, don't you think!?\nEdgeworth:\nI'm not sure I would lump the replica statue in with the rest of Babahl's woes...\n\n\n\n\nGrandfather clock\n\n\n\n\n\n\n\nEdgeworth:\nThis grandfather clock... It was apparently in a different position before the fire.\nGumshoe:\nAccording to staff members, the clock was flush against the wall before the fire, sir.\nEdgeworth:\n(Which means that, most likely, it was moved by someone during the fire.)\nKay:\nSpeaking of which, it's totally 11 o'clock now, but I don't hear any chiming...\nPalaeno:\nHuh? That's odd... It was still chiming right on the dot of every hour this morning. Maybe the fire damaged its internal mechanisms or something...?\nEdgeworth:\nAmbassador Palaeno, may we take a look inside that clock?\nPalaeno:\nSure, go right on ahead.\nEdgeworth:\nDetective Gumshoe, if you could please inspect the insides of this clock.\nGumshoe:\nYes, sir! I'm on it!\n\n\nGumshoe:\nMr. Edgeworth! I found this inside, sir!\nEdgeworth:\nIt... looks like a length of wire. So this is what caused the clock to stop chiming. But what was a long length of wire doing inside this clock in the first place?\nWire data jotted down in my Organizer.\nPalaeno:\n*sigh*... Why would someone do this... to such a valuable clock?\nKay:\nIt sounds like it wasn't Mr. Palaeno that put the wire in there.\nEdgeworth:\nThen perhaps it was Mr. Coachen's killer who did!\nPartner\n\n\n\n\n\n\n\n\n\nTalk\n\n\n\n\n\n\n\n\n\nLittle Thief\n\n\n\n\n\n\n\nKay:\nReady for a review on how to use Little Thief!? OK, here we go! Objects outlined in yellow are things that are not present in our time, but were in the past. Things outlined in a dotted line are things that exist now, but didn't in the past.\nEdgeworth:\nI see...\nKay:\nYou can examine and interact with replicated people and objects as you normally do. You can even present evidence whenever you find an inconsistency. Oh, and be sure to point out mistakes in the re-creation with evidence, too!\nEdgeworth:\nI think I remember now. Thank you for the refresher course, Kay.\nKay:\nIf there's something you don't get about Little Thief, feel free to ask anytime, OK?\n\n\n\n\nThe investigation\n\n\n\n\n\n\n\nKay:\nI've inputted all of the info we got from Gummy and Ambassador Palaeno! With this re-creation, you should be able to tell what changed because of the fire! Come on, Mr. Edgeworth! Let's try investigating this room one more time!\nEdgeworth:\nYes, let's. (In order to find out what truly happened here in this room... ...we will need to gather more information from this room. It's time to take another look.)\n\n\n\n\nNotice anything?\n\n\n\n\n\n\n\nKay:\nLooks like it was quite the fire, huh?\nEdgeworth:\nYes, it appears that the flames spread fairly quickly to some of the other rooms as well.\nKay:\nYeah, but thanks to Gummy's info, I was able to re-create this room! Plus, the burnt stuff is still lying around, so you can check those as well!\nEdgeworth:\n(The state of this room before and after the fire... I can probably obtain some new information by comparing the differences. Yes, that's what I'll do, and use any new information to complete my logic!)\nAfter examining flames:\nEdgeworth:\nThese must have been the large green flames Ambassador Palaeno saw.\nKay:\nWith flames like these, it's no wonder he couldn't get in!\nEdgeworth:\nKay, by the time you came into this room, had the fire already been put out?\nKay:\nYeah, the fire had died out or something by that time.\nEdgeworth:\nThen this fire in here only burned from the time the fire started on the third floor... ...until the Yatagarasu appeared and caused a stir in Babahl, I suppose.\nKay:\nI guess Mr. Palaeno was just lucky enough to run into this fire as it was burning, huh?\nEdgeworth:\nYes, you could put it that way. And since you were the first to discover the body... ...we can assume that no one else entered the room until that time. No one other than the person you were chasing, of course.\nKay:\nI knew it! That person I saw was definitely up to no good! I mean, that person could even be Mr. Coachen's killer!\nEdgeworth:\nThat is very likely to be the case. After all, that person came into this room before you... ...and must have chosen this room precisely because they knew no one would be in here.\nKay:\nOK, then maybe the green fire was where it was to prevent anyone from coming in? But then, what did the person set on fire to make the green flames?\nEdgeworth:\nHmm... Well, whatever it is that person burned, it made a rather sizable fire.\nKay:\nAnd since the fire's green... well, we've seen something that burns green, right!? It's a bit tinier than these flames, but you get what I mean.\nEdgeworth:\nYes, and I do believe that what you are thinking is exactly why these flames are green. Which fire-related piece of evidence burns the same color as these green flames?\nPresent Silhouette Lantern\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"This silhouette lantern... Its green flame comes from the whitcrystal oil it's burning.\"\nPresent anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThe source of the green in these flames is related to this!\nKay:\nOh, really? Well, I don't think they're related at all.\nEdgeworth:\nO-Oh... .........Sorry. It really isn't related, after all...\nKay:\nHey! You honestly apologized this time for being wrong!\nEdgeworth:\nWhat!? I-I'm always honest!\nKay:\nAnd that's a good thing! Now, just keep on doing it!\nEdgeworth:\n(Arngh... I-I need think about this a bit more carefully... If I stay calm, the answer should come to me. This green flame... it's the same as that other flame!)\nLeads back to:\n\"Which fire-related piece of evidence burns the same color as these green flames?\"\nEdgeworth:\nThis silhouette lantern... Its green flame comes from the whitcrystal oil it's burning.\nKay:\nYeah! That's the fire I was thinking of, too! I love the green it gives off.\nEdgeworth:\nI think we've now established that the green flames were caused by whitcrystal oil. Furthermore, we know that there is only one other thing made from whitcrystal oil.\nKay:\nOh! You mean that thing Mr. Palaeno was mistaken about, right!?\nEdgeworth:\nYes, precisely... as we found out earlier in our investigation.\nGumshoe:\nUm, what? I don't get it. Can you fill me in, sir!?\nEdgeworth:\nFine, I suppose. I'll explain it in a way that even you can understand. This is the thing made from whitcrystal oil that Ambassador Palaeno was mistaken about!\nPresent Babahlese Ink\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Babahlese ink is made from whitcrystal oil.\"\nPresent anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nKay, this piece of evidence...\nKay:\n...Is not needed anymore, right? Good, then I'll go throw it out for you!\nEdgeworth:\nN-No, wait!\nKay:\nHuh? But why? I'm sure this piece is completely unnecessary... I mean, it didn't have anything to do with what we were talking about, after all!\nEdgeworth:\nW-Well, either way, can I have it back for now? (It would appear that I was the one who was mistaken this time... I need to think carefully about this one more time. Something made of whitcrystal that is still here in this very room... ...and that something is this!)\nLeads back to:\n\"This is the thing made from whitcrystal oil that Ambassador Palaeno was mistaken about!\"\nEdgeworth:\nBabahlese ink is made from whitcrystal oil.\nGumshoe:\nOhhhh! So, it should burn the same color as the flames in the lantern, right!?\nEdgeworth:\nYes, precisely. However, the green flames in this room were not from a bottle of Babahlese ink.\nKay:\nBecause we found the ink Mr. Coachen used on his desk, right!?\nEdgeworth:\nYes. However... we know that Mr. Coachen was smuggling the ink in massive quantities. Now, what do you suppose he made using all that ink? I believe what he made with that ink is the answer to what gave birth to the green flames.\nKay:\nOh, yeah! I'm beginning to really feel the energy coming from you, Mr. Edgeworth!\nEdgeworth:\n(Heh... It would appear that I've finally found it, the smuggling ring's real goal!) Made of Babahlese ink, this is the source of the green flames!\nPresent Counterfeit Bills\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"What would consume that great of a volume of ink to make...?\"\nPresent anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nIn order for the green flames to arise, this piece of evidence was needed!\nKay:\nHa ha! And how did the arsonist use that, exactly? Oh, I know! Why don't we try lighting on fire and seeing what happens? I'm sort of an expert in pyrotechnics, so you just leave it to me!\nEdgeworth:\nH-Hold on there! (She was really all set to light it on fire...! It's a good thing this piece is related to the case, or it'd have gone up in smoke... I need to think carefully about this one more time. The real source of the green flames... It must be this!)\nLeads back to:\n\"Made of Babahlese ink, this is the source of the green flames!\"\nEdgeworth:\nWhat would consume that great of a volume of ink to make...? That would be... ...the counterfeit bills that the smuggling ring made and are circulating in Zheng Fa.\nKay:\nYou're kidding!? You're saying that it was Mr. Coachen who made the counterfeit bills...?\nEdgeworth:\nI am. I believe you could even go so far as to say that he \"stole\" Babahl's printing press. Ambassador, Mr. Coachen had permission to freely use the printing press, correct?\nPalaeno:\nWhy, yes. And I do remember seeing him use it in the middle of the night... ...but never did I think he was using it for such a foul deed...!\nEdgeworth:\nAmbassador! Because of your secretary's crimes, you will need to be investigated as well!\nPalaeno:\nAh, yes, I suppose so. We've caused a bit of trouble for a few countries, haven't we?\nEdgeworth:\nIt's my duty to search out all who shielded Mr. Coachen and concealed his crime. For they are the ones who started the fire in order to destroy the evidence!\nCounterfeit Bills data updated in my Organizer.\nExamine\n\n\n\n\n\n\n\n\n\nFlames\n\n\n\n\n\n\n\nEdgeworth:\nSo the source of this green fire was Babahlese ink... And it was Babahlese ink that Mr. Coachen was smuggling in mass quantities. Clearly, the culprit started the fire to burn away the proof of that smuggling activity!\nAfter clearing \"What you saw\" Talk option with Dick Gumshoe and examining grandfather clock:\nEdgeworth:\n(We've examined everything in this office, but there is one thing that bothers me. Perhaps I should ask Ambassador Palaeno about it.) Ambassador Palaeno, there is something I'd like to ask you about.\nPalaeno:\nYes?\nEdgeworth:\nAbout this office, it appears, to me, to be very similar to Ambassador Alba's office. For example, the location of the fireplace and the position of the grandfather clock.\nPalaeno:\nAh, that's right. You've also paid a visit to the Allebahstian side of the embassy. Our two embassies actually used to be one.\nEdgeworth:\n(Yes, I know. Even the pamphlet mentioned that.)\nPalaeno:\nWhich is why the building is bilaterally symmetrical (Bilateral symmetry - Because this used to be one embassy, offices on the two sides are symmetrical.). So no matter which room, the location of the fireplace and the like are exactly the same. Even where the art is located is the same. As my room is currently under renovation... ...we worked hard to make Manny's room look like the ambassador's office.\nKay:\nYou mean for your hand shake photo op with the Jammin' Ninja?\nPalaeno:\nYes, that's right. I mean, what's a photo like that worth if it's not taken in the ambassador's office right?\nEdgeworth:\n(Yet another odd expression of Babahl's obsessively competitive spirit with Allebahst, I take it?) Thank you, Ambassador. That piece of information is all I needed to connect the dots.\nPalaeno:\n? ...Connect what dots? Well, anyway, I'm glad I was able to be of some help.\nLogic\n\n\n\n\n\n\n\n\n\nConnect \"Connected fireplaces\" and \"Bilateral symmetry\"\n\n\n\n\n\n\n\nLeads to:\n\"The Allebahstian and Babahlese sides of the building are symmetrical to each other.\"\nEdgeworth:\nThe Allebahstian and Babahlese sides of the building are symmetrical to each other. As we know that to be a fact, then this room's fireplace may also hide a secret passageway.\nKay:\nA secret passageway?\nEdgeworth:\nIn Allebahst, the fireplace turned out to have a revolving back wall.\nKay:\nA revolving wall!? It sounds like something out of a ninja house!\nGumshoe:\nWow, there was a trick like that built into the fireplace, sir!?\nPalaeno:\nWhat!? Th-This embassy holds THAT kind of secret!?\nEdgeworth:\nThere seems to be a lot about this room that you don't know about, Ambassador...\nPalaeno:\nI guess it's time to pay the bill for letting Manny do so much work for me. Please, I really want to know about the real Manny and what you know about this room.\nKay:\nWhat are you waiting for, Mr. Edgeworth!? Let's get to the bottom of this!\nEdgeworth:\nAgreed. And my first thought is that it's likely the killer used the revolving fireplace (Revolving fireplace used? - It's possible someone used the revolving fireplace wall. I need to examine it more.).\nKay:\nIt looks like just another fireplace, though, doesn't it? So, how do you turn it again?\nEdgeworth:\nIn Allebahst, I had to push where the X was on the far wall of the fireplace.\nGumshoe:\nOh! I see an X back there, sir! Let's see what happens when I push it...\nEdgeworth:\nGumshoe:\nAaaaah! You scared me, sir!\nEdgeworth:\nThere is something about this fireplace that lies in contradiction to the facts.\nKay:\nHuh? But we found an X where you thought there'd be one, right?\nEdgeworth:\nWe did, but that's not what I was referring to. Something is missing from this scene. (What does this contradiction mean for us...?)\nLeads to examination of fireplace\nExamine\n\n\n\n\n\n\n\n\n\nFireplace\n\n\n\n\n\n\n\nEdgeworth:\n(I won't rest until I've inspected every suspicious-looking nook and cranny.)\n\n\n\nExamine\n\n\n\n\n\n\n\n\n\nX mark\n\n\n\n\n\n\n\nEdgeworth:\nIf we push this X mark, the fireplace wall should turn.\nGumshoe:\nA revolving fireplace wall! That's neat, sir!? We should hurry up and...!\nEdgeworth:\n\nEdgeworth:\nWait, Detective! There is something we need to examine about this first. Besides which, there is also something I'd like to test.\nGumshoe:\nLike what, sir?\nEdgeworth:\nI'll tell you later, Detective. For now, let's continue with the investigation.\n\n\n\n\nLogs\n\n\n\n\n\n\n\nEdgeworth:\nAll I see inside this fireplace is starter wood.\nKay:\nHuh? That's odd. It doesn't match up with what Mr. Palaeno said earlier.\nEdgeworth:\n(What is the meaning of this contradiction...?)\n\n\n\n\n\nDeduce logs\n\n\n\n\n\n\n\nEdgeworth:\n(Is this spot somehow connected to any of the evidence I hold...?)\n\n\n\nPresent Amb. Palaeno's Testimony\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Ambassador Palaeno, you said that you burned some old files in this fireplace today, correct?\"\n\n\n\n\nPresent anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThis points out exactly what is so contradictory about the fireplace as it currently is!\nKay:\nAnd what exactly is that?\nGumshoe:\nAw, it's OK if you don't see it, Kay! I don't really get it either, but I figure it's just too splendid for me to understand! So come on, Mr. Edgeworth! Why don't you tell us what exactly is so contradictory?\nEdgeworth:\nU-Umm......... (I can't exactly admit to being wrong if Detective Gumshoe is the one asking...)\nKay:\nCome on, Mr. Edgeworth! My youth only lasts for so long, you know?\nEdgeworth:\nYes, well... Let's take another look at the fireplace first, shall we?\nLeads to examination of fireplace\nEdgeworth:\nAmbassador Palaeno, you said that you burned some old files in this fireplace today, correct?\nPalaeno:\nYes, I burned quite a few files this morning, actually.\nEdgeworth:\nAnd after you did, you forgot to clean out the ashes from the fireplace, correct?\nPalaeno:\nTh-That's right. But why are you asking? And why are you making such a scary face...?\nEdgeworth:\nI'm sorry, I admit I am a bit intimidating when I'm serious. ...In any case! Take a good look at this fireplace, and tell me what you find odd about it.\nPalaeno:\nLet's see... Huh? Where did all the ashes go...? (Missing ashes - The ashes that should still be in the fireplace are missing. Where did they go...?)\nKay:\nWhat is the meaning of this, Mr. Edgeworth!?\nGumshoe:\nYou don't really think... that Ambassador Palaeno is lying, do you?\nEdgeworth:\nNo, there is no reason for him to lie. And I don't believe his testimony is wrong, either. It is the fireplace that is causing the contradiction. Kay, I wonder if you might update the fireplace data for me.\nKay:\nYou got it! I'll add in the ashes from the burnt files and...\nKay:\nSounds like we've pretty much figured everything out now, huh!?\nEdgeworth:\nHmph... Well, it was nothing. All I did was follow where our leads led us.\nKay:\nOh, I sense it coming on! You're about to dazzle us again, right!?\nGumshoe:\nOh, you mean that!? Well, it's what Mr. Edgeworth is known for, you know!\nEdgeworth:\n...There is really no need for you two to dance around the name of what I'm about to do.\nExamine\n\n\n\n\n\n\n\n\n\nFireplace\n\n\n\n\n\n\n\nEdgeworth:\n(I already checked this area earlier, but it never hurts to take another look.)\n\n\n\nAshes\n\n\n\n\n\n\n\nEdgeworth:\nThe ashes Ambassador Palaeno left here have disappeared. If we follow where this piece of information leads, we should begin to see the truth.\nKay:\nIt's time to use your secret weapon, right!?\nGumshoe:\nYeah! Go on, sir! Use your special skill!\nEdgeworth:\nI'll ignore your strange phrasing for now, and focus on the information we have instead. (Just a little further... I can sense the truth lying on just the other side of this!)\nLogic\n\n\n\n\n\n\n\n\n\nConnect \"Revolving fireplace used?\" and \"Missing ashes\"\n\n\n\n\n\n\n\nLeads to:\n\"The reason as to why the ashes are missing is simple.\"\nEdgeworth:\nThe reason as to why the ashes are missing is simple.\nKay:\nIt's not because someone cleaned them up, right?\nEdgeworth:\nNo, because even if someone did sweep them up, the fireplace is too clean for that. Ambassador Palaeno said that he spilled some Babahlese ink while he was burning the files. And yet, there is not a trace of the spilled ink on the back wall anywhere!\nKay:\nWell then, I don't know what happened.\nEdgeworth:\nWell, I'll tell you what happened. The two sides were switched. By using the revolving fireplace wall, the ashes were moved into the neighboring room. Which means that this is a clear indication that the fireplace was used!\nRevolving Fireplace Wall data jotted down in my Organizer.\nKay:\nThen, you mean... the person I was chasing... ...disappeared from this room through there...?\nEdgeworth:\nYes, I believe the person you were in pursuit of is Mr. Coachen's killer. And after committing the murder, escaped through the fireplace (Escaped through revolving fireplace - The person Kay was chasing used the fireplace to escape into the room next door.)!\nKay:\nWow, Mr. Edgeworth! You figured out the killer's escape route!\nEdgeworth:\n(I have, but this is only the beginning. Now we have to chase the killer down!)\nLogic\n\n\n\n\n\n\n\n\n\nConnect \"Shih-na's location\" and \"Escaped through revolving fireplace\"\n\n\n\n\n\n\n\nLeads to:\n\"If the killer used the fireplace in this room to escape into the next...\"\nEdgeworth:\nIf the killer used the fireplace in this room to escape into the next... ...then it's only logical for us to \"talk\" with the person who was in the neighboring room.\nGumshoe:\nWell, the person that was in the next room was... Oh! It was that person, sir!\nEdgeworth:\nYes, Detective... Agent Shih-na.\nInvestigation Complete\nKay:\nIt's looking more and more like Ms. Shih-na is the killer, isn't it?\nEdgeworth:\nLet's not jump to conclusions yet. We need to go through what we know so far. She came running straight into this room from the next one, and instantly accused you. Furthermore, she claimed that it could only have been you that killed Mr. Coachen. I don't have any proof yet, however, I KNOW she is hiding something from us!\nKay:\nOK, then! Why don't we go ask Ms. Shih-na herself!?\nEdgeworth:\nEdgeworth:\nNo, not yet. There's something that needs to be done first. ...Detective Gumshoe!\nGumshoe:\nSir! Is it my turn to do something, Mr. Edgeworth!?\nEdgeworth:\nYes. I have a two-part special assignment for you. First, I need you to run a handwriting analysis on DeMasque II's note.\nGumshoe:\nOK! I'll get the lab boys on that right away!\nEdgeworth:\nSecond, I want you to see if you can fit through the revolving fireplace wall.\nGumshoe:\nR-Right now, sir!?\nEdgeworth:\nNo, next decade... Of course now! We need to test our hypothesis first, don't we?\nKay:\nGo on, Gummy! You can do it!\nGumshoe:\nAlright. I'm gonna do this like a real man! Here I go, through the fireplace and back!\nEdgeworth:\n(You shouldn't need to psych yourself up that much for such a simple task, Detective...)\nGumshoe:\nWow! The wall inside the fireplace really DID turn!\nKay:\nThat's so neat! Now, I wanna try going through there, too!\nPalaeno:\nTh-There really IS a secret passageway through there... I had no idea...!\nEdgeworth:\nHmm... It would appear that the ash really was pushed into the other room. Furthermore, the Babahlese ink you spilled, Ambassador, is there on the back wall.\nGumshoe:\nOK, here I go, sir!\nEdgeworth:\nEdgeworth:\nDetective, I'd like you to go through there under the same conditions as the killer.\nGumshoe:\nHuh? But there's all that ash and stuff...\nEdgeworth:\nAnd your point is? Now, we're short on time, so if you could please hurry on through.\nGumshoe:\nNngh... Y-Yes, sir...\nKay:\nOK! So NOW we pretty much have the whole picture, right!?\nEdgeworth:\nNo, not yet. There remains a few more mysteries to solve... ...such as the Yatagarasu's whereabouts, the other smuggling ring members... ...the two weapons that made it across the border, the key Ms. Yew stole 7 years ago... In fact, we haven't figured out a thing regarding how Ms. Yew is related to these embassies!\nKay:\nMr. Edgeworth...\nEdgeworth:\nA number of pieces connect in a very complicated way in this case... It's almost enough to make one completely mentally exhausted.\nKay:\nWhat are you saying, Mr. Edgeworth!? I thought you were the one who said that it's easy if you follow the leads?\nEdgeworth:\nHmph... Was that supposed to be an impression of me, Kay?\nKay:\nIf it's info gathering you need, Gummy and I can help with that! Then, all you'd have to do is show off your fancy-schmancy logical deductions!\nEdgeworth:\n\"Show off\"...? (Does it seem like I'm being boastful when I do that...?)\nKay:\nLet's not over-complicate matters, OK, Mr. Edgeworth!? We've been so focused, like a laser, on only what seems strange and out of place... ...it's no wonder nothing's clicked and we haven't unlocked anything yet. But, if we think things through calmly, the answer should come to us!\nEdgeworth:\nKay...\nKay:\nThat's the sort of thing I say to myself... ...when I'm practicing how to unlock padlocks, you know!\nEdgeworth:\n...That is something that I hope practice doesn't make perfect, for your sake.\nKay:\nHa ha ha! Yay! Looks like you're back to your straight-laced self again!\nGumshoe:\nHey, Mr. Edgeworth! I'm back, sir!\nEdgeworth:\nYes, I can see that. Good work, Detective.\nGumshoe:\n*cough* *cough* *cough* L-Looks like you can use that fireplace like a door, sir!\nKay:\nAre you alright, Gummy...?\nGumshoe:\nI-I'm OK! It's just a bit of ash and dust, that's all!\nEdgeworth:\nYour jacket has gotten quite filthy. I see the hem has practically turned black.\nGumshoe:\nYeah, well, quite a bit of the unburned ink got on it, sir.\nEdgeworth:\nHmm... I see. Thank you, Detective. You did a fine job. I'll even pay the cleaning bill for the trench coat.\nGumshoe:\nWhat!? Oh, no, sir! I could never! This is just my old coat, sir! If it was [sic] a coat I actually cared about, then I'd get it cleaned, but, you know...\nEdgeworth:\n...? I see. Very well, then. As you wish.\nKay:\nSo because Gummy was able to climb through the fireplace, we know it can be used, right?\nEdgeworth:\nYes, but that's not all we learned. We actually learned one other important fact.\nKay:\nAnd that is...?\nEdgeworth:\nI will have to explain it to you later. Right now, we need to deal with the handwriting analysis. Detective Gumshoe...\nGumshoe:\nYes, sir! I'll be back before you know it!\nEdgeworth:\nThe handwriting analysis on Mr. Coachen's handwriting will take a bit of time. Let us go and wait in the Theatrum Neutralis, along with Agent Lang and Agent Shih-na!\nTo be continued\nMarch 14, 11:33 PM\nTheatrum Neutralis - Lobby\nEdgeworth:\nAgent Lang...\nLang:\nLang Zi says: \"Little cubs, never do they know the real fury of the Elder wolves.\"\nEdgeworth:\n(These quotes are definitely becoming increasingly difficult to decipher...) And what does that mean?\nLang:\nIt means that you'll never really know how angry I can get. Mr. Prosecutor... The counterfeit bills made with Babahlese ink... they were all of Zheng Fa denominations.\nEdgeworth:\nYes, so I heard from Ms. von Karma.\nFranziska:\nBut we don't know where the play money has gone.\nEdgeworth:\n(They must not have figured out that it was all burned yet...)\nLang:\nEver since those things showed up in circulation, my country's economy has taken a big hit. Zheng Fa is in financial chaos as we speak... ...because we can't tell the difference between our own bills and the fakes! But it's not just the money; the citizens are also worried. I've staked the honor of the house of Lang on this... ...and have come to this land to capture the mastermind behind this whole mess. I investigated how the bills were made and how the ink was smuggled into Zheng Fa... ...and I pursued the smuggling ring all the way here. But tonight... this is where the final chapter was written. Despite my frantic efforts to chase the smuggler down, someone got to him first... ...and now I'm called to return home without a single answer!\nEdgeworth:\nAgent Lang, I...\nLang:\nDon't start. It's not your fault. It's not anyone's fault, Mr. Prosecutor. Ambassador Alba, I'm sorry for all the trouble tonight.\nAlba:\nOh, no, no. It is I who should apologize. It was all because I was not strong enough. If only I was able to think of a better solution... Quercus, you fool! Curse your empty brain!\nLang:\nHeh, you're being too hard on yourself, Ambassador. I take full responsibility for tonight, end of story. Shih-na, let's go. Time to return to our den.\nShih-na:\n.........Yes.\nFranziska:\nI don't like to admit it, but there's not much else for us to do but to go home as well.\nEdgeworth:\nAgent Lang! A moment, if you\n???:\nGumshoe:\nYou, Wolf-man and the secretary lady! Hold it! Objection! Pal!\nEdgeworth:\nDetective Gumshoe...! Have you got the results of the handwriting analysis already?\nGumshoe:\nYup, and that note... was definitely written by Mr. Coachen, sir!\nEdgeworth:\nHmm, just as I thought... Good work, Detective.\nDeMasque II's Note data updated in my Organizer.\nLang:\nHey, Mr. Prosecutor... How long do you intend to hold us up for?\nEdgeworth:\nHmph... Sorry to have made you wait, but I believe that now everyone is finally here. Agent Shih-na. I'd like to ask you something, if you don't mind.\nShih-na:\n.........Yes?\nEdgeworth:\nHow exactly did you fail to see the Yatagarasu... ...when you were in the neighboring room to where Mr. Coachen was killed!? I'd like you to explain THAT to us.\nLang:\nWhat...? Hey, Mr. Prosecutor! What are you doing asking her about something she didn't see?\nEdgeworth:\n(Agent Lang hasn't touched the Babahl investigation at all. So I suppose I will need to explain a few things to him first.)\nFranziska:\nMiles Edgeworth... I can't even begin to imagine what's going on in that head of yours.\nEdgeworth:\nThe only thing going on in my head... is the pursuit of the truth!\nFranziska:\nOh? It sounds like you have some sort of plan. Very well, I'll supervise you until the end.\nEdgeworth:\n(*sigh* Is she seriously going to treat me as a subordinate for the rest of the day...?)\nLang:\nYou're not trying to pick a fight with my subordinate on some flimsy guess, are you?\nEdgeworth:\nI'm not trying to \"pick a fight\" and the evidence is hardly flimsy, as you will see.\nLang:\nHah! I should've known... ...that you and I are destined to fight it out to the very end!\nEdgeworth:\nIt would appear that way.\nLang:\nWell, I'll prove her innocence, so let's see what you've got, Prosecutor Edgeworth!\nEdgeworth:\nHmph... With pleasure. (For my opening argument, I'll discuss the Yatagarasu that appeared in Babahl... ...and establish exactly who it was that Kay saw.) Agent Lang. I assume you've been briefed on Kay's testimony?\nLang:\nYou mean the \"suspicious person in a coat\" that she saw?\nEdgeworth:\nThat's right. That person is one of the keys to solving this case. The person who pretended to be the Yatagarasu!\nLang:\n\"Pretended\"? And what do you mean by that!?\nEdgeworth:\nI'll get to that in a second. But first, I want to review what Kay's mystery person did (changed from [second, but first, I want to review what this person Kay saw did] in the original release). Kay, if you could please explain for us what the person you were chasing did (changed from [what the person you were chasing did for us] in the original release)...\nKay:\nOK! You got it! I first spotted the suspicious person near the open-air stage on the Babahlese side. I called out to the person, but as soon as I did, that person ran off. I thought it was rather suspicious, so I immediately gave chase.\nEdgeworth:\nFor the sake of argument, let's call this suspicious person the Yatagarasu. Now, please tell us what happened when you chased the Yatagarasu up to the 3rd floor.\nKay:\nCan do! I chased the Yatagarasu all the way up to the third floor of the Babahlese Embassy. It was a pretty straight chase down the hallway, until the sudden turn. The Yatagarasu disappeared around the corner, so I did my best to catch up. When I turned the corner, I saw the Yatagarasu run into Mr. Coachen's office. I gave chase and ran into the room... But when I entered the room, it was pitch black. I couldn't see a thing. I felt something on the ground next to my foot, so I turned on the light, but then...\nKay:\nAaaaaaaaaaaaaaaaaah!\nShih-na:\n...Who's there!?\nKay:\nBy the time I had turned on the lights, the Yatagarasu had disappeared.\nEdgeworth:\nWhen Kay entered the room, the person she was chasing was already gone. Why do you suppose that was, Agent Lang?\nLang:\n...What do you mean, \"Why do you suppose?\" Isn't it obvious!? The person slipped out through the door behind the girl under the cover of darkness.\nEdgeworth:\nEdgeworth:\nSorry, but I know for a fact that the person didn't escape through that door!\nLang:\nOh? And how do you know that with such certainly!?\nEdgeworth:\nHmph... That's easy. If the Yatagarasu had left through that door, they would have run right into this person!\nPresent Shih-na profile\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Y-Your answer is Shih-na...?\"\nPresent anyone else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThis is who (changed from [the person] in the original release) the suspicious person would've ran into!\nLang:\n...Huh? Hey, Mr. Prosecutor... Are you sure you're not losing it?\nEdgeworth:\nI haven't lost anything, and certainly not my mind.\nLang:\nMaybe not, but you definitely have the wrong person. Or maybe you're just terrible with not only logic, but names as well!\nEdgeworth:\nNnnngggghhhhooooh! (You didn't need to add insult to injury...! (changed from [I know I was mistaken, but you didn't have to insult me!] in the original release) Think, Miles! Recall the circumstances around Kay's near-arrest! There was someone right next to Mr. Coachen's office investigating at the time!)\nLeads back to:\n\"If the Yatagarasu had left through that door, they would have run right into this person!\"\nLang:\nY-Your answer is Shih-na...?\nEdgeworth:\nYes, because let's consider what would've happened if the Yatagarasu had used the door. When Kay screamed upon discovering Mr. Coachen's body... ...the Yatagarasu would've run right into Agent Shih-na, who was in the next room over.\nLang:\n...Arngh!\nEdgeworth:\nAgent Shih-na. Would you mind telling us if you saw the suspicious person in question?\nShih-na:\n.........No, I didn't see anyone.\nEdgeworth:\nYou see? Therefore, the Yatagarasu could not have escaped through the door as\nLang:\nLang:\nIt just means that the creep slipped out before Shih-na made it out into the hallway!\nEdgeworth:\nEdgeworth:\nHmph. I doubt that, as there was another person in that hallway. A certain detective. Detective Gumshoe, where were you exactly at that time?\nGumshoe:\nM-Me, sir? Well, when I heard Kay's scream... ...I ran towards Mr. Coachen's office from the opposite direction of Agent Shih-na, sir!\nEdgeworth:\nSo, Agent Lang, can YOU explain how someone could've eluded both of them!? Even you must concede that under these circumstances, the door was not a viable route!\nLang:\nGrr...rrrnoooooooooh!\nKay:\nWay to go, Mr. Edgeworth! You nailed him with just an explanation of what happened!\nEdgeworth:\nYes... I've eliminated one of the possible escape routes from that room. (But this is far from over. I need to make Agent Lang aware as well... ...of yet another possible escape route the Yatagarasu could've taken.)\nLang:\n.........! Ha ha ha ha! I get it! So that's what you were trying to show me. Hey, Mr. Prosecutor... Let me guess. This is what you're trying to say, right? Because the door was not a viable escape route, then there must've been another way out!\nEdgeworth:\nPrecisely.\nGumshoe:\nHey, Mr. Edgeworth! It's time to bust out with our revolving fireplace wall explanation, right!?\nEdgeworth:\nNo, not quite yet.\nKay:\nHuh!? But why? I thought this would be the perfect time...\nEdgeworth:\nThe revolving wall on the Babahlese side is known only to four people. And if we use this information unwisely, the truth may escape us in the end.\nLang:\nWhat's with all the whispering over there? Scared I'll figure out your tactics?\nEdgeworth:\nHmph, nothing of the sort, Agent Lang. Come, let's continue where we left off.\nLang:\nThat smug, haughty attitude of yours... You really rub me the wrong way, you know that!? ...Hmph. Well, no matter. I've figured you out already anyway. The only other possible escape route besides the door... is the room's lone window! And since an eerie picture of said escape route exists... Are you saying that this photo captures the moment of the Yatagarasu's escape!?\nEdgeworth:\n(I guess Detective Badd must have filled him in on this photo... I have to admit that at first, I thought the window to be a possible escape route as well. However, I now know that to be impossible!)\nLang:\nNow, I realize you may not know this, but... ...humans can't fly.\nEdgeworth:\nOf course I know that! That's bloody common sense! Besides, I never said I thought that photo to be of the Yatagarasu's escape route.\nLang:\n...I suppose not. Alright then, explain yourself.\nEdgeworth:\nThe shadow in this photo is not the Yatagarasu that Kay was chasing after.\nLang:\nLang:\nYou can say whatever you'd like in whatever language you want... ...but there's only one language I really understand: the language of evidence!\nEdgeworth:\nVery well, then. I present to you, proof that the person Kay saw is not the same as the one in this photo!\nPresent Photo of Yatagarasu or Fires in Babahl\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Let me explain to you precisely why the shadow in this photo is not the Yatagarasu Kay saw.\"\nPresent anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nThis piece of evidence proves that the shadow in the photo is not the person Kay saw!\nLang:\n...Oh, is that right? What do you think, little miss?\nKay:\nHuh!? Well, umm... Gummy, what do you think?\nGumshoe:\nMe!? Umm, I... Ms. von Karma, what do you think, sir?\nFranziska:\nI don't think anything, because I already know that evidence proves absolutely nothing!\nLang:\nAha ha ha ha ha! Looks like you've got a mutiny on your hands, Mr. Prosecutor!\nEdgeworth:\nArngh! (The last thing I needed was him laughing in my face! I need to think back to what Detective Badd told me... ...about when this photo was taken.)\nLeads back to:\n\"I present to you, proof that the person Kay saw is not the same as the one in this photo!\"\nEdgeworth:\nLet me explain to you precisely why the shadow in this photo is not the Yatagarasu Kay saw. Kay spotted the Yatagarasu heading for the third floor during the second fire. However, the photo in question was taken just after the first fire!\nLang:\nGrr...rrrnoooooooooooh!\nKay:\nYeah! Way to go! That's TWICE you've bit him in the butt now!\nLang:\nLang:\nWe're not done yet! You still have to explain what that shadow is... ...and how the Yatagarasu escaped! I don't suppose you can answer both, can you!?\nEdgeworth:\nRegarding the photo, I admit that we don't understand what it means quite yet.\nLang:\nHah! As I thought.\nEdgeworth:\nHowever, the Yatagarasu's escape route? Now, THAT I can answer.\nLang:\nYou can? Well, then, Mr. Prosecutor, go on! Enlighten me!\nEdgeworth:\nEdgeworth:\nEven if I explain it, you'll try to find some flaw with what I have to say. You were busy heading up the Allebahstian investigation, correct? In that case, I doubt you'd have much knowledge about the Babahlese side of the case... ...so wouldn't it be best if the lead on that side, Agent Shih-na, explained in my stead?\nLang:\n.........Argh! Shih-na is my subordinate...! If I don't stick up for her, how can I look her in the eyes and call myself her boss...!?\nShih-na:\n.........Lang, it's alright. I can take care of him.\nLang:\nShih-na.\nShih-na:\nYou've shielded me a lot as my boss... ...but it's time for me to prove my worth.\nLang:\n...Alright. If you're OK with it, then you have my support.\nEdgeworth:\n(Finally, it's down to just Agent Shih-na and myself. This is where the battle really begins!)\nShih-na:\nNow then, what is it you'd like to ask?\nEdgeworth:\nHmm, let's see... Why don't we start with your movements inside the Babahlese Embassy?\nTestimony\n-- Shih-na's Movements --\nShih-na:\nDuring the first Babahlese fire, I assisted in putting out the fire.\nDuring the second fire, I was searching for the Yatagarasu that had appeared in Babahl.\nWhile I was searching, I heard a scream coming from the next room over.\nAlthough I was in the next room, I was unable to catch a glimpse of the Yatagarasu.\nTo be honest, I'm actually very skeptical that the girl's \"Yatagarasu\" even exists.\nShih-na:\nAnd that is all I have to say.\nKay:\nBut I'm not lying when I say I saw the suspicious person run into Mr. Coachen's office! Like I said earlier... ...I have no intention of retracting my testimony.\nShih-na:\n.........Good.\nEdgeworth:\nJust to confirm, did you have a partner when you were on your investigation?\nShih-na:\nNo, I moved alone.\nEdgeworth:\nIn that case, you have no one to corroborate your alibi. Is that correct?\nLang:\nLang:\nAre you calling her suspicious because she was in a room by herself!? How pathetic!\nEdgeworth:\n...And it wasn't when Agent Shih-na tried to arrest Kay under the same rationale?\nLang:\n............!\nEdgeworth:\nAnd how about when you accused Larry because he was the weapon's owner?\nLang:\n............Grr!\nFranziska:\nNot that it's unexpected for that useless lump to get into such a situation. Although, I suppose it's never a good idea to let mistakes go uncorrected.\nLang:\nI will make no excuse for what I did in that situation.\nGumshoe:\nThen you should apologize right now for making Kay out to be the killer, pal!\nLang:\n.........I'm sorry. Shih-na, apologize.\nShih-na:\n............... .........I'm sorry.\nKay:\nI-It's really OK! I mean, I'm not under suspicion anymore! Right, Mr. Edgeworth!?\nEdgeworth:\nHmph. Well, I never doubted you. Not for one second.\nLang:\n.........And the same goes for me. I believe in Shih-na.\nEdgeworth:\nThen let's put that to the test, and see if she is really worthy of your trust.\nShih-na:\nHeh heh... This promises to be interesting.\n\nEdgeworth: Edgeworth: So you helped with the fire extinguishing effort? Shih-na: I was in charge of the police on the Babahlese side, so I helped them with their work. Edgeworth: Police doing the job of firemen... You really know how to work people. Lang: She sure does. That's because she's one awesome woman who knows how to manage. Kay: I guess so! She's always bringing you a business card or a scroll at just the right time! Shih-na: To prepare everything before I'm ordered to... That is the definition of a secretary. Gumshoe: She kinda seems more capable than Agent Lang, doesn't she? Edgeworth: At the very least, she's certainly more capable than you, Detective. Gumshoe: Oogh... I kinda had a feeling you were going to say that. Lang: Shih-na's more than just a capable secretary, you know. Shih-na, tell him what other things you're good at. Shih-na: ...Alright.\nEdgeworth: Edgeworth: By \"the second fire\", you mean the one that consumed the third floor of Babahl, correct? Shih-na: Yes. That was when the suspicious person was spotted in Babahl. Kay: Then, you WERE after the same person in the long coat that I was after! Shih-na: Shih-na: There is no proof that the suspicious person was really the Yatagarasu... ...because no one was able to get a good look at the person's face. Edgeworth: Hmm... By the way, how was your team's investigation? Shih-na: In order to extinguish the fire, water was pumped into the third floor via the windows. So the majority of the investigators conducted their searches on other floors. Edgeworth: (Maybe they did, but there was one person who was wandering around lost on the third floor.) Shih-na: When the fire was pretty much out, I moved to investigate the third floor. Edgeworth: And you did that alone...? Shih-na: Yes...\nEdgeworth: Edgeworth: So you were in the room next to Mr. Coachen's office? Shih-na: I already told you I was earlier. As I was examining the neighboring room... ...I heard that girl's shrill scream. Upon hearing her, I immediately ran towards Mr. Coachen's office. Edgeworth: Wherein, you proceeded to arrest her, as I recall. Shih-na: ...Yes, I did. Gumshoe: But she was totally innocent, pal! I thought we had already cleared that up! Shih-na: ...And I thought I had already apologized for my behavior. Now if the tenacious detective would be so kind as to be quiet... Gumshoe: Oongh! Edgeworth: I have to agree. Right now is not the time to take issue with that. Gumshoe: Nngh... Not you, too, Mr. Edgeworth! Edgeworth: But what I do take issue with is the fact that you didn't see the Yatagarasu, Agent Shih-na. Shih-na: Hmph... The prosecutors of this country are all so strange.\nEdgeworth: Edgeworth: You were unable to catch even a glimpse, despite being in the next room? Is that true? Shih-na: ...I really hate to repeat myself. Edgeworth: Hmph......... I'm sorry for inconveniencing you... ...however, I simply wish to make sure that you are not mis-remembering something. We wouldn't want you to be accused of lying later on, would we? Shih-na: ...! Lang: Hey, Mr. Prosecutor... Are you calling Shih-na's testimony a lie!? Edgeworth: Agent Lang, I'm talking with Agent Shih-na right now... ...so I'd appreciate it if you wouldn't interrupt us with superfluous comments! Lang: Grr...rrr.........! Grrrrrrrrrnnnnngh! Kay: Aww... You know, I feel kinda bad for him. Edgeworth: I understand his pain at watching one of his subordinates being accused... ...however, I cannot turn my eyes from the truth! Shih-na: Lang... I'm alright. And as for you, I think you should be focusing your doubts on that girl rather than me. Kay: ! Edgeworth: ...And why is that?\nEdgeworth: Edgeworth: Are you throwing Kay's words into doubt again? Shih-na: Well, she does claim to be the Yatagarasu, right? And she did try to chase down the Yatagarasu, despite being just an average citizen. Edgeworth: Hmph. Actually, she came here with the goal of capturing the fake Yatagarasu. Kay: That's right, which is why I would never lie about anything related to the Yatagarasu. Shih-na: And I suppose you have proof of that somewhere? Kay: Not quite, but even without any, I have people who believe in me, and that's enough. Shih-na: ...I see. Edgeworth: Kay's testimony is without flaw, but as for yours... Well, let's just say that I find your testimony to be a bit suspicious. Shih-na: .........\nEdgeworth: Hmph... There seems to be a very large flaw in her testimony.\nKay: Oh? Then why don't you show her using what we found out with Little Thief?\nEdgeworth: Heh... I will, in due time. (The escape route of the Yatagarasu that Kay was in pursuit of... If it turns out that it really does lead right to Agent Shih-na... ...then what is it that she is keeping from us right now?)",
      "testimonies": [
        {
          "testimony": "During the first Babahlese fire, I assisted in putting out the fire.",
          "person": "Shih-na",
          "present": []
        },
        {
          "testimony": "During the second fire, I was searching for the Yatagarasu that had appeared in Babahl.",
          "person": "Shih-na",
          "present": []
        },
        {
          "testimony": "While I was searching, I heard a scream coming from the next room over.",
          "person": "Shih-na",
          "present": []
        },
        {
          "testimony": "Although I was in the next room, I was unable to catch a glimpse of the Yatagarasu.",
          "person": "Shih-na",
          "present": [
            "Revolving Fireplace Wall"
          ]
        },
        {
          "testimony": "To be honest, I'm actually very skeptical that the girl's \"Yatagarasu\" even exists.",
          "person": "Shih-na",
          "present": []
        }
      ],
      "noPresent": false
    },
    {
      "category": "rebuttal",
      "newContext": "Shih-na:\nDuring the first Babahlese fire, I assisted in putting out the fire.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nSo you helped with the fire extinguishing effort?\nShih-na:\nI was in charge of the police on the Babahlese side, so I helped them with their work.\nEdgeworth:\nPolice doing the job of firemen... You really know how to work people.\nLang:\nShe sure does. That's because she's one awesome woman who knows how to manage.\nKay:\nI guess so! She's always bringing you a business card or a scroll at just the right time!\nShih-na:\nTo prepare everything before I'm ordered to... That is the definition of a secretary.\nGumshoe:\nShe kinda seems more capable than Agent Lang, doesn't she?\nEdgeworth:\nAt the very least, she's certainly more capable than you, Detective.\nGumshoe:\nOogh... I kinda had a feeling you were going to say that.\nLang:\nShih-na's more than just a capable secretary, you know. Shih-na, tell him what other things you're good at.\nShih-na:\n...Alright.\nShih-na:\nDuring the second fire, I was searching for the Yatagarasu that had appeared in Babahl.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nBy \"the second fire\", you mean the one that consumed the third floor of Babahl, correct?\nShih-na:\nYes. That was when the suspicious person was spotted in Babahl.\nKay:\nThen, you WERE after the same person in the long coat that I was after!\nShih-na:\n\nShih-na:\nThere is no proof that the suspicious person was really the Yatagarasu... ...because no one was able to get a good look at the person's face.\nEdgeworth:\nHmm... By the way, how was your team's investigation?\nShih-na:\nIn order to extinguish the fire, water was pumped into the third floor via the windows. So the majority of the investigators conducted their searches on other floors.\nEdgeworth:\n(Maybe they did, but there was one person who was wandering around lost on the third floor.)\nShih-na:\nWhen the fire was pretty much out, I moved to investigate the third floor.\nEdgeworth:\nAnd you did that alone...?\nShih-na:\nYes...\nShih-na:\nWhile I was searching, I heard a scream coming from the next room over.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nSo you were in the room next to Mr. Coachen's office?\nShih-na:\nI already told you I was earlier. As I was examining the neighboring room... ...I heard that girl's shrill scream. Upon hearing her, I immediately ran towards Mr. Coachen's office.\nEdgeworth:\nWherein, you proceeded to arrest her, as I recall.\nShih-na:\n...Yes, I did.\nGumshoe:\nBut she was totally innocent, pal! I thought we had already cleared that up!\nShih-na:\n...And I thought I had already apologized for my behavior. Now if the tenacious detective would be so kind as to be quiet...\nGumshoe:\nOongh!\nEdgeworth:\nI have to agree. Right now is not the time to take issue with that.\nGumshoe:\nNngh... Not you, too, Mr. Edgeworth!\nEdgeworth:\nBut what I do take issue with is the fact that you didn't see the Yatagarasu, Agent Shih-na.\nShih-na:\nHmph... The prosecutors of this country are all so strange.\nShih-na:\nAlthough I was in the next room, I was unable to catch a glimpse of the Yatagarasu.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nYou were unable to catch even a glimpse, despite being in the next room? Is that true?\nShih-na:\n...I really hate to repeat myself.\nEdgeworth:\nHmph......... I'm sorry for inconveniencing you... ...however, I simply wish to make sure that you are not mis-remembering something. We wouldn't want you to be accused of lying later on, would we?\nShih-na:\n...!\nLang:\nHey, Mr. Prosecutor... Are you calling Shih-na's testimony a lie!?\nEdgeworth:\nAgent Lang, I'm talking with Agent Shih-na right now... ...so I'd appreciate it if you wouldn't interrupt us with superfluous comments!\nLang:\nGrr...rrr.........! Grrrrrrrrrnnnnngh!\nKay:\nAww... You know, I feel kinda bad for him.\nEdgeworth:\nI understand his pain at watching one of his subordinates being accused... ...however, I cannot turn my eyes from the truth!\nShih-na:\nLang... I'm alright. And as for you, I think you should be focusing your doubts on that girl rather than me.\nKay:\n!\nEdgeworth:\n...And why is that?\nPresent Revolving Fireplace Wall\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"Being in the room next to Mr. Coachen's office is the problem with your testimony.\"\nShih-na:\nTo be honest, I'm actually very skeptical that the girl's \"Yatagarasu\" even exists.\nPress\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nAre you throwing Kay's words into doubt again?\nShih-na:\nWell, she does claim to be the Yatagarasu, right? And she did try to chase down the Yatagarasu, despite being just an average citizen.\nEdgeworth:\nHmph. Actually, she came here with the goal of capturing the fake Yatagarasu.\nKay:\nThat's right, which is why I would never lie about anything related to the Yatagarasu.\nShih-na:\nAnd I suppose you have proof of that somewhere?\nKay:\nNot quite, but even without any, I have people who believe in me, and that's enough.\nShih-na:\n...I see.\nEdgeworth:\nKay's testimony is without flaw, but as for yours... Well, let's just say that I find your testimony to be a bit suspicious.\nShih-na:\n.........\nEdgeworth:\nHmph... There seems to be a very large flaw in her testimony.\nKay:\nOh? Then why don't you show her using what we found out with Little Thief?\nEdgeworth:\nHeh... I will, in due time. (The escape route of the Yatagarasu that Kay was in pursuit of... If it turns out that it really does lead right to Agent Shih-na... ...then what is it that she is keeping from us right now?)\nEdgeworth:\nBeing in the room next to Mr. Coachen's office is the problem with your testimony.\nShih-na:\n.........!\nLang:\nLang:\nMr. Prosecutor... I don't see what problem you're talking about at all!\nEdgeworth:\nAgent Lang, do you recall the secret we discovered about the Allebahstian office fireplace?\nLang:\nHuh? Oh, you mean how it connects the office with the room next door? What about it?\nEdgeworth:\nWell... Allebahst isn't the only country with secret connecting fireplaces.\nLang:\nWha--!?\nEdgeworth:\nThe fireplace in Mr. Coachen's office holds the exact same secret!\nLang:\nWh...Whaaaaaaaaaat!?\nEdgeworth:\nThe Yatagarasu didn't escape through the door to the room or the window. The escape route was through the revolving fireplace wall and into the next room over!\nShih-na:\n.........!\nEdgeworth:\nNow do you see? If the Yatagarasu had escaped into the next room... ...then the thief would've run straight into Agent Shih-na! Meaning that it's impossible for her to have missed the Yatagarasu!\nLang:\nA.........Aiyaaaaaaaaaaaa!\nFranziska:\nWh-What is the meaning of this, Miles!?\nEdgeworth:\nWell? Would you care to explain, Agent Shih-na... ...how you managed to completely miss the fleeing Yatagarasu, or shall I?\nShih-na:\n............\nEdgeworth:\nYour claim that you were in the next room was a lie all along, wasn't it? The truth is, you were the one Kay saw in the coat... ...pretending to be the Yatagarasu, and you were the one she chased after. As you tried to lose her, you ran into Mr. Coachen's office, and headed for the fireplace. Then, you shed your coat in the next room, leaving it there to emerge as \"Agent Shih-na\". After that, you came back around to place Kay under arrest. Does that sound about right? If not, then speak now or forever hold your peace.\nShih-na:\n............\nGumshoe:\nHow dare you make Kay look like the bad guy when you're the suspicious one, pal!?\nShih-na:\n.........Phwwh... Phwwwwh...\nEdgeworth:\n.........!\nLang:\n...Shih-na...?\nShih-na:\nHee... hee hee hee......... ...Hee hee hee hee hee... hee hee......... Aha! Ahaha! Ahaha! Ahahahahahahahahahahahahaha!\nEdgeworth:\n! (That... That laugh...!)\nFranziska:\nI remember this irritating laugh...\nGumshoe:\nBrr... I'm getting chills down my spine...!\nKay:\n.........It can't be... But it has to be...!\nLang:\nShih-na... What's wrong with you...?\nShih-na:\nPhwwh... I'm sorry. It was so funny that I couldn't help but laugh.\nEdgeworth:\n...\"Funny\", you say?\nShih-na:\nYes, that you would accuse me of being the Yatagarasu. ...The prosecutors of this country really are all so very strange.\nFranziska:\nDo you think you can get away with this by simply laughing it off!?\nShih-na:\nPhwwh... You think I'M taking things too lightly? I think not. It's that prosecutor who is.\nEdgeworth:\n.........!\nShih-na:\nLook, everything you said earlier is nothing more than mere speculation. The Yatagarasu fled through the fireplace? Do you have any proof to back up your claim? If you don't, then you haven't proven a thing regarding the Yatagarasu's escape route!\nEdgeworth:\nThe tone of voice you're taking with me now has certainly changed.\nShih-na:\nHeh heh... That's because it's been a while since I've had this much fun. I think I'll let loose, and then we can have a real battle of wits.\nEdgeworth:\nFor an agent of Interpol to show me the true power of her mind, it is a great honor.\nShih-na:\nPhwwwh... Don't underestimate me; I'm not some foolish broad, you know.\nEdgeworth:\nI know. And that is why I won't hold anything back either as I answer your question.\nShih-na:\nMy question...?\nEdgeworth:\nHere is your proof that the revolving fireplace wall in Babahl was used recently!\nPresent Amb. Palaeno's Testimony or Revolving Fireplace Wall\n\n\n\n\n\n\n\nEdgeworth:\n\nLeads to:\n\"I'm sorry, but is this really your honest answer to my question?\"\nPresent anything else\n\n\n\n\n\n\n\nEdgeworth:\n\nEdgeworth:\nMy honest answer is this!\nShih-na:\nAhah! Ahaha! Ahaha! Ahahahahahahahahahahahahaha!\nFranziska:\nWhat was THAT for!?\nShih-na:\nIt was just MY honest answer to that piece of evidence. Ahah! It means that his piece of evidence was only worth a sudden outburst of laughter!\nEdgeworth:\nArngh!\nGumshoe:\nHang in there, Mr. Edgeworth! Just remember what happened to me when I went through that revolving door!\nEdgeworth:\nBut what happened to you is irrelevant to the topic at hand...\nGumshoe:\nAww... But I even got my coat covered in ash trying to squeeze my way through...!\nEdgeworth:\n(Hold on... Maybe his dirtied coat IS relevant after all. I should think back to what the fireplace was like when we were investigating it!)\nLeads back to:\n\"Here is your proof that the revolving fireplace wall in Babahl was used recently!\"\nShih-na:\nI'm sorry, but is this really your honest answer to my question?\nEdgeworth:\nYes. According to Ambassador Palaeno's testimony... ...he said that he was burning some documents in the fireplace with Mr. Coachen.\nShih-na:\n...Oh?\nEdgeworth:\nThe ashes of what they burned were left in the fireplace, so they should've been there. However, when we went to investigate the room, the ashes weren't there.\nShih-na:\nShih-na:\nWhy is that a problem? Maybe someone cleaned them up?\nEdgeworth:\nEdgeworth:\nHmph......... Unfortunately for you, Ambassador Palaeno said that he forgot to. And so the question remains: Why were the ashes missing? ...The answer is simple. When the Yatagarasu went through the fireplace wall... ...the ashes were pushed into the next room by the wall as well! The movement of the ashes that were in Mr. Coachen's office is my proof!\nShih-na:\nAhah! Ahaha! Ahaha! Ahahahahahahahahahahahahaha!\nEdgeworth:\n.........And just what is so funny!?\nShih-na:\nAsh as proof...? Are you even allowed to submit such flakey evidence in court?\nFranziska:\nYou... still wish to fight us?\nShih-na:\nOf course. Why wouldn't I?\nEdgeworth:\nIn that case, let's hear your counterargument.\nShih-na:\nPhwwwh... My counterargument, huh? This really is just like being in court.\nEdgeworth:\nWell, to me, we're simply continuing from where we left off all those years ago.\nShih-na:\n...Phwwwh. I have no idea what you're talking about.\nEdgeworth:\nIt doesn't matter if we're at a crime scene or in court, let's finish this here and now!\nShih-na:\nI suppose. I've had a lot of fun today, but I grow weary of this game of cat and mouse.\nEdgeworth:\n...!\nShih-na:\nLet's make this the last testimony, and wrap up this absurd case once and for all!\nTestimony\n-- Shih-na's Rebuttal --\nShih-na:\nIn my eyes, all you've proved is that the rotating fireplace wall was used...\n...but you can't really call that proof that the Yatagarasu used the fireplace, now can you?\nSo then, who was it that used the rotating wall? Show me your answer with real evidence.\nRemember, we've already finished our very thorough investigation...\n...and we found not a single suspicious thing in Mr. Coachen's office.\nShih-na:\nPhwwwh... And there you have it, my counterargument.\nEdgeworth:\n...Arngh! (That's very... impressive. She has seen through to the fact that I have yet to gather that one piece of evidence...)\nKay:\n............\nGumshoe:\nWhat is it, Kay? I haven't heard a peep out of you in quite a while now.\nFranziska\nIf you don't think you can handle it, feel free to leave the rest of it to us.\nKay:\nBut I...!\nEdgeworth:\nKay... Pull yourself together. You are the true heir to the Yatagarasu name, are you not?\nKay:\n...!\nEdgeworth:\nIf you want to steal the truth, then you must never take your eyes off of it. This chase you're running to catch the truth... you must see it through to the very end.\nKay:\nMr. Edgeworth... You're right. I... I will see this through to the end. So...... You go get her for me, Mr. Edgeworth!\nEdgeworth:\nHmph... With pleasure.\nShih-na:\nLooks like a lack of evidence has left you wide open, doesn't it?\nLang:\n...Shih-na. Please... show me you're someone I can trust.\nShih-na:\n......... Don't worry. This will be the deciding match. You'll see.\nEdgeworth:\n(I'm truly sorry, Agent Lang, but I simply can't allow her to escape me again.) Very well then, Agent Shih-na. Shall we begin?\nShih-na:\nPhwwh... I'm ready whenever you are.\n\nEdgeworth: Edgeworth: .........It sounds to me like you're saying my explanation is not good enough. Gumshoe: But I was able to go through the revolving door myself! So that should be proof enough, even for you, pal! Shih-na: Hah... It looks like you don't quite understand. But by your looks, I can guess that you're not all that learned. Gumshoe: Yeowch! Talk about rude! You should watch what you say, pal! Edgeworth: (Sadly, I can't say I disagree with her on that one.) Shih-na: But you know what I mean, right? You may have proven that the fireplace was used...\nEdgeworth: Edgeworth: So you want proof that the Yatagarasu was the one who used the fireplace? Shih-na: That's right. Well? Do you have any? Edgeworth: Arngh! Kay: Kay: Can you prove that it WASN'T the Yatagarasu who used the fireplace? Shih-na: I don't need to prove anything to you. Kay: O...Objection! Edgeworth: Edgeworth: Kay, if you could please not steal my line... Kay: S-Sorry... But I just couldn't hold it in anymore! Edgeworth: Well, don't fret and leave her to me. All you have to do is sit back and watch. Shih-na: Ahah! You may seem to have some wiggle room, but without any evidence, it's meaningless.\nEdgeworth: Edgeworth: It's possible that the Yatagarasu left fingerprints inside the fireplace! Shih-na: Shih-na: Sorry, but I had the forensics team check that already. All they found were prints belonging to Ambassador Palaeno and Mr. Coachen. Edgeworth: Curses! (I should've known better than to think the Yatagarasu would have been so careless. But there must be some sort of evidence that we still have yet to find!) Shih-na: Ahah... I take it you have no further objections?\nEdgeworth: Edgeworth: So Interpol has finished examining the entire Babahlese Embassy? Shih-na: Yes. The investigators who weren't allowed into Allebahst were incredibly helpful. They all put in great efforts to search for any sign of the Yatagarasu. Franziska: Franziska: And yet, despite all that effort... ...it appears that they failed to notice the lack of ash in the office fireplace. Furthermore, you were the one who inspected the room next to Mr. Coachen's, correct? Shih-na: I didn't notice the ash there in the fireplace of that room, and for that, I am sorry. Lang: Lang: You don't need to apologize, Shih-na. As your boss, your mistakes are my mistakes... ...so allow me to apologize for you. .........I'm sorry. Kay: You know, maybe this guy's not such a bad guy after all! Gumshoe: He apologizes for his subordinate and everything. What a great boss! Edgeworth: .........Are you saying that I don't do anything for my own subordinates? Gumshoe: Ack! N-N-N-No, nothing of the sort, sir! You're someone I really respect, sir! Even if you are a bit... too strict sometimes. Edgeworth: That is only a problem on your end. Kay: Wow, way to be super hard on him in response! Edgeworth: (...Am I really too strict on everyone?) Lang: Anyway, Shih-na. You didn't find anything in Mr. Coachen's office, right? Shih-na: That's right. We finished our investigation...\nEdgeworth: Edgeworth: So you really didn't find anything? Shih-na: Yes, as I said, not one suspicious thing. Edgeworth: ...! Shih-na: Although, as you already know... ...we did find the Yatagarasu's Key and the document detailing the smuggling operation. But we still haven't found the blade that belongs to the Babahlese knife handle yet. Lang: Hah! You see? My subordinates worked hard to investigate everything. So there was nothing else to find, alright? Gumshoe: Wow, Agent Lang really sticks up for his people. Lang: Lang Zi says: \"All men are brothers. And friends become family.\" Hmph. So you see, my people are my family, and their families are my family, too. Franziska: That's a rather large family you have there... Edgeworth: Yes, but as we all know, there is always one black sheep in any family. And though it pains me, Agent Lang, you WILL know the black sheep in your family! Shih-na: ............ (removed in 2024 re-release) Kay: Mr. Edgeworth... I think she's mad at you. (removed in 2024 re-release) Edgeworth: ...Perhaps. (But our definitions of reality are a tad different.) (removed in 2024 re-release) Shih-na: ...Are the two of you done chatting? (removed in 2024 re-release)\nKay: So... do you actually have any proof that the Yatagarasu used the fireplace passageway?\nEdgeworth: No, I haven't found any yet.\nKay: Then what are we going to do!?\nEdgeworth: Hmph. There's no need to worry. Because there is a loophole in Ms. Interpol Agent's argument we can exploit first. (The one in charge of the Babahlese investigation was not Agent Lang. Which means that with Agent Shih-na in charge... ...it's possible she may have tampered with the evidence. That piece of evidence that we found... If there is one thing I DO know, it is that someone tried to hide it from us!)",
      "testimonies": [
        {
          "testimony": "In my eyes, all you've proved is that the rotating fireplace wall was used...",
          "person": "Shih-na",
          "present": []
        },
        {
          "testimony": "...but you can't really call that proof that the Yatagarasu used the fireplace, now can you?",
          "person": "Shih-na",
          "present": []
        },
        {
          "testimony": "So then, who was it that used the rotating wall? Show me your answer with real evidence.",
          "person": "Shih-na",
          "present": []
        },
        {
          "testimony": "Remember, we've already finished our very thorough investigation...",
          "person": "Shih-na",
          "present": []
        },
        {
          "testimony": "...and we found not a single suspicious thing in Mr. Coachen's office.",
          "person": "Shih-na",
          "present": [
            "Counterfeit Bills",
            "Wire"
          ]
        }
      ],
      "noPresent": false
    }
  ]
}