{
    "previousContext": "3-DespairSyndrome2.png\n\"You must kill someone if you want to leave.\" My mind froze and my breath caught in my throat as I thought about that... I could feel a paralyzing fear slowly making its way through my body, dominating every last nerve. The air hung heavy on me, pressing down like a weight around my neck. It took everything I had just to endure that weight...\nBut for as heavy as the air felt... all it took to pierce it was her sharp words.\n5-Kyoko2.png\n: So? What are you going to do now? Just stand around glaring at each other? Her pointed comment was directed at everyone in the room. It helped pull us back to reality.\n7-BeautifulDeath.png\n8-Taka16.png\n: R-Right... She's right!\n9-Taka7.png\n: Sometimes, even if you're nervous or afraid, you just have to step forward!\n11-Taka4.png\n: To forget such a simple fact... I can't forgive myself. I'm so ashamed! Please, someone hit me! I can't forgive myself! Somebody hit me! Punish me!\n13-Mondo2.png\n: Jesus. If you have time to yell about it, you have time to DO something about it.\n15-Hifumi6.png\n: Perhaps, but...what is the mission, exactly?\n17-Leon15.png\n: Idiot! To look for a way out, duh!\n19-Junko5.png\n: And we totally need to find out whoever was controlling that stupid bear and beat the hell out of 'em.\n21-Chihiro5.png\n: ...B-But before we do all that, maybe we should take a look at the handbook... It's probably best to check out the\nschool regulations\nMonokuma mentioned before doing anything else.\n23-Celeste4.png\n: True. If we stumble around with no clue what the rules are, something like that might happen again...\n25-Mondo3.png\n: Shit...\n27-Junko2.png\n: Fine. Then let's hurry up and check out the stupid rules already.\nAfter turning on my e-Handbook, the first thing that appeared was my name. So just like Monokuma said, the owner's name showed up front and center. Then, from the Main Menu that popped up, I selected the\nSchool Regulations\nicon.\nAn itemized list appears on-screen. It was the\nschool regulations\n. In other words, the rules being imposed on us all.\n1. Students may reside only within the school. Leaving campus is an unacceptable use of time.\n2. \"\nNighttime\n\" is from 10 p.m. to 7 a.m. Some areas are off-limits at night, so please exercise caution.\n3. Sleeping anywhere other than the dormitory will be seen as sleeping in class and punished accordingly.\n4. With minimal restrictions, you are free to explore Hope's Peak Academy at your discretion.\n5. Violence against Headmaster Monokuma is strictly prohibited, as is destruction of surveillance cameras.\n6. Anyone who kills a fellow student and becomes \"blackened\" will\ngraduate\n, unless they are discovered.\n7. Additional school regulations may be added as necessary.\nFeeling a slight dizziness, I raised my face up from the screen. As I looked around, I saw the same stormy expression on everyone's faces.\n38-Mondo5.png\n: This is bullshit! What the hell kinda rules are these!? I'm not gonna let them control ME!\n40-Celeste3.png\n: Well then, why don't you wander around the school without a care in the world and see what happens? Personally, I would love to see what happens when someone breaks one of the rules.\n15-Hifumi6.png\n: But if he got punished like what we saw before, I don't think there'd be a respawn waiting for him...\n42-Mondo10.png\n: ...\n43-Mondo.png\n: I... Ever since I was a kid, I grew up with my older brother pounding this into my head... When a man makes a promise, he has to keep it, even if it kills him.\n45-Junko9.png\n: ...So what?\n13-Mondo2.png\n: I've made a ton of promises that I still have to keep, that's \"so what\"!\n48-Mondo6.png\n: So I can't afford to die in here!\n50-Celeste9.png\n: None of that made much sense to me, but you are saying you will follow the regulations, is that it?\n52-Mondo13.png\n: Huh? Oh, well...yeah, I guess you're right.\n54-Sayaka10.png\n: Hey, um...I have a question. For regulation number six...what do you think it means exactly?\n55-Makoto.png\n: You're talking about the second half, right? Where it says \"\nunless they are discovered\n\"? I was wondering about that myself.\n57-Byakuya.png\n: It's saying that if you want to graduate, you have to kill someone without anyone finding out it was you.\n59-Toko6.png\n: B-But why...? Why do we h-have to do that?\n57-Byakuya.png\n: I don't see any reason to worry about it. Just worry about following the rules as they've been explained to us.\n61-Byakuya7.png\n: Frankly, I don't want to hear anything from someone who waits for others to decide what to do for them.\n63-Toko3.png\n: D-Don't jab at me...\n64-Leon2.png\n: More like a full-on stab...\n65-Hina2.png\n: Well for now, let's forget all that silly junk about murderers or whatever.\n67-Hina22.png\n: Now that we know the rules, let's start exploring the school!\n69-Taka15.png\n: True. We need to find out where exactly we are. Is there any way out? What about food and supplies?\n70-Taka8.png\n: There are tons of questions we need to answer!\n72-Leon12.png\n: Damn straight! Okay, then let's all start looking around!\n74-Byakuya15.png\n: ...I'll be going alone.\n45-Junko9.png\n: What!? Why? That's a pretty stupid idea, don't you think?\n61-Byakuya7.png\n: Someone here might already have started thinking about murdering one of us. Are you saying we should stand around with them in our midst and make it that much easier for them?\n54-Sayaka10.png\n: W-Wait, hold on a second. That would never--!\n♪\nMusic cuts out.\n♪\n76-Byakuya4.png\n: Don't bother saying it couldn't happen. You can't deny the possibility. That's why you all seized up with fear when that graduation rule was made clear to you.\n78-BoysLifeofDespair.png\n79-Byakuya3.png\n: Am I wrong?\n81-Sayaka3.png\n: B-But......\n74-Byakuya15.png\n: So, I'm simply acting in accordance with what I think is best for me.\n48-Mondo6.png\n: Hold on! Like hell I'm gonna let you run off and do whatever you want!\n84-Byakuya5.png\n: Out of my way, plankton.\n38-Mondo5.png\n: Wh--!? The fuck's that supposed to mean!?\n61-Byakuya7.png\n: One tiny bit of plankton, drifting across the sea. So minuscule, so insignificant, they couldn't possibly have any kind of influence on the boundless ocean.\n86-Mondo7.png\n: I'm gonna kick your ass!\n55-Makoto.png\n: S-Stop it! We shouldn't fight!\n86-Mondo7.png\n: The fuck you just say? You some kinda goody-goody little bitch?\n38-Mondo5.png\n: Who do you think you are, talkin' to me like that? You think you're my fuckin' dad or something!?\n55-Makoto.png\n: N-No, I wasn't--!\n48-Mondo6.png\n: Fuck you!\n*WHAM*\n♪\nMusic cuts out.\n♪\nHe punched me...and I flew back in a heap. It was like something straight out of a comic book. I didn't even see the punch coming. It was just suddenly right there in my face. One second I was standing there, the next I was soaring through the air. Now that I think about it, maybe I'd kinda forgotten...the kind of people I'd been trapped here with. My common sense had just...stopped functioning. Being around all these \"ultimates\" had blown my fuses. So I guess I shouldn't be surprised it led to something as absurd as this. But I'd just...lost track of that sense of reality. That was my last thought as my consciousness started to fade...before it finally cut out completely.\nAnd when I finally opened my eyes again, what I saw was...\n90-WelcometoDespair.png\n55-Makoto.png\n: Ng...gah... Huh? Wh-Where am I?\nAs if it had become part of my daily routine, I woke up in yet another room I'd never seen before.\n55-Makoto.png\n: Okay, so... Where am I now?\n91-Tutorial.png\n: You now have access to the\nHandbook Menu\n. You can use this to check a variety of information as you play. Open the Handbook Menu by pressing the Square button. You can use this menu to check the\nSchool Regulations\n, and character info in the\nReport Card\nsection. At certain points,\nMap\nand\nTruth Bullets\nmay not be available. You can also save and load game data under the\nSystem\nsection. Finally, press the SELECT button to review the\nTranscript\n. This records all pertinent info, so use this to review comments from everyone involved.\n93-Narration.png\n: This is the e-Handbook. It's our pause menu. As you can see, we can't view the Map of the area right now or the Truth Bullets section. Truth Bullets only become available when we have evidence to review at later times.\n93-Narration.png\n: First, we can take a look at the Presents section. Right now, there's almost nothing in here, but if we scroll way down the list we'll find...\n93-Narration.png\n: The School Crest that we got for completing the Prologue. It doesn't do anything in particular. Clearing a chapter gives you a Chapter-specific present. As for other presents, it's still not time to talk about them in detail.\n93-Narration.png\n: Next, we have the Report Card section. This section gives a little info about all of the students in the game, Makoto included.\n93-Narration.png\n: As you get to know the students better, more information will get filled in on their respective pages.\n93-Narration.png\n: We can also view the School Regulations at any time if you wish to see them again for whatever reason.\n93-Narration.png\n: System includes the Saving and Loading features, as well as the Options menu, a Return to Main Menu option and the Transcript. The Transcript is very useful if you forgot what someone said 5 seconds ago because it records every single piece of text that the game displays, be it spoken word, thoughts, tutorials or sound effects, and keeps a backlog of at least 100 lines, probably more. It's a very handy feature.\n93-Narration.png\n: Now that we've viewed the e-Handbook in detail, it's time to check out where we are. We can't progress until we check everything here, but not everything is important so I'll only show you the things of note.\nI guess the school must have given one to each of us...\nIt must be brand-new. It's still in the shrink-wrap. I don't really need it right now, so I'll just leave it here.\n\"Announcement from Headmaster Monokuma: Each room's lock has been designed to completely protect against tampering or lock-picking. Remaking an individual room key is quite troublesome, so please make sure not to lose yours. Your room comes furnished with a shower, but please note that\nthe water is turned off at nighttime\n. Also, the bathrooms in the girls' rooms include a lock of their own.\nFinally, we've prepared a small gift for each of you. For the girls, a\nsewing kit\n. And for the boys, a\ntoolkit\n. The sewing kit includes a map of the body's vital organs. One stab will do the job, girls! For the boys, we believe a strong blow to the head with any of the tools should be ample. Don't think! Just feel! And let's all enjoy ourselves!\"\n55-Makoto.png\n: ...\nI crumpled up the sheet of paper and threw it in the trash.\nAll that's in the trash can is the paper I wadded up and threw away.\n93-Narration.png\n: This is a Monocoin. You can find them by examining objects in rooms. You also get a large amount of them every time you clear a chapter. They are used to buy things in the School Store.\n*Rattle rattle*\n55-Makoto.png\n: Huh? It's not opening. I guess it's locked.\nMy name's written on the keychain. Which means it must be mine, right? I'd better hang on to it for now.\n55-Makoto.png\n: I think I'm starting to understand. This room must be...\nThis is my assigned dorm room. Someone must have carried me here after I fell unconscious. So that answers that question. The next question is...\n55-Makoto.png\n: What's everyone else up to right now?\nThere's only one way to find out... And that's to get out of here.\n93-Narration.png\n: Next time, we go outside.\nI rushed out of the room to meet up with all the others. But there was someone waiting for me there. It was like something out of an old TV show...\n*WHAM*\n???: Ahh!\n4-BeautifulDays.png\n5-Makoto.png\n: Oh--! ...Sayaka? S-Sorry! Are you okay?\n6-Sayaka18.png\n: I-I'm fine. I hope you're okay... Sorry about that...\nShe had an embarrassed smile on her face. I stood up slowly.\n5-Makoto.png\n: Are you okay, Sayaka? Are you hurt?\n8-Sayaka6.png\n: Hmhm, you make it sound worse than it is. I'm completely fine. I know how I look, but I've actually built some pretty good muscle jumping up and down on stage!\n5-Makoto.png\n: That's good, then...\n9-Sayaka10.png\n: But...are *you* okay? You know, from when Mondo hit you...\nThat's true... I got knocked out right there in front of everyone. I guess I revealed my lack of cool right from the beginning...\n9-Sayaka10.png\n: Makoto...?\n5-Makoto.png\n: Oh, uh, I'm fine! Nothing wrong here!\n8-Sayaka6.png\n: Oh, that's good. I was kinda worried...\n5-Makoto.png\n: Th-Thanks... By the way...what are you doing here?\n12-Sayaka4.png\n: Actually...I came to get you.\n5-Makoto.png\n: You came...to get me?\n14-Sayaka.png\n: Well, if you really are feeling better...I was hoping you could come to the dining hall.\n5-Makoto.png\n: The dining hall...?\n12-Sayaka4.png\n: After you got knocked out, everyone decided to go and do their own thing. We decided it would be more effective if we split up to investigate. So we agreed to get together later on and talk about what we'd each found out.\n5-Makoto.png\n: So does that mean it's almost time to get back together? If that's what's going on, then of course I'll go with you!\n15-Sayaka7.png\n: Good. I'll go on ahead and meet you at the dining hall, then. *leaves*\n17-BeautifulDeath.png\n18-Narration.png\n: We now have control over Makoto again and can now explore the dormitory hallways.\n18-Narration.png\n: Here's the map of the area. All the dorm rooms are on the right side, with a few facilities on the left. The dining hall is the room with the spoon and fork in the lower left. Before we go there, however, let's see what else is in this area.\n18-Narration.png\n: Dorm rooms line the hallway here and around the corner.\n18-Narration.png\n: There appears to be some sort of inner courtyard here, though it's nothing more than scenery.\n18-Narration.png\n: A trash room is in this hallway, though we can't enter it yet. There are also a few bathrooms down the hall.\n18-Narration.png\n: At the bottom of the map is this barred-off staircase and caution-taped door. We can't do anything with either of them yet.\n18-Narration.png\n: There's a laundry room and a bathhouse in the upper part of the map but right now we can't go into either of them.\n18-Narration.png\n: Let's enter the dining hall.\nThis must be the dormitory dining hall.\n14-Sayaka.png\n: It looks pretty clean, so that's good.\n31-Sayaka2.png\n: ...Er, I guess that's not really important right now, with us being prisoners here and all.\n5-Makoto.png\n: Yeah, that's true...\nNobody was waiting there for us. We don't really have much choice. I guess we should just wait here for now.\n8-Sayaka6.png\n: Hmm... Okay, let's just wait here.\n5-Makoto.png\n: Huh!? You heard that!?\n12-Sayaka4.png\n: Like I said, I'm psychic.\n8-Sayaka6.png\n: Come on, I'm just kidding! Seriously, I just have amazing intuition.\nIs it really just intuition...?\n34-Tutorial.png\n: It's kind of sudden, I know, but here comes a tutorial! Right now I'd like to talk about\nreactions\n. You're gonna be talking to Sayaka, right?\n18-Narration.png\n: I'm going to cut-off the tutorial here. In theory, Reactions are basically a small mechanic in which you can change a conversation's direction by pushing Triangle to select the purple words in a sentence, then pressing X to continue the conversation. In practice however, Reactions don't affect the conversations that much because there's basically no reason not to React to every instance that they show up. In fact, sometimes you MUST React to something to progress the story.\n18-Narration.png\n: They are used more heavily in the beginning of the game to demonstrate the feature, but most of what is said in a Reaction conversation is stuff you could have learned even if you skip the Reaction. They're harmless enough, but I'm not a big fan of them. The writers could have accomplished what Reactions do by just writing the conversations a little better.\n18-Narration.png\n: I'm going to represent them in text with\n[bolded square brackets]\nas best I can, as long as it doesn't break BBCode to do so.\n18-Narration.png\n: Let's skip the rest of the tutorial because I've basically explained everything it was going to and get back to the game.\nUm, so...what time is it right now?\n5-Makoto.png\n: What!? 7 o'clock!? At night!?\n9-Sayaka10.png\n: You were unconscious for a pretty long time...\nI see... Without being able to look out a window, I've lost all sense of time. If I have to stay in this place for too long...I might just go crazy...\n14-Sayaka.png\n: By the way, Makoto...\n5-Makoto.png\n: Huh? What is it?\n12-Sayaka4.png\n: W-Well, it's just... I know this is kind of\n[continuing the self-introduction thing]\n, but I\n[wanted to ask you something]\n.\n> continuing the self-introduction thing\n5-Makoto.png\n: Continuing our self-introductions?\n31-Sayaka2.png\n: We kinda got cut off before, but I had a question I wanted to ask you.\nSayaka wants to ask me something? I wonder what it is. Now I'm really curious...\n> wanted to ask you something\n5-Makoto.png\n: What did you want to ask me?\n♪\nMusic fades out.\n♪\n41-Sayaka17.png\n: Makoto...did you happen to go to Blackroot Junior High? Were you maybe...in class 2?\n5-Makoto.png\n: Y-Yeah, actually...I was.\n4-BeautifulDays.png\n15-Sayaka7.png\n: I knew it! I went there, too! I was in class 4, though. Do you remember me?\n5-Makoto.png\n: Do I remember...?\nEven back in middle school, she was a celebrity with all kinds of \"ultimates\" surrounding her. How could I forget? Almost as surprising as her question was...that she remembered me! We'd never even talked to each other, but somehow she still knew who I was.\n14-Sayaka.png\n: Hey, are you okay?\n5-Makoto.png\n: Oh, yeah. I'm just surprised, is all. I wouldn't have thought you'd remember me.\n8-Sayaka6.png\n: We went to the same school for three years, of course I remember!\n5-Makoto.png\n: Well, that's true. But there were lots of students in our grade, right? Plus, I've never been the type of person to ever really stand out. I'm average at everything, and all my hobbies are totally normal. Even \"normal\" would call me boring.\n15-Sayaka7.png\n: What are you talking about? You're so strange!\n5-Makoto.png\n: S-Strange? That's--!\n8-Sayaka6.png\n: Hahaha!\nShe started giggling even louder. That somehow mysterious smile of hers made my heart grow calmer. Her smile was the nicest smile I'd ever seen...\n15-Sayaka7.png\n: Anyways, I'm really glad...that I know somebody here.\n8-Sayaka6.png\n: Talking to you has made me feel a lot better about all this... You're amazing Makoto!\n5-Makoto.png\n: N-No, I'm really not... I'm nothing at all compared to all you \"ultimates.\"\n8-Sayaka6.png\n: But *you're* the one that helped me find my courage again. Not any of those \"ultimate\" students.\n5-Makoto.png\n: Thank you for saying that...\n15-Sayaka7.png\n: And to thank you for helping me out, I'm going to become your\nUltimate Assistant\n!\n5-Makoto.png\n: Huh? My assistant?\n8-Sayaka6.png\n: Yup! I'm your assistant now! I'm going to help you out as much as I can, so let's get out of here together!\nWhen she says things like that, it... It just gets me pumped up!\n18-Narration.png\n: Since we examined the clock to see what time it was and viewed all the Reactions Sayaka had for us, we now get the next scene.\n17-BeautifulDeath.png\n41-Sayaka17.png\n: I can't believe no one's here yet. But I'm sure they'll start showing up soon...\nAlmost like he'd timed it, Taka threw open the dining hall doors right as Sayaka said that.\n45-Taka3.png\n: Ah, Makoto, Sayaka! So you two got here first, huh?\n47-Taka18.png\n: Too bad... I was sure I'd beat everyone here.\n49-Taka4.png\n: I guess that just means I don't have enough fighting spirit yet!\n51-Taka9.png\n: Well I won't give up! Next time, I swear I'll win no matter what it takes! Justice shall always prevail!\n8-Sayaka6.png\n: That's a bit much, don't you think?\nAnd soon after that everyone else came strolling in one after another. After a few minutes everyone had gathered in the dining hall.\n53-TakasMeeting.png\n54-Taka21.png\n: Okay! It looks like everyone's here. Time to start the meeting! Let's all go around and share what we found during out respective investigations! The sooner we find out what's going on, the sooner we get out of here!\n56-Junko2.png\n: Wait, hold on a sec!\n58-Taka7.png\n: What's wrong!?\n60-Junko7.png\n: What about, uh...what's her name? You know, the silver-haired girl.\n56-Junko2.png\n: Uh...oh yeah, Kyoko!\n62-Taka.png\n: ...What about her?\n60-Junko7.png\n: She's not here.\n64-Taka13.png\n: What!?\nI took another look around the dining hall. Sure enough, she was nowhere to be seen.\n66-Hina9.png\n: I wonder where she went. Has anyone seen her?\nBut everyone just shook their heads.\n68-Chihiro5.png\n: Wait, so *nobody's* seen her?\nWhy hasn't Kyoko shown up yet? Could it be because...?\n69-FlashT.png\n71-FlashB.png\n72-Monokuma.png\n: Stabbing, strangling, bludgeoning, crushing, hacking, drowning, igniting, how you do it doesn't matter.\nYou must kill someone if you want to leave\n. It's as simple as that.\n73-Monokuma12.png\n: The rest is up to you. Give it your all to achieve the best outcome in the worst way possible.\nIs it possible? Was she really...? No, no. I'm just overthinking things.\n49-Taka4.png\n: Darn it Kyoko! You're really going to be late like this on the first day of school!? Not only is she late, she didn't tell anyone she would be late! A most unbecoming personality trait...\n76-Junko10.png\n: You're being a real jackass right now, you know that?\n78-Taka16.png\n: Well what do you want me to do!? Punctuality is everything!\n80-Taka8.png\n: Now then, I declare that the first session of the Hope's Peak Academy briefing meetings has begun!\n41-Sayaka17.png\n: Makoto... Actually, first of all... I've talked enough. Maybe we should listen to what everyone else has to say.\n5-Makoto.png\n: Okay, let's do that.\n8-Sayaka6.png\n: Hmhm. You know...\n5-Makoto.png\n: Huh? What's up?\n83-Sayaka14.png\n: I feel like I really have become your personal assistant, don't you agree?\n8-Sayaka6.png\n: I may not be the best assistant in the world, but I'll give it everything I've got.\nNo...you've already done so much as my assistant.\n18-Narration.png\n: It's time to see what the others were up to while we were unconscious, next time.\n2-BeautifulDeath.png\n3-Narration.png\n: Let's see what everyone has to say. We can only speak to Sayaka here.\n5-Sayaka.png\n: Okay, so since you're in the dark about all this, let me lay out what's been going on. Everyone split up to investigate different parts of the building, but...\n7-Sayaka17.png\n:\n[Byakuya]\nand\n[Taka]\neach went off on their own, and so did Kyoko. It looks like\n[Leon, Hiro, Junko and Chihiro]\nall grouped up together. The same goes for\n[Hina, Sakura, and Mondo]\n.\n[Celeste, Toko, and Hifumi]\nwere left over, so they joined up.\n> Byakuya\n9-Byakuya.png\n: I wanted to try and find some clue as to\nwho's responsible\nfor imprisoning us here... But unfortunately, I made no such discoveries. That's all from me...\n10-Taka2.png\n: Really? That's it?\n9-Byakuya.png\n: If I'd uncovered anything, naturally I would have more to say. But I didn't. So I don't.\n11-Taka18.png\n: R-Right, understood...\n> Taka\n13-Taka15.png\n: I spent some time looking around the dormitory, and...\n14-Taka7.png\n: There I made the discovery of the century! I found that there was exactly one room for each person!\n16-Hina23.png\n: Well yeah, I figured that our before anything else...\n17-Junko2.png\n: Each door already has a nameplate on it, so I guess all the rooms have been assigned already.\n18-Sakura3.png\n: And each room key was attached to a keychain with the owner's name precision-etched onto it.\nWhich confirms that the room I was in earlier is, in fact, my room.\n17-Junko2.png\n: And Chihiro and I found out that all the rooms are totally soundproof.\n20-Chihiro.png\n: Your next-door neighbor could scream their lungs out, and you wouldn't hear a thing...\n21-Celeste4.png\n: Well, each room also had a private bathroom, which could also lock.\n22-Junko7.png\n: But it looked like there were only locks on the bathrooms in the girls' dorms.\nHuh? But when I checked my bathroom door before, it definitely seemed like it was locked... That's weird... I should double-check that later.\n24-Mondo3.png\n: Okay, so they got a bunch of rooms ready for us. They're assuming we're gonna be here a while...\n25-Taka8.png\n: Well, better to have than have not! At least we don't have to worry about surviving like wild animals.\n26-Toko4.png\n: Th-That can't be all you have to r-report, can it Mr. Honor S-Student?\n13-Taka15.png\n: ...\n14-Taka7.png\n: That's all for my report! Let's move on to whoever's next!\n> Leon, Hiro, Junko and Chihiro\n22-Junko7.png\n: We went all up and down the school, double-checking the windows in all the hallways and classes. We wanted to see if we could get any of those metal plates to come off. And what happened was...\n30-Leon13.png\n: Nothing. Not a damn thing. We couldn't get a single one to budge even a little bit.\n31-Chihiro10.png\n: There wasn't any hope of escape anywhere... The school really has been totally cut off.\n32-Junko3.png\n: This sucks...\n34-Junko4.png\n: It *really* sucks! It sucks sucks sucks sucks SUCKS! What the hell are we gonna do!?\n35-Leon7.png\n: Goddamn, calm down! You're starting to make me nervous!\n> Hina, Sakura, and Mondo\n37-Hina20.png\n: We thought maybe we could find a way to communicate with the outside, so we went looking all over!\n38-Hina14.png\n: But...we didn't find a thing. Sorry...\n40-Mondo12.png\n: I went back to the main hall, thinking maybe we could do something about that giant hunk of metal.\n41-Mondo2.png\n: But even with Sakura and me both, it wouldn't budge. We hit it with desks and chairs, and nothin'...\n42-Mondo8.png\n: It was hard as, like...metal.\n44-Celeste9.png\n: Well yes, it *is* metal...\n45-Mondo13.png\n: Anyway, if we're gonna get outta here, it's not gonna be through there.\n38-Hina14.png\n: I feel like I could just cry... But no, I have to hold it in! I have to manage my hydration...!\n47-Sakura.png\n: I shall tell you what happened next... It has nothing to do with communicating with the outside world, but it's still worth worrying about. In both the school and dorm areas, there was a set of stairs leading up to another floor.\n48-Hina2.png\n: But there were gates there, and we couldn't find any way to open them, so we couldn't check it out.\n49-Sakura4.png\n: In other words, at this point we are only able to search the 1st floor.\n18-Sakura3.png\n: We can further assume that there is potentially something above the 2nd floor, as well. And if that's the case, there is at least a chance it may lead to a way out.\n> Celeste, Toko, and Hifumi\n44-Celeste9.png\n: If I am being honest, I can't quite say we acted as one. Rather, we did *nothing* as one. We spent the entire time in the gym.\n53-Celeste5.png\n: Honestly, we are not exactly the types to go running around a school like a gaggle of junior detectives.\n54-Junko9.png\n: What the hell were you thinking, just sitting around the gym the whole time?\n56-Toko12.png\n: W-Well it's not like any of you i-invited me along! Nobody said hey, c-come with us! I blame y-you for leaving me out! I-It's your fault!\n57-Junko8.png\n: If you wanted to go with someone, you should've just said something!\n26-Toko4.png\n: Hmph. F-Forget it. Like I'd w-want to go anywhere with a dirty s-slut like you...\n58-Junko10.png\n: Slut...?\n59-Toko.png\n: Your mind is as th-thin as your body. You m-make me sick to my s-stomach...\n57-Junko8.png\n: I...I don't even know how to react. How can you say something so awful to someone you just met?\n62-Hiro4.png\n: Alright guys, everybody just calm down, okay? All this stress is bad for your skin, y'know?\n63-Sayaka4.png\n: Yeah! It sounds like you two are so close now you're fighting like sisters!\nI...don't think that's what going on, Sayaka...\n5-Sayaka.png\n: So that's what they have to say, huh? Then I guess I'm the only one left...\n5-Sayaka.png\n: I went and had a look around the dining hall... I found a fridge in the back of the kitchen, and it was overflowing with all kinds of stuff.\n65-Sayaka6.png\n: I guess we don't have to worry about food at least.\n66-Hifumi19.png\n: Sure, for now. But even with all that, there are fifteen of us. How long can the food last...?\n59-Toko.png\n: Y-You can just eat sesame s-seeds or something...\n68-Hifumi9.png\n: Huh? What am I, a parakeet?\n69-Sayaka7.png\n: I don't think we have to worry about it. All the food gets restocked automatically each day.\n5-Sayaka.png\n: At least, that's what Monokuma said...\n58-Junko10.png\n: You saw him!?\n63-Sayaka4.png\n: Yeah, he came out of nowhere while I was checking the fridge, told me that, then disappeared again. He was so fast, I can't believe someone could have been moving him around with a remote control...\n71-Chihiro5.png\n: A weaponized toy that can just appear from nowhere... I can't tell if we're supposed to be afraid or not.\n72-Hina22.png\n: But was everything okay? He didn't try to like, eat you or anything?\n68-Hifumi9.png\n: E-Eat her...?\n74-Hifumi15.png\n: Um, what do you mean by that? I mean, when you say \"eat,\" what kind of eating are we talking about?\n75-Hina12.png\n: C-Come on, man!\n77-Leon15.png\n: What the hell, fatty!? You're acting like some kind of sleazy drunk dude.\n78-Hiro12.png\n: Not like there's a good kind of drunk dude...\n80-Junko5.png\n: Hey! Stop screwing around, all of you! Are you still asleep or something? We're prisoners here! We could all just die any second!\n42-Mondo8.png\n: She's right. We can't be makin' stupid jokes right now. We gotta do something, or--!\nA voice cut through the noise, interrupting Mondo.\n♪\nMusic fades out.\n♪\n???: You're all spending an awful lot of time yelling and carrying on.\n82-Kyoko2.png\n: Do you really think you can afford to do so? Have none of you accepted the reality of the situation?\n84-Taka9.png\n: Kyoko! Where the heck have you been!? We already started the meeting without you!\nShe didn't say a word. Instead, she just dropped a piece of paper on the table.\n86-DISTRUST.png\n87-Makoto.png\n: Huh? What's this...?\n82-Kyoko2.png\n: It appears to be a map of Hope's Peak Academy.\n87-Makoto.png\n: A map...?\n88-Taka16.png\n: Wh-What the...? Where did you find this?\n90-Kyoko3.png\n: It doesn't matter where I found it.\n25-Taka8.png\n: It DOES matter! You're really freaking us out right now!\n17-Junko2.png\n: Never mind that. What's it mean?\n92-Kyoko11.png\n: Just look at it. The building we're in right now is laid out in precisely the same way as Hope's Peak Academy.\n87-Makoto.png\n: So what you're saying is...this really is Hope's Peak Academy?\n92-Kyoko11.png\n: Well, in terms of its construction, yes. But it looks like it's had a number of strange...renovations done to it.\n87-Makoto.png\n: Renovations...?\n82-Kyoko2.png\n: I don't know all the details yet. All I found was details about the 1st floor.\n71-Chihiro5.png\n: But then...this really is Hope's Peak. We didn't get kidnapped and taken to some other place...\n42-Mondo8.png\n: So stupid it's not even possible. *This* is where the country's future elite are supposed to come and learn?\n95-Hina9.png\n: But if this really is Hope's Peak, where are all the other students?\n96-Hiro14.png\n: Hey, come on, guys. Let's just stop talking about all this...you know, negative stuff...\n87-Makoto.png\n: But aren't you worried? Things don't look good...\n97-Hiro.png\n: Worried? What's there to be worried about? I mean, this was all planned out, right? The people in charge of Hope's Peak put this all together, right?\n99-Hiro3.png\n: Man, if I got stressed every time something like this happened, I'd have ectoplasm shooting out my mouth!\n100-Hiro18.png\n: Good things come to those who wait, right? So we just gotta chill and everything'll work itself out!\n102-Celeste3.png\n: Hahaha!\n103-Toko2.png\n: Wh-Why are you laughing? What's so funny!?\n21-Celeste4.png\n: I am just happy, that is all. It seems splitting up to investigate was a good idea, after all.\n56-Toko12.png\n: Haven't you b-been listening!? Looking around was a t-total waste of t-time! We d-didn't find a way out, didn't f-find who's behind this. We still have no idea what's g-going on!\n106-Celeste6.png\n: Huh? Is it not crystal clear to you what is going on?\n108-DespairSyndrome2.png\n109-Celeste16.png\n: It is perfectly obvious that we have been imprisoned in some secret location, with no way out.\nNone of us had any response to that. We didn't want to accept that reality--but it was staring us right in the face.\n111-Toko9.png\n: You didn't h-have to go and s-say that. I w-was trying not to th-think about it... N-No way out... We're t-trapped in here. What are w-we supposed to d-do...?\n113-Byakuya3.png\n: It's very simple. If you want to leave, you just have to kill--\n80-Junko5.png\n: Don't even joke about that!\n114-Sayaka10.png\n: Everyone just calm down, please! We need to stop and think about what to do from here.\n35-Leon7.png\n: There's gotta be *something* we can do...\n21-Celeste4.png\n: All we can do is adapt. Adapt to living out lives here from now on.\n117-Chihiro11.png\n: Live here...? Are you saying we should just accept it?\n109-Celeste16.png\n: A lack of adaptability...is a lack of survivability. Survival is not based on who is the strongest or the smartest. It comes down to who can adapt.\n118-Celeste.png\n: As someone who has come out on top more than once, I have a suggestion.\n119-Mondo5.png\n: Huh? What do you mean?\n121-Celeste7.png\n: We all understand that we are trapped here. Which means we will be spending the night. However... You all remember the rule regarding nighttime, right?\n122-FlashT.png\n125-FlashB.png\n121-Celeste7.png\n: So regarding this \"\nnighttime\n,\" I think we need to add a rule of out own.\n87-Makoto.png\n: What do you mean?\n21-Celeste4.png\n:\nGoing out at nighttime\nshould be prohibited altogether. The school regulations do not actually tell us not to go out at night. I would like to make it official.\n127-Toko7.png\n: B-But why...?\n128-Celeste2.png\n: The way things are now, every time night comes we will all start to get worried and anxious.\n109-Celeste16.png\n: We will be afraid someone might try and come kill us.\n130-Sayaka9.png\n: What!?\n118-Celeste.png\n: If we have to worry about that night after night for who knows how long, it will wear us down in no time.\n47-Sakura.png\n: So you're suggesting we limit our activity at night as a kind of preventative measure.\n118-Celeste.png\n: However, unlike the other rules, nobody can be forced to comply. We all have to agree to follow it.\n32-Junko3.png\n: I see what you mean. But...I think I can agree to that. It's just like the little goth lolita said. Without something like that, we're just gonna self-destruct.\n14-Taka7.png\n: On behalf of all the men here, I agree to comply!\n133-Leon9.png\n: Hey, you can't just decide to speak for us!\n102-Celeste3.png\n: So everyone is in agreement?\n21-Celeste4.png\n: Good. Then, if you will excuse me...\n71-Chihiro5.png\n: Huh? Wait, where are you going?\n136-Celeste8.png\n: It is almost nighttime. I want to take a shower before it arrives.\n21-Celeste4.png\n: So...goodbye. *leaves*\nMoving with pure elegance, Celeste left the dining hall. Hey behavior seemed so natural, I couldn't imagine anyone even trying to stop her.\n68-Hifumi9.png\n: S-So I guess it's pretty obvious where we go from here. We'll be spending the night, it looks like.\n49-Sakura4.png\n: Adaptability...\n22-Junko7.png\n: So, Mr. Chairman...what next? One person already left.\n88-Taka16.png\n: U-Umm... Well then, what say we call an end to today's meeting!?\n25-Taka8.png\n: Like she said, it's almost nighttime anyway. We can reconvene first thing tomorrow morning!\n117-Chihiro11.png\n: Do we really have to stay the night here...?\n32-Junko3.png\n: We don't have a choice. We can't go for long without getting some sleep.\n140-Mondo15.png\n: So we have to just give up...\n59-Toko.png\n: That's all f-fine and good for t-today, but what to we d-do tomorrow?\n142-Sakura7.png\n: Our only option is to split up and look around again, and let everyone know if we find anything.\n48-Hina2.png\n: Yeah, okay. Let's do that...!\n22-Junko7.png\n: Then we're done for today? Good, I'm exhausted... *leaves*\nWith heavy movements, everyone headed off to their private rooms.\n144-Sayaka2.png\n: Makoto... Are you ready to call it a day?\n87-Makoto.png\n: Yeah, let's go.\n3-Narration.png\n: The dining hall fades out and we return to our room by ourselves.\n146-WelcometoDespair.png\n... Is this really where I'll be staying for the foreseeable future? Oh, that's right. I should check the bathroom one more time before I go to bed. Only the girls' bathrooms should have locks on them, right?\nAlright, let's open it up...\n*Rattle rattle*\n87-Makoto.png\n: It's no use. It really is locked.\n149-MrMonokumasLesson.png\n150-Monokuma.png\n: Bzzt! Wrong! Not locked!\n87-Makoto.png\n: Holy crap!\n150-Monokuma.png\n: Jeez, talk about an overreaction. It's like you just saw a ghost or somethin'!\n151-Monokuma11.png\n: Like...some kind of...robot bear...ghost.\n87-Makoto.png\n: Wh-What are you doing here!?\n153-Monokuma6.png\n: Makoto Naegi, this is super duper majorly bad! So bad it's almost magical! Ultra magical awful awful attack!\n150-Monokuma.png\n: In point of fact, I acknowledge that the bathroom in your room as\na problem with the doorframe\n!\n87-Makoto.png\n: Wait, so the reason it won't open isn't because it's locked? The door just...doesn't fit?\n154-Monokuma2.png\n: Didn't you see the notice? What, can't you read? The bathrooms in the boys' rooms don't have locks!\n155-Monokuma5.png\n: I mean, a lock on a boy's bathroom is kinda pointless, don't you think?\n157-Monokuma7.png\n: Well, it's not that it's pointless I guess. But I'm no expert on the birds and the bees and all that.\n159-Monokuma10.png\n: Anyway, there's a little trick to opening this particular ill-fitting door. And that's what I'm here to teach you! Okay, ready? So you just gotta turn the doorknob, then lift up while you pull!\n150-Monokuma.png\n: Go ahead, give it a try!\n87-Makoto.png\n: Turn the knob, and lift the door up while I pull...\nWhen I did that, the door opened without a problem.\n161-Monokuma4.png\n: Puhuhu... See? It opened right up! Isn't that crazy, though? Your door's the only one that doesn't fit quite right!\n155-Monokuma5.png\n: You're supposed to be the Ultimate Lucky Student, right? But look like you're not lucky at all!\n150-Monokuma.png\n: Anyways, I suddenly don't feel like being here anymore. Bye! *leaves*\n87-Makoto.png\n: H-Hey! Wait!\n... Dammit...\n♪\nMusic cuts out.\n♪\n163-GoodNight.png\n*Ding dong, bing bong*\n165-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\nLooks like it's nighttime. We all promised we wouldn't leave our rooms now.\n87-Makoto.png\n: All I can do now is try and get some sleep...\nWhile still mumbling to myself, I collapsed into bed. My eyes closed almost immediately. It's not that I was ready for bed, exactly. I was just utterly exhausted. It was as if I'd spent an entire day staring at a TV watching movies. Or like some kind of illusion where I'd been tossed into a made-up fantastical world.\n87-Makoto.png\n: Yeah, that feels about right... There's no easy way to just accept the situation we've suddenly been dropped into.\nSo this is how the curtain closed on my first day at Hope's Peak Academy. Soon enough, I was asleep. Would it be too much to hope that when I woke up, I'd realize it was all a dream? It's kind of lame as far as endings go, but I'd be fine with that. Actually, that'd be the best...\n149-MrMonokumasLesson.png\n169-MonokumaTheater.png\n: In any normal school, Mr. Monokuma would be a kind teacher. But when I think about what's coming up... I'm just so full of pride and joy. Our ceremony earlier today was absolutely splendid. Thank you all very much. Remember that you're all students of Hope's Peak Academy, and strive to refine your ideals. I swear to you, I will send you all off into a new tomorrow!\n1-GoodMorning.png\n3-MonokumaTV.png\n: Good morning, everyone! It is now 7 a.m. and nighttime is officially over! Time to rise and shine! Get ready to greet another beee-yutiful day!\nApparently, it's morning... But thanks to the total lack of windows, there's no way to know for sure. Anyway...what should I do now? ... Maybe I should go find Sayaka, and we can figure out where to go to from here together. She did say she's my assistant now.\n5-Makoto.png\n: Okay, it's decided! I'm gonna head to her room!\nWith a newfound determination, I left my room.\n7-BeautifulDeath.png\n8-Narration.png\n: Sayaka's room is just to the left of our room, but a few other students are already out and about this morning. We can go talk to them before meeting Sayaka. As you can see, Taka is out and about in the hall.\n10-Taka8.png\n: Good morning, Makoto!\n5-Makoto.png\n: G-Good morning...\n12-Taka3.png\n: Yes, morning greetings are quite a delight! Such an energizing way to start the day!\n13-Taka7.png\n: Now then, let's make sure we both do our very best throughout the day!\n5-Makoto.png\n: S-Sure...\nI wonder if he's always like this...\n8-Narration.png\n: Hiro is in the laundry room, so let's pop in and see what he's up to.\n18-Hiro13.png\n: Hey, man...\n5-Makoto.png\n: Good morning. What are you up to?\n18-Hiro13.png\n: I'm...doing my laundry. This *is* the laundry room, right?\n5-Makoto.png\n: Are you feeling okay, Hiro? You look totally beat...\n19-Hiro12.png\n: Nah, I'm fine. Just tired... I spent all last night trying to contact the spirit world to find out why this is all happening to me...\n18-Hiro13.png\n: It took all the mental juice I had, too. But turns out, I failed.\nSounds like something the Ultimate Clairvoyant would get into. ...Actually, is that really fortune-telling?\n8-Narration.png\n: Over in the dining hall, some others are having breakfast.\n5-Makoto.png\n: Good morning, Kyoko.\n22-Kyoko.png\n: ...Morning.\n5-Makoto.png\n: ...\n23-Kyoko2.png\n: ...\nThis doesn't seem to be going anywhere.\n5-Makoto.png\n: Umm...\n25-Kyoko3.png\n: Did you need something?\n5-Makoto.png\n: Oh, uh...no, nothing in particular.\n26-Kyoko19.png\n: Well then... *leaves*\nShe left. Kyoko seems kind of...how should I put it? Taciturn? Or maybe she just plays things cool.\n28-Chihiro4.png\n: Oh, good morning Makoto...\n5-Makoto.png\n: Good morning, Chihiro.\n30-Chihiro14.png\n: You know... we're standing here exchanging morning greetings, but... We can't even look out the window to see if it really is morning...\n5-Makoto.png\n: Y-Yeah, true...\n32-Chihiro7.png\n: S-Sorry if that was kinda weird...!\n5-Makoto.png\n: You don't have to apologize...\n33-Chihiro8.png\n: Sorry...\nShe looks really sad. I feel like I did something wrong...\n5-Makoto.png\n: Good morning, Byakuya. ...\nHuh? Did he not hear me?\n5-Makoto.png\n: Hey Byakuya! Good morning!\n36-Byakuya5.png\n: Once is enough...\n5-Makoto.png\n: Huh...?\n37-Byakuya7.png\n: I'm only here to get breakfast. I have neither need nor desire to talk to you. Now withdraw.\nSo he *did* hear me. He just didn't respond.\n8-Narration.png\n: That's everyone we can see before talking to Sayaka, so let's go talk to her.\nThere's a doorbell next to the door. I guess I should use that.\n*Ding dong*\n40-Sayaka.png\n: Hello...?\n5-Makoto.png\n: Good morning, Sayaka.\n42-Sayaka7.png\n: Oh, Makoto! Perfect timing!\n5-Makoto.png\n: Huh...?\n44-Sayaka3.png\n: Listen, I have a\n[favor]\nto ask...\n>favor\n5-Makoto.png\n: A favor...?\n45-Sayaka10.png\n: I was just getting ready to head out. If it's okay, would you like to come with me? Maybe we could talk...\n5-Makoto.png\n: Yeah, sure. Where are you headed?\n44-Sayaka3.png\n: Oh...umm... I've been thinking that...there might be something around here I could use for self-defense.\n5-Makoto.png\n: Self-defense...?\n45-Sayaka10.png\n: Well, I mean...whoever's keeping us here could show up and attack us at any time. You never know...\nWhoever trapped us here... Whoever presented us with rules for murdering each other... Whoever put us in this insane position... She's right--we never know when they might attack.\n45-Sayaka10.png\n: So I just...want to be able to protect myself no matter what happens.\nA weapon to protect herself... Well now that I think about it, that display case in the gym entryway had a bunch of stuff. Maybe...\n48-Sayaka6.png\n: Oh, the gym? Okay, let's go!\n5-Makoto.png\n: A-Again...?\n49-Sayaka4.png\n: Like I said, I'm psychic.\n48-Sayaka6.png\n: Come on, I'm just kidding! Seriously, I just have amazing intuition.\nAm I really so easy to predict? Anyway, we should head to the gym.\n50-Tutorial.png\n: For anyone who just haaates walking around the school, we've got some good news! You can now\nteleport\nusing the \"Map\" section of the Handbook Menu. It's as simple as opening the Map Menu and choosing where you want to go! However, you can only teleport to hallways and marked waypoints. Plus, you can't teleport to places you haven't been, or places that are blocked off. And depending on certain story moments, there will be times when you won't be able to teleport at all. Finally, try not to teleport inside any walls. There's a chance you could get lost. Forever. Well then...good luck, and have fun!\n8-Narration.png\n: So, teleporting is super-useful. There's basically no downside to using teleports when playing unless you really feel like walking it or there's someone along the way you want to talk to. Speaking of teleports though, our Map is finally available to look at.\n8-Narration.png\n: The map just shows a general layout of the area you're in. Its most important feature is telling you where people are at most times.\n8-Narration.png\n: Character portraits will appear when someone is in an area, letting you know exactly where the person you're looking for is. You can view other areas and teleport through here as explained previously. So right now, we could teleport directly to the gym but if we do so we would miss out on a bunch of conversations with the other students. For example, Hifumi and Celeste are in the Dormitory halls.\n55-Hifumi3.png\n: Hrrrm...!\n57-100MileJunkFoodDash.png\n58-Hifumi15.png\n: Mr. Naegi, Miss Maizono...! Wh-Where are the two of you off to!? A man and woman...growing closer...\n5-Makoto.png\n: H-Hey! What are you trying to say!?\n59-Hifumi12.png\n: Like when two people are stuck in a hostage situation and over the course of the story they fall in love...! There's really no other way to express it but to say...\n61-Hifumi14.png\n: How very poetic!\n5-Makoto.png\n: ...\n45-Sayaka10.png\n: Makoto... Do you have any idea what he's talking about?\n5-Makoto.png\n: Nope. I don't have a clue...\n7-BeautifulDeath.png\n64-Celeste.png\n: Well. Hello. I hope the two of you are having a nice day.\n48-Sayaka6.png\n: Good morning, Celeste.\n65-Celeste3.png\n: Exchanging such common greetings is somehow...strange.\n67-Celeste16.png\n: Given the circumstances and everything...\nYou know, sometimes...you scare me a little.\n68-Celeste4.png\n: Hmhmhm. Well, I'm off. *leaves*\n70-Sayaka2.png\n: ...\n40-Sayaka.png\n: Should we get going?\n5-Makoto.png\n: Yeah...\n8-Narration.png\n: In the 1st floor hallways, we can find the odd combination of Sakura, Hina and Toko waiting around together.\n73-Hina5.png\n: Well look who is it! 'Sup guys?\n5-Makoto.png\n: What are you up to?\n74-Hina22.png\n: We're picking up where we left off yesterday. I'm really hopin' we find something today! If we do, I'll be sure to let everyone know ASAP!\n76-Sakura7.png\n: We have to find some way out of here, no matter what.\n40-Sayaka.png\n: And that's why you went with Hina and Toko?\n77-Sakura6.png\n: Well, Hina's the one that invited Toko. I have trouble talking to people directly...\nAh, understandable.\nToko together with those other two... Quite a combination.\n79-Toko.png\n: ...\n80-Toko2.png\n: What do you w-want? You l-look like you have s-something to say...\n5-Makoto.png\n: Oh, no. I was just thinking that you three make a pretty unique team.\n81-Toko4.png\n: L-Let me make this perfectly c-clear! Me hanging out w-with two people who have muscles where th-their brains should be is not by ch-choice!\n82-Hina16.png\n: Wow, that was super mean!\n84-Hina19.png\n: Yesterday you were complaining how nobody invited you! That's the only reason I asked you to come with us!\n85-Toko12.png\n: I never a-asked you to d-do that! S-Stop trying to drag me farther into y-your meat dimension! *leaves*\n87-Hina2.png\n: Jeez, I can't believe she just ran off! You think we should go after her?\n88-Sakura3.png\n: We shouldn't pressure her any further.\n89-Hina23.png\n: Oh yeah, good point...\nThey're like water and oil anyway. It'd be weird if they *did* get along.\n8-Narration.png\n: We can also go into the entrance hall to find Leon and Mondo hanging around.\n92-Leon14.png\n: Man, what the hell is with this metal hatch thing? It's really on there, that's for damn sure. Anyways, there's nothing to do around here. Gonna friggin' die of boredom...\n93-Leon2.png\n: And being stuck in here is keeping me from racing toward my dream, too.\n49-Sayaka4.png\n: Your dream...?\n95-Leon3.png\n: Yeah! To become a musician! You can sense my aura, right? The strongest vocals of the century right here!\n96-Leon12.png\n: God, I feel so cool getting to say that in front of a national celebrity...\n98-Sayaka8.png\n: ...Dreams...\n5-Makoto.png\n: Did you say something?\n48-Sayaka6.png\n: Oh, sorry. It's nothing. Come on, let's go.\n5-Makoto.png\n: Mondo...? What are you doing?\n100-Mondo2.png\n: Trying to find a way out. I figured I'd give it another shot.\n101-Mondo12.png\n: There's gotta be a way to bust this thing open!\n103-Mondo4.png\n: But I suck at thinkin' stuff up, so I guess I'll let you guys figure it out.\n104-Mondo7.png\n: Once it's time to act, though, you just lemme know. I'll show you what a real man can do!\n5-Makoto.png\n: Wow, sounds like we can really count on you.\n8-Narration.png\n: According to the map, Junko is in the School Store, so let's visit there. We haven't been in here before.\nYup, this is definitely the school store. But it has a kind of a Japanese/Western blend. It seems more like a cluttered antique store...\n109-Junko6.png\n: Hey there, Ma~ko~to~! Ohh, is it just the two of you right now? Are you on a da~~te?\n5-Makoto.png\n: Wh-What!?\n109-Junko6.png\n: Damn, Makoto! I never woulda guessed, but you're a total player, huh?\n48-Sayaka6.png\n: No, no, it's nothing like that. I'm his assistant!\nTo be dismissed just like that is somehow...\n111-Junko9.png\n: Huh? His assistant? What is that, like some new kinda roleplay thing?\n109-Junko6.png\n: Well, whatever. What you're into is your business. I don't judge! Anyway, if you don't mind! *leaves*\n5-Makoto.png\n: ...L-Let's just head to the gym already!\n113-Sayaka14.png\n: Yeah, let's go.\n8-Narration.png\n: Next time, the gym.\n3-BeautifulDeath.png\n5-Sayaka.png\n: Here we go. I might be able to find something here to protect myself with...\n6-Sayaka17.png\n: Yeah, I'm sure I'll find something in the display case I can use.\n8-Narration.png\n: Self-defense, huh? That sword seems like the most useful thing available.\nIs this...a sword? Oh, no, I think it's just a replica. Still, it's pretty impressive. It's completely covered in a gold coating. But...\n10-Makoto.png\n: Jeez! I barely touched it and I got that gold stuff all over my hands.\n12-Sayaka10.png\n: Wow, you're right. Your hands are totally gold! Even just for self-defense, I think it's a little...\n10-Makoto.png\n: Well, it's still better than nothing, I guess.\n5-Sayaka.png\n: You should take it with you! It might help liven up your room a little.\n10-Makoto.png\n: You think so?\n15-Sayaka6.png\n: But I guess you'd better be careful taking it back. You should wrap it in newspaper or something.\nAnd just like that, it's been decided...\n6-Sayaka17.png\n: I don't see anything I could really use for self-defense...\n10-Makoto.png\n: H-Hey, don't worry about it! It's not like you need it right away, right? Plus, if anything *were* to happen... When the time comes...I'll protect you.\n18-Sayaka9.png\n: You'll...protect me?\n20-Sayaka14.png\n: Thank you for saying that... If I've got you on my side, I guess I don't need a weapon after all!\n21-BeautifulDays.png\nSayaka giggled as she said that. That mysterious smile... I can tell it comes from the heart. It makes me feel at ease... When I look at her, I honestly feel like I can do anything.\n23-Sayaka7.png\n: Okay, we can stop looking for a weapon, then. But as long as we're here, let's hang out a bit more.\n5-Sayaka.png\n: Umm......\n6-Sayaka17.png\n: I know I said I wanted to talk to you, but now that we're here...I don't really know what to talk about.\n26-Sayaka2.png\n: And I was the one who invited you to come with me, too. Sorry...\n10-Makoto.png\n: It's okay. I mean, if there's nothing to talk about, then we can just not talk, right?\n5-Sayaka.png\n: Huh?\n10-Makoto.png\n: You don't have to force yourself to talk. We can just, I dunno...stare off into space or whatever.\n6-Sayaka17.png\n: Stare off into space...?\n10-Makoto.png\n: Oh, but you're probably super bored! Just standing around doing nothing...\n5-Sayaka.png\n: No, it's not that it's boring. It's just...\n29-Sayaka3.png\n: I've never really done it before. I don't have a lot of time to just...do nothing.\n10-Makoto.png\n: I-I guess that makes sense. You're not a normal high school student like me. You've got tons of stuff to do every day.\n26-Sayaka2.png\n: ...Hey, um...this is kinda out of nowhere, but... Makoto, do you have a\n[dream]\n?\n> dream\n10-Makoto.png\n: Well...what about you, Sayaka? What's your dream? I'd love to hear...\n31-DeathWish.png\n32-Sayaka8.png\n: I... My dream is... I've always wanted to be a star, as long as I can remember. I grew up without a mother, you know... And my dad worked really late every night. I was always home alone... I was just a kid, ya know? So I was really lonely. But that all changed when I saw a pop star on TV for the first time. She was so pretty, like a princess. And she could sing, and dance... But more than anything else, there was her smile. Looking at her smile, I could feel my loneliness melting away. I decided that's what I wanted to be someday. I wanted to give that kind of encouragement to others.\n15-Sayaka6.png\n: Eventually, that became my dream.\n10-Makoto.png\n: That's so amazing, though. You were able to actually fulfill your lifelong dream. Honestly, it's really incredible.\n35-Sayaka4.png\n: ...I did whatever it took to reach that dream. I mean it. Even some things that...weren't so pleasant.\n10-Makoto.png\n: Huh...?\n37-Sayaka5.png\n: I honestly believed that as long as you kept chasing your dreams, someday they had to come true. But to do that, you can't take your eyes off of your dream, not even for a second. Even if sometimes it's a bad dream... Whether you're awake, whether you're asleep... To make your dream a reality, you have to keep your gaze fixed on it no matter what.\n26-Sayaka2.png\n: In that world, if you lose focus for even a split second, you get left behind. You have to keep on swimming against the current, without even taking time to breathe... That's the kind of world my dream lives in.\n10-Makoto.png\n: I-Is it really that tough? Is it not fun at all?\n12-Sayaka10.png\n: Oh no, don't get the wrong idea. It's super fun!\n37-Sayaka5.png\n: But...that's exactly what scares me.\n10-Makoto.png\n: Huh...?\n32-Sayaka8.png\n: I enjoy every single day I wake up and get to do what I do. Everyone in our group is amazing. We're rivals in a way, but they all mean so much to me. We've been performing together since we were young, so they're all\nlike family to me\n. Without them, I would have given up on my dream a long time ago. To work together, and fulfill our dreams together, has brought me so much happiness...\n37-Sayaka5.png\n: But that's the thing that scares me the most. If the world gets tired of us, then what happens? What happens to us? Then the dream dies, those wonderful days come to an end, and everyone goes their separate ways...\nS-Sayaka... She's trembling... She must be terrified. She worked so hard, sacrificed so much, to get where she is. She must be terrified of losing it.\n37-Sayaka5.png\n: So that's the reason I decided to come to Hope's Peak.\n10-Makoto.png\n: Huh? What do you mean?\n37-Sayaka5.png\n: Well...they say that if you graduate from here, success is basically guaranteed. Which means I could keep on performing with my best friends, for ever and ever. At least, that's what I thought. I really did believe that, but...now we're trapped here, with no way out. They're probably waiting for me...\n40-Sayaka11.png\n: While I'm in here, the world out there is forgetting about me. Minute by minute, we're all disappearing. But still...\n10-Makoto.png\n: Sayaka...?\n42-Sayaka12.png\n: I can't afford to be stuck in here!\nThat was the first time I heard her cry out from deep within herself. She sounds...desperate. But I can understand why she'd feel that way. Trapped here this way, the dream she put so much effort into is on the verge of disappearing forever. And that isn't something that can be fixed with a few kind words. The weight she's carrying... I can't even imagine it.\n29-Sayaka3.png\n: Ah--I'm sorry, I didn't mean to complain..\n26-Sayaka2.png\n: I kinda killed the mood, huh?\n10-Makoto.png\n: No, not at all.\n29-Sayaka3.png\n: I'm really sorry...\n10-Makoto.png\n: ... Um, Sayaka...Actually, are you hungry? Before we head back, why don't we go to the dining hall and get some food?\n29-Sayaka3.png\n: ...So...\n21-BeautifulDays.png\n23-Sayaka7.png\n: You want me to make us something to eat? I might not look like it, but I'm actually a pretty good cook!\n10-Makoto.png\n: Wow, really? What's your specialty?\n35-Sayaka4.png\n: Chili oil.\n10-Makoto.png\n: You mean the condiment!?\n15-Sayaka6.png\n: Hahaha. Just kidding!\nShe burst out laughing. Her earlier mood disappeared, replaced by the bright smile I'd quickly grown used to. But how'd it happen so fast? It was almost like a mask, like some kind of neutral expression.\nAnyways, we headed to the dining hall to get something to eat before returning to our rooms.\nThe only thing in my room is...a fake sword covered in gold. All it does is make me feel that much more uncomfortable. Anyway, there's still plenty of time left in the day. I really don't feel like just sitting here. Maybe I'll take a look around...\n47-Tutorial.png\n: You're about to have your first experience with\nFree Time\n. As you live out your school life here, you will be given\nfree time\nat certain points. During your free time, you can spend time with your fellow classmates to\ndeepen your friendships\n. You can also give them\npresents\n, which can potentially give them an even better impression of you! You can get these presents from the\nMonoMono Machine in the school store\n. Come by early and often!\n47-Tutorial.png\n: At certain points, you'll witness intimate events, and\nnew info will be added to each person's report card\n. These events can also open up new\nskills\n, which will prove useful as everything plays out. We strongly encourage you to develop and deepen as many friendships as you can! Also keep in mind that when you talk with a classmate\ntime will pass\n... When you're finished, you will automatically return to your room.\n47-Tutorial.png\n: After a certain amount of time passes, your\nfree time will come to an end\nand the story will progress. If you'd prefer\nnot to engage in free time\n, you can always choose to simply\ngo to sleep to skip it\n. We wouldn't recommend this approach, but if you absolutely MUST press forward with the story, then...\n47-Tutorial.png\n: Anyways, why don't you try it out by spending some time with Miss\nSayaka Maizono\n? She's the ideal partner to begin with, don't you think?\n8-Narration.png\n: So Free Time is where we get to spend some time with the other students and see what they have to say about the situation and their lives. We are forced to meet with Sayaka for the first one as tutorial, but after that we are free to hang out with anyone we want. Additionally, some people will be unavailable to spend time with on occasion.\n8-Narration.png\n: My plan with free time is to choose who to spend time with on my own. As was mentioned, skills can be earned from free times and are very useful to have for a the trial portions. I'd like to get myself some early skills that will help throughout the LP but to do so I need to choose who to spend time with myself. Additionally, it allows me to create a backlog of updates and work ahead since I don't have to stop for impromptu voting.\n8-Narration.png\n: So then, next time, we'll spend some Free Time with the others.\n2-BeautifulDays.png\n3-Narration.png\n: Before we begin Free Time, we need to get some things. Remember this machine from a previous update? Well the time has finally come to talk about presents.\n3-Narration.png\n: Presents are used in conjunction with Free Time. Each person has presents that they like, love and hate. There are something around 100 presents that you can give out and a few more that are related to progression through the game's chapters and postgame stuff. There isn't really a good way to figure out what presents someone will or won't like because while you can make some good educated guesses based on each present's description and what you know of everyone's characters, occasionally there will be a few things you think they might love/hate that they actually think the opposite of. If you give a present they love, you only need to give them that one present. If it's just something they find acceptable, you may need to give them a second one.\n3-Narration.png\n: The presents themselves come from this machine in the school store called the MonoMono Machine. This is also where the Monocoins we've been picking up are used.\n3-Narration.png\n: So here's how the machine works. You put in at least one coin and push X to get a present.\n3-Narration.png\n: It's very simple. However, as you get more presents, the Repeat % number will go up, telling you the chance of getting a repeat present. You can make this number go down by using more coins but I've found it to not usually be worth it to use too many. As long as you have a wide enough variety of presents, you're sure to have something that a person will love. Not only that, but you receive lots of coins at the end of each chapter, meaning that the next time you come here you could have an easy 50+ spins. You can also give someone the same present twice and there's no downside. It's really not hard to have presents the people you want to spend Free Time with will love.\n3-Narration.png\n: Also, you will randomly get a free bonus spin. This spin does take into account the Repeat %.\n3-Narration.png\n: I spent all the coins I had since having a variety of presents in Chapter 1 is difficult due to the low number of coins available at this point in the game. You can see that our presents list is beginning to fill up.\n3-Narration.png\n: Now that we have presents, we can begin Free Time in earnest.\n3-Narration.png\n: As mentioned, the game requires you to visit with Sayaka for the first Free Time, so let's see how she's doing.\nI guess I should press the doorbell...\n*Ding dong*\n12-Sayaka2.png\n: You know, Makoto... I'm so anxious. I really am afraid...\n> Spend some time with Sayaka\n15-Sayaka10.png\n: Are you going to...try and cheer me up?\n12-Sayaka2.png\n: Sorry for making you take time out of your day like this...\nI did my best to comfort Sayaka. Sayaka and I grew a little closer today.\n> Yes, definitely\nCherry Blossom Bouquet:\nA collection of branches from a sakura tree. In the language of flowers, cherry blossoms represent \"a woman of superior beauty.\"\n20-Sayaka7.png\n: To receive something so wonderful makes me happy, but...\n22-Sayaka14.png\n: ...to get it from you, Makoto... I can't begin to describe the feeling...!\nSeeing Sayaka so pleased with something I gave her makes me happy!\n23-DeathWishNoIntro.png\n12-Sayaka2.png\n: Umm, Makoto? Do you think you could make time for the two of us to talk?\n24-Makoto.png\n: Wh-What's wrong? Why are you being so formal?\n26-Sayaka4.png\n: W-Well, it's just... I guess that was kind of formal, but... it's just because I know I can count on you.\n24-Makoto.png\n: ...Huh?\n28-Sayaka6.png\n: Having you by my side really makes me feel a lot better.\n29-Sayaka5.png\n: If you weren't here with me, I just don't know what I'd do. I'd be lost...\n28-Sayaka6.png\n: I hate that we had to meet again under such awful conditions, but...I'm relieved you're with me.\n24-Makoto.png\n: Sayaka...\nStanding here face to face and hearing her say that... It's nice, but...kind of embarrassing at the same time.\n24-Makoto.png\n: I...know how you feel. You being here is what saved me...\n20-Sayaka7.png\n: R-Really? Ehehe. Thank you for the flattery.\nThat smile... That mysterious smile that softens my heart... I really wasn't flattering her. That smile saved me.\n31-Sayaka17.png\n: But it's kind of strange, you know? I never thought I'd get a chance to really talk to you like this. All through middle school, you never talked to me. In fact, you never even looked at me.\n24-Makoto.png\n: It's because you were like a celebrity. I couldn't just go around staring at you... Wait, how do you know I never looked at you?\n33-Sayaka.png\n: Because I looked at you all the time...\n24-Makoto.png\n: ...Huh?\n26-Sayaka4.png\n: I was always looking for\nan opportunity to talk to you\n.\n24-Makoto.png\n: You...wanted to talk to me?\n35-Sayaka3.png\n: But since I always had so many people around me, we ended up graduating without saying a word. That was one of my biggest regrets.\n24-Makoto.png\n: But why me?\n15-Sayaka10.png\n: Do you remember during our first year of junior high, that huge bird wandered into the school pond?\nActually, now that I think about it...I do sorta remember something like that...\n31-Sayaka17.png\n: It was like something out of a fairy tale. The turtle one every million years, that bird once every thousand...\nA huge bird wandered into the school pond during our first year of junior high... I think it might have been...\n> Crane\n24-Makoto.png\n: It was a crane! It just walked right into the pond.\n38-Sayaka9.png\n: That's right! That's what it was. It was so big, the teacher had no idea what to do.\n22-Sayaka14.png\n: But you led it into the forest behind the school. You helped it find its way out.\nWell, only cuz I was already in charge of taking care of the animals at school. They made me do it...\n29-Sayaka5.png\n: I should have said thank you then, but...is it okay if I do it now?\n24-Makoto.png\n: Thank me...?\n26-Sayaka4.png\n: I'm that crane, you see. I've come to return the favor. Here, let me make you a cloak...\n3-Narration.png\n: The closest reference I could find to cranes and cloaks were legends of\nSwan Maidens\nthat come from various cultures, including Japan. They typically have to do with a man stealing a cloak of feathers from a swan maiden so she cannot fly away, then marries her. She bears his children, then at some point gets her cloak back and flies away.\n28-Sayaka6.png\n: Ehehe. Just kidding!\n24-Makoto.png\n: Y-Yeah, I kinda figured...\n26-Sayaka4.png\n: Honestly though, I was so impressed... That's why I always wanted to talk to you, even just once.\n12-Sayaka2.png\n: I never imagined this would be how I got my chance...\nYeah. If we'd met again at a train station somewhere downtown, that'd make for a nice dramatic reunion. But instead it's this weird school.\n41-Sayaka8.png\n: Maybe, but still... I'm sure you'll help me find my way out, just like that crane. You'll save me.\n33-Sayaka.png\n: It's just intuition, I know, but I still believe it.\nI'm going to save her...?\n24-Makoto.png\n: I'll do my best, I promise that. I'll make sure it's more than intuition. If there's anything I can do, I'm going to do it...!\n28-Sayaka6.png\n: I believe in you. Besides, my intuition always turns out to be right.\n26-Sayaka4.png\n: Cuz I'm psychic.\n20-Sayaka7.png\n: Ehehe. Kidding, kidding!\nShe laughed out loud as she said it. The closer we get, the stronger that smile of hers makes me. ...I was glad to feel that way.\n42-Tutorial.png\n: Sayaka's\nReport Card\nhas been updated based on your experience with her. You just unlocked the skill\nMelodious Voice\n! Give yourself a pat on the back. You've earned it!\nOnce we were all done, I headed back to my room for a little while...\n44-GoodNight.png\n♪\nNo Music.\n♪\n*Ding dong, bing bong*\n47-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\nToday's already come to an end. But I swear...tomorrow I'm going to find some kind of clue! I swear!\nAs my eyelids began to slide closed...the conversation I'd had with Sayaka that morning began to replay. In a way, it's almost frustrating... Even if I understand where her desperation is coming from, I can't share in it. The pressure she's under is way different from anything a normal high school like me goes through. She didn't just stumble into this school the way I did. So I can't say I feel things the way she does. Compared to her...no, compared to everyone else here...there's no doubt I just don't match up. I guess that might explain my own frustration...\n49-MrMonokumasLesson.png\n51-MonokumaTheater.png\n: Ahem, so...I'm sure that you've noticed the killing game has begun, but... there's still room for a little laughter. It seems our newest students, already so filled with despair, still have some hope of escape! Puhuhu... So when will it begin? When will their\nhope\nbegin to die? Is it time yet? Is it time!? Heartpounding excitement!\n52-GoodMorning.png\n*Ding dong, bing bong*\n47-MonokumaTV.png\n: Good morning, everyone! It is now 7 a.m. and nighttime is officially over! Time to rise and shine! Get ready to greet another beee-yutiful day!\nMorning has come. What should I do today?\n2-BeautifulDays.png\n3-Narration.png\n: We have another 2 Free Times today.  Because we only have a few presents, our choice for who to visit with is a little more limited than it will be in future chapters, but I decided to visit with Leon and Byakuya. We have gifts they both love and they also have skills that will help us more than Sayaka's skill will right now. Convenient!\n3-Narration.png\n: We can find Leon in the halls of the Dormitory.\n57-Leon2.png\n: What're you doing, Makoto!? We gotta hurry up and find a way outta here!\n> Spend some time with Leon\n59-Leon7.png\n: Y-You're not trying to get me alone so you can kill me, are you...?\n60-Leon6.png\n: My fans will all go psycho on you if you do! I'm as popular as any international superstar!\n62-Leon4.png\n: But if you're NOT gonna murder me, then let's hang out. I don't really wanna be alone, anyway...\nI spent some time with Leon... Leon and I grew a little closer today.\nProject Zombie:\nA mature game designed for the Funplane, where a former runway model takes zombies as slaves in a post-apocalyptic world. It's been out of print for a while...\n59-Leon7.png\n: Are you shitting me? I can have this!?\n66-Leon3.png\n: This is cool. Super cool! I feel like maybe I do't even hafta get outta here anymore!\n60-Leon6.png\n: Hah! Yeah, right! I still totally hafta get outta here.\nSeeing Leon so pleased with something I gave him makes me happy!\n68-Leon13.png\n: I'm not even afraid anymore. Now I'm just pissed off...\n60-Leon6.png\n: Why!? Why is this happening to me!? This isn't fair, man! I mean, am I wrong?\n24-Makoto.png\n: Oh, um... Yeah, it really isn't.\n70-Leon12.png\n: Right!? Totally unfair. Ultra unfair! Just like having to shave my head right before every baseball game!\n24-Makoto.png\n: Well, I mean...you chose to do that, right?\n60-Leon6.png\n: C'mon, man! Are *you* against me now, too!? I didn't even wanna play! But the coach and all the teachers begged me, so I did it! And then they made me shave my head, just cuz it's \"tradition.\" How's that fair!?\n24-Makoto.png\n: You really hate baseball that much, huh...?\n57-Leon2.png\n: Damn straight I do! Who has fun running around on a dusty field for three hours!?\nBut...for baseball players, the field is like sacred ground, isn't it?\n68-Leon13.png\n: But it's so not cool! Spending all that time at practice, getting covered in sweat and dirt...\n73-Leon.png\n: It's just baseball, right? It's easy! Who needs practice!?\nI think the gods picked the wrong person to bless with that much talent...\n75-Leon11.png\n: Still...I gotta admit, baseball wasn't\nall bad\n. It did have a few things going for it...\n24-Makoto.png\n: Yeah, right? Like the\nfeeling of camaraderie between you and your teammates\n!\n73-Leon.png\n: Nah, nothin' like that! I can't stand being around a bunch of sweaty guys. So totally uncool!\n24-Makoto.png\n: Then...what did you like about it?\n62-Leon4.png\n: Well, I hate studying, right? But I still got into this super fancy school on a sports scholarship. As long as I kept playing, I never had to study! And besides that...\n66-Leon3.png\n: It made me super popular with the ladies! Booya! Ya jealous? I got to third base in more ways than one, if ya know what I'm sayin'! ...Just kidding!\n24-Makoto.png\n: ...\n62-Leon4.png\n: Heh-heh. I got plenty more where that came from! I'll tell ya more about it next time. Anyway, let's hang out again sometime! Talking to you helps me keep my mind off this place... *leaves*\nWith a smile on his face and a spring in his step, Leon strolled away. I'm not really sure why, but I guess Leon likes hanging out with me...\n42-Tutorial.png\n: Leon's Report Card has been updated based on your experience with him. You just unlocked the skill\nRobot Jock\n! Give yourself a pat on the back. You've earned it!\nOnce we were all done, I headed back to my room for a little while...\nThere's still lots of time left in the day. I really don't feel like just sitting here. Maybe I'll take a look around...\n3-Narration.png\n: For the next Free Time, we can find Byakuya in the dining hall.\n79-Byakuya3.png\n: So the only way to get out of here is to kill someone. Interesting...\n> Spend some time with Byakuya\n81-Byakuya.png\n: ...\nI spent some time with Byakuya in silence... Byakuya and I grew a little closer today.\nPrince Shotoku's Globe:\nA spherical representation of Earth, about the size of a softball. Some believe it to be an \"OOPArt\" since it depicts a round Earth, despite being many centuries old.\n85-Byakuya9.png\n: Now this is a rare moment. Coming from a noble family, I've never been exposed to such vulgarity. Interesting. I think I'll keep it.\nSeeing Byakuya so pleased with something I gave him makes me happy!\n81-Byakuya.png\n: ...I have a question for you.\n24-Makoto.png\n: Huh? You do?\n88-Byakuya2.png\n: Something's been bothering me for a while now, and I can't take it anymore. So to answer my question...\n85-Byakuya9.png\n: I need you to explain to me what exactly your \"Ultimate Lucky Student\" title means.\n24-Makoto.png\n: Oh, well... I don't totally get it myself, but...what I do know is that I was picked at random from a pool of normal students.\n85-Byakuya9.png\n: So you just got into Hope's Peak by blind luck.\n79-Byakuya3.png\n: I see. Well that answers my question.\n24-Makoto.png\n: What was the question...?\n79-Byakuya3.png\n: How a commoner like you, with absolutely no unique talents or abilities, could get into this school.\n90-Byakuya7.png\n: Oh, I forgot to mention boring. How a boring, untalented, utterly generic commoner got in...\nBoring? Generic?\n24-Makoto.png\n: D-Did you really have to list all that off?\n90-Byakuya7.png\n: But it's the truth.\n24-Makoto.png\n: Maybe compared to you, the Ultimate Affluent Progeny and all... But even I--!\n92-Byakuya4.png\n: You seem to think it's merely an issue of title. But make no mistake... My lineage, intelligence, figure, athletic ability--they are all ultimate.\n94-Byakuya8.png\n: Which is to say, I am the\nUltimate Perfection\n. Feel free to begin calling me that, in fact.\nHe's really taking this to the extreme...\n79-Byakuya3.png\n: You, who have nothing. I, who have everything. We are living proof that all men are *not* created equal. You have my pity, Makoto. Life can be very cruel indeed.\n24-Makoto.png\n: ...\n90-Byakuya7.png\n: And because I pity you so much, perhaps someday I'll allow you to hear my tale of glory. Consider it a blessing, a gift from me to you, to allow you to bask in my glory. *leaves*\nHaving finished his mean-spirited lecture, Byakuya left me standing there in silence.\n24-Makoto.png\n: I learned one thing about Byakuya today... Anytime I talk to him, I need to be prepared for extreme psychological trauma.\n42-Tutorial.png\n: Byakuya's Report Card has been updated based on your experience with him. You just unlocked the skill\nCool and Composed\n! Give yourself a pat on the back. You've earned it!\nI did my best to keep my spirit from shattering like glass, and went back to my room.\n44-GoodNight.png\n*Ding dong, bing bong*\n47-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\nThe third day here has already come to an end. When will I--no, we... When are we gonna get out of here? I laid on my bed and stared blankly at the ceiling. And before I knew it, I'd fallen into an uneasy sleep.\n49-MrMonokumasLesson.png\n51-MonokumaTheater.png\n: I need an immediate, fast-acting pick-me-up! If it doesn't act now, it's the same as giving in to regret. What do you think guides the world? Speed, of course! That's why Formula One drivers are so popular! Any idiot can accomplish something if they take it slow. Even a human piece of excrement could create a masterpiece if they spent their entire life on it! Someone who does things in a timely fashion is both wise and admirable. Straight is better than a curve or an angle. Freestyle is better than the backstroke or breaststroke! Drive-thru is better than sit-down! A Sunday comic artist is smarter than a graphic novelist! What I'm saying is, speed is the gold standard of the standard world. Which is why I said I need that pick-me-up! (Meanwhile, 0.000002 seconds later...)\n1-GoodMorning.png\n*Ding dong, bing bong*\n4-MonokumaTV.png\n: Good morning, everyone! It is now 7 a.m. and nighttime is officially over! Time to rise and shine! Get ready to greet another beee-yutiful day!\nI woke up to the irritating sound of Monokuma's voice; I slowly pulled myself out of bed.\n6-Makoto.png\n: Gh... Another night of restless sleep. Day after day, I can feel the fatigue piling up...\nAs soon as the thought had cross my mind...\n*Ding dong*\nThe sound of the doorbell forced its way into my room.\n7-BeautifulDeath.png\n10-Taka3.png\n: A fantastic morning, isn't it!?\n6-Makoto.png\n: T-Taka?\n11-Taka.png\n: Now then, if you'll pardon the interruption!\nWithout waiting for a reply, Taka barged into my room.\n6-Makoto.png\n: ...What's up, Taka?\n14-Taka18.png\n: No matter how intensely the stormy seas may batter me, I will not fall as long as my feet are firmly planted! ...You agree, right?\n6-Makoto.png\n: U-Um, I'm not sure I understand...\n14-Taka18.png\n: And if you can't do it alone, just find someone to support you, and you can support them back!\n16-Taka8.png\n: That's how you can overcome any storm!\n6-Makoto.png\n: ...\n17-Taka15.png\n: I was thinking about it last night, and...I decided we all need to really come together. And that was when I realized... Every morning from now on, after the morning announcement, everyone should have breakfast together!\n19-Taka7.png\n: And now is the beginning of that fateful day! Please head to the dining hall at your earliest convenience!\n20-Taka9.png\n: That's all for now! I have to go let everyone else know the good news! *leaves*\nTaka didn't even wait for a reply. He turned and left, before I could say a thing.\n6-Makoto.png\n: Well...I guess I'd better head to the dining hall.\n22-Narration.png\n: As usual, we can find a few people out in the hallway before we go to the dining hall.\n25-Junko9.png\n: Makoto! Can't any of you guys get a freakin' clue!?\n6-Makoto.png\n: Huh?\n26-Junko2.png\n: My mascara's totally clumpy! I don't want anyone to see me this way, but Taka came and woke me up. What a dick!\n6-Makoto.png\n: You look just the same as yesterday to me...\n25-Junko9.png\n: As if! It's like night and day!\n6-Makoto.png\n: S-Sorry...\n26-Junko2.png\n: Ugh! I seriously need to reapply, but there's nothing I can do about it now... Maybe I'll go see if Celeste can hook me up... *leaves*\n6-Makoto.png\n: ...And that's that.\nWe've been imprisoned here, and that's what she's worried about right now...\n30-Leon14.png\n: Ugh, so freakin' tired...\n31-Leon.png\n: The hell's wrong with that guy...? Did he wake you up, too?\n6-Makoto.png\n: Yeah, he sure did. I guess he's going around waking up everyone.\n32-Leon2.png\n: It's seriously annoying.\n34-Leon4.png\n: I'm goin' back to bed. If anyone needs me, I'll be in my room.\n6-Makoto.png\n: I don't think it'll do any good. I'm sure he'll just come bug you again.\n30-Leon14.png\n: Yeah, prolly. Dammit... I guess we'd better just go, then. *leaves*\n6-Makoto.png\n: ...And that's that.\n37-Toko.png\n: ...\n6-Makoto.png\n: Um, Toko?\n39-Toko4.png\n: Wh-What...?\n6-Makoto.png\n: Oh, I was just wondering what you were doing here. You should probably head to the dining hall, right?\n37-Toko.png\n: I-I-I know! I just need to p-prepare myself mentally...\nPrepare herself? What is she talking about...?\n40-Toko3.png\n: Ahh, I'm so n-nervous. *leaves*\n...What's she so nervous about?\n22-Narration.png\n: Everyone has gathered in the dining hall now.  We must talk to Taka to proceed.\n19-Taka7.png\n: Okay, looks like everyone's here. So then, let's begin our very first \"breakfast meeting\"!\n44-Taka21.png\n: Everyone, thank you for making time in your busy schedules to come together.\n30-Leon14.png\n: I didn't make time for shit. You dragged me here...\n44-Taka21.png\n: I know I already mentioned this earlier, but... In order to get out of here, it is essential that we all cooperate with each other. And the first step is this breakfast meeting, to allow us to become friends and build trust! So from now on, let's all meet here in the dining hall every morning after the morning announcement! Now then, let's eat!\n46-Toko10.png\n: You w-want me to eat breakfast with other p-people? I've never done that b-before. I'm not s-sure...\n47-Leon7.png\n: Yeah, it's been a while for me, too.\n49-Junko3.png\n: Well anyway...did anyone happen to come up with any clues?\nSilence echoed throughout the dining hall.\n25-Junko9.png\n: Seriously? Nothing at all!?\n50-Junko5.png\n: Anything, it can be about how to get out, or who's doing this, nobody has anything!?\n♪\nMusic cuts out.\n♪\n52-Celeste16.png\n: ...You are going to die.\n53-Junko4.png\n: Huh...?\n52-Celeste16.png\n: If you can't stop yourself from showing weakness in front of others...you will die.\n50-Junko5.png\n: Wh-What the hell? Don't even freaking joke about that!\n55-DespairSyndrome2.png\n56-Celeste4.png\n: I am not joking. Adaptability is survivability. Did I not say so? So you'd better hurry up and adapt to your new life here.\n57-Junko8.png\n: Have you gone completely insane? Adapt to my new life here? Do you have any idea what you're saying?\n58-Mondo8.png\n: Yeah, sounds like the girl wants to live here. And hell, more power to her. But shit...\n60-Mondo6.png\n: No way in hell am I living here! I'm gettin' outta here, I don't give a shit!\n61-Celeste3.png\n: Hmhm. Sure, feel free.\n62-Leon11.png\n: Okay, so...nobody has any clues?\n64-Hina16.png\n: One thing I can tell you is who's behind all this. Something who's totally weird and messed up. Why else would we be trapped in here in the first place?\n65-Leon13.png\n: Well, sure, it could be something like that. But for right now, actual clues are...\n67-Chihiro10.png\n: U-Umm...\n32-Leon2.png\n: Huh? What's up?\n67-Chihiro10.png\n: If you think in terms of people who are really abnormal or bizarre... Do you think maybe the person responsible for all this could be a\n[certain murderous fiend]\n...?\n> certain murderous fiend\n6-Makoto.png\n: A murderous fiend... Chihiro, do you have some idea who might be behind all this?\n68-Chihiro5.png\n: Well...maybe. I mean, I can't really be certain, but...\n20-Taka9.png\n: Certainty is not a concern right now! I'll allow whatever remarks you may have!\n70-Chihiro13.png\n: O-Okay, well... Have you guys heard of\nGenocide Jack\n?\n6-Makoto.png\n: You mean that serial killer that's been in the news and all over the Internet?\n71-Byakuya.png\n: The monstrous villain who's murdered scores of victims in brutally bizarre fashion... The word \"\nbloodlust\n\" was left at each murder scene, written in the victim's own blood. Whoever is is, he's like a ghost. He strikes without warning, and disappears without a trace. And on the Internet, they started calling him...\n73-Byakuya2.png\n: Genocide Jack. That about covers it, I think.\n74-Hiro5.png\n: They say he's claimed over a thousand victims...\n49-Junko3.png\n: That's just an urban legend though, right? I mean even like, ten people would be totally insane.\n75-Toko5.png\n: ...\n70-Chihiro13.png\n: Anyway, whoever Genocide Jack really is, he's obviously some kind of super crazy killer.\n58-Mondo8.png\n: And if he really is this \"ultimate\" psycho, I wouldn't be surprised if he put together something like this.\n68-Chihiro5.png\n: But like I said, I can't be certain. I don't have any evidence or anything. It's just a thought...\n47-Leon7.png\n: But if they're the killer, isn't that like a killer of a problem for us!?\n78-Hina22.png\n: It's okay! Everything's absolutely, positively, one hundred percent without a doubt gonna be okay! Cuz help's gonna be here soon, I'm sure of it!\n79-Toko7.png\n: Huh...? H-Help?\n80-Hina9.png\n: We've been stuck in here a few days already, right? Nobody's been able to contact us, so I'm sure they're getting worried. I bet they called the police already!\n???: AHHH-HAHAHAHAHAHAHAHAHAHA!\n82-MrMonokumasLesson.png\n83-Monokuma.png\n: The police? You're putting your faith in the police!?\n84-Sakura5.png\n: What are you doing here!?\n85-Monokuma4.png\n: You guys, seriously... Do you understand what role the police exist to fill? All they're good for is being a foil, playing against a villain or anti-hero or evil organization. The bad guys come along and destroy them, and that shows just how badass they really are.\n83-Monokuma.png\n: Are you sure you wanna rely on such an unreliable group of losers?\n86-Monokuma12.png\n: I mean come on! If you really, REALLY wanna get out of here, all you gotta do is kill!\n88-Hiro3.png\n: Hahahaha!\n89-Leon9.png\n: Why the hell are you laughing?\n90-Hiro.png\n: I'm just impressed at the total commitment to this whole act.\n57-Junko8.png\n: ...You're still going on about that?\n91-Mondo5.png\n: So, mister serial killer psycho freak bastard...what the hell do you want!?\n93-Monokuma11.png\n: Mr. Serialkillerpsychofreakbastard, huh? That's a pretty long name! German, maybe?\n58-Mondo8.png\n: We know who you really are!\n95-Monokuma9.png\n: Maybe if I ignore him, he'll just go away...\n96-Mondo7.png\n: Hey! Don't ignore me, asshole!\n83-Monokuma.png\n: Okay, okay, let's get back to business. Your life here has already begun and a couple of days have gone by, and nobody's killing anybody!\n98-Monokuma8.png\n: I thought all you kids were lazy and selfish, and here you are working together. But I'm totally bored!\n6-Makoto.png\n: There's nothing you can say that'll make us start killing each other...\n99-Monokuma5.png\n: Wait, I think--yes! Ding ding ding! I figured it out!\n100-Monokuma13.png\n: All the mystery ingredients are here--right people, right place. So why hasn't anyone killed anyone yet? That's what I couldn't understand. But I just realized there was one very important piece missing!\n6-Makoto.png\n: Wh-What are you...?\n102-MrMonokumaAfterClass.png\n86-Monokuma12.png\n: If you wanna know, I'll tell ya! It's motive! Puhuhu!\n85-Monokuma4.png\n: It's so simple! I just have to give everyone a\nmotive\n!\n58-Mondo8.png\n: Motive? What the fuck are you talking about!?\n83-Monokuma.png\n: Oh, by the way! There's something I wanna show you guys!\n60-Mondo6.png\n: Stop changing the goddamn subject!\n83-Monokuma.png\n: I have a little video I'd like you all to see.\n104-Monokuma7.png\n: Oh, but don't worry. It's not some pervy \"adult\" video or anything. Seriously, it's nothing like that! It's a special video for each of you showing what's going on\noutside the school\n.\n6-Makoto.png\n: Outside the school...? What are you talking about?\n100-Monokuma13.png\n: Heh-heh! Ooh, Master's so impatient today! Why don't you just watch it and find out?\n85-Monokuma4.png\n: Here in the school, there's a\nspecific place\nyou can go that has everything you need to watch the video.\n106-Kyoko17.png\n: Good, then we can go watch the video right now. But before we do that, I'd like to know...\n108-Kyoko13.png\n: What are you? Why would you do something like this? What do you want from us?\n93-Monokuma11.png\n: What do I want from you...? Well, if you must know...\n110-Monokuma16.png\n: Despair. That's all.\n86-Monokuma12.png\n: If you want to know more than that, you'll have to figure it out for yourselves. Do whatever you need to to uncover the mystery hidden within this school. I won't try and stop you.\n85-Monokuma4.png\n: Cuz to be honest, it's entertaining as heck watching you guys search so desperately for answer!\n99-Monokuma5.png\n: So I guess I want amusement from you, too. *leaves*\n7-BeautifulDeath.png\n113-Sayaka10.png\n: He's gone... And once again, he left before we could find out anything useful.\n114-Kyoko2.png\n: Really? I think we learned something *very* useful. He has no intention of standing in the way of our pursuit of the truth. Interesting...\n116-Sakura3.png\n: Perhaps, but what about the video he mentioned? I'm very curious to see what's on it.\n117-Mondo13.png\n: Same here! Okay, so...!\nMondo started glancing around the dining hall...but when he gaze landed on me, he stopped.\n119-Mondo4.png\n: Hey Makoto! Check this out for us, would ya?\n6-Makoto.png\n: Huh? Why me!?\n120-Mondo.png\n: Cuz you're the closest to the door! That's the rule, right?\n6-Makoto.png\n: R-Rule...?\n122-Mondo15.png\n: Hey, hey... Hey hey hey hey hey!\n60-Mondo6.png\n: HEEEEEY!!!\n96-Mondo7.png\n: You see how passionately I'm begging you!? What's the big deal? Just check it out real quick!\n6-Makoto.png\n: ... O-Okay...I guess I'll get going, then.\n119-Mondo4.png\n: Awesome, thanks! I owe ya one!\n125-Sayaka4.png\n:  ...If Makoto's going, I'm going with him. It's not safe to walk around this place alone.\n119-Mondo4.png\n: Yeah, sure thing. Then we're countin' on both of ya! If anything happens, just yell and I'll come runnin'!\n127-Sayaka.png\n: I can't decide if Mondo is totally dependable or completely terrible...\n6-Makoto.png\n: Yeah, I'd have to say he's kind of both.\nHe's not exactly a bad person... But I definitely can't say he's a good person, either.\n129-Sayaka17.png\n: So then, where's this \"\nspecific place\n\" Monokuma mentioned? It must be somewhere you can watch DVDs, but...\nIf it's a place set up to watch DVDs, then...\n22-Narration.png\n: We haven't had need to visit it until now but in the 1st floor hallways, there is an Audio/Video room! That's the specific place Monokuma mentioned.\n22-Narration.png\n: Next time, we'll check out the video he so desperately wants us to see.\n2-BeautifulDeath.png\n4-Narration.png\n: Here's the inside of the A/V room.  There's surprisingly little to examine other than the very obvious cardboard box on the machine.\nHuh? There's something inside this cardboard box. It's...!\n7-Sayaka10.png\n: ...a bunch of DVDs. And each one has a label on it with someone's name. This must be the \"\nvideo for each of us\n\" he mentioned...\n8-Sayaka4.png\n: I'd better go tell everyone! *leaves*\nShe just ran off... I didn't follow after her. I just stood right there where I was. The DVDs in front of me had robbed me of all awareness. I was rooted in place...\n9-Makoto.png\n: I think I see something...\nNext to the monitor is a high-end DVD player. It'll probably play those DVDs no problem.\n9-Makoto.png\n: Maybe I'll just watch mine real quick, before everyone else gets here.\nI sorted through the DVDs I'd found in the box and found the one with my name on it...then I slid it into the expensive-looking player. I sat down and stared intently at the darkened screen. And then...\n13-WelcometoDespair.png\n14-Makoto2.png\n: Ah--!\nI yelled out without realizing it, and my heart started racing. Because what I saw on that monitor... It was my family.\n15-MessageFromHome.png\n16-MakotoMom.png\n: You getting picked to attend Hope's Peak Academy is like a dream come true. Make sure you do your best!\n17-MakotoDad.png\n: I'm so proud of you, son. But remember--don't push yourself too hard!\n18-Komaru.png\n: Are you really watching this, Makoto? Good luck, okay?\nIf it had ended there, that would've been fine. A message of love and support. After leaving my family behind to attend Hope's Peak it would have given me hope, given me strength. If this was a normal school, I would've been happy, if a little embarrassed. With my family's support to rely on, I would've been motivated to do even better.\nBut here, now, it was totally different. I *wasn't* living an ordinary school life. So I had a pretty strong feeling that the video wasn't going to end there.\n20-ToSurvive.png\nI hated having that feeling, but...it turned out I was absolutely right.\n14-Makoto2.png\n: ...!\nThis time, I couldn't even make a sound. My voice just...died. Where'd everyone go...? It looks like a warzone or something... As if in reply, a voice came floating out of the speakers. I recognized the voice, of course. It was *him*...\n23-MessageFromMonokuma.png\n24-Monokuma16.png\n: Makoto Naegi, accepted into Hope's Peak Academy. And his family, who supported such a lucky boy... But it seems like...something's happened to this family's well-being! Oh boy, this is bad! What could have possibly happened to this family's well-being!?\n27-BoysLifeofDespair.png\n14-Makoto2.png\n: Wh-What is this? What happened to everyone!?\nI started trembling... I could feel the fear and anger building up inside me, like hot magma.\n14-Makoto2.png\n: GOD DAMMIT!\nI slammed my fist against the desk over and over again. A single thought was racing through my mind... What else? How could I think about anything else?\n14-Makoto2.png\n: I have to get out of here. I have to get out, right now! I need to make sure everyone's safe!\n???: Makoto...?\n7-Sayaka10.png\n: What happened? Make sure who's safe?\nI noticed everyone standing around the entrance to the A/V room. They stared at me, faces full of confusion.\n29-Hina9.png\n: Wh-What's going on?\nWithout a word, I pointed to the cardboard box.\n30-Leon7.png\n: Is that what Monokuma was talking about?\n31-Taka11.png\n: What's on them?\nThey all gathered around the box, and each of them grabbed the DVD with their name on it. One by one, they each rushed to a monitor. It didn't take long for them to react.\n33-Mondo11.png\n: What the fuck...?\n34-Hina10.png\n: Th-This can't be real, right? It has to be fake, right!?\n30-Leon7.png\n: Yeah, no way it's real. Haha...no way.\n35-Toko6.png\n: I can't t-take it anymore...\n37-Toko9.png\n: I c-can't take this anymore! Let me out of h-here!\nAs soon as I saw their reactions, I knew... They'd all seen something like what I'd seen. Nobody even bothered trying to hide their fear and confusion. Except for *her*. Even now, she was totally calm.\n39-Kyoko11.png\n: I see... So this is what he meant by\nmotive\n. He wants to fuel our\ndesire to leave\nso that we're more likely to start killing each other.\n40-Celeste8.png\n: It is the classic \"prisoner's dilemma.\"\n41-Hifumi9.png\n: ...Huh?\n43-Celeste2.png\n: Let me use an example. Imagine two countries are on the brink of war. But both countries want peace, and each commits to scaling back their forces as a sign of good faith. But there's a chance that one country may betray the other, so each country fears lowering their guard. The result is that neither scales back their forces and they both end up betraying each other.\n45-Celeste17.png\n: In other words, the fear of invisible treachery becomes the greatest enemy of stability.\n46-Toko12.png\n: That kinda sounds l-like us right now... Everyone says they'll work together, but in our hearts we're all afraid someone might betray us...\n31-Taka11.png\n: Don't put those awful thoughts in our head! That's exactly what they *want* us to do!\n48-Leon6.png\n: You can say that, but maybe you're thinking that once everyone drops their guard, you can just...\n49-Taka12.png\n: What!?\n51-Sakura5.png\n: This is exactly what Monokuma, or whoever's behind this, wants. They *want* us to fight. Don't you see?\n52-Chihiro10.png\n: Yeah, you're right. We all need to calm down...\n53-Junko3.png\n: Okay, then. Maybe we should start by all just...talking. Maybe if we all just talk about what we saw, that'll help get everything out of our system.\n54-Junko7.png\n: Besides, I think we're all super curious, right?\nI wonder what was in everyone's videos... I'd be lying if I said I wasn't curious.\n14-Makoto2.png\n: Hey, Sayaka...\n56-Sayaka16.png\n: ...\n14-Makoto2.png\n: What was in your video, Sayaka?\n56-Sayaka16.png\n: ...\n46-Toko12.png\n: What's wr-wrong? Just hurry up and t-tell us...\n58-Sayaka11.png\n: ...\n14-Makoto2.png\n: Sayaka?\nI gently placed my hand on her shoulder.\n♪\nMusic cuts out.\n♪\n59-Sayaka12.png\n: ...Stop it! *leaves*\nShe pushed my hand away and suddenly ran off.\n61-Hina12.png\n: Sayaka!?\n62-Byakuya.png\n: Let her go.\n14-Makoto2.png\n: I-I can't do that! I have to go make sure she's okay!\n64-Toko.png\n: I h-hate romantic comedies like this. I don't care what h-happens to her, personally...\n65-Junko8.png\n: That's because you're totally thoughtless!\n29-Hina9.png\n: I'm...really worried.\n67-Celeste15.png\n: Then why don't you go do whatever you think you have to? We don't all have to stick around together, right?\n68-Celeste.png\n: Speaking of which, I have my own things to take care of. Goodbye. *leaves*\nEveryone went their separate ways... But I don't have time to worry about them right now. I have to go find Sayaka!\nWhere could she have gone? She can't have gone far. I should check around the school...\n4-Narration.png\n: Turns out Sayaka didn't go far at all. She's hiding in Classroom 1-A, the room we originally woke up in.\n72-DespairSyndrome1.png\nI found her in one corner of an empty classroom. She was sitting in a chair, hands on her knees, staring absently at the floor. She looked like maybe she was upset, or angry. Or, no... She didn't have any expression at all. There was nothing on her face that you could call emotion. It was as if her original mask had been stripped away.\n14-Makoto2.png\n: S-Sayaka? Are you okay?\n58-Sayaka11.png\n: Yeah...I'm fine. Actually, no...how could I possibly be fine? What did we do to end up like this...? Why are they doing such terrible things to us...?\n75-DespairSyndrome2.png\n59-Sayaka12.png\n: I want out! Let me out of here right now!\n14-Makoto2.png\n: Sayaka! Calm down!\nAs she thrashed around, I grabbed her by the shoulders.\n58-Sayaka11.png\n: ...!\n14-Makoto2.png\n: I understand. I know how you feel right now. When I think what might have happened to my family... But now more than ever we have to stay calm! This is exactly what they want. They *want* us to lose our composure and stop thinking rationally. Think about it--those videos have to be fake! Because if those things really had happened...\n76-FlashT.png\n78-FlashB.png\n14-Makoto2.png\n: ...people out there would be in an uproar. Our families, the police, everyone! Right?\n58-Sayaka11.png\n: ...\n14-Makoto2.png\n: So let's just calm down, okay? Otherwise, we've already lost.\nI knew I was trying to convince myself just as much as her. I kept repeating those words to myself, to clear away the images that had been burned into my brain. Be calm, okay? Just be calm...\n14-Makoto2.png\n: As long as we work together, I'm sure we can find some way out of here. And help might even come before that.\n58-Sayaka11.png\n: But...what if there *isn't* a way out? What if help *never* comes?\n14-Makoto2.png\n: I-If that happens... then I'll get you out of here myself! No matter what it takes!\n♪\nMusic cuts out.\n♪\nWhen I said that, I paused... I had no idea what had come over me.\n81-DeathWish.png\n82-Makoto8.png\n: Sayaka...?\n83-Sayaka19.png\n: Please...help me...\nHer voice was small and shaky.\n83-Sayaka19.png\n: Why...? Why is this happening to me? To kill, or be killed... I just can't take this anymore...!\n82-Makoto8.png\n: Sayaka...\n83-Sayaka19.png\n: ...\nFinally, she raised her face up from my chest. She looked at me with those big, wet eyes of hers.\n85-Sayaka13.png\n: Can I...can I believe what you said?\n14-Makoto2.png\n: Huh?\n85-Sayaka13.png\n: That you'll help me get out? No matter what it takes...?\n9-Makoto.png\n: A-Absolutely!\n85-Sayaka13.png\n: Makoto... You're the only one I can trust. So please... No matter what happens, please always be there for me. I need you on my side...\n9-Makoto.png\n: Huh? O-Of course I'll be there for you! No matter what, I'm always on your side. I mean... you *are* my assistant, after all.\n87-Sayaka3.png\n: ...\n88-Sayaka2.png\n: Thank you, Makoto. Hearing you say that, I feel like I can keep going.\n87-Sayaka3.png\n: I can get through this...as long as you're here with me.\n90-Sayaka6.png\n: Like you said, I'm your assistant.\nThe smile I'd come to know so well returned to her face. It felt a little forced, but still... It was a huge improvement over how she was before.\n92-MrMonokumasLesson.png\n93-Monokuma.png\n: ...It's standing up!\n94-Sayaka9.png\n: Kyah!\n96-Monokuma7.png\n: Makoto! It's standing up!\n14-Makoto2.png\n: *What's* standing up!?\n93-Monokuma.png\n: Do you even have to ask?\n98-Monokuma12.png\n: Your flagpole!\n14-Makoto2.png\n: Get the hell out of here!\n99-Monokuma4.png\n: No! No! I wanna join in!\n14-Makoto2.png\n: Dammit! Well if you won't leave, then tell us what the hell is up with those videos!\n96-Monokuma7.png\n: Ahh...it's about to come out... It's gonna come out! My pristine, pure white...\n101-Monokuma10.png\n: ...stuffing! My honest, innocent stuffing is about to come gushing out!\nI balled up my fist, took aim, and swung as hard as I could. I had never put so much energy into a single motion before in my life. I leaned back, channeling all my power, and let go with everything I had...!\n*Crash*\n14-Makoto2.png\n: Guwah!\n94-Sayaka9.png\n: A-Are you okay!?\n103-Monokuma9.png\n: If I hadn't avoided your punch, you would have just violated school regulations.\n104-Monokuma6.png\n: But boy are you slow slow slow slow SLOW!\n98-Monokuma12.png\n: I could've downed a thousand-dollar full-course dinner in the time it took you to finish your swing!\n104-Monokuma6.png\n: Your speed, agility, alertness, passion, boldness, sense of despair, antagonization, it's all lacking! *leaves*\n14-Makoto2.png\n: ...\n7-Sayaka10.png\n: What the heck was that just now...?\n14-Makoto2.png\n: He just wanted to mess with us...\n88-Sayaka2.png\n: Well, for now...you wanna just head back?\n14-Makoto2.png\n: Yeah...\nMonokuma had come along and swiftly destroyed the good mood we'd just created. Sayaka and I headed back to the dorms.\n13-WelcometoDespair.png\n9-Makoto.png\n: You should get some rest, Sayaka. You still look pretty shaken.\n88-Sayaka2.png\n: I'm sorry for making you worry about me... You're right. I'm going to lay down for a bit. *leaves*\nWith a nod and a small bow, she disappeared into her room.\nNow on my own, I headed off to tell everyone that Sayaka was okay. Once that was done, I decided to go back to my room. It was hard to think after watching that deranged video. I needed some rest of my own.\nJeez... Seriously, what's going on here? There's just so many problems. I can't even decide what the biggest problem is... That we're trapped in here? That what I saw in that video might be real? Monokuma? What the mastermind has in store for us? Or...are *we* our biggest problem? ... I want to get out of here. But I could never kill someone... Do the others all feel the same...?\nYeah that's definitely the biggest problem right now...\n*Ding dong*\nHuh?\nWhen I opened my eyes, they darted immediately to the clock.\n3-Makoto.png\n: It's almost 10 o'clock. I fell asleep without even realizing it...\nNighttime's about to start...\n3-Makoto.png\n: ...so how come someone's here?\n4-BeautifulDeath.png\n7-Sayaka15.png\n: I'm really sorry to come by so late...\nSayaka!?\n3-Makoto.png\n: Sayaka? What are you doing out so late?\nThat's when I noticed... Her body was trembling.\n3-Makoto.png\n: I-Is everything okay...?\n11-DespairSyndrome2.png\n12-Sayaka16.png\n: Sorry to bother you, but...\n[something really weird]\njust happened.\n> something really weird\n3-Makoto.png\n: Something...weird?\n12-Sayaka16.png\n: Just a little while ago, I was laying down in my room... And all of a sudden, my door started rattling and shaking.\nHer voice sounded like all the air had been squeezed out of her lungs. Just hearing her talk made me tense up.\n12-Sayaka16.png\n: It was like someone was trying to force the door open. My door was locked, so they couldn't get in, of course. But they started shaking the door harder and harder. I was so scared I couldn't even move.\n3-Makoto.png\n: S-So what happened!?\n12-Sayaka16.png\n: After a while, it just...stopped. I let some time go by, then I got up and opened the door to check outside...\n7-Sayaka15.png\n: But there was nobody there.\n3-Makoto.png\n: Someone tried to force their way into your room...? But...who would do something like that?\n12-Sayaka16.png\n: It's not that I'm suspicious of anyone here, but still...it makes me nervous. What if something like that happened in the middle of the night? What would I do then...?\n3-Makoto.png\n: Y-You don't have to worry about that, right? I mean, we can't go outside during nighttime.\n12-Sayaka16.png\n: But that's just a promise we made, right? If someone decided to break that promise...\n3-Makoto.png\n: Th-Then... Why don't you stay in my room tonight? Would that make you feel a little better?\n7-Sayaka15.png\n: What!?\n3-Makoto.png\n: All it said in the school regulations was that we had to sleep in \"\nthe dorm rooms\n\", right? It didn't state specifically *which* room each person had to sleep in. So...\n4-BeautifulDeath.png\n14-Sayaka2.png\n: B-But...two people sharing one room is...you know...\n3-Makoto.png\n: ...Ah! Oh jeez, I'm sorry! I didn't even think about that! Honestly, that didn't even cross my mind!\n16-Sayaka14.png\n: No, I know, me either. It's not even that I mind the idea, but...\n18-Sayaka3.png\n: ...Um, if you don't mind, could we maybe switch rooms? Just for tonight?\n3-Makoto.png\n: Switch rooms...? I-If it'll help put your mind at ease, then it's totally fine with me. But... I don't mind you staying in my room, but...are you sure you're okay with me staying in yours? That doesn't, like...concern you?\n20-Sayaka6.png\n: It's fine. I trust you...\n3-Makoto.png\n: In that case, then...\n21-GoodNight.png\n*Ding dong, bing bong*\n24-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\n26-Sayaka10.png\n: Oh man, it's already nighttime...\n3-Makoto.png\n: Okay, so it's settled. I'll head to your room right now.\nOh, if we're gonna trade rooms, we'd better trade keys, too.\n20-Sayaka6.png\n: Ah, that's right. We'll have to trade keys.\n3-Makoto.png\n: Again!?\n28-Sayaka4.png\n: Like I said, I'm psychic. ...\n3-Makoto.png\n: ...Huh? Hey, aren't you gonna say you were just kidding?\n20-Sayaka6.png\n: What if I *wasn't* just kidding...?\nSomething resembling a smile had made its way to her face. Thank goodness. It looks like she's already started to get back to normal.\n3-Makoto.png\n: Okay, we'd better trade keys, then.\n29-Sayaka7.png\n: Yup, let's do it.\nWe exchanged keys, and when I looked back up at her again...\n...there was another worried expression there.\n14-Sayaka2.png\n: Makoto...please be careful. If someone comes to the door, don't open it no matter what.\n3-Makoto.png\n: I won't. The same goes for you, Sayaka. No matter who it is, don't open your door for anyone.\n20-Sayaka6.png\n: Even if I'm sure it's you, I absolutely won't open it. Otherwise, what's the point of even switching?\n3-Makoto.png\n: Oh, by the way... Just so you know, my bathroom door tends to get stuck. There's a little trick to opening it... You have to turn the knob, then lift up on the door while you pull it out. Just do that and the door should open no problem.\n28-Sayaka4.png\n: Okay, but the showers don't work during nighttime anyway, right?\n3-Makoto.png\n: Oh, that's right. I totally forgot...\n20-Sayaka6.png\n: But I guess I might use it when I get up in the morning. So thank you.\n3-Makoto.png\n: Okay, well, I'd better get going. See you tomorrow, Sayaka.\n31-Sayaka.png\n: Oh, and about what I said before...\n3-Makoto.png\n: Hm?\n20-Sayaka6.png\n: When I said I was psychic, it really was a joke. Honestly, I'm just very perceptive.\n3-Makoto.png\n: Yeah, I know.\n29-Sayaka7.png\n: ...Good night, then. See you in the morning.\nSayaka gave me one last parting smile, and I headed off to \"my\" room.\nI looked around as soon as I got out into the hall. Everyone else's doors were closed. There was no sign of life.\n3-Makoto.png\n: Good. There's nobody here...\nMaking sure nobody was around to spot me, I rushed into Sayaka's room.\nSo this is Sayaka's room... It really doesn't look any different from mine.\n3-Makoto.png\n: It smells nice, though...\n35-Narration.png\n: We can examine a few things before we go to bed.\nIt's kind of weird to dig through other people's trash, but I couldn't help taking a quick peek...\nThat's...! There wasn't any doubt about it--it was the DVD with her name on it that we'd found in the A/V room.\n3-Makoto.png\n: That reminds me... I never did get a chance to find out what was in her video.\nBut it's probably best if I wait until she brings it up again.\nIf I remember right, all the girls' private bathrooms have locks on them. I'm a little reluctant to go in...\nMy room came with a toolkit, but Sayaka has a sewing kit. Just like the note said... And next to it is...the map of the body's vital organs.\n3-Makoto.png\n: I don't think Sayaka would like me snooping around too much... I should probably go to bed soon.\nAs I lowered myself onto Sayaka's bed, a pleasant fragrance enveloped me.\nSayaka's...scent... Maybe it'll bring me some sweet dreams.\nFeeling a little better than before, I fell asleep...\n41-MrMonokumasLesson.png\n43-MonokumaTheater.png\n: Imagine you're all in a big spaceship, in the middle of an intergalactic adventure. You've heard of Noah's Ark, right? We're sort of like that. We've set sail and left Earth behind! Here you don't have to worry about crazy neighbors, corrupt cops, drunk drivers, or pyromaniacs! You don't have to worry about the ozone layer, or asthma-inducing air pollution! And of course, you don't have to stress about studying for finals or practicing for the big game! But... But even our divine world of freedom has a few rules. After all, freedom can only exist *because* of rules. If you're really dead set on returning to that tiny piece of dog poop you call Earth...please do your best to follow the rules. I hope I've made myself perfectly clear. So then, let's everyone do our best to follow these new guidelines and live happily ever after together!\n44-GoodMorning.png\n*Ding dong, bing bong*\n24-MonokumaTV.png\n: Good morning, everyone! It is now 7 a.m. and nighttime is officially over! Time to rise and shine! Get ready to greet another beee-yutiful day!\nI sat up, still half asleep, and rubbed my eyes. Slowly I pulled myself out of bed. ...I remembered I was in Sayaka's room.\n3-Makoto.png\n: I just remembered, I promised to eat breakfast with everyone else. I'd better get going.\n45-BeautifulMorning.png\nI left Sayaka's room and made my way toward the dining hall.\nA few people had already gathered at the dining hall by the time I got there.\n48-Taka3.png\n: Hello, Makoto, and good morning! Can you believe it? I was the very first one here this morning!\n50-Chihiro4.png\n: Ehehe...good morning.\n52-Hina5.png\n: Mornin'!\n54-Sakura8.png\n: I suppose I'm early...\nI figured everyone who had arrived on time could be considered model high schoolers. And the ones who showed up a little late...\n56-Mondo3.png\n: Yo.\n58-Junko6.png\n: Sorry I'm late! My make-up just would NOT cooperate this morning!\n60-Hifumi20.png\n: My apologies, ladies and gentlemen. My morning, ah, duty took a little longer than usual...\n...were the types with a more relaxed sense of time. Most high schoolers fall into this category. And finally, the ones who kept everyone waiting forever...\n62-Kyoko2.png\n: ...I suppose I'm late.\n64-Celeste4.png\n: Good morning, everyone.\n66-Leon3.png\n: My bad, guys! Slept right through my alarm!\n68-Toko12.png\n: Wh-What? Is it s-so awful to be l-late?\n70-Hiro2.png\n: I didn't oversleep, just so you know. Nope, got lost! I blame the Bermuda Triangle...\n...don't care about time or other people in general. They're the kind to move at their own pace. But regardless, everyone had arrived.\nAt least, that's how it was supposed to go...\n72-Taka16.png\n: Wait, aren't we still missing some people?\n73-Hina23.png\n: Yeah, Sayaka and Byakuya aren't here yet.\nI don't know about Byakuya, but...I would definitely put Sayaka in the \"model high schooler\" category. So for her to be so late...\n75-Byakuya2.png\n: ...What's going on? Did something happen?\n76-Mondo2.png\n: Hey man! Have you seen Sayaka?\n77-Byakuya3.png\n: Why would I have? I just came straight from my room to here.\n78-Hifumi2.png\n: Did she forget about our breakfast promise...?\n80-Kyoko12.png\n: I got the sense she always has her stuff together...\n82-ToSurvive.png\nListening to everyone talk like that, a small, dark speck of unease rose up inside of me.\nAnd that speck started to grow quickly...\n83-Makoto2.png\n: I-I need to go... I have to check on her!\nThe words had barely left my lips before I flew out into the hall.\nWhere I headed first was...my room, where I'd let Sayaka stay for a single night. Where she was supposed to be safe...But over the course of that one night...\n...the room had been completely transformed.\n83-Makoto2.png\n: Wh-What the hell!?\nThis is...the replica sword I brought back for self-defense. It's the sheath for the replica sword. The sword itself has been removed...\nThe bed's been damaged, too...\nThere are slashed and gouges on the walls and the floor. More importantly, where's Sayaka!?\nI'd better check the bathroom.\n♪\nNo Music.\n♪\nLet's...\n...take...a...look...\n...in...side...\n... ... ...\n../Smilies/emot-siren.gif\nCLICK HERE FOR VIDEO\n../Smilies/emot-siren.gif\nIt took me a second to realize that I was screaming. What I saw dug its way through my eyes and buried itself in my brain. And then...\nAnd then...\n...\n... ... ...\n...everything went black.\nWhen I opened my eyes, I found myself staring at a huge ceiling. It was a ceiling I remember seeing before. And when I sat up, I saw someone looking at me. Again, it was someone I'd seen before.\n3-DespairSyndrome2.png\n4-Makoto2.png\n: ...\n6-Hina2.png\n: Ah! You're awake! Finally! Are you okay?\n7-Mondo17.png\n: Now's no time for sleeping. Get your ass up!\n4-Makoto2.png\n: Huh...?\n9-Hiro4.png\n: You were unconscious, dude. I had to carry you back here.\n10-Sakura4.png\n: It's no surprise, considering what happened.\n4-Makoto2.png\n: What...happened?\n11-FlashT.png\n13-FlashB.png\n4-Makoto2.png\n: Gh--! Grraaah!\n14-Hina9.png\n: H-Hey, are you okay!?\n4-Makoto2.png\n: So it wasn't a dream? What I saw... It was real...?\n16-BoysLifeofDespair.png\n17-Byakuya15.png\n: That's right. It really did happen. Sayaka...is dead.\n4-Makoto2.png\n: ...!\nA deep, dark despair worked its way through my body, and then exploded out of me. I shot up and took off running.\n18-Byakuya.png\n: Hey, where do you think you're going?\n4-Makoto2.png\n: I have to see for myself! I have to see if Sayaka is--! If Sayaka is...!\n20-Byakuya5.png\n: You can check once, twice, a thousand times. Sayaka is completely and irrevocably dead.\n4-Makoto2.png\n: No! I have to see for myself!\n22-Mondo8.png\n: Listen to us, man! Whaddya think's gonna happen if you go out there?\n4-Makoto2.png\n: Well what good is it gonna do just sitting around here!? I mean, why are we all hanging out in the gym at a time like this!? Our friend...Sayaka...she's... She's dead!\nDead... When I said that, it finally hit me.\n11-FlashT.png\n13-FlashB.png\nI realized she really was gone...\n24-Kyoko17.png\n: None of us want to be here right now, either.\n4-Makoto2.png\n: Then...why?\n25-Toko5.png\n: Sh-Shouldn't it be obvious? Monok-kuma...he told us all to c-come here...\n26-Taka11.png\n: Well, hold on! Don't talk like that. We all protested it! I mean, we remember the terrible price Sayaka had to pay...\n27-Taka17.png\n: B-But...!\n29-Kyoko7.png\n: I'm the one who convinced them to come. Right now, we need to do whatever he says. We're his prisoners, right? It's not a good idea to defy him without reason. We don't need to make any more sacrifices than we already have...\n4-Makoto2.png\n: ...Why should we listen to anything he has to say? It's obvious he's the one who killed Sayaka!\n31-Monokuma.png\n: I would never do that! If you can believe anything, you can believe that!\n32-Leon6.png\n: He's here again...\n33-Monokuma2.png\n: Unless someone violates a school regulation, I absolutely will not interfere. I can promise you, I won't do anything that goes against the purpose of your school life here.\n34-Monokuma4.png\n: I'm famous at safari parks throughout the world for following the \"Bear-Times-One\" rule!\n35-Chihiro10.png\n: Then...who did it? Who killed her?\n3-DespairSyndrome2.png\n37-Monokuma12.png\n: You already know the answer! The one who killed her is...one of you!\nNobody had a reply for that. One of us...killed Sayaka? Don't be stupid. That's...\n39-Monokuma11.png\n: Hmm? What's the matter? You guys all look like you're about to see a dove get shot up with a Gatling gun!\n34-Monokuma4.png\n: Don't you remember what I told you when this all began?\n40-Monokuma5.png\n: One of you decided to kill Sayaka so that you could\ngraduate\n! Someone's just following the rules. There's nothing wrong with that!\n42-Hifumi6.png\n: Y-You're lying...right?\n4-Makoto2.png\n: Of course he's lying! I'm telling you, he killed her!\n31-Monokuma.png\n: Nope, sorry. One of you is now a bona fide killer. If they wanted to, the one who did it could testify to that little fact.\n4-Makoto2.png\n: What...?\nWithout thinking, I looked around at everyone. They all had the same look on their faces... Everyone looked at each other with a combination of fear, suspicion and confusion.\n43-Chihiro11.png\n: A-Are you serious...?\n45-Taka12.png\n: Someone... Someone killed someone!\n46-Celeste9.png\n: It is amazing what some people are capable of.\n47-Mondo9.png\n: Hey, hold on! Don't just assume he's telling the truth!\n20-Byakuya5.png\n: That's enough. Before we do anything else, I'd like to confirm something with the stuffed animal here.\n49-Byakuya4.png\n: If one of us really did kill her, that person gets to\ngraduate\nfrom the school, right?\n39-Monokuma11.png\n: ...Huh?\n20-Byakuya5.png\n: Don't play dumb! That's what you said, isn't it!? If you kill someone, you get to leave!\n34-Monokuma4.png\n: Puhuhu... Puhuhu! Poohohoho!\n40-Monokuma5.png\n: Bwaaahahahaha!\n51-Leon7.png\n: Why are you laughing!?\n34-Monokuma4.png\n: Puhu...it's cuz...\n40-Monokuma5.png\n: Naive... You're just so naive! You think it's really that easy? You can just kill someone and waltz on outta here?\n33-Monokuma2.png\n: You're super naive! Devilishly naive! HELLISHLY NAIVE! No no no, the real thing has just begun.\n4-Makoto2.png\n: The...real thing?\n31-Monokuma.png\n: Are you ready!? Allow me to explain the second part of the rule regarding\ngraduation\n! Just like I explained before,\nyou must kill someone if you want to leave\n. However...even if you do that, there's still one more part to the agreement you have to upload, remember?\n54-Celeste7.png\n: You are referring to rule number six of the school regulations...\n54-Celeste7.png\n: If you are the \"blackened\" that committed the murder, you can't be found out by the other students. That is what you are talking about, is it not?\n31-Monokuma.png\n: Bingo! It's not enough to just kill someone. You have to actually get away with it! Which naturally means you need a system in place to assess whether or not it's been gotten away with!\n57-MrMonokumaAfterClass.png\n58-Monokuma6.png\n: So, a certain amount of time after a murder has taken place, a\nclass trial\nwill begin!\nClass...trial?\n31-Monokuma.png\n: Yup! It'll begin a few hours after the murder! Everyone will gather together, including the\nblackened\nwho committed the murder. And they and the\nspotless\nstudents will all engage in one big debate showdown!\n60-ExplainingtheClassTrial.png\n31-Monokuma.png\n: During the trial, you'll have to present your arguments about\nwho you think the blackened is\n. And once everything comes to an end, the outcome will be decided by\npopular vote\n! If the answer you've arrived at is correct...only the one that disturbed your peace will be\npunished\n. The rest may continue their communal life. However...if you choose poorly...then the one who got away with murder will survive, and the rest of you will receive your\npunishment\n. Which of course means your school life will come to an end! As far as class trial rules go...that's all there is to it!\n42-Hifumi6.png\n: So, um...what exactly is this \"\npunishment\n\" you keep talking about...?\n39-Monokuma11.png\n: Oh! Well, to put it simply...\n37-Monokuma12.png\n: It's execution!\n63-Hifumi11.png\n: E-Execution!?\n64-Chihiro6.png\n: And by execution, you mean...\n66-ExecutionIs.png\n67-Monokuma16.png\n: Execution is...execution. Ex-e-cution! Electric chair, bzzt bzzt! Poison gas, cough cough! Torn apart like a paper place in a hurricane!\n69-Taka13.png\n: S-So, to make sure I understand... If we get the culprit right, then only they die. But if we get it wrong...all the rest of us get...executed?\n71-Monokuma10.png\n: What a smart little chimpanzee you are! Look at you, implying you didn't do it without actually saying it! So it's basically what the outside world calls a \"lay judge\" system, or an inquisition type thing! Which means you'll be deciding who you think the killer is.\n37-Monokuma12.png\n: But judge carefully, because all your lives are on the line!\n31-Monokuma.png\n: Okay, let me just add the rule I just described to your handbook. make sure to keep it in mind!\n72-Tutorial.png\n: The new rule has been added to the\nRegulations\nmenu.\n74-Junko5.png\n: W-Wait, hold on a second!\n75-Junko4.png\n: You're freaking insane, you know that!?\n39-Monokuma11.png\n: Hmm?\n76-Junko8.png\n: A class trial? What the hell is that!? I don't want anything to do with it!\n39-Monokuma11.png\n: Why not?\n74-Junko5.png\n: Whaddya mean why not!? Why do I have to waste my time trying to figure out who murdered someone!?\n33-Monokuma2.png\n: What!? Are you saying you're not gonna participate in the trial!? Only punishment awaits such blasphemy!\n75-Junko4.png\n: What? Punishment?\n37-Monokuma12.png\n: I might...I dunno, throw you in a deep, dark, scary prison or something!\n74-Junko5.png\n: Shut the hell up! Say whatever you want, I'm not gonna be part of this!\n33-Monokuma2.png\n: Don't be so selfish!\n74-Junko5.png\n: You're the one being selfish! Kill whoever you want, it's got nothing to do with me!\n79-Monokuma7.png\n: The evil standing here before me... I'm trembling with fear...!\n81-Monokuma3.png\n: But I won't give in to such evil! It's my style to stick it out and resist till the very end...! If you really wanna get out of here...\n58-Monokuma6.png\n: You'll have to go through me first!\nAs he said that, he came charging at us. Although is was more of a waddle... But then...\n*Smash*\n../Smilies/emot-siren.gif\nWatch this scene in video form!\n../Smilies/emot-siren.gif\n84-Monokuma21.png\n: Gyumeh!\n85-Junko21.png\n: Are you enjoying yourself now?\n84-Monokuma21.png\n: Are you?\n85-Junko21.png\n: Huh?\n84-Monokuma21.png\n: Violence against Headmaster Monokuma is not allowed. You've violated a school regulation... I invoke the mighty summon spell! Help! To me, godly spear Gungnir!\n88-DespairSyndrome1.png\n90-Junko22.png\n: ...Wh...? H-Huh?\n90-Junko22.png\n: This wasn't...supposed to...\n90-Junko22.png\n: Why...me...?\nSuddenly, right at the end, her eyes shot wide open.\nAnd just like that...she never moved again.\n93-ToSurvive.png\n94-Hina13.png\n: Wh-What the...\n64-Chihiro6.png\n: I don't...\n95-Leon8.png\n: Th-This can't be real.\n63-Hifumi11.png\n: NO WAAAAAAAAAAAAAAAAAAAYYY!\n81-Monokuma3.png\n: Now I am painfully aware of the great power and meaning of a\npromise\n... I really wanted to keep a corpse from popping up for no good reason, ya know?\n71-Monokuma10.png\n: But I guess you all needed to be taught a lesson, after all. Ahh, what an amazing promise! But now you guys understand, right?\n98-YoudBestObey.png\n67-Monokuma16.png\n: Now you see just how serious I am... Defy me and you get shot full of holes, exploded, buried alive, disintegrated...et cetera. So if you don't want that to happen to you, you'd best obey those school regulations!\nJunko's body had been impaled with a bunch of spears... An unbelievable amount of blood started pouring out of her body. It was the first time I'd ever seen...\nthe moment someone's life came to an end\n. Nobody there could deny what they'd seen. Junko, who until just a second ago had been our friend...was dead. She'd died. She'd been murdered. In simple terms...it was the death of a human being.\n34-Monokuma4.png\n: It's really not all that shocking. She just died, that's all. Just went and died. It's no more remarkable than the inevitable demise of the entire human race. It's just as natural as the eventual end of the world itself.\n31-Monokuma.png\n: This isn't some superhero comic. So it's not like when you die, you didn't *really* die.\n40-Monokuma5.png\n: This is reality!\n29-Kyoko7.png\n: ...Why did you have to kill her? Didn't you say you would put her in prison or something?\n102-Monokuma9.png\n: I changed my mind.\n29-Kyoko7.png\n: No, you've been wanting to kill this entire time.\n39-Monokuma11.png\n: Kill this entire time...? Don't be silly, you can't kill time! Or are you being metaphorical? Are you saying I wanted to waste time this whole time?\n58-Monokuma6.png\n: Come on, what do you take me for? I'm Monokuma!\n31-Monokuma.png\n: Anyways, none of that matters right now. I have something I'd like to give you to help you in your search for the blackened!\n31-Monokuma.png\n: This little file has all the information I've gathered about the death in question. I like to call it... The Monokuma File! I mean, naturally you guys aren't experts at this kind of thing, so you can only do so much with a corpse. So instead, I've gathered up everything I know about the circumstances and cause of death.\n39-Monokuma11.png\n: What's that? How do I know the cause of death, you ask?\n71-Monokuma10.png\n: Cuz the surveillance cameras picked up the whole thing! I got to see it all go down!\n29-Kyoko7.png\n: Wait, so then...you know who killed Sayaka?\n34-Monokuma4.png\n: Of course I do! If I didn't, I couldn't possibly pass a fair and accurate judgment during the trial, now could I?\n24-Kyoko17.png\n: That's a good point. The judge has to be able to make the proper decision. That's...somehow comforting.\n107-Monokuma13.png\n: Now then, please put your full effort behind your investigation! After all, you don't have any choice but to give it your best shot! Seriously, you don't have a choice! Okay, so we'll meet up for the class trial...in a little while! *leaves*\nAnd with that, Monokuma disappeared once again. He left us stunned and confused... He left us at a total loss. He left us with Junko's dead body growing colder right in front of us.\n2-BoysLifeofDespair.png\nFor who knows how long...nobody said a word. The fact that Sayaka and Junko were dead was a huge shock, of course. But there was more to it than that. It was also the idea that one of us had actually\nmurdered someone\n...and that if we didn't find out who it was, we would\nall\ndie here.\nWe'd found ourselves in a situation where we couldn't help but look at each other with open suspicion. It was the worst situation imaginable. And yet, even in such a perversly terrible situation...she didn't show the slightest hint that it had gotten to her.\n4-Kyoko2.png\n: Now's no time to wallow in your depression. The worst thing we can do right now is lose all faith in each other. That would lead to the same disastrous result as having *total* faith in everyone else.\n5-Leon7.png\n: Huh...?\n6-Kyoko.png\n: Cooperation is absolutely key at this point. Who you decide to trust or not trust is, of course, up to you.\n8-Celeste9.png\n: Continuing to think about and talk about the deceased certainly isn't going to help anything.\n9-Hina16.png\n: S-Saying stuff like that is just--!\n10-Celeste2.png\n: How many times have I told you? Anyone who can't adapt...will die. Death is the only thing awaiting those who are unable or unwilling to adapt.\n11-Celeste4.png\n: If that happens, you only have yourself to blame.\n13-Hina15.png\n: What an awful thing to say! Especially after what's happened!\n4-Kyoko2.png\n: Right now, exposing the killer is the most important thing. Because if we don't, we're all going to die here.\n14-Byakuya3.png\n: ...She's right. We need to begin our search right away.\n16-Sakura5.png\n: Either way, we can't run away from the situation, so we have no choice but to move forward.\n9-Hina16.png\n: We just hafta do it, I guess. What other choice do we have?\n17-Leon6.png\n: No way in hell am I letting someone kill me...! Alright, dammit! Let's do this!\nWe just have to do it... Everyone kept repeating that sentiment. They were using it like a mantra to give themselves strength. But they're right. We just have to do this. No matter how much we don't want to, we have no choice. If that's what it takes to survive, then that's what we have to do!\nOn top of that, there was something I needed to find out... I had to know why Sayaka had to die. Why she had to be the one... I'm terrified to find out, but still...I have to know. Otherwise, I knew I'd never be able to accept her death. Which is why...I don't have any choice! I have to do this!\n19-DISTRUST.png\nI gently placed my hand on Junko's lifeless body... I touched her wrists to check for a pulse, like they do in movies and stuff, but...\n21-Makoto2.png\n: ...She...really is dead.\nThere wasn't anything else to say. She was gone...\n14-Byakuya3.png\n: I don't know why you even bothered to check. After those injuries, and losing that much blood... Frankly, I'd be shocked if she *did* survive something like that.\n23-Hiro5.png\n: H-Huh...? H-Hold on...\n25-Hiro6.png\n: H-H-H-Hold o-on! J-J-Just w-wait a second! Sh-She's...dead!? Then that means...!\n26-Hiro10.png\n: That means everything that's happened so far is real!? It's not a joke or whatever!? It's really real!?\n28-Hiro9.png\n: Hell no! S-Someone save me! Let me outta here! SOMEBODY HELP ME!!!\n29-Toko12.png\n: You're j-just now accepting that...?\n4-Kyoko2.png\n: Before we start searching for Sayaka's killer, we need to decide what to do about securing the crime scene.\n21-Makoto2.png\n: What do you mean...?\n32-Byakuya.png\n: You're thinking of putting someone on\nguard duty\nso nobody can disturb the area, aren't you? After all, if the culprit decides to destroy the evidence, we're pretty much screwed.\n34-Mondo12.png\n: In that case, I don't mind doing it. I don't like havin' to think, anyway. I'll let you guys figure out who killed that chick.\n35-Hina2.png\n: Okay, then we can let Mondo look after the scene.\n14-Byakuya3.png\n: Well, no...we can't just leave him there alone.\n37-Mondo5.png\n: What? Why the hell not!?\n38-Byakuya7.png\n: Isn't it obvious? If you were the culprit, what's the first thing you would do? By volunteering for guard duty, you're in a position to destroy all the evidence you want.\n39-Mondo9.png\n: Wh--!? Fuck you!\n41-Sakura.png\n: Fine, then I'll stay there on guard duty as well. That way there's no problem.\n42-Hifumi3.png\n: 2-player co-op base defense with the two of them... With their stats, they're totally OP!\n41-Sakura.png\n: Since we won't be able to help investigate, we're putting out faith in the rest of you.\n35-Hina2.png\n: I'm still pretty freaked out, but...I'll try.\n45-Celeste7.png\n: Hmm?\n46-Celeste3.png\n: Heh heh...so you finally noticed.\n47-Leon14.png\n: Huh? Noticed what?\n48-Celeste.png\n: I was looking through the Monokuma File we received. And I noticed something very obvious, and very unusual.\n50-Chihiro5.png\n: Huh? What are you talking about...?\n48-Celeste.png\n: Go ahead, take a look. Notice anything interesting about where Sayaka died? She died in\nMakoto's dorm\n.\n35-Hina2.png\n: Wh--? She's right!\n52-Hifumi10.png\n: Then, could it be...!?\nAll at once, everyone's gaze turned to me.\n21-Makoto2.png\n: H-Hold on a second! You've got it all wrong! F-For just one night, I...I traded rooms with her. I did it because...she was afraid.\n29-Toko12.png\n: Y-You expect us to b-believe that? Just tell us the t-truth!\nThe look in everyone's eyes had done a complete 180 from just a few minutes earlier. The feeling of suspicion and fear had returned. In other words... Y-You think *I* did it!?\n55-Kyoko13.png\n: Are we all done talking? We need to begin our investigation soon. At this point, we should split up. We need to get to the bottom of this and find out who killed Sayaka. We'll have to collect clues to form a foundation, then construct an argument to come to a final decision. If we get this wrong...\n56-Kyoko17.png\n: Well, do I really have to say any more?\n57-Hifumi19.png\n: I'd rather you didn't, no...\n59-Kyoko19.png\n: Everyone pray for good luck. *leaves*\nWith that, Kyoko hurried out of the gym.\n61-Byakuya14.png\n: I'll be going, too. *leaves*\nAnd just like Kyoko, he was gone before we realized it...\n63-Mondo2.png\n: Oh yeah, I'm on guard duty, huh? I'd better head to the scene of the crime!\n41-Sakura.png\n: Ah, that's right.\n37-Mondo5.png\n: ...Lemme just say this right now! If whatever son of a bitch did this is here right now, and they're thinking of destroying that evidence...\n65-Mondo7.png\n: They'd better not let me find 'em! I'll skip the trial and cave their goddamn skull in myself! I'm serious! I will fuck them up!\nLetting his deadly words hang in the air, he and Sakura ran off.\n35-Hina2.png\n: But...I mean, we're not detectives or anything y'know? And we're gonna investigate a murder? How do we even do something like that?\n67-Toko.png\n: We don't r-really have to do anything in p-particular. W-We already know who k-killed Sayaka...\n21-Makoto2.png\n: What are you implying...?\n68-Toko2.png\n: It was y-you.\n21-Makoto2.png\n: I'm telling you, it wasn't me!\n70-Toko17.png\n: D-Don't come any c-closer! Are you g-gonna kill me next!?\n35-Hina2.png\n: W-Well, I guess it wouldn't hurt to give it a shot. It's not for sure Makoto's guilty yet.\n71-Hifumi2.png\n: That's true. We may as well at least check just to check.\n67-Toko.png\n: Even if I w-wanted to, I c-couldn't help inv-vestigate...\n73-Leon2.png\n: Wait, why not?\n74-Toko5.png\n: I'm not g-good with...b-b-blood. All it takes is o-one glimpse and I b-black out.\n47-Leon14.png\n: Well, whatever. I don't think anyone was expecting much from you, anyway. Alright, I guess I better get going. *leaves*\n21-Makoto2.png\n: W-Wait, don't go yet! You have to hear me out!\nBut it was pointless. Everyone had already left. And their parting looks at me had still been filled with suspicion...\n21-Makoto2.png\n: ...\nDoes everyone really think I'm the killer? How did it turn out like this? Seriously, they've got it all wrong...\n21-Makoto2.png\n: Why do they have to suspect me!?\nI have to do something... Otherwise, everyone will...\n77-FlashT.png\n79-FlashB.png\n80-Monokuma16.png\n: Execution is...execution. Ex-e-cution! Electric chair, bzzt bzzt! Poison gas, cough cough! Torn apart like a paper place in a hurricane!\nI can't let that happen... I can't let things turn out the way Monokuma wants! All I have to do is find out who really did it... Who really killed Sayaka..!\n82-BOX15.png\n(This is one of my favorite tracks in the game.)\n83-Narration.png\n: Welcome to the Investigation! We must now explore the crime scene and the school finding clues called Truth Bullets that we can use as evidence to prove our innocence and figure out who is guilty.  The trial will not begin until we have found all the Truth Bullets so there's no worry of entering a trial unprepared. Inspect everything you think is relevant to the murder and you'll find the Truth Bullets with little trouble. Let's begin with the first Truth Bullet before I end the update.\nI guess I should look through the Monokuma File we got before...\n\"The victim was Sayaka Maizono. The time of death is estimated to be around 1:30 a.m. The body was discovered in Makoto's room, in the dormitory. All evidence suggests that the death took place in the bathroom. The cause of death was a stab wound to the abdomen. There was also an injury to her right wrist. Specifically, the wrist appears to have suffered a fracture.\"\nWe have no choice by to push forward if we want to find out what happened...\n21-Makoto2.png\n: Somehow, I have to find out the truth. So that we can all survive... And for Sayaka... I have to find out how she was killed!\n83-Narration.png\n: Now that the Truth Bullet has been obtained, we can review it at any time during this investigation.\n83-Narration.png\n: Next time, the investigation begins in earnest.\n2-BOX15.png\n3-Narration.png\n: Let's start by talking to Mr. Non-believer over here.\n5-Hiro6.png\n: Ugh...no way. I seriously don't wanna die here!\n6-Hiro11.png\n: I'm begging you! God, Buddha, Mother Earth, God of Space, King Neptune! Help me! I don't care who it is, just get me outta here!\nHiro doesn't seem prepared to do any kind of investigating right now...\n9-Makoto2.png\n: Aren't you going to help investigate, Chihiro?\n10-Chihiro10.png\n: But...I can't leave Junko here. I-I feel sorry for her... I...I have to stay with her.\n3-Narration.png\n: That's all we can do in the gym for now.\nFirst of all, I should head to the scene of the crime--\nmy room\n. We won't make any progress without investigating there.\nSo I headed to my room, where Sayaka's corpse still remained.\nI'd better examine the state of my room a little closer. That might reveal something new.\n3-Narration.png\n: The bedroom sure is a mess.  This means there are a lot of things to examine in here.\nHuh? Looking at the lint roller, it looks like there's way less than there was before. Did Sayaka see how dirty my room was and decide to clean up a little...?\nThis is the replica sword I brought back for self-defense. Does this mean it was used in the attack somehow? And plus, it's been\ntaken out of its sheath\n. I hadn't actually looked at the blade itself till now. I shouldn't be surprised it's coated in gold, too.\n9-Makoto2.png\n: On top of that...\nSome of the gold coating has come off of parts of the blade, and the handle. Yeah, the handle especially is missing a lot of its coating. I remember the coating sticks to you even if you just touch it a little bit.\nThere's a key on the ground... It has my name on it, so this must be my room key. If I remember correctly...\n21-FlashT.png\n23-FlashB.png\n24-Sayaka6.png\n: Ah, that's right. We'll have to trade keys.\nWhen we switched rooms, we switched keys, too. So Sayaka would have had the key here in my room the entire time.\n9-Makoto2.png\n: But wait, if that's true, then how did the killer get into the room in the first place?\nCould Sayaka have forgotten to lock the door? No, that seems impossible...\n21-FlashT.png\n23-FlashB.png\n9-Makoto2.png\n: The same goes for you, Sayaka. No matter who it is, don't open your door for anyone.\n24-Sayaka6.png\n: Even if I'm sure it's you, I absolutely won't open it. Otherwise, what's the point of even switching?\nAfter saying that, there's no way she would have forgotten to lock it, or opened it for any reason.\n9-Makoto2.png\n: Well, maybe she dropped the key somewhere, and someone else grabbed it or something.\nNo, that's not possible either. Sayaka was in here when we switched rooms. And with how scared she was, she wouldn't have gone walking around. So she couldn't have dropped it. So how did the killer...?\nThere are scratches and gouges on my walls and bed.\n9-Makoto2.png\n: Is that evidence of a struggle?\nIt looks like there must have been some kind of\nfight\nin my room...\n9-Makoto2.png\n: Dammit! I was right there in the other room! If only I'd heard something!\n31-Sakura4.png\n: That would not have been possible.\n9-Makoto2.png\n: Huh?\n33-Sakura3.png\n: Don't you remember? All of our rooms are completely soundproof. So something could happen in the room right next to you, and there's no way you could know.\n31-Sakura4.png\n: Perhaps this was another of Monokuma's strategies, creating an ideal setting for murder.\n9-Makoto2.png\n: ...\n3-Narration.png\n: Speaking of Sakura, let's see what she thinks about the situation.\n9-Makoto2.png\n: Sakura, do *you* think I'm guilty, too?\n38-Sakura7.png\n: I try not to make assumptions like that. I simply don't know whether or not you did this.\n39-Sakura6.png\n: Whatever decision the rest of you come up with, I will follow your lead.\n9-Makoto2.png\n: I see.\nThis is the replica sword I brought back for self-defense. Does this mean it was used in the attack somehow? And plus, the sword's been taken out, so it's just the sheath, but...\n9-Makoto2.png\n: Huh?\nThere's some scratches on the sheath. They must've been make with something sharp.\n9-Makoto2.png\n: But how'd the sheath get scratched up in the first place?\nEven if someone used the sword during the struggle, it doesn't make sense for the sheath to be damaged. I mean, if you're gonna attack someone with a sword, the first thing you'd do is unsheathe it. A heavy sheath like this would only get in the way. It could just slide off in the middle of the fight. So why are there scratches on the sheath?\nThe toolkit is still inside the drawer. I don't see any evidence that it's been used at all.\n9-Makoto2.png\n: Which makes sense, I guess. I mean, it's mine, and I haven't had any reason to open it. I can't even imagine a situation where I'd need a toolkit like this.\n46-Mondo12.png\n: Yeah, seriously!\n9-Makoto2.png\n: Oh, Mondo...\n46-Mondo12.png\n: We ain't exactly in the mood to be buildin' fuckin' furniture, right?\n9-Makoto2.png\n: So you haven't used yours either, then?\n48-Mondo2.png\n: Not just me. Nobody's busted theirs out yet, far as I know. Actually, we were talkin' about it yesterday.\n49-Mondo.png\n: None of the guys have opened their toolkits yet. Cuz like, why the hell would we?\n3-Narration.png\n: Mondo had some good information, let's see if he can think of anything else.\n46-Mondo12.png\n: Ya know, I realized something while I was on guard duty. The killer could've already destroyed some evidence, right? Before anyone found the body, I mean. There's a\ntrash room\nhere in the dorms, right? They coulda tossed some stuff in there.\n9-Makoto2.png\n: Y-Yeah, that's definitely possible.\n54-Mondo6.png\n: That dirty bastard!\n55-Mondo8.png\n: Anyone who raises their hand to a woman is scum that deserves death. That's what my brother taught me.\n56-Mondo7.png\n: So if I ever find the son of a bitch that did this, I'm gonna pound his goddamn face in.\n9-Makoto2.png\n: B-But what if it was a girl that did it?\n49-Mondo.png\n: ...\n58-Mondo3.png\n: That'll all get sorted out when the time comes.\n3-Narration.png\n: The trash room, huh? We'll have to visit there later. For now, someone else is in the room too.\n9-Makoto2.png\n: Hey, Kyoko...\nI quietly called her name while she was investigating the area. But...\n62-Makoto9.png\n: What are you doing?\n63-Kyoko23.png\n: Isn't it obvious?\n62-Makoto9.png\n: N-No, not really.\n63-Kyoko23.png\n: I'm searching.\n62-Makoto9.png\n: Searching?\nShe was down on her knees, carefully inspecting every inch of my room.\n62-Makoto9.png\n: Did you lose a contact or something?\n63-Kyoko23.png\n: ...\nI dunno what she's going exactly, but she seems to be concentrating pretty hard on it.\nBut a few seconds later, she suddenly stood up straight and said...\n65-Kyoko12.png\n: Are you a clean freak?\n9-Makoto2.png\n: Huh? N-No, I don't think so. But what...?\nNodding, she glanced around my room one more time.\n67-Kyoko17.png\n: Interesting...\nWhat's interesting?\n65-Kyoko12.png\n: Just as I suspected, there's something\n[very unusual]\nabout your room.\n> very unusual\n9-Makoto2.png\n: Unusual? What do you mean?\n69-Kyoko11.png\n: I've searched your floor from one corner to another and I didn't find one single strand of hair.\n9-Makoto2.png\n: Really?\n69-Kyoko11.png\n: Not one hair from the victim, and not one hair from you, even though you've been living in here.\n9-Makoto2.png\n: You know, now that you mention it, I noticed something while I was looking around before. It looked like the lint roller in my room had been used, but I never touched it. Could someone have used it to...?\n65-Kyoko12.png\n: Very interesting. Your room didn't have a single hair in it, and someone used your lint roller without your knowledge. In other words, someone other than you came in and scrubbed your room clean.\n9-Makoto2.png\n: Was it Sayaka? Or the killer?\n71-Kyoko2.png\n: That's the question, isn't it?\n3-Narration.png\n: Now for the part Makoto doesn't want to see again.\nThe bathroom... And on the other side of this door...\n21-FlashT.png\n23-FlashB.png\n9-Makoto2.png\n: ...\nNo, I can't let it get to me! I can't afford to freeze up now! Forcing myself to push my panic down, I stepped into the bathroom.\n77-AllStarApologies.png\nLooking at her made it painfully clear it wasn't a dream, or an illusion. She had lost everything that made her \"her\"...\n9-Makoto2.png\n: Sayaka...\nAll at once I was overcome with dizziness, nausea, the urge to burst into tears... But I can't...I can't hesitate now. Why? Why did Sayaka have to die? I have to uncover the truth. I have to find out what happened!\nI wanted to give up, I wanted to collapse. But that thought held me up and supported me.\n2-BOX15.png\nI told myself I simply couldn't face what I saw, but...\n9-Makoto2.png\n: But now's no time to think like that!\nI pulled out the Monokuma File to verify what it said about her body.\n9-Makoto2.png\n: Some sort of\nsharp object\nhas been thrust into her stomach. That must've been the killing blow. But whatever they used to kill her, where'd they get it? That's definitely something I should look into later.\n9-Makoto2.png\n: Also according to the Monokuma File, Sayaka's right wrist is broken.\nHer wrist does look swollen and bloody, that's for sure. But there's something sorta glittery there on her wrist, too.\n9-Makoto2.png\n: Right there, where he wrist is all swollen, there's something glittery. That definitely concerns me.\nAnother thing that concerns me is...\nHuh? There's some blood on her left index finger, but that's it. The palms of both her hands are totally spotless, so how come only her left finger...?\nThe stab wound in her stomach is what killed her, so when she broke her wrist... That must have happened earlier on. I mean, how would her wrist get broken after she'd already been killed? So it's very possible she broke her wrist during the struggle. The killer attacked Sayaka in the main room, which is when her wrist got broken. After that, the killer cornered her in the bathroom where they inflicted the deadly wound.\n9-Makoto2.png\n: ...\nI looked past Sayaka to the wall behind her. And there I saw...\n9-Makoto2.png\n: Wh--!?\nWritten in blood were the numbers\n11037\n. Did Sayaka do this?\n3-Narration.png\n: That's all there is to check in the bathroom.\n69-Kyoko11.png\n: It looks like you found it, right Makoto? The\n[bloody numbers]\n... That's most likely Sayaka's\n[dying message]\n.\n> bloody numbers\n9-Makoto2.png\n: I've never seen something written in blood before... It really was her final message... It's as if she wrote it with life itself.\n71-Kyoko2.png\n: ...Do you often talk like an aspiring poet?\n9-Makoto2.png\n: But the numbers she wrote, what do they mean?\n11037\n... I have no idea what that could possibly mean.\n69-Kyoko11.png\n: The way she wrote the numbers makes me think she wanted to use her body to block them. If she wrote them in that location, while she was sitting the way we found her, it means she must have wrote them by\nturning only her hand toward the wall\n. If you were to write something in that position, do you know what the result would be?\n9-Makoto2.png\n: The result?\n71-Kyoko2.png\n: Think about it.\n9-Makoto2.png\n: You're not gonna tell me?\n86-Kyoko13.png\n: You need to uncover the mystery of this case yourself. Otherwise, the case will end and you'll remain unconvinced.\nI have no idea what you're trying to say, but it's obvious you're not going to tell me.\nIt sounds like Kyoko knows what Sayaka's dying message means. But honestly, I have no idea... Oh, I know who I should talk to. When it comes to numbers, who better to ask than the Ultimate Programmer?\n67-Kyoko17.png\n: There's one other thing I wanted to ask you about. Do you know how the door to your bathroom got broken?\n9-Makoto2.png\n: Broken? Oh, you mean how it gets stuck?\n90-Kyoko9.png\n: Gets stuck?\n9-Makoto2.png\n: Yeah, I guess I'm the only one, but the door doesn't fit in the frame quite right. When I first tried to use it, I thought it was just locked. But once you learn the trick, it opens no problem.\n67-Kyoko17.png\n: So the door doesn't quite fit the frame, huh? But actually, I'm referring to the\nbroken doorknob\n.\n9-Makoto2.png\n: Huh? The doorknob?\n92-Kyoko.png\n: You didn't notice? Well, just try closing the bathroom door. I'm sure you'll see right away what I'm talking about.\nI did what Kyoko said and shut the bathroom door.\n9-Makoto2.png\n: Huh?\nThe doorknob...\n9-Makoto2.png\n: Wh-What the heck!? The doorknob's practically about to fall off! Why is it like this...?\n69-Kyoko11.png\n: Someone must have used a screwdriver or something similar to unscrew it. Whatever it was, it's obvious this was intentional.\n9-Makoto2.png\n: What!? It was intentional? Why would someone want to do that!?\n65-Kyoko12.png\n: I guess maybe they were trying to get the door unlocked and ended up breaking the whole thing.\n9-Makoto2.png\n: But my bathroom doesn't have a lock on it. Only the girls' bathrooms can lock, right?\nShe stood there for a while, lost in thought. Then, apparently struck with a sudden realization, she shot a question at me...\n86-Kyoko13.png\n: I have just one more question for you. You mentioned earlier that your\nbathroom door would get stuck\n, right? Did you tell anyone about that?\n9-Makoto2.png\n: Oh, umm... Well, I did tell Sayaka about it last night, when we switched rooms.\n86-Kyoko13.png\n: So what you're saying is, only you and Sayaka knew about it. Hmm... Interesting...\nShe had the slightest hint of a smirk on her face. I got the sense that she was really starting to get into all this.\n67-Kyoko17.png\n: Then that clears that up.\n9-Makoto2.png\n: Huh? What clears what up? I'm so lost...\n95-Kyoko19.png\n: Well, see you later. *leaves*\nAs if forgetting I was ever even there, she suddenly turned and left the room.\nI still don't really understand any of this, but I've already given my room a good once-over. Maybe I should look around somewhere else. I should start looking into where the murder weapon might have come from. And also, I should look into the DVD Sayaka got. With Sayaka dead, I have no choice but to see for myself what was in that video. And on top of that, I'm sure there are some other areas worth checking out, too. Maybe I should see what everyone else think. If they'll even talk to me, that is...\n3-Narration.png\n: Next time, Investigation Part 2.\n2-BOX15.png\n3-Narration.png\n: Next on the list, we need to get the DVD from Sayaka's room and also we want to check out the Trash Room. But first, someone's hanging out in the hall.\n5-Leon11.png\n: Something doesn't seem right. The Monokuma File said Sayaka was killed in your room. I just can't stop thinking about it. Could it be...the\nnameplate\n?\n3-Narration.png\n: Nameplate? What's he talking about? The room nameplates?\nHuh? This *is* Sayaka's room, right? But the nameplate has my name on it.\nHuh? This is definitely my room, but the nameplate has Sayaka's name on it.\n8-Makoto2.png\n: The nameplates on my room and Sayaka's room were switched!?\nSo all that effort I put into switching rooms without anyone knowing was totally pointless. But, why would anyone do that?\n3-Narration.png\n: Well, we may as well get the DVD while we're here.\nThere can only be one thing in the trash can. Yup. The DVD with Sayaka's name on it.\n8-Makoto2.png\n: Sayaka got really upset after seeing whatever was in that video.\nI wonder...what did she see? It might not be directly related to the case, but it might be worth checking out anyway.\n8-Makoto2.png\n: I'm sorry, Sayaka. I need to borrow this DVD.\n3-Narration.png\n: Next, the Trash Room.\nThere's a hatch on the floor.\n*Rattle rattle*\nThe door won't budge. It must be locked.\nThere's a sturdy gate here. No way to get past...\n17-MrMonokumasLesson.png\n18-Monokuma.png\n: It's the end of the line. The trash room... This is where all the trash in the school eventually winds up.\n8-Makoto2.png\n: How do you get this gate open?\n18-Monokuma.png\n: No no no! No entry beyond this point! Only the person on cleaning duty is allowed in!\n8-Makoto2.png\n: Cleaning duty?\n18-Monokuma.png\n: No no no! No entry beyond this point! Only the person on cleaning duty is allowed in!\n8-Makoto2.png\n: Who's on cleaning duty?\n18-Monokuma.png\n: No no no! No entry beyond this point! Only the person on cleaning duty is allowed in!\nThis is stupid. It'd be faster to just go around and ask the others.\n18-Monokuma.png\n: No no no! No entry beyond this point! Only the person on cleaning duty is allowed in! *leaves*\n2-BOX15.png\n3-Narration.png\n: Back outside, Byakuya is the first person we run into. Let's see if he knows about cleaning duty.\n8-Makoto2.png\n: Byakuya, can you tell me anything about cleaning duty?\n22-Byakuya.png\n: ...No.\n24-Byakuya7.png\n: You're like a child lost in the woods, you know that? A total waste of space.\n8-Makoto2.png\n: What do you mean?\n22-Byakuya.png\n: Taka's the one who has any interest in organizing things like that.\nOh, good point.\n3-Narration.png\n: Well he didn't directly know but he told us who would. Taka's in the 1st floor hallways but before we talk to him, we wanted to see if Chihiro could tell us anything about those numbers Sayaka wrote.\n3-Narration.png\n: One quick warp to the gym later...\n8-Makoto2.png\n: Hey, Chihiro. I was hoping I could ask you something.\n28-Chihiro.png\n: Oh, what is it?\n8-Makoto2.png\n: Before she died, Sayaka left a message. She wrote out the numbers\n11037\n. Do you have any idea what these numbers might mean? Like, could they be a code or something?\n30-Chihiro14.png\n: Umm... Sorry, no...\nChihiro slowly shook her head.\n32-Chihiro8.png\n: I-I'm sorry. I just don't know.\n8-Makoto2.png\n: Okay. Well, don't worry about it. Thanks anyway for trying.\nEven she doesn't know. Or, could she maybe know more than she's letting on? ...No, couldn't be.\n3-Narration.png\n: Now to speak with Taka.\n35-Taka.png\n: Cleaning duty, eh? As a matter of fact, Monokuma came and talked to me yesterday morning!\n8-Makoto2.png\n: Really!?\n37-Taka7.png\n: He probably realized I was basically in charge, so he decided to talk to me directly! The topic of conversation was assigning cleaning duty!\n8-Makoto2.png\n: Oh, so you're on cleaning duty now?\n35-Taka.png\n: Actually, no.\n8-Makoto2.png\n: Huh? Okay, then who is?\n39-Taka3.png\n: Hifumi was also there when we had this conversation. He volunteered right away, so I let him have it!\n8-Makoto2.png\n: So *he's* on cleaning duty, then.\n35-Taka.png\n: Indeed. But we'll swap out on a weekly basis. I'm sure you'll be up before too long.\n41-Taka8.png\n: And when that time comes, I'll be counting on you!\n3-Narration.png\n: Back in the dorms, Hifumi is also hanging around outside Makoto's room.\n8-Makoto2.png\n: Umm...I'm looking for whoever's on cleaning duty.\n44-Hifumi.png\n: Cleaning duty? As a matter of fact, that's me. Why do you ask? It just so happens Monokuma talked to me yesterday and asked me to take care of it. Without someone on cleaning duty, the school would be flooded with trash in no time.\n46-Hifumi4.png\n: So I formally applied for the position!\n44-Hifumi.png\n: I was gonna start this morning, but after what happened, I haven't had a chance to get started.\n8-Makoto2.png\n: And since you're on cleaning duty, you can open the gate in front of the trash room?\n48-Hifumi21.png\n: Of course! It's my job to gather up all the garbage and toss it in the trash room. And to do that, they gave me the key for the trash room gate!\n46-Hifumi4.png\n: But we're supposed to rotate once a week, so eventually you'll be in charge.\n50-Byakuya9.png\n: Wait, hold on. You need a key to get in the trash room? And only the person on cleaning duty has access to the key? What's the point of going to all that trouble? Why not just leave the trash room open all the time so we can all throw things out whenever we want?\n8-Makoto2.png\n: That does seem more convenient.\n50-Byakuya9.png\n: Actually...\n53-Byakuya3.png\n: That must be why. If anyone could go in and out of the trash room whenever they wanted, then destroying evidence would be easy. The thrill would disappear, and things would become boring.\n8-Makoto2.png\n: B-Boring!?\n55-Leon13.png\n: Anyway, more important than that...\n56-Leon15.png\n: Hey fatty! Why'd you want the cleaning duty gig, anyway!?\n57-Hifumi6.png\n: I-I just decided to volunteer for something I knew no one else would wanna do. What's the big deal!?\n56-Leon15.png\n: Liar! I know why you did it.\n5-Leon11.png\n: You wanna dig through all the girls' trash! Looking for...y'know...and poking around at it!\n46-Hifumi4.png\n: What are you talking about!? All my love is for 2D!\n59-Leon14.png\n: But there's all kinds of trash diggers like that! Maybe you'll get tired of 2D, and then turn to--\n61-Hifumi13.png\n: I would NEVER get tired of 2D!\n62-Hifumi15.png\n: After spending a significant amount of time comparing 2D and 3D, I voluntarily chose 2D! The only thing 3D is good for is to shower love and affection on 2D! Oh, and PVC figures!\n63-Leon2.png\n: How are you not totally embarrassed to say stuff like that!?\n22-Byakuya.png\n: If you're so worried about Hifumi's questionable morality, there's a very easy solution. Whenever a guy has cleaning duty, Sakura can accompany then, from picking up the trash to disposing of it.\n65-Hifumi10.png\n: Whaaat!?\n66-Byakuya2.png\n: If you're as innocent as you claim, where's the harm in it?\n67-Hifumi12.png\n: Kh--! That's not how it's supposed to--!\n8-Makoto2.png\n: Anyway, on another topic... Hufumi, since you were on cleaning duty, I have a favor to ask you.\n69-Hifumi3.png\n: What, so now you suddenly want to join my party? Sorry, but you haven't triggered that flag yet. I mean, you haven't helped me recover from a past trauma, or save a village, or beat a boss.\n8-Makoto2.png\n: No, nothing like that. I was just hoping to get into the trash room and look around.\n48-Hifumi21.png\n: Oh, okay!\n8-Makoto2.png\n: So easy...!\nSo, Hifumi and I headed down to the trash room.\n69-Hifumi3.png\n: You'd like me to open the gate, wouldn't you?\n71-Hifumi5.png\n: Bwehehe... You know, when I look at it, it makes me think. They said he killed his wife. He learned how to get by on the inside, but he never stopped dreaming. Get busy livin' or get busy dyin', he said. So him and Rita, they found themselves a way out...\n8-Makoto2.png\n: Whatever, please just hurry up!\n48-Hifumi21.png\n: Okie dokie! Leave it to me!\nHifumi pulled a key out of his pocket and used it to flip the switch next to the gate.\n44-Hifumi.png\n: However, Mr. Naegi...\n75-Hifumi14.png\n: Surely you aren't planning to use the trash room to destroy evidence, are you!? Y-You fiend! You planned this all along!\n8-Makoto2.png\n: N-No! I just wanted to see if the actual killer had tried to destroy any evidence or not!\n76-Hifumi17.png\n: But the \"actual killer\" is YOU, isn't it!? You want to see if you left anything behind!\n78-Hifumi9.png\n: Wait, maybe a parallel world...?\nWhatever, let's just hurry up and keep looking.\nThis is the incinerator. It's way in the back part of the trash room. It's a good thirty feet from here to the gate.\nAh! And it's on right now!\n44-Hifumi.png\n: Do you see the green and yellow buttons next to the mouth of the incinerator?\n69-Hifumi3.png\n: It's a pretty simple setup. You press the\ngreen button\nto get it going, and the\nyellow button\nto turn it off. Sooner or later you'll be on cleaning duty, so make sure you learn this before you leave, okaaaAAAYYY!?!?\n65-Hifumi10.png\n: Huh!? Someone turned the incinerator on! Very strange... I'm quite certain it was off last time I was down here.\n85-Hifumi18.png\n: Perhaps it was the work of a fairy...\n8-Makoto2.png\n: Hifumi! Do you realize what you just said!?\n78-Hifumi9.png\n: Huh? The fairy?\n8-Makoto2.png\n: ...No. You said that last time you were here, the incinerator was off.\n46-Hifumi4.png\n: Ah, yes. About that there can be no mistake. If I've got one thing going for me, it's my memory!\n76-Hifumi17.png\n: Yesterday, as soon as I was appointed, I came down to check the place out. It definitely wasn't on then. I haven't been back to the trash room since then. And since I'm the only one who has a key to open the gate...\n85-Hifumi18.png\n: ...it should be impossible for the incinerator to be on. And yet...\nSo that means someone was able to switch on the incinerator without opening the gate. But, how is that possible?\n8-Makoto2.png\n: There's something on the ground in front of the incinerator. It looks like a burnt piece of...something.\n44-Hifumi.png\n: A burnt piece...? Like a hunk? Like a hunk of burning love!?\n8-Makoto2.png\n: ...\nAnyway. This is... It looks like a piece of cloth. And the shape... It's part of the sleeve from a button-up shirt! And now that I look at it, that's definitely blood on the cuff! Which means...!\n8-Makoto2.png\n: This is all that's left of some of the evidence the killer destroyed...\nBut there are lots of people here with white button-up shirts. This isn't enough by itself to figure out who the killer is.\nThere are shards of broken glass scattered around in front of the incinerator. It looks like it used to be some kind of glass ball, just about big enough to fit in the palm of your hand.\n44-Hifumi.png\n: Ngyah! Is that...?\n8-Makoto2.png\n: Do you know what this is?\n71-Hifumi5.png\n: They say if you collect all seven a dragon will appear and grant you a single wish!\n94-Hifumi20.png\n: Erm, kidding aside, it's the kind of thing you might see on any big-city street corner. Gaze into it, and it will show you a glimpse of the future. Just like that Meena girl who was on that quest to find that one guy!\nYeah, I get what you're trying to say. But who did this particular ball belong to? There's only one person it could be. They should all still be in the\ngym\n. I'd better go find out for sure.\n44-Hifumi.png\n: This whole thing is quite strange, indeed. When I was here last, the incinerator was off, and those glass shards and burnt clothes weren't.\n75-Hifumi14.png\n: What does it all mean, Mr. Naegi!? Will you be confessing soon!?\n8-Makoto2.png\n: Why me...?\n76-Hifumi17.png\n: Everyone already knows you did it! All the mysteries are being solved one by one!\nIt sounds like he's living out one of his comic book fantasies.\n3-Narration.png\n: That's all there is in the trash room. Next time, we wrap up the investigation.\n2-BOX15.png\n3-Narration.png\n: Time to check the dining hall for clues.\n6-Makoto2.png\n: Hina... Are you investigating the dining hall?\n7-Hina2.png\n: Oh, no. I'm just taking a break. Actually, I've been taking a break since we started. This is all a first for me, ya know? I don't have the first clue what I should be doing.\n6-Makoto2.png\n: I know what you mean...\n9-Hina6.png\n: And I dunno why, but being in the dining hall helps keep me calm. So I know I shouldn't, but I've just been kinda...hanging around here. To tell the truth...I was doing the same thing last night, when Sayaka was killed.\n3-Narration.png\n: Let's check out what's back here.\n3-Narration.png\n: We haven't been in the kitchen yet, but aside from various fruits and meats, there's not much to check, except for one big thing.\nThere are all kinds of kitchen knives here, big to small. But it looks like one of them is missing. Was it missing from the very beginning, or...? I'd better see if anyone here knows more about it.\n3-Narration.png\n: Back in the dining hall...\n6-Makoto2.png\n: Hey, so...did you notice that one of the kitchen knives is missing from the dining hall?\n16-Hina20.png\n: Yeah, weird huh? I thought it was kinda strange, a knife just suddenly disappearing like that.\n6-Makoto2.png\n: Oh, so it wasn't missing from the beginning?\n18-Hina22.png\n: Nope. Last I remember, they were all lined up in a nice, neat row.\n6-Makoto2.png\n: So when did you notice one of them had disappeared?\n7-Hina2.png\n: Well, I went to go get some tea from the kitchen last night, and all the knives were still there. But when I finished my tea and went back into the kitchen to wash my glass, one of the knives was gone.\n6-Makoto2.png\n: So you're saying the knife disappeared while you were drinking your tea in the dining hall?\n19-Hina.png\n: Yeah...\nIn other words, you were right there in the dining hall when someone came and took it. Then you should be able to say for sure. You can tell everyone I didn't come to the dining hall last night. Which proves I didn't take it!\n22-Hina9.png\n: Hey, by the way... Did you really kill Sayaka?\n6-Makoto2.png\n: Wh-What!? Of course not! I would never!\n22-Hina9.png\n: ...\n6-Makoto2.png\n: Hina... do you really think I murdered her?\n22-Hina9.png\n: Well... she was killed in your room, right? So I mean... You guys were supposed to be friends, right? But you still... killed her... On the other hand, two people becoming good friends, then one killing the other is a classic drama setup. So when you consider everything together...\n24-Hina14.png\n: ...I honestly have no idea.\n6-Makoto2.png\n: ...\n3-Narration.png\n: Next on the list, time to chat with our depressed psychic friend.\n6-Makoto2.png\n: Hey Hiro, can I ask you something?\n27-Hiro13.png\n: Aggh! No no no no no! I gotta get outta here! Gotta get out now! I've had enough! Gotta break free!\n6-Makoto2.png\n: Hiro, snap out of it!\n28-Hiro5.png\n: Ghh... Hrm? Huh? Makoto, what are you doing here? What...?\n6-Makoto2.png\n: Hey, um, does this look familiar?\n31-Hiro8.png\n: Ahhh! That's my crystal ball! But it's all smashed! What the hell...?\n28-Hiro5.png\n: I-I only bought it cuz the guy said it was blessed! He said it was unbreakable! So how did it break?\n31-Hiro8.png\n: Was it actually made of glass!? And not crystal!? Did that guy totally dupe me!?\n28-Hiro5.png\n: He said it belonged to the pillars of history... Genghis Khan, George Washington, Napoleon... He said whoever controlled that crystal ball controlled the world! Was that seriously all BS!?\n6-Makoto2.png\n: U-Umm...let's put that aside for now. So you can say without a doubt that this belonged to you?\n28-Hiro5.png\n: Yeah, that's mine for sure. I prolly forgot it in the laundry room last night. Someone musta come by and snatched it.\nYou left it in the laundry room? That means anyone could have found it and taken it.\n6-Makoto2.png\n: Thanks, Hiro. That's all I wanted to know.\n27-Hiro13.png\n: S-Sure...\n6-Makoto2.png\n: ...Um, by the way, I'm almost afraid to ask, but how much did you pay for that thing?\n27-Hiro13.png\n: Everything I saved up from fortune-telling for two full years. Came out to be like...a million.\n6-Makoto2.png\n: A m-million!?\n27-Hiro13.png\n: That's pretty cheap, actually. I mean, considering it gives you the power to control the world...\nThat's just too...too stupid. I can't even feel bad for him.\n3-Narration.png\n: We're nearing the end of the list of things to check. Time to watch the DVD Sayaka received.\nI should be able to use this to see what's on the DVD. The DVD that Sayaka threw in the garbage... I sat down in front of the screen and put the DVD in the player. I pushed play, and the screen was dark for a few seconds. But then...\n38-BeautifulDays.png\n...an image slowly appeared. It looked like some kind of concert. And standing onstage, front and center, was a face I recognized all too well.\n6-Makoto2.png\n: Sayaka...\nShe was there, along with the friends she said had been so important to her. She was positively glowing there in front of the crowd. So full of life... Seeing that image made it even harder to accept that she was...dead. My vision started to blur and darken, and then... That voice I'd come to despise so much began to float out of the speakers.\n39-SayakasDVD.png\n40-Monokuma16.png\n: Sayaka Maizono, the Ultimate Pop Sensation--lead singer for a world-famous all-girl pop band. For these girls, the glowing spotlight only made them that much more beautiful. But then...\n♪\nMusic cuts out.\n♪\nSuddenly, the screen went dark. And in the next moment I saw something I could hardly believe.\n44-DISTRUST.png\n6-Makoto2.png\n: What the--!?\nSayaka had disappeared from the stage, which was now in ruins. But what I noticed even more than that was the figures of the other girls, who had all simply...collapsed.\n46-SayakasDVD2.png\n47-Monokuma.png\n: This ultra-successful team suddenly fell apart! None of them will ever perform on stage again. None of them will ever feel the warmth of the spotlight. For Sayaka, there's simply nowhere for her to return to. So here's the billion-dollar question--what of what could have caused the group to go to pieces!?\nWithout warning, the video cut off.\n6-Makoto2.png\n: Wh-What the hell?\nThat wasn't real, right? They're a super famous pop group. Everyone knows who they are. Is he trying to say he was even able to get to them? If that really did happen, everyone in the outside world must be going crazy!\n6-Makoto2.png\n: What kind of person would take things this far!?\n50-Timeforthe1stTrial.png\n*Ding dong, bing bong*\n53-MonokumaTV.png\n: Erm, so ah...I'm getting tired of waiting. What say we just get started, hm? It's time for the long-awaited Class Trial! Now then, allow me to appoint a proper location for the proceedings. Please go through the red door on the 1st floor of the school! Puhuhu. See you soon!\n6-Makoto2.png\n: The red door on the 1st floor... That's where I should go. No, where I *have* to go.\n3-Narration.png\n: There it is, the big red door we've passed by many times by now. It has always been locked up to this point but now, we can enter.\n56-BoysLifeofDespair.png\n58-Taka9.png\n: You're late, Makoto! We've all been waiting for you!\n59-Toko3.png\n: Hmph. I bet y-you were afraid you would be discovered as th-the murderer you are...\n60-Taka7.png\n: Let's not jump to conclusions just yet! Save that for the class trial! There we can all reveal the details of Makoto's crime!\nSo they really are convinced I did it. But...\n61-FlashT.png\n63-FlashB.png\nI didn't do it. Me and Sayaka both know that all too well. But then, who *is* the killer?\n65-ToSurvive.png\nThe one who murdered Sayaka... Is it really one of us?\n53-MonokumaTV.png\n: Puhuhu... Is everyone here? Okay then... Please board the elevator in front of you, which will transport you to the courtroom...where all your fates will be decided. Puhu. I'll meet you all down there. I'll be waiting...\nI guess I have no choice but to get on this elevator.\n68-Sakura.png\n: Let us begin. *leaves*\n69-Celeste17.png\n: Good idea. *leaves*\n6-Makoto2.png\n: ...\n71-Kyoko2.png\n: Are you scared?\n6-Makoto2.png\n: N-No, scared isn't quite right...\n71-Kyoko2.png\n: I said it before, but it's up to you to uncover the mysteries surrounding this case yourself.\n72-Kyoko19.png\n: If you don't, you'll never come to grips with the truth. *leaves*\nI need to uncover the truth of Sayaka's death... I didn't need someone else to tell me to do that.\n6-Makoto2.png\n: In Sayaka's honor, I swear I'll find out who the killer is!\nAs I raised my voice to try and give myself courage, I turned, trembling with anticipation, toward the elevator. With each step forward, I could feel my heart starting to race faster and faster. Everyone else was already on the elevator. When I finally stepped on... the doors closed, and the elevator started to move.\n♪\nNo music.\n♪\nThe steel box descended with heavy clunking sounds toward the school's basement.\n6-Makoto2.png\n: I wonder if this is how a death row inmate feels when his time finally comes.\n69-Celeste17.png\n: Rather than that, is it not more like a defendant waiting to receive his judgment?\nOblivious to our shared anxiety, the elevator lowered us further and further into the bowels of the school.\n65-ToSurvive.png\n75-Monokuma5.png\n: Nyohoho! You've finally arrived!\n75-Monokuma5.png\n: What do you think? Doesn't it feel just like a real courtroom? It's like a Hollywood movie set, right!?\n78-Mondo8.png\n: Not even close. It's total shit.\n80-Monokuma.png\n: Okay, okay, everyone find your assigned seats and sit down!\n75-Monokuma5.png\n: Hurry up now, hurry up!\nWe did what he said and found our seats.\nThe seats were arranged in a giant circle. It was set up so that everyone could see everyone else. Which also meant it'd be easy for anyone to transfer their tension and unease onto anyone else... The air seemed to grow heavy as we sat there.\nAnd so, the curtain on our first case opened.\nA deadly judgment... A deadly deception... A deadly betrayal...\nA deadly riddle, a deadly defense, a deadly faith...\nA deadly...Class Trial!\n85-UndergroundTrial.png\n3-Narration.png\n: Welcome to the Class Trial. This is the Pre-Trial Preparation screen, where we can set skills and review our Truth Bullets, as well as access the Options and Save/Load functions.\n3-Narration.png\n: The ticker along the bottom reads the following:\n\"What's this 'class trial' that Monokuma mentioned? Can Makoto sweep away the cloud of suspicion surrounding him, even with a dead body laying in his bathroom? And what about the blackened who's actually responsible for Sayaka's death?\"\n3-Narration.png\n: First, I went ahead and set my skills. We currently have 9 Skill Points and a couple skills. In general, Skills help your performance in the various minigames that the trial is composed of. Here's what I've set for this trial:\nCool and Composed:\nSteadies your aim a little. Effective during the Nonstop Debate and the Hangman's Gambit. Costs 2 SP.\n-We got this from Byakuya. It's actually very handy because in the listed minigames, the cursor you control will move around automatically. This skill reduces how much the cursor moves on its own, making it easier to aim.\nRobot Jock:\nIncreases your Truth Bullet rate of fire. Effective during the Nonstop Debate and the Bullet Time Battle Final Strike. Costs 3 SP.\n-You'll see it in the next update, but when you do a Nonstop Debate you \"fire\" your truth bullets to punch holes in arguments. This skill reduces the time it takes for your bullet to reach the argument after it's fired. It's very useful as a quality of life skill, though definitely not essential. I went the whole game without it on my first playthrough and was fine.\nMelodious Voice:\nIncreases damage to the opponent when a statement is destroyed. Effective during the Bullet Time Battle. Costs 3 SP.\n-This skill is marginally useful in that it makes the Bullet Time Battle minigame go by faster since you do more damage during it. You can easily live without it if you're low on skill point availability but since we aren't, there's no reason NOT to equip it.\n3-Narration.png\n: This puts us at 8/9 Skill Points used. We can get more SP from Free Time events that don't give us skills. Take advantage of every Free Time you have because SP is limited and better skills cost more SP.\n3-Narration.png\n: Next, we have the list of Truth Bullets from the e-Handbook. Here we can review exactly what each one says in preparation for the trial. Always be sure to review your Truth Bullets because they sometimes contain vital, specific information that helps you move the trial along. Here's the full list of Truth Bullets we have:\n89-Tutorial.png\n: ...was a stab wound to the abdomen, and her right wrist appears to have been fractured.\n89-Tutorial.png\n: ...was part of the blade.\n89-Tutorial.png\n: ...If you were going to attack someone with the sword, you would almost certainly remove the sheath first.\n89-Tutorial.png\n: ...Makoto to switch with her when someone attempted to force their way into her room, and she became frightened.\n89-Tutorial.png\n: ...theirs, either. But still...\n89-Tutorial.png\n: ...finger of her left hand, which had some blood on it.\n89-Tutorial.png\n: ...and Sayaka, the victim.\n89-Tutorial.png\n: ...it after the incident, the incinerator was, in fact, on.\n89-Tutorial.png\n: The distance from the gate to the incinerator is roughly thirty feet.\n89-Tutorial.png\n: ...Apparently, Yasuhiro left the ball in the laundry room on accident, so anyone could have come along and taken it.\n3-Narration.png\n: And with that, next time, we begin Trial #1.\n",
    "evidences": [
        {
            "name": "Monokuma File #1",
            "description": "The victim was Sayaka Maizono. The time of death is estimated to be around 1:30 a.m. The body was discovered in Makoto's room, in the dormitory.The death took place in the bathroom. The cause of death was a stab wound to the abdomen, and her right wrist appears to have been fractured."
        },
        {
            "name": "Evidence of a Struggle",
            "description": "There are a number of scratches and gouges on the bed and walls in Makoto's room."
        },
        {
            "name": "Replica Sword",
            "description": "Makoto took this from the gym entryway and put it in his room. The sword was found out of its sheath on the floor in the middle of the room. The sword handle was missing some of the gold coating, as was part of the blade"
        },
        {
            "name": "Replica Sword Sheath",
            "description": "Makoto took this from the gym entryway and put it in his room. The sheath was found some distance from the sword itself, and it shows evidence of being scratched with a sharp object. If you were going to attack someone with the sword, you would almost certainly remove the sheath first."
        },
        {
            "name": "Switching Rooms",
            "description": "On the night of the murder, Makoto and Sayaka traded rooms and room keys. When the victim was discovered, Makoto's room key was also found in Makoto's room. Sayaka had originally asked Makoto to switch with her when someone attempted to force their way into her room, and she became frightened."
        },
        {
            "name": "Toolkit",
            "description": "This had been placed in Makoto's room before he arrived. It remains unopened, and there is no evidence of it having ever been used. All the other male students claim that they haven't used theirs, either. But still..."
        },
        {
            "name": "Makoto's Room's Cleanliness",
            "description": "Not a single hair was found on the floor at the scene of the crime. In addition, the lint roller shows evidence of being used."
        },
        {
            "name": "Sayaka's Wrist",
            "description": "Sayaka's right wrist had been fractured, and her wrist was \"glittery\" at the injury's location. In addition, her hands appeared to be completely clean, except for the index finger of her left hand, which had some blood on it."
        },
        {
            "name": "Dying Message",
            "description": "A series of numbers had been written in blood on Makoto's bathroom wall—11037. It is assumed that Sayaka wrote these numbers while leaned up against the wall, as she lay dying."
        },
        {
            "name": "Bathroom Doorframe",
            "description": "Makoto's bathroom door was difficult to open, due to it not quite fitting in the doorframe properly. The only two people who knew the trick to opening it were Makoto, the room's owner, and Sayaka, the victim."
        },
        {
            "name": "Bathroom Doorknob",
            "description": "Makoto's bathroom doorknob had been broken—the screws holding it in place had all been partially or completely removed."
        },
        {
            "name": "Dorm Nameplates",
            "description": "The nameplates on the doors to Sayaka and Makoto's rooms were apparently switched at some point."
        },
        {
            "name": "Kitchen Knife Set",
            "description": "The kitchen in the dining hall has a set of kitchen knives. Apparently one of the knives had gone missing."
        },
        {
            "name": "Aoi's Account",
            "description": "The knife from the kitchen went missing while Aoi was in the dining hall. Aoi swears that Makoto did not come to the dining hall at any point while she was there."
        },
        {
            "name": "Cleaning Duty",
            "description": "There's apparently a trash room within the school. It's blocked off by a sturdy gate that can only be opened with the trash room key."
        },
        {
            "name": "Incinerator",
            "description": "The incinerator can be activated via a switch on the machine. Hifumi was on cleaning duty, and he claims that the last time he saw the incinerator, it was off. However, when Makoto checked it after the incident, the incinerator was, in fact, on. The distance from the gate to the incinerator is roughly thirty feet."
        },
        {
            "name": "Burnt Shirt Piece",
            "description": "A piece of burnt clothing was found next to the incinerator in the trash room.It is apparently part of a shirt cuff, and it has a noticeable bloodstain on it."
        },
        {
            "name": "Shattered Crystal Ball",
            "description": "Shards of glass were found next to the incinerator in the trash room. As it turns out, the glass ball would have fit comfortably in the palm of a person's hand."
        }
    ],
    "turns": [
        {
            "category": "cross_examination",
            "newContext": "2-Narration.png\n: A couple of notes about the trials. I highly recommend watching the videos for the trial updates. Trials are fully voice-acted and will look much better in motion than they will in screenshot format, plus you will get to see the full depth of the minigames this way since I will only be taking a few screen shots of each of them. Each trial update video will cover the whole update from start to finish.\n2-Narration.png\n: Additionally, in the videos, I will be skipping the tutorial text explaining the various minigames but I will write it out for the screenshot version of each update.\n4-ClassTrialDawn.png\n5-Monokuma.png\n: Let's begin with a basic explanation of the class trial! So, your votes will determine the results. If you can figure out \"whodunnit\" then only they will receive punishment. But if you pick the wrong one... then I'll punish everyone *besides* the blackened, and the one that deceived everyone else will graduate!\n7-Makoto2.png\n: And the killer really is one of us, right?\n8-Monokuma4.png\n: Of course!\n10-Taka7.png\n: Okay then...everyone close your eyes, and whoever did it, raise your hand!\n11-Mondo2.png\n: Don't be a goddamn idiot. Why the hell would they raise their hand?\n12-Kyoko.png\n: Before we move on and start the trial, can I ask a question real quick?\n12-Kyoko.png\n: What's going on with...those pictures?\n5-Monokuma.png\n: I'd feel awful if they got left out just because they died. Friendship penetrates even death's barrier!\n15-Hifumi9.png\n: Friendship...penetrates?\n17-Celeste2.png\n: Okay, but what about that other empty seat?\n17-Celeste2.png\n: There were only fifteen of us to begin with, so why are there sixteen seats?\n5-Monokuma.png\n: Oh, no reason. It's just that out little courtroom here can technically fit up to sixteen people.\n8-Monokuma4.png\n: Okay, that about does it for the preamble. Get ready to get started!\n5-Monokuma.png\n: First up is the case summary. Now, let the class trial...begin!\nIt's about to begin--the debate to decide who we think the killer is... Anything I found, anything I noticed... I have to be ready to speak up about everything. Because this isn't just about me. Everyone's lives are on the line!\n21-Tutorial.png\n: As things progress during each class trial, you will engage in a number of\n**\nNonstop Debates\n. During these discussions, characters will speak one after another,\n**\nwithout pause\n. It's up to you to unearth any\n**\nlies or contradictions\nburied within their statements. What this means is that you'll have to use your\n**\nTruth Bullets\nto\n**\nrefute\nwhat they say. Any relevant Truth Bullets you've found during your investigation will be loaded into the\n**\nTruth Cylinder\n. Pay close attention to each character's\n**\nstatements\n, and use your Truth Bullets to blast the right ones. Note that if you run out of time, you will automatically\n**\nfail\n, so please be careful! Well then...good luck, and have fun!\n2-Narration.png\n: Nonstop Debates are the real meat of the trial. They're pretty fun to play especially as they get harder throughout the game. All you need to do is aim and shoot the correct truth bullet at the orange highlighted weak point to end the debate and move on. At any time while the others are talking, we can pause and review truth bullets from our e-Handbook. For this first debate I'll provide pictures of each person saying a line so you can get a feel for what the debate looks like, but after this one I will only show the debate transcript and me refuting the weak point.\n",
            "testimonies": [
                {
                    "testimony": "I assert that the one who was murdered was Miss Sayaka Maizono!",
                    "person": "Taka",
                    "present": []
                },
                {
                    "testimony": "...Yeah, we know that part already.",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "And the murder took place in Makoto's room.",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "In the bathroom...",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "So it seems most likely that...",
                    "person": "Chihiro",
                    "present": []
                },
                {
                    "testimony": "The killer must have taken her by surprise while she was in the bathroom.",
                    "person": "Chihiro",
                    "present": []
                },
                {
                    "testimony": "She didn't even have a chance to resist ...",
                    "person": "Chihiro",
                    "present": [
                        "Evidence of a Struggle"
                    ],
                    "source": {
                      "evidence_span": "There are a number of scratches and gouges on the bed and walls in Makoto's room.",
                      "testimony_span": "didn't even have a chance to resist",
                      "explanation": "The scratches and gouges indicate a struggle in the crime scene, which contradicts the testimony that the victim did not resist.",
                      "is_self_contained": "no",
                      "context_span": "And the murder took place in Makoto's room."
                    }
                }
            ],
            "summarizedContext": "Everyone is discussing how Sayaka was murdered in Makoto's room.",
            "noPresent": false,
            "labels": [
              "object property"
            ],
            "reasoning": [
              "Fact 1: The witness claims the victim did not resist.",
              "Fact 2: The evidence suggests there are scratches and gouges in Makoto's room.",
              "Fact 3: The context suggests the murder took place in Makoto's room.",
              "Prop 1: If there are scratches and gouges in a crime scene, there is a struggle so the victim likely resisted."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "42-Makoto13.png\n: No, that's wrong!\n2-Narration.png\n: With that, the debate ends and returns us back to the courtroom chatter.\n44-ClassTrialTHESUN.png\n7-Makoto2.png\n: Just a second, Chihiro. Try to remember\n**\nhow my room looked\n...\n45-FlashT.png\n47-FlashB.png\n7-Makoto2.png\n: With the way things had been damaged, I think we can definitely assume there was a struggle.\n49-Chihiro5.png\n: A struggle? Between who...and who?\n7-Makoto2.png\n: Between Sayaka and the killer, of course.\n37-Chihiro.png\n: So you're saying...Sayaka wasn't caught by surprise in the bathroom?\n51-Celeste7.png\n: She must have been attacked in the main room first, then she ran to the bathroom to try and hide. The killer followed her in, and that's where they finished the job...\n52-Byakuya.png\n: That much should have been obvious after taking one look at the scene. It shouldn't even need explaining.\n38-Chihiro8.png\n: S-Sorry...\n54-Hiro4.png\n: Okay, so what's next?\n55-Sakura.png\n: Next is the subject of the murder weapon.\n56-Hifumi2.png\n: Wow...this is starting to sound like a real trial!\nWe need to determine what was used to kill Sayaka!\n",
            "testimonies": [
                {
                    "testimony": "So what was used to kill her?",
                    "person": "Sakura",
                    "present": []
                },
                {
                    "testimony": "There was some kind of sharp object thrust into her stomach...",
                    "person": "Taka",
                    "present": []
                },
                {
                    "testimony": "Without a doubt, that is the murder weapon!",
                    "person": "Taka",
                    "present": []
                },
                {
                    "testimony": "So the killer used some random knife they had on 'em... How could anyone do something like that? That son of a bitch!",
                    "person": "Mondo",
                    "present": [
                        "Kitchen Knife Set"
                    ],
                    "source": {
                      "evidence_span": "Apparently one of the knives had gone missing.",
                      "testimony_span": "So the killer used some random knife they had on 'em",
                      "explanation": "The missing knife from the kitchen indicates that the murder weapon likely comes from the knife set, not a random one as the testimony suggests.",
                      "is_self_contained": "yes",
                      "context_span": "none"
                    }
                }
            ],
            "summarizedContext": "Everyone is discussing the murder weapon.",
            "noPresent": false,
            "labels": [
              "object property"
            ],
            "reasoning": [
              "Fact 1: The witness claims the murder weapon is some random knife belonging to the killer.",
              "Fact 2: The evidence suggests a knife is missing from the kitchen.",
              "Prop 1: If a knife is missing from the kitchen, the killer likely used it, not some random knife, to commit the crime."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "44-ClassTrialTHESUN.png\n7-Makoto2.png\n: No. I do think it was a knife--but not just any knife. I'm almost positive is was a\n**\nkitchen knife\n.\n66-Mondo10.png\n: Huh? A kitchen knife?\n67-Makoto25.png\n: After the murder, we discovered that one of the knives from the kitchen was missing.\n68-Sakura3.png\n: Which means that knife must be the murder weapon.\n70-Mondo12.png\n: Ohh...yeah, I guess that makes sense. You could sorta see the weapon stickin' out of her stomach... And if you look real close, I could totally see that being a kitchen knife.\n71-Leon2.png\n: Okay, so the murder weapon was a kitchen knife. But where does that get us?\n73-ClassTrialChaos.png\n74-Leon15.png\n: I mean, we all know Makoto killed her, right!?\n75-Toko.png\n: That's r-right...\n**\nMakoto's room\nwas the s-scene of the crime. What more proof do you n-need?\n77-Makoto21.png\n: H-Hold on a second! I'm--!\n79-Kyoko17.png\n: Let's draw our conclusions *after* we've presented our arguments. Otherwise, what's the point of the trial?\n80-Leon13.png\n: Well we can talk all we want, it's not gonna change *that* conclusion.\n79-Kyoko17.png\n: I don't think that's true at all. I'm sure if we keep at it, something new will reveal itself.\n82-Hiro7.png\n: You really believe that?\n79-Kyoko17.png\n: ...\nShe's right. There's gotta be a breakthrough somewhere just waiting for us to find it. Because I know damn well I'm not the killer!\n21-Tutorial.png\n: You can\n**\nconcentrate\nby holding down the R button. While you're concentrating, time will\n**\nslow down\nso you can pay closer attention to what everyone's saying. On top of that, it'll\n**\nsteady your aim\nmaking it easier to target potential weak spots. Concentrating like this consumes the\n**\nFocus Gauge\n, and if this gauge empties, you can't concentrate. But the Focus Gauge will\n**\nrecover over time\n. So let your brain take a rest. No need to rush!\n2-Narration.png\n: Concentration is an extremely useful ability especially as the game progresses. We don't actually see it for this entire trial because this trial doesn't really demand it but later on when other mechanics get introduced it can be a big help and I'm sure I'll make liberal use of it. The Focus Gauge is represented by the Star meter we have in the upper right of the debate screen. The 5 stars will deplete quickly when concentrating, giving you just a few seconds of slowed time.\n",
            "testimonies": [
                {
                    "testimony": "So I guess there's no question that the kitchen knife was the murder weapon.",
                    "person": "Leon",
                    "present": []
                },
                {
                    "testimony": "But where does that get us?",
                    "person": "Leon",
                    "present": []
                },
                {
                    "testimony": "M-Makoto must have taken it f-from the kitchen, right?",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "He did it in secret, when nobody was in the d-dining hall ... And then he w-went and stabbed S-Sayaka with it!",
                    "person": "Toko",
                    "present": [
                        "Aoi's Account"
                    ],
                    "source": {
                      "evidence_span": "Aoi swears that Makoto did not come to the dining hall at any point while she was there.",
                      "testimony_span": "He did it in secret, when nobody was in the d-dining hall",
                      "is_self_contained": "no",
                      "context_span": "6-Makoto2.png\n: So you're saying the knife disappeared while you were drinking your tea in the dining hall?\n19-Hina.png\n: Yeah...\nIn other words, you were right there in the dining hall when someone came and took it. Then you should be able to say for sure. You can tell everyone I didn't come to the dining hall last night."
                    }
                },
                {
                    "testimony": "So he really did do it!",
                    "person": "Leon",
                    "present": []
                },
                {
                    "testimony": "Mm, mm, yes. Then it's been decided...",
                    "person": "Hifumi",
                    "present": []
                },
                {
                    "testimony": "We've reached the end!",
                    "person": "Hifumi",
                    "present": []
                }
            ],
            "summarizedContext": "Everyone is discussing whether Makoto took the knife from the kitchen and used it to kill Sayaka.",
            "noPresent": false,
            "labels": [
              "behavioral"
            ],
            "reasoning": [
              "Fact 1: The witness claims Makoto took the knife when nobody was in the dining hall.",
              "Fact 2: The evidence suggests Aoi was in the dining hall when the knife went missing and she did not see Makoto.",
              "Prop 1: If a person is in a location when an object goes missing, another person cannot take that object from that location without being seen."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "2-Byakuya.png\n: So you're saying the knife she took...was then taken from her, and she was killed with it?\n4-Byakuya7.png\n: In that case, you may not have taken the knife, but you still\n**\ncould have killed her\n.\n6-ClassTrialChaos.png\n7-Makoto33.png\n: What!?\n8-Toko3.png\n: S-See!? He did do it, a-after all!\n9-Makoto21.png\n: No, you're wrong!\n11-Hifumi12.png\n: So that's how you would twist the argument and send us all off in the wrong direction!? Hm-hmm... You possess a most terrifying talent...\nDamn...! If I don't do something, they're gonna blame *me* for the murder! Don't they understand? If they convict me, everyone's gonna die!\n13-Kyoko.png\n: Hold on. It's still too early to decide conclusively that Makoto is the killer, wouldn't you say?\n14-Kyoko11.png\n: Because you see, if the room did belong to the killer, then they did something\n**\nmost bewildering\n. And until we unravel that little mystery, you simply can't declare that he's the killer.\n16-Mondo5.png\n: Bewildering? What the hell are you talking about!?\n14-Kyoko11.png\n: Something was missing from the scene of the crime that by all rights should have been there.\n13-Kyoko.png\n: You know what I'm talking about, don't you?\n18-Tutorial.png\n: As things advance further in a class trial, the\n**\nHangman's Gambit\nwill eventually take place. The point of this is to reveal an\n**\nimportant phrase\nrelated to the incident in question. You'll have to deduce the phrase from the\n**\nletters flying around\nand the\n**\nletters already known\n. Complete the phrase by shooting down the flying letters in\n**\nthe right order\n. If you shoot down the wrong letters, you'll\n**\nsuffer damage to your Influence Gauge\n. If the gauge reaches zero, or if you run out of time,\n**\nyou fail\n.\n19-Narration.png\n: Hangman's Gambit is very simple in this game and can usually be completed in less than 30 seconds. More importantly though, now that the game has mentioned it, I'll briefly explain the Influence Gauge.\n19-Narration.png\n: The Influence Gauge is the Heart meter that keeps showing up during the Nonstop Debates and multiple-choice questions. Shoot the wrong weak point or get an answer wrong and you will lose 1 heart from the meter. You only have 5 hearts for the whole trial, but you can replenish them in 1/2 hearts by answering the multiple choice questions correctly. If you run out of hearts, the trial \"reaches a conclusion\" in which everyone thinks Makoto did it even if there's no connection for him to the trial. But you can also just hit the Continue prompt and he'll shake it off and you just go back to whatever trial segment you were on. You will be docked a little on the final trial scorecard though.\nSomething that should have been at the scene\nbut wasn't... That must be the crucial point. If we can just figure out what that something is...\n22-HangmansGambit.png\n19-Narration.png\n: As the tutorial mentioned, you begin with some letters already known. The goal is to shoot the incoming letters in the order that completes the word.\n19-Narration.png\n: For example, the word we're trying to complete is \"HAIR\" because that's what we know to be missing from the crime scene. Therefore, we must shoot the A first, then the R. Red letters take 1 shot to be captured, orange take 2 and yellow take 3. It's a very easy minigame thanks to how many hint letters the game gives you.\n> HAIR\n28-ClassTrialTHESUN.png\n29-Makoto23.png\n: That's right! There wasn't a single\n**\nhair\non the floor!\n30-Chihiro5.png\n: So, the culprit removed some evidence?\n31-Makoto30.png\n: Yes. And if I were the culprit, why would I need to get rid of all the hair in my own room?\n32-Makoto29.png\n: It wouldn't be unusual at all to find my hair at the crime scene, if the crime scene is in my room.\n34-Celeste7.png\n: The reason all the hair was gone...was to remove any trace that\n**\nSayaka had ever been there\n. That makes sense, does it not?\n35-Kyoko2.png\n: No. If that were the case, they would have had to do something about the body itself, not just her hair.\n36-Hifumi18.png\n: Ah-ha-ha! Yes, very true, very true!\n38-Leon11.png\n: Okay, then why wasn't there any hair on the ground?\n14-Kyoko11.png\n: The killer got rid of it all, of course. To remove any trace that\n**\n*they* had ever been there\n.\n40-Mondo10.png\n: Wait, then that means...!\n13-Kyoko.png\n: Precisely. It's simply beyond reason to believe that the room's owner and the killer are one and the same.\n41-Chihiro7.png\n: Then...Makoto isn't the culprit?\n43-ClassTrialDawn.png\n44-Taka8.png\n: But are you sure we can decide something so important based solely on the absence of some hair!?\n45-Kyoko15.png\n: No. There are other reasons that prove Makoto couldn't have done it.\n46-Sakura3.png\n: I would like to hear these reasons...\n14-Kyoko11.png\n: Do you remember anything remarkable about the\n**\nbathroom\nat the scene? Sayaka was attacked in the main room first, then fled into the bathroom, right?\n48-Mondo2.png\n: Yeah, then they ran after her, got into the bathroom, and stabbed her.\n13-Kyoko.png\n: And how did the killer get into the bathroom? Did they have any trouble with it?\n50-Celeste6.png\n: What do you mean...?\n13-Kyoko.png\n: It's fairly certain that the killer had some trouble getting into the bathroom. There was clear evidence left behind. Do you remember, Makoto?\nThe killer struggled getting into the bathroom. And the evidence that proves it is...the object the killer broke.\n19-Narration.png\n: Occasionally you will be asked to browse through all your Truth Bullets to find a piece of evidence that supports whatever conversation topic is going on at the time. You can check the full details of each Truth Bullet before presenting your evidence.\n19-Narration.png\n: In this case, we know that the bathroom doorknob was the broken object.\n> Present: \"Bathroom Doorknob\"\n55-Makoto2.png\n: Evidence that the killer had trouble getting into the bathroom... You're talking about the\n**\ndoorknob\n, right?\n56-Hiro12.png\n: Huh? The doorknob? What doorknob?\n57-Makoto25.png\n: The doorknob for my bathroom... It was completely broken.\n57-Makoto25.png\n: See how the top part was unscrewed, and the doorknob's about ready to fall off?\n41-Chihiro7.png\n: Oh yeah, true... But what does it mean?\n60-Kyoko13.png\n: In trying to bypass the lock, they ended up nearly removing the entire doorknob. This is another most bewildering act for the room's owner. It proves Makoto is beyond suspicion.\n61-Leon2.png\n: So what, you're saying he wouldn't break the door in his own room?\n63-Leon12.png\n: But if the only choice you have is to break it, you break it! There's nothing \"bewildering\" about it!\n65-Kyoko17.png\n: You still don't see? Okay, then...\n45-Kyoko15.png\n: Let's take another look at how the incident unfolded. Hopefully that will help you understand...\nKyoko said it was a \"bewildering act\". I almost didn't notice it at first, but...is that the key point here?\n18-Tutorial.png\n: From here on out, the number of weak spots will start going up. But no matter how many weak spots, there's essentially only one\n**\nlie or contradiction\nin that debate. What I'm trying to say is, not all weak spots you see are necessarily false. Use a Truth Bullet on the wrong one, and not only will you fail to refute what they said, but you'll also lower your trust with everyone, and\n**\nyour Influence Gauge [Heart meter] will take damage\n. Now this is important, because if your Influence Gauge reaches zero, you\n**\nfail\n. You'll have to rely on your own\n**\nlogic\nto determine which weak spots are actually\n**\nlies or contradictions\n.\n",
            "testimonies": [
                {
                    "testimony": "The incident took place in Makoto's room. Sayaka was first attacked in the main room . She then fled into the bathroom.",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "Then the killer ran after her... And they got into the bathroom.",
                    "person": "Mondo",
                    "present": []
                },
                {
                    "testimony": "At that point, the killer had to try and bust down the door because Sayaka had locked it .",
                    "person": "Leon",
                    "present": [
                        "Bathroom Doorframe"
                    ],
                    "source": {
                      "evidence_span": "Makoto's bathroom door was difficult to open, due to it not quite fitting in the doorframe properly.",
                      "testimony_span": "the killer had to try and bust down the door because Sayaka had locked it",
                      "is_self_contained": "yes",
                      "context_span": ""
                    }
                },
                {
                    "testimony": "And finally, the culprit had Sayaka cornered...",
                    "person": "Chihiro",
                    "present": []
                },
                {
                    "testimony": "And to finish the job, they stabbed her with the kitchen knife.",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "It was y-you, wasn't it Makoto! A-Admit it! We already kn-know the answer!",
                    "person": "Toko",
                    "present": []
                }
            ],
            "summarizedContext": "Everyone is discussing how Sayaka was murdered in Makoto's room.",
            "noPresent": false,
            "labels": [
              "object property"
            ],
            "reasoning": [
              "Fact 1: The witness claims the killer tried to bust down the bathroom door because it was locked.",
              "Fact 2: The evidence suggests the bathroom door was difficult to open because it does not fit in the doorframe properly.",
              "Prop 1: If a door is difficult to open due to poor fit in the doorframe, the killer would try to bust it down not even when it is not locked."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "Sayaka and Makoto switched rooms , correct? But in the note, the place they were asked to come to...",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "It specifically says \"my\" room .",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "I see... So if someone read that note...",
                    "person": "Chihiro",
                    "present": []
                },
                {
                    "testimony": "...then they would have gone to Sayaka's room!",
                    "person": "Chihiro",
                    "present": []
                },
                {
                    "testimony": "Exactly. The room that Makoto was staying in .",
                    "person": "Celeste",
                    "present": [
                        "Dorm Nameplates"
                    ],
                    "source": {
                      "evidence_span": "The nameplates on the doors to Sayaka and Makoto's rooms were apparently switched at some point.",
                      "testimony_span": "The room that Makoto was staying in",
                      "is_self_contained": "yes",
                      "context_span": ""
                    }
                },
                {
                    "testimony": "So in other words, even if someone did read the note and did what it said...they would not have any connection to what happened.",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "Hmm... It certainly would seem that way.",
                    "person": "Sakura",
                    "present": []
                }
            ],
            "summarizedContext": "Everyone is discussing the special circumstances that Sayaka and Makoto switched rooms.",
            "noPresent": false,
            "labels": [
              "object property",
              "spatial"
            ],
            "reasoning": [
              "Fact 1: The witness claims if someone is asked to come to Sayaka's room, and if Sayaka and Makoto switched rooms, they would not end up in the room Makoto is stayed in.",
              "Fact 2: The evidence suggests the nameplates on the doors to Sayaka and Makoto's rooms were switched.",
              "Prop 1: If the nameplates on the doors to two people's rooms are switched, then the person who is asked to come to one person's room would end up in another's room.",
              "Prop 2: If a person goes to a room whose owner switched rooms with another person, they would end up in the room where another person is staying in."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "15-ClassTrialTHESUN.png\n16-Makoto31.png\n: The nameplates on my and Sayaka's rooms\n**\ngot switched\n.\n17-Celeste6.png\n: They got...switched?\n18-Kyoko14.png\n: That's right. The nameplates got switched, just like the rooms themselves.\n18-Kyoko14.png\n: As a result, the nameplate on Sayaka's room actually had Makoto's name.\n18-Kyoko14.png\n: And the nameplate on Makoto's room had Sayaka's.\n22-Byakuya2.png\n: So what you're saying is, the room\n**\nSayaka\nwas staying in, was actually marked as her room.\n23-Chihiro5.png\n: Then...if someone *did* do what the note said, they would end up at Makoto's room, where Sayaka was...\n24-Kyoko11.png\n: Plus, their rooms are right next to each other. So switching the nameplates would be no problem. And the one who switched the names was... Well of course it wasn't you, right Makoto?\n26-ClassTrialDawn.png\n27-Makoto35.png\n: R-Right...\n28-Leon7.png\n: Okay...then who did it?\nThere's only one person who could have switched the nameplates. The only other person who knew we had switched rooms...\n> Sayaka\n16-Makoto31.png\n:\n**\nMe and Sayaka\nwere the only ones who ever knew about us switching rooms. So the only other person besides me who would even know to switch the nameplates...was Sayaka.\n31-Kyoko17.png\n: You can also infer as much from her note...\n\"There's something I want to talk to you about, just us two. In five minutes, come see me in my room. Check the nameplates to make sure you don't get the wrong room, okay?\"\n31-Kyoko17.png\n: She specifically tells the reader to check the nameplate. She would only have written that if she knew the nameplates had been switched.\n6-Chihiro7.png\n: But...why would she switch them in the first place?\n24-Kyoko11.png\n: She wanted someone to come to the room she was in, and *also* hide the fact that it was Makoto's room.\n34-Makoto20.png\n: What...?\n36-Hina9.png\n: Inviting someone to \"your\" room, but not telling them you'd switched rooms... Why would anyone do that?\n37-Kyoko.png\n: To understand that...we first need to understand what happened after she invited the person into the room. That's where the answer lies...\n38-Taka16.png\n: What happened then was...probably... Whoever she invited over...came in, and...attacked her!\n40-Taka13.png\n: We figured it out! We know who did it! Whoever she invited over is the culprit!\n42-Mondo13.png\n: But we still don't know who it is, ya goddamn idiot...\n43-Celeste8.png\n: Sayaka fought with her killer there in the room, yes? Perhaps the answer to our previous question lies in that initial struggle.\n45-Kyoko3.png\n: Yes, I think you're right.\n46-Hina20.png\n: Then...we just have to figure out what happened during the fight, right!?\n48-Sakura3.png\n: That reminds me... There was a replica sword at the murder scene. Was that perhaps used during the fight?\n49-Mondo12.png\n: Oh yeah, what's the deal with that sword?\n50-Makoto2.png\n: Sayaka suggested I should hold on to it. I thought it might come in handy if I had to defend myself...\n34-Makoto20.png\n: It seems pretty likely that the killer used it to break Sayaka's right wrist.\n52-Leon2.png\n: How the hell could you possibly know that's what broke her wrist!?\nThe reason I know Sayaka's wrist was broken with the fake sword is because... When you look at her wrist, there's no doubt.\n10-Narration.png\n: That sword leaves gold dust everywhere and we saw a glitter of gold on her wrist. Put two and two together, and...\n> Present \"Sayaka's Wrist\"\n50-Makoto2.png\n: All you have to do is take a good look at her\n**\nbroken wrist\n, and it should become pretty clear. Right there where her wrist is all swollen, there's something glittery there, see?\n6-Chihiro7.png\n: Is...is that\n**\ngold\n?\n50-Makoto2.png\n: It sure is. Specifically, the gold coating from the replica sword. You barely have to touch that stuff and it'll stick right to you. And there's some on her wrist because...\n58-Taka7.png\n: I got it! Because she got hit with the sword, right there on her wrist!\n59-Hifumi5.png\n: I see, I see... And so the truth draws ever closer...\n61-Hiro15.png\n: Alright! Then it's about time to solve this mystery!\nWhat happened in my room... And what led to Sayaka's death... That's what we need to make clear.\n63-Tutorial.png\n: Are you getting used to these Nonstop Debates? Starting with the next debate, I'll start loading\n**\nmultiple Truth Bullets\ninto your Truth Cylinder. But just like with the weak spots, only\n**\none\nof those bullets can actually refute the proper statement. In other words, from here on out... you'll have to\n**\ncombine\nthe right Truth Bullets with the right weak spots to refute each statement. If you come up with the wrong combination, you'll take damage to your Influence Gauge. By the way, if the Logic Difficulty is set to Kind, fewer bullets will be loaded into the cylinder. For our purposes this time, the Logic Difficulty will be set to Mean.\n10-Narration.png\n: There is where the Nonstop Debates really become good. By giving the player multiple Truth Bullets, you have to stop and really think about what combination will break through a weak spot. There's usually one that obviously doesn't makes sense or fit but there's also usually one that comes very close or seems to match another weak point that isn't the right one.\n10-Narration.png\n: I started the game with the Logic Difficulty set to Kind but beginning next trial, I will have it set to Mean. Mean Logic gives the player more bullets and more weak spots to choose from. Kind and Gentle will give fewer and fewer even all the way until the end of the game. Hell, first time I played I played on Gentle and had no more than 1 bullet all the way into the last trial. I'm not repeating that.\n",
            "testimonies": [
                {
                    "testimony": "When the fighting broke out the culprit grabbed the sword.",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "And that's when the first blow was dealt! A sword-based sneak attack !",
                    "person": "Hiro",
                    "present": [
                        "Replica Sword Sheath"
                    ],
                    "source": {
                      "evidence_span": "The sheath was found some distance from the sword itself, and it shows evidence of being scratched with a sharp object.",
                      "testimony_span": "And that's when the first blow was dealt! A sword-based sneak attack",
                      "is_self_contained": "yes",
                      "context_span": ""
                    }
                },
                {
                    "testimony": "And that's what broke Miss Maizono's wrist...!",
                    "person": "Hifumi",
                    "present": []
                },
                {
                    "testimony": "S-So she tried to fight back. She grabbed the k-kitchen knife she had hidden a-away ...",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "But then the culprit took *that* from her, too...",
                    "person": "Chihiro",
                    "present": []
                },
                {
                    "testimony": "And they killed her with it.",
                    "person": "Sakura",
                    "present": []
                },
                {
                    "testimony": "And that's exactly what happened!",
                    "person": "Hiro",
                    "present": []
                }
            ],
            "summarizedContext": "Everyone is discussing the details of the fight between Sayaka and the killer.",
            "noPresent": false,
            "labels": [
              "object property"
            ],
            "reasoning": [
              "Fact 1: The witness claims the first blow was dealt with a sword.",
              "Fact 2: The evidence suggests the sheath of the sword had scratches on it.",
              "Prop 1: If the sword is used to attack someone, the sheath would not be scratched."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "It's easy just to say, \"Hey, decide who did it!\" But there just aren't any more clues , right?",
                    "person": "Leon",
                    "present": [
                        "Dying Message"
                    ]
                },
                {
                    "testimony": "Very well! Then let's review all the clues we've found up to this point one more time!",
                    "person": "Taka",
                    "present": []
                },
                {
                    "testimony": "Do we really have time for all that...?",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "D-Die... Die!",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "If we don't d-do something... we're all g-gonna die!",
                    "person": "Toko",
                    "present": []
                }
            ],
            "noPresent": true
        },
        {
            "category": "cross_examination",
            "newContext": "13-ClassTrialTHESUN.png\n14-Makoto23.png\n: There still might be one clue left--Sayaka's\n**\ndying message\n.\n15-Leon2.png\n: Dining--wait, what did you say?\n17-Kyoko3.png\n: The dying message. She wrote something on\n**\nthe wall behind her\n, remember?\n**\n11037\n, written in her own blood. There must be a clue about the killer hidden in there.\n19-ClassTrialDawn.png\n20-Celeste7.png\n: Well, before we get too far into that, I need to ask... Can we really be sure that Sayaka is the one who wrote it?\nThere's no question that Sayaka wrote that message. And I can prove it...\n23-Makoto28.png\n: Her\n**\nleft index finger\nhad blood on it. That could only be because she used that finger to write the message.\n24-Taka2.png\n: I see... She\n**\nbroke her right wrist\nduring the fight, so she'd have to use her left hand to write...\n26-Hina2.png\n: Sure, I think we can all agree Sayaka wrote it, but still... What the heck do those numbers?\n**\n11037\n?\n27-Mondo3.png\n: Hey Chihiro, you're a computer nerd or whatever, right? You should know all about numbers and shit!\n29-Chihiro14.png\n: N-No, that's not... Yes, I'm a programmer, but I don't see any kind of meaning in these numbers.\n31-Kyoko17.png\n: ...Of course. It's because they're not numbers.\n32-Hifumi18.png\n: Oh! Yeah, it looks like...\n33-Mondo5.png\n: Huh? What? What!?\n35-Hifumi2.png\n: No, it's just...look at the numbers assuming they're *not* numbers. Don't these first two,\n**\n11\n, look less like two numbers and more like one letter?\n36-Chihiro7.png\n: Ah, you're right! The connecting line is barely there, so I assumed it was 11, but...\n38-ClassTrialChaos.png\n36-Chihiro7.png\n: Looking at it now, you could also read it as an N!\n39-Mondo4.png\n: Whoa! You might've finally just said something worth a shit!\n40-Hifumi5.png\n: Bwehehe! Out little grey cells are really getting excited now!\n42-Sakura3.png\n: But even if that really is an\n**\nN\n, \"\n**\nN037\n\" doesn't make any more sense than before...\n43-Makoto26.png\n: ...\nDammit! It's no use! I just don't know...!\n44-Kyoko11.png\n: ...\n44-Kyoko11.png\n: Rotate the image 180 degrees.\nHuh? Rotate it...?\nI...I think maybe... Maybe I see something...\n23-Makoto28.png\n: Oh my god... Now I see! She wrote down the killer's name...\n49-Hina12.png\n: Huh!? You just shot past the clue part and right on to who did it!\n7-Toko5.png\n: So wh-whose name did sh-she write...?\n50-ToSurvive.png\nSayaka's dying message reveals the real killer's name... If you turn her message 180 degrees... It should become crystal clear.\n53-Narration.png\n: It can only be one person.\n56-Makoto2.png\n: Here's my answer!\n13-ClassTrialTHESUN.png\n58-Makoto38.png\n: The key to solving this mystery was simply to\n**\nrotate the writing 180 degrees\n.\n56-Makoto2.png\n: If you turn the message around...\n23-Makoto28.png\n: ...it becomes the letters\n**\nL-E-O-N\n.\n61-Makoto29.png\n: L-E-O-N...or more accurately,\n**\nLeon\n!\n63-Leon8.png\n: Wh--!?\n4-Leon7.png\n: What the hell are you talking about!? I-It's just a coincidence!\n65-Leon5.png\n: It's just a bunch of random squiggles that happen to look like my name!\n66-Kyoko14.png\n: No, it's not random at all.\n66-Kyoko14.png\n: She wrote that message on the wall behind her as she was leaning up against it. In that position, she couldn't move to write normally, and had to write upside down, as it were. And as a result... When you look at it standing in front of her, it ends up getting flipped. Try it for yourself, if you want. Write something sitting like her, and the\n**\nletters will be inverted\n.\n4-Leon7.png\n: Th-That sounds like one hell of a stretch to me...!\n65-Leon5.png\n: I'm the killer!? You can't just go and say shit like that!\n69-Kyoko13.png\n: If you're *not* the killer, then why did you try to destroy the evidence?\n4-Leon7.png\n: ...Huh?\n71-Kyoko.png\n: You know what I'm talking about, right Makoto? The evidence Leon tried to get rid of?\nThe evidence that Leon tried to get rid of... It's that thing I found on the ground in front of the incinerator, right?\nPresent \"Burnt Shirt Piece\"\n74-Makoto25.png\n: You mean...the\n**\nburnt shirt piece\nI found laying on the ground by the incinerator, right?\n44-Kyoko11.png\n: As the killer stabbed Sayaka, they must have gotten\n**\nsome of her blood\non them. And to dispose of the shirt covered in the victim's blood, they threw it into the incinerator.\n36-Chihiro7.png\n: But one piece burned off and got left behind...\n69-Kyoko13.png\n: And the killer didn't notice. If they had, they most certainly would have panicked. Isn't that right, Leon?\n63-Leon8.png\n: Wh-Wh-Wh-Wh--!?\n77-Sakura5.png\n: But is one scrap of fabric enough to conclude that Leon is guilty?\n78-Chihiro5.png\n: Yeah... I mean, Leon's not the only one wearing a white button-up...\n80-Leon6.png\n: Th-That's right! There are plenty of other people here with shirts like mine!\n65-Leon5.png\n: With just that one little charred piece, there's no way you can say for sure who it belongs to!\n74-Makoto25.png\n: You're right. That alone isn't enough. But there are some other points that may reveal the truth...\n69-Kyoko13.png\n: Are you finally starting to understand? The answers to all the riddles are right here.\n82-Makoto24.png\n: Yeah, I think so...\nThe burnt remains of the button-up shirt, which the killer wasn't able to get rid of... There's something about it we need to pay attention to in order to figure out who's responsible.\n> How it was disposed of\n61-Makoto29.png\n: If we look closely at\n**\nhow the shirt was disposed of\n, we should be able to figure out who the killer is.\n80-Leon6.png\n: O-Oh, yeah...that's a good point. I think I know what you're gonna say... You can't reach the incinerator without opening the gate in front of the trash room, right? And obviously you wouldn't be able to hit the switch to turn it on, either. You'd need the key to get in. And the one with the key was...the person on cleaning duty!\n50-ToSurvive.png\n65-Leon5.png\n: So the killer had to be whoever was in charge of taking care of the trash! Right!?\n86-Hifumi.png\n: Hahaha. Interesting...\n88-Hifumi11.png\n: ...Gweh!?\nNo, that's wrong. There was another way to use the incinerator without being the one on cleaning duty. And that's exactly what proves that Leon is the real killer!\n",
            "testimonies": [
                {
                    "testimony": "The key to the trash room...",
                    "person": "Leon",
                    "present": []
                },
                {
                    "testimony": ": Whoever was on cleaning duty must've had it, right?",
                    "person": "Leon",
                    "present": []
                },
                {
                    "testimony": "So the only one wh-who could get to the in-ncinerator was...the p-person in charge of the t-trash ?",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "And you'd have to get close to the incinerator in order to destroy the evidence.",
                    "person": "Leon",
                    "present": [
                        "Shattered Crystal Ball"
                    ],
                    "source": {
                      "evidence_span": "Shards of glass were found next to the incinerator in the trash room.",
                      "testimony_span": "you'd have to get close to the incinerator in order to destroy the evidence",
                      "is_self_contained": "yes",
                      "context_span": ""
                    }
                },
                {
                    "testimony": "Which means the only possible suspect is whoever had the trash room key!",
                    "person": "Leon",
                    "present": []
                },
                {
                    "testimony": "Okay, so...the person who would have had the trash room key was...",
                    "person": "Hifumi",
                    "present": []
                },
                {
                    "testimony": "Huh? Me...?",
                    "person": "Hifumi",
                    "present": []
                },
                {
                    "testimony": "NOOOOOOOOOOOOOOOO!!!",
                    "person": "Hifumi",
                    "present": []
                }
            ],
            "summarizedContext": "Everyone is discussing how the killer disposed of the in the incinerator which is locked away in the trash room by iron bars.",
            "noPresent": false,
            "labels": [
              "object property"
            ],
            "reasoning": [
              "Fact 1: The witness claims one has to get close to the incinerator in order to destroy the evidence.",
              "Fact 2: The evidence suggests a crystal ball was shattered next to the incinerator.",
              "Prop 1: If one throws a crystal ball attached with the evidence to destroy evidence, they would not have to get close to the incinerator."
            ]
        }
    ]
}