{
    "previousContext": "2-DespairSyndrome1.png\n3-Makoto2.png\n: ... ... ...\n3-Makoto2.png\n: ...It's gone... ...\nShe...she really is gone.\n3-Makoto2.png\n: ...\nIt's almost like...there was never anything there to begin with. Every last sign of Sayaka's existence has disappeared without a trace...\n3-Makoto2.png\n: It's just like he said...\nAfter the class trial, before we took the elevator back up, Monokuma told us...\n7-Flashback.png\n9-Monokuma9.png\n: Oh, I almost forgot! Since the class trial is over, I'll go ahead and dispose of\nall the corpses\n!\n10-Monokuma13.png\n: It's okay, no need to thank me! Just seeing your delighted, smiling faces is thanks enough for me! After all, nobody wants to look at a rotting corpse every day! That can't be good for your health...\n11-Monokuma4.png\n: Nyohohoho!\n7-Flashback.png\nI didn't even have time to mourn Sayaka and Junko's deaths... I'm sure that's exactly why he did it. It's a bad joke, a sickening dream... But I have to accept the reality of it all... I headed back to the dining hall to meet up with the others.\n13-WelcometoDespair.png\n3-Makoto2.png\n: Sorry I'm late...\n15-Hina2.png\n: Hey...are you okay, Makoto?\n17-Taka7.png\n: You sure took your sweet time! I was just about to go get you and drag you back here!\n3-Makoto2.png\n: S-Sorry...\n18-Taka15.png\n: So? What happened? Was your room fixed up like he said?\n20-Taka3.png\n: I imagine it would be pretty hard to sleep with a rotting corpse in your bathroom!\n22-Mondo3.png\n: Jesus, that's fucked up, man. Why would you say something like that?\n3-Makoto2.png\n: My room was...spotless. There wasn't anything left. Like the whole thing...\nnever happened\n.\n23-Sakura4.png\n: It must be tough staying there, knowing what happened. Why don't you just stay in Sayaka's room?\n3-Makoto2.png\n: Well...staying there, with her scent still hanging in the air... That would hurt just as much. Plus... I've decided that I can't turn away from her death...\n25-Hina9.png\n: M-Makoto...\n15-Hina2.png\n: Hey, cheer up! Getting depressed isn't gonna help anything, right? If we all work together, I'm sure we'll find a way out of here!\n26-Hina5.png\n: So everyone just...try and cheer up and get back on track!\n28-DespairSyndrome2.png\n29-Byakuya.png\n: Is that honestly supposed to make us feel better?\n30-Hina12.png\n: Huh?\n31-Byakuya3.png\n: We were already \"working together\" and yet someone was still murdered. Anyone could betray us at this point. Now that it's happened once, it's a question of when, not if, the next one takes place.\n33-Toko12.png\n: Yeah, because S-Sayaka\nmade the first move\n...\n3-Makoto2.png\n: ...\n15-Hina2.png\n: B-But...if we work together against the mastermind, nobody'll have any reason to do something like that!\n34-Byakuya5.png\n: Keep telling yourself that. I'll be over here in the real world. Working together, fighting a common enemy... Like it or not, it's not that simple.\n35-Hifumi2.png\n: ...What do you mean?\n37-Celeste2.png\n: The mastermind seems to be much more powerful than we ever suspected. They\ntook over Hope's Peak\n, which was supposed to be well defended, then modified it to fit their desire. They created Monokuma, which seems to be incredibly advanced, and they're providing for our every need. And the cherry on top is the\nexecution\nwe witnessed.\n38-Celeste7.png\n: Everything has been planned down to the last excruciating detail. This is not the work of your everyday psychopath. Defying them may be too great a risk...\n40-Sakura3.png\n: Then...what are we supposed to do?\n29-Byakuya.png\n: Anyone who truly does want to escape...will just have to follow the rules.\n41-Byakuya2.png\n: In which case, the only option is to deceive those around you, and win the game.\n43-Chihiro9.png\n: N-No...\n34-Byakuya5.png\n: No what?\n44-Chihiro10.png\n: I don't want to live...if it means killing someone else to do it. I don't want to kill anyone else...!\n45-Hiro4.png\n: Anyone...else? What do you mean?\n47-Chihiro11.png\n: Leon died because we all voted for him, right? It's no different from\nus killing him ourselves\n!\n48-Hiro5.png\n: B-But...\n15-Hina2.png\n: If we hadn't voted for him, then we all woulda died instead, right...? That isn't what you wanted, is it...?\n49-Chihiro8.png\n: ...\n51-Hifumi3.png\n: She's right. If you heap that kind of blame on yourself, you'll turn into a full-fledged masochist.\n49-Chihiro8.png\n: ...\n3-Makoto2.png\n: Chihiro, listen... You're not to blame. Not you, not Leon, and not Sayaka. The mastermind is responsible for everything that's happened. We had no choice but to vote. I can't even imagine what would've happened to us if we'd refused. And in the end, it was Monokuma who ultimately killed Leon! So don't waste your anger on yourself... Instead, direct it at the mastermind!\n52-GoodNight2.png\n(This isn't the normal Good Night speech)\n*Ding dong, bing bong*\n55-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Oh, and one other thing... It was totally obvious before that you were trying to make yourselves feel better and justify what you did. See you, see you, don't see you, see you! That's about how much I can see you, even when you try to hide!\n55-MonokumaTV.png\n: Now pay attention and remember this well! The\nburden of judging others\nis a heavy one to\nbear\n. So be well aware of your actions! Order and stability rely on the sacrifice and responsibility of everyone! Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\n57-Toko9.png\n: What w-was that about just n-now...?\n58-Hiro13.png\n: Was he saying it's out fault what happened? That's pretty cruel, man...\n59-Mondo8.png\n: That piece of shit! Who does he think he is!?\n3-Makoto2.png\n: ...\nAnd so, the day drew to a close... A tense, maddening day that saw the deaths of three classmates. Sayaka, Junko, and Leon... But, this is just the beginning...\nOur despair\nhas only just begun...!\nI woke up the next day to Monokuma's normal morning announcement. Then he called us all to the\ngym\n.\n2-Makoto.png\n: What's he gonna do to us this time?\nWe were practically frozen with fear. But Monokuma was determined to get us involved in his little game... And with that goal in mind,\nhe began it\n...\n4-MorningStretches.png\n5-Monokuma10.png\n: Okay! Lift your arms up, and down! One, two, three, four!\n6-Taka7.png\n: One, two, three, four!\n5-Monokuma10.png\n: Now reach waaay up, and bend waaay down! Tighten those muscles! Let's add a little strength, a little speed to those young bodies of yours!\n7-Makoto2.png\n: ...\n9-Monokuma7.png\n: Ahh, doesn't this feel just great!? Being stuck inside like this, you gotta make sure to stay healthy!\n11-Toko5.png\n: You're the o-one keeping us \"stuck inside\"...\n5-Monokuma10.png\n: Don't sweat the small stuff! That's my motto.\n12-Monokuma4.png\n: Whoa, I sounded pretty cool just now, don'tcha think? Did you fall in love with me? Am I just to die for? Am I just to die in writhing agony for?\n14-Sakura2.png\n: So...why did you call us here? Certainly it wasn't just to make us exercise...\n15-Monokuma2.png\n: \"Just\" to make you exercise? JUST to make you exercise!?\n17-Monokuma6.png\n: If exercise makes you laugh, exercise will make you cry! Now, if you keep doing these exercises, you will uncover the secret of the Assassin's Fist!\n18-Monokuma12.png\n: Passed down from generation to generation in the empire of darkness... The power can by yours!\n19-Hifumi9.png\n: That sounds like the kind of junk a middle schooler would come up with...\n7-Makoto2.png\n: It doesn't matter! Just get to the point. Did you really call us down here just to exercise?\n15-Monokuma2.png\n: Of course not! You think I have that kind of free time on my hands!?\n7-Makoto2.png\n: Okay, so then...\n22-Monokuma.png\n: Ahh, I'd like to make an announcement! Every time you overcome a class trial here at Hope's Peak, a\nwhole new world\nwill open up to you!\n23-Hiro5.png\n: A whole new world...?\n22-Monokuma.png\n: It'd really suck if you had to live here forever with nothing new to stimulate you! Besides, I know how you kids get these days with your ADD and ADHD. I gotta keep you motivated!\n12-Monokuma4.png\n: So go ahead, look around all you want! Enjoy the\nbrave new post-trial world\ntill you explode! *leaves*\n25-DespairSyndrome2.png\nWith that, Monokuma disappeared, leaving us even more confused than when he'd shown up. But...\n2-Makoto.png\n: A\nnew world\n?\n27-Hina21.png\n: Is he talking about...a way to get outside?\n28-Celeste9.png\n: That seems...unlikely.\n29-Mondo6.png\n: Well we won't know till we look!\n31-Sakura3.png\n: Whatever he meant, it seems we'll have to\nsearch the school\none more time.\n6-Taka7.png\n: Okay, then let's split up and start investigating! When you're done, everyone meet back up at the dining hall and we'll share what we found!\n32-Byakuya3.png\n: You're basically a one-trick pony, you know that?\n34-Taka9.png\n: More like a staple food source! Now let's get moving!\nSeeing his words as their signal, everyone scattered and left the gym.\n36-BeautifulDeath.png\n37-Narration.png\n: Time to explore new parts of the school. Everyone's left the gym but not everyone got very far. In fact, Hiro is still hanging out in the Gym Entrance:\n23-Hiro5.png\n: Hey, Makoto! Did you see what's inside the display case!? Bad... This is super bad, man!\n2-Makoto.png\n: What are you talking about? I didn't notice anything all that weird in there...\n40-Hiro12.png\n: Sure, to the untrained eye it's nothing. But this is awful... A bad, awful, terrible trap!\n41-Hiro2.png\n: That stuff you see lined up there? Any god could come by and use it to send a message!\n2-Makoto.png\n: Huh...?\n43-Hiro10.png\n: Ahhh! I've been struck with knowledge! It's an ill omen of total destruction and ruin!\n44-Hiro11.png\n: L-Let me outta here! Let me ouuuut!\nI have no idea what he's talking about, so...maybe I'll just leave him alone.\n37-Narration.png\n: I never said he'd have something useful to tell us.\n37-Narration.png\n: Outside the gym we can find Taka standing next to the staircase.\n34-Taka9.png\n: Makoto! Look! The gate blocking the stairs is gone... It would seem\na path to the 2nd floor\nhas opened up!\n47-Taka8.png\n: But it's also of utmost importance to double-check the areas we already know about, just in case!\n49-Taka18.png\n: Aren't I so clever to think of that!? I really impress myself sometimes.\n6-Taka7.png\n: Well, I'll leave the school to you!\n37-Narration.png\n: We're not going upstairs just yet though. It's easy to miss a conversation with Mondo because he's hidden back in the hallway by the entrance hall.\n52-Mondo.png\n: I went and checked the metal hatch in the main hall just to be sure, but...\n53-Mondo13.png\n: ...just like I figured, it hasn't moved an inch. Shit...\n2-Makoto.png\n: Yeah, I'd be surprised if he made things that easy for us...\n29-Mondo6.png\n: Heeeeeyyy!\n55-Mondo7.png\n: Don't make that face! You look like a pussy! You want me to put some fighting spirit in ya? Well, do ya!?\n2-Makoto.png\n: N-No thanks! I think I've got enough for now...\n57-Mondo16.png\n: Well...okay. I'm gonna go look for another way out, then. *leaves*\n37-Narration.png\n: I can't recall if this portrait is re-used at any other point in the game? It might be unique to this one conversation. Anyway, we can now head upstairs to the 2nd floor.\nThe\ngate\nthat was blocking the stairs has been opened. Is this what Monokuma meant by \"a new world\"?\n2-Makoto.png\n: If so...what's up there? *ascends*\nThis is...the 2nd floor of the school. Maybe there's come kind of clue here. Yeah, I'm sure of it. There's gotta be something here!\n37-Narration.png\n: The 2nd floor is laid out much like the first, though it doesn't have a dormitory attachment. Couple classrooms, bathrooms and some big rooms to explore.\n37-Narration.png\n: First off, the Pool.\n66-Hina22.png\n: Oh, Makoto! Hey, guess what! Guess what I found! A pool! There's a pool here! A POOL! Pool pool pool!\n2-Makoto.png\n: Y-You don't have to keep repeating it, I got it...\n66-Hina22.png\n: And there a ton of\nexercise equipment\nin the locker room! Sakura's gonna go nuts when she finds out!\n2-Makoto.png\n: Yeah, you're right about that.\nHina seems way more excited than usual...\n2-Makoto.png\n: Hey Chihiro, have you checked out the pool yet?\n69-Chihiro5.png\n: No... I...don't like wearing swimsuits.\nYeah, you do seem like the type who might not be into that kind of thing.\n70-Chihiro.png\n: But still...it sounds like the locker rooms here have all the\nexercise equipment\nyou could ask for. Maybe I'll give it a try. I'd kind of like to get a little stronger...\n2-Makoto.png\n: You want to get stronger? I have to say, that's kind of unexpected...\n72-Chihiro3.png\n: But...I'm not even brave enough to step foot into the locker room...\n2-Makoto.png\n: Huh? You don't even wanna go in the locker room?\n72-Chihiro3.png\n: It's not that I don't want to. It's just...\n73-Chihiro8.png\n: ...\nI don't get it. Is she afraid of locker rooms or something? That's a pretty weird phobia, though...\n66-Hina22.png\n: The locker rooms connect to a\npool\n! It looks super nice! And big! And fantastic to swim in! Ahh, I'm beyond excited right now! I can't wait to dive in! In fact, I'm gettin' kinda mad thinking about it!\nWh-Why are you getting mad...?\n77-Celeste4.png\n: The 2nd floor has opened up, the living area has grown, and a number of facilities are now available. Whatever else is going on, I must admit things have been made much more comfortable for us.\n78-Celeste16.png\n: If things continue like this, the occasional class trial may not be so bad.\n79-Celeste3.png\n: Hmhmhm...\n37-Narration.png\n: Now that Celeste is done being creepy, there's at least one big thing in the room worth checking out further.\nIs that...a real gun? It's not like we're at war here. Why would we need something like that here...?\n37-Narration.png\n: The rest only hides a few monocoins and flavor text about pool equipment, nothing very important. Time to check out the locker room.\nBehind this door is...the locker room?\n85-Hina.png\n: Oh! And I guess you need your handbook to get into the locker rooms!\n2-Makoto.png\n: Really?\n87-MrMonokumasLesson.png\n18-Monokuma12.png\n: Really really!\n88-Hina12.png\n: Uwaah!\n22-Monokuma.png\n: If you wanna unlocker the locker room you'll have to swipe your personal\ne-Handbook\nacross the\ncard reader\nnext to the door.\n5-Monokuma10.png\n: However, to ensure maximum security within each locker room only\na boy's handbook\ncan open the boys locker room, and\nthe same goes for the girls\n! And that's the bottom line!\n90-Hina11.png\n: Hmm...but what if someone opens the door, and then someone else sneaks in?\n91-Monokuma3.png\n: Anyone who commits such indecency will be punished without mercy for their scandalous sexual depravity!\n12-Monokuma4.png\n: See, there's a\nGatling gun\nmounted on the ceiling, right? And it'll be all DUKKA DUKKA DUKKA DUKKA!\n93-Hina15.png\n: I bet it'd really hurt to get shot by that thing!\n69-Chihiro5.png\n: Um, no...I think it'd be a *little* worse than that...\n95-Celeste7.png\n: But what happens if someone loans their handbook to someone else? A boy could borrow a girl's handbook, and that would get them into the girls locker room, would it not?\n15-Monokuma2.png\n: Wh--!? That never even occurred to me! To think someone could be so low, so cowardly, so devilish!\n96-Monokuma11.png\n: Hmm... Okay, then how's this sound?\n22-Monokuma.png\n: Time for a new rule! As of this moment,\nloaning your e-Handbook to another student is strictly prohibited\n.\n5-Monokuma10.png\n: There! So now nobody can give their handbook to anyone else, right? You like that? I'm kind of a genius, right? It's cuz my brain is 100% cotton!\n28-Celeste9.png\n: I do not imagine anyone would have lent their handbook out in the first place.\n99-Celeste17.png\n: After all, they would likely be held responsible for anything that person might do using their handbook...\n100-Hina2.png\n: But ya know, you seem awfully concerned with all this locker room security stuff...\n9-Monokuma7.png\n: It's cuz all you teenagers are sex-crazed maniacs! You're at that age you'd try humping a plastic bottle! So to keep anything unseemly from happening, I have to maintain a rigorous watch!\n28-Celeste9.png\n: Then in that case, I would ask that you keep the same close eye on our dorms. If some man and some woman decided to share a room, there would be nothing to stop them.\n5-Monokuma10.png\n: All I care about is protecting the holy image of the school itself!\n18-Monokuma12.png\n: I don't care what happens in your private dorms! By force or by cunning, do whatever you want!\n103-Hina16.png\n: I hate you so much...\n22-Monokuma.png\n: Okay, so the new regulation is now in place! See ya! *leaves*\n36-BeautifulDeath.png\n105-Hina23.png\n: Maaan, that stupid bear totally ruined my mood! Maybe I'll go take a dip to cheer myself up.\n106-Hina5.png\n: Celeste, Chihiro, you wanna come with me?\n108-Celeste5.png\n: There is nothing I hate more than getting water on my face.\n70-Chihiro.png\n: Sorry...I'll pass this time.\n88-Hina12.png\n: How come! When you're in a funk, there's nothing better than a good swim to pull you out of it!\nI'm pretty sure that only applies to you...\n37-Narration.png\n: Let's actually enter the locker room this time.\n37-Narration.png\n: The locker room has surprisingly little to examine in here. There's exactly one thing we can look at.\nNow this is an interesting poster... Obviously someone put this in the school, but...is it really okay to have something like this here?\n37-Narration.png\n: The actual pool is huge but like the locker room there's really nothing to examine here.\n37-Narration.png\n: The only thing here is a locker on the back side that has a Monocoin.\n37-Narration.png\n: Next time, we continue exploring the 2nd floor.\n2-BeautifulDeath.png\n4-Narration.png\n: Classroom 2-A is our first stop.\n4-Narration.png\n: Sakura's the only one here. The chalkboards in the classrooms all have different images. They're mostly nonsense.\n8-Sakura.png\n: This must be what he meant by a \"new world\"...\n9-Sakura4.png\n: I should probably take a really close look around...\n4-Narration.png\n: Up the hall, there's another barred staircase.\nThe gate's blocking my way. So there's still another floor... Which means not everything has opened yet.\n4-Narration.png\n: There's a large foyer in the hall. You can see chairs lined up alongside what must be window seats. Presumably, students could do their schoolwork in the sun but with the iron plates there there isn't exactly much sun coming in is there?\n4-Narration.png\n: Further down the hall in the greenlit area is Classroom 2-B.\n4-Narration.png\n: There's actually nothing in here but I wanted to show it off. The classrooms play very little role in the game. Occasionally you can find a student in there during Free Time but other than that, almost nothing important happens in them.\n4-Narration.png\n: Back in the big foyer, there's a double door to the Library.\n4-Narration.png\n: There are a bunch of people in here, as well as plenty of things to examine.\nThe shelf is packed tight with books. But looking at it... the whole thing is incredibly dusty. It looks like this library's been neglected for a pretty long time. As nice as the school itself is, whoever's in charge of upkeep has been pretty lazy. Strange...\n22-Byakuya9.png\n: ...But still, this library is\nmost interesting\n...\n23-Makoto.png\n: Huh? What's interesting about it?\n24-Byakuya7.png\n: Oh, nothing. I was just thinking out loud.\n23-Makoto.png\n: You must be pretty happy to have all these books around, huh Toko?\n27-Toko4.png\n: N-Not particularly... Nothing's really c-caught my attention so far.\n28-Hifumi3.png\n: Indeed. There's a plethora of books, it's true, but the content seems...lacking.\n30-100MileJunkFoodDash.png\n31-Hifumi13.png\n: Where's the comic books!? Where's the young adult section!?\n27-Toko4.png\n: Comic b-books? Young adult? That stuff's a w-waste of time...\n32-Hifumi17.png\n: I've seen what you write, Miss Fukawa. Talented as you are, your stuff isn't any more \"worthwhile.\"\n34-Toko12.png\n: My stories are filled with true love and pure feelings! Don't compare them to that garbage of yours! Your writing doesn't even m-mean anything. It's just a bunch of j-jumbled up letters...! S-Someone should just...burn it all.\n35-Hifumi20.png\n: Ooh, the lady doth protest too much, methinks! I bet you're secretly into boy-on-boy action!\n34-Toko12.png\n: Boy-on-boy...? I don't care if it's a-anime or comics or fanfic or wh-whatever!\n37-Toko13.png\n: It's all filth! Throwaway culture that'll be trashed and forgotten in half a decade!\n38-Toko9.png\n: Ugh...just t-talking about it makes me sick to my s-stomach. I feel like I'm g-gonna throw up...\n40-Hifumi12.png\n: Grr...! You've insulted me, and you've insulted my honor!\nThese two are really starting to freak me out. I've never seen anything like it...\n4-Narration.png\n: Don't worry, they're not done yet!\n43-Hifumi10.png\n: I'm absolutely shocked!\n23-Makoto.png\n: ...How come?\n40-Hifumi12.png\n: They have all these books here, and not ONE copy of ANY of my works!\n45-Toko.png\n: W-Well, yeah... Why would they have c-comics in a library?\n46-Toko3.png\n: Plus, most \"fanfic\" is j-just porn drawn by a bunch of a-amateurs...\n40-Hifumi12.png\n: You just don't get it. Not. At. All.\n46-Toko3.png\n: I-I do too get it... And w-with a face like yours, anyone can tell n-nothing you do is worthwhile.\n40-Hifumi12.png\n: Say whatever you want about me, but never judge a book by its author!\n31-Hifumi13.png\n: Now hear this! Appearances mean nothing at all! What you see before you is nothing more than the rind that contains the meaty pulp of my genius!\n49-Hifumi14.png\n: My creations are what determine my meaning and value!\n46-Toko3.png\n: You're so f-full of it...\n50-Hifumi5.png\n: Hmph. I'm used to being misunderstood. You think weak attacks like yours will drop my HP?\nThose two...really worry me.\n2-BeautifulDeath.png\n53-Kyoko3.png\n: It's remarkably dusty in here. And the lighting is less than ideal. For a library, it's not the kind of place I'd want to do much reading in...\nIt looks like a\nlaptop\n... The\nlaptop\nlooks pretty old. And it's all covered in dust.\n57-Kyoko17.png\n: It's broken. I tried pressing the power button earlier, but nothing happened.\n23-Makoto.png\n: It's broken, huh? Too bad.\nI was hoping I could use it to go online and see what's going on in the outside world. If it's broken, there's nothing I can really do about it.\nThe shelf is covered in dust. But on the shelf is...\na letter\n. What's this...?\n23-Makoto.png\n:\nHope's Peak Academy...?\n62-Kyoko11.png\n: It was buried under a thick layer of dust. It must have been sitting there for quite a while. Well, shall we see what's inside?\n23-Makoto.png\n: But...we shouldn't read other people's mail without their permission.\n63-Kyoko13.png\n: What we *shouldn't* do is leave this here without finding out what's inside.\n23-Makoto.png\n: O-Okay...\nI broke the seal on the dusty envelope, and pulled out the single sheet of paper I found inside. I unfolded the paper, and read what was written there...\n64-DISTRUST.png\n\"From the Hope's Peak Academy Executive Office\"\n\"Throughout the years, we have been committed to shaping the youth who will one day shape the world. We have a long, proud history as an institution of higher learning with full government support. Out graduates enter society ready to take on active leadership roles in every major job field. However, Hope's Peak Academy must now lower the curtain on its glorious history, for the time being. This decision was not an easy one to make, but\nserious issues\nbeyond our control have made it necessary. But make no mistake--this is not the end for Hope's Peak Academy. We intend to reopen out doors as soon as the issues forcing our closure have been resolved. That being said, this is the end for now, and I would like to personally and sincerely thank everyone for your help and support over the years. For now, we are awaiting official governmental authorization to formally cease operations.\"\n23-Makoto.png\n: What does this mean?\n66-Byakuya3.png\n: Hmm... The contents of this letter are quite interesting indeed.\n68-Kyoko12.png\n: It would seem Hope's Peak had\nstopped functioning as a school\n. And judging by the amount of dust the letter had collected, it doesn't seem to have happened recently. If I had to guess, I'd say this letter could be\nat least a year old\n.\n23-Makoto.png\n: So...you're saying Hope's Peak closed down at least a year ago?\n69-Byakuya.png\n: Most likely, the mastermind took over the abandoned school in order to put on this little performance.\n23-Makoto.png\n: B-But that would mean it was closed when I got here just a few days ago.\n23-Makoto.png\n: But I didn't get that sense at all. Plus, if the school *had* shut down, don't you think it would've been in all the newspapers and stuff? I mean, you're saying it could've happened over a year ago, right? But before I got here, I looked stuff up online about the school, and never saw anything about this.\n22-Byakuya9.png\n: That must have all been part of the mastermind's plan. They lured us all in here. Someone who could create a place to judge and execute people could potentially be capable of anything.\n66-Byakuya3.png\n: Of course, that's all assuming that\nthis letter is real\n.\n62-Kyoko11.png\n: If it *is* real, though, that does solve one mystery surrounding the school... The reason there are no other students here could be because the school had already closed down.\n66-Byakuya3.png\n: That would be a nice, simple solution, it's true.\n23-Makoto.png\n: But then...what about this other part?\n\"This decision was not an easy one to make, but\nserious issues\nbeyond our control have made it necessary. But make no mistake--this is not the end for Hope's Peak Academy. We intend to reopen out doors as soon as the issues forcing our closure have been resolved.\"\n23-Makoto.png\n: What did they mean by\nserious issues\n? That's apparently why the school had to close... Is there any connection between that and what's happening to us now...?\n68-Kyoko12.png\n: If the two events are in fact connected, uncovering that connection would be a useful clue, on top of figuring out the\nmastermind's motive\n. Although I can't really say any more until we find more details.\n73-Byakuya15.png\n: So in other words, only the mastermind knows the truth right now.\nThe mastermind's motive... If we can figure out why they would want to imprison us all here will that be enough to get us out of here? Or...?\n2-BeautifulDeath.png\n23-Makoto.png\n: Anyway, now I have a pretty good idea what's on the 2nd floor.\nBut I didn't see anything that might lead to any kind of exit or anything... All I can do now is hope someone else found something worthwhile... Okay, I'd better head back to the\ndining hall\nas soon as possible!\n77-Taka7.png\n: Okay, ladies and gentlemen! How'd it go? Did anyone discover any interesting new anything!?\n49-Hifumi14.png\n: There's a library!\n78-Hina22.png\n: And a pool! A freakin' pool! And locker rooms filled with exercise equipment!\n9-Sakura4.png\n: There was not, however, anything resembling an escape route.\n23-Makoto.png\n: Yeah...she's right...\n80-Taka18.png\n: Well hey, there's no reason to get all sulky! Wait till you hear about my amazing discovery!\n77-Taka7.png\n: The\nwarehouse\nand\nbathhouse\non the 1st floor of the dorms are now open!\n82-Taka9.png\n: And the warehouse is chock-full of food, clothes, whatever you want. There's so much it's insane!\n83-Taka3.png\n: So go ahead and stuff yourself to the gills whenever you feel like! Ha-ha-ha!\n84-Celeste2.png\n: Keep in mind, of course, that\ngoing out at nighttime is still prohibited\n. Please do not forget...\n86-Mondo2.png\n: Okay, and what about a fuckin' way out of here? You find anything like that?\n87-Taka16.png\n: Oh, well...umm...\n88-Mondo8.png\n: There wasn't anything in the warehouse we could use to get our asses outta here? Nothin'?\n90-Taka17.png\n: U-Unfortunately, no...not that I saw...\n91-Mondo15.png\n: You fuckin' people...\n93-DespairSyndrome2.png\n94-Mondo5.png\n: Who gives a shit if we have a goddamn pool now!? Or a warehouse, or whatever the fuck!\n95-Mondo6.png\n: We're still trapped in this piece of shit school! We need to find a goddamn way OUT!\n96-Chihiro4.png\n: Now, now. There is no point in taking your anger out on us. Adaptation is the key, yes? For now we must each find a way to enjoy our current situation.\n88-Mondo8.png\n: Whatever you say, ya fuckin' loon...\n90-Taka17.png\n: For now, let's just continue our investigation, and let everyone know if you should discover something...\n98-Kyoko2.png\n: So, are we done for today?\n90-Taka17.png\n: W-Well...yeah, I guess so.\nThe air seemed to suddenly grow heavy again. Was this the mastermind's plan? To give us hope, just to turn around and betray that hope?\n69-Byakuya.png\n: ...\n101-GoodNight.png\n104-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\nWe all promised not to leave our rooms during nighttime... There's not much else to do. I guess I'll just go to bed.\n106-MrMonokumasLesson.png\n108-MonokumaTheater.png\n: Mr. Monokuma... Mr. Monokuma, do you have a second? I...I don't really like myself. I don't have any kind of skill or hobby I can say I'm super good at... And my grades are totally average, too. My reflexes are okay. Not great, not awful. I could get into a decent college, where I'd make a few friends. Maybe even find a normal girlfriend... Which is exactly why I don't like who I am! I understand that now! My life is just one giant copy-paste! I don't have any imagination! I'm a perfectly average cardboard cutout! You see what I mean, right Mr. Monokuma!?\n2-GoodMorning.png\n*Ding dong, bing bong*\n6-MonokumaTV.png\n: Good morning, everyone! It is now 7 a.m. and nighttime is officially over! Time to rise and shine! Get ready to greet another beee-yutiful day!\n6-MonokumaTV.png\n: Oh, that's right! I wanted to let you know that your e-Handbooks have been\nupdated\n! New regulations have been added, so please take a look and enjoy your school life more than ever before!\n7-BeautifulMorning.png\nHe must be referring to yesterday... \"\nLoaning your e-Handbook to another student is strictly prohibited\n.\"\n8-Makoto.png\n: But right now, I need to hurry up and head to\nbreakfast\n.\n9-Narration.png\n: We can walk around in the halls if we want but no one is out there so we make our way to the dining hall immediately.\n12-Hina5.png\n: Mornin', Makoto!\n8-Makoto.png\n: Good morning. Is everyone here already?\n13-Hiro18.png\n: Nope! Still waitin' on Byakuya and Taka. Byakuya's no surprise, but it's strange Taka's not here yet...\n14-Celeste4.png\n: Knowing Taka, I imagine he is trying to get the King of Tardiness up and out of bed.\n16-Sakura6.png\n: I'm sure they'll be here soon enough. Just be patient.\n17-Celeste8.png\n: I don't mind waiting for them, but there is one problem...\n8-Makoto.png\n: Which is...?\n19-Celeste15.png\n: I am thirsty.\n20-Mondo12.png\n: How the hell is that a problem!?\n21-Celeste3.png\n: Hifumi, would you make me some tea?\n22-Hifumi9.png\n: ...Huh?\n14-Celeste4.png\n: Milk tea, if you please.\n24-Hifumi6.png\n: Wh...why me?\n17-Celeste8.png\n: Your roundish figure reminds me of the owner of the coffee shop I used to frequent.\nThat's your reason...?\n14-Celeste4.png\n: I can feel my throat drying out. Quickly, please.\n24-Hifumi6.png\n: O-Okay... *leaves*\nApparently unable to refuse Celeste's order, Hifumi skulked his way into the kitchen. And a few minutes later...\n27-Hifumi4.png\n: Thank you for waiting!\nHifumi reappeared with tray in hand, the gentle aroma growing stronger as he approached.\n14-Celeste4.png\n: Hmhmhm. Finally...\n29-Toko.png\n: You c-could've made some for the r-rest of us, you know...\n30-Hifumi14.png\n: I emphatically decline! You're not my type at all!\n31-Hifumi5.png\n: Hmhm... It's all about the law of causality, basic instinct, act and react!\n32-Toko12.png\n: Grr...\n34-Celeste.png\n: Well then, if you don't mind...\nA small smile played across her lips as she held the tea cup delicately in her hand...\n17-Celeste8.png\n: ...Wait.\nShe cocked her head to the side...and threw the cup as hard as she could at the wall!\n*CRASH*\n36-100MileJunkFoodDash.png\n37-Hifumi10.png\n: What the--!? H-Hey! What are you doing, my little white rabbit!?\n39-Celeste9.png\n: I HATE this kind of tea!\n40-Hifumi2.png\n: U-Umm...I don't understand...\n17-Celeste8.png\n: Imagine we are at a coffee shop--just any normal, everyday cafe. I sit down, and I order some tea. They then ask me, \"Would you like lemon, or milk?\" Now, further imagine that I replied, \"Ah, yes, I would like milk tea, please.\" In this case, along with my tea they may bring me a small container of milk, yes?\n43-Celeste7.png\n: But this is not for me! I am among those who prefer the milk to be part of the process from the outset! The fragrance is just so overwhelmingly sweet that way... Adding milk or lemon right before you drink is like dousing your fries in ketchup--mere condiments! Whenever looking for a cafe, I first review their menu to see if it offers the proper style of milk tea.\n39-Celeste9.png\n: And I cannot acknowledge any \"milk tea\" that does not add the milk during the brewing process!\nIf I had to describe our shared reaction to what we'd just heard I'd have to go with \"wide-eyed bewilderment.\"\n22-Hifumi9.png\n: Umm...I went to all that trouble to make you that tea...and you wanted me to go even farther?\n45-Celeste2.png\n: Yes, I realize it can be a bit of a hassle... Even in cafes that offer proper milk tea, it is always more expensive than simple tea with milk. It takes more time to prepare, surely, but...\n14-Celeste4.png\n: ...why even bother creating a menu if you are not going to offer the highest level of quality!?\n40-Hifumi2.png\n: Well, um...we don't actually have a menu...\n47-Celeste10.png\n: That does not matter. Hurry up and bring me what I asked for, swine!\n49-Hifumi11.png\n: WHAAAAAT!?\n50-Hifumi8.png\n: O-Okay! Your little piggy will bring it right out! *runs off*\n14-Celeste4.png\n: Hmhm. I do so love coercion.\n52-Hina12.png\n: You were like...a totally different person just now.\n53-Mondo8.png\n: Yeah, shit... You really went psycho there.\n14-Celeste4.png\n: Hmhmhm...\nI knew there was more to her when I first met her... I'd hate to have her as an enemy. Seriously, man. She's one scary chick...\n♪\nMusic fades out.\n♪\nThe dining hall doors flew open, and one of the late arrivals came storming in. But...\n56-Taka16.png\n: Bad news, everyone! There is a mystery afoot!\n57-Hiro7.png\n: Huh? What happened?\n56-Taka16.png\n: It would seem Byakuya refuses to leave his room! I stood there pressing his doorbell over and over, but he never showed himself.\n8-Makoto.png\n: Maybe he just...wasn't there.\n59-BoysLifeofDespair.png\n60-Taka2.png\n: I'd like to think so. But I'm worried\nsomething might have happened to him\n.\nWhat he meant by that... He didn't have so say anything else. Everyone understood exactly what that might mean...\n61-Makoto2.png\n: I-It might be a good idea if we all split up and go look for him.\n62-Taka7.png\n: Ah! I was just about to suggest the same thing!\n63-Toko4.png\n: Stop trying to one-up e-everyone...\n65-Hina2.png\n: Okay, then I'll go check his room one more time. I'm just gonna keep on hammering that button till I get a response.\n66-Sakura.png\n: Very well, then the rest of us can go check the rest of the building.\n67-Hiro4.png\n: Yeah. Before it's, y'know...too late.\n61-Makoto2.png\n: ...\nAnyway, we have to just do our best to find Byakuya. So where might Byakuya have gone...? Maybe he went to go check out the\n2nd floor of the school\nagain...\n9-Narration.png\n: With that, everyone scatters around the school looking for Byakuya. We can stop and talk with them all as we do our own searching. Celeste, however, doesn't seem to want to search.\n61-Makoto2.png\n: Celeste...aren't you going to help look for Byakuya?\n39-Celeste9.png\n: I have not had my tea yet.\n61-Makoto2.png\n: Huh?\n70-Celeste5.png\n: Until my thirst is satisfied, I have no urge to do anything.\n14-Celeste4.png\n: If you are in a hurry, feel free to motivate Hifumi to move faster.\n61-Makoto2.png\n: O-Okay...\nBut aren't you being kind of...selfish?\n9-Narration.png\n: Speaking of Hifumi, no one's told him what's going on.\n73-Hifumi3.png\n: Ah, Mr. Naegi. What's going on?\n61-Makoto2.png\n: Well...nobody's seen Byakuya this morning, so we've all decided to go look for him.\n37-Hifumi10.png\n: Wh-What!? That's not good at all!\n74-Hifumi17.png\n: However...this little piggy needs to...\n74-Hifumi17.png\n: I have a\nholy edict\nto deliver a proper milk tea to my master!\n76-Hifumi15.png\n: To bless this undeserving swine with such an honor...! I will serve you with all my heart and soul!\n61-Makoto2.png\n: O-Oh, okay. Good luck with that...\nHifumi's created some creepy alternate reality for himself...\n9-Narration.png\n: Across the way from the dining hall, we can now see the bathhouse is open. Maybe he's in there?\n9-Narration.png\n: Not much to check out in the dressing room, just the door to the bath right now. Mondo's hanging around though.\n81-Mondo.png\n: How's it goin'? You find him?\n61-Makoto2.png\n: No...\n82-Mondo13.png\n: Shit... Man, where the hell'd he go? He's got his head stuck so far up his ass, who knows *what's* goin' on with him? I figured he was takin' a bath or somethin'.\n81-Mondo.png\n: So what about you? You a\nmorning bath\nkinda guy?\n84-Mondo4.png\n: After spending all night ridin' your hog, wind in your face, there's nothin' better than a morning dip! The hot water loosens ya up, and the heat of your soul gets your heart and body pumpin'!\n61-Makoto2.png\n: S-Sure thing. I'll have to take your word for...all that.\n85-Mondo2.png\n: What, you don't know what I'm talkin' about? Fuckin' nerd...\n84-Mondo4.png\n: Guys gotta expose themselves to each other, ya know? Come with me next time, you'll see!\n61-Makoto2.png\n: I-I'll think about it...\nBut I mean...it's not like you've been \"riding your hog\" here in the school, right?\n9-Narration.png\n: Like the bathhouse dressing room, the bath itself doesn't really have anything to examine. There is another door in back though.\n9-Narration.png\n: The sauna lies behind it. Not even any Monocoins hidden here.\n9-Narration.png\n: Back in the hall below the dorms is the door to the warehouse. It's no longer covered in Caution tape.\n9-Narration.png\n: It's a pretty tall room with lots to examine for flavor text but nothing really important. Taka's here though.\n60-Taka2.png\n: Ah-ha! I see you came to search this area as well, Makoto!\n94-Taka18.png\n: But you were one step too late! I've already finished my investigation. And\nthere was no trace\nof Byakuya here!\n95-Taka8.png\n: An army marches on its stomach, as they say!\n97-Taka15.png\n: So I thought maybe he would come here to have his fill...\n98-Taka4.png\n: We must all eat! Eat until there's nothing left to eat!\n95-Taka8.png\n: Anyway, now is no time to get discouraged. We must head elsewhere to continue our search!\n61-Makoto2.png\n: Y-Yeah, you're right...\n9-Narration.png\n: Back in the dorms, Hina and Toko are partnered up.\n61-Makoto2.png\n: Hey, Toko. Hanging out with Hina, huh?\n63-Toko4.png\n: What, you got a problem with th-that?\n61-Makoto2.png\n: N-No...\n102-Toko2.png\n: Hmph.\n29-Toko.png\n: S-Something might've happened, right? Being alone r-right now might not be safe...\n61-Makoto2.png\n: So you got scared and decided to stay close to Hina...\nI guess everyone has a softer side.\n104-Toko3.png\n: As long as I'm w-with the sports idiot, if something d-does happen, I'm sure she'd jump in without th-thinking and take the fall...\n61-Makoto2.png\n: Huh?\n32-Toko12.png\n: What? Were you e-eavesdropping? Awful! You're just a-awful!\n106-Toko13.png\n: G-Get lost, you stray cat!\n61-Makoto2.png\n: ...\n61-Makoto2.png\n: Hey, Hina. Any luck?\n65-Hina2.png\n: Nah, it's no use. I keep banging on his door, and nothin'!\n109-Hina15.png\n: Come on, already! Open up!\n*BANG BANG BANG*\n61-Makoto2.png\n: C-Careful! You're gonna bust the door down hitting it that hard!\n12-Hina5.png\n: Relax! This is nothing compared to what Sakura could do.\n111-Hina22.png\n: Sakura's really awesome, ya know? If she really wanted to...she could tear this door to shreds!\n61-Makoto2.png\n: I-I see.\nWell, she *is* the Ultimate Martial Artist. She might actually be able to do it.\n113-Hina20.png\n: Hmm... I've been knocking long enough, I think I can say for sure\nhe's not here\n.\n61-Makoto2.png\n: I think you're right. Okay, I'm gonna go look around for him.\n114-Hina.png\n: Okay! Good luck!\n9-Narration.png\n: We can find Hiro in the boys bathroom.\n61-Makoto2.png\n: What are you doing in the bathroom, Hiro?\n118-Hiro2.png\n: Huh? Oh, well...\n119-Hiro12.png\n: I consulted the spirits, and... He had a bathroom emergency and couldn't make it to breakfast!\n120-Hiro15.png\n: His guts forced him to spend all morning in the can!\n121-Hiro13.png\n: But I was totally wrong, swing and a miss, three strikes I'm out...\nYeah, Byakuya doesn't seem like the kind of guy to have problems like that.\n9-Narration.png\n: Up on the 2nd floor, Sakura's in the locker rooms.\n66-Sakura.png\n: It would appear\nByakuya\nis not here.\n16-Sakura6.png\n: Since it's morning, I thought he might have gone to the locker room to exercise. But I forgot that girls can't open the boys locker room door.\n61-Makoto2.png\n: Oh yeah, true.\n125-Sakura3.png\n: I knocked, but nobody answered. I listened for the sound of equipment being used, but there was nothing.\nSo he must not be in there... Besides, Byakuya doesn't seem like the type to go \"sweat it all out\" this early in the morning.\n61-Makoto2.png\n: Do you exercise every single morning, Sakura?\n66-Sakura.png\n: Of course. If I didn't get my blood pumping early in the morning, it would throw off my rhythm for the entire day.\n9-Narration.png\n: Chihiro can be found by the stairs to the 3rd floor.\n128-Chihiro5.png\n: Oh, hey Makoto.\n61-Makoto2.png\n: So? Did you find Byakuya?\n129-Chihiro8.png\n: N-No...I didn't see him anywhere.\n61-Makoto2.png\n: I see.\n130-Chihiro.png\n: Somehow, Kyoko\nfigured out\nwhere he might be...\n61-Makoto2.png\n: Huh...\n132-Chihiro13.png\n: Kyoko's so amazing... She's so cool. She's smart, and she seems really tough...\nShe's definitely smart, that's for sure. But...tough? Compared to, say, Sakura or even Hina, she doesn't seem all that different from Chihiro. ...Is it weird to compare them like that?\n129-Chihiro8.png\n: Ahh...\n9-Narration.png\n: Finally, Kyoko's out in the 2nd floor halls.\n135-Kyoko2.png\n: So you thought to come here, too...\n61-Makoto2.png\n: ...Huh?\n137-Kyoko7.png\n: If you think about what Byakuya was\nso interested in\nyesterday, you can probably guess where he is right now, right?\nHuh...? What was it Byakuya was interested in again...?\n9-Narration.png\n: The answer to that lies behind the library doors.\nWhen I opened the door to the library and looked inside...I cried out in sudden surprise.\n2-Makoto2.png\n: Byakuya!?\n4-BeautifulDeath.png\nOf all the things I'd imagined, this most definitely wasn't one of them...\n5-InTheLibrary.png\n2-Makoto2.png\n: Hey, uh...what are you doing?\n6-Byakuya23.png\n: I'm fishing. What does it look like I'm doing? I'm trying to read. So if you could be quiet...\n2-Makoto2.png\n: Oh...sorry. Wait, no--! What are you doing here? Everyone's super worried! We've all been looking for you!\n6-Byakuya23.png\n: Who asked you to do that?\n2-Makoto2.png\n: B-Because...we're all supposed to meet up in the morning and eat together. We made a promise!\n6-Byakuya23.png\n: A promise...? *Sigh* Can't I get a second's peace and quiet around here?\nByakuya snapped his book shut, and slowly stood up, smooth and silent as a shadow. Meanwhile, the others must have heard me yell and started showing up, one after another.\n8-Taka9.png\n: Byakuya! So this is where you've been hiding!\n9-Hiro14.png\n: The heck are you doin' here, man?\n10-Sakura3.png\n: We were very concerned...\n12-Byakuya7.png\n: Well you had no reason to be. I was just reading. I've never read such a...coarse novel before, but it might just prove useful at some point.\n13-Hina2.png\n: Wh-What were you reading?\n14-Byakuya.png\n: A\nmystery novel\n.\n16-Hifumi7.png\n: W-Wait, so are you gonna use what you're learning in there to betray us!?\n14-Byakuya.png\n: Don't be stupid.\n2-Makoto2.png\n: Yeah!\n18-MrMonokumaAfterClass.png\n19-Byakuya3.png\n: It's just something to keep in mind.\n2-Makoto2.png\n: Yea--what?\n19-Byakuya3.png\n: If I decide to fight, of course I'll come up with something original. Otherwise, this game of ours will be totally boring, right? It's not often you get to take part in such a high-stakes, high-tension activity. So if you're going to do it, you have to make sure it's entertaining. Mhmhmhm...\nHis words sent a chill down my spine. There was an undeniable smile on his face as he spoke. He looked like he was actually enjoying himself. Enjoying this deranged \"killing game\"...\n21-Mondo8.png\n: What the fuck do you mean, \"game\"!? That's fucked up!\n14-Byakuya.png\n: But it *is* a game. It's a game of life or death, which can have only one winner. That's all there is to it.\n22-Celeste2.png\n: He is right. It's a\nzero-sum game\n.\n2-Makoto2.png\n: Huh?\n24-Celeste17.png\n: It is a part of game theory, a mathematical model. In game theory, what we are going through now is called a \"zero-sum game.\" In this type of game, in order for one person to gain something, another must necessarily lose something. In other words, it is a situation in which participants must compete for position or resources.\n25-Sakura4.png\n: You mean like...a kind of\nelimination match\n.\n22-Celeste2.png\n: Entrance exams, sports tournaments, job openings--most social interactions fall into this category. Everyone must scramble to obtain something which is limited. For you to succeed, someone else must fail. This also applies to the school life we have been subjected to here. In this case...\n27-Celeste16.png\n: ...our \"limited resource\" is that only one of us can successfully become\nthe blackened\n.\n28-Byakuya4.png\n: So, this game was designed from the beginning to force one of us to try and defeat all the others.\n2-Makoto2.png\n: Th-That...that can't be what they had in mind!\n29-Celeste3.png\n: This is why adaptation is so crucial. If those who want to escape were to disappear, there would be no reason to continue playing the game.\n28-Byakuya4.png\n: But why would I want to stop playing? It's so much fun...\nHe smiled again as he spoke. The smile was filled with evil intent. It twisted his face into something not human...\n22-Celeste2.png\n: It sounds as if you do not acknowledge even the possibility that you may lose, am I right?\n19-Byakuya3.png\n: Of course.\n29-Celeste3.png\n: You do not speak like the others. Exactly what I would expect from the Togami heir apparent.\n32-Hiro4.png\n: ...It's just normal arrogance, isn't it?\n34-Hina15.png\n: You talk like that, but what if you end up dead!?\n35-Byakuya2.png\n: I won't. It simply isn't possible.\n36-Mondo7.png\n: Who the fuck do you think you are!?\n12-Byakuya7.png\n: You know, I still just can't believe it...\n38-Mondo5.png\n: Believe what!?\n12-Byakuya7.png\n: That an uneducated, brain-dead, useless piece of garbage like you has survived this long.\n39-Mondo6.png\n: I'm gonna fuckin' kill you!\n19-Byakuya3.png\n: Like I said. I won't die.\n9-Hiro14.png\n: You keep saying that, but--\n41-Celeste9.png\n: Do not bother arguing with him. For him, the concept of losing simply does not exist. He is the\nUltimate Affluent Progeny\n, after all--a boy raised to succeed from the day he was born. He considers victory his destiny, and has lived his life accordingly. Tests and challenges are merely ways for him to stand victorious. Even if it is a life-and-death situation.\n43-Celeste4.png\n: Is that not so, Byakuya?\n19-Byakuya3.png\n: At least one of you seems to understand.\n43-Celeste4.png\n: It is because I am the same as you. Games are meant to be won.\n45-Byakuya5.png\n: Are you trying to suggest we're on the same level? Close that vulgar mouth of yours.\n47-Celeste6.png\n: Well, well. I do apologize.\n35-Byakuya2.png\n: Anyway, let me just say this to all of you. You all need to try harder. If an opponent isn't going to give it their best, where's the fun for me?\n49-Chihiro11.png\n: Th-That's a terrible way to look at it...\n45-Byakuya5.png\n: Hmm?\n49-Chihiro11.png\n: This...isn't a game. Our lives are on the line, you know... To kill your own friends is...is...\n51-Chihiro15.png\n: It's horrific!\n19-Byakuya3.png\n: Friends? Who decided that?\n53-Chihiro7.png\n: ...Huh?\n12-Byakuya7.png\n: We're not friends. No, quite the opposite. We're in competition--we're enemies.\n54-Chihiro10.png\n: B-But...you know...\n45-Byakuya5.png\n: But what? Stop trying to force your contradictions on me and just accept what I'm telling you.\n54-Chihiro10.png\n: U-Um...\n45-Byakuya5.png\n: Yes? If you have something to say, say it. Otherwise, keep your mouth closed.\n54-Chihiro10.png\n: ...\n56-Chihiro9.png\n: I-I'm sorry...\n38-Mondo5.png\n: Hey, shithead! You get off on bullying people that can't fight back? You wanna try that on me!?\n19-Byakuya3.png\n: So, you're back to pretending to be friends, huh? And how long do you think that's going to last?\n39-Mondo6.png\n: Fuck you!\n45-Byakuya5.png\n: Is that all you can say?\n12-Byakuya7.png\n: It's unfortunate you would waste your breath on such empty gibberish.\n36-Mondo7.png\n: That's it! You're fuckin' dead!\n34-Hina15.png\n: H-Hold on! Just calm down!\n39-Mondo6.png\n: I AM calm!\n59-Hina23.png\n: How is *this* \"calm\"!?\n61-Byakuya14.png\n: Anyway...I don't have any intention of working with the rest of you any longer. To cooperate during an elimination game is... Well, frankly, it's a waste of time. And I hate wasting my time.\n2-Makoto2.png\n: Waste of time?\n61-Byakuya14.png\n: Engaging in \"friendly\" group meals is out of the question. Someone could easily poison our food. And I'd rather not become part of the Last Supper just yet.\n21-Mondo8.png\n: Quit talking like you're in a fuckin' movie or something!\n61-Byakuya14.png\n: All I'm saying is that, ultimately, you are all free to do whatever you want on your own. Goodbye. *leaves*\n4-BeautifulDeath.png\nWithout a second glance back, Byakuya left. There wasn't anything we could do to keep him from going. His way of thinking was just beyond anything the rest of us could even comprehend.\n32-Hiro4.png\n: Was he serious about all that...?\n41-Celeste9.png\n: He was, without a doubt.\n21-Mondo8.png\n: Well fuck him, then.\n66-Toko4.png\n: B-But what he said... He might not n-necessarily be wrong... I mean, can you s-say for sure someone *won't* poison our f-food?\n34-Hina15.png\n: Hey, come on! You too, Toko!?\n66-Toko4.png\n: Well, it's n-not like anyone would care even if I w-was gone, right...?\n67-Toko12.png\n: Actually I bet you all *w-want* me gone! You all think I'm d-disgusting!\n2-Makoto2.png\n: None of us think that...\n69-Toko13.png\n: You j-just *think* you don't think that!\n9-Hiro14.png\n: I know some people like to play the victim, but this is just...totally out there.\n67-Toko12.png\n: You think I d-don't know, but I do... You want me g-gone!\n70-Toko9.png\n: And I'm s-sure...the rest of you want the same th-thing, don't you! *runs off*\n2-Makoto2.png\n: Ah, hey! Toko, wait!\n43-Celeste4.png\n: Just let her go. Once she gets going like that, there is nothing you can say to bring her back.\n2-Makoto2.png\n: ...\n♪\nMusic fades out.\n♪\nUltimately, our breakfast meeting came to an end without answering any questions. Everyone headed back to their rooms.\n73-Makoto.png\n: Jeez, I'm tired already... But I don't have time to take even one day off! I need to get myself going.\n75-Narration.png\n: Next time, a couple Free Time visits.\n2-BeautifulDays.png\n3-Narration.png\n: I spent time between updates at the School Store buying more presents. Spent upwards of 150 coins and now I definitely have enough presents for the rest of the game. I'm going to keep buying more every time I have a lot of coins though because there's one present that unlocks a scene that I haven't seen before and I'm curious if I can get it to drop. Apparently a different present I received actually unlocks a scene in Chapter 3, though I'm not sure which one it is. I might know the one it's talking about.\n3-Narration.png\n: We have 2 Free Times to spend today. I'd like to spend time with Chihiro but the game actually takes peoples moods into account when Free Time occurs. Chihiro just got yelled at pretty badly by Byakuya and isn't feeling very good about herself. We can do her free time event but the game will actually not give you any skill point increases or new skills when a character isn't in the mood. She'll be feeling better by the next set of free times so I can speak with her then.\n3-Narration.png\n: (I just realized that this might be something they changed for the Vita re-releases but I know it was something in the PSP version and mentioned in the original LP so I'm just operating under the assumption it's still there.)\n3-Narration.png\n: Instead, today we'll be visiting Mondo for both our Free Times. I originally planned to spend time with him and Byakuya, but I enjoyed Mondo's first free time so much  that I decided to go straight into a second one with him. We can find him in the Pool hallway outside the locker rooms.\n6-Mondo.png\n: What's up, man? Something wrong?\n> Spend some time with Mondo\n9-Mondo3.png\n: Shit, man. Normally I don't hang out with guys this much, know what I mean? But I got some time to kill, so whatever.\nI spent some time with Mondo... Mondo and I grew a little closer today.\n>Yes, definitely\nSonic Cup-a-Noodle:\nInstant noodles. Fill it with boiling water and it's ready in 3 seconds. Of course, it also goes bad in like 30...\n13-Mondo11.png\n: Damn, seriously!? This thing is like, super-rare!\n14-Mondo4.png\n: Don't mind if I do! Damn, I'm lucky as shit!\nSeeing Mondo so pleased with something I gave him makes me happy!\n6-Mondo.png\n: Hey Makoto! What's your ride?\n15-Makoto.png\n: Huh? My ride...?\n17-Mondo2.png\n: Yeah, man! Your hog! Your chopper! Your\nmotorcycle\n!\n15-Makoto.png\n: Oh, uh...I don't ride anything.\n19-Mondo10.png\n:  What!? You're not a little kid anymore, right? And you still don't have a hog!?\n9-Mondo3.png\n: God, you're such a fuckin' dweeb!\n15-Makoto.png\n: Uh...sorry?\n6-Mondo.png\n: Alright man, I'm gonna educate ya! A real man rides Kawasaki, okay? That's what I ride.\n14-Mondo4.png\n: You oughta see it, man. The v-twin's got that monster power, it's like you're dancin'. Course, it ain't for just anyone. You gotta have the skill to handle it!\n15-Makoto.png\n: You must really love your motorcycle.\n22-Mondo5.png\n: Hell yeah I do! I'm a goddamn biker, ain't I? We're crazy as hell!\n15-Makoto.png\n: Yeah, you're the leader of the biggest biker gang in Japan, right?\n14-Mondo4.png\n: Damn straight! The invincible\nCrazy Diamond\ngang! You wanna come on a ride with us? The monster sound comin' outta that straight pipe... Hot damn!\n15-Makoto.png\n: Straight pipe...?\n17-Mondo2.png\n: Come on, you gotta know what a straight pipe is, right?\nIt's like...when something's missing, right? That's why it makes a \"monster sound\"...\n> When it's got no muffler\n15-Makoto.png\n: It's when the motorcycle\ndoesn't have a muffler\n, right?\n14-Mondo4.png\n: So you *did* know. Good! Then that's that! Next time we ride, you ride with us!\n25-Mondo13.png\n: Man, that makes me think back to when I first started riding.\n6-Mondo.png\n: My big bro used to ride too, ya know. His name's Daiya.\nDaiya\nand\nMondo\n--together we were the Diamond Brothers! Everyone up and down the country knew us!\n9-Mondo3.png\n: Course, I was always the cool one...\nThe Diamond Brothers? That sounds kinda...incredible.\n27-Mondo12.png\n: The first time I went out, I ended up at the back of the pack. Eventually the cops got on us, and they surrounded me. I was in some tough shit, man!\n22-Mondo5.png\n: So I pulled over, but when they came up to me... Well, let's just say it was a massacre.\n15-Makoto.png\n: A massacre...? Man, Mondo. You must be really strong...\n29-Mondo6.png\n:  Of course! You can't wave the banner for our gang without that kinda strength!\n17-Mondo2.png\n: In a fight, they'll go for the leader first. Kill the leader of the pack, ya know? That's why the other gangs come after me. So if you wanna be the leader of the pack, you gotta be a tough motherfucker!\n6-Mondo.png\n: You'll see what I mean when we go on our first ride. Get ready for it!\n15-Makoto.png\n: Actually...maybe it's better if I don't get involved in that kinda thing. And like I said, I don't have a motorcycle. I don't even know how to drive one!\n14-Mondo4.png\n: Then you can ride with me!\nRiding with Mondo... But other gangs target him first, right?\n15-Makoto.png\n: No...nooo way...\n14-Mondo4.png\n: Hey! I said get ready for it! Damn, I am pumped! I can't wait to get outta here now! *leaves*\nMondo left, apparently in a pretty good mood...\n15-Makoto.png\n: Crap... This is really bad...\nEven if I get out of here, I might still be in real trouble...\n31-Tutorial.png\n: Mondo's\nReport Card\nhas been updated based on your experience with him. Your maximum number of\nSkill Points\nhas increased! Hey, look at you go!\n3-Narration.png\n: Any time there's a Skill point increase, our SP goes up by 1.\nDragging my anxiety behind me, I went back to my room.\nThere's still plenty of time left. I can't just sit around here. I should head out.\n3-Narration.png\n: Like I said, we're visiting with Mondo again because I enjoyed the first event a lot and felt like seeing another one of his. I wasn't disappointed.\n3-Narration.png\n: We can find him in the laundry room.\n25-Mondo13.png\n: I wanna get outta this depressing as shit hellhole! Get down to the beach or somethin'...\n> Spend some time with Mondo\n14-Mondo4.png\n: Hell yeah! I'm totally down to kill some time with you!\nI killed some time with Mondo... Mondo and I grew a little closer today.\n> Yes, definitely\nRoller Slippers:\nSlippers with a small wheel installed in each heel. They were invented to move easily around the house, but there is absolutely no demand for them.\n19-Mondo10.png\n: You had somethin' like this?\n17-Mondo2.png\n: Why didn't you hand it over earlier!?\nSeeing Mondo so pleased with something I gave him makes me happy!\n42-100MileJunkFoodDash.png\n9-Mondo3.png\n: Ahh, dammit! Bastard! Dammit bastard son of a bitch!\n15-Makoto.png\n: What's wrong? Why are you so mad?\n22-Mondo5.png\n: Why am I mad? Why am I mad!? Can't you SEE why I'm mad!? I need to get outta here! I need to get out and run wild!\n9-Mondo3.png\n: I'm so pissed off right now! Shit!\n15-Makoto.png\n: I-I know how you feel, but...just don't do anything crazy, okay?\n17-Mondo2.png\n: Hey, how about we have a one-on-one!?\n15-Makoto.png\n: One-on-one!?\n6-Mondo.png\n: Relax. It's just a bareknuckle brawl. No weapons. Whaddya say!?\n15-Makoto.png\n: ...What?\n46-Mondo7.png\n: Didn't ya hear me? A bareknuckle brawl. Bare. Knuckle. Brawl!\nI-I'd better come up with something fast... When he says a \"bareknuckle brawl\" I think he must mean...\n> Hand-to-hand\n15-Makoto.png\n: A hand-to-hand fight...?\n22-Mondo5.png\n: Hell yeah! Hand to hand! Knuckle to knuckle!\n15-Makoto.png\n: H-Hold on! Friends can't fight each other!\n17-Mondo2.png\n: But that's the only way I can burn off all this energy!\n15-Makoto.png\n: But I mean... I've never even been in a fight before... Oh, I know! Why don't you go ask Sakura!?\n19-Mondo10.png\n: What...?\n15-Makoto.png\n: I mean, you can spar with her, right? You don't have to actually fight, but just...train.\n49-Mondo8.png\n: D-Don't be a fuckin' idiot! I can't hit a girl...! And she's a girl, right? I'd ruin my honor... My mom would kill me!\n15-Makoto.png\n: ...\n29-Mondo6.png\n: I'm serious! I can't hit girls! It's not like I'm scared of her or anything! Ya bastard!\n15-Makoto.png\n: Okay, okay, you don't have to shout...\n52-Mondo9.png\n: Shouting's in my blood, asshole! When I get stressed out, I yell! Shit!\nSounds like he must be *really* stressed out...\n29-Mondo6.png\n: It's just a\nnervous habit\n! What's the big deal!? Other than the fact it makes it hard to ask girls out! I get all nervous, and I start yelling! So I always get rejected! And thanks to that, I'm on a\nten-game losing streak\nright now! It really sucks!\nTen games...? That's...pretty bad.\n54-Mondo15.png\n: Grr...shit! And I'd forgotten about that, too! Thanks for reminding me, jackass! How're you gonna make it up to me, shitstain!? Ghh...now I'm gettin' all depressed. I'm outta here... *leaves*\nShoulders slumped, Mondo trudged away.\n15-Makoto.png\n: I guess I kinda messed that up...\nBut I did get to see a side of Mondo I had no idea existed... It was almost...kinda cute. He'd murder me if he heard me say that, though...\n31-Tutorial.png\n: Mondo's\nReport Card\nhas been updated based on your experience with him. You just unlocked the skill\nDownshift\n! Give yourself a pat on the back. You've earned it!\n3-Narration.png\n: Downshift is a skill that lowers the speed at which your cursor moves in the Nonstop Debate, Hangman's Gabmit and Closing Argument. It's useful if you feel like you're not in as good control of the cursor on the default speed. I don't plan on using it though because I already feel like the cursor moves too slowly.\nAfter we were done, I decided to head back to my room for a while...\n*Ding dong, bing bong*\n58-GoodNight.png\n61-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\nAnother day gone... But even though today is over...this \"game\" definitely isn't. How long is it gonna keep going?\nAll the stress and anxiety kept me from falling asleep until late in the night...\n63-MrMonokumasLesson.png\n65-MonokumaTheater.png\n: Whenever I spot a cute girl, I have a tendency to stare. I can't help it--I just gaze with intensity. The other day, I rode my bike to the train station... I was in the bathroom, just looking at myself in the mirror...\n1-GoodMorning.png\n4-MonokumaTV.png\n: Good morning, everyone! It is now 7 a.m. and nighttime is officially over! Time to rise and shine! Get ready to greet another beee-yutiful day!\n6-BeautifulMorning.png\n7-Makoto.png\n: Well, I guess I'd better head to the\ndining hall\nbefore anything else...\n9-Narration.png\n: Once again, nobody's in the hall this morning, so we make our way directly to the dining hall.\nI went to the breakfast meeting same as always. But...\n13-Taka2.png\n: Is this...everyone? It feels a little...small.\nByakuya and Toko had stormed off yesterday, and it wasn't too surprising they hadn't come today.\n14-Taka17.png\n: Even the table looks bigger, somehow.\n16-Celeste9.png\n: I assume that is because three people are dead, and two are abstaining.\n7-Makoto.png\n: Yeah, with five people missing, I guess it *would* feel kinda empty.\n17-Hina2.png\n: Still... I know Byakuya's whatever, but shouldn't we go check on Toko?\n19-Hiro12.png\n: I vote no. She's super annoying.\n20-Celeste.png\n: How can you be so cold? You are like a piece of rock candy.\n21-Taka8.png\n: What!? No, rock candy isn't cold! It's sweet!\n23-Mondo13.png\n: ...Anyway, Byakuya's the real problem. If we don't keep an eye on him, he might really kill someone. You can see it in his eyes...\n24-Mondo8.png\n: We got no choice! Get some rope! We're gonna hafta keep him bound and gagged!\n7-Makoto.png\n: I think that's going a little overboard...\n25-Taka7.png\n: He's right! In this situation, there's nothing scarier than when an ally turns loose cannon! It's just like when we were kids, and someone would go crazy at sports day or whatever!\n27-Mondo5.png\n: What the fuck are you talking about!? You gonna use the rope to do tug of war or something!? Idiot!\n29-Taka13.png\n: I'm not an idiot...!\n30-Taka9.png\n: YOU'RE an idiot!\n24-Mondo8.png\n: Who are you callin' stupid!?\n32-Chihiro8.png\n: ...\n7-Makoto.png\n: Huh? What's wrong, Chihiro? You don't look so great...\n32-Chihiro8.png\n: Oh, I'm just going through a little...self-loathing.\n7-Makoto.png\n: Huh? Self-loathing?\n32-Chihiro8.png\n: Well, after what Byakuya said to me yesterday...I just got so nervous, I locked up. I couldn't say anything. Mondo ended up having to help me out. And even *he* said I was someone who \"can't fight back\"... I...I hate how weak I am.\n34-Hina23.png\n: Ahh, I see. So Mondo made you depressed.\n35-Mondo2.png\n: What!? How's it *my* fault!?\n27-Mondo5.png\n: I wasn't tryin' to be mean! Besides, girls are just naturally weak anyway right!?\n32-Chihiro8.png\n: ...\n37-Chihiro9.png\n: Gh...\n39-Mondo10.png\n: A-Are you...crying...?\n40-Hina19.png\n: It's cuz you were screaming like a lunatic!\n37-Chihiro9.png\n: Nng... *hic*\n42-Mondo12.png\n: Hey, c'mon, don't cry...I-It's my fault, okay? I won't yell at you anymore...\n40-Hina19.png\n: Really? Not sure I can believe that...\n24-Mondo8.png\n: J-Just shut up...\n42-Mondo12.png\n: ...I got it! I'll make you a\npromise as a man\n!\n45-Chihiro10.png\n: Promise...as a man?\n46-Mondo3.png\n: Maybe I mentioned this before, but... Ever since I was a kid, there was one thing my brother told me over and over again. He said that no matter what, a real man ALWAYS keeps his promises. That's what he left me.\n47-Hifumi2.png\n: Left you...?\n49-Mondo15.png\n: Oh, yeah... My brother's dead.\n7-Makoto.png\n: Oh...I see...\n23-Mondo13.png\n: Anyway, I don't wanna talk about it. Don't wanna make all you guys cry!\n51-Mondo4.png\n: Anyway, so you can trust me when I make that promise. So you don't gotta cry anymore!\n32-Chihiro8.png\n: O-Okay.\n53-Chihiro12.png\n: Thank you...Mondo.\n55-Mondo14.png\n: S-Sure...\n32-Chihiro8.png\n: But...I still don't like how I am right now. I have to get stronger... If I'm so weak anything can make me cry...that's not good.\n7-Makoto.png\n: Still, don't stress out too much about having to get stronger.\n57-Chihiro13.png\n: No...I *want* to get stronger. Maybe I should...start working out...\n59-Sakura8.png\n: In that case, I would be happy to help you out anytime.\n60-Hifumi10.png\n: B-But then Miss Fujisaki would get smashed into a billion pieces!\n61-Hina16.png\n: Shut up, you.\n63-Chihiro4.png\n: Hmhmhm...\n64-Hiro.png\n: Ohh, finally cracked a smile, huh?\n65-Chihiro3.png\n: Y-Yeah...\n63-Chihiro4.png\n: Everyone...thank you.\nLooks like Chihiro's gotten some life back. Yeah man! If we keep helping each other out like this we're bound to get outta this crappy place sooner or later! I mean...someday...I'm sure...\nStill, our biggest concern right now is the other two, who never showed up for breakfast. What can I do to try and understand those two better?\n7-Makoto.png\n: Okay, so...what should I do today?\n70-BeautifulDays.png\n9-Narration.png\n: We have 2 Free Time events available to us right now. Since Chihiro is now feeling better about herself, we can hang out with her.\n9-Narration.png\n: We can find her on the 2nd floor outside the library by the study tables.\n63-Chihiro4.png\n: Hello there, Makoto. Ehehe...how nice to see you here.\n> Spend some time with Chihiro\n75-Chihiro2.png\n: Eheh...yay! I really like talking to you.\nI spent some time talking with Chihiro... Chihiro and I grew a little closer today.\n> Yes, definitely\nBlueberry Perfume:\nVery popular with men these days. But to be honest, although it does attract the ladies, most guys hate the smell...\n65-Chihiro3.png\n: Ooh, it's really amazing! I'll take really good care of it. I'll hold on to it forever...\nSeeing Chihiro so pleased with something I gave her makes me happy!\n80-Chihiro14.png\n: No... No...!\n7-Makoto.png\n: What's wrong, Chihiro?\n32-Chihiro8.png\n: Ahh, it hurts...\n7-Makoto.png\n: Huh? Did you get hurt, Chihiro?\n83-Chihiro.png\n: Oh, well...not really. I\ngot bit by a mosquito\nlast night.\n7-Makoto.png\n: A mosquito? Oh, I figured something serious had happened, since you were saying how it hurt.\n84-Chihiro5.png\n: Oh, did I give you the wrong impression...? S-Sorry...!\n7-Makoto.png\n: You don't have to apologize. It was my own fault. But you said it hurts? Did it really bite you that hard?\n32-Chihiro8.png\n: Yeah, see? Look.\nShe held out her arm. The huge red bump stood out clearly against her pale skin.\n7-Makoto.png\n: Holy cow!\n84-Chihiro5.png\n: It's way past itchy now. It really hurts...!\n7-Makoto.png\n: But why's it so big? Did it bite you while you were sleeping or something?\n83-Chihiro.png\n: Oh, no. I was awake.\n7-Makoto.png\n: But you didn't notice?\n80-Chihiro14.png\n: No, I noticed. But...\n7-Makoto.png\n: But what?\n87-100MileJunkFoodDash.png\n57-Chihiro13.png\n: Well, I felt it bite me, and I looked down at it. But I didn't do anything. I just sat there and watched it suck my blood...\n7-Makoto.png\n: You just watched? Why didn't you smack it?\n83-Chihiro.png\n: Cuz...that would've killed it, right?\n7-Makoto.png\n: Well yeah, but...\n57-Chihiro13.png\n: It must have been really hungry to suck that much blood. If it was that hungry, it would've been really sad not to let it have anything.\n7-Makoto.png\n: But...it's just a mosquito.\n32-Chihiro8.png\n: Mosquitos are living things too, though. It might have its own mosquito family... S-Sorry, I know that's dumb...\n7-Makoto.png\n: No, really, you don't have to apologize. But don't go scratching it, okay? That'll just make things worse.\n84-Chihiro5.png\n: But what if it gets so itchy I can't take it?\n7-Makoto.png\n: Well...in that case, just take the tip of your fingernail and push it into the bump. That'll help.\n89-Chihiro7.png\n: Wow, I had no idea...!\n75-Chihiro2.png\n: You're so smart, Makoto!\nAs she said that, she smiled like a tiny, cute little animal. I wonder if she does that on purpose... If so, that's a whole other level of scary.\n70-BeautifulDays.png\n57-Chihiro13.png\n: But anyway, don't you think it's kinda strange?\n7-Makoto.png\n: Huh? What is?\n80-Chihiro14.png\n: Well this school is completely sealed off, right? So how'd a mosquito get in? Maybe there's somewhere here in the school where bugs can live and grow. Some kind of...nature-y spot.\nA \"nature-y\" place in the school...? Well, I can't say for sure that there's not.\n75-Chihiro2.png\n: Or or or! Maybe there's a secret passage somewhere that leads out of the school!\nA secret passage...\n7-Makoto.png\n: Well, even if there's not, I'm sure we'll get out of here somehow. As long as\nwe all work together\n, I'm sure we'll be out of here in no time.\n63-Chihiro4.png\n: You're right! Working together is super important...\n32-Chihiro8.png\n: Of course, I dunno how I can be useful. I'll probably just weigh you all down...\n7-Makoto.png\n: That's not true! It makes me feel way better knowing you're here to help!\n45-Chihiro10.png\n: It does? Really...?\n7-Makoto.png\n: Yup! So let's all do our best, okay?\n53-Chihiro12.png\n: O-Okay! Eheh... Thank you, Makoto.\n94-Tutorial.png\n: Chihiro's\nReport Card\nhas been updated based on your experience with her. Your maximum number of\nSkill Points\nhas increased! Hey, look at you go!\nOnce we were all done, I headed back to my room for a little while...\nThere's still time left in the day. I don't feel like just sitting here. Maybe I'll go explore.\n9-Narration.png\n: Next time, one more Free Time event and then back to the plot.\n2-BeautifulDays.png\n3-Narration.png\n: Once again, we're going to go see Chihiro.\n3-Narration.png\n: She's in the laundry room this time.\n6-Chihiro.png\n: What's wrong? Did you need something?\n> Spend some time with Chihiro\n9-Chihiro4.png\n: You want to sit down and talk for a while?\nI spent some time talking with Chihiro... Chihiro and I grew a little closer today.\n> Yes, definitely\nTips & Tips:\nA thick book that has hints and codes for every game ever released. A must-have for any true gaming fanatic.\n13-Chihiro2.png\n: Huh? A present...? Yaay! Thank you so much!\nSeeing Chihiro so pleased with something I gave her makes me happy!\n15-Chihiro8.png\n: *Sigh*\n16-Makoto.png\n: What's wrong? That seemed like a pretty heavy sigh...\n18-Chihiro13.png\n: Oh, sorry... It's just, everyone else is working so hard to get us out of here, but I'm no help at all.\n16-Makoto.png\n: Th-That's not true at all!\n15-Chihiro8.png\n: It's okay, you don't have to try and make me feel better. I know it's the truth. I'm completely useless without a computer in front of me... At least if I were a little stronger or something, then I'd be able to help somehow...\n16-Makoto.png\n: Listen, you'll get your chance. I'm sure there'll be a time when your skills will come in handy. So you don't have to worry so much, okay?\n6-Chihiro.png\n: My skills might...come in handy?\n13-Chihiro2.png\n: If I get a chance, I'm gonna work super hard to chip in! When it comes to\ncomputers\n, you can count on me!\nYou're right about that. No matter what anyone might say, you're still the\nUltimate Programmer\n!\n16-Makoto.png\n: Speaking of which, how did you get into programming?\n21-Chihiro5.png\n: Huh...?\n16-Makoto.png\n: Well, I mean...I always assumed most programmers were guys, so...\n23-Chihiro10.png\n: ...Is it really that weird...?\n16-Makoto.png\n: N-No, nothing like that! I was just curious what got you interested in it. I mean, why programming of all things?\n24-DeathWishNoIntro.png\n18-Chihiro13.png\n:\nWhy\n...? I mean, there isn't much of a reason. I've always been kind of weak, ya know. I was never able to run around with my friends or anything... We had a computer at home, so I'd kill time poking around with it. And I found out I really liked it!\n26-Chihiro14.png\n: My dad was a software engineer, and he had a bunch of programs on there that he'd built. I found one of them and started playing around with it, adding stuff here and there... And that was how I ended up making my very first program.\n16-Makoto.png\n: Interesting... What kind of program was it?\n6-Chihiro.png\n: A kind of\ndatabase software\n...\n16-Makoto.png\n: Database software...\n18-Chihiro13.png\n: A user could communicate with it, and it would take that information and find what they were looking for. It was a way of interacting with the computer without having to physically type things out.\nShe said it could understand the user without them having to type things out... So that would have to be...\n> Voice recognition\n16-Makoto.png\n: You used voice recognition, is that it?\n13-Chihiro2.png\n: Yup, exactly! You could talk to it, and it could actually talk back. It was a lot of fun! It didn't even really sound like me! I would get totally absorbed in talking to it...\nIt's like a kid recording themselves and playing it back again...\n18-Chihiro13.png\n: The key part of the program was getting it to recognize what I was saying. The recognition accuracy was the most important thing. Japanese is kinda hard, so it was pretty challenging.\n16-Makoto.png\n: But you were able to do it eventually?\n6-Chihiro.png\n: Yup! And right around then my dad found out I'd messed with his software without permission. I thought I was gonna get in so much trouble...\n13-Chihiro2.png\n: But all he said was how\nimpressed\nhe was! The software was able to take natural speech and pull out key search terms to retrieve information. My dad said it worked so well, it was gonna change the face of software interaction all over the world!\n29-Chihiro3.png\n: The development costs are still pretty expensive, so it hasn't spread that much yet, but... Anyway, I've been addicted to programming ever since...\n9-Chihiro4.png\n: I can't tell you how happy it made me to be able to make others happy!\nIt's obvious how much you love computers. You seem to just...light up when you start talking about them.\n21-Chihiro5.png\n: Ah! Sorry, I spent all this time just talking about myself...\n16-Makoto.png\n: No, I had a lot of fun learning more about you!\n31-Chihiro7.png\n: Huh? Really...?\n16-Makoto.png\n: Yup! I hope you'll tell me even more next time.\n9-Chihiro4.png\n:  O-Okay! Let's hand out again sometime! It's a promise, okay?\n34-Tutorial.png\n: Chihiro's\nReport Card\nhas been updated based on your experience with her. You just unlocked the skill\nAlgorithm\n! Give yourself a pat on the back. You've earned it!\n3-Narration.png\n: Algorithm is a very useful skill that works in the Nonstop Debates. It affects a mechanic we haven't encountered yet so when we do finally come across it I'll explain the skill more in depth.\nI parted ways with Chihiro, and went back to my room.\n37-WelcometoDespair.png\n...I guess I'm feeling a little hungry. I'd better get something to eat before it's nighttime.\n16-Makoto.png\n: I should head to the dining hall then, I guess.\nI just wanted to get something to eat. And now I'm about to get roped into something like this... Actually, no...I guess I'm *already* roped in.\n40-BoysLifeofDespair.png\n42-Taka7.png\n: Hey, Makoto! Perfect timing!\n16-Makoto.png\n: Huh? What's going on?\n43-Mondo8.png\n: I have a favor to ask!\nA favor? I have a bad feeling about this...\n45-Mondo2.png\n: C'mon, Makoto. You gotta be our\n[witness]\n!\n> witness\n16-Makoto.png\n:\nWitness\nto what...?\n47-Mondo5.png\n: This guy's been talkin' shit about me since day one. Callin' me a coward and shit like that...\n42-Taka7.png\n: You *are* a coward! That's why you turn to violence to solve your problems!\n48-Taka9.png\n: That's why you can't do what society asks of you, why you walk around dressed like that!\n49-Mondo17.png\n: ...The fuck you say? You dunno shit.\n51-Taka8.png\n: You've already lost to yourself, but you're such a coward you don't even realize it!\n52-Mondo9.png\n: So what, you sayin' you're *not* a coward? You think you're tougher than me?\n42-Taka7.png\n: I *know* I am!\n47-Mondo5.png\n: Okay, then let's\nthrow down\n. Prove you got what I don't got!\n48-Taka9.png\n: I accept your challenge!\n47-Mondo5.png\n: So that's what's happening', Makoto. You gotta be our witness!\n16-Makoto.png\n: You're gonna...throw down? You're not gonna like...start punching each other, are you?\n55-Mondo3.png\n: There's a bathhouse on the 1st floor of the dorm, right? With a sauna inside?\n56-Taka18.png\n: I see...a simple endurance contest, is it?\n51-Taka8.png\n: We're going to see\nwho can stay in the sauna the longest\n, am I right!?\n58-Mondo6.png\n: Goddamn straight!\n61-100MileJunkFoodDash.png\n16-Makoto.png\n: A-Are you guys really gonna go through with this?\n47-Mondo5.png\n: Shit yeah!\n48-Taka9.png\n: He'll be done in a matter of minutes, anyway. People like him are, without exception, all talk!\n63-Mondo7.png\n: Bring! It! On! Hell, let's\nmake things interesting\n. Wouldn't wanna win without a challenge, right?\n16-Makoto.png\n: Interesting...?\n58-Mondo6.png\n: We're gonna battle\nwith all our clothes on\n!\n64-Taka13.png\n: Th-That's idiotic! Suicidal!\n63-Mondo7.png\n: What, you afraid?\n66-Taka4.png\n: Y-You're going to regret this!\n58-Mondo6.png\n: Shut up and let's do this!\n68-Sauna1.png\n69-Taka22.png\n: H-Hey, Mondo...\n70-Mondo20.png\n: What, asshole?\n69-Taka22.png\n: You can take off your uniform, ya know. Go ahead, I won't judge.\n70-Mondo20.png\n: And you can shut the fuck up and mind your own business. I mean, look at you. Your face is all red. What're you, one of those goddamn hot spring monkeys?\n69-Taka22.png\n: I-It just so happens...I was born with a red face...!\n70-Mondo20.png\n: You don't have to act all big, man.\n69-Taka22.png\n: A-Act, you say? Hahaha! I'm still plenty good to go! I'm so good, I could eat a steaming-hot bowl of soup right now!\n16-Makoto.png\n: Are they...okay?\nI tried to push my concern aside. A few minutes passed... Then a few dozen minutes... Then an hour...\n73-Sauna2.png\n69-Taka22.png\n: D-Don't you think...it's about time...you gave up?\n70-Mondo20.png\n: What about you? You can't even hardly talk...dumbass.\n69-Taka22.png\n: Say wh-whatever you want...I'm still totally...good to go! In fact, I'm starting to feel...kinda cold!\n70-Mondo20.png\n: That's...prolly not good...\n16-Makoto.png\n: H-Hey, uh...guys? I know you both wanna prove how big of badasses you are, but...don't you think you've done enough?\n69-Taka22.png\n70-Mondo20.png\n: Shut up!\nGah...I just can't win.\n*Ding dong, bing bong*\n74-GoodNight.png\n77-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\n16-Makoto.png\n: ...Hey, did you hear that? It's nighttime. How about we call it a tie?\n78-Sauna3.png\n69-Taka22.png\n: In a true competition...there's no such thing as a tie! You win, or you lose. That's...the only thing that matters!\n70-Mondo20.png\n: Listen to you...you son of a bitch...! Then bring it on...! I'll...I'll push you right up to the gates of hell!\nThe gates of hell...!? That's not a good place to push someone!\n16-Makoto.png\n: Th-This isn't good, guys...\n70-Mondo20.png\n: Yeah, you hear him? Better crawl on back...to your room...! I'll let you know how it went...in the morning! Then you can start spreading my...my legend...!\n69-Taka22.png\n: Come tomorrow morning...you'll fall down in front of me..down on your knees. I'll show you where to do it...!\n70-Mondo20.png\n: Big talk from someone...whose face is about to explode...!\n69-Taka22.png\n: Right back a-at ya!\n16-Makoto.png\n: ...Okay, well...g'night then.\nI really hope those two don't overdo it... But I'm sure... To the death? No, surely they wouldn't go that far...\nThe concern stayed with me as I slowly succumbed to sleep.\n82-MrMonokumasLesson.png\n84-MonokumaTheater.png\n: If fate does exist...does that mean your future is decided the moment you're born? If all your yesterdays pile up to create your tomorrow is your future as final as your past? I just don't know. That's why I'm still alive--because I don't know. That's why I desperately cling to life!\n*Ding dong, bing bong*\n2-GoodMorning.png\n5-MonokumaTV.png\n: Good morning, everyone! It is now 7 a.m. and nighttime is officially over! Time to rise and shine! Get ready to greet another beee-yutiful day!\n7-BeautifulMorning.png\n8-Makoto.png\n: Morning, huh? I hope Mondo and Taka survived...\nWorried about the two of them, I hurried to the dining hall more quickly than usual. And when I entered...\n11-Mondo4.png\n: Bahahaha! What are you talkin' about, bro?\n13-Taka3.png\n: Kahahaha! What are YOU talkin' about, bro!?\n8-Makoto.png\n: What...the...?\n11-Mondo4.png\n: Hey, Makoto!\n13-Taka3.png\n: Thank you so much for acting as our witness yesterday!\n8-Makoto.png\n: Huh? Are they...friends now?\n15-Hina23.png\n: They've been like this all morning. They were all buddy-buddy as soon as they walked in. It feels gross.\n16-Mondo5.png\n: Feels gross? Hell no. Feels *great*, more like!\n17-Hina12.png\n: This almost feels like sexual harassment, somehow...\n19-Taka18.png\n: Forget her, bro. A girl like her just doesn't get our\nmanly bond\n!\n20-Taka8.png\n: Friendship between men is stronger than blood! A woman could never understand!\n11-Mondo4.png\n: What you just said? Bro, that was cool as shit! I should get a tattoo of it!\n13-Taka3.png\n: No, bro, you mustn't! Your body is a temple, given to you by your loving parents!\n8-Makoto.png\n: So, um...who won the contest?\n22-Mondo6.png\n: Who gives a shit!?\n24-Taka9.png\n: Yeah, don't ask stupid questions! What matters is that we both took part in it together!\n8-Makoto.png\n: That's...completely different from what you were saying last night.\n26-Sakura4.png\n: Friendship between men seems very...simplistic. Nothing like what I'm used to with girls.\n15-Hina23.png\n: Yeah, for real...\nAll throughout breakfast that morning the room was dominated by Mondo and Taka's overpowering \"brotherhood\"... All in all, it was a pretty unfortunate experience.\n29-BeautifulDeath.png\n8-Makoto.png\n: So, what should I do today?\n*Ding dong*\nHmm? Who could that be? Wondering who had come to visit, I opened the door, and someone forced their way in.\n8-Makoto.png\n: T-Toko? What's the matter?\n32-Toko2.png\n: Why are you s-so surprised? Am I really that an-noying?\n33-Toko4.png\n: W-Well I already know I'm annoying. I came here kn-knowing that, so...that makes it o-okay...\n8-Makoto.png\n: No, you're not annoying... I just wondered what was going on.\n33-Toko4.png\n: I have a f-f-favor to ask... I want you to\n[g-go somewhere with me]\n...\n> g-go somewhere with me\n8-Makoto.png\n: And...where is it you want to go?\n35-Toko.png\n: W-Well...the\nlibrary\n.\n8-Makoto.png\n: Huh? Are you looking for a book or something? Why don't you just ask Byakuya? He spends all his time in the library, anyway.\n37-Toko7.png\n: Kh--!\n8-Makoto.png\n: D-Did I say something wrong...?\n39-Toko12.png\n: You're not a b-b-blabbermouth, right? This h-has to be a secret!\n8-Makoto.png\n: I honestly have no idea what you're talking about, but if you want me to be quiet, I'll be quiet.\n41-Toko13.png\n: Then let's g-go to the\nlibrary\n!\n8-Makoto.png\n: Okay, I got it, the library...\nJeez, why so pushy?\n43-Toko5.png\n: Qu-Quiet! Be quiet when you g-go in! ...Don't l-let him see you!\nShe actually *was* starting to get annoying, but I did what she said and gently crept into the library.\nUnsurprisingly, Byakuya was there by himself, absorbed in a book.\n45-100MileJunkFoodDash.png\n(BG Music)\n46-InTheLibrary2.png\n(Conversation)\n47-Toko3.png\n: H-He's here... Ahaha...she's r-really here. Okay, M-Makoto. Go talk to him!\n8-Makoto.png\n: What!?\n43-Toko5.png\n: Stop b-being so loud! Just hurry up and g-go talk to him!\n8-Makoto.png\n: *You* go talk to him, if you want to so bad...!\n43-Toko5.png\n: I c-can't! I don't want to i-interrupt him...!\nThat's...kinda crazy.\n50-Byakuya.png\n: ...\nHe seems to really be focused on that book. It doesn't seem like the best time to talk to him...\n50-Byakuya.png\n: Hey, you. What are you doing back here? I hate even having to look at you.\n8-Makoto.png\n: Ah--so you noticed me, huh?\n50-Byakuya.png\n: ...Of course. Now hurry up and leave.\n52-Byakuya2.png\n: And take her with you.\n35-Toko.png\n: ...\n32-Toko2.png\n: Hey, um...Byakuya?\n50-Byakuya.png\n: ...\n54-Toko10.png\n: Remember how you said, \"\nDon't be a woman who dominates w-weak men. Be a woman dominated by a s-strong man\n\"?\n50-Byakuya.png\n: I never said that.\n54-Toko10.png\n: W-Well, actually, I just thought it sounded like s-something you *might* say...\n56-Byakuya15.png\n: ...Get out. And go take a bath. You smell.\n37-Toko7.png\n: Ngh--!\n57-Byakuya5.png\n: Don't make me say it again. Go now, before your stench latches onto the entire room.\n33-Toko4.png\n: O-Okay...\n59-Toko9.png\n: ...\n8-Makoto.png\n: He really dug into us there. Maybe he's in a bad mood...\n59-Toko9.png\n: ...\nShe seems super depressed. Did he really upset her that much?\n59-Toko9.png\n: Byakuya... To go that far...\n61-Toko11.png\n: He must be r-really concerned about me!\n8-Makoto.png\n: ...Huh?\n61-Toko11.png\n: He told me t-to take a bath and everything. He must really care a-about my well-being!\n8-Makoto.png\n: ...\n54-Toko10.png\n: Hey, M-Makoto...what do you think?\n8-Makoto.png\n: Think...about what?\n54-Toko10.png\n: Do you think B-Byakuya and I would be...g-good together?\n8-Makoto.png\n: Um, well now...I-I don't really know.\n35-Toko.png\n: That's t-true. There's really no w-way to know...\n61-Toko11.png\n: But the distance between u-us doesn't change out love...! Because as soon as you realize your f-feelings the love is born. That's h-how love works!\n8-Makoto.png\n: O...kay.\n54-Toko10.png\n: There m-might come a day when y-you understand. Maybe. S-Someday. Well...bye. *leaves*\n8-Makoto.png\n: ...\n65-MrMonokumasLesson.png\n66-Monokuma4.png\n: Ahh, young love!\n8-Makoto.png\n: Uwah!\n67-Monokuma13.png\n: Who would've ever guessed she would go for someone like him?\n68-Monokuma12.png\n: But eager passion can also be scary! Sometimes that leads people off in the wrong direction!\n70-Monokuma5.png\n: Nyooohohohoho! *leaves*\n8-Makoto.png\n: ...All of a sudden, I feel exhausted. Maybe I'll head back to my room for now.\n73-BeautifulDays.png\n8-Makoto.png\n: There's still some time left in the day. What to do...?\n75-Narration.png\n: There's one more Free Time allowed in the day. I tried speaking to Byakuya but he's too absorbed in his book to even trigger an event at all so once again, we're gonna talk to Mondo. He's just too much fun.\n75-Narration.png\n: We can find him in the dining hall.\n11-Mondo4.png\n: Hey, Makoto! What's up?\n> Spend some time with Mondo\n80-Mondo13.png\n: You're kinda weird, ya know that? You ain't afraid of me, all wantin' to hang out... Well, whatever. You wanna go get somethin' to drink?\nMondo and I went to the dining hall and had some tea. Mondo and I grew a little closer today.\n> Yes, definitely\nFresh Bindings:\nStrips of cotton cloth. They were once commonly used for underwear and bandages. They say when you wrap it around yourself, both body and soul become taut.\n84-Mondo11.png\n: Damn, seriously!? This thing is like, super rare!\n11-Mondo4.png\n: Don't mind if I do! Damn, I'm lucky as shit...!\nSeeing Mondo so pleased with something I gave him makes me happy!\n86-DespairSyndrome2.png\n87-Mondo.png\n: Hey, Makoto... Listen, there's somethin' I gotta ask you...\n8-Makoto.png\n: Wh-What is it? You sound really serious...\n88-Mondo2.png\n: Just shut up and listen.\n45-100MileJunkFoodDash.png\n88-Mondo2.png\n: So...are you a dog person or a cat person?\n8-Makoto.png\n: ...Huh?\n22-Mondo6.png\n: Just tell me before I beat the shit outta you! I'm a\ndog person\n, by the way! So what are you!? C'mon, tell me!\nAm I a dog person, or a cat person? Well Mondo's a dog person, so...\n> Dog person\n75-Narration.png\n: (I'm really curious what the bear person answer gives, though getting a wrong answer just makes you select again.)\n8-Makoto.png\n: I-I'm kind of a dog person, too...\n16-Mondo5.png\n: Really? You're not just sayin' that, right!?\n8-Makoto.png\n: N-No, it's true! Actually I grew up with a dog in the house. It was a mutt, but it was still pretty cute.\n11-Mondo4.png\n: Right!? Cats are okay, but dogs are WAY cuter! So, how old is your dog?\n8-Makoto.png\n: Oh, uh... Well, we had it when I was a kid. It's...dead now.\n93-Mondo17.png\n: O-Oh... I know how that feels man... It's tough to lose a dog you love so much. I totally know how you feel!\n8-Makoto.png\n: So you used to have a dog, too?\n87-Mondo.png\n: Yeah, Chuck. A maltese. He died when he was nine...\nA maltese? I figured Mondo would be more of a pitbull guy, or a doberman...\n80-Mondo13.png\n: He was so smart, man. He'd bring in the newspaper every morning.\n8-Makoto.png\n: Really? That's so cool!\n11-Mondo4.png\n: Right? And then he'd beg me to take him for a walk. He'd look up at me with those eyes of his, and wiggle that little butt...\n93-Mondo17.png\n: Gah! I don't wanna remember this shit! Ugh...this seriously sucks! Don't look at me right now!\n97-Mondo15.png\n: Ah, god dammit...! I gotta go! Ngaaah...! Chuck! My baby boy! *leaves*\nMondo left in a state I'd never seen him in before...\n8-Makoto.png\n: I had no idea he\nloved dogs that much\n...\nI feel like I've learned a little more about him today.\n75-Narration.png\n: This event gives us the skill\nUpshift\n. It's the counterpart to Downshift that I mentioned. It increases the cursor movement speed during Nonstop Debates, Hangman's Gambit and the Closing Argument. It's way more handy than Downshift because being able to move the cursor faster helps out when future mechanics are introduced to the Nonstop Debate.\nOnce we were all done, I headed back to my room for a little while...\n♪\nNo Music.\n♪\n100-SchoolAnnouncement.png\n*Ding dong, bing bong*\n5-MonokumaTV.png\n: Ahem! School announcement, school announcement. Nighttime is quickly approaching, but before it arrives... All students, please gather in the\ngym\nimmediately. Emergency! Emergency!\n103-Makoto2.png\n: Gather in the gym...? Why now all of a sudden? ...\nI really don't like the sound of this... I have a terrible feeling...\n2-DespairSyndrome1.png\n3-Narration.png\n: We've been instructed to meet in the gym. Before we go however there are still a few stragglers in the halls.\n5-Makoto2.png\n: Oh, Kyoko! Did you hear the announcement just now?\n6-Kyoko2.png\n: Yes...\n5-Makoto2.png\n: I don't want to go, but...we don't have any other choice, right?\n7-Kyoko17.png\n: I can't imagine it's going to be good news. But it's not a good idea to defy him here and now...\n8-Kyoko19.png\n: So I'm going on ahead. *leaves*\nI can't really do anything except what Monokuma tells me...\n11-Mondo.png\n: Hey, man. You about to head in?\n5-Makoto2.png\n: Yeah. Has everyone already gone on ahead?\n12-Mondo2.png\n: Looks that way. I don't like it, but nothing good's gonna come from ignoring that goddamn bear.\n5-Makoto2.png\n: Um, Mondo...? Are you sure you're okay? You kinda went all-out in that sauna...\n14-Mondo5.png\n: Huh? Who went all-out? That shit doesn't even faze me!\n15-Mondo12.png\n: But ya know...\n17-Mondo4.png\n: There at the edge of hell...a promise between men was waiting for me. Never saw it comin'...\n18-Mondo16.png\n: Anyway! Let's get out asses into the gym. *leaves*\nMan, something...unique must've happened between the two of them.\n3-Narration.png\n: In the gym lobby, Hifumi has yet to work up the courage to go in.\n5-Makoto2.png\n: Hey, Hifumi. How come you haven't gone in yet?\n21-Hifumi10.png\n: Huwayah!?\n22-Hifumi12.png\n: Mr. Naegi! Don't scare me like that!\n5-Makoto2.png\n: S-Sorry... But we really should go inside.\n24-Hifumi18.png\n: No, don't go... You can't go!\n25-Hifumi5.png\n: That's what my ghost friend is telling me...\n5-Makoto2.png\n: I don't feel good about it either, but...we can't just ignore this.\n22-Hifumi12.png\n: Damn...that's true, too!\n27-Hifumi19.png\n: I guess we have no choice... *leaves*\nI have to go, too.\n30-Taka16.png\n: Hmm... Asking us to gather together all of a sudden like this... What could he possibly want?\n31-Celeste2.png\n: Indeed. What might await us this time?\n32-Byakuya3.png\n: Hmhmhm. He keeps things interesting, that's for certain.\n34-Hifumi2.png\n: How is that funny? Can't you smile like a normal person once in a while? Like how the housewife on a classic TV show smiles at the end of an episode?\n35-Hina16.png\n: There's something totally messed up with you if you can laugh at a time like this!\n37-Byakuya7.png\n: Which of us is *actually* \"messed up,\" hmm?\n38-Hina9.png\n: Wh-What's that supposed to mean...?\n39-Byakuya.png\n: Nothing in particular. Just admiring, that's all. I don't want to kill anyone. But I also don't want to stay here, living in blind denial day after day.\n32-Byakuya3.png\n: I was just admiring how you could live like that and still keep your sanity.\n35-Hina16.png\n: I'm not in denial...\n32-Byakuya3.png\n: That reminds me. Remember how you kept talking about how the\npolice\nor whoever would come help us? How'd that turn out? It seems to me there's no sign whatsoever of possible rescue.\n38-Hina9.png\n: Th-That's just...\n41-Hina10.png\n: ...I wonder what actually happened.\n43-Kyoko12.png\n: It's strange, that's true. There's no way the police wouldn't know about it. We're right in the middle of a major urban area.\n44-Hifumi14.png\n: The police suck!\n45-Celeste7.png\n: On the contrary, the mastermind may be just that powerful, to take control even of the police...\n47-DespairSyndrome2.png\n48-Hiro12.png\n: Oh! This might not be related, but--\n49-Toko4.png\n: Then don't say it.\n50-Hiro2.png\n: Nope, gonna say it!\n48-Hiro12.png\n: It's about last night. I was near the\nmain hall\njust staring off into space. When all of a sudden, I\nheard it\n.\n51-Chihiro5.png\n: You heard what?\n48-Hiro12.png\n: A sound that... I don't really know what it was...\n52-Taka2.png\n: Wh-What kind of sound?\n50-Hiro2.png\n: Well like I said, I don't really know. But if I *had* to describe it...\n48-Hiro12.png\n: ...it was like...a\nconstruction site\n, I guess?\n5-Makoto2.png\n: A construction site?\n48-Hiro12.png\n: I mean, I could just be making that up. I only just barely heard anything...\n54-Toko.png\n: Then you d-definitely made it up. M-Must've just been the sound of the ocean in th-that head of your...\n♪\nMusic cuts out.\n♪\n???: Say what!? Whatchoo talkin' about, Toko!?\n57-MrMonokumasLesson.png\n58-Kyoko7.png\n: He's arrived...\n60-Monokuma12.png\n: What Hiro heard wasn't the sound of construction...but it *could* have been an\nexplosion\n!\n5-Makoto2.png\n: Huh?\n60-Monokuma12.png\n: Or maybe a\nmachine gun\n! Puhuhu... That can kinda sound like construction in a way!\n5-Makoto2.png\n: What are you talking about...?\n62-Monokuma4.png\n: Ah-ah-ah! Beyond this point my mouth is zipped, my lips are sealed, I am fully puckered! It's a secret little secret!\n63-Kyoko13.png\n: Fine, then let's move on to what you *can* tell us. Why did you call us all here?\n65-Monokuma11.png\n: You don't beat around the ol' bush, do ya!? Ready for me to get to the point, huh?\n66-Monokuma13.png\n: But before that, you mind if I vent a little?\n68-Monokuma9.png\n: I'm low on energy these days. My stitching's even losing all its shine and luster... I'm thinking, it's probably because of this ho-hum, boring old everyday life.\n69-Monokuma2.png\n: I'm looking for something with a little more stimulation, something rife with danger and intrigue!\n70-Monokuma.png\n: Listen, can I just be frank?\n72-MrMonokumaAfterClass.png\n73-Monokuma6.png\n: The next blackened hasn't shown up yet, and I'm getting booooored!\n70-Monokuma.png\n: So, I've decided to come up with a new way to\nmotivate\nyou!\n5-Makoto2.png\n: M-Motivate...!? Is it another set of videos or something...?\n74-FlashT.png\n76-FlashB.png\n5-Makoto2.png\n: Are you gonna show us some demented thing to try and drive us all to murder!?\n69-Monokuma2.png\n: Drive you to murder!? What a mean thing to say! Just awful!\n78-Taka8.png\n: I don't know what you've got planned, but we're not going to kill each other anymore!\n79-Taka9.png\n: No matter what you do, I swear to God we won't!\n62-Monokuma4.png\n: Hmm. That's very big talk. Do your best to back it up, okay? Now then, with your permission, let me begin! So this time it's...\n81-Monokuma7.png\n: ...\nembarrassing memories and secrets\n! As long as you're alive, it's a given that there's things you don't want other people to know about you!\n82-Monokuma5.png\n: So I did a little investigating of my own, and I dug up some of your\ndarkest secrets\n!\n84-Monokuma23.png\n: And those embarrassing memories and secrets are all contained in the\nenvelopes\nI have right here... I'm going to hand them out now, so take a second to take a peek!\nAs Monokuma spoke, he tossed the envelopes at our feet. I quickly snatched the envelope with my name written on it. I nervously pulled out what was written inside...and my entire body suddenly went rigid.\n\"Makoto wet the bed until he was in the 5th grade.\"\n5-Makoto2.png\n: What...!?\n87-Hina12.png\n: H-How...?\n88-Taka12.png\n: How'd you find out about this!?\nEveryone started talking at once.\n82-Monokuma5.png\n: You have\n24 hours\n! If someone doesn't become blackened by then...all your deepest, darkest, most embarrassingest secrets will be\nexposed to the world\n! Maybe I'll roll by a crowded intersection in a van strapped with loudspeakers and spill the beans!\n81-Monokuma7.png\n: Kyaaah! Wouldn't that be sooo embarrassing!?\n5-Makoto2.png\n: ...So that's what you meant by \"\nmotivate\n\"?\n62-Monokuma4.png\n: Yup, you got it! They're all pretty unpleasant, trust me. None of you want me to reveal that stuff, right?\n5-Makoto2.png\n: It's definitely something I'd rather people not know, but...\n♪\nMusic cuts out.\n♪\n5-Makoto2.png\n: We'd never kill over something like that!\n69-Monokuma2.png\n: Wh-What'd you say!?\n91-Taka7.png\n: He's right! Your plan is doomed to fail! No one's gonna murder someone for this kind of thing!\n93-BeautifulDeath.png\n94-Monokuma8.png\n: O-Oh no... Is it because...for better or for worse, your memory is still a way to connect to the outside world? I have stuff I wouldn't want anyone to know no matter what, so I assumed you'd all be the same... Which is why I put so much effort into preparing this next motive!\n68-Monokuma9.png\n: Maaan! You're saying you really won't kill each other over this stuff? That just sucks! ...Well, what can ya do? Okay, then in 24 hours, I'll expose all you secrets just to make myself feel a little better!\n94-Monokuma8.png\n: So sad, so depressed! Farenotwell...! *leaves*\nWith an almost convincing look of depressed dejection on his face, Monokuma receded into the gym's depths.\n38-Hina9.png\n: I didn't know what to expect at first, but...maybe we dodged a bullet on this one.\n96-Hina2.png\n: I mean yeah, having those secrets revealed is gonna be totally embarrassing. But that's seriously not enough to give someone a reason to kill, right?\n98-Taka15.png\n: Good news, everyone! I have a brilliant idea!\n91-Taka7.png\n: Why don't we all just confess the\nsecrets\nin those envelopes right here and now!?\n99-Taka18.png\n: If we do that, any and all motive for murder will vanish! That's pretty smart, right!?\n91-Taka7.png\n: Okay, so my embarrassing thing is...\n49-Toko4.png\n: I d-don't want to hear your stupid s-story!\n101-Taka13.png\n: What!?\n102-Toko12.png\n: Besides, I don't...I don't w-want to talk about it... I don't c-care what anyone says, I don't want to talk a-about mine!\n104-Celeste5.png\n: Neither do I. Not because it is unpleasant, but because it is impossible.\n25-Hifumi5.png\n: Well it's just human nature to wanna hear it when you say it's impossible! C'mon, it'll be good for ya!\n105-Celeste15.png\n: Absolutely not.\n107-Hifumi15.png\n: It's okay, just a little bit. C'mon c'mon c'mon...!\n104-Celeste5.png\n: As I said--\n107-Hifumi15.png\n: C'mon c'mon c'mon c'mon c'mon!\n109-Celeste10.png\n: I said I don't wanna talk about it, you human bag of lard!\n110-Hifumi11.png\n: Kyaaah!\n39-Byakuya.png\n: I agree with them. There's no need to discuss it.\n112-Taka11.png\n: What do you think, Chihiro?\n113-Chihiro8.png\n: Um...s-sorry, I don't really want to talk about it right now.\n115-Chihiro10.png\n: But I also don't want to leave things the way they are. So maybe I can talk about it later... After I try my best...to become strong... Then I can tell everyone.\n38-Hina9.png\n: If you don't wanna talk, you don't have to. I'm not super-excited to talk about it, either...\n117-Mondo15.png\n: If everyone's that much against it... Even if my bro's the one that suggested it, I gotta say no.\n30-Taka16.png\n: W-Well, that's okay, then. Either way, if it's just a few secrets, I'm sure nobody's about to kill anybody over it.\nI hope you're right... A secret so bad you'd kill someone to keep it... Nobody's got something like that, right?\n52-Taka2.png\n: Okay, I'll stop with all the secret talk. But...\n78-Taka8.png\n: Each of us has 24 hours to get ready! Having our secrets exposed isn't going to be fun, but it's not like we're gonna die cuz of it!\n112-Taka11.png\n: So, you know, um... Don't do anything hasty!\n34-Hifumi2.png\n: The way you keep repeating it kinda makes me worry even more...\n120-Taka17.png\n: Oh... Uh, okay, sorry. I know it's gonna be tough, but...\n121-GoodNight.png\n*Ding dong, bing bong*\n124-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\n126-Hiro4.png\n: Nighttime already, huh? Okay, let's all call it a day.\n127-Sakura.png\n: Good idea. We need to prepare for tomorrow.\nI was left with an anxiety I just couldn't shake, but we left things as they were, and left things as they lay. One by one, we headed back to our rooms.\n130-AllStarApologies.png\nSecrets or memories\nyou don't want anyone to know about... A way to connect to the outside world... Honestly, all that crap Monokuma was spouting didn't have any effect on me. There's no way anyone would kill over stuff like that. At least, that's what I thought. But maybe I was just being optimistic. Which is probably why, without too much of a struggle...\n5-Makoto2.png\n: Jeez, I'm more tired than usual. Super tired today...\n...I fell asleep. But what I didn't know is that even then...a\ntragedy\nwas taking place.\n57-MrMonokumasLesson.png\n134-MonokumaTheater.png\n: Hey, do you have a second? I wanna confide in you... It's about the prevailing world attitude right now. The difference between passive and active. I mean... For example, it's the difference between like, \"Oops! I killed him,\" and, \"Yeah that's right. I killed him.\" Amazingly, there are tons of people who don't understand the difference. Can you believe it!? But there's a HUGE difference between \"Oops!\" and \"That's right.\" You know what I'm saying, right? Anyone can kill someone in the heat of the moment. But surprisingly few can do it with calculated intent. To make that choice, then put it into action, it's way harder than just letting your emotions lead you. It's all about preparation. Resolve. So maybe you're wondering, what's the point I'm trying to make? Well, I'm not totally sure myself. Maybe you should try reading between the lines.\n???: ...\n???: ...morn...ing.\n???: ...good...d...\n???: Goo..d...morning...\n3-Monokuma12.png\n: Good morning!\n4-Makoto2.png\n: Uwaaaaahh!\n6-MrMonokumasLesson.png\n7-Monokuma4.png\n: Upupu! Nice reaction! I'm glad to see you didn't disappoint!\n4-Makoto2.png\n: Wh-What...!? What are you doing here!?\n8-Monokuma10.png\n: I wanted to spice things up! So instead of a school announcement, I decided to wake you up in person!\n4-Makoto2.png\n: What the hell for!?\n7-Monokuma4.png\n: Because it's fun.\n10-Monokuma.png\n: And as long as I'm here, I figured I'd let you hear it right from the bear's mouth.\n4-Makoto2.png\n: Hear what?\n♪\nMusic cuts out.\n♪\n7-Monokuma4.png\n: Are you sure you should be acting this laid back? I mean, even though\nsomething happened\nto one of your buddy-buddy classmates?\n4-Makoto2.png\n: What...?\n12-MrMonokumaAfterClass.png\n13-Monokuma11.png\n: Wuhwuhwuh-what? Your face is all blue, like someone on the verge of death!\n4-Makoto2.png\n: What...what happened? What are you talking about!?\n7-Monokuma4.png\n: Puhuhu! That's for me to know, and you to find out! Good luuuck! *leaves*\nSomething's happened to someone... Is it...? Was it--!?\n4-Makoto2.png\n: No, it can't be... There's no way someone would...\nBut...what if...? No, \"what if\"s are pointless. Especially now, when...\n4-Makoto2.png\n: ...The dining hall. I need to get to the dining hall!\n16-DespairSyndrome2.png\n18-Hina9.png\n: Ah, Makoto!\n19-Hiro4.png\n: Are you okay?\n20-Sakura7.png\n: Did Monokuma talk to you, too?\n4-Makoto2.png\n: Hiro, Hina, Sakura, and...\n22-Byakuya.png\n: ...\n4-Makoto2.png\n: Byakuya... You're the only ones here? Where's everyone else?\n22-Byakuya.png\n: Either they're already off trying to verify what Monokuma said...\n23-Byakuya2.png\n: ...or they've fallen victim to the \"\nsomething\n\" that Monokuma mentioned.\n4-Makoto2.png\n: The...something?\n25-Sakura3.png\n: It can't be... Has it happened again? Murder...?\nAfter hearing what Monokuma had to say, the worst possibility forced its way into my mind... It took everything I had to drive that thought away.\n27-Hiro5.png\n: S-So if something really did happen... Does that mean someone did it cuz of what happened yesterday?\n28-Hina10.png\n: It can't be! That stuff was just a bunch of\nold memories\n!\n22-Byakuya.png\n: \"Just\" old memories? Don't be so sure about that. Clearly someone felt it was more important than that.\n4-Makoto2.png\n: Huh...?\n30-Byakuya7.png\n: To judge someone else's values based on your own outlook... Do you realize how dangerous that is?\n31-Hina16.png\n: Wh--? Why didn't you say something yesterday!?\n32-Byakuya3.png\n: Did you already forget? This isn't a co-op game. It's every man for himself.\n33-Byakuya4.png\n: What good does it do me to go out of my way to help you?\n31-Hina16.png\n: Stop saying that already!\n27-Hiro5.png\n: There's something wrong with him, for serious. Did he get brainwashed or something?\n35-Sakura4.png\n: That's not important. What matters right now is that we find out what happened...\n32-Byakuya3.png\n: She's right. Let's all split up and begin looking. Hmhm... The game is afoot.\n37-DespairSyndrome1.png\n38-Narration.png\n: We're given no directions where to search, so we may as well start with the 1st floor.\n38-Narration.png\n: Hina can be found searching outside the dorm hallway.\n41-Hina2.png\n: I knocked on all the doors, but nobody answered. Did they all go to see...what happened? ...Oh, then what about the 2nd floor of the school? That's the one place that's new to all of us, so it seems like the natural place for...\n38-Narration.png\n: If we check the Trash Room, we can find Sakura looking around.\n44-Sakura6.png\n: There doesn't appear to be anything here.\n4-Makoto2.png\n: What are you doing here, Sakura? Did you...find something?\n35-Sakura4.png\n: Oh, no. It's just that...what you said the other day must have been lurking in the back of my mind.\n4-Makoto2.png\n: Huh?\n44-Sakura6.png\n: If something has happened, the killer might try to use this to\ndestroy evidence\nagain. I suppose that was floating around my subconscious, and it led me here.\n38-Narration.png\n: Hiro's hanging out in the 1st floor hallways.\n27-Hiro5.png\n: Hey, Makoto... Honestly, what do you think?\n4-Makoto2.png\n: Huh? About what?\n47-Hiro12.png\n: About Byakuya. You think he'd being brainwashed or what?\n4-Makoto2.png\n: I-I dunno. You'd know more about that kinda thing than me, right?\n49-Hiro7.png\n: What!? What's that supposed to mean?\n4-Makoto2.png\n: Well, I mean...you're some kind of psychic, right?\n50-Hiro14.png\n: Listen, Makoto, I think you've completely misunderstood what it is I do. Okay? Listen, fortune-telling is like...\n52-Hiro16.png\n: It's totally different from brainwashing or hypnosis or any of that pseudoscientific bullcrap!\n50-Hiro14.png\n: I need you to understand that.\nSo you expect me to think fortune-telling *isn't* pseudoscience? Sorry, but I don't wanna get yelled at.\n38-Narration.png\n: Upstairs in the library, Byakuya has pretty much nothing useful to tell us.\n22-Byakuya.png\n: There's nothing here of interest, don't you agree? You should go look somewhere else.\n38-Narration.png\n: Thanks.\n38-Narration.png\n: The classrooms are all empty on both floors, as are the remainder of the 1st floor rooms. The only places left to check are the pool and locker rooms.\n38-Narration.png\n: Nothing immediately in the pool hallway, so let's move on to the locker room.\nHuh...? The door's open. But aren't these supposed to be locked...?\n*Ding dong, bing bong*\n60-MonokumaTV.png\n: For this\ninvestigation\n, I have unlocked the doors. Please look around to your heart's content!\n4-Makoto2.png\n: I-Investigation...?\n22-Byakuya.png\n: Just as I thought.\n16-DespairSyndrome2.png\n4-Makoto2.png\n: Byakuya--!\n32-Byakuya3.png\n: Judging from what he just said, there can be no doubt a\nmurder\nreally has taken place.\n4-Makoto2.png\n: C-Come on...!\n64-Byakuya9.png\n: And the locker rooms... They're suspicious. Very suspicious, indeed. Wouldn't you agree?\n4-Makoto2.png\n: Huh? Suspicious...?\n33-Byakuya4.png\n: It seems nobody's searched the locker rooms. Let's start with the\ngirls locker room\n...\nHe was muttering, as if talking only to himself.\nWithout waiting for a reply, he pressed his hand against the girls locker room door and the door swung open without a sound.\n♪\nMusic fades out.\n♪\nIn that moment, time seemed to freeze.\n../Smilies/emot-siren.gif\nCLICK HERE FOR VIDEO\n../Smilies/emot-siren.gif\n68-Makoto33.png\n: What...?\nI don't know how long it took for me to fully comprehend the reality of what I was looking at. But as soon as I did...\n69-Makoto34.png\n: UwaaaaaaAAAAAHHH!!!\nA wild, almost primeval scream escaped from my mouth.\n2-ToSurvive.png\nI tried to suppress my screaming, but it was useless. It surged out of me, like water from a spring gushing out of the ground. Byakuya, on the other hand...\n4-Byakuya7.png\n: Most unusual, don't you think...?\nHe was totally calm. Almost like he was watching this all unfold in front of a TV screen.\n6-Byakuya9.png\n: Look. Chihiro's corpse has been\nsuspended\nsomehow. And something's been written on the wall, in blood... \"\nBloodlust\n\"?\n8-Byakuya2.png\n: Such a brutal way to kill someone... No, this is beyond brutal. Wouldn't you agree?\n9-Makoto2.png\n: They killed her. How could it *not* be brutal?\n10-Byakuya3.png\n: No, that's not my point. This murder is far too\nbizarre\nfor any everyday amateur to have committed it. Unlike with Sayaka, this murder was not a crime of passion or necessity. It's almost as if whoever did this...\ndid it for fun\n. You see what I mean, don't you?\n9-Makoto2.png\n: ...What?\nMy head was swimming. I was still reeling, too confused to understand what he was trying to say. And before I could even begin to clear my head...\n12-Taka7.png\n: Hey, I heard screaming! Did something--?\n14-Taka14.png\n: ...AAAAAAAAHH! Chihiro!?\n15-BodyDiscovery.png\n*Ding dong, bing bong*\n18-Monokuma.png\n: A body has been discovered! After a certain amount of time, which you may use however you like, the\nclass trial\nwill begin!\n9-Makoto2.png\n: ...What the hell was that?\n20-Byakuya.png\n: Ah, that's right. You were unconscious during Sayaka's, so you don't know about it. What you just heard was the\nbody discovery announcement\n. Apparently, when\nthree or more people\ndiscover a body, an announcement plays to let everyone know. I imagine it's so that the search for the culprit can proceed fairly for everyone involved.\nProceed...fairly?\n22-Taka12.png\n: The body discovery announcement!? Then Chihiro really is...?\n23-Byakuya4.png\n: Dead, yes.\n14-Taka14.png\n: D-D-D-D--!\n20-Byakuya.png\n: Before you start screaming your head off, go round everyone up. It seems another game has begun. Another life-or-death game to uncover a killer...\nTaka bolted out of the locker room. As everyone made their way to the scene, it felt as if no time at all passed. It was like my sense of time had just...taken wing and flown away. When I finally came back to myself, I say everyone had the same look of confusion, fear, and anger. We all just stood there, gathered around Chihiro's body.\n26-BoysLifeofDespair.png\n28-Sakura11.png\n: Damn... I couldn't keep her safe!\n29-Taka5.png\n: So there's another victim...\n30-Celeste2.png\n: Which means we are now in the same position once again.\n31-Mondo11.png\n: Fuck, man... What the fuck IS this!?\n32-Hifumi8.png\n: It's a dream... This is a dream! It's all just a dream! In fact, I haven't even been born yet! I don't have any memory of ever being alive! Ugyaaaah!\n30-Celeste2.png\n: Shut up.\n34-Narration.png\n: Let's examine Chihiro's body.\n8-Byakuya2.png\n: For now, pay attention to the wall.\n9-Makoto2.png\n: Huh?\n4-Byakuya7.png\n: I said it once already. There's a word written there.\nOn the wall...?\nThe word \"\nbloodlust\n\" is written on the wall in blood...\n39-Kyoko12.png\n: I don't think it's any kind of dying message. It's just too...strange...\n40-Taka16.png\n: But, you know...that thing about writing \"bloodlust\" in blood... Doesn't it sound kinda familiar?\n41-FlashT.png\n43-FlashB.png\n20-Byakuya.png\n: A murderous fiend, who kills again and again using a bizarre and brutal method... And at the scene of each crime, the word \"\nbloodlust\n\" is written in the victim's own blood. They're like a ghost, attacking suddenly then slipping away before the police can catch up to them. And what nickname did the Internet give to this mysterious serial killer?\n45-Hiro8.png\n: Genocide Jack!\nGenocide Jack\n... The \"murderous fiend\" whose grisly attacks were famous all across the country. The Ultimate Murderous Fiend, creating a reputation of abnormal, downright cruel killings.\n47-Hina10.png\n: Then this is...some copycat killer trying to imitate Genocide Jack's \"style\"? But...why would anyone do that?\n4-Byakuya7.png\n: Perhaps...it's the work of the\nreal Genocide Jack\n.\n48-Hiro6.png\n: The real...? Wait, are you saying Genocide Jack is here in the school!?\n47-Hina10.png\n: Th-There's no way...!\n50-Celeste8.png\n: But going so far as to write\nbloodlust\nat the scene... I am surprised at their stupidity...\n51-Sakura5.png\n: I can't imagine a worse situation than dealing with a stupid murderer...\n52-Hina12.png\n: Ah--!\n54-Hifumi10.png\n: What is it now!?\n52-Hina12.png\n: Toko!\nHina was pointing toward the entrance to the girls locker room.\n56-Toko6.png\n: Ah...ahh...\nToko was the last to arrive, and now she was just standing there.\n56-Toko6.png\n: ...? Nnnnnno... Wh-Why...? Why...? W...h...y...?\n58-Toko8.png\n: WHYYYYYYYY!?!?\n*GADUNK*\n45-Hiro8.png\n: She fainted! That did NOT sound good!\n52-Hina12.png\n: T-Toko!\nHina rushed over to the collapsed Toko and started trying to shake her awake.\n52-Hina12.png\n: Toko, are you okay!? Come on, wake up!\n61-Hifumi6.png\n: Oh, that's right. I just remembered what she said, about how she faints anytime she sees blood.\n30-Celeste2.png\n: So she is hemophobic? I imagine she does not watch too many horror films, then.\n63-Hiro5.png\n: This isn't a violation of the rules, right? I mean, technically she passed out somewhere besides her room.\n9-Makoto2.png\n: No, I think it should be okay. The regulations prohibit \"\nsleeping\n.\" Like, on purpose.\n64-Hiro2.png\n: Ahh, so since she didn't faint on purpose, it doesn't count? Gotcha.\n66-Hina9.png\n: Toko, can you hear me!? Hey, you gotta wake up!\nAs if she'd heard her...Toko suddenly shot awake. As in, she literally jumped up from where she was laying. It was such a strange reaction, I was at a total loss for words. She leapt straight up into the air, changing her stance as she did.\nIn no time flat, she was just...standing up. Ignoring the physical contortions she had to go through, her motions were totally haphazard.\n47-Hina10.png\n: Huh? What?\n68-Toko15.png\n: Sorry about that. I was just so shocked, ya know? It happens, right? Was I the only one?\n9-Makoto2.png\n: T-Toko? Are you...okay?\n68-Toko15.png\n: I'm fine, I'm fine! Kyehaha...! Whoa, is that a dead body!? Hey! Are you dead!? Kyeehahaha!\n63-Hiro5.png\n: She musta hit her head *real* hard when she fainted...\n68-Toko15.png\n: The world has a front and a back, a top inning and a bottom, a sea of truth and a web of lies!\n70-Hifumi7.png\n: This is...quite concerning. I mean, she sounds completely different...\n68-Toko15.png\n: No no no, everything's fine! At least the stutter's all gone. That's a good thing, right!? Kyeehahaha!\n72-Taka9.png\n: It's clear to me that everything is *not* fine! Your eyes seem strangely vacant!\n51-Sakura5.png\n: It might be best if we take her back to her room for the time being...\n66-Hina9.png\n: I don't mind taking her, but...could someone help me?\n74-Hifumi3.png\n: If you need help, I don't mind--\n66-Hina9.png\n: Taka, could you help me?\n54-Hifumi10.png\n: Huh? She totally ignored me!\n20-Byakuya.png\n: Very well. You take care of the girl, and the rest of us can begin the investigation right away. Can I assume nobody has a problem leaving Sakura and Mondo on guard duty again?\n9-Makoto2.png\n: H-Hold on a second. Rushing to an investigation--\n8-Byakuya2.png\n: The mastermind isn't behind that. After what happened last time, surely you realize that.\n9-Makoto2.png\n: Nng...!\n23-Byakuya4.png\n: There is no question that Chihiro was murdered by\nsomeone among us\n. Isn't that right, Monokuma?\n78-MrMonokumaAfterClass.png\n18-Monokuma.png\n: Right as rain! But don't take it as a bad thing. It's just a fact of life!\n79-Monokuma5.png\n: Because that's how\ngraduation\nworks!\nThen...it's happened again? Is that what you're saying? That another one of us...? Another one of us...killed...a fellow classmate?\n82-Monokuma7.png\n: What, does that freak you out? You guys got no balls, you know that!? Is there just nothin' down there at all? Well, I'll let you pray to mine if you want.\n83-Monokuma4.png\n: Actually, I don't have any, either! Sorry!\n84-Byakuya5.png\n: Stop monologuing and give us what you came here to give us. You *did* bring it, right?\n83-Monokuma4.png\n: Hehehe... I sure did, chum! Allow me to present\nthe next Monokuma File\n. I know how much you must be looking forward to it! So, please do you very tippytop best on this investigation! *leaves*\n26-BoysLifeofDespair.png\n87-Hina13.png\n: Do we really gotta do another investigation...? Examining the corpse of one of our friends... Having to suspect all our *other* friends... I hate this... I can't take it anymore!\n88-Hiro9.png\n: I hate it, too! I-I-I've had enough! I'm gettin' outta here!\n51-Sakura5.png\n: Where do you plan on going? There's nowhere to run.\n23-Byakuya4.png\n: Just accept it already. After all, blood is just a liquid. A dead body is a simple object.\n91-Celeste3.png\n: You are very...enthusiastic about all of this, are you not?\n10-Byakuya3.png\n: How can I not be? If we don't unmask the culprit we all die.\n9-Makoto2.png\n: Th-That's true, but...to jump into it so soon...\n84-Byakuya5.png\n: What? Do you *want* to die? Fine, then go off and die somewhere. Right now, go ahead. You're a waste of space.\n93-Mondo8.png\n: A dead body is an...object?\n95-Mondo6.png\n: Chihiro wasn't an \"object\"! Show a little respect, or I'll beat some into ya!\n97-Kyoko3.png\n: Everyone stop bickering. Listen, there's some truth to what Byakuya said.\n9-Makoto2.png\n: K-Kyoko!\n98-Kyoko.png\n: If we don't solve the mystery and find the killer, our own lives are forfeit. And if Byakuya is right that Genocide Jack is somehow the one who killed Chihiro then unless we do something, more victims could start piling up.\n70-Hifumi7.png\n: Forget more victims! If we mess this up, we're all dead meat!\n18-Monokuma.png\n: Hold on, hold on. If that's your worry, you don't gotta worry any longer! In any one killing game,\nthe guilty party may only kill a maximum of two people\n.\n100-Hifumi9.png\n: What...? I don't remember any rule like that.\n18-Monokuma.png\n: I just came up with it. I mean, if one person went around and killed everyone, your lovely student life would be all over, right?\n101-Tutorial.png\n: The new rule has been added to the\nRegulations\nmenu.\n51-Sakura5.png\n: In that case, why not limit it to *one* person?\n103-Monokuma11.png\n: Well in a good mystery, you don't want to miss out on at least the *potential* of a serial killer angle! Nyoohohoho! Just one would totally murder that possibility!\n104-Monokuma12.png\n: Farewell for now! I'll catch you guys at the class trial! *leaves*\n50-Celeste8.png\n: I can't say I understand his thinking, but if we can kill up to two people then one more person's life could still be in danger.\n4-Byakuya7.png\n: Which is definitely not good. We need to uncover the culprit before something else happens.\n95-Mondo6.png\n: YOU need to shut the fuck up!\n107-Hina2.png\n: W-Well...for now, Taka and me are gonna drop Toko off at her room.\n68-Toko15.png\n: Nice! I'm gonna get dropped off! *Taka, Hina and Toko leave*\n30-Celeste2.png\n: We have no time to stand around here. We must begin our investigation tout suite. If we do not solve the mystery of who killed Chihiro...\n109-Celeste16.png\n: ...then we will quickly follow her into the afterlife.\nThat's true... I hate this, but...if I want to survive... Me and everyone else... We have to do it. We don't have any other choice!\n2-BOX15.png\nFirst of all, I'd better check the Monokuma File to see exactly what's going on.\n\"The victim was Chihiro Fujisaki. The time of death is estimated to be around 2:00 a.m. The body was discovered in\nthe girls locker room\n, on the 2nd floor of the school. The cause of death was a blow to the head with a blunt object. She was killed instantly.\"\nThat's...all it says. Well...it's not like there's any point in complaining about it. No matter what, I gotta do what I gotta do...\n5-Byakuya.png\n: Hey, Makoto. Do you have a second?\n6-Makoto2.png\n: Huh? Did you...need something from me?\n7-Byakuya2.png\n: Of course. Life without purpose is quite dull, you know?\n6-Makoto2.png\n: Um, so...what did you need?\n9-Byakuya7.png\n: I'm going to let you cooperate with me during my investigation.\n6-Makoto2.png\n: ...Huh?\n10-Byakuya5.png\n: I'm purchasing your talent. The same talent which allowed you to solve Sayaka's case.\n6-Makoto2.png\n: S-Solve...? No, I just...\n10-Byakuya5.png\n: You seem to have some limited use. Which is why I've chosen you. You have the honor of contributing to my investigation.\nSo...you're inviting me to come with you? You're doing it in the most arrogant way possible, though...\n12-Byakuya9.png\n: Now then, shall we get started?\n6-Makoto2.png\n: B-But...\n13-Byakuya15.png\n: We need to get moving. There's no time to be standing around.\n6-Makoto2.png\n: ...\nI don't really know what just happened but it looks like I'll be working with Byakuya one this one.\n15-Narration.png\n: Let's have a look at Chihiro's body to start.\nI could feel the life draining out of my own body. It's a dead body... *Chihiro's* dead body...\n12-Byakuya9.png\n: But the more I look, the more strange it all seems. This must be Genocide Jack's handiwork.\n6-Makoto2.png\n: Well, but...\n17-Byakuya4.png\n: But we're still not sure he did it. Is that what you want to say?\n18-Byakuya3.png\n: I wonder about that... Hmhmhm...\nThe poster's got some\nblood\non it. It must have happened during the murder.\nThere's a dumbbell on the floor. And this is a\nbloodstain\n! There's a bloodstain on the dumbbell!\n12-Byakuya9.png\n: The Monokuma File said \"a blow to the head with a blunt object\" is what killed her.\n6-Makoto2.png\n: Does that mean this dumbbell was actually the\nmurder weapon\n...?\n12-Byakuya9.png\n: I don't imagine it could have been anything else.\nThere's a fresh\nbloodstain\non the carpet. It must've been splattered with blood during the murder...\n29-Sakura4.png\n: I use this locker room all the time. Now...it's become the site of Chihiro's death.\n6-Makoto2.png\n: But...why was she killed in the locker room? Actually, if you think about it, she could have been killed somewhere else, then carried here.\n30-Sakura3.png\n: She was very light, that is true. It wouldn't be hard for someone to carry her. But still... I still think\nshe came here on her own, by choice\n.\n6-Makoto2.png\n: What makes you say that?\n29-Sakura4.png\n: She'd been talking a lot lately about how she wanted to get stronger.\n6-Makoto2.png\n: So you're saying she came here to exercise? But according to the Monokuma File, apparently she was killed around\ntwo in the morning\n. Would she really have been exercising that late?\n30-Sakura3.png\n: Hina or myself are usually in the locker room during the day. So she was probably avoiding it then.\n6-Makoto2.png\n: Avoiding it...?\n29-Sakura4.png\n: Although we invited her to join us more than once, she never showed up. So I can only assume she was trying to avoid us.\n6-Makoto2.png\n: And instead, she came to exercise in the middle of the night?\n33-Sakura6.png\n: Perhaps. But it's difficult for me to imagine she would have come alone. She did want to start exercising, but she specifically mentioned she couldn't do it be herself. She needed\nsupport from others\n.\n6-Makoto2.png\n: So you're saying she could have come here in the middle of the night to train in secret but that she also would have come with someone else.\n29-Sakura4.png\n: It's a possibility, I think.\n37-Kyoko2.png\n: ...\nShe took her time examining Chihiro's corpse. She poked and prodded, going over every inch of the lifeless body.\n10-Byakuya5.png\n: You're a very strange woman, you know, being able to touch a dead body with absolutely no trouble.\n37-Kyoko2.png\n: ...\nShe seems to be concentrating pretty hard. It's like she can't even hear us.\n40-Mondo17.png\n: Dude had a real complex about being\nweak\n. You heard Chihiro talk about it, right? All \"I need to get stronger!\"\n6-Makoto2.png\n: Yeah, I do remember she said that more than once...\n40-Mondo17.png\n: Sure did. Which...I guess explains the trip down here...\n6-Makoto2.png\n: But...did she really need to get stronger that badly? You already mentioned it, but...she *was* a girl, after all. Most girls aren't all that strong.\n42-Mondo15.png\n: I dunno, man. Haven't really thought about that stuff.\nThe cause of\nChihiro's complex\n... I can't help wondering what it might be.\n5-Byakuya.png\n: Now I believe it's about time for us to move on.\n6-Makoto2.png\n: Huh? Already?\n7-Byakuya2.png\n: New clues won't magically appear by standing around here. We need to check every aspect of this case.\n6-Makoto2.png\n: Th-That's true, but...\n45-Byakuya14.png\n: If you're satisfied, let's hurry up and proceed. *leaves*\nHe's so...pushy. I got caught up with the wrong person this time...\n12-Byakuya9.png\n: So, this is our next location.\n6-Makoto2.png\n: Huh? This place is related to the investigation?\n13-Byakuya15.png\n: Figure it out for yourself. It's no fun if you don't right?\n6-Makoto2.png\n: ...\n15-Narration.png\n: Byakuya's no help to us but the thing he wants us to examine is the card reader outside the girls locker room.\n6-Makoto2.png\n: If I remember right, this\ncard reader\nis meant to work with our handbook, right?\n7-Byakuya2.png\n: Do you have an issue with it? If so, you should take it up with Monokuma.\nHe said that, then quickly and sharply clapped his hands together.\n51-Monokuma.png\n: You called for me!?\nHas he been domesticated...?\n9-Byakuya7.png\n: It seems that Makoto has a question for you.\n53-Monokuma11.png\n: Sure, what's up?\n6-Makoto2.png\n: Umm...well, it's just about this card reader.\n51-Monokuma.png\n: Yes, the card readers have all been designed to interface with each of your e-Handbooks! You can only enter the locker room corresponding to the\ngender listed in your individual handbook\n.\n7-Byakuya2.png\n: And it's\nimpossible for two people in a row to go through\nwhile the door is unlocked, correct?\n55-Monokuma2.png\n: If there were some sort of erotic terrorist on the prowl...\n55-Monokuma2.png\n: The ceiling-mounted Gatling gun would initiate a Swiss cheese slaughter!\n5-Byakuya.png\n: And the\nschool regulations\nprohibit anyone from\nlending someone else\ntheir handbook, correct?\n58-Monokuma13.png\n: Correctly correct!\nSo then.. That means only girls can go in the girls locker room, and only boys can go in the boys locker room. In other words, Chihiro's body being found in the girls locker room means...\n18-Byakuya3.png\n: Hey, Makoto. I can see right through you.\n6-Makoto2.png\n: See right...through me?\n7-Byakuya2.png\n: Allow me to tell you what you're thinking... Since Chihiro was found in the girls locker room, the killer must have been able to get in there. As such, the killer must be one of the girls. Did I get it right? Good lord you're simple.\n6-Makoto2.png\n: But am I wrong?\n18-Byakuya3.png\n: You should pay closer attention to the regulations. The answer has been in front of you the entire time. \"Loaning your e-Handbook to another student is strictly prohibited.\" Only the act of *loaning* a handbook is prohibited.\nBorrowing someone else's is perfectly fine\n.\n61-Monokuma5.png\n: Nyohohoho! I would expect nothing less from the prodigal son of the noble Togami family! So you managed to sniff out the\nloophole\nin the regulations!\n13-Byakuya15.png\n: Knowing you, I would bet you created it on purpose, didn't you? To add a little more excitement to things.\n63-Monokuma10.png\n: Kyaaah! You're treating me like a puny little appetizer instead of the main course that I am! Now then, since the dead can't actually talk, they're not people anymore--they're things! Get it? Got it? Good.\n6-Makoto2.png\n: Wait, hold on... You're saying that's a loophole, but... In order to borrow something from someone, then...that means someone would have to loan it, so...uh...\n55-Monokuma2.png\n: So sleepy... Just listening to you makes me wanna pass out! Be more like Byakuya and get your poop together!\n65-Monokuma6.png\n: Or else I'll charge you with criminal negligence! No more questions! Figure out the rest your own damn self! *leaves*\n6-Makoto2.png\n: ...\n18-Byakuya3.png\n: Well, I know you are unfortunately lacking in mental faculties, so I'll fill you in myself. Let's head to the\nmain hall\n.\n6-Makoto2.png\n: The main hall?\n9-Byakuya7.png\n: That'll help you understand what's going on.\nWe came to...the main hall.\n6-Makoto2.png\n: So...what are we looking for here?\n45-Byakuya14.png\n: ...\nDoes that mean I have to figure it out for myself?\n15-Narration.png\n: Once again, Byakuya won't help us. It's not hard to find what he wants us to see though.\nThere's a mailbox here. Could there be something inside...?\nIt's...an\ne-Handbook\n!? No, wait...there's *three* of them! But what are they doing here?\n5-Byakuya.png\n: So, you finally found them.\n6-Makoto2.png\n: Huh? Did you know these were here, Byakuya?\n18-Byakuya3.png\n: I happened to find them by chance myself the other day. It seems there's a system in place where the\nhandbooks of dead students\nget \"\ndelivered\n\" to this mailbox.\n6-Makoto2.png\n: So then, these three handbooks belong to Junko, Leon, and Sayaka?\n5-Byakuya.png\n: You can go ahead and confirm it yourself.\nI immediately turned on one of the handbooks. And when I did...\n6-Makoto2.png\n: You're right! This is Sayaka's handbook!\n9-Byakuya7.png\n: Now do you understand? This is the key to the\nloophole\nthat I revealed earlier.\n6-Makoto2.png\n: Yeah, I feel like I'm starting to get it...\n76-FlashT.png\n78-FlashB.png\n18-Byakuya3.png\n: You should pay closer attention to the regulations. The answer has been in front of you the entire time. \"Loaning your e-Handbook to another student is strictly prohibited.\" Only the act of *loaning* a handbook is prohibited.\nBorrowing someone else's is perfectly fine\n.\nI see...yeah, now I understand.\n13-Byakuya15.png\n: Hm? Hold on a second...\n6-Makoto2.png\n: What's wrong?\n13-Byakuya15.png\n: That's strange. One of the handbooks\nwon't turn on\n.\n6-Makoto2.png\n: Is it broken? Whose is it?\n13-Byakuya15.png\n: The other handbook showed Junko's name when I started it up.\n6-Makoto2.png\n: Then the one that won't turn on must be...Leon's, right?\n5-Byakuya.png\n: It would make sense, yes. After all, he did get pummeled with dozens and dozens of baseballs.\nPummeled with baseballs...\n76-FlashT.png\n78-FlashB.png\nThe memory of it came flooding back. That cruel punishment, which led to Leon's death... The execution that the mastermind concocted... A cruel, heartless death...\n6-Makoto2.png\n: You're right. It wouldn't be surprising for the handbook to break during that kind of assault.\n84-MrMonokumasLesson.png\n55-Monokuma2.png\n: Hey, hey!\n85-Monokuma3.png\n: Hey hey hey hey hey!\n65-Monokuma6.png\n: HEEEY!\n6-Makoto2.png\n: Wh-What...?\n55-Monokuma2.png\n: That e-Handbook is essential to student life here! Crucial, integral, instrumental, a super big deal! There's no way it would\nbreak\nthat easily!\n6-Makoto2.png\n: But it did...\n85-Monokuma3.png\n: If I say it wouldn't break, it wouldn't freakin' break! It can withstand up to ten tons of pressure, and it's waterproof up to a hundred meters, okay!? I don't care how many baseballs you hit it with, it wouldn't do crap!\n87-Monokuma8.png\n: Oh, but uh...even my amazing handbook does have one single\nweak point\n.\n6-Makoto2.png\n: It does?\n89-Monokuma4.png\n: But it's a secret! I wouldn't want you to go breaking any more handbooks!\n7-Byakuya2.png\n: Then Leon must have broken it somehow without realizing what its weakness was, right?\n51-Monokuma.png\n: Hmm...hard to say! You know what I think? I think his handbook isn't actually broken!\n53-Monokuma11.png\n: But, you might ask, how could that be!? *leaves*\nLeaving the question hanging in the air, Monokuma disappeared.\n2-BOX15.png\n6-Makoto2.png\n: What just happened? Monokuma said it's not broken. But it's an undeniable fact that it's not turning on.\n5-Byakuya.png\n: Well, I don't see any connection to the case, so it doesn't matter for now.\nYou think so? Either way, something about it still bothers me...\n18-Byakuya3.png\n: Okay then, this should be enough to get things rolling. Let's begin out investigation in earnest and track down the true culprit.\n6-Makoto2.png\n: Yeah. We need to find out who killed Chihiro!\n5-Byakuya.png\n: To be exact...not quite.\nHuh? Not...quite?\n6-Makoto2.png\n: What do you mean by that, Byakuya? \"To be exact...not quite.\"\n18-Byakuya3.png\n: Certainly I want to reveal Chihiro's killer, but more precisely...\n7-Byakuya2.png\n: I want to discover the\ntrue identity of Genocide Jack\n.\n6-Makoto2.png\n: Then...you really think...? You truly believe Genocide Jack is the one that killed Chihiro?\n9-Byakuya7.png\n: Absolutely. I have no doubt that\n[Genocide Jack]\nis the culprit in this case. And I have a\n[basis]\nto believe that. I assure you, Genocide Jack is one of us.\n> Genocide Jack\n6-Makoto2.png\n: That murderous fiend is...Genocide Jack, right?\n9-Byakuya7.png\n: There's nobody else it could be.\n5-Byakuya.png\n: A murderous fiend, who kills again and again using a bizarre and brutal method... They're like a ghost, attacking suddenly then slipping away before the police can catch up to them. And what nickname did the Internet give to this mysterious serial killer?\n6-Makoto2.png\n: Genocide Jack... They say he's killed thousands of people. But that's gotta be an urban legend... Still, could one of us really be a demented, psychotic killer like that?\n18-Byakuya3.png\n: You're not wrong to wonder. But words mean little right now. I have something that will prove it. And I can show you.\n> basis\n6-Makoto2.png\n: Is there really proof...?\n7-Byakuya2.png\n: There's somewhere I'd like to take you. This will provide all the\nevidence\nyou need. Evidence that Genocide Jack is the one that killed Chihiro!\nEvidence... Does something like that really...?\n???: Ah! Hey you two!\n100-Hina10.png\n: Big trouble! Need your help!\n5-Byakuya.png\n: We're busy. Leave us alone!\n100-Hina10.png\n: But it's an emergency...! Emergency! C'mon, please! You gotta help me!\n2-DISTRUST.png\n4-Hina10.png\n: This is a serious emergency! Please, please! You gotta help me!\n5-Makoto2.png\n: Just calm down, okay Hina?\n4-Hina10.png\n: But...but...! It's an\n[e-mer-gen-cyyy]\n!\n> e-mer-gen-cyyy\n5-Makoto2.png\n: An emergency? What happened?\n7-Hina9.png\n: Something's wrong with\nToko\n. She's acting super strange!\nWell, I mean...she was acting pretty strange earlier, right?\n5-Makoto2.png\n: ...What should we do, Byakuya?\n9-Byakuya9.png\n: Since it's Toko...I must admit, I'm intrigued. I suppose we can take a second to see what's going on with her.\n5-Makoto2.png\n: Are you sure?\n10-Byakuya7.png\n: Don't make me repeat myself.\nI...didn't expect that. I thought for sure he'd just say no, and that'd be the end of it.\n11-Hina22.png\n: Okay, okay, come on! Hurry! *leaves*\n5-Makoto2.png\n: W-Wait for us, Hina!\n13-Byakuya14.png\n: It looks like she headed to the dorms. To\nToko's room\n, most likely.\n5-Makoto2.png\n: You're right!\n16-Hina15.png\n: You guys are too slow!\n5-Makoto2.png\n: I think you're just...too fast...\n17-Byakuya2.png\n: So? What's this emergency?\n18-Hina2.png\n: Well, after what happened in the girls locker room, we left Toko in her room so she could lay down. After a while, we came back to check on her. Ya know, see how she was doing. But when we did it was weird. She refused to come out, and she kept saying all this\nweird stuff\n.\n5-Makoto2.png\n: Weird stuff?\n20-Byakuya.png\n: We should try talking to her ourselves.\n5-Makoto2.png\n: Y-Yeah, good idea.\nI may as well give it a shot...\n*Ding dong*\nThe door swung open, slowly and silently.\n24-DespairSyndrome2.png\n25-Toko18.png\n: ...\nH-Holy crap...! An aura of negativity flowed out from behind the door, forcing a gasp out of me.\n26-AtTheDoor.png\n(Conversation)\n25-Toko18.png\n: ...What?\n5-Makoto2.png\n: Oh, um...nothing. It's just that...Hina was really worried about you, holing yourself up in your room...\n25-Toko18.png\n: Leave me a-alone...\n5-Makoto2.png\n: Um, yeah, sure thing. But...could you open up, just for a second...?\n25-Toko18.png\n: ...Won't a-allow it...\n5-Makoto2.png\n: Huh...?\n25-Toko18.png\n: I w-won't let Genocide Jack have control!\n*SLAM*\nAnd just like that, she slammed the door in my face.\n5-Makoto2.png\n: Wh-What was that...?\n18-Hina2.png\n: She's been acting like that the whole time. When I rang a little while ago...\n29-FlashT.png\n31-FlashB.png\n25-Toko18.png\n: I'll d-drive out...the killer... D-Drive out the murderous fiend...\n7-Hina9.png\n: It doesn't make any sense, right? I was afraid to leave her in there alone, so I tried to bust down her door but it felt like something was holding it shut on the other side. I couldn't even budge it...\nToko was scared enough to even bar her door...? Does she think the same thing as Byakuya? Does she think the\nserial killer Genocide Jack\nreally murdered Chihiro? Is that why Toko's so scared...?\n7-Hina9.png\n: Whatever it is, I'm really worried about her... Isn't there anyone who\nmight be able to persuade her\n...?\n34-Narration.png\n: I think I know the person for the job.\n5-Makoto2.png\n: Hey, Byakuya...you think you could ask her? To come out of her room, I mean.\n20-Byakuya.png\n: ...Sure, whatever.\n36-Hina12.png\n: Huh? You're gonna talk to her, Byakuya? Wow, I guess you can be nice when you want to!\n20-Byakuya.png\n: ...\nByakuya stood in front of her door, not making a sound, and pressed the doorbell.\n*Ding dong*\nAfter a few moments...\n25-Toko18.png\n: Leave me alone! You're all s-s-s-so annoying... Ah--! Backula!\n17-Byakuya2.png\n: It's Byakuya.\n25-Toko18.png\n: ...I-I'm sorry. I couldn't k-keep our\npromise\n... But don't w-worry. Never again... I...! I won't let Genocide Jack have control ever again!\n*SLAM*\nAnd with that, the door slammed shut.\n18-Hina2.png\n: Even Byakuya couldn't pull it off...\n20-Byakuya.png\n: There's nothing else we can do. Let's get back to the investigation.\n5-Makoto2.png\n: H-Hold on! Hey, Byakuya. What was Toko talking about just now? Something about a\npromise\n?\n39-Byakuya15.png\n: Hm? Oh, I have no idea. Another one of her delusions, I'm sure.\n5-Makoto2.png\n: B-But...\n41-Byakuya5.png\n: If I say I don't know, that means I don't know. Just let Hina take care of her.\n18-Hina2.png\n: O-Oh...yeah, okay. I'll stay here and keep an eye on her.\n13-Byakuya14.png\n: Well then, let's go. *leaves*\nWithout waiting for a reply, Byakuya sped away.\n5-Makoto2.png\n: B-Byakuya!\nAnd I hurried to catch up.\nI tried to talk to him several times as we walked but he didn't even look back, let alone say anything. He just kept on walking toward his destination. Finally, his feet brought him to a stop in front of\na certain room\n...\n44-BOX15.png\n5-Makoto2.png\n: ...The\nlibrary\n?\n20-Byakuya.png\n: Come on, let's go in.\n34-Narration.png\n: We haven't actually been behind this door before. Luckily, it's where Byakuya is leading us.\nIf I remember, on the other side of this door...\n5-Makoto2.png\n: It's the\narchive\n, right?\n20-Byakuya.png\n: Hurry up and go inside.\n5-Makoto2.png\n: Oh...here?\n13-Byakuya14.png\n: It'll all make sense once you're inside.\nWhoa! There's so many books and files.\n5-Makoto2.png\n: ...And so much dust, too.\n48-Byakuya3.png\n: I would say there's enough value in this place to endure the dust.\nHuh? It's a\ndesk lamp\n...\n29-FlashT.png\n31-FlashB.png\nOh yeah. It's the same one I saw Byakuya using in the library before.\n20-Byakuya.png\n: Do you have a problem with that lamp? It was here before, then I moved it over there. It's too dark over there, so I thought I'd put it to good use.\nThis shelf is stuffed tight with files... Without really thinking about it, I picked one at random.\n48-Byakuya3.png\n: Ah, you have a sharp eye indeed to select that file.\n5-Makoto2.png\n: ...Huh?\n56-Byakuya8.png\n: That's the report on a presidential assassination. The original is kept at the national library. It won't be declassified for another thirty years. Are you sure you want to look at it now? There's no telling whose crosshairs you might wind up in for peeking at it...\n5-Makoto2.png\n: ...\nWithout making a sound, I returned the file to the shelf.\n5-Makoto2.png\n: There's so many files stuffed onto the shelf. What's in all these things...?\n41-Byakuya5.png\n: Those documents are...dangerous.\n5-Makoto2.png\n: ...Dangerous?\n41-Byakuya5.png\n: They detail all the people who control the world from behind the scenes. Dangerous truth for a commoner.\n5-Makoto2.png\n: You mean, like...members of the Diet or something?\n10-Byakuya7.png\n: No, I mean the once with real power, the\nsecret council\ncontrolling everything from the shadows. If you're ready to be disappeared for it, take a look. There are some very...interesting people in there.\n5-Makoto2.png\n: Y-You're just kidding...right?\n48-Byakuya3.png\n: Am I?\nI-I'll just let it go for now...\nThere's a ton of thick files stuffed onto the bookshelf.\n48-Byakuya3.png\n: If you're thinking of looking through any of them, let me give you a little warning. Those things are filled with graphic, disturbing photos from all kinds of crime scenes. It's the kind of thing any normal person wouldn't ever want to look at. Be careful...\n5-Makoto2.png\n: Huh? What do you mean?\n64-Byakuya4.png\n: All those files there are\ninvestigation reports related to different cold cases\n. Those are internal documents, for police eyes only. They're not the kind of thing you'd expect to leak.\n5-Makoto2.png\n: Oh...?\nThere's a wooden box. ...It's empty. Although, judging by the smudges in the dust, it looks like there was something inside...\n5-Makoto2.png\n: I wonder what it was...\n20-Byakuya.png\n: There was an\nextension cord\nplugged in there. It proved very useful while I was in the library.\nAn extension cord, huh...?\n48-Byakuya3.png\n: So? Are you finally beginning to understand the true splendor of this library? The entire reason I was interested in the library...is because of this room right here. It's home to\nclassified government documents, police records,\nthings no ordinary person would ever see. Isn't it magnificent?\n5-Makoto2.png\n: This...can't be for real, right?\n39-Byakuya15.png\n: That's your guys' problem. Anything that doesn't fit into your preconceived reality, you label it a lie.\n5-Makoto2.png\n: Well, it's not that. It's just... It's not like I totally refuse to believe it, but... I mean, there's just so *much*. How could anyone have put all this together?\n9-Byakuya9.png\n: I suppose it goes to show just how much Hope's Peak truly wields. Or perhaps the mastermind may have wanted to provide us with enough entertainment to keep us from getting bored.\nU-Um... It's no use. I can't keep up with all this. It's just too unreal...\n10-Byakuya7.png\n: What's wrong? You still can't believe it?\n5-Makoto2.png\n: What about you? How can you believe it so easily? Things like that are usually impossible...\n41-Byakuya5.png\n: What do you mean, usually? Usual? Normal, ordinary, simple? Those things don't exist anywhere in the real world. If you don't understand what they actually represent, you don't understand the nature of anything.\nYou don't pull your punches, do you?\n20-Byakuya.png\n: Besides, what you consider \"usual\" is based on your common sense, right? But what makes you think your own \"common sense\" applies to me at all?\n17-Byakuya2.png\n: The documents gathered here are genuine. I have\n[reviewed them multiple times]\n, so there is no doubt.\n> reviewed them multiple times\n5-Makoto2.png\n: H-Hold on a second! You're saying you've read all these documents, and more than once!? But...all this has to be like top secret, confidential stuff, right? So why...?\n71-100MileJunkFoodDash.png\n48-Byakuya3.png\n: My family has a reading room just like this at our home. Ours is bigger, of course. And not as dusty.\n5-Makoto2.png\n: Huh...?\n48-Byakuya3.png\n: Members of the Togami family have access to any variety of government-related documents. That includes foreign powers as well as domestic.\n5-Makoto2.png\n: H-How is that possible...?\n17-Byakuya2.png\n: I already told you, there's a\nsecret council\nthat controls the world from the shadows. My family is a member of that council. And I have within me the bloodline that will allow me to one day bend the world to my will... But to become such a ruler, I must know all levels of this world backwards and forwards. So whenever I have time, I like to review whatever documents and materials that interest me. Which is why I can proclaim, without a doubt, that the materials gathered here are\nthe real thing\n.\nThis is beyond believing or not believing. Byakuya is actually starting to scare me more than the actual mastermind...\n9-Byakuya9.png\n: And what always interested me the most were the \"\ncold case\n\" police investigation reports. Reading through those reports has always been a hobby of mine, ever since I was little. It's excellent mental exercise. I've solved more than a few of those cases just by reviewing the reports. And among all those reports, one of my recent favorites is the\nGenocide Jack\ncase.\nAs he talked, Byakuya grabbed a specific file from the shelf.\n10-Byakuya7.png\n: This is the complete case file. Every single report surrounding the Genocide Jack cases has been compiled in here.\n9-Byakuya9.png\n: Because there are so many, allow me to quickly summarize the main points. To begin, there are two notable characteristics in every Genocide Jack murder. The first characteristic is that at every crime scene,\nthe word \"bloodlust\" is written in the victim's own blood\n. And the second...\n9-Byakuya9.png\n: ...is that when the victims are murdered, their bodies are\nsuspended\nin a certain way.\n\"Bloodlust\" written in blood, and the victim's body is suspended... It's exactly the same as what happened to Chihiro!\n48-Byakuya3.png\n: Save your surprise. The best part is yet to come. For the second characteristic, where the\nvictims are suspended\n... The only ones who knew about that particular fact were members of the police and other higher-ups. By all accounts, nobody in the media ever found out.\n5-Makoto2.png\n: Huh...?\n48-Byakuya3.png\n: In other words, no one on the news, no one online, *nobody* knew about that aspect of each crime. Only key officials and the killer himself knew about this act of \"mounting\" the victim.\n9-Byakuya9.png\n: Now, if you'll recall Chihiro's corpse, her body was most certainly mounted in this fashion.\n5-Makoto2.png\n: So...how could the killer have\nknown about suspending the victim\n...?\n48-Byakuya3.png\n: That's the key question. But in fact, the answer is quite simple.\n41-Byakuya5.png\n: The culprit isn't a copycat killer... It's\nthe real Genocide Jack\n.\n5-Makoto2.png\n: ...Gh!\n56-Byakuya8.png\n: That right there is the\nevidence\nthat Genocide Jack has hidden himself among the rest of us.\nTh-Then...Genocide Jack really is... Such a brutal, fiendish killer really is walking around among us?\n48-Byakuya3.png\n: Hmhmhm. Things are really starting to get interesting, aren't they? I never imagined a killer with such a reputation would ever become part of our little game. Now, don't you think it would be good for you to take a look at what I've already seen? You might just manage to ferret out a clue or two. If you get down on your knees and beg, I might even show you myself.\n5-Makoto2.png\n: Umm, Byakuya...about that Genocide Jack case file... Could you let me see it?\n17-Byakuya2.png\n: Well, you didn't beg, but I guess it's okay this time. Feel free to look at it in here, but you can't take it with you.\n79-BoysLifeofDespair.png\nByakuya handed me the file, and I flipped through it with tense, nervous fingers. Suddenly my hand stopped... I had reached the page where photos from the scene of each crime had all ben collected.\nThe names of Genocide Jack's victims ran on for several pages. Ken Harada, 32. Tetsuhiro Honda, 17. Shoji Gaku, 23. Kanno Isei, 14. Takeshi Yoshida, 30. Komatsuna Taro, Takefumi Gono, Udhida Naohisa, Takeshi Masamune, Yuto Yumejima, there was no end to it... But one thing became perfectly clear as I read... All of the killer's countless victims were\nkilled and suspended in exactly the same way\n. And at the scene of every murder, the word \"\nbloodlust\n\" was left in the victim's own blood.\n48-Byakuya3.png\n: Now take a look at the next page, and you'll find another interesting tidbit.\n5-Makoto2.png\n: The next page...?\nProfiling results?\n\"All of the crimes took place either on weekdays at night, or during holidays, either day or night. The most common time for the killings to take place was on holidays, in the afternoon. Based on these facts, it could be suggested that the suspect may be a\nstudent\n. Evidence suggests that the suspect lingered at the scene, but when they did leave, they were in a panic. Because an eyewitness has never come forward, it's unlikely there was any external reason for this. This confused behavior suggests...\"\n82-Makoto43.png\n: \"...that the suspect may potentially suffer from\ndissociative identity disorder\n.\"\n9-Byakuya9.png\n: The key point here is that the culprit may well have a\nsplit personality\n.\nA split personality...? Like the kind of thing you see on TV? So I'm part of another totally unbelievable story... But this one is way more unbelievable than anything else up till now. Or...maybe it really isn't. I dunno, I feel like my mind has gone numb...\n13-Byakuya14.png\n: Alright, we should get going soon.\n5-Makoto2.png\n: Huh? Where are we going?\n13-Byakuya14.png\n: Anywhere but here. We've finished our business here, haven't we? *leaves*\n5-Makoto2.png\n: Ah, wait! Byakuya!\nAs usual, Byakuya turned and left without another word. I hurried out of the library to catch up.\n44-BOX15.png\n20-Byakuya.png\n: Well...this is where we part ways. I have some things I need to take care of before the class trial.\n5-Makoto2.png\n: Huh? Just all of a sudden like that?\n39-Byakuya15.png\n: Come on, enough of your annoying misapprehensions. Did you really think we'd be together the whole time? Take responsibility for yourself and do something useful. Move the investigation forward on your own.\n13-Byakuya14.png\n: Well, goodbye. *leaves*\nAnd just like that, he was gone. Just as quickly as he'd asked me to join him, he'd cut me off. In the end, I felt like I was just some play thing getting tossed around. At the same time, I'd uncovered some really important clues thanks to him...\nGenocide Jack\n... He's the one that killed Chihiro. And that murderous fiend is one of us! But who is it...? I have to find that out, no matter what it takes. And to do that, there's somewhere I have to go investigate one more time...\nI have to go back to the crime scene, the\ngirls locker room\n. I should also check the\nboys locker room\n, too... And\nthe others\nmight have come up with some info I might find useful, while I'm at it. I need to find out everything I can...\n34-Narration.png\n: Byakuya's finally gone and we can conduct our own investigation now. We'll get to that next update.\n2-BOX15.png\n3-Narration.png\n: Now that Byakuya is finally gone, I'm finally able to resume narration duties instead of him dragging us everywhere. Our first stop on our individual investigation is the pool hallway, where we can find Hifumi hanging around.\n5-Hifumi21.png\n: Ding ding ding! Hifumi has discovered evidence revealing the identity of the culprit! Hmhmhm... Another stat increase for me!\n6-Makoto2.png\n: Evidence? What did you find?\n7-Hifumi5.png\n: I cannot reveal that just yet! But I guarantee that what I found will steal the killer's break from his lungs!\nAre you sure about that...?\n9-Hifumi17.png\n: Oh yeah!\nMiss Ludenburg\nsaid she'd\nwitnessed\nsomething worthwhile, too.\n6-Makoto2.png\n: Really? What did she see?\n10-Hifumi18.png\n: She refused to tell me. It's like when a girl bullies the boy she like, right? Right!?\n6-Makoto2.png\n: Okay, so...where is Celeste now?\n9-Hifumi17.png\n: The\nwarehouse by the dorms\n. She was there, but at the same time...not there.\nWhat's it gonna be...?\n3-Narration.png\n: We'll keep that in mind for later. Right now, let's check out the boys locker room.\n3-Narration.png\n: There are a couple of things to see in here.\nHuh. This poster... It's a popular boy band called\nTornado\n. Somehow it doesn't quite seem to fit in the *boys* locker room.\nThere's a\nstrange stain\non the carpet... What...is it?\n3-Narration.png\n: Back in the girls locker room, it looks like Kyoko is done with her examination of the crime scene.\n6-Makoto2.png\n: Hey, Kyoko...have you made any progress on your investigation?\n18-Kyoko11.png\n: Generally speaking. But I have to get going. I have something unrelated to take care of.\n6-Makoto2.png\n: Something besides the investigation...? What...is it?\n19-Kyoko2.png\n: Nothing you need to worry about. Just concentrate on the murder.\n6-Makoto2.png\n: B-But...\n21-Kyoko.png\n: Before I go, let me give you one piece of advice. You should examine\nChihiro's body\none more time. Thoroughly. Also, her\nhandbook\nis missing. You might want to determine its whereabouts.\n22-Kyoko19.png\n: That's it. I'll be praying for your success. *leaves*\nWith that, Kyoko turned and left the girls locker room.\n6-Makoto2.png\n: I guess I'll take another look at the body, then...\nAnd...Chihiro's handbook is missing? That's definitely worth worrying about...\n26-DISTRUST.png\nKyoko said I should...examine the body one more time.\n6-Makoto2.png\n: I know she said \"thoroughly\" but I do have my limits... Well, I'd better give it a shot anyway. Let's see...\nChihiro's hands are bound with...what looks like some kind of rope. The rope was used to prop her up in a kind of crucifix position. ...Huh?\nThis rope has a...\nplug\n!? Wait, so then...this isn't a rope at all! But the more I think about it, the more that's not the only thing that concerns me.\nChihiro's\nfatal injury\nwas the\nblow to the head\n... Which means someone struck her in the head in order to kill her. That's right... There's the issue of her being suspended, and the fatal blow... At first, I didn't see any reason to think too much about either of them.\nBut seeing them again after looking through the Genocide Jack file, something's not quite right... What does this all mean...?\nWell, the one thing most likely to tie all these mysteries together is the true nature of the \"rope\" that was used to suspend Chihiro. And to figure that out, there's a\ncertain place\nI need to revisit and look over again. Plus, it might help to look at the Genocide Jack case file one more time.\n2-BOX15.png\nIt's the bloodstained poster. The blood is the most noteworthy part, but the big-breasted swimsuit model is pretty noticeable, too. A girls locker room doesn't seem like the kind of place you'd find something like this...\n6-Makoto2.png\n: Oh, but wait...that reminds me! The poster in the other locker room is...\nThat's right! There's definitely something strange about this...\nIn the boys locker room, there's a poster of a popular boy band... In the girls locker room, there's a poster of a big-breasted swimsuit model... Could the\nposters have been switched\n...? But if they were...why? What reason would anyone have?\n6-Makoto2.png\n: Maybe I should talk to someone who knows a little more about the locker rooms.\n3-Narration.png\n: Who better to talk to about the locker rooms than Sakura?\n6-Makoto2.png\n: You spend a lot of time exercising in the girls locker room, right Sakura?\n38-Sakura.png\n: I've used it nearly every day since it opened up. Sometimes Hina and I use it together.\n6-Makoto2.png\n: Okay then, let me ask you something... Do you think the posters in the boys and girls locker rooms could have been\nswitched\n?\n40-Sakura4.png\n: Sorry, I can't really say. I never paid any attention to the posters.\n6-Makoto2.png\n: I see...\n42-Sakura3.png\n: But there *is*\nsomething that's been bothering me\nabout the locker room... You see, I like to drink a little protein coffee every time I finish exercising.\n6-Makoto2.png\n: We have protein coffee?\n40-Sakura4.png\n: In the warehouse. It's not the highest quality, but I don't have a lot of other options. I mix protein powder with coffee, and down a glass of it after exercising. Anyway, the other day, I spilled some on the carpet in the girls locker room, and\nit left a stain\n.\n6-Makoto2.png\n: A stain...? But I don't see any stain on the carpet now...\n38-Sakura.png\n: Exactly. I noticed it earlier--the stain has\ndisappeared\n. I can only assume someone came along and cleaned it up. But still, isn't it unusually clean? As if there was never a stain here to begin with...\n3-Narration.png\n: To check on that \"rope\" we need to return to the library.\nHuh? The lamp won't turn on... Oh, I see... It's not plugged in. The lamps cord isn't long enough to reach the outlet from here. But...last time I saw it, it was definitely on, and it was definitely right here.\n46-FlashT.png\n48-FlashB.png\nOh, that's right. Byakuya was using an\nextension cord\n! But there's no extension cord here now... I wonder if...\n3-Narration.png\n: Makoto also wanted to check the Genocide Jack file again.\nI want to take another look at Genocide Jack's case file...\n6-Makoto2.png\n: Hmm...I know it was around here somewhere... Huh...? It's gone!\nDid someone take it out of the archive? But the only one who would do something like that... I can't think of anyone but Byakuya...!\n3-Narration.png\n: Swing and a miss.\n3-Narration.png\n: Back downstairs in the halls we can find Taka.\n54-Taka16.png\n: Maybe we should have confessed our embarrassing secrets after all...!\n55-Taka20.png\n: Dammit! I'm sorry, Chihiro... It's all because I wasn't strong enough!\n3-Narration.png\n: We can also find Hiro in the main hall.\n58-Hiro4.png\n: O-Oh! Hey Makoto, what's up!?\n59-Hiro3.png\n: Ah, I haven't been up to anything myself, that's for sure. Definitely haven't looked inside the mailbox!\n3-Narration.png\n: Somehow I doubt that, Hiro. Next stop is the warehouse. Hifumi told us Celeste was here with information.\n6-Makoto2.png\n: Celeste... What are you doing here?\n63-Celeste4.png\n: This warehouse is amazing. It has absolutely everything one might need to live a full life. From food to clothes to towels... There's an endless supply to choose from.\n6-Makoto2.png\n: I see that, but...have you found anything related to the case?\n65-Celeste5.png\n: I knew you were going to ask me that. I thought talking about the warehouse itself might misdirect you, but I see it was pointless.\n6-Makoto2.png\n: Then you did find something?\n66-Celeste3.png\n: Very well. I will tell you, and *only* you. Last night, I saw her here... Chihiro was in the warehouse.\n6-Makoto2.png\n: What? Really!?\n66-Celeste3.png\n: This was right before nighttime.\n46-FlashT.png\n48-FlashB.png\n68-DeathWish.png\n(BG Music)\n69-InTheWarehouse.png\n(Conversation)\n70-Celeste19.png\n: Hm? What are you doing out this late?\n71-Chihiro17.png\n: Oh, um...I was just...\n70-Celeste19.png\n: Are you planning to go exercise, perhaps?\n71-Chihiro17.png\n: What!? H-How did you know...?\n70-Celeste19.png\n: Because I can see a blue track jacket sticking out of that duffel bag you're carrying...\n71-Chihiro17.png\n: Oh, you're right... Thanks. Well...I'd better get going. I'm kind of in a hurry.\n70-Celeste19.png\n: ...\n2-BOX15.png\n73-Celeste15.png\n: She stuffed the jacket into her bad in a hurry. It was almost like she was trying to hide it... And just like that, she was gone.\n74-Celeste8.png\n: I assumed she was merely stocking up to go exercise in the morning, but it would appear she ignored the nighttime rule, and headed directly to the girls locker room. If she hadn't broken out rule, none of this ever would have happened...\n76-Celeste9.png\n: You get what you deserve, I suppose.\nSo apparently she went to the girls locker room late at night in order to\nexercise without anyone knowing\n. But the strange thing is there was no trace of the\ntrack jacket or duffel bag\nCeleste said she saw Chihiro carrying. Which would mean the killer would have gotten rid of it somehow...\n3-Narration.png\n: Hina's hanging around in the dining hall instead of outside Toko's room. Let's see what she's up to.\n6-Makoto2.png\n: Oh, Hina. How's Toko doing?\n80-Hina2.png\n: Same as before. She won't come out, and she just keeps mumbling something about Genocide Jack.\n81-Hina6.png\n: So I just left her there.\n6-Makoto2.png\n: Y-You...left her?\n81-Hina6.png\n: My head was all swimmy, and I was getting pretty hungry...\n83-Hina.png\n: Oh, but don't worry! I'm gonna head back as soon as I'm done eating. Toko's not exactly pleasant, but I'm still worried about her.\n6-Makoto2.png\n: Speaking of which, what are you eating?\n85-Hina22.png\n: A donut, of course!\nOf course...?\n87-Hina7.png\n: There's two things I'm sure God created--outer space, and donuts!\n6-Makoto2.png\n: Really...?\n88-Hina9.png\n: I bet Chihiro would've liked to eat more donuts. Maybe that was her one big regret...\n90-Hina14.png\n: Ahh, I should've tried to spend more time with her...\n6-Makoto2.png\n: Come to think of it...who *did* she spend time with?\n92-Hina20.png\n: Yeah, she was a little bit strange. Didn't really hang out with the other girls much... It was like...like she was trying to keep her distance from us.\n6-Makoto2.png\n: Actually, Sakura said something similar. She said that even though you and her invited Chihiro to exercise with you, she always refused...\n88-Hina9.png\n: Yup, it's true. And it wasn't just us, either. It was like she\nstayed away from all the girls\n.\n6-Makoto2.png\n: Was she just...shy?\n92-Hina20.png\n: I dunno, she\ntalked to the boys all the time\n. Isn't it kinda weird to be shy around your own sex, but totally fine with the opposite sex?\n94-Hina21.png\n: Oh, wait! Maybe... Maybe she was used to guys spoiling her. The law says you can't judge a book by its cover, right?\nYou think so? I never really saw her as that kind of girl...\n97-Timeforthe2ndTrial.png\n*Ding dong, bing bong*\n100-Monokuma.png\n: Erm, so ah...I'm getting tired of waiting. Shall we just plunge right in? It's the moment you've all been waiting for...the\nclass trial\n! You remember where to meet, right? Please go through the\nred door\non the 1st floor of the school! Puhuhu. See you soon!\nBegin the class trial, or...?\n6-Makoto2.png\n: It's about to begin.\nThe red door...is right through here. ...\n103-ToSurvive.png\n100-Monokuma.png\n: Ahem, so...is everyone ready to--whaaat!?\n105-Monokuma11.png\n: Am I blind, or are we missing someone?\n107-Mondo13.png\n: Yeah, Toko's not here.\n105-Monokuma11.png\n: And Toko is...?\n108-Hiro5.png\n: You really don't remember...?\n110-Monokuma13.png\n: Kidding! I'm just kidding. How could I forget that little nutjob? She's a crucial part of the class trial this time!\n111-Monokuma3.png\n: Okie dokie, I'll go ahead and drag her out here kicking and screaming. Just one moment, please!\nAnd just like he said, a few minutes later he reappeared, dragging Toko behind him.\n114-Toko9.png\n: Nng...ghh... I t-told him I didn't want to, but...h-he forced me! I can't believe you would d-drag a girl around...\n116-Toko17.png\n: Terrible...! You're t-terrible!\n117-Monokuma10.png\n: Whew! So NOW everyone's here, right? Okay then, hustle onto the elevator and let's get this show on the road!\n118-Monokuma4.png\n: I'll see you guys down there! *leaves*\n120-Byakuya14.png\n: So, shall we get going? It's time to find out who killed Chihiro.\nChihiro... Chihiro Fujisaki... She was so gentle, so calm and meek. Nobody had any problems with her...\nSomeone made the choice to kill...a girl like that...\nAnd that murderer...is one of us. Someone standing right here...\n6-Makoto2.png\n: We have no choice, right? We have to do this...\n21-Kyoko.png\n: Yes.\nI gave a small nod in reply. With one last deep breath, I walked toward the elevator on shaky legs. With each step forward, I could feel my heart starting to race faster and faster. As soon as everyone was on...the elevator began to descend. I couldn't get a handle on my emotions, couldn't stop speculating...\nThe steel box sank with heavy clunking sounds deeper and deeper into the ground. And as we went deeper, the uneasiness in my heart grew bigger and bigger. The elevator was unaffected, however, and continued to descend without hesitation. Until finally...\n...it came to a sudden stop.\n110-Monokuma13.png\n: What do you think? I redecorated! Isn't it so fresh? Isn't it so EXCITING!?\n128-Byakuya.png\n: Don't waste our time with stupid questions. Let's get this over with.\n110-Monokuma13.png\n: Good, good, you're rip-raring to go! Gotta say, I don't hate it! Not at all! Okay then, let's get this show on the road!\n130-Monokuma6.png\n: Everyone, please find your assigned seats!\nAnd so, the curtain opened once again...\nA deadly judgment... A deadly deception... A deadly betrayal... A deadly riddle, a deadly defense, a deadly faith...\nA deadly...class trial!\n133-UndergroundTrial.png\n3-Narration.png\n: It's time for the Class Trial once again. The ticker along the bottom reads the following:\n\"The bizarre class trial begins again. Why was Chihiro murdered? Is the killer hiding within the group? Is there any help to be found in this series of murders...?\"\n3-Narration.png\n: In the Skills menu, I've taken a moment to equip Upshift and Algorithm in addition to all the skills I had equipped for Trial #1. I explained what these did back when I got them earlier in the chapter, but here's the game's explanation for each:\nUpshift:\nIncreases your aim speed. Effective during the Nonstop Debate and the Hangman's Gambit. Costs 1 SP.\n-This skill came from Mondo. The increased cursor speed is not absolutely necessary but there's a mechanic introduced in this trial that makes having a faster cursor much more desirable in the Nonstop Debate. Plus, I just like having a fast cursor.\nAlgorithm:\nIncreases the speed of memorizing a statement. Effective during the Nonstop Debate. Costs 2 SP.\n-This skill came from Chihiro. If I'm remembering the game correctly, we'll be encountering the Memorization mechanic during Nonstop Debates in this trial. This skill just speeds up how long it takes to memorize something. It sounds like a quality of life skill but later on in the game I'm sure it will be quite handy.\n3-Narration.png\n: We're actually using all our SP at this point for a total of 11/11 SP, so if I want to keep using these skills and new ones later I'll need to get some more SP from Free Times.\n3-Narration.png\n: Next is the list of Truth Bullets we got during our investigation.\n136-Tutorial.png\n: ...to the head with a blunt object. She was killed instantly.\n136-Tutorial.png\n: ...stated that she desired help with her efforts.\n136-Tutorial.png\n: She may have been meeting someone in the locker room the night she was murdered.\n136-Tutorial.png\n: ...else.\n136-Tutorial.png\n: ...possible for two people to enter at the same time.\n136-Tutorial.png\n: Additionally, lending someone your handbook is a violation of school regulations.\n136-Tutorial.png\n: ...handbook is Leon's.\n136-Tutorial.png\n: However, Monokuma claims it's very unlikely that Leon's handbook would have broken.\n136-Tutorial.png\n: ...found at the scene of each crime, written in blood.\n136-Tutorial.png\n: Profiling indicates the killer is likely a student suffering from a split personality.\n136-Tutorial.png\n: ...well with her male classmates.\n136-Tutorial.png\n: ...band popular with teenage girls.\n136-Tutorial.png\n: ...clothes were not found at the crime scene.\n136-Tutorial.png\n: Celeste had not told anyone other than Makoto about this encounter.\n3-Narration.png\n: Next time, the Second Class Trial begins.\n",
    "evidence_objects": [
        {
            "name": "Monokuma File #2",
            "description": "The victim was Chihiro Fujisaki. The time of death is estimated to be around 2:00 a.m. The body was discovered in the girls locker room, on the 2nd floor of the school. The cause of death was a blow to the head with a blunt object. She was killed instantly."
        },
        {
            "name": "Sakura's Account",
            "description": "Although Chihiro wanted to get stronger, she declined several invitations from Sakura and Aoi, and may have used the locker room late at night to avoid them. Despite this, Chihiro had stated that she desired help with her efforts. She may have been meeting someone in the locker room the night she was murdered."
        },
        {
            "name": "Locker Room Dumbbell",
            "description": "The dumbbell found on the floor of the girls locker room had a significant amount of blood on it."
        },
        {
            "name": "Mondo's Account",
            "description": "Chihiro had told anyone willing to listen that she wanted to get stronger. Some assume that due to her inferiority complex about being weak, she admired strength more than anything else."
        },
        {
            "name": "Card Reader",
            "description": "To unlock a locker room, you need to swipe your e-Handbook over the card reader. You need a male student's handbook for the boys locker room, and a female student's for the girls. It is not possible for two people to enter at the same time. Additionally, lending someone your handbook is a violation of school regulations."
        },
        {
            "name": "Main Hall e-Handbook",
            "description": "The handbook of each student that has died is placed in the mailbox in the main hall."
        },
        {
            "name": "Broken e-Handbook",
            "description": "One of the handbooks found in the main hall had been broken, which is apparently a rare occurrence. Junko and Sayaka's handbooks both seem to still work, so it is assumed that the broken handbook is Leon's. However, Monokuma claims it's very unlikely that Leon's handbook would have broken."
        },
        {
            "name": "Genocide Jack Case File",
            "description": "Suspected Genocide Jack victims include Ken Harada, Tetsuhiro Honda, and Shoji Gaku, among countless others. They were killed in the same way, and mounted to a nearby wall. The word \"bloodlust\" was found at the scene of each crime, written in blood. Profiling indicates the killer is likely a student suffering from a split personality."
        },
        {
            "name": "Aoi's Account",
            "description": "Chihiro seems to have consciously kept her distance from the other girls at the school, even from the beginning. Meanwhile, it had been noticed that she got along remarkably well with her male classmates."
        },
        {
            "name": "Boys Locker Room Carpet",
            "description": "The carpet in the boys locker room was found with a blackish stain on it."
        },
        {
            "name": "Two Locker Room Posters",
            "description": "Blood was found on the poster in the girls locker room. The poster featured a big-breasted supermodel popular among young boys. Meanwhile, the poster in the boys locker room was for a boy band popular with teenage girls."
        },
        {
            "name": "Chihiro's e-Handbook",
            "description": "Chihiro's handbook was not found on her corpse, and has apparently gone missing."
        },
        {
            "name": "Status of the Dead Body",
            "description": "Chihiro's body had been suspended, and her hands had been bound with some kind of rope. Her fatal injury was a blow to the head."
        },
        {
            "name": "Disappearing Stain",
            "description": "Sakura mentioned that she was responsible for a coffee stain on the girls locker room floor. However, the stain had since been inexplicably scrubbed away."
        },
        {
            "name": "Library Desk Lamp",
            "description": "Byakuya was known to use this lamp often. However, the extension cord had gone missing at some point and the lamp's cord couldn't quite reach the outlet."
        },
        {
            "name": "Celeste's Account",
            "description": "On the night of the murder, right before \"nighttime,\" Chihiro was spotted leaving the warehouse. It seems she was stuffing some blue exercise clothes into a duffel bag. Presumably she was on her way to exercise, but the clothes were not found at the crime scene. Celeste had not told anyone other than Makoto about this encounter."
        }
    ],
    "turns": [
        {
            "category": "cross_examination",
            "newContext": "[I\n3-ClassTrialDawn.png\n4-Monokuma.png\n: Let's begin with a basic explanation of the class trial! So, your votes will determine the results. If you can figure out \"whodunnit\" then only they will receive punishment. But if you pick the wrong one... Then I'll punish everyone *besides* the blackened, and the one that deceived everyone else will graduate!\n6-Monokuma4.png\n: Okay then, so first off... Let's talk about the\n**\nmurder weapon\n!\nFirst we have to make clear what was used to deliver the fatal blow...\n",
            "testimonies": [
                {
                    "testimony": "Chihiro's fatal injury... It appears it was a head wound .",
                    "person": "Sakura",
                    "present": []
                },
                {
                    "testimony": "According to the Monokuma File, the killer used a \"blunt instrument,\" but... What kind of \"blunt instrument\" could it have been!?",
                    "person": "Taka",
                    "present": []
                },
                {
                    "testimony": "I bet it was an iron pipe !",
                    "person": "Hiro",
                    "present": [
                        "Locker Room Dumbbell"
                    ],
                    "source": {
                      "evidence_span": "The dumbbell found on the floor of the girls locker room had a significant amount of blood on it.",
                      "testimony_span": "I bet it was an iron pipe",
                      "is_self_contained": "yes",
                      "context_span": ""
                    }
                },
                {
                    "testimony": "Interesting! That certainly would make for a powerful weapon!",
                    "person": "Taka",
                    "present": []
                },
                {
                    "testimony": "Poor Chihiro...",
                    "person": "Hina",
                    "present": []
                }
            ],
            "summarizedContext": "Everyone is discussing the murder weapon.",
            "noPresent": false,
            "labels": [
              "object property"
            ],
            "reasoning": [
              "Fact 1: The witness claims the murder weapon was an iron pipe.",
              "Fact 2: The evidence suggests the dumbbell has much blood on it.",
              "Prop 1: If an item has much blood on it, it is likely the murder weapon.",
              "Prop 2: If the murder weapon is a dumbbell, it cannot be an iron pipe."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "3-ClassTrialDawn.png\n20-Makoto25.png\n: Can we agree that the object that dealt the fatal blow was the\n**\ndumbbell\n, found at the scene of the crime? It was covered in blood, and there was nothing else at the scene that could have caused that kind of injury.\n21-Kyoko11.png\n: And the wound on the victim's head is\n**\nconsistent\nwith the shape of the dumbbell. As far as I'm concerned, there's no mistake and no room for doubt on this one.\n22-Hina12.png\n: You...looked at her head wound?\n23-Hifumi8.png\n: Kyaaah! That's sooo creeeepy!\n24-Kyoko2.png\n: ...\n26-Byakuya.png\n: If you don't mind, I will proceed from here. Let's move on to discussion of the culprit. Although, I believe the criminal behind this heinous act is already quite clear.\n27-Hiro8.png\n: What? For real!?\n29-Byakuya8.png\n: Chihiro's killer is the fiendish serial killer,\n**\nGenocide Jack\n!\nGenocide Jack, the fiendish serial killer... Did he really...kill Chihiro?\n31-Tutorial.png\n: For this debate, lines of\n**\nwhite noise\nwill appear to disrupt your reactions. Your Truth Bullets will disappear if they hit these lines, so think of them as\n**\nobstacles\nin your debate. But there's a way to keep this white noise from getting in your way. Press the X button to attach the silencer, which you can use to shoot down the white noise. However, if you shoot and actual\n**\nremark\nwith your silencer instead of the white noise...the\n**\ntime limit\nwill decrease. So take careful aim when you have your silencer out.\n10-Narration.png\n: White noise serves to get in your way when debating. They will move across the screen from various directions to interfere. If you fire your Truth Bullet at a weak point and white noise is in the way, your bullet will not get through. Noise adds an extra step to the debate process but as of this trial it's not that hard to work around. You even get back 2 seconds of time for every piece of white noise you shoot down. If you miss and shoot white text though, you will lose 10 seconds off your timer and some points at the end of the trial. If nothing else, if gives you something to do while the characters talk at each other.\n",
            "testimonies": [
                {
                    "testimony": "The culprit is Genocide Jack , I'm sure of it. Case closed, as far as I'm concerned.",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "But...that's impossible!",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "Why? What makes it impossible?",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "Well, I mean...come on...! There's just no proof for it !",
                    "person": "Hina",
                    "present": [
                        "Genocide Jack Case File"
                    ],
                    "source": {
                        "evidence_span": "They were killed in the same way, and mounted to a nearby wall. The word \"bloodlust\" was found at the scene of each crime, written in blood.",
                        "testimony_span": "There's just no proof for it",
                        "is_self_contained": "no",
                        "context_span": "6-Byakuya9.png\n: Look. Chihiro's corpse has been\nsuspended\nsomehow. And something's been written on the wall, in blood... \"\nBloodlust\n\"?"
                    }
                },
                {
                    "testimony": "Hey, so, speaking of Genocide Jack... I don't know who that is!",
                    "person": "Hifumi",
                    "present": []
                }
            ],
          "summarizedContext": "",
          "noPresent": false,
          "labels": [
            "behavioral"
          ],
          "reasoning": [
            "Fact 1: The witness claims there is no proof that Genocide Jack is the killer.",
            "Fact 2: The evidence suggests all the victims Genocide Jack were mounted with the word \"bloodlust\" written in blood.",
            "Fact 3: The context suggests the victim was mounted with the word \"bloodlust\" written in blood.",
            "Prop 1: If a victim died in the same way as other victims of a known killer, it is proof that the killer is the same."
          ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "Sorry, but I didn't kill anyone !",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "You say that, but do you really expect any of us to believe it?",
                    "person": "Sakura",
                    "present": []
                },
                {
                    "testimony": "Perhaps if you had an alibi, that would change things...",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "Ohh, an alibi, huh? Now we're talkin'!",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "When you compare your past murders to this incident the modus operandi matches completely: killing with scissors, mounting the victim, and the writing in blood. What more proof do we need?",
                    "person": "Byakuya",
                    "present": [
                        "Status of the Dead Body"
                    ],
                    "source": {
                      "evidence_span": "Her fatal injury was a blow to the head.",
                      "testimony_span": "the modus operandi matches completely: killing with scissors, mounting the victim, and the writing in blood",
                      "is_self_contained": "yes",
                      "context_span": ""
                    }
                },
                {
                    "testimony": "Kyeeeehahahahaha!",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "Give it up. You killed her.",
                    "person": "Byakuya",
                    "present": []
                }
            ],
            "summarizedContext": "Everyone is discussing whether Genocide Jack aka Jill is the killer.",
            "noPresent": false,
            "labels": [
              "object property"
            ],
            "reasoning": [
              "Fact 1: The witness claims the victim was killed with scissors.",
              "Fact 2: The evidence suggests victim was killed with a blow to the head.",
              "Prop 1: If the victim was killed with a blow to the head, he was not killed with scissors."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "16-ClassTrialChaos.png\n17-Makoto25.png\n: Are the\n**\nmethods of murder\nreally exactly the same? I'm not so sure about that...\n18-Makoto2.png\n: I think there's a slight difference between the Genocide Jack cases and this one.\n19-Hiro7.png\n: Huh? How's it any different?\n4-Jill2.png\n: Uh-oh, you don't know? Well then, human garbage, let me tell you!\n20-FlashT.png\n22-FlashB.png\n7-Jill9.png\n: I murder with passion and conviction! I consider myself a professional, and I have a very particular way of doing things! Imagine you go to a fancy Italian restaurant. They're very picky about the noodles, the sauce, everything. But what happened to Chihiro... It'd be like if that same Italian restaurant started using Ragu or Chef Boyardee! This is no creation of mine!\n24-Makoto37.png\n: Let me rephrase that, in a way that maybe makes more sense...\n18-Makoto2.png\n: There are two clear differences between the Genocide Jack cases and this one.\nThere's one clear difference between the murders...\n> The victim's fatal injury\n27-Makoto28.png\n: For one, the\n**\ncause of death\nis different. In the Genocide Jack murders, all the victims were killed the same way. According to the case file, they were all apparently killed with...a pair of scissors. But Chihiro died from\n**\na blow to the head\n, right?\n28-Hifumi18.png\n: Ah, yes! That is remarkably different from the other murders!\n27-Makoto28.png\n: Wouldn't it be strange for someone who kills the same way without fail to suddenly change their method?\n17-Makoto25.png\n: And there's more--one more conflicting detail.\n30-Jill6.png\n: That's right! In my recipe of murder, if the bloody message is the tortellini then the arrangement of the body would be the pesto sauce!\n31-Hiro14.png\n: Could you please stop comparing killing people to cooking...?\n32-Taka16.png\n: S-So...are you saying the other difference has to do with how the body was arranged...?\nThat's right. The second difference is related to how she was suspended.\n> What was used to suspend her\n18-Makoto2.png\n: Do you remember what the killer used to suspend her? They'd used\n**\nsome kind of rope\nto hang her up by her wrists.\n35-Celeste8.png\n: What is your point?\n17-Makoto25.png\n: Well, in all the previous Genocide Jack cases, something else was used to suspend them...\n20-FlashT.png\n22-FlashB.png\n17-Makoto25.png\n: Specifically, pairs of\n**\nrazor-sharp scissors\n.\n38-Jill4.png\n: And guess what! I used my own specially designed scissors for the murders AND the arrangement!\n39-Jill.png\n: Like I said, I'm a professional. So naturally I'm very picky about the tools I use!\n4-Jill2.png\n: And--andandandandand ya know what else!? Big Mac said there's two differences, but he's wrong!\n24-Makoto37.png\n: Big Mac...? Are you referring to me?\n7-Jill9.png\n: Listen up, Big Mac! There's actually\n**\none more difference\n!\n41-Makoto33.png\n: ...Huh?\n42-Jill10.png\n: My word! You really didn't notice? Take a look at who the victims were in each Genocide Jack case... There's a\n**\npattern there\njust waiting to be discovered!\n43-Sakura3.png\n: A...pattern?\n4-Jill2.png\n: Figure that out, and it'll be plain as death why I couldn't have possibly killed that little loli girl!\nHmm...let's see... There was a pattern surrounding the Genocide jack victims, and Chihiro didn't fit it...? I...I think I figured it out! I know why she couldn't have killed Chihiro...!\n> Because Chihiro was a girl\n11-Narration.png\n: Even if you didn't figure this out from the details in the case file, the other two answers are thankfully absurd enough that they can't be right.\n17-Makoto25.png\n: Is it because...\n**\nChihiro was a girl\n?\n9-Jill3.png\n: BINGO! Bull's-eye! Right on the money!\n47-Hiro5.png\n: What are you talking about...?\n18-Makoto2.png\n: In all the Genocide Jack cases, all the victims had something in common.\n20-FlashT.png\n22-FlashB.png\nKen Harada, 32. Tetsuhiro Honda, 17. Shoji Gaku, 23. Kanno Isei, 14. Takeshi Yoshida, 30. Komatsuna Taro, Takefumi Gono, Uchida Naohisa, Takeshi Masamune, Yuto Yumejima, there was no end to it...\n47-Hiro5.png\n: They were all...guys?\n51-MrMonokumaAfterClass.png\n30-Jill6.png\n: That's right! The people I kill with such passion and conviction...are all adorable little men! Kyaah! I can't believe I said it! I'm so embarrassed!\n52-Mondo11.png\n: The hell is wrong with you!?\n30-Jill6.png\n: I can't help it. I'm just a full-throttle boy-on-boy fangirl! And the mopey side of me just hates it!\n9-Jill3.png\n: But now I'm on the fast track to becoming a full-fledged fanmadam!\n54-Taka11.png\n: So since Chihiro was a girl and not an \"adorable little man\"...you wouldn't kill her?\n4-Jill2.png\n: Would an Italian chef suddenly start making ramen, just because they're both noodles? Don't be stupid!\n30-Jill6.png\n: I have too much passion and conviction to cross that line! That's the absolute reality of the one and only!\n8-Byakuya.png\n: We get it. You've clearly explained your hobby and your philosophy. But that's not all there is to it.\n10-Byakuya2.png\n: It's a different matter entirely...when you're forced to kill in order to survive.\n4-Jill2.png\n: Quiet, lowly cur!\n57-Byakuya12.png\n: Lowly...cur?\n39-Jill.png\n: I would never kill for a reason as petty as mere survival! And! If by some fluke I *did* kill to survive...\n59-BoysLifeofDespair.png\n4-Jill2.png\n: ...why would I bother with the message and arrangement!? It'd make me the obvious suspect!\n6-Celeste7.png\n: That...does make some amount of sense.\n39-Jill.png\n: PLUS! Whatever reason I have for killing, I would NEVER leave out my prized\n**\nscissors\n! Who would go out of their way to use a big stupid heavy dumbbell!?\n28-Hifumi18.png\n: Maybe you used the dumbbell cuz you couldn't find any scissors in the school?\n42-Jill10.png\n: \"Any\" scissors? I don't just use \"any\" scissors! I only use my own set of high-class, envy of the entire world scissors!\n47-Hiro5.png\n: Okay, whatever, there still aren't any in the school...\n42-Jill10.png\n: Are you sure about that...?\n♪\n**\nMusic fades out.\n♪\n62-ToSurvive.png\n63-Jill13.png\n: Da da-da daa!\n64-Hifumi10.png\n: Grgh! She's fully equipped!\n63-Jill13.png\n: That's right! So I can kill anywhere, anytime! Why would I resort to dumbbells or rope, when I have my trusty scissors by my side? Go ahead, tell me I'm wrong. You can't, can you? Gutter dogs, all of you! Not to mention, I have no clue how to tie a good knot. So rope's totally out of the question anyway!\n66-Taka4.png\n: Ngh...ngraah...! I have no idea what's going on anymore...! Could such a heinous villain really be innocent!?\n67-Mondo10.png\n: But...the body really was\n**\nsuspended\n, right? And nobody but the police knew about that...\n68-Hina2.png\n: Yeah! That's why we figured it had to be the real deal and not some copycat killer or whatever!\nActually, hold on...there *is* one person... One person who could have copied the Genocide Jack cases!\n11-Narration.png\n: The one who dragged us around during the investigation, who showed us all the evidence...\n72-ClassTrialTHESUN.png\n27-Makoto28.png\n:\n**\nByakuya\n...it's possible you could have found out, isn't it? You'd have no problem gaining access to classified government documents or internal police records. Plus, you'd already looking through the Genocide Jack file before this all happened, hadn't you?\n8-Byakuya.png\n: ...\n64-Hifumi10.png\n: A-Are you saying...Mr. Togami did it?\n8-Byakuya.png\n: ...\n74-Celeste16.png\n: Then the reason he pushed the theory of\n**\nGenocide Jack being the killer\nso hard was because he wanted to pin the crime on her!\n7-Jill9.png\n: So he rearranged the scene to disguise it and make it look like I'd put my stamp on it...!\n76-Jill11.png\n: The adorable glasses man was behind it all!? Ahh, I'm on fire!\n77-Taka8.png\n: ...Well, Byakuya!? What's your response!?\n78-Byakuya3.png\n: I see... So now the suspicion falls on me. Then I must ask...when would you say I began acting suspicious? Surely you must have an answer...\n17-Makoto25.png\n: Hmm, looking back and thinking about it now, the way you were acting right before we discovered the body was a little strange...\n20-FlashT.png\n22-FlashB.png\n80-Byakuya9.png\n: And the locker rooms... They're suspicious. Very suspicious, indeed. Wouldn't you agree?\n18-Makoto2.png\n: Huh? Suspicious...?\n81-Byakuya4.png\n: It seems nobody's searched the locker rooms. Let's start with the girls locker room...\n18-Makoto2.png\n: You wanted to go to the girls locker room right away, right? But since you're a guy...\n78-Byakuya3.png\n: I should have naturally thought of the boys locker room first. Is that what you want to say?\n84-Byakuya5.png\n: The victim was Chihiro. A girl. Hence why I said we should check the girls locker room.\n85-Hifumi.png\n: Nothing strange about that, I'd say!\n87-Makoto20.png\n: On the contrary, there's something *very* strange!\n78-Byakuya3.png\n: Okay then, what's so strange about it?\n81-Byakuya4.png\n: Go ahead, share with the rest of the class.\nThere was a clear contradiction in what Byakuya just said... I need to make it clear to everyone...!\n89-Tutorial.png\n: Next we're going to add something called a\n**\nTruth Flashback\n. If you aim and a weak spot and hold down the Triangle button then you'll\n**\nmemorize\nthat weak spot. This memorized phrase can only be shot once as a single Truth Bullet. If you shoot or change the Truth Bullet, it will disappear from your Truth Cylinder. However, you can use this flashback feature as many times as you want. If you don't seem to have the answer to a\n**\nlie or contradiction\nin your loaded Truth Bullets it might be wise to memorize a different weak spot and use that to make your case. When's the best time to flashback? Well, you'll just have to use your keen wits, won't you?\n11-Narration.png\n: I think this is the last mechanic in the Nonstop Debate. Like the tutorial said, you can use this mechanic to use a weak point that someone says and turn it into a Truth Bullet you can use to break through a different weak point. This debate introduces the mechanic so it's not too difficult to do but later cases will get tougher. There's also no indication of when you want to use a memorized statement instead of your loaded bullets so you have to be very aware of what bullets you have. While that sounds potentially unfair, the good thing is that you won't need to use this mechanic in a good 80% of the Nonstop Debates and when you do it's usually obvious enough that you're supposed to use it. I like it for adding that little extra layer to the debates. It makes you think and pay attention.\n",
            "testimonies": [
                {
                    "testimony": "So you said Byakuya was acting kinda weird before we found the body ... But he was acting weird...how?",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "If you're presented with the opportunity to check out the girls locker room, you absolutely take it...! That's a natural reaction for any guy!",
                    "person": "Hifumi",
                    "present": []
                },
                {
                    "testimony": "The victim was Chihiro , who was a girl. So of course I would suggest we check the girls locker room first. There was no time for pointless distractions. What's so strange about that?",
                    "person": "Byakuya",
                    "present": [
                        "before we found the body"
                    ]
                },
                {
                    "testimony": "I wish you'd taken me with you...",
                    "person": "Hifumi",
                    "present": []
                }
            ],
            "noPresent": false
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "What, the difference between the cases? You want me to explain it again!?",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "When I want to kill, I use my very own special scissors ! And I use those same scissors to arrange the body !",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "But...Chihiro was suspended with... It was some kind of rope, was it not?",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "That's right! It absolutely was!",
                    "person": "Taka",
                    "present": []
                },
                {
                    "testimony": "Then there must be something very fishy indeed about that rope...!",
                    "person": "Hifumi",
                    "present": []
                },
                {
                    "testimony": "Hey, Byakuya! Where'd you get it from, huh?",
                    "person": "Mondo",
                    "present": []
                },
                {
                    "testimony": ": I'd never seen that rope before in my life... Obviously somebody else must have had it hidden away somewhere.",
                    "person": "Byakuya",
                    "present": [
                        "Library Desk Lamp"
                    ],
                    "source": {
                      "evidence_span": "Byakuya was known to use this lamp often. However, the extension cord had gone missing at some point",
                      "testimony_span": "I'd never seen that rope before in my life",
                      "is_self_contained": "yes",
                      "context_span": ""
                    }
                }
            ],
            "summarizedContext": "Everyone is discussing what was used to tie up the victim's body.",
            "noPresent": false,
            "labels": [
              "object property"
            ],
            "reasoning": [
              "Fact 1: The witness claims he never seen a rope that can tie up a body.",
              "Fact 2: The evidence suggests the witness use a lamp often and the extension cord had gone missing.",
              "Prop 1: If a lamp cord is missing, it is possible the cord was used to tie up a body.",
              "Prop 2: If a person uses an item often, they likely have seen its accessories."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "16-ClassTrialTHESUN.png\n17-Makoto2.png\n: Actually, I'm pretty sure\n**\nyou *have* seen it\nbefore. Because you see, that rope--or should I say...\n17-Makoto2.png\n: ...that\n**\nextension cord\n?\n19-Hifumi10.png\n: What!? An extension cord!?\n21-Makoto28.png\n: Byakuya--you've used the extension cord in the library more than once, haven't you? And the same extension cord that was in the library all this time...\n21-Makoto28.png\n: ...went missing after the murder!\n24-ClassTrialChaos.png\n21-Makoto28.png\n: And there's no way someone who uses that extension cord as much as you do wouldn't discover that fact!\n7-Taka8.png\n: Then Byakuya must be the one who took the extension cord! I can't imagine any other possibility!\n25-Byakuya3.png\n: ... That's really what you think? Then your conclusion is something like this...? I killed Chihiro in the girls locker room, then hung her up and wrote that bloody message. I intentionally made it look like Genocide Jack was behind it.\n26-Byakuya4.png\n: Is that about right?\n... He's doing it again... He's totally calm, totally unconcerned. As if he's not even involved. Wait...not even involved...?\n26-Byakuya4.png\n: What's wrong? I asked you if you think that's what happened.\n28-Mondo5.png\n: Hell yes that's what happened! So that's it, right? Byakuya's the killer!\n29-Jill5.png\n: I don't disagree with not disagreeing!\n30-Taka7.png\n: He kept calling this a game, right? So he'd be totally willing to do something like this to \"win\"!\n31-Makoto26.png\n: ...\n32-Makoto20.png\n: Um, sorry but could we hold on just a second? I...I think we need to talk about this a little more.\n34-Hiro4.png\n: Huh? Do we really need to? We've already decided who did it.\n31-Makoto26.png\n: I know, but still... There's something that's still bothering me...\n26-Byakuya4.png\n: Is that right? And what, pray tell, is still bothering you? I killed her in the girls locker room, then disguised my crime. Specifically, I dressed it up to make it look like it was the work of a homicidal psychopath. What about all that \"bothers\" you?\n36-ClassTrialDawn.png\nWait... What was that just now? Something's not right... Byakuya's remarks just now... There's something in there that concerns me.\n> The scene of the crime\n39-Makoto25.png\n: You say you killed Chihiro in the girls locker room, right? But are you sure about that? Isn't it possible that the murder\n**\ntook place somewhere else\n?\n40-Byakuya15.png\n: How disappointing... What kind of question is that? Even in the world of disappointments, this is a true letdown.\n25-Byakuya3.png\n: She was found dead in the girls locker room. There is absolutely no question about that. How could the scene of the crime have been anywhere else?\n17-Makoto2.png\n: Well...I think it's entirely possible that she was killed somewhere else, then carried there later along with the rest of the murder scene!\n41-Byakuya12.png\n: The...rest of the murder scene? ...\n43-Byakuya6.png\n: That was awfully specific. Please tell me you have a reason for saying all of that.\n32-Makoto20.png\n: I believe I do...\nHey, Byakuya...did you just...? Did I just take you off-guard? When the story suddenly moved to the crime scene, Byakuya, who'd been so confident up till now... Maybe Byakuya never even realized that the actual scene of the crime\n**\ncould have been somewhere else\n.\n7-Taka8.png\n: Hey, don't just move on without permission! What do you mean she was killed somewhere else!?\n43-Byakuya6.png\n: Come on, Makoto! If there's any chance the murder took place somewhere else, let's see the proof!\nEvidence that shows the murder took place somewhere else... I need to just focus on those things that got switched!\n11-Narration.png\n: Didn't it seem odd that the posters in each locker room seemed to match what you'd expect to find in the other locker room?\n> Present \"Two Locker Room Posters\"\n39-Makoto25.png\n: The proof that she was killed somewhere else is...the\n**\nposter\nthat's hanging in each locker room.\n41-Byakuya12.png\n: Your proof...is some posters?\n39-Makoto25.png\n: The poster in the girls locker room was a picture of a\n**\nbig-boobed supermodel\n. But don't you think that's kind of strange? Why would the girls locker room have a poster like that?\n5-Jill7.png\n: I bet those massive jugs of hers were totally fake! Kyeehahaha!\n39-Makoto25.png\n: Meanwhile, the boys locker room had a poster of the super popular boy band\n**\nTornado\n. Again, that doesn't really seem to belong in a boys locker room.\n50-Celeste8.png\n: So you're saying that maybe the posters were switched?\n21-Makoto28.png\n: And there's one other thing I noticed about the locker rooms... You know what I'm talking about, right Sakura?\n52-Sakura3.png\n: You're referring to my\n**\nprotein coffee\n, aren't you?\n53-Hifumi2.png\n: ...Protein coffee?\n54-Sakura4.png\n: While I was in the girls locker room earlier, I spilled some protein coffee on the carpet. But I noticed that after the murder, the stain had been totally scrubbed away.\nNo. It's not that the stain was scrubbed away... It was moved...\n11-Narration.png\n: We found a brown stained carpet in the boys locker room.\n> Present \"Boys Locker Room Carpet\"\n16-ClassTrialTHESUN.png\n17-Makoto2.png\n: The stain on the girls locker room carpet wasn't scrubbed away. In fact, I found it on the\n**\nboys locker room carpet\n.\n58-Sakura5.png\n: That's...definitely the stain from my protein coffee!\n50-Celeste8.png\n: Then...does that mean that the carpets were switched, too? But...why would anyone do that?\n17-Makoto2.png\n: To move the murder scene from one locker room to the other. It's certainly plausible, don't you think?\n59-Taka13.png\n: What!?\n39-Makoto25.png\n: In other words, in order to completely swap the scene of the crime the bloodstained\n**\nposter\nand\n**\ncarpet\nwere moved along with the dead body.\n60-Makoto23.png\n: By doing this, the killer was able to change the entire room where the murder took place.\n62-Celeste2.png\n: I can certainly follow your reasoning, but...why would the culprit bother doing that?\n32-Makoto20.png\n: Huh?\n",
            "testimonies": [
                {
                    "testimony": "Shut up! I'm telling you, I know how she could have done it!",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "Is it really possible? Could Chihiro really have gotten into the boys locker room somehow?",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "Ah! I've got it!",
                    "person": "Taka",
                    "present": []
                },
                {
                    "testimony": "She must have hacked her e-Handbook ! She was the Ultimate Programmer, after all. I'm sure that would've been no problem for her!",
                    "person": "Taka",
                    "present": []
                },
                {
                    "testimony": "No, I don't think that's it... She used the thing that was in the main hall!",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "Huh? What thing?",
                    "person": "Hifumi",
                    "present": []
                },
                {
                    "testimony": "I'm talkin' about Leon's handbook , of course! If she had that, she could get into the boys locker room no problem!",
                    "person": "Hiro",
                    "present": [
                        "Broken e-Handbook"
                    ],
                    "source": {
                      "evidence_span": "the broken handbook is Leon's",
                      "testimony_span": "I'm talkin' about Leon's handbook , of course! If she had that, she could get into the boys locker room no problem!",
                      "is_self_contained": "yes",
                      "context_span": ""
                    }
                }
            ],
            "summarizedContext": "Everyone is discussing how the victim, a girl, could have gotten into boys locker room.",
            "noPresent": false,
            "labels": [
              "object property"
            ],
            "reasoning": [
              "Fact 1: The witness claims Leon's handbook was used to get into the boys locker room.",
              "Fact 2: The evidence suggests Leon's handbook was broken.",
              "Prop 1: If a device is broken, it cannot be used to access a location."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "So before I even knew what was happening, the class trial had been put on hold... We headed off, with Kyoko in the lead. And where she took us was...\n3-DISTRUST.png\n4-Makoto20.png\n: ...The girls locker room?\n5-Taka8.png\n: We've already searched this place top to bottom! What are you trying to pull, missy!?\n6-Kyoko11.png\n: I'd like you to\n**\nexamine the victim's body\n, one more time.\nYou want to check it again...?\n8-Kyoko17.png\n: Be sure to examine the entire body very carefully. Take your time.\n9-Hifumi9.png\n: Examine her...carefully? Like, using our hands?\n10-Hifumi7.png\n: Nowaynowaynowaynoway!\n11-Taka11.png\n: It's...probably best if I don't run my hands all over a girl's dead body...\n12-Hiro5.png\n: I-It's not that I'm creeped out or anything. It's just...based on religious grounds, ya know...?\n14-Sakura.png\n: ...Very well. I'll do it.\n15-Hina9.png\n: B-But you're a girl. You shouldn't have to touch a dead body. Just let one of the boys do it...\n16-Sakura4.png\n: No, it's okay. I think Chihiro would rather have a girl examine her. So just leave this to me...\n17-Hina2.png\n: S-Sakura...\n19-Jill6.png\n: What is this, some kind of secret girl-on-girl action!? Is that what you two are about!?\n20-Hina18.png\n: That's not it at all! Stop screwin' around!\n14-Sakura.png\n: Okay, here I go... I'm sorry, Chihiro. Please excuse the intrusion...\nPutting her hands together in a brief prayer, Sakura then began to quietly examine her body.\n22-Kyoko2.png\n: Be sure to check her entire body, and I believe we will solve this particular mystery.\n23-Sakura5.png\n: Her entire body...? I know you say that, but...\n♪\n**\nMusic fades out.\n♪\n23-Sakura5.png\n: What--? This is... What does this m--?\n25-Sakura9.png\n: Huaaaaaaahhh!\n26-Makoto31.png\n: What is it!?\n28-Sakura11.png\n: Not possible... It's not possible!\nSakura's eyes were staring wildly at Chihiro's lifeless form. Her massive frame trembled.\n28-Sakura11.png\n: This...this girl is...!\n15-Hina9.png\n: Is what!?\n30-ToSurvive.png\n25-Sakura9.png\n: ...is a\n**\nboy\n!\n31-Hifumi20.png\n: Ah, I see. So \"she\" was actually a\n**\nhe\n. Interesting. Thank you for confirming this fact.\n32-Hifumi11.png\n: WHAAAAAAAAAAAAAAAAAT!?\n33-Hiro7.png\n: ...You're joking, right?\n28-Sakura11.png\n: I wouldn't joke about this!\n34-Taka14.png\n: Th-Th-Then... Then it's really true!?\n36-Makoto33.png\n: Chihiro was...a guy?\n37-Monokuma11.png\n: Hmm? Oh what, you guys didn't know? Heck, I knew that right off the bat!\n38-Monokuma5.png\n: Chihiro Fujisaki was totally a guy!\n39-Jill4.png\n: Th-Then...he was a cross-dresser!? Now I'm REALLY on fire! I wish I HAD killed him!\n41-Monokuma10.png\n: So that's what Kyoko wanted to show everyone, huh? Interesting...\n22-Kyoko2.png\n: ...\n42-Monokuma4.png\n: Puhuhu. Yes, that certainly does make things much more exciting!\n43-Monokuma12.png\n: Now let's ride this wave of excitement back to the courtroom and\n**\nget back to the trial\n!\n45-ClassTrialDawn.png\n41-Monokuma10.png\n: Ahem! I do apologize for keeping you waiting. Now then, let's\n**\nresume\nthe class trial! We've all just learned of the shocking revelation that Chihiro was actually a\n**\nboy\n! Let's pick up from there!\n8-Kyoko17.png\n: Yes, well...I don't know his reason for hiding it, but the fact is, Chihiro was not a girl, but a boy.\nTo think that Chihiro...was actually a guy. The thought had never even crossed my mind...\n46-Kyoko7.png\n: And because the victim was male, he would have had no problem gaining access to the boys locker room.\n48-Byakuya10.png\n: Assuming his handbook did, in fact, list his gender as male...then yes, that would be true.\n42-Monokuma4.png\n: Of course\n**\nhis handbook said he was a boy\n! He dressed like a girl, but he was a boy through and through!\n49-Kyoko14.png\n: So then, there should be no issue with Makoto's initial assertion... The victim was killed in the boys locker room, and was then later moved to the girls locker room. And the killer could have easily used Sayaka or Junko's handbook to get into the girls locker room.\n50-Taka13.png\n: So Chihiro really was killed in the boys locker room!?\n8-Kyoko17.png\n: I still don't understand the motive for moving the body, but...yes, that does seem plausible.\n48-Byakuya10.png\n: Well...I must admit, I did find it rather odd... I knew he felt a little...off. There was a certain incongruity to his \"female\" body.\n19-Jill6.png\n: This is a most titillating situation!\n52-Byakuya9.png\n: So now everything has been connected. All the mysteries have finally become clear.\n54-Hina16.png\n: Okay, well, connected or clear or whatever... We still think *you're* the killer, remember?\n55-Byakuya3.png\n: Hmhm. Very interesting. This has become very interesting indeed...\n56-Hifumi.png\n: Ahh, he's off in his own little world...\n49-Kyoko14.png\n: What about you, Makoto? After everything we've learned, do you still think Byakuya's the killer?\n57-Makoto2.png\n: Well, without a doubt Byakuya's the one that made Chihiro's death look like Genocide Jack did it.\n59-Makoto35.png\n: But...but I... I think he might not actually be the killer after all.\n60-Hifumi2.png\n: What? But aren't you the one who accused him in the first place?\n4-Makoto20.png\n: He just seems to be too...easygoing about all this. Like he's enjoying us solving the mystery. The way he's acting, it makes it seem like it doesn't have anything to do with him.\n61-Celeste17.png\n: And you think that might be because it *doesn't* have anything to do with him?\n4-Makoto20.png\n: Plus, the evidence he left behind was a little too...how can I put it? Overt. He consciously chose to use the extension cord, knowing it could connect him to the murder. At least, that's how I see it...\n62-Byakuya.png\n: ...\n57-Makoto2.png\n: And Byakuya, when you found out the murder took place in the boys locker room, it seemed to rattle you. And then again when you found out Chihiro was actually a guy... If you really were the killer, that stuff wouldn't have had any effect on you.\n64-BoysLifeofDespair.png\n52-Byakuya9.png\n: So that's your thinking, huh? Well, it bothers me that you don't have more concrete reasons, but...\n65-Byakuya7.png\n: It's fine. I guess I'll mark it as correct, for the time being.\n66-Hina12.png\n: Mark it as...correct?\n62-Byakuya.png\n: He's right. I am not the culprit. I just happened to come across the corpse in the girls locker room, and decided to\n**\nalter\nit.\n68-Mondo8.png\n: Are you fucking with us right now...?\n69-Byakuya2.png\n: No, I am not...\neffing\nwith you right now. I'm telling you\n**\nthe truth\n.\n70-Taka4.png\n: Well I find it very hard to believe!\n65-Byakuya7.png\n: Go ahead, find it very hard to believe. You're free to be executed along with the rest of us.\n54-Hina16.png\n: If you're really telling the truth, then...why? Why'd you do that to his body?\n55-Byakuya3.png\n: My reasons hardly matter right now. Uncovering the culprit is much more important, wouldn't you say?\n71-Byakuya8.png\n: Now then...if it wasn't me, who was it?\n72-Makoto26.png\n: W-Well...I don't think I can say for sure without talking about it a little more.\n74-Hiro4.png\n: We're seriously gonna keep going? We're all good, aren't we? I thought it was clear Byakuya did it!\n8-Kyoko17.png\n: No, I'm with Makoto. If there's any doubt whatsoever, we need to explore every possibility. Because if we're wrong, we all die here.\n75-Celeste4.png\n: ...That's true. Very well then, I'm with you, too.\n76-Hiro2.png\n: Damn straight! Count me in!\n77-Taka9.png\n: Do you not have a mind of your own!?\n78-Hiro16.png\n: Of course I do! What am I, an ant or something'?\n4-Makoto20.png\n: Anyway, let's discuss this all as a group one more time. We still have to make our decision.\n14-Sakura.png\n: That's very true...\n80-Hina14.png\n: Our lives are all on the line...\n81-Byakuya4.png\n: Excellent! Then shall we resume our game of hide and seek?\nBut if Byakuya didn't do it then who's the real killer? Who murdered Chihiro? There's one thing we can be sure that we know about the killer...\n> The killer is a guy\nSince the crime scene was the boys locker room, you would need a\n**\nboy's handbook\nto get in... Since Leon's handbook is apparently broken, the killer would have had to use their own. In other words...it had to have been a\n**\nguy\n. But that's still not enough... I need to find some more clues.\n",
            "testimonies": [
                {
                    "testimony": "Isn't there a single clue that might lead us to who did it?",
                    "person": "Sakura",
                    "present": []
                },
                {
                    "testimony": "Well, clues are one thing, but...",
                    "person": "Taka",
                    "present": []
                },
                {
                    "testimony": "Did nobody get a look at the killer!?",
                    "person": "Taka",
                    "present": []
                },
                {
                    "testimony": "I'm sure is someone saw the killer, they woulda said something by now...",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "Perhaps someone saw the victim at some point. Even that might be enough for now...",
                    "person": "Sakura",
                    "present": []
                },
                {
                    "testimony": "Yeah, all we need right now is any kinda new info .",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "It's over... It's all over...! You wanna know who saw the victim? The killer! And only the killer ... And it's not like they're just gonna turn themselves in... Game over, man! Game over!",
                    "person": "Hiro",
                    "present": [
                        "Celeste's Account"
                    ],
                    "source": {
                      "evidence_span": "Chihiro was spotted leaving the warehouse.",
                      "testimony_span": "You wanna know who saw the victim? The killer! And only the killer",
                      "is_self_contained": "yes",
                      "context_span": ""
                    }
                },
                {
                    "testimony": "Hyaaaah! No! Not game over!",
                    "person": "Hifumi",
                    "present": []
                }
            ],
            "summarizedContext": "Everyone is discussing if anyone saw the victim at some point.",
            "noPresent": false,
            "labels": [
              "behavioral"
            ],
            "reasoning": [
              "Fact 1: The witness claims no one except the killer saw the victim.",
              "Fact 2: The evidence suggests that Celeste saw the victim.",
              "Prop 1: If a victim is seen by another person, the victim was not seen by only the killer."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "First of all, we know where Chihiro was headed... He was on his way to go exercise .",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "So next we have to ask... Why did he choose the specific tracksuit that he did?",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "What do you mean, the specific tracksuit?",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "I got it! He picked that tracksuit because it matched the one the culprit was wearing!",
                    "person": "Taka",
                    "present": []
                },
                {
                    "testimony": "So what you're saying is the killer was wearing the same blue tracksuit as him? My tracksuit is black !",
                    "person": "Mondo",
                    "present": [
                        "Celeste's Account"
                    ],
                    "source": {
                      "evidence_span": "It seems she was stuffing some blue exercise clothes into a duffel bag. Presumably she was on her way to exercise, but the clothes were not found at the crime scene. Celeste had not told anyone other than Makoto about this encounter.",
                      "testimony_span": "the killer was wearing the same blue tracksuit",
                      "is_self_contained": "yes",
                      "context_span": ""
                    }
                },
                {
                    "testimony": "I-I don't even have a tracksuit... Cuz exercising sucks!",
                    "person": "Hifumi",
                    "present": []
                },
                {
                    "testimony": "I have a white tracksuit , personally. I got it from the warehouse, if you must know!",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "Did any of that really help us get any closer to figuring out who the culprit is...?",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "No way... Not a chance...",
                    "person": "Mondo",
                    "present": []
                },
                {
                    "testimony": "You heard him, right? What he just said without even realizing it?",
                    "person": "Kyoko",
                    "present": []
                }
            ],
            "summarizedContext": "Everyone is discussing the clothing of the victim when she was spotted.",
            "noPresent": false,
            "labels": [
              "behavioral"
            ],
            "reasoning": [
              "Fact 1: The witness claims he knows the victim was wearing a blue tracksuit.",
              "Fact 2: The evidence suggests only Celeste and Makoto knew the victim was wearing a blue tracksuit.",
              "Prop 1: If only two people know a fact, then the third person cannot have known that fact."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "4-ClassTrialTHESUN.png\n5-Makoto30.png\n:\n**\nMondo\n...your handbook got broken in the sauna, didn't it?\n6-Mondo11.png\n: Wh-Wh-What!?\n7-Taka12.png\n: Why!? Why do you keep accusing him!?\n8-Makoto20.png\n: Mondo and Taka had an\n**\nendurance contest\nin the sauna not too long ago, remember?\n9-FlashT.png\n11-FlashB.png\n8-Makoto20.png\n: And for the contest, Mondo just so happened to keep his school uniform on. But little did he realize, he'd also left his handbook in one of his uniform pockets.\n5-Makoto30.png\n: And when it was all over, Mondo discovered that taking your handbook into the sauna could easily destroy it.\n13-Mondo9.png\n: Ngh... Grrhh...!\n14-Taka11.png\n: No, wait, hold on...! You've got it all wrong! He would never kill--!\n7-Taka12.png\n: I don't accept this! Show me the proof! The actual, solid proof!\nI mean...I don't want to believe it either. But... But I found something that proves it beyond a shadow of a doubt...\n",
            "testimonies": [
                {
                    "testimony": "Let's test Makoto's assertion. If what he says is correct, then Mondo you broke your own handbook.",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "In other words, if Mondo's handbook is actually broken then that proves that what Makoto said is right.",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "Well my goddamn handbook works just fine !",
                    "person": "Mondo",
                    "present": [
                        "Broken e-Handbook"
                    ]
                },
                {
                    "testimony": "S-See? Look! Makoto was wrong , after all! Mondo wouldn't hurt a fly!",
                    "person": "Taka",
                    "present": []
                }
            ],
            "noPresent": true
        }
    ]
}