{
    "previousContext": "2-WelcometoDespair.png\n???: ... Nng... *Sniff* *Sniff sniff*\n4-HinaCrying.png\n5-Hina25.png\n: I know I shouldn't cry... But... I've had enough. I can't take it anymore. Getting out of here...anytime soon... It's...impossible. I can't let myself think about...how much I want to get out of here. If I keep thinking like that, I might decide to...\n5-Hina25.png\n: ... ...Donuts. I need to eat some donuts...! That'll cheer me up!\n8-Hina14.png\n: Glazed donuts, twisty donuts, jelly donuts, cream-filled, donut holes, malasadas...!\n9-Hina22.png\n: O god of donuts! I'm praying for a wonderful encounter!\n8-Hina14.png\n: *Sniff* I'm sorry... Please forgive me for breaking the nighttime rule... But right now, for me...donuts are absolutely necessary...!\n*Grr grnnn*\n(mechanical sounds)\n12-DespairSyndrome1.png\n13-Hina11.png\n: ...Huh?\n*Grn grn grrnnn*\n14-Hina12.png\n: What's that sound?\n*Grn grn*\n15-Hina9.png\n: It sounds like it's coming from...the bathhouse...\n*Grn grrrrnn grrn*\n15-Hina9.png\n: I'm super scared, but...\n15-Hina9.png\n: I-Is...? Is someone there? ... *Gasp*\n17-Hina13.png\n: KYAAAAAAAAAAAAAAAAAAAHHH!\nThe morning after the conclusion of the second class trial...\n21-BeautifulDeath.png\nEveryone met up in the dining hall, just like always. And I expected it to start like any other day. That's what I expected, but...\n23-Hiro14.png\n: Today's count kinda sucks, huh? Toko and Byakuya still refuse to show up...\n24-Hifumi2.png\n: And I haven't seen Miss Asahina anywhere.\n26-Sakura4.png\n: She said her stomach was hurting, so she's taking it easy in her room for today.\n27-Celeste8.png\n: That is rather unusual for her. Normally she is so full of energy.\n26-Sakura4.png\n: Which is exactly what makes me worry...\n29-Kyoko3.png\n: So it's just the seven of us, then?\n30-Makoto.png\n: It looks that way...\n31-Hiro15.png\n: It's times like this where the committee chairman needs to get things going with a BANG!\n33-Taka19.png\n: ...\n34-Hiro13.png\n: Or not...?\n33-Taka19.png\n: ...\nTaka hasn't said a word since everything that happened yesterday... One look at his face showed he hadn't slept a wink last night. It must be because of Mondo...\n35-FlashT.png\n37-FlashB.png\nThe two of them became so close, and then he finds out Mondo killed Chihiro... And then...having to watch Mondo get...punished. And nothing he could do about it... I can't even imagine what it must have done to him.\n24-Hifumi2.png\n: So, I mean...what's gonna happen now? We haven't found any way out, and we have no idea if help's ever gonna come.\n39-Hifumi19.png\n: Ngh! Now I'm all depressed just thinking about it...\n41-Celeste4.png\n: We simply have to make the best of things--do our best to get along and live here together in peace. Forget about the outside world, and accept this new life. That is the only hope we have now.\n30-Makoto.png\n: What...? To live here forever...?\n42-Celeste6.png\n: Here we have every convenience. We have food, clothes, our every need is seen to. Why are you dissatisfied? In fact, let me ask you this? What is it about the outside world that you long for?\n43-Celeste16.png\n: Competition, discrimination, victimization and violence... As society grows, so does its perversion. In which case, is our current situation not--\n45-100MileJunkFoodDash.png\n46-Hifumi12.png\n: Demon Angel☆Pretty Pudgy Princess...\n42-Celeste6.png\n: Hmm?\n48-Hifumi15.png\n: Meggy, the drill shop owner, the bunny-eared Amazon, Catgirl Dogboy, Robo Justice and the Galactic King... And...! And--!\n49-Hifumi13.png\n: What I mean is, there's no 2D here!\n50-Celeste9.png\n: The mastermind puts such base desire to their advantage, bending you to their will...\n21-BeautifulDeath.png\n52-Hiro12.png\n: Okay, well, anyway... Since Taka's like, catatonic...\n53-Hiro2.png\n: As the oldest one here, I'm officially stepping up to take the lead! So! We're all gonna work together and spend the rest of the day searching the school!\n30-Makoto.png\n: Searching...?\n52-Hiro12.png\n: Well, I mean...since the class trial is over and all...\n55-Sakura3.png\n: ...there should be new places for us to investigate.\n53-Hiro2.png\n: Yeah, that's the ticket! Maybe we'll find some kind of clue this time!\n56-Sakura.png\n: Then once we're done eating, let's split up and begin looking around. So you have any problem with that, Celeste?\n41-Celeste4.png\n: Hmm... There may well be a discovery waiting for us which may further enrich our life here.\n57-Hifumi9.png\n: Er, no...the point is to look for clues.\nAnd just as we were starting to come together,\nshe\nbarged in and ruined the conversation...\n45-100MileJunkFoodDash.png\n59-Jill7.png\n: You called for me, and so I appear! Genocide--!\n60-Hifumi10.png\n: Ahh! Nobody called for you!\n61-Hiro5.png\n: What the...? How come it's Genocide Jill, and not Toko?\n59-Jill7.png\n: God, this place is just AMAZING! Finally a place I can just be my murderous self! Which is why I've decided to stop holding back and spread my wings! No more hiding in a cave for me!\n62-Jill6.png\n: Plus, I have another battle to fight! The whole \"killer with a split personality\" thing is sooo overdone. I gotta destroy that stereotype!\n64-Jill8.png\n: I'll fight all day and all night to murder those totally slanderous cliches!\n61-Hiro5.png\n: But...you *are* a killer with a split personality...\n46-Hifumi12.png\n: Gh--! If she weren't here, my chances of survival would go up AT LEAST 10%!\n62-Jill6.png\n: C'mon, you gotta back me up here! Even the biggest stars need the little people to hold them up!\n66-Jill3.png\n: Kyeeehahahaha!\n56-Sakura.png\n: Well, whatever else we do today, first we should eat. We can't do anything on an empty stomach.\n30-Makoto.png\n: You're right. Let's hurry up and eat so we can start our investigation...\n66-Jill3.png\n: Kyeehahaha!\nSo we were forced to eat breakfast with a murderer. And after our much needed but very annoying meal we set to work looking around the school.\n21-BeautifulDeath.png\n69-Narration.png\n: Time to search the school for clues. We begin our search on the second floor, where Hiro is waiting.\n52-Hiro12.png\n: Nothing's changed on this floor. The only difference is the gate blocking the stairs leading up to the 3rd floor is gone. I guess that's where they want us to head next. I wonder what kinda crazy stuff is up there...!\n69-Narration.png\n: He's right, the gate is raised up.\n30-Makoto.png\n: The 3rd floor of Hope's Peak Academy... I wonder what we're gonna find this time... What's...up here?\n69-Narration.png\n: It's very purple in here. This is the map of the 3rd floor. A few large rooms and some poor hallway design decisions. A fire marshall would probably not be happy about these snaking hallways.\n69-Narration.png\n: Down the upper hall are the two classrooms on this floor. Let's check out 3-A first.\n55-Sakura3.png\n: The windows up here are also barred with metal plates. Not surprising, I suppose.\n30-Makoto.png\n: So escape still looks impossible...\n56-Sakura.png\n: But I'd better check all the other metal plates again, just to be sure.\n69-Narration.png\n: 3-B is empty. I'm not really sure what the text on the bottom of the chalkboard says because this is as visible as it will ever get. I think it says \"Pick my nose.\"\n69-Narration.png\n: Back in the hall across from the staircase is this door to the Rec Room.\n30-Makoto.png\n: Hmm... So this is...\n27-Celeste8.png\n: A recreation room. A place for students to come and relax...\n30-Makoto.png\n: I never would've imagined a school having a place like this...\n82-Celeste7.png\n: Well, no normal school would. It has Othello, shogi, even a dartboard and a pool table. And look at this...\n82-Celeste7.png\n: They have even provided us with a remarkable number of magazines.\n41-Celeste4.png\n: Those will certainly be helpful in keeping our boredom at bay.\n85-MrMonokumasLesson.png\n86-Monokuma.png\n: Ring ring ring! Hello there! Allow me to explain! We've got fashion, motorcycles, martial arts, video games, baseball, science, all kinds of magazines!\n87-Monokuma7.png\n: Oh, but nothing dirty! This is a school, after all. If you need a quick fix, check out the swimsuit mags!\n82-Celeste7.png\n: And will you be adding to our collection as new issues come out?\n89-Monokuma13.png\n: Sorry, no can do. Even if I wanted to, right now magazines are kinda...\n30-Makoto.png\n: Kinda what...?\n90-Monokuma4.png\n: Oops! Nothing, never mind, no no no! Anyway, that's it for my expoundation. Bye-bye! *leaves*\n21-BeautifulDeath.png\n27-Celeste8.png\n: ... What he just said...\n30-Makoto.png\n: I know, right? It bothers me, too...\n92-Celeste5.png\n: Life here would be that much nicer if he could add some new issues once in a while. How disappointing.\n30-Makoto.png\n: R-Really...?\n69-Narration.png\n: We can now take a quick look around the room.\nA pool table isn't normal school equipment... Is this thanks to Monokuma, or did the school buy it...?\nThere's a copy of Othello here. I'm pretty bad at it, though...\nThere's...even a dartboard. Did Monokuma put this here, or was it always part of the school...?\nThere are all different kinds of magazines here on the shelf. They even have a bunch of monthly comics. But... without getting regular updates, what's the point?\n69-Narration.png\n: In a corner of the hall we can find Kyoko.\n99-Kyoko11.png\n: So the 3rd floor opened up this time... After a brief investigation, it looks like there's a physics lab and an art room. I also found a huge machine of some kind in the physics lab. I wonder what it does...\n69-Narration.png\n: Like the 2nd floor, the 3rd floor has a large open area with pillars.\n69-Narration.png\n: The art room is just off this space.\nAt first glance, this looks like any normal art room. But something about it seems off. Or multiple somethings...\n106-Hifumi4.png\n: Well, well. Look at all this equipment! It certainly scratches that artistic itch of mine... Art supplies, of course, but they've also collected all kinds of\n[sculpting tools]\n!\n> sculpting tools\n30-Makoto.png\n: So, Hifumi...do you like sculptures and figurines and stuff?\n107-Hifumi3.png\n: Well normally, I limit myself to 2D. But figurines are like, borderline 2D, so it's okay.\nI don't know how that's \"borderline\" but okay...\n45-100MileJunkFoodDash.png\n109-Hifumi.png\n: I'm a fan of Charanbo, Pumpkinhead, and I especially admire anything that Saburo Ronppongi makes. Charanbo's ability to express the movement of muscles is exquisite, as seen in his Mama Cat series. Pumpkinhead is like a little sculptor fairy, representing this century's greatest quality! Saburo Ronppongi, meanwhile, is known for his Mecha Musume series, which led to a worldwide tour.\n106-Hifumi4.png\n: Truly they can only be regarded as the Elite Four!\n30-Makoto.png\n: But...one of your elite is missing.\n49-Hifumi13.png\n: Well the Elite Three just sounds stupid, now doesn't it!?\n111-Hifumi5.png\n: Besides, that empty seat rightly belongs to...me! Hmhmhm. It begins... Today begins my reign as the legendary ruler of the next century!\n30-Makoto.png\n: I see... Well, good luck with that.\n69-Narration.png\n: I'm gonna need some thread help with those references. I've never heard of any of them before. In the meantime, let's look around the room a little.\n21-BeautifulDeath.png\nThis is a statue of Nio. I've never really heard of anyone using a Nio statue for life drawing classes or whatever...\nIs this...a statue of Monokuma? Who would ever want to make something like this? Still, the quality is...surprising.\nIt's...a Venus statue. Yup, definitely very art room-ish.\n69-Narration.png\n: There's a door in the back corner leading to a room attached to this one.\nThis is the repository that's attached to the art room. It's used to store different artsy things...\nThere are wooden mallets hanging on the wall. If I had to guess, I'd say they use them for making sculptures.\n69-Narration.png\n: What's this down here?\n30-Makoto.png\n: There's...something on the floor. It looks like...a picture.\nBut as I stretched out my hand to pick it up...almost as if on its own, my hand froze.\n121-DISTRUST.png\n122-Makoto2.png\n: Huh...?\nWhat I saw in that picture was...Chihiro, Leon, and Mondo. And they were...smiling.\n122-Makoto2.png\n: What is this...?\nQuestions started racing through my head, one after the other. Why is it only these three people? What are they doing together? How come they're smiling like that? When was it taken? Who took it? Where's the camera they used? How'd they get it developed? And in the picture, the window in the classroom...\n122-Makoto2.png\n: There's no metal plate covering it! Which must mean, wherever this picture was taken... It...wasn't here at Hope's Peak?\nBut there was no time to find an answer. All the questions floating around in my head were quickly drowned out by...\n124-Monokuma2.png\n: That's mine! Give it back!\nMonokuma appeared out of nowhere and snatched the photo, and any chance I had at answers evaporated.\n90-Monokuma4.png\n: You peeked, didn't you!? Well, they all had some pretty dazzling smiles, huh?\n89-Monokuma13.png\n: They were definitely living their school life. It's like they ripped a page right outta the book of youth!\n122-Makoto2.png\n: What's going on with that picture? Do you know...?\n126-Monokuma10.png\n: I'm not tellin' you nothin'! *leaves*\n122-Makoto2.png\n: Why can't you give me a straight answer!?\nNever mind... I don't even know why I bothered asking...\n21-BeautifulDeath.png\n69-Narration.png\n: Down the hall there's another gated staircase leading up to the next floor. We obviously can't go up here yet.\n69-Narration.png\n: At the end of the hallways is the Physics room.\nThis is...the physics lab. It's less like a classroom and more like some kind of research institute...\n69-Narration.png\n: Well, Taka's here. Let's see if we can get him to talk to us.\n30-Makoto.png\n: Hey, Taka. Don't you think this place is like some kind of research institute?\n33-Taka19.png\n: ...\nStill no reaction...\n69-Narration.png\n: Well, we tried. What's this huge thing?\n30-Makoto.png\n: What's up with this ridiculously big machine...?\n85-MrMonokumasLesson.png\n86-Monokuma.png\n: Watch out!\n30-Makoto.png\n: Wh-What--?\n87-Monokuma7.png\n: What, you wanna do some quantum leaping!?\n30-Makoto.png\n: Huh...?\n126-Monokuma10.png\n: That's a time machine! Pretty awesome, right? It was designed by a student right here at Hope's Peak! The Ultimate Physicist... Although, they\ndon't go here\nanymore. They died during The Tragedy!\n33-Taka19.png\n: A time machine...? Seriously...? So...it can go back in time...? Okay, then...let me get in there... If I can go back to the past...then I can...\n139-Taka6.png\n: This time I'll stop Mondo for sure--!\n126-Monokuma10.png\n: Oh, sorry, not possible. This particular time machine can only go back one minute. It comes in handy when you, like...leave your pizza bagels in the microwave one minute too long.\n141-Taka5.png\n: One minute...?\n142-Monokuma11.png\n: Hmm... You sound disappointed.\n90-Monokuma4.png\n: But actually, I was lying about the whole thing anyway. There's no such thing as time machines!\n141-Taka5.png\n: What...?\n86-Monokuma.png\n: Honestly, it's just an\nair purifier\n.\n30-Makoto.png\n: Air purifier...?\n89-Monokuma13.png\n: It can produce clean air no matter where you're at. With that thing, you could even live on Mars! But what with the discombobulating gravity and deadly low temperatures, you prolly don't wanna live on Mars.\n86-Monokuma.png\n: Anyway, this machine is the reason you guys have all this delicious air. So don't go messing with it! You break it, and it's your butt! *leaves*\nThis huge thing is just...an air purifier? And more than that...\n21-BeautifulDeath.png\n33-Taka19.png\n: ...\nTo go out of your way to say something you know will hurt someone who's already suffering...\n122-Makoto2.png\n: God damn you!\nOh this is... It's a digital camera. It's got some kind of weird anime style design on it... It's kinda beat-up, but it looks like it still turns on just fine... Yup, it still works! I should show the others later.\n69-Narration.png\n: There's a room attached to here as well, just like the art room.\nThis is...the equipment room. It's super disorganized...and there's a strange chemical smell in the air...\n62-Jill6.png\n: Ahhh, this place is sooo relaaaxing! Sooo calming! The smell of formaldehyde is almost unbearable... It's so tempting! Ahhh, I wanna just dunk myself right in it!\n30-Makoto.png\n: ...\nOf course Genocide Jack likes it. That just goes to show how disgusting it really is...\n69-Narration.png\n: There's actually nothing important to check out in here other than that conversation. In fact, the game doesn't even give you the chance to look.\n30-Makoto.png\n: Hmm...\nI discovered lots of stuff. And it was all strange. But I dunno if any of it was an actual clue... I'm just getting more confused.\n30-Makoto.png\n: Maybe I should head to the dining hall and talk about it with everyone else... For now, I should head to the dining hall.\nWhen I got back to the dining hall, the first thing I noticed was...\n3-100MileJunkFoodDash.png\n4-Hina12.png\n: Ah--!\n5-Makoto.png\n: Hina!?\nI tried to talk to her, but my voice was immediately drowned out by the others as they rushed into the dining hall.\n7-Sakura5.png\n: Hina!\n8-Hiro7.png\n: Huh? I thought she was sick or somethin'.\nEveryone rushed past me and crowded around Hina. Being surrounded by everyone like that, Hina looked really uncomfortable.\n7-Sakura5.png\n: Are you feeling better already?\n9-Hina6.png\n: Y-Yeah... I ate a few donuts, and that really helped a lot.\n5-Makoto.png\n: You do love those donuts...\n11-Celeste7.png\n: But...wasn't it your stomach that was hurting?\n12-Hina9.png\n: Well, my stomachache kinda made me hungry, so...you know...\n9-Hina6.png\n: Er, ahaha...I guess my memory's kinda fuzzy lately...\n13-Hifumi17.png\n: They say that a goldfish will eat however much food you give it, even if it's about to burst. Miss Asahina's pretty much the same, it looks like.\n15-Hina15.png\n: Hey! You of all people don't have any room to talk!\n16-Sakura4.png\n: Anyway... I was worried about you.\n17-Hina14.png\n: S-Sorry...\n19-Jill.png\n: Besides that, you--!\n20-Hina2.png\n: H-Huh...?\n21-Jill5.png\n: Jeez, your knockers are HUGE! What the heck, did you convince them to double up on milk production!?\n23-Sakura11.png\n: Stay away from her, fiend.\n24-Narration.png\n: Had you noticed this Japanese game was so far lacking in boob jokes? Well don't worry, Jill has you covered.\n26-Hiro5.png\n: A-Anyway...first thing's first, we should talk about what we found. Right, Taka?\n27-Taka19.png\n: ...\n28-Hiro2.png\n: ...Right.\n30-BeautifulDeath.png\n24-Narration.png\n: We have to speak with everyone to progress the story. We may as well begin with Hina.\n20-Hina2.png\n: Um, I wasn't able to help much with the investigation, but...I did make one discovery...\n32-Hiro12.png\n: It didn't happen to be a donut-related discovery, did it?\n33-Hina19.png\n: What does that even mean? Never mind... It's about the nurse's office! Remember? There's one on the 1st floor, right?\n34-Sakura3.png\n: I remember. But it's locked.\n36-Hina22.png\n: Actually...not anymore.\n37-Sakura7.png\n: Did you find any protein in there? Or even vitamin supplements would be fine.\n33-Hina19.png\n: I did look, but no dice... Just a bunch of headache medicine and over-the-counter stuff.\n16-Sakura4.png\n: I see... That's disappointing.\n17-Hina14.png\n: It *is* disappointing. Like the end of the world is already here...\nI-I'm not sure it's *that* disappointing...\n40-Jill9.png\n: The long road to maidenhood begins with a single step... That road may begin with only wrinkly old men, but it will end with strapping young adorable boys!\n41-Hiro14.png\n: What the hell are you talking about...?\n42-Jill3.png\n: Kyeehahaha!\n44-Kyoko2.png\n: There was a rather remarkable physics lab on the 3rd floor. In the middle of the room, there was a machine bigger than anything I've ever seen before...\n5-Makoto.png\n: Oh yeah, apparently it's an air purifier.\n8-Hiro7.png\n: Huh? What's something like that doing there?\n34-Sakura3.png\n: Is the device really that big?\n20-Hina2.png\n: I...really don't get it.\n27-Taka19.png\n: ...\n32-Hiro12.png\n: Oh, I just remembered! I saw Byakuya a little while ago.\n19-Jill.png\n: What!?\n48-Jill8.png\n: Where!? WHERE WAS HE!?!?\n49-Hiro8.png\n: Y-You're kinda scarin' me...\n48-Jill8.png\n: Where. Was. HE!?\n26-Hiro5.png\n: He was in the locker room... He had a huge stack of books he musta got from the library.\n50-Jill4.png\n: So THAT'S where he was hiding! I won't let him get away from me! Kyehehe... *leaves*\n26-Hiro5.png\n: She just...ran off!\n5-Makoto.png\n: Is...is she okay?\n52-Celeste4.png\n: We should not concern ourselves with her.\n27-Taka19.png\n: ... ...\nIt's no use...\n57-Celeste3.png\n: There *is* one piece of good news. There just so happens to be a rec room up on the 3rd floor! I have no doubt that our student life here will be even more enjoyable because of it.\n52-Celeste4.png\n: Hmhm. Will someone join me in a game of Othello sometime?\n60-Sakura.png\n: I searched the entire 3rd floor, but...all the windows in the halls and the rooms were blocked off.\n61-Hiro13.png\n: I wish they'd give this a rest already, for serious! Gimme back my bright blue skies!\n52-Celeste4.png\n: Just forget about it.\n61-Hiro13.png\n: You make it sound like I dropped a nickel or something!\n34-Sakura3.png\n: Just to be sure, I went from one end to the other, testing each metal plate. None of them budged. It would seem escape via the 3rd floor is as impossible as we feared...\n5-Makoto.png\n: I see...\n64-Hifumi4.png\n: There was an art room on the 3rd floor, and it had all kinds of gear. Myehehe... Now I'll be able to recreate all my favorite\n[anime characters]\n!\n> anime characters\n5-Makoto.png\n: Oh yeah! Speaking of anime, that reminds me... I found something while I was looking around!\n60-Sakura.png\n: Hrm...a digital camera?\n5-Makoto.png\n: That's what it seems like...\n28-Hiro2.png\n: Does it still work?\n5-Makoto.png\n: Yeah, it seems fine.\n66-Hiro.png\n: Well then, let's see it!\n41-Hiro14.png\n: What the heck? This thing is like a kid's toy! It looks like it can store like five pictures, maybe? It doesn't have a timer or anything!\n68-Celeste6.png\n: On top of that, its appearance seems...questionable. Is this some kind of anime character? Strange...\n69-Hifumi13.png\n: Rude! She's not strange! She's Princess Piggles, from\n\"Demon Angel☆Pretty Pudgy Princess\"\n!\n5-Makoto.png\n: Oh, you recognize this, Hifumi?\n70-Hifumi12.png\n: Of course I recognize it! It's a super rare prize that was given away at a bingo contest at a big anime convention... You have any idea how much I had to pay that guy to get my hands on it!?\n72-Hifumi10.png\n: Wait...that's my camera!\n5-Makoto.png\n: What!?\n70-Hifumi12.png\n: Wh-Where did you find it!?\n5-Makoto.png\n: In the physics lab...\n70-Hifumi12.png\n: It's my most prized possession. I brought it here with me, but I lost it the first day, along with my phone.\n74-Celeste8.png\n: Why would it have reappeared in the physics lab...?\n70-Hifumi12.png\n: Agh, but look at it! It got all messed up!\n76-Hifumi6.png\n: Like when someone steals a sticker from your collection, or you buy a secondhand shirt... Well, that's it...\n5-Makoto.png\n: Huh? That's it...?\n70-Hifumi12.png\n: It's not mint condition. I don't need it anymore...\n5-Makoto.png\n: But weren't you just saying how much it meant to you?\n52-Celeste4.png\n: Then...may *I* have it? I might be able to find some sort of use for it. If any of you would like to borrow it, please feel free to ask.\n78-Hina20.png\n: Well...I can't really imagine any of us are gonna need to take any pictures or whatever...\n5-Makoto.png\n: Yeah, true...\nOkay, I've heard what everyone else has to say. So now it's my turn...!\n80-Makoto2.png\n: Hey, um...can I tell you guys something? I found something that's...kinda been bothering me.\n82-Kyoko9.png\n: What is it?\n80-Makoto2.png\n: I found this weird picture in the repository. Apparently Monokuma took it...\n4-Hina12.png\n: A weird picture? You mean, like...dirty!?\n80-Makoto2.png\n: No, not that kind of weird. It was...a picture of Leon, Mondo, and Chihiro all together.\n84-DISTRUST.png\n85-Kyoko13.png\n: Those three...?\n80-Makoto2.png\n: And the three of them were...laughing.\n76-Hifumi6.png\n: It showed the three of them together, laughing? When could it have been taken?\n80-Makoto2.png\n: And there's more... In the picture, there weren't any metal sheets covering the windows.\n37-Sakura7.png\n: Then...the picture wasn't taken here?\n74-Celeste8.png\n: But I don't recall hearing anything about them knowing each other before coming to this school.\n87-Hifumi2.png\n: You probably just imagined it! Monokuma cast a spell on you!\n80-Makoto2.png\n: No! I saw it, I'm telling you!\n20-Hina2.png\n: But if it wasn't taken before we got here, or *after* we got here...\n88-Hiro15.png\n: I bet they're all still alive! They left the school and then took that picture!\n44-Kyoko2.png\n: That's impossible. After all...\n90-Kyoko.png\n: ...we saw it with our own eyes.\n90-Kyoko.png\n: They're all dead.\n90-Kyoko.png\n: Either murdered or executed...\nAnd they're not the only ones...\nMonokuma killed Junko. And then there's...\n...Sayaka. *That* wasn't an illusion. It was real, I'm sure of it. They all died. There's no way any of them are still alive.\n80-Makoto2.png\n: So we have to figure out when that picture was taken...\n96-Celeste9.png\n: Monokuma most likely forged it. I can't imagine any other possibility.\nForged...? Is that all there is to it?\n41-Hiro14.png\n: Stay focused, man! Don't let Monokuma's bullcrap sidetrack you!\n98-Celeste.png\n: He's right. But more importantly...\n52-Celeste4.png\n: On another topic, there is something that has been\n[bothering me]\n. I would like to discuss that.\n> bothering me\n5-Makoto.png\n: What's bothering you, Celeste?\n99-Celeste2.png\n: It's about Hina...\n101-DespairSyndrome2.png\n102-Hina11.png\n: What? Me!?\n52-Celeste4.png\n: You said your stomach hurt, did you not? But I believe that was a lie. What really happened?\n4-Hina12.png\n: Huh?\n103-Celeste15.png\n: It varies from person to person, but whenever someone lies, they tend to have a way of showing it. It is called a \"tell\"--something that you can't hide, no matter how hard you try.\n104-Celeste16.png\n: Whenever Hina lies, the tip of her nose gets just a little bit longer.\n106-Hina10.png\n: What!? For real!?\n52-Celeste4.png\n: Actually, no.\n4-Hina12.png\n: Huh...?\n98-Celeste.png\n: But your reaction just now confirmed it--you *were* lying.\n106-Hina10.png\n: Th-That's no fair!\n57-Celeste3.png\n: Hmhm. If you are going to lie, at least try to lie convincingly.\n34-Sakura3.png\n: Hina...be honest. Were you lying about your stomachache?\n17-Hina14.png\n: ... Y-Yes...\n16-Sakura4.png\n: Why...? Why would you lie about that?\n109-Hifumi14.png\n: Are you feeling guilty about something!?\n110-Hina16.png\n: No, that's not it at all!\n17-Hina14.png\n: It's just... I mean, I have a reason for it!\nA reason...?\n17-Hina14.png\n: To be honest...I didn't have a stomachache. I did it cuz...even it I came and told you\n[the truth]\n, I thought you wouldn't believe me...\n> the truth\n5-Makoto.png\n: The truth...?\n17-Hina14.png\n: ...I saw it.\n5-Makoto.png\n: Saw what...?\n17-Hina14.png\n: A ghost...\n113-DespairSyndrome1.png\n114-Hifumi9.png\n: A ghost...? You mean like, THAT ghost!?\n115-Kyoko3.png\n: Is there more than one ghost...?\n5-Makoto.png\n: B-But...I mean, ghosts are...\n110-Hina16.png\n: See! I told you you wouldn't believe me!\n5-Makoto.png\n: I-It's not that I don't believe you, but...\n34-Sakura3.png\n: ...I believe you. No matter what anyone else might say, I will believe whatever you say, no matter what. So...can you tell us exactly what happened?\n17-Hina14.png\n: If you really mean that, Sakura...then okay. I'll tell you.\n20-Hina2.png\n: Umm, so...it happened last night.\n117-Flashback.png\n101-DespairSyndrome2.png\n20-Hina2.png\n: I was in bed, but I couldn't get to sleep. I just kept thinking about everything that's happened up till now. I ended up just getting more upset... So to try and cheer myself up, I thought I'd go get some donuts.\n41-Hiro14.png\n: Donuts again!?\n103-Celeste15.png\n: And you ignored the rule regarding nighttime...\n17-Hina14.png\n: I know, sorry. I feel really bad about that...\n60-Sakura.png\n: Anyway, please continue.\n20-Hina2.png\n: Well... So I left my room and headed for the warehouse...\n20-Hina2.png\n: But then I started hearing a strange sound...\n*Grr grnnn*\n*Grn grn grrnnn*\n20-Hina2.png\n: It was coming from the direction of the bathhouse. So I headed that way...\n20-Hina2.png\n: The locker was halfway open, so I took a look inside...\n20-Hina2.png\n: And I saw a human shape, surrounded by a pale green light. There's no doubt who it was... It was Chihiro!\n117-Flashback.png\n124-BoysLifeofDespair.png\n125-Hifumi8.png\n: KYAAAAAAAAAAAAAHHH!!!\n126-Hiro9.png\n: N-No way...! A gh-gh-gh-ghost!?\n74-Celeste8.png\n: It is simply not possible. You must be mistaken. Just as in most cases of \"paranormal\" activity, it was born from your weakened mental state.\n34-Sakura3.png\n: Then all we have to do is go see for ourselves, right? Let's just go to the bathhouse and see what Hina saw.\n96-Celeste9.png\n: It is a waste of time.\n5-Makoto.png\n: Maybe, but...there's no harm in it, right? If we don't find anything, that'll be the end of it.\n128-Hiro6.png\n: You're gonna go try and see a gh-gh-ghost...? Is that really a good idea? It might put a curse on you!\n110-Hina16.png\n: You can wait here if you want.\n129-Hiro10.png\n: I don't wanna be alone! Take me with you!\n90-Kyoko.png\n: What are you going to do, Celeste?\n103-Celeste15.png\n: I suppose I have no choice...\n87-Hifumi2.png\n: How about you, Mr. Ishimaru? Are you gonna wait here?\n27-Taka19.png\n: ...\n132-Hifumi18.png\n: ...I guess that's a yes.\n2-DespairSyndrome2.png\n4-Hina9.png\n: I-It was right here... I saw it right here in the dressing room!\n5-Hiro5.png\n: Urg... I'm getting goosebumps...\n6-Hifumi17.png\n: Ia! Ia! Cthulhu Fhtagn!\n7-Hiro10.png\n: Shut up! What if he actually shows up!?\n9-Sakura7.png\n: Hina...where was it you saw Chihiro's ghost?\n4-Hina9.png\n: Well, I heard a sound...and when I opened the locker...\n10-Hina14.png\n: ...I saw a kind of...pale outlines of Chihiro...\nUmm, is this the locker...? There was something in here...\nHuh? Inside the locker is...\n14-Makoto.png\n: ...a laptop? What's something like that doing here?\n15-Kyoko12.png\n: I remember seeing this...\nOh, that's right! I saw it in the library before.\n16-Flashback.png\nIt looks like a\nlaptop\n... It looks pretty old. And it's all covered in dust.\n18-Kyoko17.png\n: It's broken. I tried pressing the power button earlier, but nothing happened.\n14-Makoto.png\n: It's broken, huh? Too bad...\n16-Flashback.png\n14-Makoto.png\n: But how did the laptop get from the library...to here?\n20-Kyoko11.png\n: And...I guess it's in sleep mode, but...the power is definitely on.\n14-Makoto.png\n: Huh? But I thought it was broken...\n21-Sakura6.png\n: I would bet that Chihiro fixed it. After all, he was known as the Ultimate Programmer.\n23-Celeste7.png\n: More importantly... Hina, you said you saw a green light, yes? Surely you did not mistake the light of the monitor for a ghost?\n24-Hina12.png\n: ...\n25-Celeste9.png\n: I am surprised you are able to dress yourself in the morning.\n26-Hifumi20.png\n: Oh man. If I had the \"loves clueless girls\" attribute, I would've fallen in love big-time just now! I'm so glad I don't have it...\n28-Hina16.png\n: Well I didn't really expect to find a freaking laptop inside a freaking locker, okay!?\n29-Hiro4.png\n: It's okay. I mean, anyone can make a mistake like that.\n30-Hiro2.png\n: As a matter of fact, one time I thought I'd spotted a Grey alien, but it turned out to be a tadpole!\n31-Hina15.png\n: Don't compare what happened to me to one of your stupid delusions!\n33-Hiro16.png\n: Don't be mean! I was just trying to make you feel better! What if I get all depressed forever now!?\n14-Makoto.png\n: But listen, isn't this really strange? What's this laptop doing in here?\n34-Kyoko3.png\n: Maybe someone hid it here.\n35-Hiro12.png\n: If that's the case, we found it pretty easy...\n36-Kyoko.png\n: Whoever put it here, I don't think they were trying to hide it from *us*.\n14-Makoto.png\n: Huh...? What do you mean?\n34-Kyoko3.png\n: Haven't you noticed? There's one big difference between this room and all the others.\nThere's a difference...?\n14-Makoto.png\n: There's...no surveillance camera...\n38-Kyoko2.png\n: Precisely. There's no camera in here. Which means, this is the one spot where the mastermind is blind.\n40-Hifumi18.png\n: So you're saying someone put the laptop here so the mastermind wouldn't know about it?\n15-Kyoko12.png\n: And what Hina saw wasn't the ordinary glow of a computer screen. It was...the figure of Chihiro, shining pale green.\n36-Kyoko.png\n: I think it would be best if we investigated this laptop in a little more detail.\nIt's just like Kyoko said... The display isn't on, but the laptop definitely has power.\n36-Kyoko.png\n: So first of all, we have to wake it up.\n14-Makoto.png\n: Right...\nI started hitting random buttons on the keyboard...\n...and the display instantly began to glow a pale green. There were a bunch of different icons on the desktop.\n20-Kyoko11.png\n: There--the icon on the far left.\n14-Makoto.png\n: What is it...? It says...\nAlter Ego\n?\n23-Celeste7.png\n: \"Alter ego\" literally means...\"another self,\" I believe. In the field of artificial intelligence, it is not uncommon to create different aspects of a personality. You can consider it something like...a pen name.\n45-Kyoko13.png\n: Could you let me see it, Makoto?\nWith that, Kyoko moved between me and the computer. She moved the cursor over the Alter Ego icon...and when she double-clicked it...\n♪\nMusic cuts out.\n♪\n...the screen suddenly went dark. And then, a voice spoke to us...\n???: Master! You're here!\n48-DISTRUST.png\nChihiro's face appeared, taking up the entire display.\n49-Hiro9.png\n: I-It's a ghost! Buddha and sweet baby Jesus, save me!\n45-Kyoko13.png\n: Calm down. It's not a ghost.\n50-Hiro8.png\n: Huh?\n4-Hina9.png\n: Then...what is it?\n20-Kyoko11.png\n: I'm sure if we just talk to it, we'll find out.\nKyoko began to type, hands blurring across the keyboard.\n> \"What are you?\"\nAnd then...\n53-AlterEgoIntroduction.png\n54-AlterEgo.png\n: Hello, nice to meet you. I'm Chihiro Fujisaki...\n55-AlterEgo2.png\n: Eheh... I always get so embarassed introducing myself.\n14-Makoto.png\n: Th-That voice... The tone and everything...\n56-Sakura4.png\n: It's...Chihiro.\n20-Kyoko11.png\n:\nAlter Ego\n... I've heard about this kind of AI program, but I've never seen one for myself.\n14-Makoto.png\n: AI program...?\n20-Kyoko11.png\n: It's how Chihiro earned his title of Ultimate Programmer. The AI lives in a computer, and by repeating different tasks, it gains knowledge and grows bit by bit. Apparently, Chihiro used a support vector machine and reinforcement learning to develop it... Eventually, he came up with a breakthrough in artificial intelligence design.\n14-Makoto.png\n: Support vector machine...? Reinforcement learning...?\n18-Kyoko17.png\n: To put it simply, it's a learning method for computers.\n58-Hifumi14.png\n: If you wanna know more...just Google it, okay!?\n20-Kyoko11.png\n: But if this AI continues to grow, it will become more than just a piece of software to help people. Some say that an AI like this might someday *replace* people.\n60-Celeste8.png\n: And that is why it is called Alter Ego? A fine choice then, I must say... It can create memories, have thoughts, and \"grow up.\" The process isn't much different from how humans work.\n61-Celeste3.png\n: If you were to raise your own AI that way, it would make perfect sense to refer to it as your alter ego.\n20-Kyoko11.png\n: A second, perfect personality that can never forget or grow old. That's what Chihiro created. That's...Alter Ego.\n14-Makoto.png\n: Kyoko... How do you know so much about this?\n38-Kyoko2.png\n: ...\n63-Celeste17.png\n: Anyway, so he fixed the broken laptop and put his own program on there. That is what this means, yes? Then he brought the machine to this dressing room, where the mastermind would not be able to see it.\n26-Hifumi20.png\n: Hmm, but you know... All this about \"Master\" and whatnot... Yes, yes...\n64-Hifumi15.png\n: I...I believe I'm on fire...\n35-Hiro12.png\n: I thought you were only into 2D...\n66-Hifumi21.png\n: This is the most EXCELLENT 2D possible!\n5-Hiro5.png\n: But he's a guy! And also a computer program!\n6-Hifumi17.png\n: Oh, that aspect is no problem.\n29-Hiro4.png\n: That...aspect?\n20-Kyoko11.png\n: Anyway, let's talk to him a little more.\nKyoko typed away rhythmically...\n> \"How much do you know about what's going on?\"\n54-AlterEgo.png\n: Master only gave me a general idea... But I do know things have become very grave. He found himself caught up in this without any warning...\nKyoko immediately shot out another question...\n> \"Why are you here?\"\n69-AlterEgo5.png\n: Are you asking what Master had planned for me? Well... He wanted me to\nanalyze\nthe massive number of files stored on this laptop. I believe the files are related to the school, but the protection on them is surprisingly strong. So it's taking me a little longer than I thought. But here's what Master must have been thinking... The fact that the files are protected so tightly means they must contain some important secret. For example, perhaps...the\nsecret of this school\n.\n14-Makoto.png\n: ...!\nWhile I was busy struggling to make a sound, Kyoko pushed forward and asked her next question.\n> \"How much longer until everything's unlocked?\"\n54-AlterEgo.png\n: Umm...it's gonna be a while. But I'm definitely gonna do it, so you can just leave it to me!\n15-Kyoko12.png\n: So because of how long it would take, he designed Alter Ego to handle the workload.\n71-Celeste4.png\n: Smart. It also means that the work remains uninterrupted, even after his death.\nOnce again, Kyoko typed quickly...\n> \"Keep it up. But be careful not to let the mastermind notice you.\"\n69-AlterEgo5.png\n: Don't worry. I've got a secret plan all ready, just in case... Actually, I can see what's going on using my built-in webcam, so if anyone suspicious shows up...\n55-AlterEgo2.png\n: ...I'll just scream for help real loud!\n14-Makoto.png\n: It's a pretty...basic plan, I have to say...\n60-Celeste8.png\n: That is fine during the day, but nighttime is a concern...\n14-Makoto.png\n: Huh? Why?\n63-Celeste17.png\n: Have you forgotten? All our rooms are completely soundproof. Once we close our doors, he can screen as loud as he wants but we won't hear a thing.\n14-Makoto.png\n: Okay, then how about once it's nighttime, we each take turns guarding the dressing room?\n34-Kyoko3.png\n: There's a good chance the mastermind would notice us all going in and out of the dressing room like that.\n14-Makoto.png\n: Then...what can we do?\n20-Kyoko11.png\n: Once nighttime comes, I'll leave the door to my room open. Then there's no way I can miss Alter Ego yelling.\n5-Hiro5.png\n: B-But...if you leave your door open all night, then...\n18-Kyoko17.png\n: There's a chance I may become a victim myself, I know.\n45-Kyoko13.png\n: But I'm not as weak as you may think. I wouldn't go down without a fight, I assure you.\nThere was an undeniable strength in her voice when she said that. She was totally confident she would be okay. That confidence was somewhat similar to Byakuya's tone, but at the same time different... Yeah, it had an entirely different feel, for sure... Like...someone who'd been dropped onto a battlefield versus someone who'd been born on a battlefield. I felt like that was the fundamental difference...\nI was pulled out of my thoughts by the voice suddenly emanating from the laptop.\n54-AlterEgo.png\n: Umm...would you mind if *I* asked a few questions?\n♪\nMusic fades out.\n♪\n77-AlterEgo4.png\n: I haven't seen Master for a while. When you got here, I thought it was him, but... Is Master...?\nFor a split second, Kyoko seemed to not know what to do. But she recovered just as fast, and quickly began typing. Her answer was clear, concise, direct.\n> \"Chihiro is dead. Mondo killed him.\"\n79-DeathWish.png\n80-AlterEgo6.png\n: I see... To be honest, I knew all along... I knew the chances that Master would survive this situation were very low... So...I was prepared for this moment...\n81-Hifumi19.png\n: Somehow I feel kinda...sorry for her...\n4-Hina9.png\n: I can't even imagine how it must feel to lose your \"other self\"...\n71-Celeste4.png\n: It is a simple computer program. It does not *have* feelings.\n81-Hifumi19.png\n: Are you sure about that...?\n20-Kyoko11.png\n: Anyway, that's enough for today. If we linger here too long, the mastermind will start to suspect something.\nAnd then Kyoko types one last sentence...\n> \"I'll come back later.\"\n55-AlterEgo2.png\n: Yes, please do! It's a promise, okay? Bye-bye!\nThe AI seemed totally difference from when we'd first arrived. He seemed...upbeat. Was it just because he was following his programming? Or could he have actually been worried about us?\n83-BeautifulDeath.png\n29-Hiro4.png\n: Hurm...\n14-Makoto.png\n: What's wrong, Hiro?\n30-Hiro2.png\n: Oh, nothing. I was just wondering if we might be able to get this laptop online. Then we could call for help from the outside...\n84-Hina2.png\n: But this is just a dressing room. I don't think you can get online from here...\n35-Hiro12.png\n: Well if we take it out of here and find somewhere that *does* have online access...!\n86-Hifumi10.png\n: Th-That's way too dangerous! The mastermind would find out in no time!\n29-Hiro4.png\n: Oh, yeah...true.\n38-Kyoko2.png\n: This is no time for taking needless risks. For now, I'll monitor the progress of the file analysis. I'm confident we'll uncover some kind of clue once its finished.\n25-Celeste9.png\n: This feels like a detour more than anything else, but...I suppose it can't be helped.\n88-Sakura3.png\n: Well, for now all we can do it wait for Alter Ego to finish his work.\n89-Hiro.png\n: So, should we get going?\n18-Kyoko17.png\n: Indeed.\n64-Hifumi15.png\n: Goodbye! We'll be back, I promise!\n90-Hina23.png\n: C'mon, Hifumi, let's go!\n91-Hifumi2.png\n: O-Okay...\nAnd we all left the dressing room.\nAs soon as we were out in the hall, Hina let out a joyful shout.\n94-Hina21.png\n: Isn't it awesome!? I ended up doing something totally awesome, right!?\nAnd as if he'd been waiting for his cue...\n96-MrMonokumasLesson.png\n97-Monokuma.png\n: Dun da-da duuun! Hina has gained enough experience to level up!\n98-Monokuma11.png\n: So...what was this awesome something?\n14-Makoto.png\n: M-Monokuma!\n97-Monokuma.png\n: You guys all seem in remarkably good spirits. Did something happen!?\n14-Makoto.png\n: N-No, nothing in particular...!\n99-Monokuma2.png\n: Ooh, keeping secrets? No fair! I demand an exclusive interview!\n58-Hifumi14.png\n: Denied, denied, super denied!\n28-Hina16.png\n: Y-Yeah, just because you demand something, doesn't mean we have to do it!\n98-Monokuma11.png\n: Do it...? You mean, like, *do it* do it?\n24-Hina12.png\n: Wait, what? What do you mean, *do it* do it?\n101-Monokuma4.png\n: Ewww, gross! You said \"do it\"!\n28-Hina16.png\n: What!? You said it first!\n83-BeautifulDeath.png\n71-Celeste4.png\n: We were just talking about going to the bathhouse. We have not had a chance to relax in some time.\n98-Monokuma11.png\n: ...Huh?\n60-Celeste8.png\n: But unfortunately, the bathhouse is not divided into men and women sections.\n71-Celeste4.png\n: So we decided to do rock-paper-scissors to decide which group would go first. Hina won the match for us, and that is why we are all so pleased.\n4-Hina9.png\n: Y-Yeah, that's right! Speaking of which...\n104-Hina22.png\n: Okay, boys! Why don't you head on back to the dining hall or something? We're gonna take a nice, long bath!\n29-Hiro4.png\n: Ahhh, jeez, what're ya gonna do, right!? We lost, fair and square!\n105-Celeste.png\n: Well, ladies? Shall we go?\nCeleste didn't hesitate coming up with the ruse, and her poker face didn't even flinch. So she and the other girls headed back into the dressing room...\n*the girls leave*\n107-Hifumi6.png\n: U-Umm...\n6-Hifumi17.png\n: Nuts and dammit! We totally lost! Another day without getting to take my very first bath here!\n5-Hiro5.png\n: Y-Yeah, but...tomorrow for sure! You'll definitely get that bath tomorrow!\n14-Makoto.png\n: Okay, so...should we head back to the dining hall now?\n♪\nMusic fades out.\n♪\n109-Monokuma6.png\n: Hooooold on! Something's strange here... VERY strange!\n14-Makoto.png\n: Strange? What do you mean?\n110-Monokuma7.png\n: What's strange is, this is the perfect chance for you to sneak a peek!\n14-Makoto.png\n: ...Huh?\n111-Hifumi12.png\n: Ng-gh-gh! Th-That's...!\n113-100MileJunkFoodDash.png\n58-Hifumi14.png\n: You're absolutely right!\n114-Hiro14.png\n: I thought you were all about the 2D...\n101-Monokuma4.png\n: All of you need to shut up, sit down, and listen to what I have to say... An opportunity like this doesn't come along very often... It's the ideal setting of a man's fantasy!\n14-Makoto.png\n: ...\nI was forced to ask myself... Should I sneak into the bathhouse like Monokuma said, or just go quietly back to the dining hall...?\n14-Makoto.png\n: Okay... Let's go!\nWith the \"man's fantasy\" burning in my chest, I decided to head back to the bathhouse!\n101-Monokuma4.png\n: Puhuhu... Have fun in your man's fantasy...! Have a smashing good time!\n117-BOX15.png\nWe opened the door to the dressing room, silent as death, and peeked inside... It looked like the girls had already finished changing and gone into the bathhouse. This had all started as a lie, but apparently they'd decided to go in for real. Making sure it was empty, we quietly made our way into the dressing room. The...forbidden land...\n29-Hiro4.png\n: So they really are taking a bath. Is this what Celeste meant about lying convincingly?\n119-Hifumi5.png\n: Mr. Hagakure, please refrain from pointless whispering. We're deep in enemy territory here...\n120-Hifumi3.png\n: Just up ahead is the bathhouse. And there awaits...a great dazzling passion!\n122-Narration.png\n: So in case you're wondering how this happened, this is the bonus scene this game has. You will only see this scene if you have the following present in your Presents list.\nA Man's Fantasy:\nA wash basin intended to give you the courage to seek out a true man's fantasy. Specifically, in public bathhouses...\n122-Narration.png\n: This present is obtained like any other present: randomly. Just keep playing the school store game and maybe you'll get lucky. Funny enough, this present is liked by no one and might not even be presentable during a Free Time.\n122-Narration.png\n: Can I also mention how I love that the game is using the BOX 15 investigation music here? It's just a goofy little touch that I greatly enjoy as this cheesecake scene plays out.\n119-Hifumi5.png\n: Gwehehe... Mr. Naegi, you're on point...!\n29-Hiro4.png\n: Be careful, don't get us caught! if Ogre finds us, we'll be meeting up with Hades in no time...!\nI placed my hand on the door leading into the bathhouse. I opened it gently, inch by inch... I maneuvered my hand like a master craftsman, to avoid making even the slightest sound...\nA little further...a little further...\nAnd then...\nOn the other side of the thick, rising steam...\n...I saw...!\n122-Narration.png\n: She knows.\n130-BeautifulDays.png\n14-Makoto.png\n: ...\n26-Hifumi20.png\n: I'm not sure how to put it, but...I always feel refreshed after a job well done!\n120-Hifumi3.png\n: A 3D body isn't so bad in its nude state, I suppose.\n35-Hiro12.png\n: But still...I just can't believe it. Like, for serious...\n133-Hiro15.png\n: ...Ogre's a girl!?\n14-Makoto.png\n: ...\nWas this...really okay? Well...I looked, too. So I guess I'm gonna hafta say yes...\n2-WelcometoDespair.png\nMeanwhile, we heard the buzzing of busy voices growing louder. The girls had finished their baths, and joined us in the dining hall.\n4-Hina5.png\n: Ahhh, man what a nice bath!\n5-Celeste4.png\n: Getting a chance to stretch out and relax after all this time was a true pleasure.\n6-Kyoko5.png\n: Indeed.\n7-Sakura8.png\n: Normally, after a long bath I like to make myself a nice protein coffee, but...\n9-MrMonokumasLesson.png\n10-Monokuma.png\n: Sorry, no time for that!\n11-Sakura3.png\n: That's what I figured...\n12-Monokuma11.png\n: ...Huh?\n13-Celeste2.png\n: We were just saying in the bath how it was about time for you to get up to something.\n14-Kyoko3.png\n: After seeing how happy we were, an evil little monster like you would never let that last for long.\n16-Monokuma8.png\n: Y-You're all so terrible to me...\n17-Monokuma9.png\n: *Sniffle sniffle* Everyone's so cold and mean! Even after I got\npresents\nfor you all!\n18-Makoto.png\n: ...Presents!?\n19-Monokuma4.png\n: Hmmm? Oh, have I got your attention? Puhuhu. Then let's head to the gym, where your presents await!\n20-Monokuma5.png\n: No questions, no dilly-dallying! Get a move on, and everything will become clear! *leaves*\n22-DespairSyndrome2.png\n23-Hifumi6.png\n: Wh-What is it...? What are you scheming this time!?\n24-Kyoko7.png\n: He's probably going to repeat the same thing again. Providing us with a\nmotive\nto get things moving...\n25-Hina9.png\n: ...Again?\n27-Hina14.png\n: I don't want to... I don't want to do this anymore...\n28-Hiro13.png\n: Me either. I'm, like, totally traumatized...\n29-Kyoko17.png\n: It's okay. We have Alter Ego. I'm sure he'll find something that'll help us. So for now...\n30-Kyoko.png\n: ...we just have to endure it, come what may.\nWith heavy feet, we made our way to the gym. But when we arrived, there was already someone waiting for us.\n34-Byakuya5.png\n: To be kept waiting by the likes of you. Rest assured, if we had access to firearms, you'd all be dead.\n18-Makoto.png\n: Byakuya...? Did you get here early?\n35-Byakuya7.png\n: Did you forget how to walk? Is that why you're late? It's simple--right foot, left foot. Right foot...\n36-Celeste3.png\n: Hmhmhm. The same as always, I see. Her, on the other hand...\n38-Toko4.png\n: ...\n39-Hiro7.png\n: Oh, she's back to her Debbie Downer self, huh?\n40-Byakuya.png\n: I heard what sounded like a sneeze, and she was back to her old self.\n41-Hifumi9.png\n: So now she does from manic to depressive whenever she sneezes? Seems kinda late to add that into the mix...\n42-Toko12.png\n: Why does e-everyone keep making fun of me...? I hope you all win the l-lottery and get hit by a b-bus...\n43-Hina23.png\n: So when you wanna say something mean, *then* you can talk, huh?\n45-Sakura7.png\n: Anyway. It looks like everyone's here.\n46-Kyoko2.png\n: Which means...\n9-MrMonokumasLesson.png\n10-Monokuma.png\n: It looks like everyone's here! So then, let's get started!\n50-Byakuya2.png\n: Come on, out with it. What kind of motive have you prepared for us this time?\n51-Sakura5.png\n: Whatever you subject us to, we will not break.\n52-Hina22.png\n: Yeah, that's right! We're not gonna lose to you ever again!\n19-Monokuma4.png\n: Puhuhu... You don't have to get so defensive. Calm down! I've decided to change things up a bit this time. Up till now, I've been using the WOOSH of the North Wind to get you all moving.\n20-Monokuma5.png\n: But sometimes you gotta use the Sun to light a fire under someone's butt! Ahh-hahaha!\n54-TheNextMotive.png\n55-Monokuma18.png\n: So without further ado, I give you...THIS!\n57-MrMonokumaAfterClass.png\n58-Monokuma19.png\n: Ten million dollars! I've prepared this graduation present for whichever lucky student makes it out of here alive! Whaddya think? It's ten million bucks! Ten million smackaroos! It's like totally wowie wow wow, am I right!?\nSo that's the\nmotive\nyou've prepared, is it?\n18-Makoto.png\n: Ten million dollars is...\n40-Byakuya.png\n: It's not nearly enough.\n18-Makoto.png\n: ...\n61-Kyoko12.png\n: When it comes to motives, money certainly is the gold standard, so to speak. Whether it's in a mystery novel, or the real world...\n62-Hina16.png\n: B-But... There's no way we'd kill each other for money!\n63-Sakura4.png\n: She's right. You can't simply purchase a person's life.\n64-Hiro5.png\n: You can say ten million or however much, I don't give a crap! For serious!\n18-Makoto.png\n: Yeah...they're all right... Whether it's ten million, or any other amount of money... No, not even just money. From now on, no matter what you do, we won't kill our friends!\n19-Monokuma4.png\n: C'mon, stop trying to act tough.\n20-Monokuma5.png\n: The most important thing is to live a pure and moral communal life! *leaves*\nMonokuma disappeared, leaving his words onstage along with the massive sum of money...\n67-BoysLifeofDespair.png\n25-Hina9.png\n: Th-There's nothing to worry about, right? Nobody would kill a friend...for money, right?\n40-Byakuya.png\n: Have you so quickly forgotten the lesson from last time? You can't judge others by your own standard.\n42-Toko12.png\n: Y-Yeah, there might be someone here who's having m-money problems!\n5-Celeste4.png\n: Personally, I've earned over one million dollars from my gambling efforts. My life is...comfortable.\n68-Toko13.png\n: H-Hifumi? What about y-you!?\n69-Hifumi13.png\n: I'm a super popular content creator! I don't have any problem making enough to buy my comics and DVDs!\n68-Toko13.png\n: Th-Th-Then...!\n45-Sakura7.png\n: Just stop. Pressing others about their personal finances is...ugly.\n71-Toko6.png\n: U-U-U-Ugly!?\n72-Byakuya3.png\n: Don't worry. Either way, whatever's going to happen will happen without warning. That is the nature of this game.\n73-GoodNight.png\n*Ding dong, bing bong*\n76-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\n25-Hina9.png\n: It's that time already, huh...?\n29-Kyoko17.png\n: Before we separate, let me remind you... Starting tonight, I'll be leaving my room door open to make sure nothing happens to Alter Ego. But just because my door is open, don't assume that will make me an easy target.\n24-Kyoko7.png\n: Or the predator may suddenly find itself the prey...\nHer voice was calm and composed, but it was clear she meant what she said.\n79-Hiro15.png\n: Okay, okay, let's everyone just head back to our rooms! And don't think about that whole money thing! Got it? Good! Then let's break!\n80-Hiro2.png\n: ...How was that? Pretty good, right Taka?\n81-Taka19.png\n: ...\n80-Hiro2.png\n: ...Right.\nAs soon as I was back in my room, I crawled into bed. Money... There's no way that's gonna get anyone to kill anyone else... I told myself that, but deep in my heart, I was still troubled. After all, I thought the same thing last time, about having our\nsecrets revealed\n... Even if the reason for it seems completely nonsensical, a murder can still happen. That's the lesson we learned. But this time... This time, it's different. I'm sure of it... Because of the program Chihiro left behind--Alter Ego... We finally have some small hope to grasp onto. As long as we have that, then I'm sure...\n9-MrMonokumasLesson.png\n85-MonokumaTheater.png\n: Little kids have it so easy... Cuz they can put\nLi'l\nin front of their name, and right off the bat everyone thinks they're cute! Well fine then! I want everyone to start calling me\nLi'l Monokuma\n! See? Just by adding that, my cuteness goes up by at least like, 10%. Right? Yeah, the world doesn't have nearly enough\n\"Li'l's\"\n! More\n\"Li'l's\"\nwould lead to the salvation of the world! Just imagine... \"Li'l Arsonist,\" \"Li'l War Criminal,\" \"Li'l Destruction of the Environment\"...! \"Li'l Hit and Run,\" \"Li'l Death Tax,\" \"Li'l Great Depression\"! Even the darkest subjects can suddenly become brighter! Our dreams are expanding-ding-ding!\n86-GoodMorning.png\n*Ding dong, bing bong*\n76-MonokumaTV.png\n: Good morning, everyone! It is now 7 a.m. and nighttime is officially over! Time to rise and shine! Get ready to greet another beee-yutiful day!\nWell then...I guess I should head to the dining hall.\n89-BeautifulDeath.png\n90-Narration.png\n: There are a few people out in the halls this morning.\n18-Makoto.png\n: Good morning, Sakura.\n92-Sakura.png\n: Did you just wake up?\n18-Makoto.png\n: Yeah...\n7-Sakura8.png\n: Waking up for our breakfast meeting is fine, of course. But getting up a little early is better... You can exercise in your room till nighttime ends. A big meal after working up a sweat is...divine.\n4-Hina5.png\n: Hey! Mornin', Makoto!\n18-Makoto.png\n: Good morning. You're...kinda sweaty. Have you been exercising?\n52-Hina22.png\n: Yup! Me and Sakura were doing our morning workout! Oh, but I didn't break our nighttime promise! I just ran around my room till it ended... Why don't you come with us next time?\n18-Makoto.png\n: I don't think I could keep up with you and Sakura...\n96-Hina19.png\n: Ahh, seriously? Okay, then we can do something in the rec room! I'm not good at much, but I do know how to play Othello!\n97-Hina6.png\n: I'm not very good at that either, though. I don't like to think when I'm playing, so...\n100-Hifumi3.png\n: Ah, good morning!\n18-Makoto.png\n: Morning...\n101-Hifumi17.png\n: Actually, it's a GREAT morning! A morning that has blessed my entire future!\n18-Makoto.png\n: Really? It feels like any other morning to me...\n100-Hifumi3.png\n: Fwehehe! Maybe you can't tell, but my soul is positively overflowing with strawberries today!\n102-Hifumi21.png\n: Well, I'm off! *leaves*\nThat was...bizarre. I mean, even for him...\n105-Hiro12.png\n: So, the people here today are the same as yesterday. Just us seven.\n106-Sakura6.png\n: Byakuya and Toko are a lost cause, but...\n107-Hifumi2.png\n: It looks like Mr. Ishimaru's decided to stop coming for good, too...\n28-Hiro13.png\n: It's like he's just...given up.\n36-Celeste3.png\n: For people wound as tight as he is, when you snap, you snap hard.\n18-Makoto.png\n: I wish there was some way to make him better...\n13-Celeste2.png\n: On another topic... Kyoko, did everything go alright last night?\n29-Kyoko17.png\n: Yeah, I didn't have any problems.\n109-Kyoko11.png\n: I went and checked on the laptop a little while ago, and there weren't any problems there, either. But...\nKyoko seemed to hesitate, but...\n29-Kyoko17.png\n: It's related to this case, so I suppose I should be blunt.\n111-Kyoko13.png\n: I have to make a new rule. Using Alter Ego without permission is prohibited. Someone going in and out of the dressing room would draw unwanted attention from the mastermind.\n112-Celeste6.png\n: I would have thought that would be obvious. Why do we need to make a rule about it?\n30-Kyoko.png\n: That's a good question. Do you have any thoughts on that, Hifumi?\n114-Hifumi10.png\n: N-No... It's just like you said. We all need to be...very careful... *Pant pant*\n105-Hiro12.png\n: ...Huh?\n115-Hifumi14.png\n: Whatever, let's just hurry up and eat! We don't have time to stand around flappin' our lips!\n39-Hiro7.png\n: Jeez! Why're you talkin' like a pissed-off drill sergeant all of a sudden!?\nWe ate breakfast in a rush, then headed back to our rooms...\nWhat should I do today...?\n2-BeautifulDays.png\n3-Narration.png\n: We have a Free Time to spend today. Once again, I spent some time at the School Store trying to get more presents. I still didn't manage to get the special present that triggers another small bonus scene. I have a feeling it's set to be a very, very rare present that isn't dependent on the actual Repeat % counter in the minigame. I've yet to see it show up for me on any playthrough I've done so far.\n3-Narration.png\n: As for who we're seeing today, he might be The Biggest Asshole but let's try and figure out what makes Byakuya tick. Plus, I wanted to do his events in Chapter 2 but he was too busy reading books for the entirety of it to do Free Times with. In case you've forgotten what his first event was, we did his first one in\nChapter 1 Daily Life, Part 6\n.\n5-Byakuya.png\n: I can't help but wonder who will commit the next murder...\n6-Byakuya2.png\n: What do you think, Makoto? Who is going to kill whom?\n> Spend some time with Byakuya\n9-Byakuya3.png\n: It pains me to watch you. Do you really desire my affection so much? Hmph. You're free to do what you will.\nI ignored the insults, and spent some time with Byakuya. Byakuya and I grew a little closer today.\n> Yes, definitely\nCivet Coffee:\nMade from an extremely rare and expensive coffee bean collected from the dung of the Asian palm civet. It has a unique fragrance...\n13-Byakuya12.png\n: You...you bastard! How did you get your hands on this!? Even the collective force of the entire Togami Corporation wouldn't be enough to obtain this gem!\n14-Byakuya4.png\n: I...I'm going to hold on to this!\nSeeing Byakuya so pleased with something I gave him makes me happy!\n3-Narration.png\n: I love this goofy reaction. Stuff like this makes you realize that despite how he presents himself he's still human in some ways.\n16-Byakuya9.png\n: Just to be clear, being the Ultimate Affluent Progeny is only one of my many talents. Some people think I rely on the care and protection of the Togami name.\nHuh? Is this a monologue or something...?\n17-Byakuya7.png\n: But I don't rely on my family. Rather, I am my family's savior. The Togami Corporation reaches across the world, true, but I will take us to even greater heights. It is expected of me, naturally. After all, even my own family has recognized my ultimate superiority.\n9-Byakuya3.png\n: In other words, even among the Togami family, I am the chosen among the chosen.\n18-Makoto.png\n: So much confidence...\n6-Byakuya2.png\n: And that confidence is justified, I assure you. It comes from the battles I've fought and won.\n18-Makoto.png\n: Battles...?\n5-Byakuya.png\n: I am personally worth over 4 billion dollars, separate from my Togami family assets.\n18-Makoto.png\n: H-How the heck did you make that much money!?\n17-Byakuya7.png\n: The\nstock market\n. I buy and sell shares and assets, based on market trends, all within a single day.\n9-Byakuya3.png\n: Surely even someone as simple-minded as you has heard of this technique.\nSo he buys and sells stuff on the stock market, doing everything in a single day. I think that's called...\n> Day trading\n18-Makoto.png\n: You're talking about\nday trading\n, right? And you were able to make 4 billion dollars doing that?\n5-Byakuya.png\n: Well, I first started doing it just to keep myself occupied, and before I knew it...there it was. It's really not a big deal.\nI'd say it's a SUPER big deal!\n18-Makoto.png\n: Wait, but are high schoolers even allowed to buy stocks and stuff?\n17-Byakuya7.png\n: ...I'm Byakuya Togami.\nIs that...meant to be an explanation?\n16-Byakuya9.png\n: 4 billion dollars is nothing to the Togami Corporation, but for personal use, it's not bad. So now you understand, right? I'm not merely the child of modern-day nobility.\n18-Makoto.png\n: You know, Byakuya... Maybe we should start calling you the\nUltimate Day Trader\n!\n9-Byakuya3.png\n: Oh, I don't do that anymore. It was too simple, so I got bored of it pretty quickly.\nJeez, do you realize how insulting that sounds to the rest of us...?\n5-Byakuya.png\n: Of course, that's how I feel about anything I do. Frankly, life is too easy. It's only natural for me to do whatever I want in this world.\nMan, he really is confident. We're like worlds apart... *Galaxies* apart...\n3-Narration.png\n: Well, I only said he act human in *some* ways.  Anyway, this FTE gives us another\nSkill Point\n.\nStill reeling from Byakuya's story, I went back to my room.\nI've still got some time. What should I do...?\n*Ding dong*\n18-Makoto.png\n: Huh? Sounds like someone's here.\n27-DeathWish.png\n28-Taka19.png\n: ...\n18-Makoto.png\n: T-Taka!\n28-Taka19.png\n: ... ... ...Is it true? Can I really...see Chihiro?\n18-Makoto.png\n: Huh? You mean Alter Ego?\n28-Taka19.png\n: He's...still alive?\n18-Makoto.png\n: N-No...not quite...\n28-Taka19.png\n: Let me see... I want to...talk to him...\n18-Makoto.png\n: T-Taka...\nThe way he is now, there's no way I can explain what's going on to him... Kyoko said we're not allowed to use Alter Ego. But...even so...\n28-Taka19.png\n: ...\nI can't just leave him here like this.\n18-Makoto.png\n: Okay, why don't we get going...?\n28-Taka19.png\n: ...\n30-BeautifulDeath.png\n3-Narration.png\n: Kyoko's out in the hall.\n31-Kyoko.png\n: Where are you going?\n18-Makoto.png\n: Huh?\n32-Kyoko2.png\n: It's probably best if you don't drag him around with you too much, given his current condition.\nKyoko looked at Taka, standing behind me.\n18-Makoto.png\n: Y-Yeah, I know that... But I was getting kinda hungry. I thought we could head to the dining hall or warehouse or something...\n33-Kyoko7.png\n: Well then, I guess that's okay. *leaves*\nI thought I saw a brief flicker of doubt. But maybe it was just my imagination...\n3-Narration.png\n: Funny enough, Jill's also out here.\n18-Makoto.png\n: Is that...Toko?\n36-Jill2.png\n: Hmmm? What are you two up to?\n37-Jill6.png\n: Ahhhhh~! Don't tell me you're gonna--you're gonna--!?\n38-Jill9.png\n: Having lost his new \"brother,\" Taka is ripe for the taking. So Makoto swoops in to steal him away...!\n39-Jill3.png\n: Am I on fire...? Kyeeehahahaha!\nI severely regretted talking to Genocide Jack, even if by accident.\n41-Jill8.png\n: But that doesn't matter right now! Have you seen Byakuya!?\n18-Makoto.png\n: Huh? N-No, I haven't...\n42-Jill11.png\n: Ahh, good heavens! My love is being pushed to the limit! Kyeehahaha! *leaves*\nI almost feel bad for him...\n♪\nNo Music.\n♪\n28-Taka19.png\n: ...\n18-Makoto.png\n: Okay, so...there's a laptop inside the locker, understand? And on the laptop there's a program called Alter Ego.\n28-Taka19.png\n: How do I...talk to him?\n18-Makoto.png\n: O-Oh, um... Well, you just tell me what you want to say, and I'll type it in for you.\n28-Taka19.png\n: ...\n47-AllStarApologies.png\n28-Taka19.png\n: Do you...hate Mondo? And since I couldn't stop him...do you hate me?\nIt was clear he was forcing himself to get the words out. From his mouth, to the bottom of his heart...he forced his weakened voice to make the sounds.\n28-Taka19.png\n: ...Please.\n18-Makoto.png\n: O-Okay...\nI typed the questions exactly as Taka had asked them. And then...\n49-AlterEgo.png\n: ...Do you hold yourself responsible...?\n50-AlterEgo5.png\n: If Master could talk now, I think this is what he would say... Please, live your life for the both of us. It's impossible for me now, but you can still survive and escape--all of you.\n28-Taka19.png\n: ...\n18-Makoto.png\n: Hey, Taka...\nI was about to say more, but quickly closed my mouth...\n50-AlterEgo5.png\n: The one asking those questions is...Taka, right? Analyzing all available data, that's the only conclusion I can come to. Master told me how close Taka and Mondo had become. So that must be why he fells responsible...\nThe screen suddenly went dark. And what appeared next was...\n53-WelcometoDespair.png\n54-AlterEgo9.png\n: You're not letting yourself get crushed under the weight of that responsibility, are you!?\n28-Taka19.png\n: Gh--!\n54-AlterEgo9.png\n: A man's only worth as much as the load he can carry! You get it, right bro? Hell, what am I saying? Of course ya do!\n28-Taka19.png\n: ...\n18-Makoto.png\n: Th-That's...!\n49-AlterEgo.png\n: I'm sorry if I startled you... That was my attempt at a simulation, using the data about Mondo that Master had given me. I figured if Taka was depressed, that's the kind of thing Mondo would have said to him...\n54-AlterEgo9.png\n: So you're just gonna stand there, huh? Just wait for things to get better? Just take your time and get all depressed... Take the time to indulge your regrets... You might even start walking again without realizing it. Sure, that kind of mediocre thinking might work for some people.\n55-AlterEgo2.png\n: ...What if I said it with that kind of condescending tone!?\n♪\nMusic fades out.\n♪\n28-Taka19.png\n: ... Hehe... Hahaha...\n18-Makoto.png\n: Taka...?\n57-Kiyondo4.png\n: ... It's starting to sink in... The way a bucketful of water sinks into a bone-dry sponge...\n18-Makoto.png\n: Huh...?\n57-Kiyondo4.png\n: Those words... Deep within my heart...! They're inside of me!\n59-MrMonokumaAfterClass.png\n60-Kiyondo3.png\n: Uwaaaaaaaaaaaaahhh!\n18-Makoto.png\n: T-Taka!?\n62-Kiyondo.png\n: Who the fudge is Taka!?\n18-Makoto.png\n: Y-Your eyes...\n62-Kiyondo.png\n: Hey, don't worry about it! Guess I caused kind of a scene, huh? Shoot, man...\n18-Makoto.png\n: And your voice...\n62-Kiyondo.png\n: I'm...a new me...\n60-Kiyondo3.png\n: Hraaah! I'm totally stuffed with fighting spirit now! Ya dumbbutt!\n18-Makoto.png\n: O-Okay, Taka... Just calm down.\n62-Kiyondo.png\n: I AM calm! And don't call me Taka! That's...that's not my name anymore...\n60-Kiyondo3.png\n: I'm...me! I! Am! Meeeeeee! *leaves*\nTaka let out a bone-chilling howl and ran out of the room.\n18-Makoto.png\n: H-Hey! Taka, hold on!\nAnd I took off after him... But someone stood in my way.\n♪\nMusic fades out.\n♪\nAs if tagging Taka out, she walked briskly into the dressing room.\n33-Kyoko7.png\n: What do you think you're doing?\n18-Makoto.png\n: K-Kyoko! Oh, um...no, see...this is just--\n33-Kyoko7.png\n: Don't go around doing whatever you feel like. It causes problems. And not just for me. For everyone.\n18-Makoto.png\n: S-Sorry...\n65-Kyoko17.png\n: If you're really sorry, you'll get out of here. Now.\n18-Makoto.png\n: ... O-Okay...\nFinally, I headed back to my room, embarrassed and sullen.\nBut still...what was with Taka's sudden freakout? I'm seriously worried about him...\n68-GoodNight.png\n*Ding dong, bing bong*\n71-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\nIt's nighttime already. I guess I'll have to wait till tomorrow to figure out Taka's whole...thing. For now, time for sleep...\n73-MrMonokumasLesson.png\n75-MonokumaTheater.png\n: You wanna know why I hate video games? You might not believe this, but I had a best friend once. Actually, he was my *only* friend. But unlike me, he had all kinds of friends. So me and him were at his house one day, when a big group of guys showed up to hang out. They'd just bought the latest big-budget video game. They sat there lost in the game, passing the controller back and forth, for hours. But not me... I just sat there watching. That's right, I just watched! What's wrong with that!? I didn't care! Just by watching, I was able to nail down all the best strategies! Even though I never actually played it! And I don't plan on ever playing it in the future, either!\n2-GoodMorning.png\n*Ding dong, bing bong*\n5-MonokumaTV.png\n: Good morning, everyone! It is now 7 a.m. and nighttime is officially over! Time to rise and shine! Get ready to greet another beee-yutiful day!\n7-BeautifulDeath.png\n8-Makoto.png\n: Alright, I need to hurry up and get to the dining hall... I need to tell everyone what happened with Taka yesterday.\n11-Hiro18.png\n: Yo. I've been waiting.\n8-Makoto.png\n: Huh? Are you the only one here? Where's everyone else?\n11-Hiro18.png\n: They went on ahead.\n8-Makoto.png\n: Went on ahead...to where?\n12-Hiro2.png\n: We can talk about it later. For now, let's go take a bath.\nBath...?\n14-DespairSyndrome2.png\n16-Hifumi11.png\n: Kyaaaaahh! Someone heeeeelllp!\n8-Makoto.png\n: Hifumi, what's going on!?\n17-Hifumi22.png\n: Makoto! Save me! I've never asked you for anything, but I'm asking now!\n8-Makoto.png\n: Wh-What happened...?\n18-Hifumi7.png\n: Sh-She's trying to kill me...!\nHifumi pointed at...\n20-Kyoko17.png\n: ...\nHuh? Kyoko's trying to kill you?\n21-Kyoko2.png\n: I never said I was going to kill him. I simply asked him a question. I'd like to know why he made\n[the same mistake]\ntwice.\n> the same mistake\n8-Makoto.png\n: The same mistake...? What did he do?\n23-Kyoko7.png\n: He snuck into the dressing room in the middle of the night and accessed Alter Ego without permission. And when I caught him last night he was hugging the laptop and breathing strangely.\n24-Hina12.png\n: Wh-What were you doing!?\n20-Kyoko17.png\n: I thought I made myself clear yesterday, but since being subtle didn't work I suppose I have to clarify myself further.\n17-Hifumi22.png\n: Hyaaaaah! Please don't kill me!\n26-Kyoko.png\n: I'm not going to kill you--merely instruct you.\n27-Hifumi19.png\n: Ngh...gh!\n8-Makoto.png\n: Um, Hifumi...could you tell me what happened?\n29-Hifumi6.png\n: W-Well, I just...I was just talking!\n23-Kyoko7.png\n: Which was prohibited, was it not?\n30-Hifumi8.png\n: I-I mean, you see... Talking to her was just...so much fun! And I j-just...\n31-Hiro5.png\n: Whoa! Okay, time out! I can't even believe I'm about to ask this, but... Hifumi...you're not gonna tell us you...fell in love or something, are you?\n32-Hifumi17.png\n: Hah! That I, the cold-blooded killing machine of the underworld, would ever fall in love!? That's...\n33-Hifumi18.png\n: Wait...no way! Is...is this *love*!?\n35-Hiro12.png\n: I happened to do a psychic reading for a certain famous CEO once and that guy was seriously head over heels for a mannequin. He had a wedding and everything!\n36-Hiro15.png\n: And your eyes just now... I saw the same look in HIS eyes!\n37-Hifumi13.png\n: Shut up! She's not a mannequin! She's an ANGEL! And don't bother telling me angels exist! What we have can't be defined by your petty \"words\"!\n38-Hina23.png\n: Yeah, you're totally in love...\n39-Hiro14.png\n: So...how did things end up like this?\n41-DeathWish.png\n27-Hifumi19.png\n: ... W-Well, at the beginning...I just wanted to hear her say \"Master\" one more time. B-But then I was poking around at her settings and stuff, and saw she was a well-designed program. And it was like...how can I say...? It was the first time I...I was ever able to talk like that...with a normal girl.\n38-Hina23.png\n: But she's definitely *not* a normal girl...\n27-Hifumi19.png\n: Even when all we did was talk about my hobbies and stuff...she wasn't annoyed or disgusted or anything.\n42-FlashT.png\n44-FlashB.png\n45-AlterEgo2.png\n: Your stories are so interesting, Hifumi! C'mon, tell me more...! I wanna learn everything you have to teach me.\n27-Hifumi19.png\n: That's the first time a girl's ever said anything like that to me. Besides my mom, I mean...\n35-Hiro12.png\n: Your mom says stuff like that to you? That's kinda amazing all by itself...\n27-Hifumi19.png\n: That's why I was just...so happy. It was so much fun! And before I knew it... I found myself, y'know...liking her. Her face, her personality, her voice. Even her keyboard...\n24-Hina12.png\n: Even the keyboard...?\n46-Celeste9.png\n: I think you have misunderstood the situation, Hifumi.\n48-Celeste17.png\n: Alter Ego was not interested in who you *were*. it was interested in what you *knew*. It is an artificial intelligence. It exists to learn. Of course it wanted to hear of things it did not know. You are an expert in many things Chihiro could not have taught it about, for what that is worth. Alter Ego wants that information--that is all.\n27-Hifumi19.png\n: I-I know... I mean, I do know that. But still... Are you saying it's totally hopeless? Er...\n♪\nMusic cuts out.\n♪\n???: You gotta be freakin' kiddin' me!\n50-100MileJunkFoodDash.png\n51-Kiyondo3.png\n: Hey, you jerks! I'm sittin' here, listening to you guys jibber jabber on about whatever!\n12-Hiro2.png\n: Oh, Taka! Are you back!?\n51-Kiyondo3.png\n: Who the hell's Taka!?\n31-Hiro5.png\n: Um...you?\n51-Kiyondo3.png\n: Listen up! I'm me! Got it!?\n52-Hiro7.png\n: Huh...? You're...who?\n54-Kiyondo.png\n: Don't bullcrap me! Isn't it obvious!? I'm Kiyotaka AND Mondo. So, like...Kiyondo, I guess...\n51-Kiyondo3.png\n: I'm gonna stick a banana up your tailpipe!\n55-Hiro8.png\n: What the...? What the heck kind of fusion is this!?\n56-Narration.png\n: I can't say I'm a big fan of the name the localization went with for Kiyondo. In Japanese, his name was Ishida which was a mix of Ishimaru and Owada. Not to mention Ishida is an actual Japanese surname while Kiyondo isn't. I guess the joke really just doesn't translate over with the decision to use the first names for characters.\n58-Hina10.png\n: What's happened to you, Taka?\n8-Makoto.png\n: A-Actually...\nI told everyone what had happened the day before.\n59-Sakura3.png\n: So because of what Alter Ego said to him...\n60-Hina9.png\n: Are you sure it's Alter Ego's fault? Maybe Mondo's ghost showed up and possessed him!\n61-Hiro6.png\n: Gh-Gh-Ghost!? No, th-th-th-there's no such thing!\n51-Kiyondo3.png\n: What are y'all whining about!? C'MON! God, you're really cheesin' me off...! Hey, Hifumi!\n18-Hifumi7.png\n: Y-Yes...?\n54-Kiyondo.png\n: I dunno what you're thinkin', but...bro belongs to me!\n58-Hina10.png\n: Huh...?\n54-Kiyondo.png\n: Alter Ego! He's an exact copy of the one who gave me my soul back!\n51-Kiyondo3.png\n: And I'm not gonna let anyone else have him ever again! Fudgin' idiot!\n27-Hifumi19.png\n: ... I'm afraid...I can't allow that.\n54-Kiyondo.png\n: What!?\n64-Hifumi12.png\n: I can't withdraw... Mr. Ishimaru... Since I have this opportunity, let me say this right now...\n65-Hifumi14.png\n: Destiny has bound me and her together in the Gordian Knot of true love!\n51-Kiyondo3.png\n: Well me and HIM have been melded together in the white-hot heat of FRIENDSHIP!\n8-Makoto.png\n: H-Hey, come on, you guys...\n51-Kiyondo3.png\n: Moron! Talk down to me and I'll ram my fist right into all four of your vital points!\n37-Hifumi13.png\n: Well *I* punch at the speed of sound! And I don't have any arm hair so there's no drag!\n7-BeautifulDeath.png\n20-Kyoko17.png\n: Knock it off, both of you.\n67-Kyoko13.png\n: This doesn't belong to any one person. Chihiro left him to all of us. We can use him to finally gain access to vital clues.\n68-Sakura.png\n: Kyoko's right. If anyone dares disturb our peace any further...\n70-Sakura11.png\n: They'll have to deal with me.\n71-Hifumi2.png\n: ...!\n54-Kiyondo.png\n: ...!\n72-Kyoko14.png\n: Until Alter Ego has finished his work, don't do anything weird. Have I made myself clear?\n74-Sakura2.png\n: I can't hear you...\n27-Hifumi19.png\n: Y-Yes!\n54-Kiyondo.png\n: G-Got it...\n76-Kyoko19.png\n: Okay then. Let's get out of here. We can't afford to linger too long.\n77-Sakura7.png\n: Are you sure it's okay to let them off with a warning?\n76-Kyoko19.png\n: Yes. I have a plan. It'll be fine...\nAfter watching Hifumi and Taka leave dejected, we all went back to our rooms.\n8-Makoto.png\n: It's still morning, but because of everything that's happened...I'm tired already.\nWell anyway, I have to just pull myself together. So what should I do with the rest of my day?\n2-BeautifulDays.png\n3-Narration.png\n: We have two more Free Time Events on the table today. It's worth noting that Kiyondo can actually be found in the halls during Free Time.\n5-Kiyondo.png\n: What!? You got somethin' to say to me!?\n6-Kiyondo3.png\n: Well I ain't got POOP to say to youuuUUUUU!!!\nM-Maybe I should leave him alone...\n3-Narration.png\n: I didn't say he actually had an FTE though. No, sadly, we can't spend our Free Time with Taka while he's acting like this.\n3-Narration.png\n: However, at one point there were plans to let him have at least one FTE as Kiyondo. There is an unused FTE conversation still remaining in the game's files. It can't be accessed ingame, but the good people over at The Cutting Room Floor have extracted it along with many other unused things from this game. The following conversation was taken from this page specifically but\nyou really should not follow this link unless you've already seen the end of this game. It contains major spoilers for basically every aspect of the game.\nI'm only putting it here to give credit where it's due.\nYOU SHOULDN'T CLICK THIS LINK IF YOU'RE SEEING THE GAME FOR THE FIRST TIME (TCRF page on Danganronpa)\n8-Flashback.png\n5-Kiyondo.png\n: Let's begin, then... shall we?\n9-Makoto.png\n: Begin...what?\n5-Kiyondo.png\n: You race? You fight? You down with weapons?\n9-Makoto.png\n: U-Uhhh... Taka...I know you're pretty shaken up about Mondo and all that...\n10-Kiyondo2.png\n: Mondo... He...had a date with misfortune...\n9-Makoto.png\n: Huh?\n10-Kiyondo2.png\n: The moon...is disturbed...\n6-Kiyondo3.png\n: Hey! Whatchu standin' there for!? Keep fuckin' with my mojo and I'll fuck with your\nface\n!\n5-Kiyondo.png\n: You're a companion. But you're no bro...\nAfter spouting a bunch of gibberish, Taka wandered off.\n9-Makoto.png\n: I hope he's all right...\nNo, no matter how you look at it, he is\nnot\nall right...\n8-Flashback.png\n3-Narration.png\n: This event would have given the player one Skill Point. If Kiyondo's character sounds different from what we've seen of it so far, don't forget that this isn't an official translation. Additionally, I went and changed the names from last names to first names to match the LP.\n3-Narration.png\n: Anyway, the real update begins here. Since we can't visit with Taka/Kiyondo right now, let's visit with someone else. Sakura's out in the third floor hallway.\n13-Sakura4.png\n: I don't like this atmosphere...\n> Spend some time with Sakura\n16-Sakura2.png\n: Are you saying you're ready for another lesson? Very well. Prepare yourself, and come with me.\nSakura put me through a tough but rewarding training session. I can feel myself getting stronger. Sakura and I grew a little closer today.\n> Yes definitely\nGod of War Charm:\nA charm devised by the protective deity of martial arts, the Great and Gracious Kashima.\n16-Sakura2.png\n: I-I've been looking everywhere for this! How did you know!?\n19-Sakura.png\n: You're quite a mysterious man, Makoto...\nSeeing Sakura so please with something I gave her makes me happy!\n13-Sakura4.png\n: My post-training break is the most relaxing time of my day. The sensation of your muscles cooling down after heating up during a workout is the only true reward. No matter how many times I experience it, I never get tired of it.\n9-Makoto.png\n: Do you exercise every morning, Sakura?\n19-Sakura.png\n: Unless there are errands that I absolutely can't get out of, yes, I always do my training. If I don't, I feel restless for the rest of the day.\n9-Makoto.png\n: But I'm amazed you can do it every single day. Doesn't it get tough?\n21-Sakura6.png\n: I can't say I've ever seen it as tough. It's all so that I can get stronger, after all... And I have to keep on getting stronger, because\nmy destiny is to fight\n.\n9-Makoto.png\n: Your destiny...is to fight?\n19-Sakura.png\n: From the day I was born, I've been fighting. Heaven sent me to live as its champion.\nThat's one heck of a legend...\n13-Sakura4.png\n: My father was my master, and my every waking moment was spent with him learning to fight. As a child, I sparred with boxing champions and hit the mat with wrestling gold medalists. I was no match for them when I first began, of course... But before long, *they* were no match for *me*.\n9-Makoto.png\n: Y-You mean...you actually started beating people like that?\n24-Sakura3.png\n: I'd say my specialty is solid stand-up that transitions into grappling and a strong ground game. Essentially, it's a complete approach. Anything else just wouldn't make sense. You can only become the best by reaching the top of each discipline, then fusing them all together.\nStand-up fighting, grappling, and a strong ground game... That could only be...\n> Mixed martial arts\n9-Makoto.png\n: You're basically a mixed martial arts fighter, right?\n19-Sakura.png\n: That's right. It's the most effective real-world fighting style, which is why I chose it. I don't want to just be the best in competitions. I want to be\nthe strongest human on Earth\n.\n9-Makoto.png\n: I wouldn't bet against you, that's for sure. But aren't you already the best?\n27-Sakura5.png\n: No, not yet. There's still\nsomeone I have to surpass\n...\n9-Makoto.png\n: Really...?\n13-Sakura4.png\n: Until I can beat him, I'll never become the strongest...\n9-Makoto.png\n: You mean there's someone out there stronger than you?\n21-Sakura6.png\n: ... Maybe I'll tell you about it another time, if the opportunity presents itself. *leaves*\nSakura didn't make a sound as she left. I honestly can't believe there's someone out there stronger than Sakura... Even if they're real...can they really be human?\n3-Narration.png\n: This FTE gives us another Skill Point.\n3-Narration.png\n: Next, we're going to continue our Free Time chain with Byakuya. Characters can actually be in their bedrooms on occasion and you'll have to ring their doorbell to say hello.\nI guess I should press the doorbell...\n*Ding dong*\n32-Byakuya.png\n: I wondered who it was coming to talk to me. It turns out, it's the always useless, ever incompetent Makoto.\n> Spend some time with Byakuya\n35-Byakuya7.png\n: Fine. I don't mind allowing you to indulge in my attention. I hope you appreciate this.\nI spent some time with Byakuya... Byakuya and I grew a little closer today.\n> Yes, definitely\nScarab Brooch:\nThe scarab was considered to be sacred by many ancient societies. It's better known today as...the dung beetle.\n39-Byakuya12.png\n: You...you bastard! How did you get your hands on this!? Even the collective force of the entire Togami Corporation wouldn't be enough to obtain this gem!\n40-Byakuya4.png\n: I...I'm going to hold on to this!\nSeeing Byakuya so pleased with something I gave him makes me happy!\n42-Byakuya2.png\n: Listen, Makoto. I wanted to ask you something.\nWhat could Byakuya want to talk to *me* about? I have a bad feeling about this...\n9-Makoto.png\n: Oh, umm... Sure, what's up?\n42-Byakuya2.png\n: You know...only a chosen few, perhaps 1% of us, are able to succeed in life.\n32-Byakuya.png\n: For the other 99%, their dreams never come true. Some never even have a dream in the first place... Spending every waking hour toiling to scrap together a meager living, just barely getting by...\n35-Byakuya7.png\n: I just don't understand. Is there any meaning to a life like that?\n9-Makoto.png\n: Why are you asking me...?\n43-Byakuya3.png\n: Because you're part of that 99%, of course. Why did you even feel the need to ask?\nI knew he was gonna insult me somehow...\n32-Byakuya.png\n: Up until now, I've never been around anyone like that. So I'm interested... Tell me, how does it feel to live a life without hope, without potential or ambition or dreams?\n44-Makoto2.png\n: C-Come on! I don't have ambition, or dreams? I've never felt that way about myself! I mean sure, maybe I'll never be as rich as you or anything, but do you have to go around saying that to everything? Can you only be happy by being better than others?\n43-Byakuya3.png\n: Your complaints are as old and tired as a third-rate pop song from any generation... And yet, those are the words of the 99%. That is how you find comfort in your tiny, cold little world.\n44-Makoto2.png\n: S-Stop saying stuff like that!\n35-Byakuya7.png\n: Sorry, I can't not speak the truth. No matter how much you push and struggle, people like you will never be in a position to change the world. You could all disappear tomorrow, and nothing would change. Your existence is of no consequence.\n44-Makoto2.png\n: Whether that's true or not, it doesn't matter. Even if you live a totally normal, unimportant life, you can still find happiness in that. If I can live a life that I'm satisfied with, that's all that matters. If I spent all my time comparing my life to other people's, I'd never be happy. Sure, maybe you can do that. You were guaranteed success from the day you were born, so--\n47-AllStarApologies.png\n48-Byakuya5.png\n: Hold it! From the day I was born? You have no idea...\n50-Byakuya6.png\n: You don't have a clue what you're talking about!\n44-Makoto2.png\n: What...?\n48-Byakuya5.png\n: Those who are \"chosen\" from birth have no concept of what that truly means.\nI have gone to battle and emerged victorious\n. *That* is why I am the chosen.\n44-Makoto2.png\n: Wh-What are you talking about...?\n52-Byakuya15.png\n: You're spoiled, all of you. Running away into a world of self-indulgence. Battle, competition, rivalry--you run away from it all. *That* is why the 99% walk the path that they do.\n53-Byakuya14.png\n: Good god, your absolute lack of understanding makes me want to weep. *leaves*\nAfter showing a surprising amount of emotion, Byakuya quickly made his exit.\n44-Makoto2.png\n: What the heck got into him?\nHe was acting totally normal, up until... Until I said something about\nbeing guaranteed success from the day he was born\n...\n44-Makoto2.png\n: I wonder why that set him off...\n3-Narration.png\n: This unlocks the skill\nEnvious Influence\n. It greatly increases the amount of hearts in our Influence Gauge during all aspects of the class trial. I don't anticipate needing to use it but it's a great skill to have on your first playthrough when you don't know all the correct answers.\nI couldn't stop thinking about Byakuya while I went back to my room.\n56-GoodNight.png\n*Ding dong, bing bong*\n59-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\nNighttime already... I guess I'll just go to bed for today.\n61-MrMonokumasLesson.png\n63-MonokumaTheater.png\n: Happy New Day! I'm the kinda guy, I don't wanna celebrate a new year. I wanna celebrate the dawn of every new day! Because every new day deserves celebrating! So... Once again, happy New Day!\n2-GoodMorning.png\n5-MonokumaTV.png\n: Good morning, everyone! It is now 7 a.m. and nighttime is officially over! Time to rise and shine! Get ready to greet another beee-yutiful day!\n7-BeautifulDeath.png\nI'd better get to the dining hall...\n10-Celeste2.png\n: Taka and Kyoko are not here today...\n11-Hiro.png\n: Kyoko's still on guard duty, probably.\n12-Sakura6.png\n: I have no idea about Taka...\n13-Hifumi12.png\n: May as well just forget about that guy!\n14-Hina9.png\n: You don't have to get so mad...\n15-Hiro4.png\n: They're rivals in love. What're ya gonna do...?\n17-Hifumi17.png\n: Don't put me on the same level as that...that... virgin! I might catch his virginity!\n18-Hiro14.png\n: Nah, my guess is you're already infected...\n19-Hina12.png\n: Wait, can you really catch it!?\n20-Celeste4.png\n: Stop being vulgar. Let's eat breakfast.\n♪\nMusic fades out.\n♪\nBut as soon as my hands approached my food...\n???: ...Kyeehaha!\n19-Hina12.png\n: Huh? That voice...\nThe doors to the dining hall exploded open, and a figure appeared...\n23-MrMonokumaAfterClass.png\n24-Jill7.png\n: Kyeeehahaha!\n25-Sakura3.png\n: So it's you, Genocide Jack. And...\n27-Byakuya5.png\n: Don't bother asking why we arrived at the same time. The answer should be obvious.\n28-Jill6.png\n: I'll give you a hint... I'm wearing red lingerie today!\n30-Hina10.png\n: Umm...I don't think anyone wanted to know...\n24-Jill7.png\n: Hold on a second! You...!\n19-Hina12.png\n: H-Huh...!?\n31-Jill9.png\n: What's your top power level, like 35-22-33!? You start out big on top to try and look thinner down south!\n33-Jill8.png\n: Look at your melons! They're seriously gargantuan! Do you dunk 'em in milk every night or something!?\n30-Hina10.png\n: Y-You're starting to freak me out...!\n34-Sakura11.png\n: If you lay a finger on Hina...I will show you no mercy!\n10-Celeste2.png\n: So? What do you want? Surely you are not here to join us for breakfast.\n36-Byakuya7.png\n: Of course not. I came to hear a story.\n37-Makoto.png\n: A story...?\n36-Byakuya7.png\n: A story that nobody's bothered to tell me yet.\nAre you talking about...Alter Ego?\n39-Sakura4.png\n: Sorry, but we can't talk about that right now.\n40-Byakuya2.png\n: Why not?\n41-Sakura.png\n: Because of certain...circumstances.\n18-Hiro14.png\n: Up till now you haven't given a crap about anything and *now* you're all concerned? I don't buy it.\n43-Byakuya8.png\n: I've just made a decision. When we get out of here, I'm going to feed your body to the vultures.\n44-Hiro8.png\n: What kind of messed up dictator are you!?\n27-Byakuya5.png\n: But isn't this a democracy? Or would you exclude those who don't fit into your tyrannical majority?\n37-Makoto.png\n: Th-That's not what we're doing...\n46-Byakuya15.png\n: Well, whatever. If nothing else, tell me what's going on with Taka. When I saw him yesterday, I happened to notice something seemed...off. So I was curious.\n47-Celeste5.png\n: Taka has become utterly useless.\n48-Makoto2.png\n: Celeste! You don't have to say it like that!\n36-Byakuya7.png\n: Did his spirit collapse or something? Was he unable to withstand this environment? Those men who clothe themselves in the cheap fabric of justice are often the first to fall...\n50-Byakuya3.png\n: But perhaps that will make things all the more interesting...\n37-Makoto.png\n: Interesting...?\n27-Byakuya5.png\n: Let me leave you with a bit of advice. Don't come to rely on false camaraderie or you'll reap its bitter reward.\n52-Hina16.png\n: That's why you came? To give us that amazing \"advice\"?\n50-Byakuya3.png\n: It seems I am unwelcome here. Then I will grant your desire and remove myself...\n31-Jill9.png\n: Yeah, let's get outta here!\n53-Byakuya4.png\n: ...You don't need to come with me.\n55-Jill12.png\n: You don't have to play hard to get, Master! You can just play hard!\n56-Byakuya14.png\n: That doesn't make any sense...\nByakuya started to slowly back out of the room... He started picking up speed, and soon he was sprinting out of the dining hall.\n58-Jill5.png\n: He ran away...? So now he's *running* hard to get... I see!\n59-Jill3.png\n: Wait wait wait wait! Gyaaahahahaha! *leaves*\n♪\nMusic fades out.\n♪\n14-Hina9.png\n: S-So at the end there... What was that all about?\n61-Hiro5.png\n: Just now, Byakuya was like...\n62-Hifumi2.png\n: Maybe he's like the mean guy who starts acting different or getting all flustered when things change!\n63-Hiro2.png\n: ...Guess so.\nThose of us left in the dining hall finished our breakfast, then went back to our rooms.\n66-BeautifulDays.png\n37-Makoto.png\n: Hmm... What to do today?\n68-Narration.png\n: Once again we have two more Free Times available.\n68-Narration.png\n: My original plan was to meet with Toko but there's one big catch when trying to do an FTE with her. Depending on what point you're at in the story, she might be herself or she might be Genocide Jill. Right now, she happens to be Jill.\n68-Narration.png\n: Now, Genocide Jill actually does have an FTE chain but well...I'm not actually sure how to activate it. I can talk to her, spend time with her and give her a present just like normal. The problem is that as soon as she finishes accepting the present the game kicks me straight back to Makoto's room with no FTE occurring. I think I read somewhere that you might have to do all of Toko's FTEs before you can do Jill's events. If that's the case, Jill's events will most likely be held until the end of the game because I'll have better access to her in School Mode.\n68-Narration.png\n: So since our resident novelist is unavailable, I figured we'd talk to our other creative student today. Hifumi can be found in the dining hall.\n71-Hifumi.png\n: Well, if it isn't Mr. Naegi! How can I help you today?\n> Spend some time with Hifumi\n74-Hifumi5.png\n: So you want to be around me, eh? That means you must have realized that I have certain...powers.\n17-Hifumi17.png\n: Yes, that's right! My greatest power is my ability to negate the powers of others! I've never actually used it in a fight yet, but I'm not worried. Cuz whatever abilities they have...all I need is my power of negation!\nHifumi cornered me and made me take part in his delusion... Hifumi and I grew a little closer today.\n> Yes, definitely\nDemon Angel Princess Figure:\nA collectible figure of Princess Piggles, the popular heroine from \"Demon Angel Pretty Pudgy Princess.\"\n78-Hifumi9.png\n: I-I never imagined you'd want to give me something so rare, Mr. Naegi!\n79-Hifumi20.png\n: Super <3 God Level <3 Result <3\nSeeing Hifumi so pleased with something I gave him makes me happy!\n80-100MileJunkFoodDash.png\n74-Hifumi5.png\n: Mwehehe... I see quality in you, Mr. Naegi. True quality!\n81-Hifumi3.png\n: And that's why...I've decided to present to you my lecture on\nthe nature of fan fiction\n! If we're going to be friends, you must be fully informed. I will permit no fanfic bigotry whatsoever!\n37-Makoto.png\n: I don't think I have any fanfic bigotry... I mean, I don't really know anything about that kind of geeky stuff anyway...\n13-Hifumi12.png\n: See, there it is! To you, fanfic equals geeky, right? But is that all that word is worth?\n37-Makoto.png\n: Huh? Did I say something wrong...?\n84-Hifumi4.png\n: But that's okay! Because I take the word geek as a compliment! For you see, there is nobody on Earth so full of knowledge as a geek!\n81-Hifumi3.png\n: In a sense, a geek is like an expert. That's right, a total expert! A successful musician must necessarily be a music geek, a good movie director is a movie geek. You see? It's those experts, those *geeks* who open up the world to others! So when you say that writing fanfic is \"geeky\"...\n85-Hifumi14.png\n: ...you're recognizing us as true experts!\n37-Makoto.png\n: Okay, so um...what exactly *is* fanfic, then?\n86-Hifumi15.png\n: Oof! Super direct question FTW!\n71-Hifumi.png\n: Basically, we have all different kinds of stores and events, right? These are where groups of holy warriors sell their own stuff based on games, comics, anime, everything.\n37-Makoto.png\n: And the stuff those people make...is fanfic?\n74-Hifumi5.png\n: Comics are the most common creation, but it also includes games, music, and even merchandise!\n17-Hifumi17.png\n: By the way, there's a name for when a group of fanfic creators come together. Specifically, it's any organized group that comes together to release their work.\nA group that comes together to release their work...\n> Circle\n37-Makoto.png\n: Is it...a circle?\n90-Hifumi21.png\n: It sure is! Of course you knew that. I mean, it's only common sense!\n13-Hifumi12.png\n: I certainly hope you don't expect me to explain such common-sense topics every time!\n37-Makoto.png\n: Well, like I said...I don't know too much about this stuff.\n85-Hifumi14.png\n: This goes well beyond \"I don't know too much\"!\n81-Hifumi3.png\n: But I guess I can't blame you. The propaganda never touches on that, so as a fanfic ambassador... By the time I'm done with you, you'll be itching to buy a premium pass to the next fanfic con!\n79-Hifumi20.png\n: Right!?\nObviously *he's* excited, but...\n74-Hifumi5.png\n: Gwehehe... That's it for today. I hope you're excited for your next lesson! I can't wait to see what the future has in store for the two of us...\nI'm kinda scared to see what the future has in store for the two of us...\n68-Narration.png\n: This unlocks the skill\nHandiwork\n. It affects a mechanic in the Bullet Time Battles that we haven't seen yet. I'll explain it more later.\n66-BeautifulDays.png\n68-Narration.png\n: This is the Dining Hall update, isn't it? Anyway, we're here to continue Sakura's events for our second Free Time.\n41-Sakura.png\n: Hello. Did you need something?\n> Spend some time with Sakura\n25-Sakura3.png\n: I just got done exercising. Now would be a good time for a break. Would you like to get something to drink and talk for a bit?\nSakura and I sat down for tea and a calm, relaxing conversation... Sakura and I grew a little closer today.\n> Yes, definitely\nAsura's Tears:\nA jewel treasured by an ancient super-race. \"Even the devil has friends. You fool...\" And then...tears flow.\n99-Sakura2.png\n: A-Are you sure I can have something so valuable...? Makoto, I...!\n39-Sakura4.png\n: ...\n41-Sakura.png\n: S-Since we've already talked so much, it's okay to talk a little more, right...?\nSeeing Sakura so happy with something I gave her makes me happy!\n25-Sakura3.png\n: I suppose I don't mind talking with you a little more.\n37-Makoto.png\n: Really? Then...can I ask you something?\n41-Sakura.png\n: What is it?\n37-Makoto.png\n: It's about what we were talking about before. You said there's someone out there stronger than you?\n12-Sakura6.png\n: ...\n37-Makoto.png\n: Can I ask...is it a guy, or a girl?\n101-Sakura7.png\n: It's a\nman\n.\nThe man that Sakura has to surpass... Maybe she's talking about her own teacher...? Which would mean...\n> Your dad\n37-Makoto.png\n: You were talking about...your dad?\n104-DeathWishNoIntro.png\n12-Sakura6.png\n: ... The family dojo has been passed down from generation to generation for the past\nthree centuries\n.\n37-Makoto.png\n: Three centuries...? That's one heck of a history...\n41-Sakura.png\n: I was born into my family as an only daughter. Male or female doesn't matter. It's my duty to protect our legacy. And because I am a woman, I must be even stronger than if I were a man.\n99-Sakura2.png\n: Some would say that a woman is incapable of becoming the strongest human alive. I want to prove them wrong. Which is why I subjected myself to such feverish training under my father's instruction. Surpassing my father was certainly important to me.\n39-Sakura4.png\n: But that was just a matter of time.\n37-Makoto.png\n: What do you mean...?\n12-Sakura6.png\n: I was 14 years old when I first beat my father in a sparring match. After that, I never lost to my father again.\n37-Makoto.png\n: Wait, then...!\n41-Sakura.png\n: Yes. I have already surpassed my father.\n37-Makoto.png\n: I don't believe it...\n39-Sakura4.png\n: I'm not sure I did the right thing. My father also had the desire to become the strongest human alive. But I can't look back. I can only move forward and try to claim that title for myself. That is\nmy destiny\n.\n106-Sakura12.png\n: Well, that's all for now. That was enjoyable. Goodbye. *leaves*\nWithout another word, Sakura left me standing there alone. Wait, hold on...\n37-Makoto.png\n: I never did find out who could possibly be stronger than her...\nDid she avoid talking about it on purpose...?\n68-Narration.png\n: This unlocks the skill\nBreathing Technique\n. It makes our Concentration Gauge (the Star meter) in trials recharge faster. Handy if you find yourself using concentration a lot, though it takes a good amount of SP to equip. I probably won't be needing it.\nAfter we were done, I decided to head back to my room for a while...\n♪\nNo Music.\n♪\n37-Makoto.png\n: Huh...? There's something by the door...\n2-BeautifulDeath.png\nThis piece of paper... It looks like someone must have slipped it under my door.\n\"Meet in the dining hall!\"\nThe handwriting is...really good. But to want to meet up so suddenly... Who wrote it? And why? What's the point of calling me out like this? I'm kind of nervous, but...there's no way I can't check it out now.\n6-Hiro.png\n: Oh, Makoto!\n7-Makoto.png\n: Hiro...? Then the letter I found in my room...\n8-Hiro2.png\n: Yup, I wrote it.\n7-Makoto.png\n: Your handwriting is...really nice.\n8-Hiro2.png\n: Well, I was always taught that if you had bad penmanship, a ghost would come and haunt you.\n...Who taught you that?\n7-Makoto.png\n: And why did you want to meet with me?\n6-Hiro.png\n: Oh, I just did what Kyoko asked me.\n7-Makoto.png\n: Kyoko...?\n11-Hiro18.png\n: I'm just an errand boy on this. Anyway, whaddya say to a late-night bath session?\n7-Makoto.png\n: Huh...?\n8-Hiro2.png\n: Okay, let's do it!\n7-Makoto.png\n: N-No, I...\nI was totally lost. Hiro grabbed me by the shoulder, pulled me close, and whispered into my ear...\n13-Hiro12.png\n: It's all an act, so the mastermind won't notice. Everyone's waiting in the bathhouse.\nWhat...? Then...did Alter Ego finish his search...?\n7-Makoto.png\n: Y-You got it, Hiro! Let's go take a dip together!\nI was probably louder than I needed to be...but me an Hiro hurried to the dressing room.\nAs soon as I got to the dressing room, an angry voice echoed out.\n16-Kiyondo3.png\n: Hey! You! How long were you gonna keep us waiting!?\nTaka's irritated voice pierced the air as he stared pointedly at his wristwatch.\n16-Kiyondo3.png\n: It's almost 10 o'clock, you know that!? Bedtime for all the good little boys and girls!\n17-Hifumi12.png\n: Tch... Shut up...\n18-Kiyondo.png\n: What'd you say!? You want me to make you cry, little girl!?\n20-Byakuya3.png\n: Taka... He seems to be even worse off than I'd heard. Well, maybe it's a good thing. Maybe he's finally starting to grow a personality.\n16-Kiyondo3.png\n: What--!? You got a lotta poop fallin' outta that mouth of yours, you know that!?\n21-Toko12.png\n: How rude... A maggot like you has no right to speak that way to our heaven-sent Master...!\n22-Celeste6.png\n: Hm? Are you back to your normal gloomy self? I can hardly keep track at this point.\n23-Toko5.png\n: Sh-Shut up...!\n13-Hiro12.png\n: Well anyway, everyone's here, right!? Then my messenger duty is complete!\n25-Sakura7.png\n: You wanted us all to meet here, right Kyoko? So, what are we doing here?\n26-Hiro15.png\n: Isn't it obvious? It's gotta have something to do with Alter Ego, right!?\n27-Hina21.png\n: Yeah, totally! Did he finally find a clue? What is it? A way out!? The mastermind's true identity!?\n28-Kyoko7.png\n: ...\n30-BoysLifeofDespair.png\n28-Kyoko7.png\n: It's gone.\n7-Makoto.png\n: Gone...?\n28-Kyoko7.png\n: I came here a little earlier to check up on things, and that's when I discovered... Alter Ego--the laptop--has disappeared...\n31-Makoto2.png\n: What!?\n32-Hina10.png\n: You're kidding, right...?\n33-Kyoko17.png\n: ...\n35-Hifumi7.png\n: H-Huh...? What...? She's...gone?\n16-Kiyondo3.png\n: You can't be fudgin' serious! What'd you do with him!?\n36-Celeste8.png\n: Was it the mastermind? Did they finally notice what we were up to?\n28-Kyoko7.png\n: I told Alter Ego to yell if anyone he didn't recognize appeared. If it was the mastermind, I'm sure he would have alerted us.\n37-Hina2.png\n: Maybe we just...missed it?\n28-Kyoko7.png\n: I was in the laundry room right next door all day. There's no way I wouldn't have heard it.\n31-Makoto2.png\n: B-But...if it wasn't the mastermind, then...\n17-Hifumi12.png\n: The solution to this particular mystery is obvious! It could only have been...him!\n39-Hifumi14.png\n: Mr. Ishimaru! You stole her, didn't you!?\n16-Kiyondo3.png\n: What!? I'm the Ultimate Moral Compass! I would never do something like that!\n40-Hina12.png\n: I don't think it counts when you say it about yourself like that...\n18-Kiyondo.png\n: You're the suspicious one here! You're nothin' but a big, jiggling sack of fat!\n17-Hifumi12.png\n: Shows what you know. This isn't my true form! I still have three more transformations left!\n39-Hifumi14.png\n: Er...wait, I mean--it wasn't me! Everyone knows YOU'RE the thief!\n16-Kiyondo3.png\n: Wrong! It's you!\n42-Hiro5.png\n: Well I'm sure it was *one* of you. So whoever did it, just hurry up and confess!\n43-Kyoko11.png\n: No. There's no way either one of them did it.\n44-Hiro7.png\n: Huh? Why not!?\n43-Kyoko11.png\n: I told Alter Ego to yell if either Taka or Hifumi came into the dressing room.\n18-Kiyondo.png\n: Wh...what?\n33-Kyoko17.png\n: It was a countermeasure against the clear danger that one of them might come for it.\n46-Celeste2.png\n: But...I never heard any yell.\n33-Kyoko17.png\n: Exactly. Which means it wasn't them.\n42-Hiro5.png\n: Then...who was it?\n48-Byakuya9.png\n: The fundamental circumstances are becoming clear... If it wasn't the mastermind, and it wasn't Taka or Hifumi...then quite simply, it was someone else.\n49-Byakuya7.png\n: Makoto, Celeste, Sakura, Hina, Toko, or myself... One of us must be the thief.\n50-Hina15.png\n: Why would any of US wanna steal Alter Ego!?\n51-Byakuya.png\n: How about this for a reason?\n♪\nMusic cuts out, then restarts after a few seconds\n♪\n53-Byakuya2.png\n: There is a traitor among us.\n31-Makoto2.png\n: ...Huh?\n48-Byakuya9.png\n: One of us is working for the mastermind--a spy. And that's the one who stole Alter Ego. Can you deny the possibility?\n31-Makoto2.png\n: I-It can't be!\n20-Byakuya3.png\n: I've actually been thinking for some time now that there might be a spy among us. The mastermind brought someone in to help keep things moving smoothly.\nA spy for the mastermind? A...traitor? No... It's impossible... Something that horrible... Th-There's no way!\n53-Byakuya2.png\n: Why do you not speak? Are you struck silent by your inability to comprehend such a possibility?\n54-Hifumi13.png\n: I don't care!\n56-WelcometoDespair.png\n57-Hifumi19.png\n: I don't care...who... Someone, anyone...save her... Please, rescue her... I'm begging you... I just want to see her smiling face again...\n59-Kiyondo2.png\n: Same here. How many times do they hafta kill bro before they're happy...? I'll beg, I'll scrape my head across the ground. Just please give him back...!\n60-Hina14.png\n: This is pretty messed up... But still, I think I kinda get how they feel...\n62-Kyoko12.png\n: I think Alter Ego is most likely still safe, for the moment at least.\n46-Celeste2.png\n: If they wanted to destroy it, they wouldn't have taken it. They would've done it right here.\n63-Sakura3.png\n: So you're saying whoever did it has something else in mind for him...\nSomething else...?\n59-Kiyondo2.png\n: That doesn't matter. Nothing...nothing else matters...\n16-Kiyondo3.png\n: No matter what it takes, I'm gonna get him back! That's my promise as a man!\n54-Hifumi13.png\n: I swear I'll save her! Using the power of love...!\n65-GoodNight.png\n*Ding dong, bing bong*\n68-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\n37-Hina2.png\n: It's nighttime...\n70-Celeste15.png\n: It is unfortunate, but we will have to leave the search for tomorrow. For now, everyone get some sleep.\n17-Hifumi12.png\n: How can you be so casual! We don't have time to wait around!\n46-Celeste2.png\n: What good are you if you are too tired? You will be much more effective after a good night's sleep.\n16-Kiyondo3.png\n: Who gives a crap about \"effective\"!? We're talkin' about our FEELINGS here!\n33-Kyoko17.png\n: Anything we do at night brings a higher chance of the mastermind noticing us. Celeste is right. We should begin out investigation tomorrow morning. What do you think, Makoto?\n7-Makoto.png\n: I...agree with you. If we run around tonight in a panic, the mastermind is sure to notice, and we won't get anything done. Taka, Hifumi... I know how you feel right now, but... It's best if, just for tonight...you can try and endure it.\n59-Kiyondo2.png\n: Ngh...!\n57-Hifumi19.png\n: Gah...\n73-Celeste4.png\n: Okay, then let us part for today. We will begin our search for Alter Ego in the morning.\n20-Byakuya3.png\n: And you should think about what I said--someone may very well be spying for the mastermind.\n7-Makoto.png\n: ...\nAlter Ego...gone as quickly as he appeared... We'd finally discovered some small measure of hope. But even that was taken away from us. And we couldn't even put up a fight. We were given hope, and then when that hope was taken away...despair. It's just like...just like what the mastermind is doing to us... Then...could it really be true? Whoever stole Alter Ego... Could they really be working for the mastermind? If that's true...\n31-Makoto2.png\n: No! It can't be! There's no way!\nI didn't even realize I'd yelled that out loud. The scary thing isn't the idea of someone spying on us. What's really scary is the idea that we're starting to doubt each other again. That scares me more than anything.\n31-Makoto2.png\n: Dammit...!\nI threw myself into bed, trying to shake off all those unsettling thoughts. Before long I fell into a restless sleep.\n77-MrMonokumasLesson.png\n79-MonokumaTheater.png\n: \"Murder\" is a word whose definition changes with time, with place, with society. If murder is evidence of abnormality, then all of history's greatest heroes must have been abnormal. Sometimes the murders that people forgive are way more abnormal than the ones they don't!\n2-GoodMorning.png\n*Ding dong, bing bong*\n5-MonokumaTV.png\n: Good morning, everyone! It is now 7 a.m. and nighttime is officially over! Time to rise and shine! Get ready to greet another beee-yutiful day!\n7-BeautifulMorning.png\nToday...we have to look for Alter Ego.\n8-Makoto.png\n: Okay, first things first... To the dining hall!\nI found myself in surprisingly high spirits, and hurried to the dining hall. But when I found out what was waiting there for me...\n11-Sakura.png\n: Is this it? What happened to the others?\n12-Hina2.png\n: Aren't they coming...?\n13-Kyoko7.png\n: ...\nThere were only three people in the dining hall--Sakura, Hina, and Kyoko... So including me...\n8-Makoto.png\n: Only...four people?\n15-Hina19.png\n: God! This is why I hate people who take their sweet time with everything!\n16-Sakura6.png\n: Anyway, let's wait a little while longer for the others.\nSo we decided to wait, in case anyone else showed up. But no matter how long we waited...\n19-Hina9.png\n: So...it's 8 o'clock. We've been waiting here a full hour...\n20-Sakura3.png\n: Why haven't the others come?\n19-Hina9.png\n: Hiro and Celeste have never missed a day...till now.\n8-Makoto.png\n: And what I'm really worried about is...Hifumi and Taka. They were more eager than anyone to look for Alter Ego...and they're not here.\n22-DespairSyndrome2.png\n13-Kyoko7.png\n: Something must have happened.\n8-Makoto.png\n: Huh...?\n13-Kyoko7.png\n: I was careless. I was too distracted by Alter Ego... But Monokuma gave us a motive. There was no way something wouldn't happen eventually.\nMonokuma's motive...\n23-FlashT.png\n25-FlashB.png\n26-Monokuma19.png\n: Ten million dollars! I've prepared this graduation present for whichever lucky student makes it out of here alive! Whaddya think? It's ten million bucks! Ten million smackaroos! It's like totally wowie wow wow, am I right!?\n28-Makoto2.png\n: Don't tell me someone did something...for money!\nThat's what I wanted to say, but I didn't bother. I already understood. I understood, and I hated that I did. You can never really know another person completely. Anything can happen here, and you can't consider it \"strange.\" Not really...\n13-Kyoko7.png\n: We need to go look for the people who never showed up.\n19-Hina9.png\n: O-Okay. Let's go track them down...\nWithout another word, we left the dining hall.\n30-DISTRUST.png\n31-Kyoko11.png\n: We can cover more ground if we split up. Sakura, you go check the\ndorms\n. Make sure to check all of our rooms. Makoto, you check the\n1st floor of the school\n. Meanwhile, I'll check the\n2nd floor\n.\n32-Hina22.png\n: Okay, then I guess I'll check the\n3rd floor\n.\n13-Kyoko7.png\n: Don't take any risks. If anything happens, call for help right away.\n19-Hina9.png\n: I really hope nothing happens...\n28-Makoto2.png\n: So do I.\n33-Sakura12.png\n: Okay, let's go.\nAnxiety was written across each of our faces as we went out separate ways. Without hesitating, I rushed to the 1st floor of the school.\nOkay, I need to look around the 1st floor...\n35-Narration.png\n: We have free reign of the 1st floor at this point so we'd better start checking rooms.\n35-Narration.png\n: First off, it was mentioned a while ago but the nurse's office is now open to us.\n35-Narration.png\n: As it turns out, there's not much of interest here. More importantly, there's no one in the room.\n35-Narration.png\n: This is Classroom 1-B. I don't think I've ever shown a picture of it before this point. Like most classrooms, there is nothing important in it but it does have some snazzy blue wallpaper. There are also no students in here right now.\n♪\nMusic cuts out and a piercing scream is heard.\n♪\n???: S-Someone! Come here!\n28-Makoto2.png\n: What...!\n40-ToSurvive.png\nThat was Hina! She's supposed to be checking...\n28-Makoto2.png\n: ...the 3rd floor!\nThere was no time to think. I was running for the stairs before I knew what was happening.\nI flew up the stairs leading to the 3rd floor. Right away, I saw her standing there in the hallway.\n43-Hina10.png\n: M-Makoto!\n28-Makoto2.png\n: Hina, what's wrong!?\n43-Hina10.png\n: I-It's awful... The rec room door was open... A-And when I looked inside, I saw...I saw...!\nWhat did you see?\n43-Hina10.png\n: I'd better get the others...right...? I...I'm gonna go get 'em! You go on ahead, Makoto! *leaves*\nBefore I could say anything, she was rushing downstairs.\n28-Makoto2.png\n: The rec room...? What did she see in there...?\nBy this point, I was used to acting without thinking. So without thinking, I leapt into the rec room.\nThe first thing I saw when I got in the rec room was...\n22-DespairSyndrome2.png\n48-Celeste12.png\n: N...ngh...!\nIt was Celeste. And she was hurt.\n48-Celeste12.png\n: Gh... Makoto!\n28-Makoto2.png\n: C-Celeste! What happened!?\n48-Celeste12.png\n: I was...stupid. I got...attacked.\n28-Makoto2.png\n: Attacked!? By who!?\n48-Celeste12.png\n: I am not sure. Some sort of...strange man.\n28-Makoto2.png\n: Strange man...?\n48-Celeste12.png\n: A suspicious person whose existence is so unusual, I can't help but call him strange... Without a doubt, it was some sort of\nstrange suspicious individual\n. And that man attacked me, with the\nhammer\non the ground there...\nWhat is this...? It's some kind of...wooden hammer or something? Pretty strange design... There's some writing on the head...\n28-Makoto2.png\n: Justice...Hammer...1?\n48-Celeste12.png\n: That is the hammer he attacked me with. I barely managed to avoid the blow, but I stumbled and fell. I now curse my lack of daily exercise...\nSo you were attacked...with this? Justice Hammer 1...\n???: Makoto! Celeste!\n32-Hina22.png\n: I found Sakura!\n53-Sakura2.png\n: C-Celeste... What on Earth happened here?\n28-Makoto2.png\n: Apparently she was attacked by some kind of strange man...\n54-Sakura5.png\n: A...strange man? Tell us everything you can remember, Celeste. Be as detailed as you can...\n48-Celeste12.png\n: Well, it all happened earlier this morning... I woke up a little before 7 a.m. Nighttime was not yet over but I knew it was about to end, so I decided it would be okay if I... I decided to take a little stroll around the 1st floor. ...I understand now that that was a mistake. Anyway, that is where I first saw the strange man. I was immediately wary of him... He was obviously suspicious, so I decided to follow after him in secret. As I followed, I saw him go into the rec room. I tried to peek through the gap in the door which is when he noticed me, and...\n54-Sakura5.png\n: And that's when you were attacked.\n48-Celeste12.png\n: It happened\nafter 7 a.m.\n, just after nighttime had ended.\n28-Makoto2.png\n: So if it happened just after 7 o'clock...\n54-Sakura5.png\n: ...then that was just about an hour ago. Right when we were all meeting in the dining hall...\n48-Celeste12.png\n: The attack caused me to lose consciousness. Which would mean, I was unconscious for about an hour.\n19-Hina9.png\n: Well, I'm just glad you weren't hurt too badly...\n48-Celeste12.png\n: That is because I begged and groveled for my life...\n20-Sakura3.png\n: You did?\n58-Celeste5.png\n: I told him I would do anything if he spared me. I offered to lick his boots, whatever it took...\n59-Sakura4.png\n: So you were willing to throw away all your pride...\n58-Celeste5.png\n: It is a necessary skill for survival. Anyway, the important thing now is that we go search for the suspicious individual. If we do not hurry, this could become a\n[serious problem]\n.\n> serious problem\n28-Makoto2.png\n: Celeste... What do you mean, a \"serious problem\"?\n58-Celeste5.png\n: When I looked in the rec room, I saw that the suspicious man was not alone. He had with him...Hifumi.\n28-Makoto2.png\n: H-Hifumi!?\n61-Celeste14.png\n: After he attacked me, he dragged Hifumi away...\n53-Sakura2.png\n: You mean...Hifumi was kidnapped?\n19-Hina9.png\n: Shouldn't we start looking for him, then...? Listen, Celeste...did anything in particular stand out about this strange guy?\n58-Celeste5.png\n: Did anything stand out? Well... Rather than trying to explain it, it would probably be faster if I simply showed you.\n28-Makoto2.png\n: Show us...?\n63-Celeste17.png\n: This is Hifumi's hand-me-down. His digital camera...\n28-Makoto2.png\n: You don't mean...!\n64-Celeste2.png\n: I was able to photograph the suspicious individual without him realizing it.\n32-Hina22.png\n: Seriously!? Let's see it!\n61-Celeste14.png\n: I would tell you not to be shocked, but I fear it would do you no good.\nWith that strange comment in mind, we all looked at the camera...\n66-MrMonokumaAfterClass.png\n28-Makoto2.png\n: Huh...? Whaaaaaaat!?\nWell, you were definitely right about the \"strange\" part... Their face is totally covered.\n68-Hina12.png\n: Is that a...robot costume?\n61-Celeste14.png\n: As I said, a very strange and suspicious individual, yes?\n28-Makoto2.png\n: So this weird robot guy...dragged Hifumi away?\n61-Celeste14.png\n: And I took this right after being attacked. In other words, a full hour ago. Which is why if we don't hurry, it could become a serious problem.\n20-Sakura3.png\n: I believe I understand what happened. Well, no, there is much I don't understand. But... The point is, someone dressed like that dragged Hifumi away.\n28-Makoto2.png\n: And it happened over an hour ago...\n70-Hina15.png\n: This is bad! We have to hurry!\n28-Makoto2.png\n: Celeste, do you know where this mysterious man went?\n64-Celeste2.png\n: When they left the rec room, they headed left...\n54-Sakura5.png\n: If that's true, they were headed toward the stairs leading down to the 2nd floor!\n28-Makoto2.png\n: Then he must be down there, right!?\n12-Hina2.png\n: The 2nd floor... That's where Kyoko was supposed to be...\n28-Makoto2.png\n: Huh? Speaking of which, why isn't Kyoko here?\n19-Hina9.png\n: Sorry...I didn't have time to go look for her.\n54-Sakura5.png\n: This is bad. If the strange man did head to the 2nd floor, Kyoko might run into him...\n28-Makoto2.png\n: We have to hurry! Kyoko's in danger!\nAs soon as the words were out of my mouth, we all rushed out of the room and down to the 2nd floor.\n40-ToSurvive.png\n???: Hey, you two...\n75-Byakuya2.png\n: What's going on? What's all the fuss?\n76-Jill5.png\n: Yeah! You guys playin' a game or something!?\n70-Hina15.png\n: Does it freaking LOOK like we're playing a game!?\n28-Makoto2.png\n: Listen, have either of you seen Kyoko or Hifumi?\n78-Jill9.png\n: Nope nope, sure haven't!\n79-Byakuya.png\n: Are they on this floor? We just got here ourselves. I heard some kind of uproar, so I came running.\n80-Jill6.png\n: We came here together!\n81-Byakuya5.png\n: No...you're just stalking me.\n28-Makoto2.png\n: A-Anyway, can you guys help us look for them?\n82-Byakuya7.png\n: Why? What happened?\n54-Sakura5.png\n: There's no time now. We'll explain later.\n84-Byakuya3.png\n: Well...fine. It sounds like something interesting is going on.\n32-Hina22.png\n: HIFUMI! KYOKO! If you can hear me, say something!\nHer voice echoed down the hall in vain...\n20-Sakura3.png\n: Hm...?\n64-Celeste2.png\n: Did you hear something?\n20-Sakura3.png\n: Maybe...\n54-Sakura5.png\n: I think it came from...the library!\n32-Hina22.png\n: The library!? Okay, let's go!\nWe ran to the library as fast as our legs would carry us.\nWhen we opened the door to the library...\n3-DespairSyndrome2.png\n5-Hifumi16.png\n: Gh... It hurts...it hurts...!\n...we found Hifumi, seriously injured.\n6-Makoto2.png\n: A-Are you okay!?\n7-Hina2.png\n: I'm glad to see...you're still alive...\n5-Hifumi16.png\n: It's super bad, though... Look at all the blood...\n9-Byakuya15.png\n: How did you get hurt?\n5-Hifumi16.png\n: That guy hit me...\n6-Makoto2.png\n: What guy?\n5-Hifumi16.png\n:\nRobo Justice\n. Er, that's what I decided to call him, just now...\n10-Byakuya12.png\n: What are you talking about...?\n5-Hifumi16.png\n: Th-That guy was...Robo Justice...\n11-Celeste2.png\n: This \"Robo Justice\" you are referring to is...this, is it not?\n10-Byakuya12.png\n: Wh-What the hell am I looking at...?\n6-Makoto2.png\n: This is the one that attacked Celeste and Hifumi. Isn't that right, Hifumi?\n5-Hifumi16.png\n: Yeah...that's him, I'm sure of it... Robo Justice...!\n10-Byakuya12.png\n: Robo Justice, huh...?\n14-Sakura5.png\n: This just keeps getting stranger...\nIt's a hammer, just like the one Celeste was attacked with in the rec room. But this one is...\n6-Makoto2.png\n: Justice Hammer 2...?\nAnd on top of that...this one is actually a little bigger than the first one!\n5-Hifumi16.png\n: He attacked me with that hammer. He bonked me right on the head with it...\n18-Hina9.png\n: A hammer that big, I'm surprised you're still okay...\n5-Hifumi16.png\n: I'm *not* okay...! Look at all this blood...\n19-Sakura7.png\n: Protein helps heal wounds, you know. Would you like some?\n20-Celeste8.png\n: ...I have never heard such a thing. Are you sure it isn't just you?\n22-MrMonokumasLesson.png\n23-Monokuma5.png\n: Ahh-hahahaha!\n24-Hina12.png\n: It's him!\n25-Monokuma4.png\n: Puhuhu! A robot of justice, huh!? Now things are *really* starting to get exciting! What kind of special moves does it have? Can it fly? Can it COMBINE!?\n23-Monokuma5.png\n: Nyoohohoho! *leaves*\n27-BeautifulDeath.png\n28-Byakuya5.png\n: Why...is he here?\n11-Celeste2.png\n: Let us not concern ourselves with him... What we need to do now is get Hifumi to the nurse's office right away. Whatever else we do, he needs to be treated as soon as possible.\n29-Hina22.png\n: You're right! Let's go!\n5-Hifumi16.png\n: Ngh... Thanks, everyone...\nWe moved Hifumi to the nurse's office on the 1st floor so we could take care of his injuries.\n7-Hina2.png\n: How ya feelin', Hifumi? You want me to take a look at ya?\n33-Hifumi2.png\n: I-I'm okay... I think it stopped bleeding. I'm still kinda dizzy, though...\n34-Celeste.png\n: Perhaps you should rest here a while.\n35-Hifumi19.png\n: Y-Yeah, good idea...\n37-Sakura6.png\n: The rest of us should get back to looking for that mystery assailant...\n11-Celeste2.png\n: Indeed. Before another victim appears... The Justice Hammers seem to be increasing in size; first\n1\nand now\n2\n.\n38-Byakuya9.png\n: If there is a\nJustice Hammer 3\n, we can only assume it is even bigger than the first two.\n24-Hina12.png\n: If you got hit with anything bigger than that, you'd be dead for sure!\n39-Byakuya7.png\n: Tell us what happened to you, Hifumi.\n33-Hifumi2.png\n: Well...I woke up early this morning and started looking for Alter Ego ahead of everyone else... I went to the 3rd floor, and that's where the strange costumed man attacked me...\n11-Celeste2.png\n: That must be what I witnessed at\naround 7\nthis morning.\n33-Hifumi2.png\n: After that, he dragged me to the library and WHACK! Down came the hammer... That must've been...30 or 40 minutes ago.\n41-Hina20.png\n: At\naround 7:30\nin other words... We would've still been in the dining hall.\nWhich means Hina, Sakura and I were together, and Kyoko was still with us. So we all have alibis...\n43-Byakuya.png\n: I was in the laundry room, doing my laundry.\n44-Jill9.png\n: His black underwear is as black as the pitch-black darkness of the blackest night...\n28-Byakuya5.png\n: Why do you know that...?\n45-Jill12.png\n: Isn't it obvious? Cuz I was peeking!\nAnyway, so that means Byakuya and Toko were together at the time. Meaning they also have alibis... Then the only ones who *don't* have alibis for when Celeste and Hifumi were attacked are the only two we haven't seen yet--Hiro and Taka. That's it, right...?\n43-Byakuya.png\n: By the way, what happened to Kyoko? I haven't seen her anywhere...\n18-Hina9.png\n: Oh yeah. She was supposed to be checking the 2nd floor, but...I didn't see her up there at all.\n47-Sakura3.png\n: Where could she have disappeared to...?\n43-Byakuya.png\n: She's disappeared, huh? What a strange woman...\n39-Byakuya7.png\n: She might be exactly as I suspected...\n6-Makoto2.png\n: H-Hold on! Kyoko was with us in the dining hall when Celeste and Hifumi were attacked! So--\n43-Byakuya.png\n: I'm not talking about who attacked them.\n6-Makoto2.png\n: ...Huh?\n3-DespairSyndrome2.png\n49-Byakuya2.png\n: I'm referring to what we talked about last night. Who the\nmastermind's spy\nmight be...\n6-Makoto2.png\n: Are you saying...Kyoko's working with the mastermind? Th-That's not possible!\n28-Byakuya5.png\n: Isn't it? This woman, who seems almost eager to handle dead bodies, hasn't even revealed her true identity.\n19-Sakura7.png\n: Save this discussion for later. Right now we need to focus on finding the suspicious individual.\n29-Hina22.png\n: Yeah! If we don't hurry, there's only gonna be more victims! That might be why Kyoko and Taka and Hiro haven't shown up yet!\n6-Makoto2.png\n: Sh-She's right. We have to do something about that mystery man first...\n33-Hifumi2.png\n: Don't worry about me. I'll catch up with you guys after I rest for a bit...\n51-Celeste4.png\n: Understood. Take care of yourself.\n52-Sakura12.png\n: Okay, let's go.\n27-BeautifulDeath.png\n41-Hina20.png\n: So whoever that is running around, why are they wearing that weird costume?\n9-Byakuya15.png\n: Don't bother looking for reason from a deviant.\n54-Jill10.png\n: So? What're we gonna do? Split up and look around?\n55-Sakura.png\n: Our opponent is very dangerous. We don't know what they're capable of. Even here...\n♪\nMusic cuts out.\n♪\n57-Celeste14.png\n: ...!?\n9-Byakuya15.png\n: What's wrong...?\n57-Celeste14.png\n: I saw a shadow! Something moving around at the top of the stairs!\n24-Hina12.png\n: Really!?\n59-BoysLifeofDespair.png\n60-Sakura2.png\n: Up on the 2nd floor, then? You bastard! You won't get away from me!\nWe all shot toward the stairs.\n57-Celeste14.png\n: He must be around here somewhere. Let's split up and corner him!\n19-Sakura7.png\n: But don't take any chances. As soon as you find him, call out and I'll come running.\n20-Celeste8.png\n: Okay, but...what should we yell?\n29-Hina22.png\n: Anything! It doesn't matter!\n20-Celeste8.png\n: Then...is \"haaah!\" okay?\n63-Hina15.png\n: Haaah or dohyaah or whatever you want! Just yell loud enough so we can hear you!\n64-Celeste3.png\n: Hmhmhm. Dohyaah? I have never heard such a reaction...\n63-Hina15.png\n: Okay, whatever! Just hurry up and start looking! Okay? Let's go! *leaves*\n65-Jill3.png\n: Hey Mister Robot! Where ya hidin'? If you don't come out, we're gonna decommission ya! *leaves*\nWe spread out in every direction to track down the costumed suspect.\n68-Narration.png\n: Let's check the classroom at the end of the hallway.\n68-Narration.png\n: Doesn't look like anyone's in here.\n♪\nMusic cuts out, a loud, feminine scream is heard.\n♪\n???: Ha-aaaaaahhhh!\n6-Makoto2.png\n: That strange cry--! That had to be Celeste! It came from the floor above... She's on the 3rd floor!\nI sprinted up to the 3rd floor.\n72-ToSurvive.png\n57-Celeste14.png\n: Over here, everyone!\nEveryone who had heard the scream had come running...\n63-Hina15.png\n: Celeste! What's wrong!?\n39-Byakuya7.png\n: That was a rather...intense scream for someone like you.\n57-Celeste14.png\n: I saw him! The strange costumed man...! He ran off as soon as I screamed... I was blocking the stairs, so he headed\nfurther down into the hallway\nand disappeared...!\n6-Makoto2.png\n: He must be down this hall! Come on, let's go!\n74-Jill.png\n: Haa...haa...\n29-Hina22.png\n: What is it now!?\n♪\nMusic cuts out.\n♪\n76-Toko16.png\n: Hachoo!\n78-Toko5.png\n: H-Huh...?\n24-Hina12.png\n: Whoa! It's really true!\n63-Hina15.png\n: But that doesn't matter right now!\n♪\nA very loud scream is heard\n♪\n???: Ungyaaaaaahhh!!!\n6-Makoto2.png\n: Huh!?\n72-ToSurvive.png\n81-Hina10.png\n: Wh-What was that!?\n57-Celeste14.png\n: That came from downstairs! It must have been...\n6-Makoto2.png\n: Hifumi! He's in the nurse's office! This is bad! Come on, we have to go back!\n28-Byakuya5.png\n: What about the suspect? We've gone to all this trouble to capture him, right?\n83-Celeste17.png\n: Then why don't we split into two groups?\n84-Byakuya3.png\n: I'll lead the hunting party. That seems much more interesting.\n11-Celeste2.png\n: Very well, then\nMakoto\nand\nHina\n, you come with\nme\nto the nurse's office. I will leave the capture of the suspicious individual to\nToko\n,\nSakura\n, and\nByakuya\n.\n19-Sakura7.png\n: We'll handle it. Just go take care of Hifumi.\n6-Makoto2.png\n: Okay! You guys be careful!\nWith that we split into two groups. Me, Celeste, and Hina all ran downstairs to the 1st floor.\n63-Hina15.png\n: He's in the nurse's office! Let's go!\n♪\nMusic fades out.\n♪\nWe stormed into the nurse's office, and what greeted us was...\n...a world of dripping crimson.\n../Smilies/emot-siren.gif\nCLICK HERE FOR VIDEO\n../Smilies/emot-siren.gif\nEverything was covered in red. And in the center of all this red was...\n2-Makoto2.png\n: H-Hifumi...?\n4-BoysLifeofDespair.png\n5-Hina13.png\n: AAAAAAAAHHHHHH!!!\n6-Celeste14.png\n: I-It looks like something...very bad has happened...\n6-Celeste14.png\n: I certainly was not expecting this. I did not imagine that Hifumi would be murdered!\n5-Hina13.png\n: M-Murdered!? You're not serious, are you!? He's not really dead, is he!?\n8-BodyDiscovery.png\n*Ding dong, ding dong*\n11-MonokumaTV.png\n: A body has been discovered! After a certain amount of time, which you may use however you like, the\nclass trial\nwill begin!\n5-Hina13.png\n: What the...?\n6-Celeste14.png\n: That was...the body discovery announcement.\nThe body discovery announcement... When\nthree or more people\ndiscover a body after a murder, that's what plays. And since we just heard it, that means...\n6-Celeste14.png\n: It must mean... Hifumi... Someone killed him. One of us...\n2-Makoto2.png\n: One of...us?\n6-Celeste14.png\n: And look at that...\nWhen Celeste said that, she pointed to something... Something on the floor... Something that had also been on the floor after the last two surprise attacks...\nAnother hammer... Justice Hammer 3... And it's even bigger than the other two...!\n6-Celeste14.png\n: Just as I suspected. One strike from that, and you're finished...\n2-Makoto2.png\n: Then the killer...\n6-Celeste14.png\n: There can be no doubt. The suspicious individual, going by what Hifumi called him... the culprit must be\nRobo Justice\n. Whoever's hiding in that costume is the one that killed Hifumi!\n2-Makoto2.png\n: But...wait... You saw him on the 3rd floor, right? Running back into the hall... So how did he end up in the nurse's office? You're not saying they, like, teleported or something, right?\n18-Celeste17.png\n: We can figure out that part later. Right now, we have to tell the others.\n2-Makoto2.png\n: Y-You're right.\n19-Celeste2.png\n: Then shall we go?\n21-Hina3.png\n: ...\n19-Celeste2.png\n: Hina...snap out of it.\n21-Hina3.png\n: ...Huh?\n2-Makoto2.png\n: Are you okay, Hina?\n5-Hina13.png\n: S-Sorry...I'm not sure I can move right now... I-I'm feeling kinda...\n23-Celeste7.png\n: This is a problem. We can't just leave Hina here alone.\n2-Makoto2.png\n: Okay, then I'll go get everyone. You stay here with Hina!\n19-Celeste2.png\n: ...\n24-Celeste15.png\n: Very well. I leave it to you, then.\n2-Makoto2.png\n: Okay! I'll be back soon!\nI tried to sound confident and upbeat, but...I still hadn't stopped trembling from what I'd just been through.\n26-ToSurvive.png\nEveryone else is already on the 3rd floor. I have to hurry...!\nThis is where everyone was chasing after the suspicious individual. Where was he headed...?\n28-Flashback.png\n30-Hina15.png\n: Celeste! What's wrong!?\n31-Byakuya7.png\n: That was a rather...intense scream for someone like you.\n6-Celeste14.png\n: I saw him! The strange costumed man...! He ran off as soon as I screamed... I was blocking the stairs, so he headed\nfurther down into the hallway\nand disappeared...!\n28-Flashback.png\nHe ran off, going further down the hallway... Way into the back...of the hallway?\n33-Narration.png\n: The back of the hallway would be...the physics lab.\n2-Makoto2.png\n: ...\nAs far as I can tell, there's nobody here. But still...I feel some kind of presence... Yeah, I'm sure I can feel someone's presence...! This presence... Is it coming from over there...in the back?\n♪\nMusic fades out.\n♪\nI leapt through the doorway...\nAnd when I did, I found...\n...another nightmare.\nThe second nightmare of the day was waiting there to greet me.\n../Smilies/emot-siren.gif\nCLICK HERE FOR VIDEO\n../Smilies/emot-siren.gif\nThere, in a pool of his own blood...was Taka. Dead.\n2-BoysLifeofDespair.png\nHifumi's body, discovered in the nurse's office...\nTaka's body, discovered in the equipment room... I was witness to two nightmares, one right after another. No... They weren't nightmares. This is...harsh reality. The true nightmare is this reality, the reality I have to face every day. But still...\n5-Makoto2.png\n: Why...is this happening?\n6-Byakuya.png\n: ...\n7-Sakura4.png\n: ...\n5-Makoto2.png\n: T-Toko!? Don't tell me...! Toko, too!?\n6-Byakuya.png\n: Relax. She just passed out when she saw the blood.\n5-Makoto2.png\n: The blood...?\nOh, that's right. When Toko is, um, Toko...she has a fear of blood, huh?\n6-Byakuya.png\n: We've tried everything to get her to wake up, but no luck. Just leave her be for now.\nIt's like he said. I should just leave her alone for now.\nAnother hammer... Now it's Justice Hammer 4, and it's even bigger than before...! Is that \"suspicious individual\" responsible for killing Taka, too...!?\n14-Sakura5.png\n: But...why is it\nJustice Hammer 4\n?\n5-Makoto2.png\n: Huh? What do you mean?\n15-Sakura3.png\n: Celeste was attacked with\nJustice Hammer 1\n, then Hifumi was hit with\nJustice Hammer 2\n. But this time it was\nJustice Hammer 4\n. What happened to\nnumber 3\n?\n5-Makoto2.png\n: Ah--!\n6-Byakuya.png\n: ...What's the matter?\n5-Makoto2.png\n: W-Well, when you mentioned\nJustice Hammer 3\n, you just reminded me...\n17-Byakuya2.png\n: Out with it. Do you know something?\n5-Makoto2.png\n: Actually...Taka's not the only one that's been killed. Hifumi's dead, too!\n19-Sakura2.png\n: Wh...!? Hifumi's been killed!?\n5-Makoto2.png\n: Y-Yeah...\n20-Byakuya15.png\n: Which is why you came to get us... Then we'd better go check it out.\n14-Sakura5.png\n: Of course! Come on!\nSo Sakura, Byakuya, and I rushed out of the physics lab. But as soon as we were out of the physics lab...\n23-Celeste6.png\n: Ah--!\n5-Makoto2.png\n: Celeste? Aren't you supposed to be waiting in the nurse's office?\n24-Celeste14.png\n: S-Something has...come up.\n6-Byakuya.png\n: Yeah, I heard. Hifumi is dead, right?\n24-Celeste14.png\n: Well...that is not all. It is...gone.\n5-Makoto2.png\n: Huh? What's gone?\n24-Celeste14.png\n: It has disappeared...\n5-Makoto2.png\n: Disappeared...?\n26-ToSurvive.png\n24-Celeste14.png\n: Hifumi's body has disappeared!\n5-Makoto2.png\n: What...?\n28-Byakuya10.png\n: What are you talking about? It's disappeared? Don't be ridiculous.\n24-Celeste14.png\n: ...\n29-Byakuya5.png\n: ...Are you serious?\n14-Sakura5.png\n: What the heck is happening here...!? Everyone, back to the nurse's office!\nI practically leapt down the stairs, nearly losing my balance. I reached the nurse's office, completely out of breath.\n♪\nMusic cuts out.\n♪\n5-Makoto2.png\n: ...!\nI couldn't believe my eyes...\n32-FlashT.png\n34-FlashB.png\nHifumi's body was there just a few minutes earlier.\n5-Makoto2.png\n: It just...disappeared?\n36-DISTRUST.png\n37-Hina3.png\n: ...Me and Celeste went to the bathroom... But we were only gone for like a minute! And then, when we got back...\n38-Celeste5.png\n: This must be the work of the culprit. They must have come and\ncarried the body away\n. They must really be enjoying this... Enjoying the sight of us standing around, frightened and confused...\n24-Celeste14.png\n: We're all going to die here. We're going to die, just like those guys died...\n40-Byakuya12.png\n: I don't believe this. I don't believe a body would just...disappear.\n28-Byakuya10.png\n: First there were\ntwo murders\n, and now one of the bodies has been taken? This is...unnatural.\n41-Hina12.png\n: H-Hold on! What do you mean, TWO murders!?\n7-Sakura4.png\n: Taka's been killed. We found him in the equipment room.\n43-Hina10.png\n: I-It can't be! Taka, too!? It can't be... It can't be...\n44-Hina13.png\n: NooooooOOOOOOO!!!\n14-Sakura5.png\n: Hina, calm down!\n43-Hina10.png\n: We're all gonna die... All of us... They're gonna kill all of us!\n26-ToSurvive.png\n46-Byakuya7.png\n: Then who might the next target be? Toko?\n5-Makoto2.png\n: Huh...?\n19-Sakura2.png\n: I completely forgot! She's still unconscious in the equipment room!\n23-Celeste6.png\n: You left her at the scene of the crime!?\n47-Byakuya3.png\n: We didn't have a choice. She passed out, and she refused to wake up.\n38-Celeste5.png\n: So she is still unconscious?\n14-Sakura5.png\n: Wait, so you knew she was still up there, and said nothing? Why...!?\n47-Byakuya3.png\n: That annoying little insect clings to me wherever I go... We'd be better off without her.\n49-Sakura11.png\n: Y-You bastard!\n46-Byakuya7.png\n: Calm down. You forgot about her, didn't you? You have no right to blame me.\n5-Makoto2.png\n: Everyone stop fighting! Right now we need to hurry back!\n37-Hina3.png\n: I can't take this anymore... I don't want anyone else to die!\n14-Sakura5.png\n: Byakuya... If something's happened to Toko, I'll never forgive you!\n47-Byakuya3.png\n: Hmph.\nWe shot out of the nurse's office and bolted up the stairs, heading back to the 3rd floor. We ran back to the equipment room at full speed. And when we got there...\nToko!\n5-Makoto2.png\n: Thank God you're okay.\n♪\nMusic fades out.\n♪\nBut right away I noticed... There was something very different here.\n5-Makoto2.png\n: ...!\nIt was gone... Taka's body, which should have been right there...had disappeared.\n36-DISTRUST.png\n40-Byakuya12.png\n: This can't be happening...\n14-Sakura5.png\n: Are we hallucinating all this or something?\n5-Makoto2.png\n: No...it's not a hallucination.\n32-FlashT.png\n34-FlashB.png\nI know I saw it before. And what I'm seeing now...isn't what I saw before.\n37-Hina3.png\n: Wh-What!? Are you saying...Taka disappeared, too!?\n29-Byakuya5.png\n: Stop saying \"\ndisappeared\n.\" It didn't just vanish into thin air. Obviously whoever did this has hidden the body.\n5-Makoto2.png\n: But why would they do that?\n58-Byakuya6.png\n: I couldn't possibly begin to imagine.\n24-Celeste14.png\n: Anyway, our costumed suspect is clearly continuing his crime spree.\n43-Hina10.png\n: We gotta hurry up and catch him, before he kills ALL of us!\n29-Byakuya5.png\n: Oh, I don't think you have to worry about that.\n41-Hina12.png\n: Huh...?\n60-Byakuya9.png\n: Think about it... Who could possibly be responsible for killing and hiding these dead bodies?\n61-Hina9.png\n: U-Umm...\n46-Byakuya7.png\n: When Hifumi's death cry went up, everyone here was together on the 3rd floor.\n62-Celeste2.png\n: After that, we split up into two groups.\n17-Byakuya2.png\n: And now this time, you all came here as a group from the nurse's office. In other words, the only ones who could have done this are\nHiro and Kyoko\n, who are still missing.\n5-Makoto2.png\n: H-Hold on a second! Kyoko has an alibi for when Celeste and Hifumi were attacked! There's no question that she was in the dining hall with us!\n47-Byakuya3.png\n: Hmph. You seem very adamant about defending her. Perhaps you are...in love?\n5-Makoto2.png\n: Th-That's not it at all!\n6-Byakuya.png\n: Well, anyway. Yes, I do accept Kyoko's alibi.\n38-Celeste5.png\n: Which means, the suspicious individual we're looking for can be none other than...Hiro.\n64-Byakuya4.png\n: Which further means, there will be no more murders. The regulations are very clear about that.\n5-Makoto2.png\n: Oh, that's right...! There's a rule that says\nyou can only kill a maximum of two people\n...\n17-Byakuya2.png\n: As long as that rule is in place, there will not be a third murder. If they were to break that rule...\n66-Monokuma2.png\n: I'd mince ya! Mince ya without a second thought! Mince ya, grind ya, turn ya into paste! By the way, did you know that fish paste can also refer to shellfish, like shrimp or crabs!? *leaves*\n6-Byakuya.png\n: ...Indeed.\n67-Celeste7.png\n: So since\ntwo people have been killed\n, there is no possibility of any more.\n15-Sakura3.png\n: You knew that from the beginning, didn't you Byakuya? Which means you knew Toko was never in danger...\n47-Byakuya3.png\n: I still meant it when I said we'd be better off without her, though.\n46-Byakuya7.png\n: Anyway, with that in mind, we can now relax and search for\nthe two missing bodies\n.\nThe two missing bodies... Two people have been killed, and their bodies have been hidden. The only one without an alibi, the only one who could have done it...is Hiro. But...is he really the killer? And what about Kyoko? If she's not involved in this case, where did she go...?\n47-Byakuya3.png\n: Hey, Makoto. What's the matter?\n5-Makoto2.png\n: Huh? Oh, no...it's nothing.\n6-Byakuya.png\n: Whatever. We need to find those bodies, or our little narrative here can't move forward.\n62-Celeste2.png\n: Very well. Then let us split up and begin searching.\n61-Hina9.png\n: B-But...\n70-Celeste.png\n: There is no need to be afraid. No more murders will take place during this case.\n61-Hina9.png\n: I-I know that. I mean, I think I do. But...\n7-Sakura4.png\n: If you're still nervous, I'll come with you.\n71-Hina14.png\n: O-Okay, thank you...\n7-Sakura4.png\n: No need to thank me.\n72-Byakuya14.png\n: Then let's get moving. Yell out if you find anything.\nByakuya left the equipment room, followed by the others. I have to try and find the two missing bodies...\n2-BeautifulDeath.png\n3-Narration.png\n: We'll begin our search for the bodies in the Art Room.\n6-Sakura3.png\n: We need to search for the bodies that have disappeared. What happens after that...\n8-Hina14.png\n: Where could two dead bodies have disappeared to...?\n*Rattle rattle*\n11-Makoto2.png\n: Huh...?\nThe door must be locked...\n3-Narration.png\n: Nothing but the first Justice Hammer in the Rec Room.\n3-Narration.png\n: Classroom 3-A is similarly empty.\n17-DISTRUST.png\n18-Celeste17.png\n: Makoto...!\n19-Byakuya5.png\n: Why are you just standing there? We need to get to the\nrepository\n.\n11-Makoto2.png\n: Huh? You mean...!?\n20-Celeste2.png\n: ...I found them. Hifumi and Taka's bodies had both been hidden in the repository.\n21-Byakuya14.png\n: I've already told Hina and Sakura. We'll go on ahead... *leaves*\nTheir bodies were in the repository...?\nAre the bodies here somewhere...?\nUp ahead is...the repository. The doorknob turned...! I guess it's unlocked. Then I have no choice but to go inside...\n♪\nMusic fades out.\n♪\nSo I opened the door. And when I entered...\n...I saw...\n../Smilies/emot-siren.gif\nCLICK HERE FOR VIDEO\n../Smilies/emot-siren.gif\nThe two bodies that had disappeared were right there. The smell of blood made me gag... What I saw\nbefore my eyes\nwas unquestionable, unavoidable, unwavering reality. And then...I heard the announcement for a second time.\n28-BodyDiscovery.png\n*Ding dong, ding dong*\n31-MonokumaTV.png\n: A body has been discovered! After a certain amount of time, which you may use however you like, the\nclass trial\nwill begin!\n33-MrMonokumasLesson.png\n34-Monokuma.png\n: And so here we are! Without further ado, let me give you all\nthe next Monokuma File\n!\n35-Monokuma4.png\n: I was going to hand them out when you found the bodies the first time, but I thought something might happen. It was really hard to resist, but...turns out I was right!\n19-Byakuya5.png\n: Just hand it over already.\n35-Monokuma4.png\n: Now, make sure to investigate with all of your mental might and prepare for the class trial! Okay, see ya later! *leaves*\n♪\nNo Music.\n♪\n37-Byakuya9.png\n: Well then, now that we've found the bodies, all that's left is to uncover the culprit.\n38-Hina16.png\n: H-Hold on... How can you be so...so calm...? I mean, they're *dead*, ya know!?\n40-WelcometoDespair.png\n41-Hina18.png\n: Dead! Gone forever! They're never coming back!\n43-Hina17.png\n: Awful... This is all just too awful!\nHina suddenly burst into tears. She clutched at Hifumi's lifeless body.\n45-Hina26.png\n: Wh-Who would do this...? Why...? WHYYY!?\nLarge, wet tears fell from her eyes. The tears landed on Hifumi's cheeks. If this were some world of make-believe, that might have been when hifumi opened his eyes. But this wasn't a movie.\n♪\nNo Music.\n♪\nThis wasn't...\n53-ReturnFromTheDead.png\n54-Hifumi23.png\n: Ng...\n55-Makoto33.png\n: He's alive again!?\n54-Hifumi23.png\n: Where...am I? Cold...so cold... Is...winter coming?\n45-Hina26.png\n: H-Hifumi! Wake up!\n54-Hifumi23.png\n: ...Huh? Ahh...that's right... I remember now... Hope's Peak...\n45-Hina26.png\n: Come on! You gotta wake up!\n54-Hifumi23.png\n: Before...I'd met you...all... I'd met...you all...\n56-Byakuya.png\n: His memories are all blending together. He has nothing useful to offer us...\n54-Hifumi23.png\n: Ahh...the light... It's... reaching out...to me... Like...the tail...of a comet...\n45-Hina26.png\n: Hey, Hifumi! Who was it? Who attacked you!? Who tried to kill you!?\n54-Hifumi23.png\n: Who...killed me...? That's right... I remember...their name...\n54-Hifumi23.png\n: Y...Yasu...hi...ro...\n54-Hifumi23.png\n: ...\nHis eyes closed. And they never opened again. Death for the second time... Absoulte, undeniable death.\n2-BeautifulDeath.png\nNo matter how many more of Hina's tears splashed his face...there was no second miracle. Reality set in again.\n61-Byakuya3.png\n: This isn't some stereotypical fantasy world. Tears can't restore a person's vitality.\n62-Celeste15.png\n: You have no tears, do you? No blood in your veins, no calcium in your bones. At least you have your meat...\n19-Byakuya5.png\n: You're just angry. Going out of his way to return, just to leave us with those unnecessary dying words. Now this game has become exceedingly boring.\n6-Sakura3.png\n: He said...Yasuhiro, right?\n64-Celeste8.png\n: Yasuhiro Hagakure... That is the only person he could have been referring to.\n56-Byakuya.png\n: And with that, the case is solved.\nAssaulting people, and even killing Taka and Hifumi... And then going so far as to hide their bodies... A criminal that hides his face behind a mask, and uses a bunch of giant wooden hammers... Is that what Hiro is...?\n43-Hina17.png\n: If it's true, I can't forgive him... No way can I ever forgive him! To kill two of our friends...!\n66-Byakuya7.png\n: Anyway, it's about time we tracked down the culprit in our little life-or-death game here.\n67-Byakuya15.png\n: Although...this time it's not all that life-or-death. The trial will conclude without much trouble.\n62-Celeste15.png\n: Yes, it does look that way.\n11-Makoto2.png\n: ...\nIt's going to begin again. We have to go through this...one more time. ...I have to accept it... I have no choice but to go through with this. To make sure everyone survives... I just have to do it!\n2-BOX15.png\nFirst I'd better check the Monokuma File... \"The victims were Hifumi Yamada and Kiyotaka Ishimaru. The cause of death for each was a\nblow to the head\n. It is thought that they were both killed with a\nsimilar weapon\n.\n4-Makoto2.png\n: ...That's it?\n5-Byakuya2.png\n: Yeah, it's pretty strange. We got way less information this time than before.\n6-Celeste8.png\n: That is no problem. After all, the events of this case unfolded before our very eyes. We should know more about what happened than the Monokuma File could, anyway.\n7-Byakuya.png\n: Maybe...\n9-Sakura4.png\n: There's something else that's bothering me... Someone else has been missing for quite a while...\n4-Makoto2.png\n: Are you talking about Kyoko?\n10-Sakura3.png\n: Without a doubt, she has an alibi for when Celeste and Hifumi were attacked. But what if the killer wasn't acting alone? What if they had...\nan accomplice\n?\n4-Makoto2.png\n: An accomplice!?\n12-MrMonokumasLesson.png\n13-Monokuma.png\n: An accomplice!?\n14-Celeste2.png\n: ...What are you doing here?\n15-Monokuma13.png\n: Don't be rude! I'm here to answer your question!\n4-Makoto2.png\n: What question...?\n13-Monokuma.png\n: You're talking about accomplices, right? I'm pretty sure I explained it before, didn't I? During the first class trial!\n16-Flashback.png\n5-Byakuya2.png\n: Speaking of which, I'd like to ask the bear...if there *is* an accomplice, do they also become \"blackened\"?\n13-Monokuma.png\n: So you ask, and so I shall answer! Each murder is allowed to have an accomplice, but only the one who does the killing will get to graduate.\n18-Kyoko11.png\n: So in other words, two people can work together, but one of them has no chance of profiting from it...\n19-Mondo3.png\n: Then there's no way anyone would work together, right...?\n16-Flashback.png\n13-Monokuma.png\n: So basically...you can be an accomplice if you want, but there's no gratification in it!\n21-Sakura.png\n: So are you saying nobody worked together this time, either?\n15-Monokuma13.png\n: Sorry, can't answer that! it would obstruct the free exchange of information between you guys. I just want to make sure you don't forget--no matter how much you assist in a murder\nonly one blackened can graduate\n. An accomplice gets NOTHING!\n23-Byakuya5.png\n: Then we only need to figure out who that one blackened is that did the killing, right? Just like normal?\n13-Monokuma.png\n: Okay, okay, let me take this opportunity to clarify the whole shebang. In this class trial, what you need to determine is...\n24-Monokuma12.png\n: ...the\none true blackened\nwho devised the murder plot and put it into action!\nThe true blackened...? So just one person?\n13-Monokuma.png\n: Now it's down to the final battle between all of you, and the blackened! Good luck to all the contestants! *leaves*\n2-BOX15.png\nSo there can only be one blackened. An accomplice wouldn't benefit...\n4-Makoto2.png\n: Then I can't see any way Kyoko would be connected to this case, after all.\n7-Byakuya.png\n: You may be right...\n26-Hina9.png\n: If that's true then...Kyoko, where are you?\n9-Sakura4.png\n: As long as she's not connected to the case, it doesn't matter. Let's get back to the investigation.\n28-Celeste7.png\n: I have absolutely no doubt that Hiro is responsible. But for the time being, I suppose it can't hurt to pursue further information.\n26-Hina9.png\n: You know...don't you think we should consider a certain someone a suspect, just in case? I'm talking about the murderous fiend...Genocide Jack!\n30-Jill5.png\n: Wha--!? I'm offended!\n31-Hina12.png\n: Kyah!?\n32-Byakuya12.png\n: You... When did you--?\n33-Jill2.png\n: I've been looking all over for you, Master! When I woke up, you were nowhere to be found!\n32-Byakuya12.png\n: ...\n35-Jill8.png\n: Anyway! You there, milk sack swimmer girl!\n31-Hina12.png\n: Milk sack...?\n35-Jill8.png\n: Why do I gotta be a suspect!?\n36-Hina16.png\n: Well, I mean...you *are* a serial killer.\n30-Jill5.png\n: So what, I'm like a special guest suspect every time!? I have an alibi, you know!\n38-Byakuya9.png\n: She's right about that... When we heard Hifumi scream, she was with me. And when the bodies disappeared, she was still lying unconscious in the equipment room. Plus, Taka's body aside, I can't imagine any way she would have been able to move Hifumi's body.\n39-Jill9.png\n: Besides, I calculate every move I make! I'm not gonna kill someone when everyone knows what I look like!\n40-Jill7.png\n: They don't call me the murderous fiend for nothing!\n41-Hina15.png\n: That's not the kind of thing you should be bragging about!\n6-Celeste8.png\n: On another topic, should we post a guard by the bodies like before? We can't have them disappearing again...\n21-Sakura.png\n: Hina and I can handle that. You don't mind, do you Hina?\n43-Hina14.png\n: Sure. I'd be totally useless on the investigation anyway...\n7-Byakuya.png\n: Then that's that. Let's begin.\nThis whole thing is so strange... All but one of us has an alibi, so figuring out who did it should be obvious, right? But... Maybe it's just me, but I don't think it's going to be as straightforward as it seems.\n46-Narration.png\n: We can finally start our investigation. The lead-up to the investigation can get a little confusing though with all the running around and disappearing bodies so luckily, Sakura can help us by refreshing our heads on the sequence of events so far. It's a bit long but it does a good job of organizing what we know.\n9-Sakura4.png\n: There are many aspects to the incident this time. *Too* many, to be honest. Considering that, it may be good to look back on everything that's happened. Would you like my help?\n> Yes\n4-Makoto2.png\n: Yeah, let's look back on things.\n21-Sakura.png\n: This morning, only four of us met up at the dining hall--\nHina, Kyoko, you,\nand\nmyself\n. We waited for the others, but nobody showed up. So we decided to go look for them. It was around\n8 o'clock\nwhen we began our search.\n4-Makoto2.png\n: And soon after we split up, Kyoko disappeared...\n21-Sakura.png\n: After that, Hina found\nCeleste\nin the\nrec room, on the 3rd floor\n, then quickly came and got you and me.\n4-Makoto2.png\n: According to Celeste, she was attacked by a suspicious individual and lay unconscious for about an hour. In other words, she was attacked an hour before we found her. Meaning,\njust after 7 o'clock\n.\n50-FlashT.png\n52-FlashB.png\n21-Sakura.png\n: Based on the picture Celeste took, we discovered her attacker was dressed in a strange costume. It was...\nRobo Justice\n. It also became clear that this Robo Justice had\ndragged Hifumi away\n.\n54-Sakura6.png\n: After meeting up with Toko and Byakuya, we began searching for the costumed assailant. We found an\ninjured Hifumi\nin the\nlibrary, on the 2nd floor\n. We took him down to the\nnurse's office, on the 1st floor\n, then resumed our search. But not long after leaving the nurse's office...\n16-Flashback.png\n56-Celeste14.png\n: ...!?\n57-Byakuya15.png\n: What's wrong...?\n56-Celeste14.png\n: I saw a shadow! Something moving around at the top of the stairs!\n16-Flashback.png\n4-Makoto2.png\n: Based on Celeste's claims, we went back up to the\n2nd floor\n, where we split up and began searching. Then, right after that...\n58-Sakura7.png\n: Celeste screamed. This time she had apparently seen the suspect on the\n3rd floor\n. Hearing her screams, we quickly made our way to the\n3rd floor\n.\n16-Flashback.png\n41-Hina15.png\n: Celeste! What's wrong!?\n60-Byakuya7.png\n: That was a rather...intense scream for someone like you.\n56-Celeste14.png\n: I saw him! The strange costumed man...! He ran off as soon as I screamed... I was blocking the stairs, so he headed\nfurther down into the hallway\nand disappeared...!\n16-Flashback.png\n21-Sakura.png\n: And then...\n16-Flashback.png\n???: Ungyaaaaaahhh!!!\n4-Makoto2.png\n: Huh!?\n62-Hina10.png\n: Wh-What was that!?\n56-Celeste14.png\n: That came from downstairs! It must have been...\n4-Makoto2.png\n: Hifumi! He's in the nurse's office! This is bad! Come on, we have to go back!\n16-Flashback.png\n4-Makoto2.png\n: At that point, we decided to split up into two groups.\nCeleste, Hina and I\nwent back to the nurse's office. Meanwhile\nyou, Byakuya, and Toko\npursued the suspect up on the 3rd floor. And when we got back to the nurse's office...\n50-FlashT.png\n52-FlashB.png\n4-Makoto2.png\n: ...we found Hifumi's corpse. Which is also when we heard the\nbody discovery announcement\nplay. I left Celeste and Hina alone and headed back to the 3rd floor to tell the others what had happened.\n50-FlashT.png\n52-FlashB.png\n21-Sakura.png\n: But at that same time, we had discovered Taka's body in the\nequipment room\n. Which means Hifumi and Taka's bodies were discovered\nright around the same time\n. Because I remember hearing the body discovery announcement play right after finding Taka.\n4-Makoto2.png\n: And that's when I showed up and told you and Byakuya that Hifumi had been killed, right? Then\nyou, me, and Byakuya\nall headed back to the nurse's office leaving behind Toko, who had fainted. But as soon as we left the physics lab we ran into Celeste, who'd just arrived to tell us something very unusual.\n50-FlashT.png\n52-FlashB.png\n56-Celeste14.png\n: Hifumi's body has disappeared!\n4-Makoto2.png\n: We hurried back to the nurse's office, to discover that his corpse was, in fact, gone.\n10-Sakura3.png\n: Then we remembered we had abandoned the unconscious Toko, and rushed back to the\nequipment room\n.\n16-Flashback.png\n32-Byakuya12.png\n: This can't be happening...\n68-Sakura5.png\n: Are we hallucinating all this or something?\n16-Flashback.png\n4-Makoto2.png\n: This time, Taka's body had disappeared. So from there, we began our search for both of the missing bodies. And after some time...\n10-Sakura3.png\n: Celeste told us she'd found the bodies, and we all headed to the\nrepository\n.\n50-FlashT.png\n52-FlashB.png\n4-Makoto2.png\n: And there we rediscovered the two bodies that had apparently vanished.\n4-Makoto2.png\n: And that brings us up to now.\n9-Sakura4.png\n: Looking back, things have certainly been very active... If you want to look back at the case again, just let me know. I'm fine anytime.\n46-Narration.png\n: We'll begin the investigation in earnest next time. Sorry if the flashback bars got confusing, there are just so many flashbacks that occur during this scene that it was unavoidable.\n2-BOX15.png\n3-Narration.png\n: Now that we've gotten the case review out of the way, let's really start looking for clues to the murders.\nThere are hammers of all different sizes hanging on the wall. Although some are more like mallets... Mallets...? Could the Justice Hammers have been designed...using these as a model? Either way, all the hammers here have obviously seen a lot of use. They're all covered in debris and chalky stone powder...\n5-Makoto2.png\n: Wait...\nFor some reason...this one hammer isn't dirty at all. And it's...wet. Did someone\nwash\nit recently...?\nTaka... He'll never move again... According to the Monokuma File, Taka died from\na blow to the head\n. We found\nJustice Hammer 4\nnear his body in the equipment room. Is that what was used to kill him...? And there's a tarp laid out under his body... Did the killer use this to move Taka's body? That way, there wouldn't be any blood left behind while the body was moved...\nHifumi's big, cold body is laying on the floor... His... *really* big body. I mean, how on Earth was the killer able to move someone so big? From\nthe nurse's office\nwhere he was discovered to here, the\nrepository\n... All the way from the 1st floor to the 3rd... And all without anyone noticing it. How the hell...?\n5-Makoto2.png\n: ...\nIt's no good. I just don't get it. I can think about it later. For now, I have to finish investigating Hifumi himself.\nIf I remember correctly, Hifumi's fatal injury was also a blow to the head. Probably from Justice Hammer 3, which was laying on the floor in the nurse's office...\n5-Makoto2.png\n: Huh? Wait...\nSomething's...off about his body. Why am I getting this feeling...? Something's...different. Something about Hifumi's body in the nurse's office, versus his body right now...\n14-FlashT.png\n16-FlashB.png\n...That's it! His glasses! When his body was in the nurse's office, his glasses were covered with blood. But now...they're completely clean. Does that mean...someone wiped his glasses off? But who would do that? And why?\nIt's a dolly. It doesn't have a handle... I saw this in the art room before. I guess it's used to move statues around. It's kinda awkward, but if you bend down, it's not too hard to use. Huh? But wait...\n14-FlashT.png\n16-FlashB.png\nWasn't this in the\nequipment room\nwhen we found Taka's body?\nAnd look at the wheel... There's a bloodstain on it. So there's\nblood\non the wheel of the dolly that was moved from the\nequipment room\nto the\nrepository\n... What's the explanation for that...?\n3-Narration.png\n: Let's see what Byakuya has to say about the murders. He was sounding pretty disappointed earlier.\n5-Makoto2.png\n: Byakuya... Do you think Hiro really did it?\n25-Byakuya.png\n: I don't see how anyone could think otherwise. When the attacks and murders and disappearances all happened, every one of us had an alibi. And the last thing Hifumi said when he died...\n5-Makoto2.png\n: Yeah...he said\nHiro's\nname.\n25-Byakuya.png\n: Then there is no room to suspect anyone else.\n5-Makoto2.png\n: Okay, but if he did do it... Why would he hide his identity with\nthat weird costume\n?\n27-Byakuya15.png\n: Maybe he thought that no matter what happened, he'd be safe as long as his face was covered. Because he's the fool of the century, you see.\nI mean, he *is* kinda dumb... But do you really think that's enough to explain it? I feel like there's a clue hiding in there somewhere...\n28-Byakuya2.png\n: And is that it? That's all that bothers you about the case?\n5-Makoto2.png\n: Well, no... There are a few other things. Like, why did the killer try to hide the bodies?\n30-Byakuya3.png\n: They probably figured that if we couldn't find the bodies, we couldn't complete out investigation.\n5-Makoto2.png\n: But if that's the case, we found the bodies pretty easily, didn't we?\n25-Byakuya.png\n: Again, it comes back to the fact that the culprit was a moron.\n5-Makoto2.png\n: Is that really all there is to it...?\n25-Byakuya.png\n: ...\n5-Makoto2.png\n: The other thing that bothers me is...why'd they bother killing\ntwo people\n?\n32-Byakuya12.png\n: ...What?\n5-Makoto2.png\n: Because all the rule says is,\nif you can kill someone and get away with it\n, you graduate. Right? So if you're the killer, your number one priority is not getting caught. But killing two people means more clues, more chances you'll get found out.\n33-Byakuya10.png\n: Hold on. Perhaps... I see... So that's what that means.\n5-Makoto2.png\n: I-Is everything okay...?\n34-Byakuya9.png\n: ...\n36-Byakuya7.png\n: Don't talk to me as if we're friends.\n5-Makoto2.png\n: Huh? What's with the attitude?\n30-Byakuya3.png\n: But...you have my appreciation.\n37-Byakuya14.png\n: Thanks to you, I might have some fun with this after all. *leaves*\nHis mysterious words hung in the air as he left the repository.\n5-Makoto2.png\n: He talked as if...he'd figured something out. But if he did, would it have killed him to tell me what it was?\n3-Narration.png\n: Let's check in with Hina. She was pretty shaken up by all of this.\n41-Hina9.png\n: Hey, um...Makoto? I've been thinking about something. It's about the repository...\n5-Makoto2.png\n: Huh? What is it?\n42-Hina20.png\n: After Hifumi and Taka's bodies disappeared, we split up to look around, right? I was really scared, so me and Sakura stuck together. And we came right to the repository to, y'know, look around.\n43-Hina2.png\n: But when we got here,\nthe repository was locked\n. We couldn't get inside...\n5-Makoto2.png\n: It was locked...?\n42-Hina20.png\n: And we came here as soon as the search started, so there's no way someone coulda beat us here... So if that's true, then...who locked it? And why is it unlocked now?\n5-Makoto2.png\n: I wonder the same thing...\nThe door was locked when the search for the bodies began, but now it's wide open... There might be some secret lurking in there... But I'll probably have to leave this area to figure it out...\n3-Narration.png\n: We've examined everything and talked with everyone in here so we can now examine the repository door before leaving the area.\nThere's only one way in and out of this room... Through the door that Hina said was locked before. There's definitely a lock on the door, but it can only be locked from inside the repository.\nI don't see any way to lock it from in the art room...\n5-Makoto2.png\n: Hmm...\nThe door can only be locked from inside the repository. Which makes me wonder... Hina and Sakura confirmed that the door was locked after we started looking for the missing bodies. And the door is designed so that it can only be locked from inside the repository. In other words... When Hina checked it, someone had already gone in the repository and locked the door. When they were done, they unlocked it and left. Which is why it's unlocked now... But Hina claims that there's no way someone could have beaten them to the repository... So that certain someone...\n5-Makoto2.png\n: Hmm... There's gotta be a clue around here somewhere.\nMaybe I should check somewhere else. There are some places I already know about... First the\nnurse's office\n, where Hifumi was found. Then the\nequipment room\n, where Taka was found...\n3-Narration.png\n: First stop, the equipment room since it's on the same floor as us.\nJustice Hammer 4... The weapon that was used to kill Taka... The body was moved, but the murder weapon was just left here...\nThere's some kind of tire mark going through the pool of blood in the middle of the room. That reminds me... About the dolly in the repository...\nThere was blood on its tire...! Could that blood have come from...here?\n5-Makoto2.png\n: Which could mean that Taka's body was moved from the equipment room to the repository using the dolly...\nBoth rooms are on the 3rd floor, so that should definitely have been possible.\nBut even if the dolly *was* used to move Taka's body...what about Hifumi? Hifumi's body was in the nurse's office on the 1st floor. Even with a dolly, there's no way to get it up to the 3rd floor...\n5-Makoto2.png\n: That's still a total mystery...\nHuh? This tarp... I feel like I've seen it somewhere before. And just recently, too...\n3-Narration.png\n: No Truth Bullet here, but we did get a whopping one (1) Monocoin!\n61-Jill.png\n: I was sleeping right here when the killer carried the body away!\n62-Jill5.png\n: I'm super pissed I missed such an ultimately rare event!\n3-Narration.png\n: Nothing more to see in the equipment room. Let's examine the nurse's office.\n5-Makoto2.png\n: What are you investigating, Celeste?\n65-Celeste.png\n: I am not investigating anything, precisely speaking. I am simply going around, seeing if Hiro might be hiding somewhere. What about you?\n5-Makoto2.png\n: Oh, you know...I'm just checking this and that... The main thing on my mind is how someone could have moved Hifumi's body.\n67-Celeste8.png\n: How Hifumi was moved, eh?\n5-Makoto2.png\n: When it disappeared, you were supposed to be in the nurse's office, right?\n68-Celeste5.png\n: Correct. Hina was not feeling well, so I stayed behind to look after her. But she seemed to be getting worse, so I took her to the bathroom.\n5-Makoto2.png\n: And when you got back, the body was gone?\n70-Celeste2.png\n: We could not have been gone for more than a minute or two, though.\nYeah, Hina said the same thing.\n5-Makoto2.png\n: So then, the killer was able to get in and move Hifumi's body in that short amount of time?\n71-Celeste7.png\n: It would seem so...\nTo carry off someone as big as Hifumi in only a couple of minutes is... I can't think of it as anything less than impossible.\nIt's just a normal trash can. Huh? Wait...there's something inside.\nIt's too small to be a handkerchief. It's...a\nglasses cleaning cloth\n. And it's got some kind of cartoon character on it... Augh, but it's also covered in blood...!\n71-Celeste7.png\n: Ah, did you find something?\n5-Makoto2.png\n: Yeah. There was a cleaning cloth in the trash can.\n77-Celeste6.png\n: A cleaning cloth...?\n5-Makoto2.png\n: And it's all bloody... Whoever this belonged to must have used it to wipe up some blood. But who would need to do something like that...?\n78-Celeste15.png\n: I haven't the slightest idea.\nYeah, me either. But I think it might be important...\nJustice Hammer 3\n... The one that was used to kill Hifumi... Someone moved the body, but left the weapon behind...\nA refrigerator... I wonder if there's anything to drink inside. After everything I've been through, I'm totally parched. Maybe just a quick peek...\n5-Makoto2.png\n: ...\nThere's a bunch of blood packets in here. For blood transfusions, I guess... It doesn't help me, though. I'm not a vampire...\n3-Narration.png\n: That's everything we can check in here for now. Time to head elsewhere.\n28-Byakuya2.png\n: So this is where you were. I've been looking for you.\n5-Makoto2.png\n: You have...?\n25-Byakuya.png\n: I wanted to thank you for what you did. Not that you meant to, but you ended up making this little game of ours very interesting indeed.\n5-Makoto2.png\n: U-Umm...\n28-Byakuya2.png\n: You should go to Hiro's room. Oh, and let me give you this.\n\"Meet in the dining hall!\"\n5-Makoto2.png\n: This is the note Hiro wrote to get us all to meet up, right?\n30-Byakuya3.png\n: You remember well.\n5-Makoto2.png\n: Well, the penmanship was pretty remarkable, so it left an impression...\n36-Byakuya7.png\n: Anyway, this makes it clear, right? This is a trap.\n5-Makoto2.png\n: What is...?\n30-Byakuya3.png\n: Hmhm. Things grow ever more exciting.\n5-Makoto2.png\n: Um...what are you talking about?\n30-Byakuya3.png\n: I've already repaid my debt. I don't owe you any more explanation. Goodbye... *leaves*\nUm...so he said to go to Hiro's room, but...what's waiting for me there?\nThe door is...unlocked!? I guess...I can go inside. Byakuya did say to go look. It might not be a great idea, but I'm gonna take the plunge...\nThis is Hiro's room. There's all kinds of weird stuff in here... Where'd he even get it all from? More importantly, he still hasn't turned up... Which means he can't really complain if I don't get his permission to search his room, right?\n3-Narration.png\n: The only thing to check in here is this stack of boxes.\nI think there's something in the cardboard box...\nIt's...blueprints for something. And...\nSome things made out of... It looks like cardboard, plastic, and...plaster?\n5-Makoto2.png\n: Is this...Robo Justice? And it's in Hiro's room...!\nBut wait... These blueprints...\nSomething about them bothers me... Hmm...\n99-Hina22.png\n: Makoto! Big news! BIG NEWS!\n5-Makoto2.png\n: ...What's wrong?\n100-Hina15.png\n: We found\nKyoko\n!\n5-Makoto2.png\n: What!? I-Is she okay? Where is she!?\n♪\nMusic fades out.\n♪\n101-Hina16.png\n: Wait, I wasn't done. There's more big news!\n103-DISTRUST.png\n100-Hina15.png\n: Robo Justice showed up, too!\n5-Makoto2.png\n: Robo Justice!?\n43-Hina2.png\n: It's\nHiro\nwearing the costume!\n99-Hina22.png\n: Anyway! As soon as you can, head to the pool, on the 2nd floor! *leaves*\nTo think Hiro and Kyoko would turn up at the same time...\n5-Makoto2.png\n: Anyway, I have to head to the pool!\nI ran off to the 2nd floor as fast as I could.\n3-Kyoko2.png\n: ...\n4-Makoto2.png\n: Kyoko! And...!\n6-MrMonokumaAfterClass.png\n7-Hiro17.png\n: Phew! Man, I have have had the WORST day!\n4-Makoto2.png\n: ... Hiro...?\n3-Kyoko2.png\n: I found Hiro. He was jammed into the pool room locker. It looked like he was fast asleep, so I kicked him and woke him up.\n7-Hiro17.png\n: I still can't believe you kicked me! You coulda been a little more gentle about it. Like, I dunno, caress my face or somethin'!\n9-Kyoko7.png\n: ...That's creepy.\n4-Makoto2.png\n: Anyway... Kyoko, where have you been all this time? You just disappeared all of a sudden, without a trace...\n3-Kyoko2.png\n: There was something I had to check up on.\n4-Makoto2.png\n: What do you mean...?\n3-Kyoko2.png\n: Never mind.\n4-Makoto2.png\n: I *can't* never mind...!\n11-Kyoko14.png\n: Never. Mind. More importantly...\nShe says that, but...does she have any idea? Does she know people think she might be spying for the mastermind?\n12-Kyoko12.png\n: First of all...Hiro, you need to explain to us why you're dressed like that.\n7-Hiro17.png\n: Oh, uh, well...I mean... I have no idea. One second I was asleep, don't even know how that happened, then I woke up, and then I was here...\n13-Byakuya2.png\n: I don't care. Do something about that costume. It pains me just to look at you.\n7-Hiro17.png\n: Well, um... I dunno what's up with this thing, but I can't actually get it off...! A little help?\n14-Celeste9.png\n: Why would you make something that you can't take off by yourself?\n7-Hiro17.png\n: I didn't make the stupid friggin' thing!\n15-Kyoko.png\n: There's a clasp on the back that's keeping you from getting it off.\n15-Kyoko.png\n: It looks pretty sturdy. I don't think you can get it off on your own. We don't really have a choice. Let's help him.\nit took everyone's help, but slowly we were able to get Hiro out of the suit. It took a few minutes, but eventually we got all the pieces off.\n18-BOX15.png\n19-Hiro3.png\n: Whew! Free at last!\n20-Hina20.png\n: Isn't it kinda weird how perfectly the suit fits Hiro...?\n21-Celeste2.png\n: More to the point, nobody but Hiro would be able to wear that costume.\n22-Hiro5.png\n: Wait, what? H-Hold on a sec!\n23-Celeste7.png\n: Don't bother trying to act innocent. The blueprints were in your room, as well.\n24-Celeste16.png\n: In other words, it is obvious to everyone that you made this costume.\n26-Byakuya.png\n: That's true. I saw the blueprints myself.\n4-Makoto2.png\n: Yeah...me too...\n27-Hina12.png\n: Then it's obvious... The one who put this costume on and went around attacking everyone was Hiro!\n14-Celeste9.png\n: Shall we tie him up and gag him?\n28-Hina16.png\n: Good idea! We wouldn't want him killing anyone else...\n30-Hiro8.png\n: T-Tie me up!?\n4-Makoto2.png\n: H-Hold on, guys. I think that's going a little far...\n31-Kyoko3.png\n: He may be a suspect, but he deserves fair treatment.\n22-Hiro5.png\n: Yeah! I mean...attacking? Blueprints? I have no idea what you guys are talking about!\n28-Hina16.png\n: You can't talk your way out of this. It's been decided... You killed them!\n33-Hiro10.png\n: What? Killed who!? I have no idea what you're talking about! There must be a fake Hiro running around!\n34-Hina15.png\n: You're the only one who can wear this costume. So who else could possibly be the costumed attacker!?\n35-Hiro16.png\n: How do you know I'm the only one!? Maybe you should try it on yourself before you convict me!\n36-Hina22.png\n: Fine! If you're gonna be a jerk about it, I will!\nWithout missing a beat, Hina started putting on the Robo Justice costume.\n38-TryingontheCostume.png\n39-Hina27.png\n: Ahh! See, look! See how loose it is? I mean, come on... I'm blind as a bat in here! Can't see my feet at all. I'm surprised you got anywhere in this thing!\n40-Hiro19.png\n: I'm telling you, it wasn't me!\n39-Hina27.png\n: And not to mention--! You totally can't bend at the waist! Seems like a pretty obvious oversight...\n40-Hiro19.png\n: That's not a very nice thing to say!\n41-Celeste18.png\n: ...Hmm?\n40-Hiro19.png\n: Er, I mean--it's not like I made it! I just got caught up in the moment...\n39-Hina27.png\n: Well, either way...now we know for sure, right? I mean, it seems pretty clear that nobody but Hiro coulda fit into this dumb costume!\nIn a huff, Hina took the suit back off again.\n18-BOX15.png\n43-Hina23.png\n: Well? Now you're all out of excuses.\n22-Hiro5.png\n: N-No, see...it's cuz you're a girl! If it was another guy, then...\n44-Byakuya7.png\n: Makoto, go ahead.\n4-Makoto2.png\n: O-Okay...\nAgainst my will, I picked up the pieces off the floor and tried putting them on.\n4-Makoto2.png\n: It's no good... The arms are too long. There's no way I can wear this...\n36-Hina22.png\n: See!? I told you it was impossible!\n46-Celeste.png\n: You are absolutely right. It seems this costume was made to fit Hiro's body exactly.\n22-Hiro5.png\n: Th-Then...there's another costume! They must have one that looks the same, but...but fits them!\n47-Celeste15.png\n: If you insist on this line of defense, then show us some evidence.\n22-Hiro5.png\n: Evidence...?\n14-Celeste9.png\n: You claim there is another suit, yes? Then you must find it and show it to us.\n49-Hiro6.png\n: Wh-What the heck!?\n28-Hina16.png\n: Who cares!? Hiro's the only one without an alibi during this whole thing anyway! Which is how we know it was him!\n50-Hiro9.png\n: I mean...is that really true? I have no idea what's been happening... Could someone, like...tell me?\n22-Hiro5.png\n: U-Umm...if you don't tell me what's going on, how am I supposed to understand? I think I've figured out that...someone's been killed, right? Hey, Makoto...who was it?\n4-Makoto2.png\n: W-Well... Two people were killed. Taka and Hifumi...\n30-Hiro8.png\n: What!? TWO people!?\n28-Hina16.png\n: Why are you freaking out? You did it.\n33-Hiro10.png\n: I did not!\n54-Hiro12.png\n: Wait, hold on... If those two are the ones that were killed...\n55-Hiro15.png\n: That's it! I know who did it!\n15-Kyoko.png\n: You may as well tell us, then.\n56-Hiro2.png\n: Taka and Hifumi were fighting over Alter Ego, right?\n55-Hiro15.png\n: Which means! Alter Ego and/or Chihiro must have done it!\n57-Narration.png\n: I love Hiro's accusation right there because the voice clip that plays during it says \"I'm at least 30% right!\" Oh, Hiro...\n3-Kyoko2.png\n: I see... That's unfortunate.\n30-Hiro8.png\n: Huh? Unfortunate...?\n28-Hina16.png\n: Stop trying to trick us! Just admit that you did it, okay!?\n22-Hiro5.png\n: I-I'm telling you, you got it all wrong!\n59-Hiro7.png\n: Ah, I know! That note!\n4-Makoto2.png\n: Note...?\n22-Hiro5.png\n: Last night, someone slipped a\nweird note\nunder my door. And here's what it said... \"I found a hole maybe we can use to escape. Monokuma can't find out, so don't tell anyone else for now. Let's meet in the\nrec room at 1 a.m.\n\"\n60-Hiro13.png\n: But the last thing I remember is going to the rec room, then for some reason I fell asleep... The real killer probably drugged me or something!\n28-Hina16.png\n: ...Not a chance.\n61-Kyoko11.png\n: No, hold on. He could be onto something. The nurse's office did have chemicals that could do that...\n62-Hina9.png\n: Wh...Really?\n60-Hiro13.png\n: I told you. Someone's trying to set me up... A secret passage--a chance to escape... Someone wrote all that to trick me!\n43-Hina23.png\n: Even if that's true, you must be one dumb fish to bit every piece of bait that floats in front of you.\n22-Hiro5.png\n: Well after being trapped here so long, even if you know it's a lie, you gotta check, right?\n33-Hiro10.png\n: Gyaho! They preyed on my desire to get out of here! They deceived me!\n43-Hina23.png\n: I still don't buy it...\n35-Hiro16.png\n: Well you SHOULD buy it!\n28-Hina16.png\n: Okay...then show us that note!\n56-Hiro2.png\n: With pleasure! I have it right here in my..um, pocket... ...\n65-Hiro4.png\n: Looks like I lost it...\n43-Hina23.png\n: Yeah, sure...\n33-Hiro10.png\n: P-P-Please, ya gotta believe me! I wouldn't hurt a fly!\n66-Celeste4.png\n: As I said before, if you want us to believe you, you must produce evidence. Can you show us the note? I have no particular issue with what you claim, but if you want us to believe you, give us a reason.\n49-Hiro6.png\n: Wh-What the heck!? For serious!\n26-Byakuya.png\n: Now then, shall we resume our investigation? There's no time to waste before the class trial begins.\n28-Hina16.png\n: Why do we need to keep investigating? We already know who did it...\n69-Hina17.png\n: Why...? Why did you kill them? Tell us, Hiro...!\n49-Hiro6.png\n: No... It's like I said...!\n69-Hina17.png\n: Was it really to get the money Monokuma offered us? Yeah, that must be it... You must be totally broke and that's why...!\n33-Hiro10.png\n: W-Wait! That's a false accusation! Someone, help me!\n34-Hina15.png\n: Just be thankful we haven't bound and gagged you!\n71-Byakuya3.png\n: If you have time to yell and carry on, you have time to search for your evidence. Right?\n59-Hiro7.png\n: Ah! You're right! I need to look for the second suit and that note! Feet don't fail me now! *leaves, running*\n73-Hina2.png\n: I guess I'd better get back to guard duty... I was gonna ask Toko--er, Genocide Jack to switch with me... But if she and Sakura got into a fight, we'd have a catastrophe on our hands. Well, bye... *leaves*\nOne by one, everyone peeled away.\n15-Kyoko.png\n: Makoto, do you have a second?\n4-Makoto2.png\n: Huh?\n15-Kyoko.png\n: I want you to help me with the investigation.\n61-Kyoko11.png\n: It looks like I got a late start on this one, so I need to make up some ground.\n4-Makoto2.png\n: ...Sure, I don't mind helping. But can you promise me something? Later, when we have time...will you tell me\nwhy you disappeared\n?\n76-Kyoko13.png\n: No.\nTo reject me so simply...\n15-Kyoko.png\n: Anyway, I need your help. You don't mind, do you?\n4-Makoto2.png\n: ...O-Okay.\n78-Kyoko19.png\n: Thanks. Now then, shall we...?\n2-BOX15.png\n3-Kyoko2.png\n: So, Makoto...first I'd like to examine the corpses.\n\"Examine the corpses\"... I can't believe I'm hearing that from a girl the same age as me...\n4-Kyoko17.png\n: Dead bodies don't lie, you know. They tell the truth far more easily than the living. Wouldn't you agree?\n5-Makoto2.png\n: How am I supposed to answer...?\n3-Kyoko2.png\n: Anyway, we have to hurry. Before the class trial begins again...\n5-Makoto2.png\n: Y-Yeah, you're right...\n3-Kyoko2.png\n: Okay then, show me where the bodies are.\nThey're in...the repository. Then I guess we should head that way for now...\n9-Kyoko7.png\n: Hifumi...and Taka...\nFor a moment, Kyoko seemed to go rigid. But *only* for a moment...\n4-Kyoko17.png\n: Well then, let's get started.\nShe crouched down next to Taka and without hesitation began poking and prodding the bodies.\n10-Kyoko11.png\n: The Monokuma File was right. They were killed using similar weapons.\nHer movements were so smooth--she was so...calm. Seeing how comfortable she was actually made *me* feel a little more comfortable...\n12-Kyoko12.png\n: Makoto. I found something.\n5-Makoto2.png\n: You did...?\n12-Kyoko12.png\n: You remember the\nwristwatch\nTaka always wore on his left hand?\n5-Makoto2.png\n: He did...?\n13-Kyoko3.png\n: Are you so oblivious to the people around you? Do you dislike other people that much?\n5-Makoto2.png\n: N-No, that's not it... Anyway, so you said he had a watch?\n15-Kyoko.png\n: Take a look... It's broken. You can see the hands aren't moving, right? It most likely broke when he had his encounter with his assailant. And if you notice, the hands are frozen at\njust past 6 o'clock\n.\n5-Makoto2.png\n: So that would mean...the watch was broken\nsometime just after 6\n?\n10-Kyoko11.png\n: But last night, Taka's watch definitely wasn't broken...\n16-Flashback.png\n18-Kiyondo3.png\n: Hey! You! How long were you gonna keep us waiting!?\nTaka's irritated voice pierced the air as he stared pointedly at his wristwatch.\n18-Kiyondo3.png\n: It's almost 10 o'clock, you know that!? Bedtime for all the little boys and girls!\n16-Flashback.png\n10-Kyoko11.png\n: So if it worked at 10 last night, it couldn't have been broken at 6 p.m. Meaning it must have happened at\n6 this morning\n.\n10-Kyoko11.png\n: And that's not all. Look at Taka's left hand. He appears to be gripping something...\n5-Makoto2.png\n: You're right! There's something...white in there.\n15-Kyoko.png\n: Can you try and pry it out?\n5-Makoto2.png\n: Me!?\n4-Kyoko17.png\n: Rigor mortis has already set in. Boys are better suited to this kind of manual labor, right?\n5-Makoto2.png\n: O-Okay...\nAs much as I didn't want to, I grasped Taka's cold hand... The ice-cold hand was nearly enough to cause my heart to stop beating... After some effort, I was finally able to free the\nobject\nfrom his tightly clenched fist.\n5-Makoto2.png\n: A...piece of paper?\n12-Kyoko12.png\n: Was that all he had in his hand?\n5-Makoto2.png\n: Yeah, that's it... Just a little scrap of paper. Doesn't seem like much of a clue, does it?\n10-Kyoko11.png\n: I wonder about that...\nKyoko then turned to Hifumi's body.\n15-Kyoko.png\n: Let's check Hifumi's body now. Perhaps he's left us a few clues of his own.\n5-Makoto2.png\n: So? Did you find anything?\n10-Kyoko11.png\n: I did. More than I expected, to be honest. Look at this...\n5-Makoto2.png\n: A...wad of paper?\n15-Kyoko.png\n: Hifumi had it hidden on him.\n5-Makoto2.png\n: Hidden...?\n4-Kyoko17.png\n: He'd stuffed it in his pants. So I can only assume he'd hidden it on purpose, you see?\n5-Makoto2.png\n: In his pants...? Wait, so you--!?\n3-Kyoko2.png\n: It was just his pants. Not like his socks or something...\nI don't...know what that means...\n10-Kyoko11.png\n: Anyway,, let's take a look at the paper. Go ahead, Makoto. Open it up.\nWhen I think of how it was stuffed down his pants, it's like...it better be important, Hifumi, or I'll never forgive you for this!\n5-Makoto2.png\n: ...A note!?\n\"I found a hole maybe we can use to escape. Monokuma can't find out, so don't tell anyone else for now. Let's meet in the equipment room at 6 a.m.\"\n12-Kyoko12.png\n: That sounds...very familiar.\n5-Makoto2.png\n: That's it! It's the same thing Hiro said! Then he was telling us the truth!\n10-Kyoko11.png\n: Although...it's not exactly the same, is it?\n29-FlashT.png\n31-FlashB.png\n32-Hiro5.png\n: Last night, someone slipped a\nweird note\nunder my door. And here's what it said... \"I found a hole maybe we can use to escape. Monokuma can't find out, so don't tell anyone else for now. Let's meet in the\nrec room at 1 a.m.\n\"\n5-Makoto2.png\n: The time is different... Hiro told us that his note said to meet at\n1 a.m.\nBut the note they wrote to Hifumi asked him to meet at\n6 a.m.\n4-Kyoko17.png\n: Hold on. Just because Hifumi had the note, doesn't mean it was meant for him.\n5-Makoto2.png\n: Huh...?\n10-Kyoko11.png\n: Part of it has been torn off, right? I think there's likely some meaning there.\nThere's some meaning to part of it being ripped...?\n5-Makoto2.png\n: Umm...could you maybe explain it a little more?\n10-Kyoko11.png\n: Think carefully...\n35-Kyoko15.png\n: Why would he have been clutching that scrap of paper so tightly?\n5-Makoto2.png\n: I...I have no idea...\n10-Kyoko11.png\n: What if it *wasn't* just a scrap of paper when he was holding it? What if it was something more important? And how would something important like that become a mere scrap of paper? That's what you need to answer.\n15-Kyoko.png\n: And while we're at it, I should tell you one other thing. The two victims this time definitely had their e-Handbooks on them. So the handbooks have nothing to do with how the murders were carried out. Not that there was any reason to think they were connected to the killings in the first place...\n5-Makoto2.png\n: So you're saying I don't have to think about the handbooks this time, right?\n12-Kyoko12.png\n: If you didn't have to think about them at all, I wouldn't have gone out of my way to mention it. All I said was that they weren't used to help carry out the murders. There may come a point, however, where a handbook may play a role.\nA handbook may play a role...? I...don't think I understand. But if Kyoko thinks it's important, I'd better keep it in mind...\n40-Timeforthe3rdTrial.png\n*Ding dong, bing bong*\n43-MonokumaTV.png\n: Are you excited? Are you pumped!? It's time for the class trial to begin! Like the bright burst of fireworks, like the flash of a soul clashing with life and death...! And so, with no further ado...! Everyone please meet at the usual spot! Make your way to the red door on the first floor of the school! Puhuhu. See you soon!\n♪\nNo Music.\n♪\n4-Kyoko17.png\n: It's unfortunate, but I suppose this is where our investigation comes to an end. You'll have to figure out the rest for yourself, and come to the proper conclusion.\n5-Makoto2.png\n: Yeah...you're right...\n45-Kyoko19.png\n: Well, we'd better get going.\n5-Makoto2.png\n: O-Okay...\nEveryone had heard Monokuma's proclamation, and they were gathered by the red door. And as soon as we were all there...\n49-MrMonokumaAfterClass.png\n50-Monokuma.png\n50-Monokuma.png\n: Hello! (Hello...! Hello...)\n5-Makoto2.png\n: He's multiplied!?\n50-Monokuma.png\n50-Monokuma.png\n: Nope, not multiplication! It just looks that way cuz of an illuu~~usion! I'm moving so fast it only LOOKS like I've multiplied! Ke-heh-heh... Can you guys tell...which one is the real Monokuma!?\n4-Kyoko17.png\n: Can we just get on the elevator already?\n50-Monokuma.png\n50-Monokuma.png\n: You're not playing along! (Along...! Along...)\n51-Byakuya6.png\n: We're not here to play with you!\n50-Monokuma.png\n50-Monokuma.png\n: Okay, okay, fine!\n50-Monokuma.png\n: Then if everyone's here and ready to go, please board the pain train! Er...elevator. I'll see you guys down there! *leaves*\n54-DespairSyndrome2.png\n55-Byakuya14.png\n: Okay then, shall we?\n32-Hiro5.png\n: H-Hold on! I'm not mentally prepared yet...!\n56-Hina16.png\n: You'll NEVER be mentally prepared! You can't run away anymore, Hiro. You're gonna pay for your sins...\n57-Hiro16.png\n: I told you already, I didn't do it! For SERIOUS!\n59-Celeste9.png\n: That reminds me... Did you ever find the other costume? Or the note?\n60-Hiro13.png\n: Um, well...no, but--\n61-Celeste4.png\n: How unfortunate. Then it would seem we have our culprit.\n62-Hiro6.png\n: N...ngh!\n4-Kyoko17.png\n: This isn't the place to talk about it. Save your accusations for when we get to the courtroom.\n64-Byakuya.png\n: She's right. Let's get down there first. Then the story can really begin...\n5-Makoto2.png\n: Yeah, good idea.\nThat's right... I have to... I have to...do it... I can't let whoever killed Hifumi and Taka get away with it... For everyone who's still alive...and for the two that lost their lives.\n♪\nMusic cuts out.\n♪\n29-FlashT.png\n31-FlashB.png\n29-FlashT.png\n31-FlashB.png\n29-FlashT.png\n31-FlashB.png\nThe one who killed Hifumi and Taka... The one who killed two of our friends... The killer is...\n...someone right here!\nI took one last deep breath, and exhaled slowly. I began to walk toward the elevator. Once everyone was aboard...\nthe doors closed on their own. And the steel box began to move.\nThe clunking of the elevator kept us company as we fell further and further down... There was no going back... Until we settled all this, we couldn't go anywhere.\nI'm not sure how long it was before the elevator finally came to a stop. The elevator doors slid open...opening up onto a cruel fate.\n73-ToSurvive.png\n75-Monokuma4.png\n: Hmhmhm... When I see all of you gathered together like this...I realize just how few of you there are left! Your school life is slowly reaching its climax!\n56-Hina16.png\n: Only cuz of you!\n60-Hiro13.png\n: Why...? Why are you making us do such cruel things to each other!?\n76-Monokuma11.png\n: What what!? Do you really hate me so much? But I'm so cute!\n77-Byakuya4.png\n: Stop goofing around and begin the trial...!\n78-Monokuma2.png\n: Don't rush me! Of course I'm gonna start it! I would never be like, \"Stay tuned for the action-packed class trial after this commercial break!\"\n80-Monokuma5.png\n: I'd never hold out on you like that! ...Okay, let's begin! Get to your assigned seats!\nAnd so the curtain opened once again...\nA deadly judgment... A deadly deception... A deadly betrayal...\nA deadly riddle, a deadly defense, a deadly faith...\nA deadly...class trial...!\n83-UndergroundTrial.png\n84-Narration.png\n: Welcome back to the courtroom for Class Trial #3. The ticker on the bottom reads the following:\n\"And now they must confront *two* murders...! Who claimed the lives of Hifumi and Kiyotaka? In this class trial, suspicion builds upon suspicion!\"\n84-Narration.png\n: We have some new skills available to use. I explained a couple of them during the chapter but let's go over them in detail.\nEnvious Influence:\nIncreases the Influence Gauge by 5. Effective during the Class Trial. Costs 4 SP.\n-This skill came from Byakuya. It adds 5 hearts to your Influence Gauge, effectively doubling your health meter. There is a less powerful version of this skill that gives you only 2 hearts that cannot be combined with this skill. It's a very useful skill if you're playing through for the first time and you can find it because it gives you more room for error. I shouldn't ever be needing it because I know the answers at this point, but if the Bullet Time Battles get too crazy later on I might. I hope not though, there are a lot more useful skills to choose from.\nBreathing Technique:\nThe Focus Gauge recovers more quickly. Effective during the Nonstop Debate, the Hangman's Gambit, and the Bullet Time Battle. Costs 4 SP.\n-This skill came from Sakura. If you find yourself using the Focus Gauge often this skill might be helpful to you. It speeds up the recovery rate for the Focus Gauge. I haven't used the gauge much this run so I don't think I'll be needing it. On a side note, one of the most useful combinations that I don't think we're able to get at this point is to combine it with a skill that slowly restores your Influence Gauge while you are using your Focus Gauge. It's a great combination that I used a lot in the sequel to restore my health because the end of DR2 gets hard and apparently I'm bad at logic.\n../Smilies/emot-saddowns.gif\nHandiwork:\nAllows you to reload two bullets at once. Effective during the Bullet Time Battle. Costs 4 SP.\n-We got this skill from Hifumi. Reloading is a mechanic that will be introduced during this trial. Basically, during BTB from now on when I shoot an argument I will use bullets. I have to press Square in time with the beat to reload bullets. If I don't have bullets, I can't shoot the arguments. I'm not looking forward to this because as I mentioned before, my audio setup doesn't allow me to hear the game audio as I record the trial so I have to do BTBs purely on visual cues. I'm definitely going to use this skill because the less I have to worry about messing up a BTB, the better.\n84-Narration.png\n: So we got some interesting and costly skills this chapter. Unfortunately, I can't equip any of them if I want to keep using all of the skills I had set before. As such, I'm trading out\nCool and Composed\nfor\nHandiwork\n. I think I can deal with a slightly wobbly cursor in exchange for the double bullet reloading. I've kept [b]Algorithm, Upshift, Robot Jock and Melodious Voice on as well. This brings me to 13/13 SP used.\n84-Narration.png\n: Next up is the list of Truth Bullets we obtained in our investigation.\n89-Tutorial.png\n: ...same dolly that was in the equipment room, where Kiyotaka's body was originally discovered.\n89-Tutorial.png\n: ...when the body was rediscovered, it had somehow been unlocked...\n89-Tutorial.png\n: ...away...\n89-Tutorial.png\n: ...the rec room at 1 a.m.\"\n89-Tutorial.png\n: ...morning when he was attacked.\n89-Tutorial.png\n: ...the equipment room at 6 a.m.\"\n89-Tutorial.png\n: ...in carrying out the murders this time.\n84-Narration.png\n: And with that, see you next time for Trial 3.\n",
    "evidence_objects": [
        {
            "name": "Monokuma File #3",
            "description": "The victims were Hifumi Yamada and Kiyotaka Ishimaru. The cause of death for each was a blow to the head. It is thought that they were both killed with a similar weapon."
        },
        {
            "name": "Blue Tarp",
            "description": "The tarp was found in the repository, under Kiyotaka's lifeless body. It was apparently used to move Kiyotaka in order to avoid leaving any bloodstains."
        },
        {
            "name": "Repository Dolly",
            "description": "The dolly was found when the body was rediscovered in the repository. This specific dolly has no handles, and blood was found on one of its wheels. It is assumed that this is the same dolly that was in the equipment room, where Kiyotaka's body was originally discovered."
        },
        {
            "name": "Hifumi's Glasses",
            "description": "When they were first found in the nurse's office, Hifumi's glasses were covered in blood. However, when they were next seen in the repository, they were completely clean."
        },
        {
            "name": "Spotless Hammer",
            "description": "Hammers of all shapes and sizes were found in the repository. One of them was found wet, and had apparently been recently washed."
        },
        {
            "name": "Repository Door",
            "description": "The door connecting the art room to the repository was designed to open only from the repository side. According to Aoi, it was locked during the search for the missing body. However, when the body was rediscovered, it had somehow been unlocked..."
        },
        {
            "name": "Equipment Room Bloodstain",
            "description": "A puddle of blood was found in the equipment room where Kiyotaka's body was initially found. A tire track had been left behind in the blood."
        },
        {
            "name": "Glasses Cleaning Cloth",
            "description": "The cloth was found in the trash can in the nurse's office. It is branded with a popular cartoon character, and was found with blood on it. One has to wonder if someone used it to wipe some blood away..."
        },
        {
            "name": "Celeste's Account",
            "description": "Hifumi's body disappeared when Celeste and Aoi left the nurse's office to use the bathroom. Apparently they weren't gone for more than a minute or two."
        },
        {
            "name": "Yasuhiro's Message",
            "description": "This is the note that Yasuhiro wrote to get everyone to meet in the dining hall. \"Meet in the dining hall!\" is all it says. The handwriting is remarkably neat and clear."
        },
        {
            "name": "Robo Justice Blueprints",
            "description": "These are the blueprints for Robo Justice, which were found in Yasuhiro's room. [caption] The handwriting is careless and childlike."
        },
        {
            "name": "Robo Justice Costume",
            "description": "No one but Yasuhiro could have possibly fit into the costume. In addition, anyone wearing it would not be able to see their feet, or bend at the waist more than 90 degrees."
        },
        {
            "name": "Yasuhiro's Account",
            "description": "Apparently, Yasuhiro received a mysterious note last night. The note reads... \"I found a hole maybe we can use to escape. Monokuma can't find out, so don't tell anyone else for now. Let's meet in the rec room at 1 a.m.\""
        },
        {
            "name": "Broken Wristwatch",
            "description": "Kiyotaka's wristwatch broke with the hands pointing just past 6 o'clock. It was confirmed that as of late last night, the watch still worked, which means it must have broken the following morning when he was attacked."
        },
        {
            "name": "Kiyotaka's Scrap of Paper",
            "description": "Kiyotaka's lifeless hand was found clutching a small scrap of paper."
        },
        {
            "name": "The Note Hifumi Had",
            "description": "Hifumi had this note hidden on him. One edge of it appears to be torn. The note reads: \"I found a hole maybe we can use to escape. Monokuma can't find out, so don't tell anyone else for now. Let's meet in the equipment room at 6 a.m.\""
        },
        {
            "name": "e-Handbook",
            "description": "Each student has their own e-Handbook, which also acts as a cardkey. The owner's name is displayed each time the handbook is booted up. It is believed that no handbooks were involved in carrying out the murders this time."
        }
    ],
    "turns": [
        {
            "category": "cross_examination",
            "newContext": "3-ClassTrialDawn.png\n4-Monokuma.png\n: Let's begin with a basic explanation of the class trial! So, your votes will determine the results. If you can figure out \"whodunnit\" then only they will receive punishment. But if you pick the wrong one... Then I'll punish everyone *besides* the blackened, and the one that deceived everyone else will graduate!\n5-Monokuma11.png\n: Now then, to begin with...\n7-BoysLifeofDespair.png\n8-Hina16.png\n: We already know who did it!\n5-Monokuma11.png\n: Wuzzat...?\n9-Celeste2.png\n: It was\n**\nHiro\n. He does not have an alibi for when the murders took place, and we found him in that suit.\n10-Hina15.png\n: Don't try and deny it! You killed them!\n12-Hiro6.png\n: I didn't! Someone knocked me out! I was asleep the whole time! I don't know anything about it!\n13-Jill8.png\n: Shut your murdering mouth, murderer!\n14-Hiro16.png\n: Who are YOU calling a murderer!?\n9-Celeste2.png\n: I am sorry to say, Hiro, but we do have evidence...\n9-Celeste2.png\n:\n**\nBlueprints\nfor the suit...\n9-Celeste2.png\n:\n**\nParts\nwe assume were used to build it... And all of it was found\n**\nin your room\n. You have to admit, the evidence is quite compelling. It points to you as having created the suit and wearing it while committing crime after crime...\n17-Hiro5.png\n: How many times do I have to tell you!? I...I...!\n18-Hiro9.png\n: I don't know, I don't know, I don't KNOW!\nIs Hiro really the killer? Or... Before anything else, we have to make that clear!\n",
            "testimonies": [
                {
                    "testimony": "Everything we found in your room ... The blueprints , the suit parts, they are all proof enough that you are the culprit.",
                    "person": "Celeste",
                    "present": [
                        "Yasuhiro's Message"
                    ],
                    "source": {
                      "evidence_span": [
                        "The handwriting is remarkably neat and clear.",
                        "The handwriting is careless and childlike."
                      ],
                      "testimony_span": "The blueprints, the suit parts, they are all proof enough that you are the culprit.",
                      "is_self_contained": "yes",
                      "context_span": "",
                      "isMultimodal": true
                    }
                },
                {
                    "testimony": "I-I-I don't know anything about that stuff! It's not true! It's a conspiracy!",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "Hiro, why...? Why did you kill them?",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "No! Just hold on a second!",
                    "person": "Hiro",
                    "present": []
                }
            ],
            "summarizedContext": "Everyone is discussing why Hiro is the culprit, where the killer wore a robot suit.",
            "noPresent": false,
            "labels": [
              "physical"
            ],
            "reasoning": [
              "Fact 1: The witness claims the blueprints found in Hiro's room are proof that he is the culprit.",
              "Fact 2: The evidence suggests the handwriting on the blueprints is careless and childlike.",
              "Fact 3: The evidence suggests the handwriting on Yasuhiro's message is remarkably neat and clear.",
              "Prop 1: If the handwriting on an item differ from someone's handwriting, then that person is not the owner of the item.",
              "Prop 2: If an incriminating item does not belong to a person, then the person may not be the culprit."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "As we know, Taka was killed in the equipment room . And from there, the body was moved to the repository, correct?",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "Yeah, the culprit wrapped the body in the tarp ...then loaded it onto the dolly and wheeled it off, right?",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "Now, keep in mind that the dolly doesn't have a handle .",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "Well, yeah, but even without a handle all you'd have to do is bend over .",
                    "person": "Hina",
                    "present": [
                        "Robo Justice Costume"
                    ],
                    "source": {
                      "evidence_span": "anyone wearing it would not be able to see their feet, or bend at the waist more than 90 degrees",
                      "testimony_span": "all you'd have to do is bend over",
                      "is_self_contained": "no",
                      "context_span": "the culprit must be\nRobo Justice\n. Whoever's hiding in that costume is the one that killed Hifumi"
                    }
                },
                {
                    "testimony": "Then you could push the dolly no problem!",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "So the killer just crouched down and carted the body off to the repository !",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "If you accept everything we just said then you must realize that whoever was in the suit couldn't possibly be the culprit.",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "Uh...sorry, I don't think I realize anything...",
                    "person": "Hiro",
                    "present": []
                }
            ],
            "summarizedContext": "Everyone is discussing how the body was moved.",
            "noPresent": false,
            "labels": [
              "physical"
            ],
            "reasoning": [
              "Fact 1: The witness claims the killer would bend over to push the dolly.",
              "Fact 2: The evidence suggests anyone wearing the costume would not be able to bend over.",
              "Fact 3: The context suggests the killer was wearing the costume.",
              "Prop 1: If someone is wearing a costume that prevents them from bending over, then they cannot bend over."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "17-ClassTrialTHESUN.png\n18-Makoto25.png\n: You're absolutely right that you could push a dolly without a handle if you stoop down low.\n19-Makoto23.png\n: But if you were wearing\n**\nthat suit\n, do you think you could actually get into a position like that?\n20-Hina2.png\n: Wh-What do you mean...?\n21-Makoto28.png\n: Think back to what you said when we were all checking out the suit together. Remember?\n22-Flashback.png\n24-Hina27.png\n: Ahh! See, look! See how loose it is? I mean, come on... I'm blind as a bat in here! Can't see my feet at all. I'm surprised you got anywhere in this thing!\n25-Hiro19.png\n: I'm telling you, it wasn't me!\n24-Hina27.png\n: And not to mention--! You totally can't bend at the waist! Seems like a pretty obvious oversight...\n22-Flashback.png\n18-Makoto25.png\n: When you're in that suit, not only can you\n**\nnot see your feet\n, but you\n**\ncan't even bend\nat the waist.\n21-Makoto28.png\n: Am I right about that?\n27-Hina14.png\n: Now that you mention it...yeah...\n28-Sakura3.png\n: It seems like it'd be awfully hard to push that dolly if you couldn't bend over...\n29-Celeste7.png\n: Well, what's to stop you from simply pushing the dolly with your feet?\n18-Makoto25.png\n: When you can't even see your feet? You really think someone could kick the dolly all that way?\n30-Jill2.png\n: Yeah, it'd be totally impossible! Not that I can say for sure myself!\n6-Byakuya9.png\n: On top of that, if you were wearing such a rigid, cumbersome suit it's very unlikely you would have the dexterity to go about wrapping the body in a tarp.\n32-Jill10.png\n: Well I mean, isn't that just a matter of taking off the suit when you're ready to move the body?\nThere's absolutely no chance that the costume was taken off just to move the body. Because...\n> You can't take it off by yourself\n35-Makoto2.png\n: I don't think taking off the suit was an option. If you remember...\n22-Flashback.png\n37-Hiro17.png\n: I dunno what's up with this thing, but I can't actually get it off...! A little help?\n38-Celeste9.png\n: Why would you make something that you can't take off by yourself?\n37-Hiro17.png\n: I didn't make the stupid friggin' thing!\n39-Kyoko.png\n: There's a clasp on the back that's keeping you from getting it off. It looks pretty sturdy. I don't think you can get it off on your own. We don't really have a choice. Let's help him.\n22-Flashback.png\n41-Sakura5.png\n: That's true. It seems impossible to\n**\nput the suit on or take it off without help\n.\n20-Hina2.png\n: Then...you really can't take it off by yourself? Hiro wasn't just making it up?\n42-Hiro16.png\n: O-Of course I wasn't making it up!\n43-Makoto20.png\n: If he could have gotten it off by himself, I don't think he would have let us see him wearing it. Showing up in the suit was basically an invitation for everyone to suspect him.\n42-Hiro16.png\n: Y-Yeah, that's right!\n5-Hina20.png\n: So...it's really *really* true that Robo Justice couldn't have moved the dolly...?\n41-Sakura5.png\n: To be clear, whoever did move the body, it couldn't have been Hiro in the robot suit, correct?\n45-ClassTrialDawn.png\n46-Celeste2.png\n: No, wait, just a second if you please. Have you forgotten about the picture that I took?\n47-FlashT.png\n49-FlashB.png\n46-Celeste2.png\n: You all got a good look at it, did you not? The image of Hifumi being dragged away by Robo Justice? If whoever was in that suit is not the culprit, how do you explain that? Besides, so you remember what the now deceased Hifumi said...?\n22-Flashback.png\n51-Byakuya15.png\n: How did you get hurt?\n52-Hifumi16.png\n: That guy hit me...\n35-Makoto2.png\n: What guy?\n52-Hifumi16.png\n:\n**\nRobo Justice\n. Er, that's what I decided to call him, just now...\n22-Flashback.png\n54-Celeste4.png\n: So long as those faces exist, the proper conclusion is beyond question.\n55-Celeste16.png\n: The individual inside the suit and the culprit are one and the same. It was Hiro, without a doubt.\n8-Hina22.png\n: Yeah...! Yeah, that's gotta be right!\n56-Hiro10.png\n: H-Hold on a second!\n58-Kyoko14.png\n: It's still far too early to reach that conclusion. Besides, there's no hurry to decide who did it. Before we rush to a verdict, shouldn't we explore every single possibility? Instead of seizing on one viewpoint, the truth is uncovered by analyzing things from every angle.\n28-Sakura3.png\n: Perhaps, but where do we go from here?\n60-Kyoko11.png\n: Let's review this series of unfortunate events from the beginning. Maybe we'll uncover something new...\n61-Jill5.png\n: Pfhah! What a pain in the ass!\n62-Sakura4.png\n: I don't disagree, but our lives are on the lines. If this is what it takes, we have to do it.\n7-Hina.png\n: Plus, maybe we'll get to find out where the heck Kyoko was when everything went down...\n28-Sakura3.png\n: Alright then, let's take another look back at what happened. I suppose we could start with this morning...\n64-DISTRUST.png\n62-Sakura4.png\n: Four of us gathered together in the dining hall--Makoto, Hina, Kyoko, and myself. We waited there for quite a while, but nobody else showed up. So we went to look for everyone. That was around\n**\n8 a.m.\n20-Hina2.png\n: And as soon as we split up, Kyoko went missing.\n65-Sakura7.png\n: Soon after that, Hina found Celeste in the rec room, and quickly came to get Makoto and me.\n66-Celeste5.png\n: It seems I was unconscious for about an hour after I was attacked by my mystery assailant. I know it was an hour because I remember being attacked\n**\na little after 7\n.\n47-FlashT.png\n49-FlashB.png\n65-Sakura7.png\n: That was when we saw Celeste's picture and discovered that her assailant had been wearing a strange costume. As it turns out, it was Robo Justice... It also soon became clear that this same Robo Justice had abducted Hifumi.\n65-Sakura7.png\n: We were soon joined in our search by Byakuya and Toko, and then went on to find Hifumi in the library. He was injured, so we took him to the nurse's office and resumed our search for the suspect. But not long after leaving the nurse's office...\n22-Flashback.png\n70-Celeste14.png\n: ...!?\n51-Byakuya15.png\n: What's wrong...?\n70-Celeste14.png\n: I saw a shadow! Something moving around at the top of the stairs!\n22-Flashback.png\n72-Makoto24.png\n: When Celeste told us that, we decided to split up and search the 2nd floor. And soon after that...\n73-Celeste8.png\n: I saw someone moving around on the 3rd floor, and I yelled out to everyone as soon as I did.\n22-Flashback.png\n75-Hina15.png\n: Celeste! What's wrong!?\n76-Byakuya7.png\n: That was a rather...intense scream for someone like you.\n70-Celeste14.png\n: I saw him! The strange costumed man...! He ran off as soon as I screamed... I was blocking the stairs, so he headed\n**\nfurther down into the hallway\nand disappeared...!\n22-Flashback.png\n18-Makoto25.png\n: And then...\n22-Flashback.png\n???: Ungyaaaaaahhh!!!\n35-Makoto2.png\n: Huh!?\n79-Hina10.png\n: Wh-What was that!?\n70-Celeste14.png\n: That came from downstairs! It must have been...\n35-Makoto2.png\n: Hifumi! He's in the nurse's office! This is bad! Come on, we have to go back!\n22-Flashback.png\n18-Makoto25.png\n: At that point we decided to divide up into two groups. Celeste, Hina, and I went back to the nurse's office while Sakura, Byakuya, and Toko chased after the suspect.\n47-FlashT.png\n49-FlashB.png\n18-Makoto25.png\n: When we got back to the nurse's office, we found Hifumi...dead. And that's when we heard the body discovery announcement.\n72-Makoto24.png\n: I left Celeste and Hina there and headed back to the 3rd floor, to let the others know what had happened.\n47-FlashT.png\n49-FlashB.png\n62-Sakura4.png\n: Meanwhile, we had just discovered Taka's body, in the equipment room. We must have found both bodies at almost exactly the same time because we heard the same announcement not long after we'd discovered his body.\n72-Makoto24.png\n: And that's when I told you guys about Hifumi. Then the three of us headed for the nurse's office.\n85-Makoto26.png\n: But right after we left the physics lab we ran into Celeste, who'd arrived after us, and she told us something very surprising.\n47-FlashT.png\n49-FlashB.png\n70-Celeste14.png\n: Hifumi's body has disappeared!\n85-Makoto26.png\n: We rushed back to the nurse's office and saw that she was right.\n28-Sakura3.png\n: Then we remembered we'd left Toko passed out in the equipment room, so we hurried back again.\n22-Flashback.png\n89-Byakuya12.png\n: This can't be happening...\n41-Sakura5.png\n: Are we hallucinating all this or something?\n22-Flashback.png\n41-Sakura5.png\n: But when we got there, we discovered that now Taka's body had *also* gone missing. Next thing we knew, we were searching the school for two missing dead bodies. And after some time...\n47-FlashT.png\n49-FlashB.png\n6-Byakuya9.png\n: Celeste informed us that she'd found the bodies, and we all headed to the repository which is where we rediscovered the corpses.\n45-ClassTrialDawn.png\n35-Makoto2.png\n: I think that about covers it.\n93-Kyoko17.png\n: I see... The whole thing sounds exceptionally complicated.\n39-Kyoko.png\n: It certainly seems to me that these are not a simple series of connected events.\n43-Makoto20.png\n: Okay, well...if that's true, then what?\n95-Kyoko13.png\n: Rather than a single series of events, I think we have to consider each murder a\n**\nseparate situation\n. And from there, we can uncover the\n**\ncontradictions\nsurrounding all of them. Now then, let's get started, beginning with what happened to Taka...\nThe contradictions hidden in what happened to Taka... In order to uncover the truth of this case, I have to find them, no matter what!\n",
            "testimonies": [
                {
                    "testimony": "So, regarding Taka's death... I wonder if he died before Hifumi... Or perhaps it was after?",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "We already know what order they were killed in! Taka came last!",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "What makes you say that?",
                    "person": "Sakura",
                    "present": []
                },
                {
                    "testimony": "Because of the numbering of the Justice Hammers!",
                    "person": "Hina",
                    "present": [
                        "what order"
                    ]
                },
                {
                    "testimony": "It's true that hifumi was killed with Justice Hammer 3 while Taka's death came from a swing of Justice Hammer 4.",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "See? So it's obvious Taka came after!",
                    "person": "Hina",
                    "present": []
                }
            ],
            "noPresent": true
        },
        {
            "category": "cross_examination",
            "newContext": "2-HangmansGambit.png\n7-ClassTrialChaos.png\n8-Makoto23.png\n: I've got it!\n**\nTaka's wristwatch\n! See? Look. It broke with the hands pointing\n**\njust past 6 o'clock\n.\n9-Kyoko11.png\n: It must have gotten broken when he was attacked by the killer. Because as of last night...\n10-Flashback.png\n12-Kiyondo3.png\n: Hey! You! How long were you gonna keep us waiting!?\nTaka's irritated voice pierced the air as he stared pointedly at his wristwatch.\n12-Kiyondo3.png\n: It's almost 10 o'clock, you know that!? Bedtime for all the little boys and girls!\n10-Flashback.png\n9-Kyoko11.png\n: So if it wasn't broken after 6 last night, then he must have been attacked around\n**\n6 this morning\n.\n14-Makoto28.png\n: And that would be his official time of death.\n15-Sakura3.png\n: But if that's true, then he was killed well before Hifumi...\n16-Makoto20.png\n: And before Celeste was attacked this morning, which happened around 7.\n17-Kyoko13.png\n: That's right. Taka was killed\n**\nbefore\nany of the other incidents took place.\n16-Makoto20.png\n: That simple fact slipped past all of us. We made the\n**\nwrong assumption\nabout the order of events all because of those Justice Hammers.\n18-Byakuya3.png\n: That's exactly why the culprit wrote the numbers on each hammer, and had them increase in size. That way, when we saw how they were used in each incident, we'd easily make that wrong assumption.\n20-Kyoko.png\n: Now, if Taka *was* killed around 6, then\n**\neveryone's alibis\nfor his murder go out the window. Because when he was killed, we hadn't met up in the dining hall yet.\n21-Sakura4.png\n: That may be true in the case of Taka's murder, but\n**\nall of our alibis still hold true\nfor Hifumi's death.\n22-Hina20.png\n: That's right... With him at least, we're all safe...\n10-Flashback.png\n???: Ungyaaaaaahhh!!!\n24-Makoto2.png\n: Huh!?\n25-Hina10.png\n: Wh-What was that!?\n26-Celeste14.png\n: That came from downstairs! It must have been...\n24-Makoto2.png\n: Hifumi! He's in the nurse's office! This is bad! Come on, we have to go back!\n10-Flashback.png\n28-Hina9.png\n: When we heard Hifumi screaming, we were all together. Except for Hiro and Kyoko...\n29-FlashT.png\n31-FlashB.png\n28-Hina9.png\n: Then we all ran down to the nurse's office, and that's where we found his body...\n33-Jill2.png\n: That's totally true! We're all in the clear!\n34-Hiro15.png\n: Oh, I know! They must've recorded him screaming on a tape or something, then played it later on!\n22-Hina20.png\n: If that's true, where's the tape?\n35-Hiro2.png\n: I dunno.\n36-Hina16.png\n: Don't just go makin' stuff up!\n38-Sakura7.png\n: Anyway, we all have rock-solid alibis for when we heard Hifumi scream. Since all of us were there together, clearly none of us could have killed him.\n39-Celeste8.png\n:And it does not stop there. There was also the moment when we discovered the body had disappeared... When his body vanished from the nurse's office Hina and I were in the bathroom together, while everyone else was in the equipment room, correct?\n40-Celeste17.png\n: And then there's the disappearance of Taka's body from the equipment room... At that time, we were all gathered together in the nurse's office because of Hifumi going missing.\n33-Jill2.png\n: Well, don't forget, I was passed out in the equipment room the whole time!\n34-Hiro15.png\n: Wait, then what if Genocide Jill did it!? She could've dragged Taka's body out of there right then!\n42-Byakuya.png\n: Even if she could pull that off, there's no way she could have done the same with Hifumi's body. Because, as we just established, she was passed out in the equipment room when his body disappeared.\n43-Jill3.png\n: Besides, I didn't do either of 'em anyway!\n45-ClassTrialDawn.png\n46-Celeste2.png\n: In other words, it is impossible that any of us could have killed Hifumi, or moved either of their bodies. On the other hand,\n**\nHiro\nand\n**\nKyoko\nhad disappeared. So they most certainly could have done those things.\n16-Makoto20.png\n: Hmm... So what now, Kyoko?\n47-Kyoko2.png\n: For now, we can't get fixated on who did it, or we'll just keep going around in circles.\n9-Kyoko11.png\n: So instead of \"\n**\nwho\n\" I propose we start talking about \"\n**\nhow\n\"... In particular, I think we need to figure out how Hifumi's body got moved.\n48-Makoto26.png\n: That's true. We searched everywhere, but we couldn't figure out how to explain his body disappearing. And according to what Celeste said...\n10-Flashback.png\n46-Celeste2.png\n: We could not have been gone for more than a minute or two, though.\n24-Makoto2.png\n: So then, the killer was able to get in and move Hifumi's body in that short amount of time?\n46-Celeste2.png\n: It would seem so...\n10-Flashback.png\n48-Makoto26.png\n: His body apparently disappeared in the one minute her and Hina took their eyes off it. But to carry that much weight from the 1st floor up to the 3rd, in that short amount of time...\n51-Hiro5.png\n: ...Oh man, yeah! There's no way! It'd be impossible!\n♪\n**\nMusic fades out.\n♪\n52-Kyoko3.png\n: Well, what if I told you there was a\n**\nway\nto make the impossible possible?\n53-Hina11.png\n: What? How!?\n55-NewWorldOrder.png\n56-Kyoko14.png\n: If the dead body...were to move itself.\n57-Makoto33.png\n: Huh...?\n58-Hina12.png\n: Th-The dead body m-moved on its own!?\n59-Hiro9.png\n: N-N-N-No! Not another gh-gh-gh-ghooooossst!\n61-Byakuya5.png\n: I don't think it has anything to do with the occult. I think what she's implying is we thought Hifumi was dead, but perhaps in reality he was still alive.\n25-Hina10.png\n: He was...alive!?\n62-Sakura5.png\n: Are you saying Hifumi wasn't carried out of the nurse's office, but simply walked out on his own?\n28-Hina9.png\n: But I mean...we found his body! He was dead!\n18-Byakuya3.png\n: Perhaps he was simple *playing* dead.\n40-Celeste17.png\n: That... It isn't possible...!\nThe idea that Hifumi was still alive... Is it really possible?\n",
            "testimonies": [
                {
                    "testimony": "Are you saying that when we first found Hifumi in the nurse's office...there's a chance he was actually still alive ?",
                    "person": "Sakura",
                    "present": []
                },
                {
                    "testimony": "No...it is impossible. Hifumi was dead, without a doubt.",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "And you know that how?",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "Surely you heard the body discovery announcement along with the rest of us...",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "Hifumi's dead body had been found ...and that is why the announcement was made.",
                    "person": "Celeste",
                    "present": [
                        "someone else's discovery"
                    ]
                },
                {
                    "testimony": "Are we really so sure about that? Maybe the announcement was intended to signal someone else's discovery ...",
                    "person": "Kyoko",
                    "present": []
                }
            ],
            "noPresent": true
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "Well here's one thing we do know... The first time we found Hifumi's body was in the nurse's office. And then, while me and Celeste were in the bathroom his body disappeared !",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "And the next time we saw his body it was in the repository.",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "But when you compare his body before being moved, and his body after being moved... Other than the change in how it was positioned , there was no notable difference .",
                    "person": "Celeste",
                    "present": [
                        "Hifumi's Glasses"
                    ],
                    "source": {
                      "evidence_span": "When they were first found in the nurse's office, Hifumi's glasses were covered in blood. However, when they were next seen in the repository, they were completely clean.",
                      "testimony_span": "But when you compare his body before being moved, and his body after being moved... Other than the change in how it was positioned , there was no notable difference.",
                      "is_self_contained": "yes",
                      "context_span": ""
                    }
                },
                {
                    "testimony": "Then...was he really still alive?",
                    "person": "Sakura",
                    "present": []
                },
                {
                    "testimony": "Of course not, it is impossible. This is ridiculous...",
                    "person": "Celeste",
                    "present": []
                }
            ],
            "summarizedContext": "",
            "noPresent": false,
            "labels": [
              "physical"
            ],
            "reasoning": [
              "Fact 1: The witness claims there is no notable difference between victim's body before and after being moved.",
              "Fact 2: The evidence suggests the victim's glasses were covered in blood before being moved, but were clean after.",
              "Prop 1: If the victim's glasses had a notable difference, then the victim's body had a notable difference."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "Huffy had the note, right? Then the person it was intended for must have been Huffy! ",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "But remember what the note said . What time did it say to meet?",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "6 a.m., I believe...",
                    "person": "Sakura",
                    "present": []
                },
                {
                    "testimony": "The time doesn't matter!",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "The note has nothing to do with Tick Tock !",
                    "person": "Jill",
                    "present": []
                }
            ],
            "noPresent": true
        },
        {
            "category": "cross_examination",
            "newContext": "14-ClassTrialTHESUN.png\n16-Makoto23.png\n: No, there absolutely is a connection!\n8-Jill8.png\n: Wh--!? What the hell are you talking about!?\n17-Makoto28.png\n: The note said to meet at\n**\n6 a.m.\n, which is the same time Taka was murdered.\n18-Makoto2.png\n: We've already proven that using his\n**\nwristwatch\n.\n17-Makoto28.png\n: But there's more--look where the note says to\n**\nmeet\n.\n17-Makoto28.png\n: The equipment room, right?\n20-Sakura5.png\n: Which is where Taka was killed. I see...\n21-Makoto25.png\n: So, Taka was murdered at both the time and place written in the note.\n22-Makoto30.png\n: I think that should be plenty to show that this note was definitely meant for Taka!\n4-Jill9.png\n: Hmm...well, when you put it like that...\n23-Jill3.png\n: No further objections! Kyeeehahahaha!\n25-ClassTrialDawn.png\n26-Hiro12.png\n: Then someone used that note to trick Taka, just the same as me...\n27-Hiro16.png\n: Gh--! The culprit really is a cold-blooded monster! Telling people they'd found a way out...!\n28-Hina20.png\n: But if they gave the note to Taka...what was Hifumi doing with it?\n23-Jill3.png\n: Stuffed down his pants, no less!\n29-Makoto26.png\n: Most likely, Hifumi stole it off Taka's corpse after he died.\n30-Hina12.png\n: Huh? He stole it...?\n31-Byakuya7.png\n: Where's your proof? Go ahead, show us.\nProof that Hifumi stole the note from Taka...\n> Present \"Kiyotaka's Scrap of Paper\"\n34-ClassTrialChaos.png\n18-Makoto2.png\n: When I searched Taka's body, I saw that his lifeless hand was gripping a\n**\nsmall scrap of paper\n. If I'm right about this, the\n**\nsheet of paper\nthis piece came from is...\n16-Makoto23.png\n: I knew it! It\n**\nfits perfectly\nwith the note we found hidden on Hifumi!\n36-Hina9.png\n: Then Taka's scrap and Hifumi's note...\n37-Makoto29.png\n: Yup. They're from the same piece of paper.\n39-Kyoko11.png\n: Hifumi had the note meant for Taka, while Taka's corpse still grasped a small piece of that note... There's only one way to explain it...\n40-Sakura4.png\n: Taka died clutching the note. Hifumi tried to free the note from his death grip leaving behind only one small scrap. Did I get all that right?\n41-Byakuya5.png\n: That means Hifumi knew the note was important...\n42-Kyoko13.png\n: Exactly. Which proves that he was an accomplice in the murder.\n26-Hiro12.png\n: Whoa...!\n44-Hiro2.png\n: Yeah, after seeing all this, Hifumi was super involved in this whole thing for sure! In fact...\n45-Hiro15.png\n: He was behind the whole thing! In FACT, he's still alive!\n46-Makoto35.png\n: ...Sorry, no.\n47-FlashT.png\n49-FlashB.png\n46-Makoto35.png\n: When we found him in the repository, Hifumi was truly and completely dead. The second body discovery announcement proves that.\n36-Hina9.png\n: So then...who killed Hifumi?\n51-Sakura.png\n: Whoever did is the mastermind...the\n**\ntrue killer\n.\n39-Kyoko11.png\n: He was killed in the\n**\nrepository\n, so he must have been killed not long after transporting Taka's body.\n51-Sakura.png\n: So he must have been killed after Taka's body vanished but before we found both bodies in the repository...\n53-Byakuya.png\n: During that time, we'd all split up and were searching for Taka's missing body.\n54-Byakuya3.png\n: In other words, during that time...none of us have alibis.\n36-Hina9.png\n: Wait, but me and Sakura were together!\n8-Jill8.png\n: Stop trying to steal the spotlight, ya stupid walrus!\n55-Hina15.png\n: Who are you callin' a walrus!?\n25-ClassTrialDawn.png\n27-Hiro16.png\n: Anyway, when they were killed bothers me too, but there's something that's been bothering me even more!\n57-Celeste8.png\n: And what might that be?\n26-Hiro12.png\n: The\n**\nweapon\nthey used to kill Hifumi!\n6-Sakura3.png\n: The weapon...?\n26-Hiro12.png\n: Yeah, cuz I mean...according to the Monokuma File... The way Taka and Hifumi were killed was almost the same, with them having similar fractures and all...\n44-Hiro2.png\n: But Justice Hammer 3 and 4 were still laying around in the nurse's office and equipment room, right?\n44-Hiro2.png\n: So if Hifumi was killed in the repository, the culprit woulda had to grab one of the hammers, kill Hifumi, then\n**\nput the hammer back\nwhere they found it.\n26-Hiro12.png\n: But wouldn't that be seriously risky for 'em?\n31-Byakuya7.png\n: ...I'm surprised. It seems there's some semblance of a brain knocking around that skull of yours, after all.\n27-Hiro16.png\n: Hell yeah, it's packed in there good and tight!\n6-Sakura3.png\n: He's right, though. I don't understand it, either. The Monokuma File makes it clear that they were killed using similar instruments... But if the hammers were already laying around those other rooms...\n57-Celeste8.png\n: So the question is, how could the culprit have gotten their hands on either of the hammers? Personally, I haven't a clue.\n61-Hina21.png\n: So which hammer was used to attack Celeste? Number one or number two!?\n62-Makoto24.png\n: Those were accounted for in other rooms, too. And I don't think either one is big enough to kill someone.\n36-Hina9.png\n: Um...then, uhh...\n64-Byakuya9.png\n: ...Is it not possible they used a different weapon?\n45-Hiro15.png\n: I don't think is *is* possible! They were both killed with the same kinda thing, right?\n51-Sakura.png\n: So then,\n**\nwhat was used\nto kill Hifumi...?\nThe weapon that was actually used to kill Hifumi... The whole picture surrounding this case won't become clear until we figure that out. Somehow, I have to find the truth!\n",
            "testimonies": [
                {
                    "testimony": "What was used to kill Hifumi ...? Was it Justice Hammer 3? Maybe Justice Hammer 4?",
                    "person": "Sakura",
                    "present": []
                },
                {
                    "testimony": "Well, whatever it was, there's one thing we have to figure out. How was the culprit able to move around so freely with the weapon? How did nobody witness them carrying it?",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "Sounds like a Justice Hammer 5 is about to make its appearance! Check out murdergear.com/hammertime for more info!",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "Well, one thing seems pretty clear... The murder weapon had to be one of the Justice Hammers !",
                    "person": "Hiro",
                    "present": [
                        "Spotless Hammer"
                    ]
                },
                {
                    "testimony": "And, uh...that's about it.",
                    "person": "Hiro",
                    "present": []
                }
            ],
            "noPresent": true
        },
        {
            "category": "cross_examination",
            "newContext": "14-ClassTrialTHESUN.png\n17-Makoto28.png\n: The murder weapon wasn't a Justice Hammer at all. No, it was something\n**\ncompletely different\n.\n69-Hiro5.png\n: But...seriously? A different weapon?\n37-Makoto29.png\n: Specifically,\n**\na hammer from the repository\n. The killer could have easily used that to kill Hifumi.\n21-Makoto25.png\n: Now, all the hammers in the repository were covered in flecks of grit and debris... But for some reason, one of them had been\n**\nscrubbed clean\n.\n75-Hina11.png\n: Huh...?\n21-Makoto25.png\n: And the reason it had been scrubbed clean was most likely because it had been used to commit murder. If the hammer got covered in Hifumi's blood, of course they'd have to clean it off.\n47-FlashT.png\n49-FlashB.png\n21-Makoto25.png\n: I'd also like to point out that the repository has all kinds of hammers--big ones, small ones, and even some\n**\nflat, mallet-like\nones. I think whoever made the Justice Hammers used those as a basis for their design.\n51-Sakura.png\n: If that's true, that would explain the Monokuma File's note about the wounds being similar...\n64-Byakuya9.png\n: So Hifumi moved Taka's body to the repository, where someone then used a hammer to kill *him*.\n36-Hina9.png\n: And whoever did that is the\n**\ntrue killer\n--the one Hifumi was working with...and the one who betrayed him...!\n79-Celeste9.png\n: Hold on a moment. I still think it's strange to assume someone was\n**\nworking together\nwith him. The way the \"graduation rule works, there is no benefit to helping someone else carry out a murder.\n67-Celeste7.png\n: So the idea that anyone would work together like that is simply ludicrous. We talked about this, did we not?\nWe did talk about how there wouldn't be any reason for anyone to work together... At least, that's what we thought at first. But...\n",
            "testimonies": [
                {
                    "testimony": "Based on the rules that have been laid out for us... Even if more than one person is complicit in the murder...only the one who actually carried out the act can \"graduate\" and survive.",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "Assuming the rule holds true, it is simply impossible that two people worked together on this.",
                    "person": "Celeste",
                    "present": [
                        "two murders"
                    ]
                },
                {
                    "testimony": "That *is* how the rule was explained to us...",
                    "person": "Sakura",
                    "present": []
                },
                {
                    "testimony": "But that only really applies if there's one murder, right?",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "In this case, however, there were two murders .",
                    "person": "Kyoko",
                    "present": []
                }
            ],
            "noPresent": true
        },
        {
            "category": "cross_examination",
            "newContext": "2-ToSurvive.png\n5-Makoto31.png\n: It was\n**\nCeleste\n...\n6-Celeste6.png\n: Ah, so I'm the suspicious individual now, am I?\n7-Celeste4.png\n: Hmhmhm. I really do hate this kind of joke...\n8-Byakuya5.png\n: A joke? I wonder...\n9-Celeste15.png\n: So what you are saying, then, is that I specifically chose to work together with Hifumi. The idea that I would choose to spend any amount of time interacting with him...\n11-ClassTrialChaos.png\n12-Celeste10.png\n: That I would go within ten feet of that shit-for-brains! That lazy, worthless goddamn idiot!\n7-Celeste4.png\n: Ahem. Ah, pardonnez-moi.\n13-Byakuya4.png\n: Just to be clear, there *is* evidence to support it.\n14-Celeste16.png\n: ...Is that so?\n15-Byakuya7.png\n: It is. Throughout the investigation, there was a\n**\ncertain behavior\nthat was common only to the two of you.\n16-Byakuya9.png\n: Considering what we've learned so far, it only further proves that the two of you were working together!\nWhat is it that only Hifumi and Celeste had in common...\n> Encountering the suspicious individual\n5-Makoto31.png\n: The behavior they had in common had to do with the \"\n**\nsuspicious individual\n\" in the suit, doesn't it? The only ones who ever actually saw Robo Justice firsthand were Celeste and Hifumi.\n♪\n**\nMusic cuts out.\n♪\n8-Byakuya5.png\n: Shush. The adults are talking now.\n19-Makoto37.png\n: S-Sorry...\n21-ClassTrialDawn.png\n22-Byakuya.png\n: As he said, only Celeste and Hifumi ever laid eyes on the costumed individual. If we accept that Hifumi was one of the culprits, we can't help but suspect what Celeste has said, as well.\n23-Hina10.png\n: Are you saying everything they told us was a lie...?\n22-Byakuya.png\n: After taking Hifumi to the nurse's office, we all began our search for this individual, correct? And not too long after that, do you remember what Celeste said?\n24-FlashT.png\n26-FlashB.png\n27-Celeste14.png\n: I saw a shadow! Something moving around at the top of the stairs!\n29-Byakuya8.png\n: We headed to the 2nd floor specifically because of what she claimed to have seen. Next, to draw is all to the physics lab, up on the 3rd floor...\n30-Sakura3.png\n: ...She let out a bloodcurdling scream.\n8-Byakuya5.png\n: And when we'd all come to see what was wrong, what was it she said?\n31-Flashback.png\n33-Hina15.png\n: Celeste! What's wrong!?\n15-Byakuya7.png\n: That was a rather...intense scream for someone like you.\n27-Celeste14.png\n: I saw him! The strange costumed man...! He ran off as soon as I screamed... I was blocking the stairs, so he headed\n**\nfurther down into the hallway\nand disappeared...!\n31-Flashback.png\n22-Byakuya.png\n: Once she'd done her job of getting us all up to the physics lab it was time for her partner to get to work.\n31-Flashback.png\n???: Ungyaaaaaahhh!!!\n36-Makoto2.png\n: Huh!?\n23-Hina10.png\n: Wh-What was that!?\n27-Celeste14.png\n: That came from downstairs! It must have been...\n36-Makoto2.png\n: Hifumi! He's in the nurse's office! This is bad! Come on, we have to go back!\n31-Flashback.png\n23-Hina10.png\n: It was to get us to divide into two groups...so that we would discover both bodies at the same time!?\n22-Byakuya.png\n: In fact, Celeste was precisely the one who proposed that we split up.\n31-Flashback.png\n39-Celeste17.png\n: Then why don't we split into two groups?\n40-Byakuya3.png\n: I'll lead the hunting party. That seems much more interesting.\n41-Celeste2.png\n: Very well, then Makoto and Hina, you come with me to the nurse's office. I will leave the capture of the suspicious individual to Toko, Sakura, and Byakuya.\n31-Flashback.png\n40-Byakuya3.png\n: Well? If Celeste and Hifumi were working together, all those chance events suddenly become connected...\n9-Celeste15.png\n: ...\n8-Byakuya5.png\n: And on top of that...that piercing cry of yours early on...\n43-Byakuya15.png\n: That was\n**\nto signal Hifumi\n, wasn't it? It was your way of telling him, \"We're on the 3rd floor, everything's going according to plan.\" Why else would you let out a scream that could have carried across the sea?\n9-Celeste15.png\n: ...\n45-Makoto26.png\n: I've just realized another strange thing... When we found Hifumi in the nurse's office, who we now know was only pretending to be dead...\n24-FlashT.png\n26-FlashB.png\n27-Celeste14.png\n: I certainly was not expecting this. I did not imagine that Hifumi would be murdered!\n45-Makoto26.png\n: Celeste...you were the first one to say\n**\nhe'd been murdered\n. You wanted to make sure we wouldn't have any doubt in our minds.\n9-Celeste15.png\n: ...\n23-Hina10.png\n: I-I don't believe it... Everything...the whole thing was one big act!\n5-Makoto31.png\n: Hina. You were with Celeste when Hifumi's body disappeared, right?\n48-Hina2.png\n: Yeah... I was feeling kinda sick, so Celeste took me to the bathroom...\n50-Hina12.png\n: ...Wait! Then that was--!?\n5-Makoto31.png\n: She wasn't worried about you. She just saw a chance to help Hifumi sneak out of the nurse's office.\n40-Byakuya3.png\n: Each piece isn't much by itself, but start putting them together and the picture gets very ugly indeed.\n13-Byakuya4.png\n: Wouldn't you agree, Celeste?\n11-ClassTrialChaos.png\n7-Celeste4.png\n: ...I have no idea what you mean.\n8-Byakuya5.png\n: Don't bother trying to deny it.\n29-Byakuya8.png\n: You made one fatal\n**\nmistake\n.\n41-Celeste2.png\n: ...Oh did I?\n16-Byakuya9.png\n: I didn't even catch it myself when you first said it, but looking back, I can say that that one little slip-up was your undoing.\n9-Celeste15.png\n: Wh-What are you talking about...?\n15-Byakuya7.png\n: I'm talking about what you said after Hifumi's body disappeared and we returned to the nurse's office.\n31-Flashback.png\n54-Celeste5.png\n: They must really be enjoying this... Enjoying the sight of us standing around, frightened and confused...\n27-Celeste14.png\n: We're all going to die here. We're going to die, just like those guys died...\n31-Flashback.png\n30-Sakura3.png\n: I remember he saying that too, but...I don't understand what's so strange about it.\n8-Byakuya5.png\n: Then pay attention. Sakura, Toko, and I were first to discover Taka's body in the equipment room. Then Makoto showed up and told us Hifumi had been killed. So Sakura and I left with Makoto. Once we were in the hall, we ran into Celeste, and the four of us headed to the nurse's office. Now, the entire time we were together, none of us said anything about Taka being dead.\n15-Byakuya7.png\n: Think about it--Celeste's\n**\ncomment\ndoesn't make sense. It was completely out of place.\n56-Hiro5.png\n: Yeah, I see what you're talking about. Although I don't really get what it means...\n40-Byakuya3.png\n: You hear that, Celeste? Everyone's having some trouble understanding. Could you repeat what you said?\n13-Byakuya4.png\n: If you're really not the culprit, you shouldn't have any problem repeating it, right?\n41-Celeste2.png\n: ...\nByakuya said that Celeste's comment doesn't make sense... But what is he alluding to...?\n",
            "testimonies": [
                {
                    "testimony": "All I said was...",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "They must really be enjoying this... Enjoying the sight of us standing around, frightened and confused... They must be positively elated... We are all going to die here. We are going to die, just like those guys died...",
                    "person": "Celeste",
                    "present": [
                        "so strange"
                    ]
                },
                {
                    "testimony": "...And that is all I said.",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "And that's all it takes to finish this. It's obvious, isn't it? What was so strange about Celeste's comment?",
                    "person": "Byakuya",
                    "present": []
                }
            ],
            "noPresent": true
        },
        {
            "category": "cross_examination",
            "newContext": "67-ClassTrialTHESUN.png\n68-Makoto25.png\n: That's right... There's no reason Celeste should have said \"\n**\njust like *those guys* died\n\"...\n69-Makoto29.png\n: When she said that, none of us had told her Taka was dead.\n39-Celeste17.png\n: ...\n8-Byakuya5.png\n: Exactly. And we didn't run into her until after we were all out in the hall. So there was never any chance for her to have seen his body in the equipment room for herself.\n5-Makoto31.png\n: So how did you know, Celeste? How did you know\n**\nmore than one person\nhad been killed? And how did you know they were\n**\nboth guys\n?\n70-Makoto32.png\n: Because Kyoko had also disappeared, right? So she could have been dead, too.\n9-Celeste15.png\n: ...\n72-BoysLifeofDespair.png\n73-Celeste3.png\n: Hmhmhm...\n7-Celeste4.png\n: You all have such vivid imaginations, you know that?\n8-Byakuya5.png\n: Imaginations...?\n7-Celeste4.png\n: You claim that I was lying when I told you about the suspicious person I saw...\n39-Celeste17.png\n: Then what about the picture I took?\n24-FlashT.png\n26-FlashB.png\n39-Celeste17.png\n: How do you explain this picture of the costumed villian dragging Hifumi away?\n76-Hiro12.png\n: I-It has to be some kind of setup, right? Celeste put the suit on, and then...then she used the camera's timer to...to set up the picture!\n14-Celeste16.png\n: Have you so quickly forgotten? You are the only one who could have possibly fit into that suit.\n14-Celeste16.png\n: Plus, I happen to know that this particular camera does not have a timer.\n7-Celeste4.png\n: In other words, it is an unassailable fact that this is a picture of Hifumi being dragged away. If everything I told you was a lie, how can this picture exist?\n79-Kyoko11.png\n: Simple. Are we sure that's really a picture of the suspect dragging Hifumi away?\n39-Celeste17.png\n: ...What could you possibly mean by that?\n79-Kyoko11.png\n: Surely there are other explanations than the one you've offered up.\n39-Celeste17.png\n: No...there is no other explanation.\nOther...explanations?\n24-FlashT.png\n26-FlashB.png\nIf it wasn't a picture of the suspect dragging Hifumi away...the only other possibility is...\n> Hifumi is dragging the suspect away\n11-ClassTrialChaos.png\n5-Makoto31.png\n: It's *not* a picture of the suspect dragging Hifumi away...\n69-Makoto29.png\n: I would say it's a picture of\n**\nHifumi dragging the suspect away\n!\n27-Celeste14.png\n: Kh--!\n83-Kyoko13.png\n: That's certainly within the realm of possibility.\n24-FlashT.png\n26-FlashB.png\n83-Kyoko13.png\n: The one being dragged off in that picture isn't Hifumi, but the person inside the robot suit. We've simply been led to believe that it's the other way around.\n79-Kyoko11.png\n: And the strange costume might only exist to lead us astray even farther. If you saw someone wearing something like that in this situation, of course you'd notice and be suspicious.\n86-Hiro16.png\n: Th-That's what happened! You put me to sleep and made me out to be the bad guy in all this!\n73-Celeste3.png\n: Hmhm. Hmhmhmhm... Eheh... Such a thing...\n2-ToSurvive.png\n14-Celeste16.png\n: ...is utterly impossible. Hifumi was dragging him away? Ridiculous.\n88-Kyoko12.png\n: Is it? I don't think it's ridiculous at all.\n14-Celeste16.png\n: Then shut your mouth and allow me to educate you.\nCeleste thinks she can prove that there's no way Hifumi was dragging the suspect away. But is that really possible...?\n",
            "testimonies": [
                {
                    "testimony": "You dressed me up in that suit after I passed out...",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "Then you just draped me across Hifumi and had him carry my weight ! You tried to make me look like the bad guy!",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "Like I said--ridiculous. As you can see in the picture, the suspect is standing perfectly upright.",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "If the person inside the suit was unconscious there's no way they could stand up straight like that.",
                    "person": "Celeste",
                    "present": [
                        "Robo Justice Costume"
                    ],
                    "source": {
                      "evidence_span": "anyone wearing it would not be able to see their feet, or bend at the waist more than 90 degrees",
                      "testimony_span": "If the person inside the suit was unconscious there's no way they could stand up straight like that.",
                      "is_self_contained": "yes",
                      "context_span": ""
                    }
                },
                {
                    "testimony": "Then the fortune-telling idiot is the culprit after all!",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "N-No way!",
                    "person": "Hiro",
                    "present": []
                }
            ],
            "summarizedContext": "",
            "noPresent": false,
            "labels": [
              "physical"
            ],
            "reasoning": [
              "Fact 1: The witness claims an unconscious person would not be able to stand up straight in the suit.",
              "Fact 2: The evidence suggests the suit is rigid and does not bend easily.",
              "Prop 1: If a suit is rigid, then an unconscious person would be able to stand up straight in it."
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "Hifumi was trying to tell us something... He wanted us to know the killer's last name--Yasukiro .",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "If there's one person here who might have that last name...",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "It would have to be you, Celeste. You haven't told anyone what your real name is.",
                    "person": "Sakura",
                    "present": []
                },
                {
                    "testimony": "How many times do I have to tell you...? My...name...is...",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "Celestia Ludenburg, goddammit!",
                    "person": "Celeste",
                    "present": []
                },
                {
                    "testimony": "How long do you plan to go on pretending...?",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "I'm not pretending. It's the truth! And since you have no way to contradict me ...",
                    "person": "Celeste",
                    "present": [
                        "e-Handbook"
                    ],
                    "source": {
                      "evidence_span": "The owner's name is displayed each time the handbook is booted up.",
                      "testimony_span": "you have no way to contradict me",
                      "is_self_contained": "yes",
                      "context_span": ""
                    }
                },
                {
                    "testimony": "That's the only truth there is! Moron!",
                    "person": "Celeste",
                    "present": []
                }
            ],
            "summarizedContext": "",
            "noPresent": false,
            "labels": [
              "physical"
            ],
            "reasoning": [
              "Fact 1: The witness claims there is no way to contradict her on what her true name is.",
              "Fact 2: The evidence suggests the e-handbook displays the owner's name each time it is booted up.",
              "Prop 1: If a device displays the owner's name, then there is a way to contradict the witness's claim about her name."
            ]
        }
    ]
}