{
    "previousContext": "2-TheSixteenthStudent.png\n3-Kyoko22.png\n: Mukuro Ikusaba.\n4-Makoto3.png\n: What...?\n3-Kyoko22.png\n:\nMukuro Ikusaba\n... The\nsixteenth student\n, lying hidden somewhere in this school... The one they call the\nUltimate Despair\n... Watch out for her.\n6-ToSurvive.png\nKyoko told me to watch out for her... Mukuro Ikusaba... That was three days before...\nthe next incident\n. Three days before we would be faced with another murder.\nThree days before\nthe worst thing so far\nwould reveal itself...\nIn the meantime, the day after Sakura's class trial... That morning, in the dining hall...\n11-BeautifulMorning.png\n13-Byakuya7.png\n: So, let's begin the usual\npost-trial investigation\n.\n14-Hiro5.png\n: Hey, you didn't make small talk or anything! We never just get straight to the point like that!\n15-Byakuya3.png\n: If you want to keep up with me, you must refrain from pointless small talk.\n17-Hina23.png\n: Jeez, how high is that horse of yours?\n18-Hiro2.png\n: He just acts like that to hide his own insecurities. That's what I like to think, anyway...\n19-Byakuya.png\n: Regardless, if you want to defeat the mastermind, you need to follow my lead. They creep around the school like a mouse, but the mastermind's pride is as bloated as a cow's udder.\n20-Byakuya2.png\n: And no matter what it takes, I *will* rid this world of them...\n22-Toko.png\n: ...\n23-Hiro12.png\n: Hey, Toko...you've been pretty quiet.\n22-Toko.png\n: ...\n24-Hiro3.png\n: Man, you're so boring now! You just sit there, like a mushroom. Gonna start calling you Miss Mushroom!\n25-Toko4.png\n: ...\n27-Hina2.png\n: She didn't snap back at you...\n19-Byakuya.png\n: Her talking makes things difficult. So I told her not to open her mouth without permission.\n28-Hina12.png\n: What!? But if she can't open her mouth, she can't eat! Or drink water!\n19-Byakuya.png\n: I don't care.\n29-Hiro15.png\n: And you're okay with that, Toko!?\n22-Toko.png\n: ...\n30-Hiro14.png\n: Jeez, how low is that rock you're hiding under...?\n32-Kyoko2.png\n: I believe this is the small talk Byakuya warned us against.\n33-Byakuya10.png\n: And yet...I let myself get involved. But it is now finished. I will never allow you to drag me down to your level again.\n34-Byakuya14.png\n: We're going to begin our search. Stop running your mouths and start moving your legs.\nPressured by an obviously irritated Byakuya, we all started our exploration.\n36-BeautifulDeath.png\n37-Narration.png\n: It's time to explore the 5th floor. The stairs up are right next to the Chem Lab.\nSo here I am on the 5th floor of Hope's Peak Academy... The 5th floor has been opened up to us... And it's totally different from all the floors we've seen up till now.\n39-Makoto.png\n: For some reason it feels...unpleasant.\n37-Narration.png\n: The 5th floor isn't huge but it has a couple important rooms to check out. I really like the look and layout of the halls here. It's a very pleasant blue with the sparse foliage on the sides.\n37-Narration.png\n: We'll start by checking out Classroom 5-A.\n37-Narration.png\n: Not much to see in here, like most other classrooms. More weird chalk art though.\n37-Narration.png\n: As for Classroom 5-B...\n37-Narration.png\n: Looks like someone's here.\n46-Toko2.png\n: ...!\nHuh? Does she want to talk to me about something?\n39-Makoto.png\n: Toko...what's wrong?\n47-Toko5.png\n: ... ...\nIs she...trying to say something? I think she's almost...! Just a little more and I might get it...!\n48-Toko12.png\n: ...\n39-Makoto.png\n: I'm sorry, but...I have no idea what it is you're trying to tell me.\n25-Toko4.png\n: ...\nShe just let her shoulders drop. She looks so sad. I guess she gave up...\n37-Narration.png\n: Well that went about as well as I expected it to.\n37-Narration.png\n: In the bottom right corner of the map there's a large wooden door.\n37-Narration.png\n: Inside, is the school dojo. It's very pretty. Let's see what Kyoko has to say about the place.\n53-Kyoko.png\n: ...\nWhat Kyoko told me yesterday... What the heck did it mean...?\n54-FlashT.png\n56-FlashB.png\n3-Kyoko22.png\n: Mukuro Ikusaba... The sixteenth student, lying hidden somewhere in this school... The one they call the Ultimate Despair... Watch out for her.\n39-Makoto.png\n: Um, Kyoko...?\n53-Kyoko.png\n: I'm not going to say anything.\n39-Makoto.png\n: ...Huh?\n53-Kyoko.png\n: I can't say anything...\nKyoko narrowed her eyes. Her gaze darted up to the surveillance camera...\n58-Kyoko13.png\n: ...You understand why, right?\nShe was trying to tell me that whatever it was,\nit was important\n. The mastermind couldn't find out. But how did Kyoko get her hands on information that could be that important...?\n53-Kyoko.png\n: We're finished here.\nShe made it very clear that our conversation had come to an end. And just like usual, I didn't understand anything any better than before...\n37-Narration.png\n: There are a couple of flavor text descriptions in here like the Japanese suit of armor and sword training straw post. The trees actually elicit a response from Kyoko though.\nEven though this room is totally enclosed, there's a cherry tree here. And it's in full bloom.\n53-Kyoko.png\n: It's quite elegant.\n39-Makoto.png\n: This is what you consider elegant...?\n61-Kyoko3.png\n: I lived overseas for a long time, so this kind of Japanese-style scenery is refreshing.\nBut considering our situation, isn't it kinda...out of place?\n37-Narration.png\n: The other major thing to examine here is the row of lockers.\nThere's a bunch of\nwooden lockers\nin here. The wooden lockers and keys remind me of super old-school public bathhouses...\n37-Narration.png\n: That does it for the dojo. Across the hall is this double door with a light on inside.\n37-Narration.png\n: Well, that was unexpected. Are those blue skies?\n67-Hiro4.png\n: At first I thought I saw blue skies, but turns out they just painted the walls and the ceiling!\n37-Narration.png\n: Guess not.\n68-Hiro18.png\n: Oh, but the plants are all real. It's been a while since I've smelled vegetation. It helps me relax.\n70-Hiro16.png\n: ...That's not what you're thinking, is it!?\n23-Hiro12.png\n: Don't you get it!? Don't you realize...the true horror of plant life!? It's there, just beneath the surface. Beneath their calm exterior, they're always watching, and waiting... And when they decide they can't leave us in charge of Earth anymore...\n70-Hiro16.png\n: ...they'll put their plan for global human extinction into action!\n39-Makoto.png\n: ...\n18-Hiro2.png\n: I'm serious!\n39-Makoto.png\n: ...\n37-Narration.png\n: Yeah, I'm not buying that one either. Let's see what's up with this huge plant.\n39-Makoto.png\n: ...Uwah! Wh-What *is* this...?\nThis thing is super weird, super creepy! Flowers aren't supposed to get this big...!\n39-Makoto.png\n: Is this thing...real?\n74-MrMonokumasLesson.png\n75-Monokuma2.png\n: WATCH OUT!!!\n39-Makoto.png\n: Wh--!?\n76-Monokuma7.png\n: That's a\nMonokuma Flower\n. I came up with the name myself. Try and touch it, and you're in for some real excitement! Your heart's all like whoa! and the plant's all like snap! and your flesh is all like bluuuggh I'm dead!\nIn other words...it's a monstrosity.\n78-Monokuma10.png\n: It's pretty frickin' amazing, if I do say so myself! A student at Hope's Peak added improvement after improvement, and created this miracle creature! The Ultimate Botanist... Although, they\ndon't go here\nanymore. They died during The Tragedy!\n79-Monokuma.png\n: By the way, despite how it looks, that flower is super practical! It can eat paper, plastic, even\npeople\n! So it's totally good for the environment! Such an eco-friendly creation is vital for the future growth of a healthy society!\n80-Monokuma5.png\n: Not that I'd know anything about that myself! Ahh-hahaha! *leaves*\nSpouting more and more nonsense, Monokuma eventually disappeared.\n39-Makoto.png\n: Whatever it is, I'd better keep my distance.\n36-BeautifulDeath.png\n37-Narration.png\n: Some sort of device on the side here.\nThere's some kind of control panel set near the wall... Does it control the air conditioning or something...?\n74-MrMonokumasLesson.png\n79-Monokuma.png\n: It's for the\nsprinklers\n!\n39-Makoto.png\n: Sprinklers...?\n78-Monokuma10.png\n: Yeah! It controls the sprinklers in the garden! The sprinklers are set to go off\nevery morning at 7:30\n. Don't you dare change it without permission!\n84-Monokuma4.png\n: Of course, the settings panel is locked, so\nyou couldn't change it if you wanted to\n!\n39-Makoto.png\n: So that means the sprinklers go off at 7:30 a.m. every morning?\n84-Monokuma4.png\n: Yup, you got it. It's super user-friendly, which sucks. So if you get here too early, you'll get drenched. So watch yourself!\n76-Monokuma7.png\n: But you're not a little kid, right? You're too old to go running through sprinklers anyway.\n86-Monokuma12.png\n: ...Or do you have some kind of water fetish!?\n80-Monokuma5.png\n: I'm gonna tell everyone! Ahh-hahaha!\nIs this...a\nchicken coop\n? What's a chicken coop doing here?\nThis place even has chickens, huh? They're...just regular chickens, right? Like, they don't eat people, or lay bombs instead of eggs, or something crazy like that...?\n39-Makoto.png\n: ...It seems safe...\n91-100MileJunkFoodDash.png\n92-Hiro7.png\n: Oh, you like chicken too, Makoto!? Yeah, I love these little guys. They're seriously cute, right!? And there's exactly\nfive\nof them here!\n39-Makoto.png\n: Exactly...?\n18-Hiro2.png\n: Five! You know, the number that comes after four and before six? At least, in terms of natural numbers... Anyway, whenever the number five pops up, that's a good omen! It contains the mysteries of the cosmos...\n29-Hiro15.png\n: It's a number of power! A refreshing number on par with hand-squeezed all-natural lemonade!\nHe never lets me get a word in edge-wise...\n36-BeautifulDeath.png\n37-Narration.png\n: There's a toolshed in the back of the garden.\nJust to be sure, I should take a look in that\ntoolshed\n.\nThis place seems totally disorganized. From a lawnmower to fertilizer, flowerpots to farm tools... And leaning against the back wall... Is that a pickaxe?\n37-Narration.png\n: There's a bunch of stuff in here to check but the only thing notable is the pickaxe.\nHuh? There's something carved into the handle of this pickaxe...\n39-Makoto.png\n:\nCrazy...diamond\n...?\nI feel like...I remember seeing that...somewhere...\n37-Narration.png\n: Anyway, that's it for the garden and toolshed. Back out in the halls, we can run into Hina.\n100-Hina9.png\n: This floor feels different compared to all the others. I'm not sure what it is... Is there some reason for that? I hope it's not anything too...creepy.\n37-Narration.png\n: Well that's...a very and long ominous hallway.\n37-Narration.png\n: Raw...\n*Rattle rattle*\nIt's locked... We came all this way, just to be denied here. The sign in the hall says\nBio Lab\n.\n39-Makoto.png\n: A bio lab, that we're forbidden from seeing into.\nIt kinda sounds like something out of an old cheesy horror movie...\n37-Narration.png\n: And lastly, there's a third classroom on this floor. Every other floor has only had two. Let's see what's hiding in Classroom 5-C...\n2-BoysLifeofDespair.png\n3-Makoto2.png\n: Wh-What the hell is this...!?\nThe grotesque horror of the room struck me hard and fast. What I saw was bad enough, but what I smelled... It was sour, pungent, impossibly rank...\n5-Byakuya15.png\n: It smells awful, doesn't it?\n3-Makoto2.png\n: I-It's...\n6-Byakuya7.png\n: It must be at least vaguely familiar to you. After all, you've been around your fair share of corpses.\n3-Makoto2.png\n: Are you saying...?\n8-Byakuya14.png\n: It's the\nsmell of death\n. Their\nflesh\nand\nfat\nand\nblood\n...\nThere was no surprise in his voice, no shock. But he was right. I had experienced this smell more than once before... It was the smell of\ndeath and despair\n.\n9-Byakuya10.png\n: But the smell here is strong, condensed. It's the smell of a battlefield.\n3-Makoto2.png\n: Monokuma must have--\n11-MrMonokumaAfterClass.png\n12-Monokuma2.png\n: What, my fault AGAIN!?\n13-Monokuma3.png\n: Stop trying to blame everything on me!\n3-Makoto2.png\n: I-If you hadn't done what you did, this never would have happened!\n12-Monokuma2.png\n: No, no, no. It's quite the opposite!\n3-Makoto2.png\n: The opposite...?\n15-Monokuma.png\n: Yup! Let me give you an itty bitty eegie squeegie little hint. As far as this room goes, I don't know a thing! I just\nleft it exactly how I found it\n.\n3-Makoto2.png\n: What...?\n16-Monokuma4.png\n:  How's that for a hint!? Better than those stupid \"hints\" you get from NPCs in those mean old RPGs!\n17-Monokuma8.png\n: But it's pretty scary, huh? Blood all over the walls and junk... Of course, even in the outside world, people die bloody, gruesome deaths every day!\n18-Monokuma13.png\n: So it's not really a big deal! Just keep your chin up and keep on livin', soldier! *leaves*\nWhat's he talking about...? He just left it the way he found it? What's the meaning of all this...?\n2-BoysLifeofDespair.png\n20-Narration.png\n: This...was not what I expected to find in here. Well, uh, let's see if Byakuya has any other thoughts.\n3-Makoto2.png\n: Um, Byakuya? About what Monokuma just told us...\n22-Byakuya9.png\n: ...\nIt's like I'm not even here. He must be lost in thought. Is he really thinking that hard? Or is he flat-out ignoring me...?\nThere's blood all over the place. I want to shut my eyes forever against such a ghastly sight...\n22-Byakuya9.png\n: It appears all the bloodstains are dry. And their color has changed, as well. I think it's safe to assume these stains are\nconsiderably old\n.\n3-Makoto2.png\n: This is all...really blood?\n25-Byakuya3.png\n: Of course. I wouldn't find it interesting otherwise.\n6-Byakuya7.png\n: And it *is* interesting, I assure you. What on Earth happened in this classroom...?\nHe seems like he's...enjoying himself. No way can I \"keep up\" with someone like that...\nThere are white chalk outlines drawn all over the floor. How many bodies were there...? I've seen this kind of thing on detective shows and stuff like that. You always see it at the\nscene of a murder\n...\n3-Makoto2.png\n: ...\nI wish I could say I don't believe it...\n20-Narration.png\n: Thankfully, that's all there is to see in here and we can leave.\n30-BeautifulDeath.png\n3-Makoto2.png\n: I guess I've seen what there is to see up here for now.\nBut once again...nothing I found seems to make any real sense.\n3-Makoto2.png\n: I need to head back to the\ndining hall\nand find out what the others turned up.\nOne after another, everyone made their way to the dining hall. And before too long...\n34-Byakuya.png\n: It would appear everyone has returned.\n35-Hiro13.png\n: But still...it's just the six of us. That's barely enough for a decent volleyball team...\n36-Hina22.png\n: Hey! Don't be a sourpuss! We gotta think positive! Besides, even if one more person died, we can still field a basketball team!\n37-Hiro4.png\n: That's like...reverse positive thinking...\n38-Makoto.png\n: Anyway, there's no time to be depressed. For the sake of everyone we've lost, we have to do our best.\n39-Byakuya2.png\n: Can we stop all this group hug nonsense? We need to find out what everyone discovered.\n20-Narration.png\n: We have to talk to everyone, so let's begin with Hina.\n42-Hina.png\n: I checked all the windows on the 5th floor, front to back. That used to kinda be Sakura's job, but...\n43-Hina2.png\n: Anyway, no dice. There were metal plates on all the windows, just like everywhere else.\n44-Kyoko17.png\n: Which means no chance of escape on the 5th floor, either...\n43-Hina2.png\n: But when I was looking around, I realized something about\n[the layout of the school]\n...\n> the layout of the school\n38-Makoto.png\n: What exactly did you notice about the layout of the school?\n46-Kyoko13.png\n: You took a good look around the 5th floor yourself, didn't you Makoto?\n38-Makoto.png\n: Huh? Why do you ask?\n46-Kyoko13.png\n: Because if you did, you must have noticed. The 5th floor is lacking something every other floor has.\nSomething on all the other floors...but not on the 5th floor...?\n38-Makoto.png\n: Are you talking about...stairs? There\naren't any stairs leading up\nfrom the 5th floor. That's what you're talking about, right?\n48-Hiro7.png\n: Does that mean...the 5th floor is the end!?\n49-Kyoko15.png\n: We're finally starting to get a clear picture of this school.\n25-Byakuya3.png\n: All that's left now is to solve the underlying mystery.\n37-Hiro4.png\n: But that's the hardest part...\n36-Hina22.png\n: Even if it's hard, we still gotta do it!\n38-Makoto.png\n: Yeah, Hina's right! Everything will be okay. As long as we work together, I'm sure we'll make it out of this...!\nNo, not \"I'm sure\"... We absolutely WILL make it out, no matter what it takes!\n52-Hiro.png\n: Well...there's a big garden up on the 5th floor. And I found more than one thing to be worried about... A\n[stupidly large plant]\n, a\n[chicken coop]\n, and--I know what you're gonna say, but...a\n[toolshed]\n!\n> stupidly large plant\n38-Makoto.png\n: Monokuma said that was called a...Monokuma Flower. Even touching it seems dangerous, so we have to be careful.\n53-Hiro2.png\n: It's totally a man-eating plant! I'm pretty sure it's different from the one that lives in the pipe, though. Anyway, that thing must benefit from the sprinkler system as much as anything else in there...\n38-Makoto.png\n: Oh yeah. Apparently the sprinklers come on every morning at 7:30 on the dot.\n55-Hiro12.png\n: Yeah, remember that! You don't wanna get drenched and catch a cold!\n56-Hina21.png\n: Well you don't have to worry. They say idiots never catch colds, ya know.\n57-Hiro3.png\n: Of course not! Cuz idiots never get wet!\n38-Makoto.png\n: Umm...I think you're thinking of ducks.\n43-Hina2.png\n: I'm starting to worry about you, Hiro. Can you tell me what ten plus ten is?\n59-Hiro16.png\n: Hey, come on! You don't ALWAYS have to call me dumb! I may have been held back three times, but that doesn't make me stupid! But if it'll make you happy, I'll answer your dumb question...!\n55-Hiro12.png\n: So! Um...what was the question again?\n60-Hina23.png\n: Don't worry. You just answered it...\n-----\n> chicken coop\n38-Makoto.png\n: There were a bunch of chickens in the chicken coop, right?\n53-Hiro2.png\n: That's right! Five! Five chickens!\n62-Hina7.png\n: I love chickens! Let's raise 'em up big and fat. Then we can make fried chicken! Oh, or barbeque! Decisions, decisions...\n56-Hina21.png\n: Oh! Oh! Or how about raw! Cuz there's nothing fresher than raw, right!?\n63-Hiro14.png\n: I'm pretty sure that'd kill you...\n-----\n> toolshed\n38-Makoto.png\n: You noticed it too, huh? That pickaxe...\n39-Byakuya2.png\n: Huh? What about the pickaxe?\n64-FlashT.png\n66-FlashB.png\n67-DISTRUST.png\n38-Makoto.png\n: Well, there was a pickaxe in the toolshed. And the words\nCrazy Diamond\nhad been carved into the handle. Haven't we seen that phrase somewhere before...?\n69-Hina20.png\n: Crazy Diamond? Hmm... Yeah, that does sound kinda familiar, I think...\n70-Kyoko11.png\n: I don't just think, I know. We've definitely seen that phrase before.\n71-Hina11.png\n: Huh? Where!?\n38-Makoto.png\n: Ah, that's it! I remember...\n64-FlashT.png\n66-FlashB.png\n38-Makoto.png\n: It was on\nMondo's uniform\n! On the back of his jacket... His jacket said the same thing, right?\nCrazy Diamond\n!\n22-Byakuya9.png\n: You're absolutely right...\n69-Hina20.png\n: But why would that be on the pickaxe in the garden?\n55-Hiro12.png\n: Mondo must've snuck in there and done it, right?\n6-Byakuya7.png\n: But we didn't have access to the garden until today.\n56-Hina21.png\n: Then...maybe Mondo brought it with him when he first came here, and Monokuma confiscated it?\n38-Makoto.png\n: Whatever the reason, that's what stuck out to me in the toolshed--the pickaxe connected to Mondo.\n53-Hiro2.png\n: Well, what stuck out to *me* wasn't the pickaxe at all!\n38-Makoto.png\n: Huh? Then...what did?\n76-100MileJunkFoodDash.png\n52-Hiro.png\n: What *I* noticed was the lawnmower! I'm thinking maybe we can use it to call for help...\n71-Hina11.png\n: How are you gonna call for help with a lawnmower!?\n59-Hiro16.png\n: I dunno! Maybe I can use it to make crop circles or something! Yeah, that's it! I'm gonna make crop circles!\n53-Hiro2.png\n: And we can use those to call for help!\n78-Hina14.png\n: What the heck's happened to you...? You weren't like this in the beginning, you know.\n79-Hiro18.png\n: Well, back then my personality hadn't quite solidified yet...!\n60-Hina23.png\n: I didn't think it was possible, but I'm more disappointed in you now than I've ever been...\n30-BeautifulDeath.png\n70-Kyoko11.png\n: My concern is with the\nbio lab\n. That was the only place on the 5th floor that we couldn't access.\n82-Hina9.png\n: The bio lab, huh? I wonder what's in there...\n55-Hiro12.png\n: If this were like, a cliche horror game, it'd be some kind of creature. The final boss, or Tyrant, or--!\n82-Hina9.png\n: We're...not in a horror game, though...\n34-Byakuya.png\n: Either way, we don't need to worry about it at the moment. Don't bother thinking about something that can't be understood no matter how much you think about it.\n6-Byakuya7.png\n: Your tiny brains can only do so much, so focus on utilizing them efficiently.\n43-Hina2.png\n: I don't really like *how* you said it, but *what* you said is probably right.\n39-Byakuya2.png\n: No, how I said it is right, too.\n20-Narration.png\n: We'll pick up with the rest of the discoveries next time.\n2-Narration.png\n: We're continuing to talk with the others about what they discovered on the 5th floor.\n4-Byakuya3.png\n: By the way, did any of you find it? The other\nstrange room\non the 5th floor. Well, no...\"strange\" is a massive understatement.\n5-FlashT.png\n7-FlashB.png\n8-DISTRUST.png\n9-Byakuya.png\n: The smell of flesh and fat and blood... The white outlines of countless corpses... It was more dreadful than anything I've encountered here so far...\n11-Hiro8.png\n: Wh-What the hell are you talking about!?\n9-Byakuya.png\n: The smell itself was horrific. Far beyond any normal murder scene. Every body's smell, concentrated...\n12-Hina9.png\n: God, I'm glad I didn't see it... I feel like I'm gonna barf just hearing you describe it...\n13-Hiro5.png\n: But I mean...what the hell happened in that room?\n15-Byakuya9.png\n: I can only think of one thing... A\nlarge group of people\ndied right there in that room.\n11-Hiro8.png\n: A bunch of people were...killed in there?\n16-Hina13.png\n: Stop, seriously... I'm gonna throw up...\n18-Kyoko7.png\n: Perhaps that's what was meant by\nthe biggest, most awful, most tragic event in human history\n.\n19-Makoto2.png\n: ...Huh?\n4-Byakuya3.png\n: You're thinking the same thing, then. My theory is the mass murder that took place in that room is the incident said to have happened one year ago.\n5-FlashT.png\n7-FlashB.png\n19-Makoto2.png\n: The awful scene in that room... That was \"The Tragedy\" that happened a year ago?\n21-Byakuya7.png\n: Precisely. The Tragedy is another name for the\ngenocide of the student body of Hope's Peak Academy\n. If that's true...\n22-Byakuya8.png\n: ...that would explain why Hope's Peak was forced to close its doors.\n23-Hiro13.png\n: I mean, I guess that all makes sense, but...it's all just...so awful.\n16-Hina13.png\n: Not just awful... Super awfully awful!\nThey're right--it's beyond awful. It's terrible, tragic...hopeless. But still... How is it not one of us ever heard about something like that happening? Does that mean they really did cover it up...?\n25-BeautifulDeath.png\n2-Narration.png\n: And lastly, we can talk to currently-mute Toko.\n27-Toko5.png\n: ...\n28-Makoto.png\n: Hey, Byakuya...it seems like Toko wants to say something.\n29-Byakuya5.png\n: So? Why are you telling me?\n30-Hiro4.png\n: Well, cuz you told her to zip it or whatever...\n9-Byakuya.png\n: Ah. I'd forgotten about that.\n31-Hiro7.png\n: Jesus, man! I know you like torturing her, but come on!\n21-Byakuya7.png\n: Well, Toko. If you want to envelop us all in your putrid breath, I won't stop you.\n33-Toko10.png\n: Y-You honor me, Master...\n34-Toko11.png\n: And d-don't worry... I took care of the o-odor problem...\n35-Hiro3.png\n: Hahaha, seriously!? You're just gonna take it?\n36-Toko12.png\n: Sh-Shut up! And don't interrupt when M-Mater and me are talking!\n38-Hina2.png\n: ...Okay, so, what did you want to tell us?\n39-Toko.png\n: Well, I was in a\nc-classroom on the 5th floor\n, and s-somehing caught my attention...\n41-Toko2.png\n: It was...th-this.\n19-Makoto2.png\n: A\nknife\n!?\n42-Hina12.png\n: Whoa, that thing is huge! It's like, Rambo size!\n21-Byakuya7.png\n: It's a\nsurvival knife\nof some type...\n19-Makoto2.png\n: But...what was it doing in a classroom?\n27-Toko5.png\n: How would I kn-know...?\n13-Hiro5.png\n: What're you gonna use that knife for...? What're you planning to do to us!?\n27-Toko5.png\n: I'm not g-gonna do anything! I j-just picked it up! I didn't wanna leave a kn-knife just laying around...\n44-Hiro15.png\n: I'd rather have it laying around than in the hands of a serial killer!\n46-Toko17.png\n: D-Don't compare me to...her! I'm n-nothing like her!\n38-Hina2.png\n: Listen, more important... Now that we have the knife, what are we gonna do with it?\n47-Hiro12.png\n: We can't let Toko keep it, that's for sure. We dunno what she might do...\n36-Toko12.png\n: I don't w-want it anyway! It's too dangerous...\n19-Makoto2.png\n: Hmm...so what to do...?\n49-Kyoko.png\n: Why don't you hang on to it, Makoto?\n19-Makoto2.png\n: Huh? Me!?\n35-Hiro3.png\n: Oh yeah, I totally trust Makoto to take care of it!\n50-Hina22.png\n: Then that's that!\n19-Makoto2.png\n: H-Hold on! Don't I get a say!?\n21-Byakuya7.png\n: It just shows how much they trust you. You should do as they ask.\nAre you sure it's trust? I feel like they're just using me...\n41-Toko2.png\n: Okay, s-so here you go, Makoto...\nThey're acting like I already said yes...\n19-Makoto2.png\n: F-Fine...\nI guess there's nothing I can do. I'll just...keep it in my desk drawer for now.\n39-Toko.png\n: Anyway, th-that's all I wanted to say...\n53-Byakuya2.png\n: Hey, Toko.\n54-Toko7.png\n: Ah! D-Do I still have bad b-breath!?\n27-Toko5.png\n: Sorry sorry sorry! I'm sorry it stinks! I'm sorry it stinks! I'm sorry--!\n9-Byakuya.png\n: You made a valuable discovery. Good job.\n54-Toko7.png\n: Huh...? Huh...? Huh...? Did Master just...p-praise me?\n56-Hina5.png\n: Hey, good for you!\n57-Toko9.png\n: Ng...! NgaaAAaAhh! I-I'm dreaming... I must b-be dreaming!\n58-Toko3.png\n: Ahh...that I would ever e-experience such a dream...\n60-Toko14.png\n: Aha... Ahahahahaha! I feel...s-strange...! Ahaha...so strange...! R-Really strange! Oh no...! Aha...hyah...hyeehahaehea!\n61-Hiro14.png\n: Whenever I look at Toko these days, it makes me feel...sad.\n2-Narration.png\n: And that finishes our talks with the others.\n4-Byakuya3.png\n: Well, I think that's all the new information we have for now.\n63-Hiro2.png\n: So? Now what do we do?\n15-Byakuya9.png\n: Well... Starting today, you're all under my command. But before we proceed, I need to figure something out.\n30-Hiro4.png\n: Jeez, how cocky can you be!? You're gonna bust through the ceiling if your head gets any bigger!\n38-Hina2.png\n: So...what is it you wanna figure out?\n65-DespairSyndrome2.png\n21-Byakuya7.png\n:\nKyoko's identity\n...\n28-Makoto.png\n: ...Huh?\n66-Kyoko17.png\n: ...\n12-Hina9.png\n: Kyoko's identity? But Kyoko is...Kyoko...right?\n21-Byakuya7.png\n: Yes, but who *is* she? The rest of us have a clear, definable reason for having been selected to attend Hope's Peak Academy. Hina's the\nUltimate Swimming Pro\n, Hiro's the\nUltimate Clairvoyant\n... Even Makoto is the\nUltimate Lucky Student\n.\nMore unlucky than lucky these days, but...\n21-Byakuya7.png\n: So what about Kyoko? Can anyone tell me what *she* is?\n30-Hiro4.png\n: Now that you mention it...she's never told us.\n38-Hina2.png\n: Well, Kyoko doesn't really like talking about herself anyway, right?\n53-Byakuya2.png\n: It's not a matter of what she likes or doesn't like. This is a matter of trust. Can you trust someone who's unwilling to reveal their true identity?\n21-Byakuya7.png\n: We need to avoid raising any more unnecessary suspicion. So Kyoko, it's time you told us...\n70-BoysLifeofDespair.png\n66-Kyoko17.png\n: ...I can't.\n36-Toko12.png\n: What!? Wh-Why won't you tell us!?\n66-Kyoko17.png\n: I didn't say I \"won't.\" I said\nI can't\n.\n13-Hiro5.png\n: Wh-What do you mean...?\n72-Kyoko2.png\n: Because...I don't remember.\n28-Makoto.png\n: What...?\n72-Kyoko2.png\n: I have no memory of what I am.\n28-Makoto.png\n: You have no memory...? You mean...\n42-Hina12.png\n:\nAmnesia\n...?\n72-Kyoko2.png\n: ...\n29-Byakuya5.png\n: If I thought you had a sense of humor, I'd say you were joking. But if this is a joke, I'm not laughing.\n27-Toko5.png\n: Y-You can't be serious right now, c-can you?\n66-Kyoko17.png\n: I knew you wouldn't believe me. That's why I didn't say anything.\n75-Kyoko13.png\n: But it doesn't matter. Either way, the truth will make itself clear before we're done. So you have no intention of telling us? Then I can no longer stand by and do nothing...\n76-Byakuya4.png\n: So you have no intention of telling us? Then I can no longer stand by and do nothing...\n77-Kyoko15.png\n: What are you going to do? Torture me?\n9-Byakuya.png\n: Nothing so barbaric as that.\n29-Byakuya5.png\n: I will simply...limit your options. I can't allow you to engage in any further suspicious activity.\n18-Kyoko7.png\n: Limit my options...?\n29-Byakuya5.png\n: Give me the key to your room.\n19-Makoto2.png\n: But...if she gives you her room key...!\n42-Hina12.png\n: She can't go to sleep in her room! She'll be breaking a school regulation!\n76-Byakuya4.png\n: And if she doesn't want that, she'll talk. It's easy, all she has to do is tell us about herself.\n19-Makoto2.png\n: Just hold on...! A threat like that...\n18-Kyoko7.png\n: ...Fine. I understand.\n4-Byakuya3.png\n: Good, you're finally in the mood for conversation.\nWithout saying a word, Kyoko walked right up to Byakuya, and...\n...held out her room key to him.\n82-Byakuya12.png\n: You damn fool... Why do you refuse to talk...!?\n66-Kyoko17.png\n: Whether I want to or not, I can't. All I can do is keep telling you that.\n12-Hina9.png\n: M-Maybe she really did lose her memory...\n13-Hiro5.png\n: If you really think about it, it doesn't sound totally impossible. This is the worst school ever, where only the worst stuff happens, right? Amnesia would fit right in.\n75-Kyoko13.png\n: The worst school, where only the worst things happen? Do you really mean that?\n31-Hiro7.png\n: Huh...?\n72-Kyoko2.png\n: Can you really be sure that life here has been filled with\nonly the worst things\n?\n19-Makoto2.png\n: Wh-What do you mean...?\n66-Kyoko17.png\n: ...Perhaps I've said too much.\nKyoko then turned her back on us, and without a word began to walk away.\n29-Byakuya5.png\n: Where do you think you're going?\n83-Kyoko19.png\n: Don't worry. I'm not going to do anything to harm any of you. *leaves*\n65-DespairSyndrome2.png\nThose were her last words as she left. Kyoko's last words... The dining hall was silent. The only sound was the door opening and closing as Kyoko left the room.\n31-Hiro7.png\n: Wh-What's her deal...?\n12-Hina9.png\n: I think you went too far, taking her room key like that...\n58-Toko3.png\n: F-For her, that wasn't far e-enough...!\n60-Toko14.png\n: Or m-maybe she gets off on the attention. I can't believe her, e-enjoying getting yelled at...\n29-Byakuya5.png\n: You're getting noisy again, Toko.\n85-Toko4.png\n: ...\n87-Byakuya6.png\n: Sorry, I can still hear you. The sound of you breathing, of your heart beating...it grates on me.\n30-Hiro4.png\n: Are you telling her to die...? I mean, I know how you feel, but...!\nBut what's Kyoko gonna do now...? Plus, this situation... It's just like before... It's no different from when everyone started accusing Sakura! And I...I'm no different, either. I still can't stop anyone...\n♪\nMusic cuts out.\n♪\n16-Hina13.png\n: KYAAAAAAAHH!\n11-Hiro8.png\n: Uwah!\n13-Hiro5.png\n: Wh-What the hell!? Why're you yelling all of a sudden!?\n89-Hina10.png\n: Cuz...! Cuz! Look!\n91-MrMonokumasLesson.png\n92-Monokuma2.png\n: ...\n11-Hiro8.png\n: I-It's you... How long have you been standing there!?\n93-Monokuma3.png\n: I'm very...very...\n95-Monokuma6.png\n: AAAAANNNGGGRRRYYYYYY!!!\n89-Hina10.png\n: Angry at what...?\n95-Monokuma6.png\n: At the thief! Yes, that's right. I'm very sad to have to tell you,\nthere's a thief\nin your midst!\n31-Hiro7.png\n: What!?\n93-Monokuma3.png\n:\nMyyy PRECIOUUSSS\n! They stole it!\n28-Makoto.png\n: ...Your precious?\n93-Monokuma3.png\n: Your teacher had such faith in you... And this is how you repay me? With betrayal?\n97-Monokuma9.png\n: Reality is filled with so much hardship, isn't it? No wonder people run away into their fantasies...\n12-Hina9.png\n: But...what the heck is your \"precious\"?\n93-Monokuma3.png\n: Shut up! I hope all of you get stuck in a hiring freeze and die penniless on the street! *leaves*\n65-DespairSyndrome2.png\n13-Hiro5.png\n: And he's gone... What the heck was that all about?\n38-Hina2.png\n: He said something about his \"precious\" getting stolen. Does anyone have any idea what that might mean?\n15-Byakuya9.png\n: It likely has something to do with Kyoko.\n28-Makoto.png\n: ...Huh?\n9-Byakuya.png\n: Who else other than her would be willing and able to steal something from Monokuma?\nDid Kyoko really steal something from Monokuma? But if that's true, what was it? And why would she do that?\n100-GoodNight.png\n*Ding dong, bing bong*\n103-MonokumaTV.png\n: Mm, ahem, this is a school announcement. It is now 10 p.m. As such, it is officially\nnighttime\n. Soon the doors to the dining hall will be locked, and entry at that point is strictly prohibited. Okay then...sweet dreams, everyone! Good night, sleep tight, don't let the bed bugs bite...\n12-Hina9.png\n: Uh-oh. We need to get out of here...\n30-Hiro4.png\n: We can talk about this more tomorrow. And about Kyoko...\n9-Byakuya.png\n: However, after what just happened with Monokuma, and Kyoko, I feel like there's...something in the air. I would suggest you take extra precautions tonight. Stay in your rooms, don't go wandering around...\n38-Hina2.png\n: Not like we need you to tell us that...\n105-Byakuya14.png\n: Well then, let's disperse. I'll see you all tomorrow.\nFollowing his lead, each of us went back to our rooms.\n108-WelcometoDespair.png\n28-Makoto.png\n: Ah, that's right. I need to put away the knife that I got from Toko...\n28-Makoto.png\n: I think the safest place for it will be in my\ndesk drawer\n.\nBut anyway...is Kyoko really gonna be okay? She can't get into her room. What's she gonna do...? Isn't there something I can do...? Something I can...\n♪\nMusic fades out.\n♪\n... ... ...\n*Ding dong*\n65-DespairSyndrome2.png\n28-Makoto.png\n: ...Nng?\nAs I opened my eyes, I realized I'd fallen asleep without realizing it. But more important...\n28-Makoto.png\n: Did I hear...the doorbell...?\n49-Kyoko.png\n: ...\n28-Makoto.png\n: K-Kyoko...?\n49-Kyoko.png\n: I'll be waiting for you in the\ndressing room\n... See you there... *leaves*\n28-Makoto.png\n: H-Hey, wait! Kyoko!\nWithout acknowledging me, Kyoko disappeared into the depths of the darkened hallway. I know we're not supposed to go out during nighttime but...\n28-Makoto.png\n: I can't just not go...\n2-DespairSyndrome2.png\n4-Kyoko2.png\n: Sorry for asking you to meet with me so late.\n5-Makoto.png\n: It's okay. I'm used to it.\n4-Kyoko2.png\n: ...Indeed.\n7-Kyoko.png\n: Well then, let me get straight to the point.\n5-Makoto.png\n: It's something you can't talk about in front of the surveillance cameras, right? So does that mean...? Does this have something to do with whatever it is you stole from Monokuma?\n7-Kyoko.png\n: ...\n5-Makoto.png\n: Monokuma told us earlier that someone had stolen something from him. Was it you...?\n8-Kyoko17.png\n: ...That's right.\n5-Makoto.png\n: So I was right... But what did you steal?\n7-Kyoko.png\n: I stole this...\n5-Makoto.png\n: A...\nkey\n?\nBut looking at it, I could tell it wasn't just any key. It was shaped like\nMonokuma\n. It was probably the only key of its kind on Earth.\n5-Makoto.png\n: Where did you get this...?\n11-Kyoko11.png\n: From\nthe headmaster's room\n.\n5-Makoto.png\n: What!? You snuck into the headmaster's room!? But...wasn't it locked?\n11-Kyoko11.png\n: The lock was broken.\n5-Makoto.png\n: What...?\n11-Kyoko11.png\n: It was Sakura. She did it for us...\n5-Makoto.png\n: She did...?\n8-Kyoko17.png\n: Remember what she said in her note? \"\nI'm not going to just lay down and die. I *will* fight you...\n\"\n5-Makoto.png\n: So...Sakura broke into the headmaster's room for us?\n13-Kyoko13.png\n: That's right. So that we could uncover whatever secrets might lay hidden within...\n5-Makoto.png\n: She did that...for us...\nShe violated the school regulations to help us. She'd already decided to die, so her last act was to defy the rules of this place...\n8-Kyoko17.png\n: I noticed the room was open after the class trial was over yesterday. But if I'd just strolled into the room, Monokuma would have noticed right away. Which is why...\n13-Kyoko13.png\n: ...I used you as a decoy.\n5-Makoto.png\n: So you asked me to meet you at the data center in order to...\n7-Kyoko.png\n: Correct. I wanted you to draw Monokuma's attention. I took that opportunity to sneak into the headmaster's room. And as a result, I found this key.\n5-Makoto.png\n: Wow... Then...what you told me about yesterday--did that come from the headmaster's room, too?\n14-FlashT.png\n16-FlashB.png\n17-Kyoko22.png\n: Mukuro Ikusaba... The sixteenth student, lying hidden somewhere in this school... The one they call the Ultimate Despair... Watch out for her.\n5-Makoto.png\n: Did you find out about this\nMukuro Ikusaba\nwhile you were in there?\n11-Kyoko11.png\n: I did find a file in the headmaster's room that talked about her, yes. I don't know all the details yet, but...one thing I do know, is that Mukuro Ikusaba is\ndangerous\n.\n5-Makoto.png\n: D-Dangerous...?\n13-Kyoko13.png\n: She may very well be the mastermind.\n5-Makoto.png\n: M-Mastermind!? But didn't Alter Ego say that the headmaster was probably the mastermind?\n8-Kyoko17.png\n: No...the headmaster isn't the mastermind, I'm sure of that.\n5-Makoto.png\n: What...?\n8-Kyoko17.png\n: I don't have proof yet, but I have no doubt I'm right.\nTo make such a strong statement without proof... That's not like Kyoko at all. But...if it isn't the headmaster...does that mean Mukuro Ikusaba really could be the mastermind?\n13-Kyoko13.png\n: Anyway, this key is the one big opportunity we've been waiting to get our hands on. Now that we've grasped it, we can't let it go, can we?\n5-Makoto.png\n: Sure, but I mean...what's this key even unlock?\n11-Kyoko11.png\n: I don't know yet. Which is why...\n20-NewWorldOrder.png\n21-Kyoko15.png\n: ...I need you to draw Monokuma's attention again, while I go and find out.\n22-Makoto2.png\n: Wait, so you're planning on sneaking back in again? You can't! That's way too dangerous! And you want me to draw his attention, but we don't actually know there's just one mastermind, right? If there's more than one person watching us...\n23-Kyoko12.png\n: But they didn't catch on last night, right?\n22-Makoto2.png\n: Maybe we just got lucky...\n13-Kyoko13.png\n: Or maybe the mastermind can't monitor us and control Monokuma\nat the same time\n.\n22-Makoto2.png\n: ...Huh?\n11-Kyoko11.png\n: Like I said, we didn't get caught last night. But as you said, maybe it was pure luck.\n13-Kyoko13.png\n: Which is why we're going to run the experiment one more time. And if we're successful again...\n21-Kyoko15.png\n: Then what may have just been a lucky guess will be proven true.\nAs Kyoko talked, she was calm and collected as ever. I couldn't help but just stand there and listen.\n13-Kyoko13.png\n: If it's true that the mastermind can't watch us and control Monokuma at the same time, then there would have to be a period of time where the mastermind is vulnerable. What we need to do is find out for sure it if that's actually true, and if we can exploit it.\n22-Makoto2.png\n: Maybe, but... No matter what the reward, the risk is just too high. When I think what might happen if we fail...\n8-Kyoko17.png\n: I don't think you need to worry all that much. After all...\nWith minimal restrictions, you are free to explore Hope's Peak Academy at your discretion.\n21-Kyoko15.png\n: No restrictions have been placed on our efforts to solve the mystery, am I wrong? Even when I took the key, I didn't break any rules as far as I can tell.\n22-Makoto2.png\n: But if the mastermind decides to do something, all the rules in the world won't matter. He could just kill us all without a second thought!\n11-Kyoko11.png\n: I see... In that case, even if the plan fails, we'll still be able to prove or disprove that hypothesis.\n22-Makoto2.png\n: What...?\n11-Kyoko11.png\n: In a moment of crisis, will the mastermind break their own rules, or adhere to them no matter what?\n8-Kyoko17.png\n: In other words, we gain something whether we succeed or not. Now there's no reason not to do it, right?\n22-Makoto2.png\n: B-But--!\n♪\nMusic cuts out.\n♪\n13-Kyoko13.png\n: If you spend all your time trying to avoid danger, you'll never move forward. We know the danger. But if that risk means solving the mystery, we have no choice.\n21-Kyoko15.png\n: Am I wrong?\n26-DeathWishNoIntro.png\nAt that moment, I finally realized...I had never seen the slightest hint of dear or despair in Kyoko's eyes. Her gaze was firmly fixed on the mystery ahead, the enemy standing before us. And with that in view...she just smiled.\n21-Kyoko15.png\n: I can't change how I feel, and wouldn't if I could.\nThen Kyoko took something from her coat pocket and held it out to me.\n22-Makoto2.png\n: Huh? What's this?\n4-Kyoko2.png\n: Consider it a symbol of my determination. Don't open it yet. Only open it...if something ever happens to me.\n22-Makoto2.png\n: I-If something happens!?\n29-Kyoko3.png\n: I'm not planning on dying. But there's always a chance of it, and a death without meaning is...unappealing.\n30-Kyoko7.png\n: Please, I want you to hold on to it for me.\n22-Makoto2.png\n: Fine. I'll hold on to it, just because you asked me to. But I'm gonna give it back at some point, you can be sure of that!\n4-Kyoko2.png\n: Yes...of course.\n13-Kyoko13.png\n: Oh, and one more thing. You can't tell anyone else about what I've discovered.\n22-Makoto2.png\n: Sure, because then there's a chance the mastermind might find out, right?\n11-Kyoko11.png\n: Well...there's that, too.\n22-Makoto2.png\n: Huh...? You mean...there's something else?\n4-Kyoko2.png\n: It's nothing. Forget I said anything.\nI-I can't just forget that easily...\n4-Kyoko2.png\n: Okay then, shall we begin?\n7-Kyoko.png\n: I'm counting on you, Makoto.\n22-Makoto2.png\n: I just have to get Monokuma's attention, right? Well, I'll give it my best shot...\n31-Kyoko19.png\n: I'm going on ahead. The rest is up to you... *leaves*\nHer curt goodbye was no different from any other time. And like every other time, she moved at a brisk pace as she left. What *wasn't* like every other time was the sudden knot I felt in my stomach as I watched her walk away.\n22-Makoto2.png\n: No...everything's gonna be fine, I know it...! Because it's Kyoko...\nTalking to myself helped shake off some of my anxiety...and then I got to work.\n♪\nMusic fades out.\n♪\nOkay...! Let's do this!\n22-Makoto2.png\n: Hey, Monokuma! You can see me, right!? Get out here! I've got a bone to pick with you!\nThen, a few moments later...\n34-MrMonokumasLesson.png\n35-Monokuma.png\n: Well, well, this is a surprise! You being the one to call me out...\n36-Monokuma2.png\n: Hey, by the way!\n22-Makoto2.png\n: H-Huh?\n38-Monokuma7.png\n: What were you and Kyoko up to? Going to the bathhouse? Just the two of you? In the middle of the night? Definitely a hot and steamy moment, wouldn't you say!? So warm and wet, so wet and warm... I bet you guys--[REMOVED TO CONFORM WITH LOCAL AND INTERNATIONAL CENSORSHIP LAWS]--all over her, didn't you!?\n22-Makoto2.png\n: ...\n39-Monokuma8.png\n: Not gonna talk, huh? Sure, I get it... Well, whatever. Unlike you, I have absolutely no interest in late-night bath scenes.\n40-Monokuma10.png\n: Because I like to maintain a healthy life of observation, far away from X-rated X-ploits!\n22-Makoto2.png\n: Oh, so is that why there's no surveillance cameras in the bathhouse?\n38-Monokuma7.png\n: Bull's-eye!\n22-Makoto2.png\n: Or is it maybe cuz the lens gets all fogged up, and you can't see anything anyway?\n35-Monokuma.png\n: ...\n22-Makoto2.png\n: Sounds like *that's* the bull's-eye to me...\n36-Monokuma2.png\n: Anyway! You went to all that trouble to get me out here, now whaddya want!?\n22-Makoto2.png\n: Oh, well...umm... There's just something I wanted to confirm with you.\n42-Monokuma11.png\n: Whether I'm a mademoiselle or a dudefella?\n35-Monokuma.png\n: But in the bear kingdom, there IS no male or female!\n22-Makoto2.png\n: Um...actually, there is...\n38-Monokuma7.png\n: Seriously!?\n44-Monokuma9.png\n: Th-Then...what am I? My entire existence...\n39-Monokuma8.png\n: That's enough! I'll get stuck if I think about it too much. So what did you really wanna ask me?\n22-Makoto2.png\n: Oh, well...you told us earlier that your precious had been stolen. What's this \"precious\" of yours?\n35-Monokuma.png\n: ...\n42-Monokuma11.png\n: Listen...I'm sure this is a silly question, no way it's possible and all, but...is that seriously what you dragged me out here to ask me?\n22-Makoto2.png\n: ...\n36-Monokuma2.png\n: You gotta be kiddin' me! You gotta be 100-megaton freakin' KIDDING me! You're not gonna ask something useful, like how to get the best honey, or ursine breeding tips?\n22-Makoto2.png\n: ...\n36-Monokuma2.png\n: This is just crazy... Are all pubescent teen boys as nutty as you!?\n47-Monokuma6.png\n: God, you're so annoying! Fine, I'll tell you! It was a\nkey\nand\n******\n! That's it!\n22-Makoto2.png\n: What was that second thing...?\n48-Monokuma3.png\n: It's a blank, stupid! A secret! Fill it in yourself! Making me trudge all the way out here for that... I'd like to see what's going on in that brain of yours!\n47-Monokuma6.png\n: And the next time you summon me for something so stupid, I'll open up your skull and find out! *leaves*\n49-Narration.png\n: I think this is probably one of my favorite Monokuma conversations in the whole game.\nDropping more than a few swear words, Monokuma stormed off.\n22-Makoto2.png\n: Whew...\nI hope I kept him distracted long enough... Now all I can do is wait and hope Kyoko makes it out okay. No, she'll be fine. It's Kyoko, after all.\nI went back to my room and laid down, doing my best to settle my nerves and get back to sleep.\n34-MrMonokumasLesson.png\n53-MonokumaTheater.png\n: Monokuma Theater, brought to you by Spike Chunsoft Co., Ltd.\n../Smilies/emot-siren.gif\nClick here for a video?\n../Smilies/emot-siren.gif\n54-MrMonokumaAfterClass.png\n34-MrMonokumasLesson.png\n53-MonokumaTheater.png\n: Hmm? This super stylish, super fashionable game was canceled during development? But it'll start back up again if Danganronpa sells well? Then you guys have to recommend it to your friends too!\n2-GoodMorning.png\n*Ding dong, bing bong*\n5-MonokumaTV.png\n: Good morning, everyone! It is now 7 a.m. and nighttime is officially over! Time to rise and shine! Get ready to greet another beee-yutiful day!\n7-BeautifulMorning.png\n8-Makoto.png\n: ...\nMy body feels so heavy this morning... It must be because I was up so late last night.\n8-Makoto.png\n: Anyway, I need to get to the dining hall...\n12-Byakuya5.png\n: You're one minute late, Makoto. How do you explain this?\n8-Makoto.png\n: S-Sorry. I'm not feeling so great today.\n13-Toko4.png\n: You r-really think a tired excuse like that i-is gonna work?\n14-Hiro12.png\n: Huh? Are you allowed to talk again?\n15-Byakuya.png\n: I don't recall giving you permission...\n16-Toko7.png\n: Huh...? I-I just thought... I mean, since a d-day had passed, it had maybe r-reset...\n18-Toko9.png\n: S-S-S-S-Sorry! Please don't hate me! Whatever my p-punishment is, I'll accept it! I'll hang a s-sign from my neck that says \"Bad Girl\"! I'll clean your bathroom w-with my toothbrush...!\n19-Byakuya15.png\n: If you stop making disgusting comments like that, *maybe* I can forgive you.\n20-Toko10.png\n: Th-Thank you! I won't make any more d-disgusting comments, I promise...! If I do, you can stuff m-my mouth full of trash...\n21-Toko14.png\n: As long as i-it's you and no one else, I d-don't mind...!\n22-Hiro14.png\n: It's no use. She's disgusting to the bone...\n24-Hina2.png\n: Anyway, where's Kyoko? I haven't seen her this morning...\n25-Hiro15.png\n: Not cool! This is worse than being late for lunch, for a date, for your wedding, for anything!\n26-Hina9.png\n: Maybe she's mad about what happened yesterday, and she's not gonna show up anymore...\n8-Makoto.png\n: ...\nI can't tell the others why Kyoko might not be here... The best thing to do right now is just keep quiet.\n19-Byakuya15.png\n: Whatever her reason, I'm curious to know what she *is* doing. I know she's not in her room, so...\n28-Hiro4.png\n: Oh yeah, you still have her key, right?\n30-MrMonokumasLesson.png\n31-Monokuma.png\n: Ah, are you looking for Miss Kirigiri?\n32-Hiro8.png\n: Wgah! What do you want now!?\n33-Monokuma11.png\n: I'm right, right? You're wondering where Miss Kirigiri is, right?\n8-Makoto.png\n: D-Do you know where she is...?\n34-Monokuma7.png\n: Hmm... Well, it's hard to say...\n36-Hiro7.png\n: Huh? You don't know, either!?\n12-Byakuya5.png\n: It's because he doesn't know. That's why he's here--to try and prod us for information.\n31-Monokuma.png\n: Hey, don'tcha hate it when you ask someone what their favorite movie is, and they name some indie bullcrap?\n37-Toko12.png\n: I feel like I'm g-getting whiplash, the way he changed s-subjects like that...\nThank goodness. It looks like Monokuma really didn't notice... So I guess our plan went off just fine last night. Which could mean...\n38-FlashT.png\n40-FlashB.png\n41-DISTRUST.png\n42-Kyoko13.png\n: Maybe the mastermind can't monitor us and control Monokuma\nat the same time\n.\nCould she have been right about that?\n31-Monokuma.png\n: So? Was I right? You're looking for Miss Kirigiri! Any idea where she might have gone...?\n15-Byakuya.png\n: ...We have no idea.\n44-Hina16.png\n: And even if we did know, we wouldn't tell *you*!\n45-Hiro16.png\n: For serious!\n31-Monokuma.png\n: Hmm... I see...\n46-Monokuma9.png\n: Well, fine. Whatever! I don't even care anymore! Sayonara, suckers! *leaves*\nAs soon as he was gone, we all glanced around at each other.\n7-BeautifulMorning.png\n26-Hina9.png\n: So...what was that just now? Does that mean Monokuma doesn't know where she is, either?\n48-Byakuya9.png\n: It would seem that way...\n14-Hiro12.png\n: Where the heck could she have gone...?\n26-Hina9.png\n: Don't you think we should all go look for her?\n15-Byakuya.png\n: And how would you suggest we approach that task? Even Monokuma can't seem to locate her...\n14-Hiro12.png\n: Yeah...how can he not know where she is?\n50-Hina20.png\n: So strange...\n8-Makoto.png\n: ...\nKyoko must have used that key to sneak into some unknown part of the school... But somewhere even Monokuma wouldn't notice? Where could it be...?\nWe spent the rest of breakfast talking about where Kyoko could have gone. Afterwards, we returned to out rooms.\n53-BeautifulDays.png\n8-Makoto.png\n: Whew...\nBreakfast didn't help me feel any more upbeat, that's for sure. I feel like this is more than just me staying up late last night...\n56-Narration.png\n: It's time for more Free Time. We're going to continue with Hiro because he's the only person alive right now whose FTE chain we've begun. He's also usually good for a laugh, something that's in short supply with how few people are still alive.\n14-Hiro12.png\n: Monokuma seems, like...super advanced, right? I think maybe we've been caught in the middle of something terrible...\n58-Hiro5.png\n: A global revolution by the ancient civilization that we've ruined! Their alien technology will destroy us! Or maybe not, I dunno.\nHmm... Should I talk to Hiro while he's acting like this...?\n> Spend some time with Hiro\n60-Hiro2.png\n: Huh? You wanna hang out with me?\n14-Hiro12.png\n: Well then, have I got a story for you! My research revealed a surprising connection between Tokyo Tower and the lost Lemurian civilization!\nHiro spent a lot of time talking about stuff that didn't make any sense to me... Hiro and I grew a little closer today.\n> Yes, definitely\nSacred Tree Sprig:\nThe branch from a sakaki tree, commonly used in Shinto rituals. It serves as a connection between humans and the gods.\n32-Hiro8.png\n: Guwaaah! Such mysterious power... This is a true-blue OOPart!\n36-Hiro7.png\n: Makoto! The dawn of a new era draws near!\nSeeing Hiro so pleased with something I gave him makes me happy!\n65-DespairSyndrome1.png\n60-Hiro2.png\n: Hey, Makoto! Are you familiar with\nKamata\n? It's a tiny little suburb in Tokyo, right!?\n8-Makoto.png\n: Yeah, I've heard of it. What about it?\n14-Hiro12.png\n: Well, don't tell anyone I told you this, but...they appear there.\n8-Makoto.png\n: Huh? What does...?\n58-Hiro5.png\n: UMAs!\nUMAs are...I think...\n56-Narration.png\n: Well crap, I legit had no idea when I recorded this. Time for guessing!\n> Spaceships\n8-Makoto.png\n: You mean spaceships?\n14-Hiro12.png\n: Ugh, no! Those are UFOs, ya dingus! A UMA is basically an animal version of that. I shouldn't have to tell you any more than that, right!?\n56-Narration.png\n: Strike one. I know what it is now, but I couldn't resist:\n>\n../Smilies/emot-thurman.gif\n8-Makoto.png\n: ...Thurman?\n68-Hiro.png\n: ...\n8-Makoto.png\n: ...\n45-Hiro16.png\n: Dumb jokes don't work for you, man! I'M supposed to be the stupid one around here!\nWhat!? Why would you say that about yourself!?\n56-Narration.png\n: Third time's the charm. Maybe I should've failed other multiple choice questions on purpose; that was thoroughly entertaining.\n> Cryptids\n8-Makoto.png\n: You're talking about cryptids, right? \"Unidentified mysterious animals\"...\n70-100MileJunkFoodDash.png\n60-Hiro2.png\n: You got it! And it just so happens they've been appearing in little ol' Kamata!\n8-Makoto.png\n: ...What...kind of cryptids?\n25-Hiro15.png\n: The terrifying\nskyfish\n! In the West, they're usually just called rods. They can fly, and they have a thin body and a big wide fin! They can move their fins in a wave pattern, which lets 'em move faster than the naked eye can see!\n8-Makoto.png\n: ...\n14-Hiro12.png\n: You ever heard of the anomalocaris? Some people think that's what the skyfish evolved from! And some OTHERS think they're an artificial life form, a genetically engineered military superweapon!\n72-Hiro6.png\n: Isn't that scary as hell!?\n8-Makoto.png\n: But...what would they be doing in Tokyo? And in Kamata, no less?\n58-Hiro5.png\n: Nobody knows. But I think they're dangerous. You know how close Kamata is to Haneda Airport, right? I don't wanna wait till it's too late. I've been thinking I should call all the airlines!\n60-Hiro2.png\n: They need to know there's a way to get rid of those damn skyfish. And I know what it is! As long as they can pay my fee, I can keep things safe for them. That's what I'm gonna tell 'em!\n8-Makoto.png\n: I wouldn't do that if I were you. I see a lot of jail time in your future if you do...\nPlus, isn't that like, super occult? I just don't understand...\n56-Narration.png\n: We receive\nSP+1\nfor this event.\n53-BeautifulDays.png\nOnce we were all done, I headed back to my room for a little while...\n75-Makoto2.png\n: Nnn... I feel even worse than I did this morning... My body feels like lead, and...now I'm getting chills.\nThis is bad. I think I might be getting sick...\n56-Narration.png\n: Next time, we do another Free Time Event.\n2-BeautifulDays.png\n3-Narration.png\n: One more Free Time, one more conversation with Hiro.\n5-Hiro16.png\n: A certain organization is behind all of this, I'm finally sure of it...! But I can't say their name, cuz as soon as you do, they come and...get rid of you. Kurt Cobain said their name. John Lennon said their name!\n6-Hiro6.png\n: They're bad...so bad...really really bad!\nHmm... Should I spend time with Hiro while he's in this kind of mood?\n> Spend some time with Hiro\n9-Hiro2.png\n: Well then, why don't we have a heated discussion about cosmogony!\nI learned all about Hiro's theories on the origin of the universe... Hiro and I grew a little closer today.\n> Yes, definitely\nMeteorite Arrowhead:\nAn arrowhead discovered in some ancient ruins. Fashioned from a meteorite, they say that getting pierced by it will give you the power to see demons.\n12-Hiro8.png\n: Guwaaah! Such mysterious power... This is a true-blue OOPart!\n13-Hiro7.png\n: Makoto! The dawn of a new era draws near!\nSeeing Hiro so pleased with something I gave him makes me happy!\n15-100MileJunkFoodDash.png\n16-Hiro.png\n: I'm surprised how well you and me get along, Makoto! Seems like we hang out all the time these days.\n17-Makoto.png\n: Is...that a bad thing?\n18-Hiro12.png\n: Oh, no, not at all! And since we're such good friends, can I ask you something...?\n20-Hiro3.png\n: Wait! I totally realized something just now, completely out of nowhere!\nI feel like I'm about to see the performance of a lifetime...\n9-Hiro2.png\n: Say, Makoto... Have you been feeling down in the dumps? No energy, no spark?\n17-Makoto.png\n: Huh? You think so...?\n16-Hiro.png\n: Oh, you don't have to hide it from me. I know what it's like, I've been there! And you know what I'd recommend?\n9-Hiro2.png\n: This!\n17-Makoto.png\n: What is it...?\n16-Hiro.png\n: A\ncrystal ball\n!\n17-Makoto.png\n: Okay...and?\n9-Hiro2.png\n: Just hold on to it for a second! Here, here!\nCompletely against my will, Hiro shoved the crystal ball into my hands.\n16-Hiro.png\n: Whaddya think? Nice and cool to the touch. Feels good, doesn't it?\n17-Makoto.png\n: A-Actually...yeah.\n9-Hiro2.png\n: You can feel it's power, can't you?\n17-Makoto.png\n: Hmm...*do* I feel it...?\n23-Hiro15.png\n: It's the ancient power of our timeless Mother Earth!\n17-Makoto.png\n: ...\n18-Hiro12.png\n: You see, that crystal ball has quite the history... It was found in the ruins of Atlantis! It is literally a priceless one-of-a-kind artifact! This precious item grants enormous power to whoever holds it, bringing prosperity and peace of mind! This very ball has known the touch of Napoleon, George Washington, even Genghis Khan!\nI think that's probably the single most unbelievably unbelievable thing I've ever heard...\n9-Hiro2.png\n: Well, I'd like to give it to you as a present! In return, I'd like you to come with me to a little\nseminar\nwhen we get out of here. And don't worry! I'll see about getting a discount on your entry fee. Cuz that's what friends so!\n17-Makoto.png\n: Th-That's really nice of you and all, but I'm not sure I'm really interested...\n23-Hiro15.png\n: Sorry! The crystal ball has already acknowledged you as its proper owner! It wants to stay with you. It NEEDS to stay with you! It has given itself to you! So now you gotta keep your promise! You don't wanna know what that thing does to oath breakers...\n20-Hiro3.png\n: Okay, I'm countin' on ya, pal! *leaves*\n2-BeautifulDays.png\nRefusing to take back the crystal ball, Hiro hurried away... But I could hear him mumbling to himself, and caught something about \"\nfinally made my quota\n\"...\n17-Makoto.png\n: I really hope I heard him wrong...\n3-Narration.png\n: This unlocks the skill\nCrystal Prediction\n.\nI decided to go back to my room for a while...\n-----\n3-Narration.png\n: Before we continue, I need to bring something up. Normally, I wouldn't do this, but the following scene is pretty weird and I don't believe there's a good way for me to get it across with pictures alone. Because of that, I'm going to provide a video of the scene up to but not including the Monokuma Theater. That's not the end of the update so please come back to read the rest of it when you finish watching.\n3-Narration.png\n: A quick apology though, this footage is from my recording raws and as such contains all my screenshot gathering. This means you'll see the text and HUD turn off multiple times through it since those are the cues I give myself to take screenshots later. If you don't mind that and are curious to see what the scene looks like ingame, please give it a watch because this is gonna get strange.\n../Smilies/emot-siren.gif\nClick here for the video\n../Smilies/emot-siren.gif\n27-DespairSyndrome1.png\n28-Makoto2.png\n: Grh...I'm getting the chills...\nI feel kinda...dizzy...\n28-Makoto2.png\n: ...I can't help it... I need sleep...\nNighttime wasn't for a while, but...I felt like my body had reached its limit... As I dropped onto my bed, I felt like I was falling into a bottomless pit.\nI was unconscious before my head hit the pillow. Well, that's not quite true. I didn't pass out completely. It was more like...my consciousness went dim. I weaved back and forth between sleep and wakefulness. Which is all to say...\n...I was restless.\n30-Makoto4.png\n: Gh...nn... Nnngg...\nAt some point, I found myself wandering through a strange dream.\nAnd within the dream, a voice echoed across the walls of my mind.\n???: ...\n???: I under...\n???: Understand...\nThat voice... It's so familiar... Ah--! It's...!\n???: I...understand...\nIt's...me...\n32-AllStarApologies.png\n33-Makoto6.png\n: I...understand... I should...understand everything. My goal isn't to get out of here... It's...to stay here.\n...Huh? What am I trying to say...?\n33-Makoto6.png\n: Hope... This is all...for hope. And that's why... I have to stay... I have...to stay here.\n♪\nMusic cuts out.\n♪\n34-Flashback.png\n36-Makoto5.png\n: Ah--grh! My dream just now... What...? So strange... ...Huh?\n39-ToSurvive.png\n40-Makoto7.png\n: ...! Gh--! Gwaaaaaaahh!\n*whish*\n*smash*\n*footsteps running away*\n*Pant...*\n*Pant...pant...*\n*Pant...pant...pant...*\n27-DespairSyndrome1.png\n40-Makoto7.png\n: Nn...? Kyoko...?\n42-Kyoko21.png\n: ... ... ...\n42-Kyoko21.png\n: ... ... ...\n40-Makoto7.png\n: What the...? What did you...?\n42-Kyoko21.png\n: ...\n42-Kyoko21.png\n: ... ... ...\n40-Makoto7.png\n: What did you...say?\n40-Makoto7.png\n: ... ... ... ... ... ... ... ... ... ... ... ... ...\n40-Makoto7.png\n: ... ... ... ... ... ... ... ... ... ... ... ... ...\n44-MrMonokumasLesson.png\n46-MonokumaTheater.png\n: Every day is peaceful. Every day is joyful. Happy days from the time you take up to the time you go to sleep. Wishing only for those unchanging, unending happy days, day of boredom repeating forever and ever. No abnormalities as far as the eye can see. Life without the tiniest speck of abnormality... If the world were like that, I'd consider *that* pretty damn abnormal.\n*Ding dong, bing bong*\n48-GoodMorning.png\n51-MonokumaTV.png\n: Good morning, everyone! It is now 7 a.m. and nighttime is officially over! Time to rise and shine! Get ready to greet another beee-yutiful day!\n28-Makoto2.png\n: ... ...Grn...\n53-DespairSyndrome2.png\nIt took longer than usual for me to open my eyes.\n28-Makoto2.png\n: ... Haa...\nI let out a deep sigh to bring myself up the rest of the way. The chills, the aches, the unfathomable lethargy--they had all disappeared in the night. All that was left was me, drenched in sweat... It wasn't just because of whatever bug I'd caught, either. It was also...\n28-Makoto2.png\n: ...\nthe dream I'd had\n.\nWhat the hell was that...? I mean...was it ever really a dream? I was desperate to recall it. I scrambled to grab onto fragments of the dream and reel them up from the depths of my memory. That's right. I remember last night...\n54-FlashT.png\n56-FlashB.png\n...I came down with a fever, and couldn't quite get to sleep.\n54-FlashT.png\n56-FlashB.png\nAnd I...I heard a voice... I didn't really understand... And then...\n54-FlashT.png\n56-FlashB.png\nAll of a sudden, I was awake.\n54-FlashT.png\n56-FlashB.png\nAnd there was a strange person standing next to my bed, wearing a...mask. And...they were\nholding a knife\n.\nI want to say I fought them off, but...I don't actually remember. I felt like my mind had been detached from my body, burning up with fever. I was somewhere far away, watching my body move on its own. And because of that...I don't remember what really happened. But still... I feel like I resisted them desperately, feverishly.... After that, things go black again. The next thing I remember...\n54-FlashT.png\n56-FlashB.png\n...Kyoko was there. But...what would she have been doing in my room?\n28-Makoto2.png\n: What a strange dream.\nNo... Was it really a dream? How can I possibly find out either way...?\n3-Narration.png\n: That knife looked familiar...\nI opened the desk drawer, and...\n64-DISTRUST.png\n28-Makoto2.png\n: Huh...?\nIt's empty. There's nothing inside...\n28-Makoto2.png\n: Wait, nothing inside? That's...strange.\nBecause it definitely wasn't before. I'm positive I put the\nknife\nI got from Toko in here.\n28-Makoto2.png\n: Wait, that means...\n54-FlashT.png\n56-FlashB.png\nThe knife they told me to keep safe...!\nI knew it... I just had a feeling... It\nwasn't a dream\n, after all! But if that's true, this all makes even less sense... Why would someone have wanted to attack me? And who was that behind the mask? And why was Kyoko...?\n28-Makoto2.png\n: What the hell is going on...? ...\nWell, I don't think I'm gonna figure it out on my own.\n28-Makoto2.png\n: I should head to the\ndining hall\n. Then I can talk to everyone else about it...\n3-Narration.png\n: See you next time.\n2-BeautifulMorning.png\n4-Hina21.png\n: Ah, Makoto! Yup, that's Makoto, sure as the sky's blue!\n5-Makoto.png\n: Hey, Hina...\n6-Hina2.png\n: You really had me worried, ya know? What happened to you last night?\n5-Makoto.png\n: Worried...?\n6-Hina2.png\n: Yeah, right after nighttime hit, we all went to get you. We were hammering away at your doorbell, but you never answered. We thought maybe you'd been...you know...\n8-Hina6.png\n: I mean, not that that'd actually happen! I mean, nobody here would wanna--you know! So anyway...what were you doing?\n5-Makoto.png\n: I didn't feel good, so I went right to bed. I had no idea you guys even showed up... But why did you come to get me? Did something happen?\n9-Hina20.png\n: Umm...well, lots of stuff, actually. I'm not sure I can really explain...\n4-Hina21.png\n: Let's go meet up with\n[everyone else]\n, then they can tell you all about it!\n> everyone else\n5-Makoto.png\n: So...is everyone waiting somewhere else or something?\n11-Hina22.png\n: Oh, yeah! We all stayed up the whole night!\n5-Makoto.png\n: The whole night...!?\n8-Hina6.png\n: I lost at rock-paper-scissors so I had to come get breakfast for everyone...\n11-Hina22.png\n: So you got here just in time! C'mon, help me carry it.\n5-Makoto.png\n: O-Okay, sure...\n12-Hina5.png\n: Everyone's in the\ngym\n. Hurry up, I'll meet you there!\nThe gym...? Why's everyone in the gym?\n5-Makoto.png\n: And...the entire night?\n15-DespairSyndrome2.png\n4-Hina21.png\n: Ah, there he is!\n17-Hiro2.png\n: This is worse than being late for your wedding, the birth of your son, and your own funeral, all at once!\n18-Byakuya15.png\n: Jeez. To show up now, like it's no big deal...\n19-Toko12.png\n: You made us s-stay up all night, while you slept like a b-baby in your bed...?\nJust like Hina said, everyone was there. Besides Kyoko... And then I noticed... They'd formed a circle around...\nsomething\n. As soon as I saw what that \"something\" was...\n20-Makoto2.png\n: What the--!?\nBefore I could catch myself, I'd cried out.\n22-BoysLifeofDespair.png\nSpread out in front of them...were the remains of Monokuma\n.\n20-Makoto2.png\n: Wh-What are you doing?\n23-Hiro20.png\n: What does it look like? We're dismantling it to see what makes it tick.\n20-Makoto2.png\n: Dismantling!? But I mean...that's Monokuma you're messing with, right!?\n24-Hina30.png\n: Yeah, that's right.\n20-Makoto2.png\n: She's not even fazed...!\n26-Byakuya.png\n: Relax. There's no danger.\n20-Makoto2.png\n: You say that, but...\nWhat is this!? What are you guys doing!?\n20-Makoto2.png\n: Seriously, what are you thinking!? How can you say tearing apart something like that isn't dangerous?\n6-Hina2.png\n: It isn't! What do you want us to say?\n28-Hiro12.png\n: Well, I guess I'll handle this. I'll explain what's goin' on, Makoto. Cuz that's how much I like ya!\n17-Hiro2.png\n: Byakuya found this li'l fella layin' around, then we tore it apart!\n20-Makoto2.png\n: That doesn't explain anything...\n30-Byakuya7.png\n: Just before we went to bed last night, I came to the gym to try and talk to Monokuma. I wanted to see if he had any new information about Kyoko's disappearance. And I found him here, just like normal. However...when I found him, he was no more than a regular toy. He didn't react, didn't say a word.\n20-Makoto2.png\n: You're saying...he wasn't moving at all?\n31-Byakuya9.png\n: I waited there until nighttime officially began, but still Monokuma laid there motionless. I gathered everyone up as quickly as possible so they could take a look. Even then, he still didn't make a move. So I immediately initiated the disassembly process.\n32-Toko3.png\n: It was Master's s-stroke of genius. A chance to find out what m-made Monokuma tick...\n26-Byakuya.png\n: One thing we discovered is that he's quite a\nsophisticated machine\n. It's leagues beyond any normal remote-control toy. Who has enough free time to invest in something like that, anyway...?\n20-Makoto2.png\n: B-But besides that, what I'm wondering is...why did he stop moving all of a sudden?\n31-Byakuya9.png\n: I thought maybe he'd malfunctioned, but we didn't find any cause as we were taking him apart.\n20-Makoto2.png\n: So if he didn't break down...\n31-Byakuya9.png\n: Then maybe something happened to his puppeteer, the mastermind. Something unexpected. I can't imagine any other possibility.\n20-Makoto2.png\n: Something...unexpected?\n32-Toko3.png\n: They were probably so s-scared of Master, they ran away in t-terror...\n4-Hina21.png\n: Or maybe they got sick or something?\n20-Makoto2.png\n: But Monokuma made his announcement this morning, right? Who was that, if not the mastermind?\n26-Byakuya.png\n: Oh, I'm sure that's a recording. It's set to a timer, and plays as necessary.\n9-Hina20.png\n: That's true. He says the exact same thing every day, right?\n28-Hiro12.png\n: Hey, guys? I don't think now's a good time for light conversation...\n♪\nMusic cuts out.\n♪\n28-Hiro12.png\n: I just found something. What is it...?\n20-Makoto2.png\n: I-It's...!\n36-Hiro4.png\n: It's what?\n37-Byakuya3.png\n: A\nbomb\n. There's some installed in every Monokuma robot, I'm sure.\n39-ToSurvive.png\n40-Hiro8.png\n: A b-b-b-bomb!?\n41-Hina12.png\n: That's super bad! We need to get rid of it!\n42-Hiro5.png\n: Roger that!\n37-Byakuya3.png\n: It appears the bomb has a\nmotion sensor\n. Any sudden movements, it's sure to go off.\n43-Hiro6.png\n: M-Motion sensor!? For serious!? Agh...I'm starting to get all shaky...!\n44-Hina15.png\n: Hey! Get it together! You're a man, aren't ya!?\n43-Hiro6.png\n: I-I'm fine! I'm totally fine! Ah, ah, ah!\n41-Hina12.png\n: You're so NOT fine! You're all \"ah ah ah\"!\n♪\nMusic fades out.\n♪\n26-Byakuya.png\n: Oh, I probably should have mentioned. The motion sensor is off right now.\n45-Hiro3.png\n: Ha-ha-ha-ha! Jeez, don't scare me like that!\n47-BeautifulDeath.png\n48-Hina19.png\n: God, you're like the world's most spineless worm of the century!\n40-Hiro8.png\n: Hey, come on! The century's just getting started! Don't call the race already...\n49-Toko4.png\n: Whatever... Just h-hurry up and put the bomb down. Hanging onto it's not g-gonna do anyone any good...\n36-Hiro4.png\n: Oh yeah, good call.\n*thunk*\n17-Hiro2.png\n: Okay, it's down! Everything's all good!\nHiro put the bomb down, but that wasn't my main concern at that point.\nMy eyes were glued to Monokuma's remains... He'd just stopped moving all of a sudden. Was it really because something had happened to the mastermind that they weren't expecting...? But what could that have been? When I thought about it...\n52-FlashT.png\n54-FlashB.png\n...I couldn't help but think back to the night before. Being attacked by that masked figure...\n11-Hina22.png\n: Hey, uh...Makoto?\n20-Makoto2.png\n: Huh?\n36-Hiro4.png\n: Don't \"huh\" us! Did you hear a thing we just said!?\n20-Makoto2.png\n: ...Huh?\n57-Toko5.png\n: So that's a n-no. What are you, some k-king of brain-dead farm animal...?\n20-Makoto2.png\n: S-Sorry...\n6-Hina2.png\n: We were just saying, since we're done dismantling Monokuma, what should we do now?\n22-BoysLifeofDespair.png\n30-Byakuya7.png\n: And we've decided to continue our offensive assault.\n59-Byakuya8.png\n: To try and uncover the mastermind's true identity, we're going to break into the\nheadmaster's room\n.\n20-Makoto2.png\n: R-Really...?\n30-Byakuya7.png\n: Since the mastermind appears to have stopped all activity, now's our chance. Wouldn't you agree?\n20-Makoto2.png\n: B-But...if the mastermind comes back while we're in there...\n61-Byakuya5.png\n: If you're scared, you're welcome to stay here by yourself.\n62-Toko13.png\n: Or go l-live in the chicken coop, with all the other chickens. You can be chicken number s-six...\n61-Byakuya5.png\n: This is a battle, a fight to the death between us and the mastermind. We don't have time to deliberate.\n63-Hina9.png\n: Yeah. I mean, I don't wanna hafta kill each other, or anyone else. But we have a chance now...\n65-Byakuya4.png\n: So? What are you going to do? Are you going to run away, or are you going to fight?\n20-Makoto2.png\n: ...You're right. I'll go with you.\n30-Byakuya7.png\n: Okay then. We're going to break into the headmaster's room. Everything comes down to this moment. Anything can happen, so prepare yourselves.\n66-Toko11.png\n: I'll follow you a-anywhere, Master! To all the ends of the E-Earth!\n67-Hina16.png\n: Sakura...if you can hear me, lend me your strength...\n68-Hiro16.png\n: I can do this... I'm a man, and I can do this! I've got the will of the entire universe on my side!\nWe each found determination in our own ways, and when we were ready, we left the gym. Our target was the headmaster's room, on the 4th floor of the school.\n2-DespairSyndrome1.png\n3-Narration.png\n: The others are out in the hall as you approach the headmaster's office.\n5-Toko11.png\n: Naturally Master's the o-one to show such bravery...\n6-Toko.png\n: Just make sure you don't get in his way.\n8-Hina22.png\n: Sakura's gonna be watching over us... So we're definitely gonna find something to help us bring this to an end!\n10-Hiro2.png\n: We've finally reached the climax!\n11-Hiro13.png\n: So let's hurry up and finish it, before the mastermind catches us all!\n13-Byakuya5.png\n: This is where we expose every last detail of the mastermind. Is everyone ready?\n*Rattle rattle*\n17-DespairSyndrome2.png\n18-Byakuya3.png\n: It's locked. As expected.\n19-Makoto2.png\n: So...what are you gonna do?\n20-Byakuya2.png\n: Isn't it obvious? We're going to tear this door off its hinges.\n21-Hina9.png\n: Wait, but...the rules say--\n22-Byakuya.png\n: We've seen that the mastermind isn't watching us. Those don't matter anymore.\n23-Hiro4.png\n: But like Makoto said... If the mastermind did show up while we were in there...\n20-Byakuya2.png\n: Then we'll just have to finish our business before that can happen.\n23-Hiro4.png\n: Okay, sure...but...\n20-Byakuya2.png\n: We've come this far, we can't back down now. We agreed this is what we have to do. So we have to do it.\n5-Toko11.png\n: S-So beautiful...!\n23-Hiro4.png\n: For serious...?\n26-Hina16.png\n: We don't have any choice... We're desperate!\n27-Hina15.png\n: Let's do it! Let's rip this door down!\n28-Hiro12.png\n: Okay, but...how are we gonna do that? This thing looks pretty sturdy...\n29-Byakuya9.png\n: Then we'll need something sturdy of our own.\n19-Makoto2.png\n: Oh...what about that one thing?\n30-FlashT.png\n32-FlashB.png\n19-Makoto2.png\n: The thing in the toolshed...\n10-Hiro2.png\n: Oh yeah! The\npickaxe\n!\n29-Byakuya9.png\n: Interesting. That could very well be exactly what we need.\n22-Byakuya.png\n: Now then... Toko, what time is it?\n34-Toko2.png\n: W-Well, when we left the gym, it was j-just before 9 o'clock. So it's probably 9 on the d-dot now...\n20-Byakuya2.png\n: Okay. Go get the pickaxe and be back here by 9:01.\n35-Hiro8.png\n: That's straight-up unreasonable!\n37-Toko7.png\n: I-I-I...! By m-myself...?\n22-Byakuya.png\n: Surely you like to have your me-time once in a while, right?\n38-Toko10.png\n: W-Well...if it's me-and-you-time, Master, then y-yeah...\n39-Byakuya7.png\n: You know how much time it took you to say that? Then seconds. Take too long, and I'll erase your existence from my consciousness.\n40-Toko8.png\n: UnacceptabbbbbbllllLLLLLLEEEEEEE!!! *runs off*\nWith that, Toko ran off, loud as a herd of rabid elephants.\n42-Hiro5.png\n: For serious, though...are we just gonna knock this door down?\n22-Byakuya.png\n: No problem is solved by running away. Find your stones and be a man.\nHe's right... You can't move forward by always avoiding danger...\n30-FlashT.png\n32-FlashB.png\n44-Kyoko13.png\n: If you spend all your time trying to avoid danger, you'll never move forward. We know the danger. But if that risk means solving the mystery, we have no choice.\n45-Kyoko15.png\n: Am I wrong?\nEven if it's dangerous, we have to overcome the challenges in front of us...!\n42-Hiro5.png\n: Maybe, b-but I'm still super stressed... I'm so tense, I can hardly talk... I'm all flubbust--no... I'm totally flabbag--flapstaf--\n48-100MileJunkFoodDash.png\n49-Jill5.png\n: Fapsauce!?\n35-Hiro8.png\n: Gross! Where'd that come from! Wait, Genocide Jill? Where'd YOU come from!?\n50-Jill12.png\n: Hello hello! It's the wondiferous, murdiferous fiend, here to greet you with a razor-sharp smile!\n51-Jill3.png\n: Kyeeehahahaha!\n53-Byakuya6.png\n: What about the pickaxe? Where is it?\n54-Jill10.png\n: I was supposed to pick an axe...?\n53-Byakuya6.png\n: No, you seeping imbecile. The *pickaxe*...\n55-Jill6.png\n: S-Seeping imbecile!? Oh, Master! You wound me with your executive-level barbs!\n51-Jill3.png\n: Bushwah! Here comes the bloody nose!\n57-Hina2.png\n: Seriously, though...did you really forget the pickaxe?\n58-Hiro15.png\n: Omega-3 fatty acids, that's what you need! Great for the ol' memory factory!\n19-Makoto2.png\n: But I think we already established that their memory doesn't carry over when they switch...\n59-Byakuya15.png\n: This is a level of uselessness I find difficult to tolerate...\n61-Jill.png\n: Ah! The light bulb just went on!\n62-Jill9.png\n: That's why I went to the garden, right!? I was supposed to get the pickaxe!\n63-Jill2.png\n: Alright, we've solved one mystery! That means there's just\none more mystery left\n!\n19-Makoto2.png\n: One more mystery...?\n65-Jill7.png\n: Yup! Now we just need to figure out the identity of\nObject X\n!\n21-Hina9.png\n: Now what are you talking about...?\n66-Hiro14.png\n: Did you already forget what we were talking about? You're like, missing out on life...\n67-Jill8.png\n: I'm not missing out on life! In fact, I found one in the garden!\n19-Makoto2.png\n: What...? What did you find?\n♪\nMusic cuts out.\n♪\n63-Jill2.png\n: Kuh...oar...puss...\n69-BoysLifeofDespair.png\n67-Jill8.png\n: Didja hear me!? I said corpse!\n19-Makoto2.png\n: A corpse...!?\n61-Jill.png\n: That's right! I found a corpse in the garden!\nYou found a corpse...in the garden...?\n71-Byakuya12.png\n: Well then. Before we enter the headmaster's room, it appears we have something else to look into.\n53-Byakuya6.png\n: We're going to the garden.\n19-Makoto2.png\n: O-Okay...!\nAs soon as we entered the garden...I saw it. I didn't want to, but...\n../Smilies/emot-siren.gif\nCLICK HERE FOR VIDEO\n../Smilies/emot-siren.gif\n74-ToSurvive.png\n...I saw someone laying on the ground, with\na mask covering their face\n... And there was a knife...buried in their stomach, up to the hilt.\n19-Makoto2.png\n: Wh-What the...!?\n75-Hina13.png\n: A-Are they really dead!?\n76-Hiro6.png\n: For sure. But...\n71-Byakuya12.png\n: Who...is it?\n2-ToSurvive.png\nJust to make things clear...\nLast night, I was attacked by\nsomeone wearing a mask\n... And whoever that was--now they're...\nI don't know why, but now they're laying dead in front of me...\n6-Jill3.png\n: Kyeeehahaha! I told ya, there's a corpse hangin' out here!\n7-Hina13.png\n: Are they really...dead? Is this really a dead body...?\n8-Byakuya6.png\n: You need to begin looking around right away. However... Be ever so careful. There's no telling what you might find.\n9-Makoto2.png\n: ...\n11-DespairSyndrome2.png\nWe need to find out who this actually is... But there's no way to tell with the mask covering their face like that. And the\nwhite coat\nthey're wearing makes it impossible to tell anything about the body itself. The victim is a total mystery... But one thing I *do* know...\n...is that whoever this is, they attacked me last night in my room. But why...? How did they wind up dead in here!?\n14-Byakuya9.png\n: Their heart isn't beating, they're not breathing, all signs of life have come to a complete stop... Thanks to the\nknife\nthat's been driven into their stomach, their clothes are stained a bright red. It appears the bleeding has stopped, but the blood that's there is\nstill wet\n. Be careful you don't touch it and get some on you...\n15-Hiro5.png\n: How can you be so calm at a time like this? Who *is* it!? Their face and body are all hidden, so I don't have a clue...\n17-Hina9.png\n: I'm pretty sure it's a\ngirl\nat least...\n18-Hiro7.png\n: Huh? How can you tell?\n19-Hina2.png\n: Well...I think I see the outline of her chest. And just the general shape of the body... Yeah, the more I look, the more I'm sure it's a girl.\nReally? Then it could be--!\n6-Jill3.png\n: Kyeeehahaha! Okay then!\n21-Jill7.png\n: Let's just tear the mask clean off!\n22-Byakuya12.png\n: Wait, don't--!\nBut by the time he called out, it was already too late. Toko's hand shot out toward the mask. And in the next instant...\n*KABOOOOOOM*\n2-ToSurvive.png\n...there was a blinding light, and a deafening roar. The body...blew up. It blew up it blew up it blew up it blew up it blew up it blew up it blew up it blew up!\nMy vision started to darken. I prepared to pass out. But then...\n25-Byakuya5.png\n: Hurry up, put out the fire.\nAs my consciousness attempted to float away, that voice reached up and pulled it back down to Earth. Someone pressed something into my hands. It was...a bucket of water.\n27-Byakuya21.png\n: Come on, dump the water on it.\n28-Makoto10.png\n: O-Okay!\nThe upper half of the body was on fire. I took aim and tossed the water as hard as I could.\n*SPLOOSH*\nThankfully, that was enough to put out the fire. It died down, leaving behind only the unpleasant smell of burning...\n31-BoysLifeofDespair.png\n9-Makoto2.png\n: I-I guess that took care of it...\n33-Hiro6.png\n: But what the hell, man?\n34-Hina10.png\n: It...exploded?\n22-Byakuya12.png\n: I...had a bad feeling about that body. But I never imagined it would explode... And now the body...\n33-Hiro6.png\n: It's\nburnt to a crisp\n! That's beyond well done, man!\n7-Hina13.png\n: Don't compare it to a steak! I'll never be able to eat steak again...\n9-Makoto2.png\n: But now that the body's charred, I really have no idea... How are we gonna find out who it was...?\n36-Byakuya4.png\n: Who isn't here right now?\n9-Makoto2.png\n: ...Huh?\n36-Byakuya4.png\n: If we consider who's not here, that will quickly narrow down who it must be.\n17-Hina9.png\n: There's only one person missing...\n15-Hiro5.png\n: It's...Kyoko.\n9-Makoto2.png\n: K-Kyoko!?\nThen that dead body...is Kyoko? No! That can't be right!\n39-Byakuya.png\n: Calm down. I didn't say it was Kyoko.\n15-Hiro5.png\n: But, I mean...who else...?\n40-Byakuya3.png\n: There *is* one other person.\n42-MrMonokumaAfterClass.png\n43-Byakuya8.png\n: The mastermind...\n44-Hina12.png\n: What!?\n45-Hiro8.png\n: Th-The mastermind!?\n46-Hiro16.png\n: Come on, there's no way! The MASTERMIND got char-broiled!? Get serious!\n39-Byakuya.png\n: I agree, normally the idea wouldn't be worth considering.\n47-Byakuya2.png\n: But I have reason to believe it may be true.\n48-FlashT.png\n50-FlashB.png\n47-Byakuya2.png\n: The mastermind being dead would explain that other matter, wouldn't it? Monokuma can hardly move around if its master is dead, right?\n15-Hiro5.png\n: B-But...that corpse is a girl, right? It doesn't make any sense! I mean, remember what Alter Ego said?\n48-FlashT.png\n50-FlashB.png\n52-AlterEgo5.png\n: So that same person may very well be the mastermind who planned all this out. And according to the files, the headmaster is\na man in his late thirties\n. It seems possible, even likely, that he's\nsomewhere in this school\nright now.\n♪\nMusic fades out.\n♪\n15-Hiro5.png\n: He said the mastermind is some\nmiddle-aged dude\n, right? Which the corpse obviously isn't! Then could that mean...the mastermind *isn't* the headmaster...?\n9-Makoto2.png\n: Is it the teenage girl Kyoko told me about? The Ultimate Despair...?\n55-NewWorldOrder.png\n18-Hiro7.png\n: Huh...?\n9-Makoto2.png\n: Mukuro Ikusaba...the sixteenth student at Hope's Peak...\n22-Byakuya12.png\n: ...What are you talking about?\n9-Makoto2.png\n: The other day, Kyoko confided in me... She said there was a sixteenth student here in the school.\n25-Byakuya5.png\n: I think you'd better tell us everything you know.\n9-Makoto2.png\n: W-Well, all Kyoko told me was...\n48-FlashT.png\n50-FlashB.png\n58-Kyoko22.png\n: Mukuro Ikusaba... The sixteenth student, lying hidden somewhere in this school... The one they call the Ultimate Despair... Watch out for her.\n9-Makoto2.png\n:\nIt sounded like Kyoko thinks\nMukuro Ikusaba\nis the mastermind.\n48-FlashT.png\n50-FlashB.png\n60-Kyoko17.png\n: No...the headmaster isn't the mastermind, I'm sure of that.\n61-Makoto.png\n: What...?\n60-Kyoko17.png\n: I don't have proof yet, but I have no doubt I'm right.\n63-Byakuya10.png\n: There's another student here, and it's a female? That *would* match the body's characteristic...\n17-Hina9.png\n: And that phrase,\nthe Ultimate Despair\n--it sounds super mastermind-y, doesn't it?\n64-Hiro4.png\n: Okay, so...the mastermind is this girl Mukuro? And she's a student here? And she's the Ultimate Despair? But if she's been hiding here in the school like some teenage Bigfoot...how'd she wind up burnt to a crisp!?\n46-Hiro16.png\n: None of this makes any sense! To just suddenly show up and then die!?\n65-Byakuya7.png\n: I think we'd better take a closer look at the body. There may be some clues to help us figure out exactly who it is.\n♪\nMusic cuts out.\n♪\n34-Hina10.png\n: Ah! Hey, wait!\n25-Byakuya5.png\n: ...What?\n34-Hina10.png\n: A-Aren't we forgetting something? You know...Toko?\n45-Hiro8.png\n: Oh yeah! She got totally blown up, huh!?\n65-Byakuya7.png\n: Forget about her. I'm sure the explosion vaporized her.\n68-100MileJunkFoodDash.png\n69-Toko15.png\n: Nn...gh...!\n70-Hina21.png\n: Oh! She survived!\n71-Byakuya15.png\n: Oh...she survived...\n73-Toko7.png\n: Huh? What just h-happened...? Master...?\n65-Byakuya7.png\n: You declared for the whole world to hear that you would never again inhale a single molecule of oxygen.\n74-Toko10.png\n: Oh. Then...I don't mind b-breathing in the carbon dioxide you exhale. That's enough for m-me to live...\n75-Hiro14.png\n: This is the strangest back-and-forth I've ever seen...\n11-DespairSyndrome2.png\nI should take a close look at the body one more time...\n19-Hina2.png\n: Watch yourself, Makoto. She may be dead, but she's still a girl...\n9-Makoto2.png\n: D-Don't worry. I don't plan on touching the body all that much.\nI'm not Kyoko, after all...\n80-Narration.png\n: The only thing we can interact with is this...thing on the ground.\nThere's something next to the body. It's...a\nkey\n? Is it what Kyoko took from Monokuma?\n82-Flashback.png\n61-Makoto.png\n: But what did you steal?\n84-Kyoko.png\n: I stole this...\n61-Makoto.png\n: A...\nkey\n?\nBut looking at it, I could tell it wasn't just any key. It was shaped like\nMonokuma\n. It was probably the only key of its kind on Earth.\n82-Flashback.png\nThat's right. The key she stole was\nshaped like Monokuma\n. This isn't anything like that.\n9-Makoto2.png\n: Then this key is...?\n47-Byakuya2.png\n: What is it? Did you find something?\n9-Makoto2.png\n: Yeah... This was on the ground near the body.\n47-Byakuya2.png\n: I've never seen this key before. What could it possibly go to...?\n9-Makoto2.png\n: So even you don't know, then?\n40-Byakuya3.png\n: Makoto...I'm going to give you a very important task.\n9-Makoto2.png\n: Huh...?\n40-Byakuya3.png\n: That key might give you access to certain areas we thought were locked.\n9-Makoto2.png\n: You mean...?\n65-Byakuya7.png\n: The\nbio lab\n, the\ndata center\n, the\nheadmaster's room\n, and\nthe dorm rooms on the 2nd floor\n... It's in your hands.\nSo I'm your errand boy now...?\n88-BeautifulDeath.png\n80-Narration.png\n: I don't know about you, but that key gave me one very specific vibe.\n80-Narration.png\n: Namely, it looked like circuitry.\nThe door to the data center was definitely locked before.\n9-Makoto2.png\n: Okay, let's give it a shot...\nWhen I went to insert the key I'd found in the garden into the keyhole...\n*Click*\n9-Makoto2.png\n: It fits!\nThen this is the\nkey to the data center\n! I'd managed to unlock the data center...! I guess all that running around paid off...\n9-Makoto2.png\n: I have to go tell everyone else!\nI immediately headed back to the garden.\n11-DespairSyndrome2.png\n39-Byakuya.png\n: So, you're back. How'd it go?\n9-Makoto2.png\n: I found out which room the key goes to. It's the data center, down on the 4th floor.\n18-Hiro7.png\n: Then we can get into the data center now!?\n14-Byakuya9.png\n: Interesting... But why did the now deceased have that key on them?\n47-Byakuya2.png\n: I suppose we'll just have to go to the data center and find out.\n9-Makoto2.png\n: Yeah, I think you're right.\n2-DespairSyndrome2.png\n3-Byakuya9.png\n: Here we are.\n4-Makoto2.png\n: Looks like the door is still unlocked...\n5-Hina9.png\n: Hey, so...when you open that door, there's not gonna be another huge KABOOM like before, right?\n6-Hiro5.png\n: You're asking that question *now*?\n7-Byakuya3.png\n: Don't worry. We have Makoto.\n4-Makoto2.png\n: What...?\n9-Byakuya7.png\n: It's in your hands...\n4-Makoto2.png\n: Again...?\n7-Byakuya3.png\n: It means I trust you.\nThat's an absolute lie. I'm just being used...\n♪\nMusic fades out.\n♪\nI reached out and put my hand on the door. I closed my eyes and tried to clear my mind. With a silent prayer, I slowly opened the door...\n13-DespairSyndrome1.png\n...Nothing...happened. After making sure I was still alive, I slowly opened my eyes.\nIn a word, the room was...\nstrange\n. I mean, all the rooms up till now were strange, but this room had a...special kind of strangeness. It wasn't a surface fear like the rest of the school. Here, the\nfear\nwas lurking beneath the surface... The room was filled with that kind of dread...\n16-Hiro7.png\n: Hey, that's--!\nHiro extended a trembling hand and pointed...\nLook at all those monitors on the wall... Look what they're showing...\n19-DISTRUST.png\nEach monitor displayed a different section of the school. The dorms, the classrooms... Every part of the school was covered.\n4-Makoto2.png\n: Th-This is...!\n21-Byakuya12.png\n: It's a\ndirect feed\nfrom every single surveillance camera...!\n22-Byakuya10.png\n: All the cameras in the school feed back into this room...and they're displayed here on these monitors. So the sole purpose of this room...is to watch us.\n23-Hiro8.png\n: To...w-watch us!?\n25-Hina12.png\n: Then this room is...!\n9-Byakuya7.png\n: The\nmastermind's private room\n, without a doubt.\nThe mastermind's room... I guess that makes sense. So the mastermind was here...watching us.\n7-Byakuya3.png\n: Then I think this settles it.\n26-Hina2.png\n: Huh...?\n7-Byakuya3.png\n: The body in the garden... If they had the key to this room, it can only mean one thing.\n28-BoysLifeofDespair.png\n9-Byakuya7.png\n: That was the body of Mukuro Ikusaba, and she was the mastermind.\n25-Hina12.png\n: Then the mastermind is dead? Like really really dead!?\n29-Byakuya8.png\n: It would seem so.\n23-Hiro8.png\n: F-For serious!?\n30-Toko3.png\n: It's too bad they had to g-go and die...before Master could k-kill them himself!\nThe mastermind...is dead? Could that really be true? Does that mean...it's all over? Because, I mean...that body...\n31-FlashT.png\n33-FlashB.png\nWhatever happened, they obviously didn't die a natural death. So who was it that...?\n35-Hiro4.png\n: B-But...if the mastermind really is dead...\n36-Hiro3.png\n: That means we can finally get outta this hellhole!\n37-Hiro15.png\n: We gotta hurry up and find the exit! C'mon!\n39-Byakuya5.png\n: No. We have to check this area thoroughly first.\n16-Hiro7.png\n: Huh!? But what about the exit!?\n7-Byakuya3.png\n: If the mastermind truly is dead, we can leave whenever we decide to. But right now...\n40-Byakuya4.png\n: ...we need to find out why the mastermind set up this life-or-death game in the first place.\n7-Byakuya3.png\n: And I'm bothered by the fact that the mastermind was obviously\nmurdered\n.\n23-Hiro8.png\n: M-Murdered!?\n4-Makoto2.png\n: So you think so too, huh?\n7-Byakuya3.png\n: Naturally. The state of the corpse makes it plain as day. There is absolutely no doubt the mastermind was murdered.\n6-Hiro5.png\n: Wh-Why's it gotta be that way!? I mean, who could've even done it!?\n39-Byakuya5.png\n: That's exactly why I said we need to investigate the purpose and identity of the mastermind.\n42-Toko13.png\n: Now do you u-understand, you useless insect!? You're banned from t-talking to Master ever again!\nThe mastermind's purpose...and why they were killed... This room may very well hold the answers to those questions... After all, the mastermind must have spent who knows how much time here...\n43-Byakuya.png\n: Okay then, let us begin our search. It's time to uncover the identity of the mastermind.\n2-DespairSyndrome2.png\n45-Narration.png\n: There is a lot of stuff to look at in the data center.\n45-Narration.png\n: The others don't really have anything useful to contribute though so let's skip right ahead to the objects in the room itself.\nThere's a really ridiculous number of monitors here. And the mastermind's been using them all to spy on us...\n30-Toko3.png\n: As long as I h-have this...\n49-Makoto.png\n: ...Huh?\n50-Toko14.png\n: Look at M-Master go... It's like a feast for the e-eyes... H-H-H-H-How much is a m-m-m-m-monthly membership...!?\n49-Makoto.png\n: ...\nThere's a bunch of computers all lined up. They look like high-performance PCs. Nothing like the ancient laptop Alter Ego was installed on...\n3-Byakuya9.png\n: They're all on, but they seem to be locked.\n26-Hina2.png\n: So what, we can't do anything? Just use your fighting spirit to force your way in!\n53-Toko5.png\n: What c-century are you from...?\n49-Makoto.png\n: The mastermind must've been using these to monitor the network. And Alter Ego...\n43-Byakuya.png\n: You may well be right about that.\n54-Byakuya2.png\n: But there's no point in thinking about it now.\n49-Makoto.png\n: You're right...\nThere's nothing showing up on this one...\n57-Hiro2.png\n: Huh? Hey, look. Next to that TV...\n57-Hiro2.png\n: Isn't that a\nTV antenna\n?\n37-Hiro15.png\n: It is! It's just like the one my grandma uses! It's totally one of those hi-def antennas!\n49-Makoto.png\n: Wait, so if we hook up that antenna, we could watch TV?\n59-Hina11.png\n: Huh? Did someone say TV!?\n61-Hiro18.png\n: Well well, Saturday Morning Hina's here!\n5-Hina9.png\n: Uhh...are you talking about me?\n62-Hina22.png\n: Anyway, if we can watch TV, let's do it! C'mon c'mon c'mon!\n63-Hiro12.png\n: Ah, you're all starved for info from the outside world, huh?\n57-Hiro2.png\n: Alright! Lemme work my magic, and you'll be quantum leaping your way to TV land before ya know it!\nI mean...I get the reference, but...what's he talking about?\n45-Narration.png\n: Lastly, there's this rather conspicuous door in the back.\nThis door's kinda creepy... It's got a picture of Monokuma on it. What could be inside...?\n*Rattle rattle*\n49-Makoto.png\n: No luck...\n5-Hina9.png\n: The door's locked, huh? What if you use the key that opened this room?\n49-Makoto.png\n: Let's give it a try, just in case.\n*Rattle rattle*\n49-Makoto.png\n: Nope, no good. It won't even fit in the keyhole.\n26-Hina2.png\n: Oh...\n62-Hina22.png\n: Well, don't worry about it! Everything's fine. The mastermind's dead, right? So nothing's gonna happen to us!\n49-Makoto.png\n: Yeah, I guess you're right...\nI can't stop thinking about that door with Monokuma's picture on it... But worrying about it isn't gonna do me any good. Hina's right. The mastermind's gone, so there's nothing to be afraid of anymore.\n68-Hiro.png\n: Hrm... Hrm hrm hrmmm...\n63-Hiro12.png\n: Oh...! Oh oh oh oh oh!\n49-Makoto.png\n: ...What's wrong?\n57-Hiro2.png\n: Good news for all you Saturday morning kiddies out there! I think I got the TV working!\n70-Hina21.png\n: Really!?\n57-Hiro2.png\n: Now all we gotta do it...switch it on!\n9-Byakuya7.png\n: ...Then do it.\n71-Hiro14.png\n: Friggin' idiot mastermind! All \"you guys need to cut free from your regrets of the outside world\"...\n72-Hiro16.png\n: And they were sitting here watching TV the whole time! They really thought they could get away with it...?\n13-DespairSyndrome1.png\n63-Hiro12.png\n: Hm...?\n49-Makoto.png\n: Huh...? This is...\n5-Hina9.png\n: It's the feed coming from...the surveillance camera monitoring this room, isn't it?\n16-Hiro7.png\n: Huh? That's weird...\n76-Byakuya6.png\n: Hey, what are you doing?\n35-Hiro4.png\n: That's really weird. Hmm...\n77-Toko12.png\n: Y-YOU'RE weird...! Weird in every way p-possible. And not j-just weird... Super weird!\n6-Hiro5.png\n: But...this TV isn't hooked up to anything but the antenna... So how is it showing the camera feed?\n5-Hina9.png\n: Did you try changing the channel?\n35-Hiro4.png\n: Oh, good idea. Let's give that a try.\nHiro went through each channel one by one.\n2-DespairSyndrome2.png\nBut on every channel, it was just...us. It was a live feed of us standing there in the data center.\n6-Hiro5.png\n: What the heck...?\n5-Hina9.png\n: Is it broken or something?\n6-Hiro5.png\n: No... There must be some kind of trick to it, some weird setup...\n79-Monokuma11.png\n: A trick? What kind of trick!?\n63-Hiro12.png\n: I'm not sure, but...\n80-Toko7.png\n: ...Huh?\n79-Monokuma11.png\n: ...Huh?\n25-Hina12.png\n: Wh...?\n79-Monokuma11.png\n: Wh...?\n82-Hiro6.png\n: WHAAAAAAAAAAAAATTT!?!?\n84-MrMonokumasLesson.png\n85-Monokuma5.png\n: Gyaahaha! Been a while, ya friggin' bastards!\n4-Makoto2.png\n: M-Monokuma!?\n86-Toko6.png\n: How...? You're supposed to be d-dead!\n85-Monokuma5.png\n: Gyaaahahaha! Me, dead!? Don't be freakin' stupid!\n87-Hiro9.png\n: Hey, you're actin' kinda strange! Something seems...different.\n89-Monokuma13.png\n: Of course I'm different! Evolution is perfectly natural! After all, I've been hibernating for two years already...\n82-Hiro6.png\n: Not even! It's been like half a day at MOST!\n90-Hina10.png\n: How are you alive again!?\n91-Monokuma4.png\n: Oh yeah, that's it. Puhuhu... The look on your faces right now is sublime! That's what I wanted to see--the moment you went from hope to despair...\n76-Byakuya6.png\n: Don't tell me you pretended to be dead, all for this moment...?\n91-Monokuma4.png\n: Why would a bear pretend to be dead? You're the ones who should pretend to be dead when you see a bear!\n85-Monokuma5.png\n: I mean, that's totally laughable! It makes me laugh! I'm gonna laugh now! A-ha-ha-ha!\n93-Monokuma.png\n: And that's that.\n95-Monokuma12.png\n: Well, it's almost time to cut off your past so full of hope, and begin to despair at the future ahead of you! I want you to all have way more fun in this\nkilling game\n!\n90-Hina10.png\n: You can't be serious... We have to keep going?\n96-Hiro10.png\n: N-No... We were supposed to get out of here...!\n79-Monokuma11.png\n: Get out of here? Are you still obsessed with getting out of here?\n97-Monokuma2.png\n: How do you not get it!? There IS no getting out of here! And besides...\n93-Monokuma.png\n: This life\nisn't all bad\nya know! I mean, there's stuff you won't like about life no matter where you are!\n99-Toko9.png\n: Are you s-serious? This place is the w-worst...!\n93-Monokuma.png\n: If it's the worst, does that mean you're in...despair?\n85-Monokuma5.png\n: Ahh-hahahahaha!\n93-Monokuma.png\n: Whew. I'm pooped from all that laughing! I guess I'll just get to the point now.\n4-Makoto2.png\n: The point...?\n93-Monokuma.png\n: You guys really struck gold when you found that TV. Yes, indeed! That TV is an essential part of your school life here.\n39-Byakuya5.png\n: I knew it was hiding a secret of some kind...\n6-Hiro5.png\n: But I connected the antenna, so why's it just showing us the surveillance feed?\n91-Monokuma4.png\n: Puhuhu... Look how attentive they are now! Well then, I'm gonna let you in on a blood-gushing secret and tell you about it!\n102-Monokuma6.png\n: That TV is absolutely, without a doubt, displaying the signal coming in on the antenna.\n25-Hina12.png\n: Huh? But...what does that mean?\n77-Toko12.png\n: It's displaying th-the signal...? But it's just us, standing h-here...\n97-Monokuma2.png\n: Ugh, you're so stupid! Don't you get it!? Fine, I'll just tell you...\n103-MrMonokumaAfterClass.png\n85-Monokuma5.png\n: This killing game\nis being broadcast live to the entire world\n. It's the most popular thing on TV!\n4-Makoto2.png\n: What...?\n102-Monokuma6.png\n: This killing game\nis being broadcast live to the entire world\n. It's the most popular thing on TV!\n4-Makoto2.png\n: ...\nIt doesn't matter how many times he sayd it, I don't know what it's supposed to mean. I mean, even if I understood the words, I'm not sure I'd undrstand the deeper meaning...\n90-Hina10.png\n: Wh-What? Broadcast live...to the entire world? What kind of bad joke is this...?\n105-Byakuya13.png\n: It can't be... Have they taken over the airwaves somehow...!?\n87-Hiro9.png\n: The camera feed is being broadcast...? No way, that's impossible!\n106-Monokuma10.png\n: That kind of overconfidence is a major weakness in your crisis management system, you know that? All you need is one weird trick that I found, and hijacking the airwaves is Easy Mode!\n4-Makoto2.png\n: A-Are you being serious right now...?\n93-Monokuma.png\n: Of course!\nI heard a kind of...creaking. But the sound was coming from my own mind. Like a boat tossing in the ocean, my mind had begun to creak and groan.\n93-Monokuma.png\n: Everything has a meaning, you know... All those hints I gave you, all those tantalizing tidbits about the school's mysteries... Even me luring you here right now... Why would I do any of that without a reason?\n95-Monokuma12.png\n: It was all for my captive audience--to show them\ntrue despair\nlike they'd never seen it before!\n85-Monokuma5.png\n: I became the director of a despair-based production! This is the ultimate reality show! The best in despair entertainment!\n108-Hina15.png\n: You're lying! If this was on TV, the police and everyone else would be going crazy!\n6-Hiro5.png\n: Y-Yeah... There's no way they wouldn't have tried to come and rescue us!\n91-Monokuma4.png\n: What if...they already did?\n4-Makoto2.png\n: ...Huh?\n106-Monokuma10.png\n: But then again...it's not really any of their business, right? Sure, some people might yell at their TV to try and warn you. But who would actually come here to help?\n89-Monokuma13.png\n: Don't you think that's possible? I don't really know personally though, so whatever!\n110-Byakuya11.png\n: But to take control of all communications like that, you'd need an astronomical amount of resources.\n91-Monokuma4.png\n: Yup! So, how could things have come this far? Well... That's a secret! There's something you all need to do first, remember?\n4-Makoto2.png\n: What...?\n93-Monokuma.png\n: Yeah, duh! There's the little business of...\n111-BodyDiscovery.png\n*Ding dong, bing bong*\n114-MonokumaTV.png\n: A body has been discovered! After a certain amount of time, which you may use however you like, the\nclass trial\nwill begin!\n103-MrMonokumaAfterClass.png\n4-Makoto2.png\n: Huh...?\n116-Hina13.png\n: C-Class trial!? Do you mean...!?\n91-Monokuma4.png\n: Puhu... Puhuhuhuhuhu...! Puhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhu...!\n93-Monokuma.png\n: I'll leave the next Monokuma File right here. Everyone give it all you've got, okay!?\n89-Monokuma13.png\n: Okay! Things are gonna get pretty crazy from here on out! You're in for a heck of a ride...! I can't wait...! I can't wait!\n13-DespairSyndrome1.png\nAnd then...he was gone. Reality was incomprehensible, the truth hopelessly out of reach. All we were left with...was\ndespair\n.\nWe stood there for I don't know how long, frozen in place. I couldn't think. It took everything I had just to keep myself standing upright.\n82-Hiro6.png\n: I don't understand any of this... What's \"despair entertainment\"? And...how is he still alive!?\n121-Hina14.png\n: I thought that finally...*finally* we could get out of here...\n99-Toko9.png\n: A-And plus...what did he s-say about a class trial!?\n76-Byakuya6.png\n: Well that part's obvious. The class trial is the class trial. What it means is that at this point, we have to figure out who the culprit is... Figure out...\nwho killed Kyoko\n.\n4-Makoto2.png\n: What...?\n6-Hiro5.png\n: Wh-What are you talking about? I thought Mukuro Ikusaba was the one who died...\n39-Byakuya5.png\n: The victim was female, right? Kyoko certainly fulfills that condition. And if Monokuma is still alive and active...that means that the mastermind, Mukuro Ikusaba, isn't dead.\n76-Byakuya6.png\n: So naturally that body can't belong to her. So it must be Kyoko. There is no other possibility.\n31-FlashT.png\n33-FlashB.png\nThe body is...Kyoko's? Kyoko's been murdered...? No! It's not possible! Because...because I don't know anything about her yet...! I don't even know who she really is. To have it end like this...\n4-Makoto2.png\n: I don't believe it...! I refuse to believe it!\n76-Byakuya6.png\n: Whether you believe it or not doesn't matter. The truth is the truth! If you refuse to believe, it's your responsibility to uncover the truth for yourself.\n4-Makoto2.png\n: Myself...?\n39-Byakuya5.png\n: ...Anyway, we'd better begin.\n90-Hina10.png\n: B-But...if we're gonna have a class trial...then that means the killer...\n39-Byakuya5.png\n: Correct. It must be someone participating in our school life.\n23-Hiro8.png\n: Wait, so you're saying one of us killed Kyoko!?\n39-Byakuya5.png\n: Well...that's not precisely what I'm saying, no.\n16-Hiro7.png\n: Huh? But you just said--\n39-Byakuya5.png\n: I don't have time to explain now. There is a veritable mountain of issues I need to confirm.\n76-Byakuya6.png\n: So I'm going to begin my search. If you value your lives, you'll put everything you have into this. That is how this game works, after all...\n2-BOX16.png\n3-Narration.png\n: Now this track, THIS track is the best track in the game. This is the one I've been waiting for. Enjoy.\nWell...I'd better start by checking out the Monokuma File...\n\"Due to the explosion, the victim's identity is unknown. They were, however, dead before the blast. The victim had been stabbed a single time with a knife, which went completely through the body. They had also been struck in the head with an object about as thick as a metal pipe. The body was covered with other wounds, but these were at least several days old.\"\n5-Makoto2.png\n: So even the Monokuma File doesn't tell us who the victim actually was...\n6-FlashT.png\n8-FlashB.png\nThe unidentified body... Could it really be Kyoko...? Or...?\nI have no choice... I have to investigate. I have to uncover the truth for myself... No matter what, I have to find out what happened. Or we're all dead...!\n5-Makoto2.png\n: I need to go back to the scene of the crime--back to the garden!\nOkay, time to get started. I need to check anywhere that may be important, from one end to the other. I just need to do what I always do...\n3-Narration.png\n: Let's get started by checking out the body itself.\nIf I check the body more thoroughly...maybe then I'll find out for sure if it's Kyoko or not.\n5-Makoto2.png\n: Huh...? There's something weird about the body's fingernails... Oh, these are\nfake nails\n. They're really long... They seem like they'd get in the way of normal activity.\nThere's also something on the back of her right hand... Is this...a\ntattoo\n? It got burned, so I can't make out the whole thing, but... It looks like it's\na picture of a dog\nor something. I've never seen anything like it before.\nThe upper half of the body got set on fire in the explosion, so it's totally blackened... Also, the\ntop half\nof the body is wet.\n6-FlashT.png\n8-FlashB.png\nThat's because it got set on fire, and I threw water on it... Since I only threw water on the part that was on fire--the top half--the bottom half is still dry. In other words, there's nothing strange about\nthe top half\nbeing wet. There...isn't, right?\nThe lower half of the body didn't get wet at all... After the body blew up, the top half got set on fire, so I dumped a bucket of water on it. Which explains why the bottom half isn't wet. There's nothing strange about that...right?\n3-Narration.png\n: Stepping away from the body, let's look at whatever these pieces are on the floor.\nThese...look like fragments of something. They're all burnt, so I can't really be sure, but...I feel like I've seen something like it before. But where...?\n5-Makoto2.png\n: Wait, was it...\nthere\n!?\nI'll have to double-check that later...\n3-Narration.png\n: Next up, the knife.\nThere's a knife laying on the ground... Is this...?\n6-FlashT.png\n8-FlashB.png\nIt must be the knife that was stuck in the body before it exploded. The force of the explosion must have thrown it over here...\nThe Monokuma File said the knife went all the way through the body, from front to back. Does that mean this knife is what caused the\nfatal injury\n...? ...Either way, this knife... It looks really familiar...\nWait, is this...!?\n6-FlashT.png\n8-FlashB.png\n32-DISTRUST.png\nThat's it! It's the knife that person was holding...!\n5-Makoto2.png\n: ...\nThis is getting really weird... There are just too many strange coincidences. Whoever the person in the mask was that attacked me last night... They were holding that knife... And that same knife was used to stab that same masked attacker we found here... So...maybe this masked person got stabbed because...!\nWhen they attacked, I was in a kind of trance. Maybe I reacted by grabbing the knife...and maybe then I...I...!\n5-Makoto2.png\n: ...\nAnd if this really is Kyoko...it would mean Kyoko is the one that attacked me. But why the mask...?\n5-Makoto2.png\n: ...\nI just don't know. I don't remember anything clearly from last night... No...no, it can't be. There's no way...!\n2-BOX16.png\n3-Narration.png\n: It's a long shot, but let's see if Toko has anything useful to tell us.\n36-Toko9.png\n: So who does that b-body belong to...? Whoever it i-is, I'm not gonna look...! I don't wanna f-faint anymore...\n3-Narration.png\n: About what I expected. Hina's usually better about these things though.\n39-Hina2.png\n: Listen, Makoto... Do you remember how the body looked, y'know...before it blew up?\n5-Makoto2.png\n: Umm...if I remember right...\n6-FlashT.png\n8-FlashB.png\n5-Makoto2.png\n: It was wearing some kind of mask, and a big white coat. Also, there was a knife sticking out of the stomach, and the area around it was stained with blood... Apparently, the wound had stopped bleeding, but the blood on the body was still wet. Byakuya said not to touch it to avoid getting all bloody... But for how much blood there was on the body...I didn't see any on the ground around it.\n42-Hina21.png\n: Wow, thanks! That was a big help. Now that you explained it, I totally remember how it looked!\n5-Makoto2.png\n: Well, having to talk about it like that helped me remember it a lot better, too. So thank *you*, too.\n3-Narration.png\n: Let's see if there's anything to discover about the sprinkler system.\nThis is the panel that controls the sprinklers. They're set to turn on at 7:30 every morning. And Monokuma said the time positively couldn't be change.\n5-Makoto2.png\n: Huh? Hold on...\nSo the sprinklers turn on at 7:30 each morning, right...? Then...if the body was here before then,\nthe sprinklers should have gotten it wet\n.\n5-Makoto2.png\n: Which would mean the murder must have taken place...\n3-Narration.png\n: Could the chicken coop be hiding a clue?\nI remember there were some chickens in the chicken coop.\nI count four chickens.\n5-Makoto2.png\n: Huh...?\nFour\n?\n51-Hiro12.png\n: What's goin' on, Makoto?\n5-Makoto2.png\n: Oh, I'm glad you're here. Listen, do you remember how many chickens there were in here?\n52-Hiro2.png\n: Of course! There were precisely\nfive\n.\n5-Makoto2.png\n: Yeah, right?\n51-Hiro12.png\n: Hmm? What's wrong?\n5-Makoto2.png\n: There's only\nfour chickens\nhere now. We're one short...\n53-Hiro5.png\n: Huh...?\n54-Hiro6.png\n: AaaaAAaaAAAHHhhhHH!\n5-Makoto2.png\n: That's so weird. I wonder when it disappeared...\n56-Hiro7.png\n: I was down here just before nighttime last night, and there were definitely five chickens then.\n54-Hiro6.png\n: What are we gonna do!? Going from five to four is gonna have an impact on the structure of the world!\n57-Hiro15.png\n: It's like a jigsaw puzzle. If even a single piece disappears, the entire world will remain unfinished!\nI did my best to ignore Hiro and focus on the problem at hand... Why did one of the chickens disappear? Could it be related to the case...?\n3-Narration.png\n: Let's have a chat with Byakuya and see if he's figured anything out. Of everyone here, he's the most likely to have a discovery.\n61-Byakuya.png\n: Good timing, Makoto. I wanted to\n[talk]\nto you.\n> talk\n5-Makoto2.png\n: What do you want to talk about...?\n32-DISTRUST.png\n63-Byakuya2.png\n: I'd like to hear your\nalibi\n.\n5-Makoto2.png\n: A-Alibi!?\n64-Byakuya8.png\n: Correct. I'd love to hear where you were\nafter nighttime began last night\n.\n5-Makoto2.png\n: U-Umm... Well I was sick, so I was asleep all night... But why are you asking about that now? And what's \"nighttime\" got to do with it...?\n65-Byakuya7.png\n: Isn't it obvious? This murder took place\nafter nighttime\n.\n5-Makoto2.png\n: H-How can you know that for sure?\n67-Byakuya9.png\n: Because just after nighttime began, I came to the garden. I was going around looking for everyone, so I could tell them about Monokuma. Hiro's been spending most of his time in the garden the last few days, so I figured he'd be here. And I can confirm that when I arrived last night,\nthere was no body here\n.\n64-Byakuya8.png\n: So the murder could only have taken place\nat some point during nighttime\n, *after* I left the garden!\n65-Byakuya7.png\n: However...Toko, Hiro, Hina, and I were in the gym together the entire night last night.\n5-Makoto2.png\n: What...?\n61-Byakuya.png\n: Once I found Hiro in the garden, we immediately went to Toko and Hina's rooms to get them. At that point, we all went to the gym and began dismantling Monokuma. As a precaution, we made sure not to go anywhere alone. We even went to the bathroom in pairs. In other words, all four of us have\nair-tight alibis\n. The only ones who *don't* have alibis...\n5-Makoto2.png\n: ...are me and Kyoko.\n69-Byakuya5.png\n: And if the victim really is Kyoko...\n5-Makoto2.png\n: ...then I'm the only one without an alibi...!\n61-Byakuya.png\n: Also, when we went to go get Hina and Toko, we stopped by your room, as well.\n63-Byakuya2.png\n: But you never came to the door. So...where, precisely, were you?\n5-Makoto2.png\n: I'm telling the truth, I was in my room. But I was dead asleep. I had a fever, so...\n65-Byakuya7.png\n: That's hardly an alibi.\n5-Makoto2.png\n: I know...\n71-Byakuya3.png\n: So? What now? You seem to be at quite the disadvantage here...\nI'm the only one without an alibi. That's...really bad, isn't it?\n2-BOX16.png\n3-Narration.png\n: Well, that's a really bad realization. Hopefully nothing Hiro can say will match that...\n52-Hiro2.png\n: It's\n11 o'clock right now\n!\n5-Makoto2.png\n: ...Okay, and?\n51-Hiro12.png\n: Oh, well I was just thinking about when we first found the body...\n5-Makoto2.png\n:\nWhen the body was found\n, huh...?\nI should look back at what I did this morning, to help me remember when that was... Monokuma's announcement woke me up at\n7 o'clock\nas usual, and I headed for the dining hall pretty soon. Once I got there, I met up with Hina. That was right around\n7:30\n. Then I headed to the gym, where everyone else was waiting. Next, Toko went to go get the pickaxe. And that's when she found the body... What time was it then...?\n6-FlashT.png\n8-FlashB.png\n61-Byakuya.png\n: Now then... Toko, what time is it?\n76-Toko2.png\n: W-Well, when we left the gym, it was j-just before 9 o'clock. So it's probably 9 on the d-dot now...\n5-Makoto2.png\n: That's right...! It had to have been\nright around 9 o'clock\n!\n51-Hiro12.png\n: Ah! Now that you mention it, I think you're right!\n52-Hiro2.png\n: So I think we can say for sure that\nthe body was found at 9 a.m.\nOkay, my job's done!\nThat's...a pretty small job.\n3-Narration.png\n: Let's check out the toolshed while we're here.\nJust to be sure, I should take a look at the toolshed.\nThis room is dusty and disorganized. In other words, a pretty stereotypical toolshed.\nIs this...a\ntarp\n? Wait...was there a\ntarp\nin here before?\n5-Makoto2.png\n: I should probably look into that. It could be related to the case...\nThe top is wet, and covered with mud and grime. But the underside...\nIt's totally clean, and completely dry. One side of that tarp is\nwet and dirty\n... Something about that bothers me...\nThat's the one thing in here that concerns me...\n3-Narration.png\n: Indeed it is, so we step back outside.\n5-Makoto2.png\n: I think I've checked everything I need to in this area.\nBut I'm not done yet... There are other areas I need to check.\nSpecifically, that fragment I found before... There's\nsomewhere\nI need to go in order to confirm my suspicions... And I still need to find out more about Kyoko.\nIs that corpse really Kyoko? If that's true...\n6-FlashT.png\n8-FlashB.png\n...was that also Kyoko who attacked me last night? If I can find out more about her, maybe I can answer that question... Kyoko was never the kind of person to talk about herself all that much. Maybe if I can get into\nher room\n, I'll be able to find out more... But the key to her room...\n91-Flashback.png\n69-Byakuya5.png\n: I will simply...limit your options. I can't allow you to engage in any further suspicious activity.\n93-Kyoko7.png\n: Limit my options...?\n69-Byakuya5.png\n: Give me the key to your room.\n91-Flashback.png\nI don't have a choice. I have to see if he'll let me borrow her room key...\n5-Makoto2.png\n: Hey, um...Byakuya?\n61-Byakuya.png\n: If you do come up with ab alibi, I'd be happy to hear it. Later. At the class trial.\n5-Makoto2.png\n: Oh, no, it's not about that. You have the key to Kyoko's room, right? I was hoping I could borrow it...\n61-Byakuya.png\n: ...I'm afraid I can't take that risk. You're the prime suspect, after all.\n63-Byakuya2.png\n: Of course, if I were to go with you, that would be a different story.\n5-Makoto2.png\n: Then...*will* you go with me?\n61-Byakuya.png\n: Sorry, I have my own agenda to take care of.\nFind me again later\nand we'll see.\n97-Byakuya14.png\n: Depending on my mood, I may go with you. Or I may not. *leaves*\nCome back later, huh? Okay, then in the meantime I should look around somewhere else. Maybe I should check out...that one area...\n2-BOX16.png\n3-Narration.png\n: Makoto has been alluding to some location that the fragment reminds him of. I dunno about you, but didn't the fragments look a little bit like the bomb Hiro pulled out of Monokuma in the gym?\nMonokuma's laying dismantled on the floor. But...\n6-Makoto2.png\n: I figured it wouldn't be here.\n7-Flashback.png\n9-Hiro12.png\n: I just found something. What is it...?\n6-Makoto2.png\n: I-It's...!\n10-Hiro4.png\n: It's what?\n11-Byakuya3.png\n: A\nbomb\n. There's some installed in every Monokuma robot, I'm sure.\n12-Hiro8.png\n: A b-b-b-bomb!?\n7-Flashback.png\nAnd\nthat bomb\nwent missing... There's no doubt about that. The fragments I found in the garden...\n3-Narration.png\n: That's all we can do in the gym. Maybe Byakuya is back from his errand now.\n6-Makoto2.png\n: You think you can go soon, Byakuya?\n17-Byakuya14.png\n: You wanted to check out Kyoko's room, right? Very well. Let's go. *leaves*\n6-Makoto2.png\n: Ah! Wait for me!\nByakuya walked off without a second glance, and I hurried after him on our way to the dorms.\n21-Byakuya.png\n: Well then, here we go.\nByakuya took out the key and slid it into the keyhole. And then...\n*Click*\n21-Byakuya.png\n: ...And it's open.\n6-Makoto2.png\n: Looks like it... Thanks.\nSo...this is Kyoko's room.\n3-Narration.png\n: This thing on the table it just calling out for examination.\nThere's something on the table. It's...a woodblock decoration.\n27-Byakuya7.png\n: What's that? What purpose does it serve?\n6-Makoto2.png\n: I think it's probably...a\nkey\n. The lockers at those really traditional public bathhouses use them for their lockers.\n21-Byakuya.png\n: I wouldn't know. I've never gone to a public bathhouse.\nThe doesn't really surprise me. It's hard to picture Byakuya doing something like that...\n29-Byakuya9.png\n: But if it *is* a key, I think I might know what it unlocks.\n6-Makoto2.png\n: Really? What?\n29-Byakuya9.png\n: Unless I'm mistaken...I'm pretty sure I saw something in the\ndojo\nthat this might go to.\nThe dojo...?\n3-Narration.png\n: Let's see if Byakuya has anything to say about Kyoko's room.\n21-Byakuya.png\n: You wanted to come here, right? So what is it you're looking for?\n6-Makoto2.png\n: Nothing in particular. I just though we might find some kind of clue here... A clue that might...help us understand Kyoko.\n33-Byakuya6.png\n: You can't be serious. *That's* why you made me take time out of my search to come here?\n6-Makoto2.png\n: S-Sorry...\n34-Byakuya5.png\n: Regardless, if you plan on poking around at random, you're doomed no matter how much time you take. Surely you have something more concrete. Something to give us some sort of direction here.\nMore concrete...\n6-Makoto2.png\n: Oh! I know!\nEarlier, Kyoko gave me something...\n7-Flashback.png\n6-Makoto2.png\n: Huh? What's this?\n36-Kyoko2.png\n: Consider it a symbol of my determination. Don't open it yet. Only open it...if something ever happens to me.\n7-Flashback.png\nI'm sure I have it here somewhere...\n6-Makoto2.png\n: Found it!\n38-Byakuya2.png\n: What's in the envelope?\n6-Makoto2.png\n: Kyoko gave it to me. She said if something ever happened, I should open it.\n27-Byakuya7.png\n: Well, something has certainly happened. So open it.\n6-Makoto2.png\n: O-Okay...\nI opened the envelope and looked inside. Inside was a single piece of paper.\n6-Makoto2.png\n: \"\nUnder the sheets\n\"...?\n34-Byakuya5.png\n: That's all that was in there?\n6-Makoto2.png\n: Yeah, it looks like it...\n\"Under the sheets\"... What could it be?\n3-Narration.png\n: We'd better check.\nBut...could something be hidden under the bedsheets? Part of me didn't expect to find anything, but as I lifted up the sheets...\n6-Makoto2.png\n: What's this...?\n...I found a crumpled up piece of paper.\n43-DISTRUST.png\nClass #78 Student Registry...? Mukuro...Ikusaba...?\n38-Byakuya2.png\n: It appears to be\nMukuro Ikusaba's profile\n.\n6-Makoto2.png\n: Yeah, looks like it...\nThat's probably the other thing Kyoko stole when she snuck into the headmaster's room, along with the key.\n45-FlashT.png\n47-FlashB.png\n48-Monokuma6.png\n: God, you're so annoying! Fine, I'll tell you! It was a\nkey\nand\n******\n! That's it!\nThis must be the \"blank\" that Monokuma was talking about... Kyoko said a death without meaning was \"unappealing.\" And this is what she left behind...\n21-Byakuya.png\n: I don't have time for your sentimental indulgences. Hurry up and finish your search.\n6-Makoto2.png\n: O-Okay...\nI made an effort to pull myself together, then looked down at the profile sheet.\nName: Mukuro Ikusaba\nSex: Female\nThe Ultimate Soldier\nAlthough small for her age, she was a military specialist trained in every weapon type imaginable. She showed an interest in the military from childhood and soon found herself completely absorbed in it. In elementary school, she won a survival game tournament and began writing for military magazines.\nJust before entering middle school, while she and her family were on vacation in Europe...she disappeared. The story of a young Japanese girl being kidnapped quickly took over Japanese media outlets. An intense international investigation turned up no information, and she was never found.\nHowever, she reappeared in Japan three years later, alone and completely unannounced. She revealed that she had joined a mercenary group known as\nFenrir\nfor those three years. She insisted that she hadn't been kidnapped, that she'd received battle training of her own volition. However, she never revealed why she decided to return home when she did.\n6-Makoto2.png\n: ...The Ultimate Soldier... A mercenary group...\nThis doesn't feel real. The world I grew up in, it's like a completely different dimension... It's like one's non-fiction and the other is sci-fi. There's no way to even compare the two... That's how different this is... That was how I saw things as just an ordinary person. But then...\n29-Byakuya9.png\n: I never imagined I would hear the name Fenrir in a place like this...\n6-Makoto2.png\n: Huh? You recognize it?\n52-Byakuya4.png\n: The\nFenrir Mercenary Corps\nis a collection of battle-crazed warmongers. But they do have their uses, and they always get the job done. That's worth remembering...\n6-Makoto2.png\n: This is all part of a world totally removed from the one I live in...\n29-Byakuya9.png\n: I have to say, I'm intrigued. Every rumor I've heard says that Fenrir has already...\n54-MrMonokumaAfterClass.png\n55-Monokuma4.png\n: Whoa! I feel like our hero is becoming a bit player and a bit player is becoming our hero!\n6-Makoto2.png\n: Ah! It's you!\n56-Monokuma.png\n: Hmm? What have you got in your pretty little hand there?\n57-Monokuma2.png\n: Uh-oh! You found her profile!?\n6-Makoto2.png\n: S-So what if we did...?\n56-Monokuma.png\n: Don't freak out on me! I'm not gonna hold it against you or anything. And in case you're wondering, I don't hold it against Kyoko, either. Even though she stole it and hid it! After all, there's no rule against stealing, is there?\n59-Monokuma3.png\n: But who I *can't* forgive is Miss Ogami, who broke the rules and busted into the headmaster's room...! Maybe I'll drag her corpse out here and slice it up and devour it! Bears *are* omnivorous, ya know...\n34-Byakuya5.png\n: Are rule violations really so unforgivable? You're quite adamant about those regulations of yours...\n60-Monokuma12.png\n: Of course I am! A proper school life is built on the dedication to organization and order!\n48-Monokuma6.png\n: Which is why even I, as the school headmaster, have to follow the regulations myself!\n34-Byakuya5.png\n: Oh? So you're saying you have to follow your own rules, as well?\n56-Monokuma.png\n: Absolutely! I can't have you complaining about how unfair it all is, now can I?\n60-Monokuma12.png\n: In fact, on the subject of fairness, would you like to know something interesting?\n6-Makoto2.png\n: Interesting...?\n60-Monokuma12.png\n: It's about the one writing all the rules. They're actually...\n43-DISTRUST.png\n55-Monokuma4.png\n: ...one of the participants in this\nkilling game\n. I don't think I ever actually told you how many participants there actually were, did I?\n60-Monokuma12.png\n: I was thinking, I should probably clarify that!\n63-FlashTLong.png\n65-FlashBLong.png\n60-Monokuma12.png\n: When you all first got together in the main hall way back when, there were\nfifteen\npeople there, right? I think that first meeting may have led to a little misunderstanding among you all...\n6-Makoto2.png\n: A...misunderstanding? Are you saying...?\n55-Monokuma4.png\n: That's right! There weren't actually fifteen of you...\n67-Monokuma5.png\n: The total number of students taking part in this killing game was actually\nsixteen\n!\nSixteen!? Then...!\n45-FlashT.png\n47-FlashB.png\n69-Kyoko22.png\n: Mukuro Ikusaba... The sixteenth student, lying hidden somewhere in this school... The one they call the Ultimate Despair... Watch out for her.\nThe sixteenth student...Mukuro Ikusaba... She's part of this school life... So the one making all the regulations is...!\n33-Byakuya6.png\n: ...Why...?\n71-Monokuma11.png\n: Hm? Did you say something?\n33-Byakuya6.png\n: Why are you telling us this?\n55-Monokuma4.png\n: Oh, well because...\n73-Monokuma10.png\n: ...like I old you, this killing game is desperately popular! You wouldn't believe the ratings! And since we've got so many viewers now, I wanted to make sure everyone was on the same page. I don't want to wake up to a hurricane of complaints and hate mail, ya know?\n56-Monokuma.png\n: Make sense?\n34-Byakuya5.png\n: ...\n55-Monokuma4.png\n: Okay, that's all you get for now! Oh, actually! I do have some revenge to get, so I have an extra bonus for you!\n6-Makoto2.png\n:\nRevenge\n...?\n67-Monokuma5.png\n: I want to get back at that sneaky Miss Kirigiri, so I'm gonna share a little secret with ya!\n6-Makoto2.png\n: S-Seriously!?\n55-Monokuma4.png\n: You know how she wears those stupid gloves day in, day out, all the time? Well, don't tell anyone I told you, but... She wears them to cover\na bunch of hideous scars that she doesn't want anyone to see\n!\n6-Makoto2.png\n: ...What?\n55-Monokuma4.png\n: Puhuhu. Okay, NOW that's all you get!\n67-Monokuma5.png\n: Ahh-hahahahaha! *leaves*\n76-BoysLifeofDespair.png\n6-Makoto2.png\n: Kyoko wears those gloves to cover up\na bunch of scars\n...? Wait...so on the back of her hand...\n45-FlashT.png\n47-FlashB.png\nThe tattoo... Wait, but no... Monokuma specifically said they were scars, right? And that's why Kyoko wears those gloves, to hide the scars. Which means... Those\nfake nails\non the corpse...\n21-Byakuya.png\n: Are you thinking about Kyoko again?\n6-Makoto2.png\n: ...Huh?\n38-Byakuya2.png\n: Forget about her. What matters right now is uncovering Monokuma's trap.\n6-Makoto2.png\n: His...trap?\n27-Byakuya7.png\n: God must have really hated you, to make you so dull.\n34-Byakuya5.png\n: Don't you remember what Monokuma *just* told us?\n6-Makoto2.png\n: He said there were sixteen students, right? Which means Mukuro was a student here...\n34-Byakuya5.png\n: Obviously, Monokuma was trying to tell us that\nMukuro is the one creating the rules to the game\n. But why would he tell us that? And why now?\n6-Makoto2.png\n: He said he wanted to make things clear so there wouldn't be any complaints later...\n34-Byakuya5.png\n: But the mere fact that he said that proves that Mukuro is connected to this case. *That's* why Monokuma revealed the existence of a sixteenth student. He needs to make our investigation fair.\n6-Makoto2.png\n: Mukuro is related to the case...?\n33-Byakuya6.png\n: Perhaps she's the one who killed Kyoko.\n6-Makoto2.png\n: What!?\n34-Byakuya5.png\n: That would explain why we would have to have a class trial, wouldn't it? If she's a student, and she killed someone, that would make her part of the school killing game.\nMukuro...is the killer? She killed Kyoko...?\n21-Byakuya.png\n: Anyone should be able to come to that conclusion, don't you think? In fact, that's exactly what I thought when the invesitgation first began.\n38-Byakuya2.png\n: But...based on what Monokuma just told us, I've changed my mind.\n27-Byakuya7.png\n: Mukuro Ikusaba isn't the culprit!\n6-Makoto2.png\n: Huh? What makes you say that?\n29-Byakuya9.png\n: We thought Mukuro, the Ultimate Despair, was the mastermind's true identity. But if that's true, Monokuma's behavior makes no sense. Why would the mastermind go out of their way to reveal themselves to us?\n6-Makoto2.png\n: That's a good point...\n29-Byakuya9.png\n: Mukuro giving us information that would raise questions about her would be bold, to say that least. It makes more sense, then, to assume that Mukuro *isn't* the culprit.\n6-Makoto2.png\n: So that's the trap... They want us to suspect Mukuro, and come to the wrong conclusion...\n11-Byakuya3.png\n: That's what makes sense to me.\nThe way you say it, it definitely does seem possible. But if that's really true... If Mukuro isn't the killer...then who is?\n21-Byakuya.png\n: Well then, I believe our work here is finished. Let's move on. I'm sure there are other places in need of investigation.\n6-Makoto2.png\n: I should find out if that key and the dojo really are connected...\n17-Byakuya14.png\n: Well? Are you coming?\n3-Narration.png\n: Next time, the dojo.\n2-BOX16.png\n4-Byakuya.png\n: Hurry up and check the locker. That's what we're here for, after all.\n6-Narration.png\n: Alright, alright...\nThere are wooden lockers here... They use woodblock keys, just like at those super traditional public bathhouses. It looks like the key we found in Kyokko's room really does go to one of these lockers...\n8-Byakuya9.png\n: Makoto, do you see the locker farthest to the right?\n8-Byakuya9.png\n: That's the only one that doesn't have a key in it at the moment. You understand what that means, right?\n10-Makoto2.png\n: I should probably use the key we found on that locker, right?\n11-Byakuya8.png\n: Well? Just try it!\n10-Makoto2.png\n: O-Okay...\nI took out the woodblock key and inserted it into the locker's metal lock, and...\n*Click*\nThe locker eagerly accepted the key, and it opened.\nThere are...arrows in here. It looks like...ten arrows in total.\n8-Byakuya9.png\n: They look like they're made of\ntitanium\n, which means they're quite strong despite how thin they are. Of course, without a bow they're nothing but strong little sticks.\nStrong...sticks...\nOh, there's something else inside the locker... It's a wadded up ball of duct tape. I wonder what this was used for...\n10-Makoto2.png\n: Is that...a bloodstain?\n8-Byakuya9.png\n: If it is, that means it must surely be related to the case.\nThis duct tape is related to the case somehow...? But...how could it possibly be involved?\nI think that's all the locker has to offer for now...\n8-Byakuya9.png\n: ...\n10-Makoto2.png\n: Is something wrong?\n8-Byakuya9.png\n: It's very odd, don't you think? The locker was hiding items that were clearly related to the case. But how did the key to the locker wind up in the victim's room...?\n18-Byakuya10.png\n: Or...perhaps......\n10-Makoto2.png\n: Byakuya...?\n20-Byakuya15.png\n: Forget it. Come on. We need to continue on to the next location.\n10-Makoto2.png\n: Huh? What next location?\n21-Byakuya7.png\n: There's still something we need to look into. We need to do more research on\nFenrir\n.\n10-Makoto2.png\n: Fenrir...? You mean the mercenary group that Mukuro was a part of? But...how are we supposed to find out about that?\n23-Byakuya4.png\n: Isn't it obvious? Where in this school would you go to do research on something?\nResearch...\n10-Makoto2.png\n: Are you talking about...the\narchive\n? That's right... The archive has all kinds of info that the general public doesn't have access to.\n24-Byakuya14.png\n: We only have so much time before the trial begins. Let's hurry.\n8-Byakuya9.png\n: I believe there was a file related to Fenrir somewhere over here...\nByakuya seemed to know the archive like the back of his hand, and went straight to a shelf in the back.\n8-Byakuya9.png\n: Ah, here we go.\nHe quickly returned with a file in hand.\n8-Byakuya9.png\n: Take a look at this.\n10-Makoto2.png\n: Umm...I have no idea what it says. What language is this?\n28-Byakuya3.png\n: How did you make it all the way to high school without learning a single word of French?\n10-Makoto2.png\n: Uh...I'm pretty sure *most* high schoolers can't speak French...\n21-Byakuya7.png\n: Well, whatever. I'll read it for you, but I expect you to repay your debt a hundred times over.\nA hundred times...? Isn't that kind of extreme?\n30-DISTRUST.png\n31-Byakuya22.png\n: \"Fenrir is\nan elite fighting unit\nbase out of the Middle East. Unlike military contractors, they are a fierce group of soldiers who engage in direct combat. They claim that a single member is equivalent to an entire company of regular soldiers. Just like Fenrir, the\nWolf of Ragnarok\n, their mere presence is enough to strike fear into any enemy. They have been involved in countless military battles and operations, most of which are highly classified.\n31-Byakuya22.png\n: \"However, some time ago, they\ncompletely ceased all activity\n. At present, their continued existence cannot be confirmed. There are unconfirmed reports that the key members of the group were all neutralized. Rumors indicate they were killed to keep them from revealing the many state secrets they'd acquired. Some, however, believe there was mounting internal tension within the group, and they simply imploded.\"\n32-Makoto11.png\n: ...\n34-Byakuya2.png\n: ...What is it?\n10-Makoto2.png\n: This all just sounds like some kind of...alternate reality.\n28-Byakuya3.png\n: Well, it isn't. This is *our* reality, the *only* reality. These people are part of our world. Their battlefields aren't much different from our lives here. An unpredictable, unimaginable world...\n23-Byakuya4.png\n: That's what makes it all so exciting.\n\"Exciting\" definitely isn't the word I would use...\n4-Byakuya.png\n: So, did anything jump out at you? This may be your last opportunity to learn about Fenrir.\nNow that you mention it...\n10-Makoto2.png\n: The report said something about where the name Fenrir comes from, right...?\n31-Byakuya22.png\n: That's right. It said Fenrir is...the\nWolf of Ragnarok\n. Speaking of which, would you like to know something interesting related to that? To show that they're a member of the team, each soldier that joins the squad...would get a\ntattoo representing Fenrir\nsomewhere on their body.\n10-Makoto2.png\n: What...?\nThey got a tattoo...of Fenrir...? Could that mean...!?\n38-Timeforthe5thTrial.png\n*Ding dong, bing bong*\n41-MonokumaTV.png\n: Time is utterly silent, and yet it constantly assaults us--organisms, the earth, natural phenomena... It damages us little by little, until the end. You should really think about that. Anyway! It's time to begin the\nclass trial\n! So, please meet up in the usual spot! Puhuhu... See ya later!\n42-DespairSyndrome1.png\n4-Byakuya.png\n: Then the time has come...\n10-Makoto2.png\n: All we can do now is try to uncover the truth during the class trial...\n4-Byakuya.png\n: It would seem that way. Let's go.\n45-DespairSyndrome2.png\n46-Hiro2.png\n: Whoa, Byakuya and Makoto showed up together!\n47-Hina23.png\n: Where the heck have you two been!? You just disappeared without a word!\n4-Byakuya.png\n: We were investigating, of course. How could you not figure that out by this point?\n48-Toko12.png\n: M-Makoto's ranked high enough for you guys to go off t-together...just the two of y-you...?\n49-Hina12.png\n: What, are you jealous?\n50-Hiro4.png\n: Or...are you making up some kind of creepy fantasy for yourself?\n21-Byakuya7.png\n: Stop talking and brace yourselves. He'll be here any second.\nAny second... He could show up at any time... When I imagined what was about to happen, I immediately tensed up and prepared myself. But...\nWe stood there for five full minutes, waiting for something weird to happen. And then five minutes became ten...\n18-Byakuya10.png\n: What's going on here? Why hasn't Monokuma shown up yet?\n54-Hiro12.png\n: Maybe he died again...?\n55-Hina2.png\n: What should we do? Should we keep waiting here, or...?\n57-Monokuma4.png\n: Or what!?\n50-Hiro4.png\n: Jesus!\n58-Monokuma10.png\n: Nyohoho! Did I scare you?\n59-Byakuya6.png\n: I demand an explanation! Why did you waste my time and make me wait like that!?\n61-Monokuma11.png\n: What? I made you wait? You've got it all backwards. *You're* the ones making *me* wait!\n10-Makoto2.png\n: ...Huh?\n62-Monokuma.png\n: I'm waiting for everyone to arrive! We can't start till everyone's here, now can we?\n64-Toko5.png\n: What are you t-talking about...? Everyone *is* here. We've all been w-waiting for *you*.\n57-Monokuma4.png\n: Puhuhu... Sorry, but you're wrong.\n65-Monokuma5.png\n: But I've been waiting ten minutes now, so it's okay if I punish the one making us all wait, right? If we all agree it's a violation, I'll arrange a punishment right now--!\n♪\nMusic cuts out.\n♪\n???: If it's me you're waiting for...I'm here.\nWhen we heard that voice, we all spun around to look.\n67-NewWorldOrder.png\n68-Kyoko17.png\n: I'm here, and no rule's been broken.\n69-Makoto.png\n: K-Kyoko!\n70-Hina21.png\n: Kyoko!? You're still alive!?\n71-Hiro6.png\n: N-No...! That's a gh-gh-gh-ghost!\n72-Toko4.png\n: Stop t-talking...\n57-Monokuma4.png\n: If you wanna fight, do it at the class trial! You need to save some of the fun for later, right?\n73-Byakuya5.png\n: But is it okay that there's no particular penalty for being late?\n75-Kyoko2.png\n: I made it here just fine. What school regulation did I violate? Am I wrong?\n76-Monokuma9.png\n: You're so selfish... So spoiled! You're right. There's no penalty, officially. But I bet you'll be sorry later...\n77-Monokuma12.png\n: No, I'll make *sure* you're sorry later...!\n78-Monokuma6.png\n: Anyway, hustle your butts onto the elevator! I'll be just one step ahead of ya! *leaves*\nWhen Monokuma was gone, we all rushed up to Kyoko.\n69-Makoto.png\n: Kyoko...!\n70-Hina21.png\n: So you really didn't die!?\n80-Kyoko5.png\n: Of course I didn't die...\n81-Hina5.png\n: Thank God! I'm so glad you're okay!\n45-DespairSyndrome2.png\n21-Byakuya7.png\n: Perhaps, but that's not necessarily a good thing for us.\n69-Makoto.png\n: Huh...?\n83-Hiro9.png\n: He's right! Now we've gotta deal with a gh-gh-ghost!\n48-Toko12.png\n: I told you, stop t-talking...!\n24-Byakuya14.png\n: Come on, let's just go. Whatever we need to discuss, we can do it during the trial. *leaves*\nWithout ever looking directly at Kyoko, Byakuya stepped into the elevator.\n64-Toko5.png\n: Master! W-Wait for meee...!\n85-Hiro5.png\n: Good call. Who knows what might happen to us if we take too long...?\n86-Hina14.png\n: I'll be happy when this trial is all over...\nOne after another, everyone piled into the elevator. But I... I couldn't help myself. I had to talk to Kyoko before the trial started.\n69-Makoto.png\n: Listen, before we get started, I have to ask you...\n75-Kyoko2.png\n: ...\n69-Makoto.png\n: Where have you been this whole time? You used that key of yours to go somewhere, didn't you? So...\n68-Kyoko17.png\n: I went to investigate\nthe 2nd floor of the dorms\n.\n10-Makoto2.png\n: The...2nd floor?\n90-Kyoko3.png\n: There aren't any monitors or cameras there, so I was able to avoid Monokuma completely. Of course, I also missed his announcement because of that.\n68-Kyoko17.png\n: I had no idea a body had been discovered.\n10-Makoto2.png\n: Then...when did you find out?\n75-Kyoko2.png\n: Just now. I finished my search and came back down, just in time to hear the class trial announcement. I took some time to go over the crime scene first. I can't go to a trial completely uninformed, can I?\n10-Makoto2.png\n: So that's why you were late...\n68-Kyoko17.png\n: I'm sorry I kept you all waiting.\n10-Makoto2.png\n: But...if you were on the 2nd floor of the dorms...then that's what the key you found goes to?\n92-Kyoko11.png\n: Actually, to be precise...not quite.\n68-Kyoko17.png\n: I used\nMonokuma's secret tool\n, which can open any lock in the school.\n10-Makoto2.png\n: What...!?\n95-Hina22.png\n: Hey! What are you two doing!? Hurry up, before we get in trouble with Monokuma!\n68-Kyoko17.png\n: We can go over all the details after we get through the trial, okay Makoto? Right now I just want to focus on surviving our current situation.\n97-Kyoko13.png\n: Because this is probably the single most crucial moment so far for me.\nFor...her? That's a strange way to put it... The class trial is important for everyone, right? So why would she say it's a crucial moment for *her*?\n98-Kyoko19.png\n: Well, if that's all...\nSeemingly unconcerned, Kyoko made her way to the elevator. I'm just...overthinking what she said, right...?\nBeing the last one left, I stepped into the elevator.\n♪\nNo Music.\n♪\nAnd the doors slid shut...\nThis time, the clunking was loud enough to hurt my ears, and the dread began to consume me once again... I can't imagine ever getting used to the mental pressure that comes with preparing for an execution. In that dusky darkness, nobody said a word. We just stood there, silent and still.\nAfter an immeasurable period of time, the doors opened without warning... A dazzling light penetrated every depth of my eyes. But it wasn't the illuminating light of hope...\nIt was the blinding light of despair.\n105-ToSurvive.png\n62-Monokuma.png\n: Ahh, I've been waiting for this! I feel like it's been forever since we got together like this... The time for pointless jokes and jabs has passed.\n65-Monokuma5.png\n: Let's get on with the show!\nAnd so, the curtain opened for the fifth time...\nA deadly judgment... A deadly deception... A deadly betrayal.\nA deadly riddle, a deadly defense, and deadly faith...\nA deadly...class trial...!\n110-UndergroundTrial.png\n6-Narration.png\n: Welcome to the 5th class trial. With everyone alive, who is dead? Who's even the killer? Did we do it without realizing? This one's gonna get good.\n6-Narration.png\n: The ticker along the bottom reads:\n\"Memories float back, Kyoko is gone, and a mysterious masked body appears--the threads holding them all together begin to spin and twine into one...\"\n6-Narration.png\n: We picked up one new skill this chapter. Let's see what it does.\nCrystal Prediction:\nDecreases an argument to three statements or less. Effective during the Nonstop Debate, and the Bullet Time Battle Final Strike. Costs 5 SP.\n-This skill came from Hiro. By now in the trial we typically have 5 bullets to choose from during any given debate. This skill eliminates false possibilities, leaving only three behind. It's pretty handy on harder difficulties but I don't have much reason to use it here, especially when it needs that much SP to use. I'm not willing to give up anything else for it.\n6-Narration.png\n: We only got 1 more SP this chapter and unfortunately that isn't enough to give us enough SP to equip anything else. I thought about unequipping something and trading for another, but in the end I decided to stick with what I took to Chapter 4's trial:\nAlgorithm, Upshift, Cool and Composed, Robot Jock, Melodious Voice and Handiwork\n. This puts me at 15/17 SP used up. If I had 2 more SP I would've equipped Breathing Technique to make my Focus Gauge recharge faster as a \"just-in-case\" measure.\n6-Narration.png\n: Lastly, let's go over our Truth Bullets.\n113-Tutorial.png\n: They had also been struck in the head with an object about as thick as a metal pipe. The body was covered with other wounds, but these were at least several days old.\n113-Tutorial.png\n: ...wet, while the bottom half remained dry.\n113-Tutorial.png\n: It's hard to imagine these two events are unrelated...\n113-Tutorial.png\n: ...would have gotten wet.\n113-Tutorial.png\n: ...together they head to the headmaster's room.\n113-Tutorial.png\n: 9 a.m.: Toko is told to find the pickaxe in the garden, where she discovers the body.\n113-Tutorial.png\n: ...the masked assailant was holding when they attacked Makoto.\n113-Tutorial.png\n: ...Yasuhiro, Toko, and Aoi were in the gym the entire night, and none of them were alone at any point.\n113-Tutorial.png\n: ...but the blood was still wet. It was noted, however, that there was no blood on the ground around the body.\n113-Tutorial.png\n: ...years later\n113-Tutorial.png\n: Apparently, every member of Fenrir gets a tattoo somewhere on their body to represent their membership in the group.\n113-Tutorial.png\n: ...is to hide something she doesn't want anyone to see.\n6-Narration.png\n: And with that, join me next time for Trial 5.\n",
    "evidence_objects": [
        {
            "name": "Monokuma File #5",
            "description": "Due to the the explosion, the victim's identity is unknown. They were, however, dead before the blast. The victim had been stabbed a single time with a knife, which went completely through the body. They had also been struck in the head with an object about as thick as a metal pipe. The body was covered with other wounds, but these were at least several days old."
        },
        {
            "name": "Exploded Body Analysis",
            "description": "The explosion has burnt the upper half of the body beyond recognition. The upper half of the body remained on fire and had to be extinguished. Because of this, the upper half was soaking wet, while the bottom half remained dry."
        },
        {
            "name": "Fake Nails",
            "description": "The body was wearing notably long fake nails."
        },
        {
            "name": "Tattoo on the Right Hand",
            "description": "The body had a tattoo of a dog on the back of the right hand."
        },
        {
            "name": "Fragments Near the Dead Body",
            "description": "There were bits of charred debris near the body. It seems familiar to something that was seen earlier..."
        },
        {
            "name": "Sprinklers",
            "description": "The sprinklers are programmed to come on every morning at 7:30, and this time is impossible to change. As such, it can be assumed that if the body had been in the garden before 7:30, it would have gotten wet."
        },
        {
            "name": "When the Body Was Found",
            "description": "7 a.m.: Makoto wakes to the morning announcement. 7:30 a.m.: Makoto and Aoi arrive in the dining hall. 7:30-9 a.m.: Makoto meets the others in the gym, and together they head to the headmaster's room. 9 a.m.: Toko is told to find the pickaxe in the garden, where she discovers the body."
        },
        {
            "name": "Knife at the Crime Scene",
            "description": "The knife found near the body was the same knife that was used to stab it before the explosion. It is also the same knife that Toko had given to Makoto for safe keeping, and the knife the masked assailant was holding when they attacked Makoto."
        },
        {
            "name": "Tarp",
            "description": "The tarp was hidden among the other items in the toolshed. One side was wet and filthy with mud and grime. The other side was completely clean and dry."
        },
        {
            "name": "Chicken Coop Chickens",
            "description": "The number of chickens in the chicken coop had decreased from five to four. Yasuhiro claims that there were without a doubt five chickens just before nighttime last night, and yet..."
        },
        {
            "name": "Byakuya's Account",
            "description": "Byakuya stated that there was no corpse in the garden just after nighttime last night, so it can be assumed the murder must have taken place sometime after that. Byakuya also said that he, Yasuhiro, Toko, and Aoi were in the gym the entire night, and none of them were alone at any point."
        },
        {
            "name": "Body Before the Explosion",
            "description": "The corpse had a mask covering its head, and a white jacket covering the body. A knife had been thrust into the abdomen, and there were bloodstains around the wound. The body had stopped bleeding, but the blood was still wet. It was noted, however, that there was no blood on the ground around the body."
        },
        {
            "name": "Monokuma's Account",
            "description": "Apparently, the killing game began with sixteen participants—all students. It is assumed that Mukuro Ikusaba was the sixteenth student. Monokuma also revealed that the reason Kyoko wears gloves is to hide something she doesn't want anyone to see."
        },
        {
            "name": "Woodblock Key",
            "description": "This woodblock decoration was found in Kyoko's room. It looks like it's actually the key to one of the lockers in the dojo."
        },
        {
            "name": "Titanium Arrows",
            "description": "A set of titanium arrows was found in a dojo locker. There appear to be ten in total."
        },
        {
            "name": "Bloody Duct Tape",
            "description": "Along with the arrows, there was also a wadded up ball of duct tape in the locker. The duct tape had traces of blood on it. It's assumed that this is related to the case, but nobody can imagine how..."
        },
        {
            "name": "Kyoko's Account",
            "description": "Kyoko used Monokuma's \"secret tool,\" which grants access to any room in the school, to sneak into the 2nd floor of the dorms. This area seems to have no monitors or security cameras."
        },
        {
            "name": "Disguised Dead Body",
            "description": "The murder took place before the sprinklers turned on. The suspect covered the body with a tarp to prevent it from getting wet. Later, when they removed the tarp, the suspect placed the white jacket on the body. This jacket had previously been treated with blood to make it look like the corpse had been wearing it."
        }
    ],
    "events": [
        {
            "category": "cross_examination",
            "newContext": "3-ClassTrialDawn.png\n4-Monokuma.png\n: Let's begin with a basic explanation of the class trial! So, your votes will determine the results. If you can figure out \"whodunnit\" then only they will receive punishment. But if you pick the wrong one... Then I'll punish everyone *besides* the blackened, and the one that deceived everyone else will graduate!\n5-Monokuma11.png\n: ...Okay, well! I'll leave the rest up to you!\n7-Byakuya6.png\n: Well then, let's discuss the specifics of the victim. First, we need to clarify who exactly the unidentified victim is.\n8-Hiro5.png\n: It's Kyoko! There's no other explanation!\n9-Toko2.png\n: But Kyoko's standing right there...!\n11-Hiro16.png\n: No! That's a\n**\nghost\n!\n12-Kyoko17.png\n: ...\n13-Hina2.png\n: But...she has legs and stuff.\n8-Hiro5.png\n: Well that's just because...\n14-Hiro15.png\n: ...she's like the latest evolution in ghost technology!\n15-Byakuya.png\n: There's a limit to how much ridiculousness I can tolerate...\n17-Makoto37.png\n: Um, okay...so I just have to prove that the corpse isn't Kyoko, right?\n18-Makoto2.png\n: Then let's compare Kyoko's traits to the traits of the dead body.\n19-Hina11.png\n: Her traits...?\nOne important trait Kyoko has that proves the body doesn't belong to her...\n> Kyoko's gloves\n21-Makoto25.png\n: I'm talking about her\n**\ngloves\n. They'll give us some insight into the mystery, I'm sure of it.\n23-Byakuya15.png\n: In that case, I think it would be helpful is someone explained why she actually wears those gloves.\n24-Kyoko7.png\n: And would you happen to know the answer?\n25-Byakuya3.png\n: In fact, Monokuma told me. Apparently you have\n**\nscars on your hands you don't want anyone to see\n.\n12-Kyoko17.png\n: ...\n27-Hina21.png\n: Oh! You know, now that I think about it...the corpse wasn't wearing any gloves, right!?\n11-Hiro16.png\n: They probably just got burnt up in the explosion! I'm not convinced! The ghost is just trying to fool us all!\nThere's no way that corpse was Kyoko... But if I can't prove why, we're gonna be stuck here and the case won't move forward... So I don't have any choice but to...\n",
            "testimonies": [
                {
                    "testimony": "That \"Kyoko\" there is just a ghost!",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "I-Impossible...",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "Okay, then prove it! Prove she's not a ghost!",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "The dead body ***wasn't wearing gloves*** !",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "They got burnt up in the explosion!",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "Then...she was wearing gloves before the explosion...?",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "Well, yeah! She ***must've been wearing gloves*** !",
                    "person": "Hiro",
                    "present": [
                        "Fake Nails"
                    ]
                },
                {
                    "testimony": "Cuz that corpse is absolutely Kyoko!",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "This entire discussion is idiotic...",
                    "person": "Byakuya",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "41-ClassTrialTHESUN.png\n18-Makoto2.png\n: No, there's no way the corpse was\n**\nwearing gloves\n. Whoever it was, they were wearing\n**\nfake nails\n, remember? I imagine trying to wear gloves over nails like that would have been a pretty big pain.\n21-Makoto25.png\n: Besides, Kyoko wears gloves to hide her hands, right? It'd be pretty weird for someone who's self-conscious about their hands to wear fake nails, don't you think?\n34-Hiro2.png\n: Jeez man, you don't know women, huh? They're complicated like that!\n42-Hina23.png\n: If anyone doesn't know women, it's you!\n44-Byakuya5.png\n: Well, Kyoko? Any thoughts?\n45-Kyoko2.png\n: These gloves were custom-made to the size of my hands to make sure they don't interfere with my daily life. If I wore fake nails, the gloves wouldn't fit properly.\n46-Makoto29.png\n: Then that's that. The dead body doesn't belong to Kyoko.\n15-Byakuya.png\n: Which should have been obvious, since she's standing right here...\n3-ClassTrialDawn.png\n8-Hiro5.png\n: Okay, so then...who's the real victim? First we need to figure that out!\n23-Byakuya15.png\n: That's the first thing I said. You're the one who's been dragging us around in circles...\nBefore anything, we have to\n**\nidentify the victim\n...! Everything starts from there...\n",
            "testimonies": [
                {
                    "testimony": "If Kyoko really is still alive...then who died!?",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "There's gotta be some way to figure it out.",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "I don't th-think so... The face was ***scorched beyond recognition*** ... And there wasn't any description in the Monokuma File.",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "Well if ***we can't identify the body*** ...",
                    "person": "Hina",
                    "present": [
                        "Tattoo on the Right Hand"
                    ]
                },
                {
                    "testimony": "...then there's nothing else we can do, right!?",
                    "person": "Hiro",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "We've established a timeframe for the murder. It took place somewhere between ***10 o'clock at night*** ...and 9 o'clock in the morning.",
                    "person": "Byakuya",
                    "present": [
                        "Sprinklers"
                    ]
                },
                {
                    "testimony": "Yup. And Makoto doesn't have an alibi for most of that time.",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "Yeah, from 10 o'clock... ***to 7:30*** .",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "That's more than enough time to commit murder, I should think. So Makoto, if you have any objections, now would be the time...",
                    "person": "Byakuya",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "By covering the body with the tarp, the killer prevented it from getting wet.",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "So the reason the tarp was ***only dirty on one side*** ...",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "...is because the sprinkler got that side wet!",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "But the underside of the tarp...",
                    "person": "Makoto",
                    "present": []
                },
                {
                    "testimony": "It was totally spotless, right?",
                    "person": "Makoto",
                    "present": []
                },
                {
                    "testimony": "It's cuz that side ***was protected from the water*** ! Since it was facing down toward the body...",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "...of course it ***didn't get dirty*** !",
                    "person": "Hiro",
                    "present": [
                        "Body Before the Explosion"
                    ]
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "The knife we found lodged in the dead body...",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "I-It's the same one we ***g-gave to Makoto*** !",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "It really is, isn't it? I was afraid of that...",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "If he did have that knife before, then...",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "...that seals it! Makoto did it!",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "Just because I had the knife once...",
                    "person": "Makoto",
                    "present": []
                },
                {
                    "testimony": "...that automatically makes me the killer?",
                    "person": "Makoto",
                    "present": []
                },
                {
                    "testimony": "Well, ***getting stabbed*** is what killed her right? So there's no question!",
                    "person": "Hiro",
                    "present": [
                        "Disguised Dead Body"
                    ]
                },
                {
                    "testimony": "You took that knife of yours and killed her with it!",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "What a horrible man you are, Makoto...",
                    "person": "Toko",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "18-ClassTrialTHESUN.png\n19-Makoto28.png\n: Wait, hold on.\n**\nThe stab wound\nisn't what killed Mukuro. That should be clear from the description of the cover-up we just heard!\n11-Hiro16.png\n: Lies! We never talked about what killed her!\n20-Makoto30.png\n: No, don't you remember? The killer covered the dead body with the tarp, and then put the bloody coat on it, right?\n21-Makoto29.png\n: In other words, the victim never wore that bloodstained coat until\n**\nafter they were dead\n.\n11-Hiro16.png\n: Okay, fine! So what!?\n8-Makoto25.png\n: So, when we discovered the body...\n22-FlashT.png\n24-FlashB.png\n8-Makoto25.png\n: ...the knife had been thrust through the coat along with the body.\n19-Makoto28.png\n: Meaning, if she wasn't stabbed until the coat was put on, and she was already dead at that point...\n20-Makoto30.png\n: ...obviously the stab wound isn't what killed her!\n26-Hiro5.png\n: M-Maybe you stabbed her twice! Once to kill her, and once to cover it up!\nThe victim was stabbed twice in the same spot? No, there's no way that's possible...\n> Present \"Monokuma File #5\"\n19-Makoto28.png\n: The Monokuma File clearly states that there was only\n**\none stab wound\n.\n29-Hiro8.png\n: Oh yeah, it sure did! I totally forgot about that!\n30-Hina9.png\n: Then the knife...\n8-Makoto25.png\n: ...was just another piece of\n**\ncamouflage\nset up by the true killer.\n22-FlashT.png\n24-FlashB.png\n8-Makoto25.png\n: They probably stabbed her to draw attention away from\n**\nwhat actually killed her\n.\n22-FlashT.png\n24-FlashB.png\n8-Makoto25.png\n: Exploding the body afterward was probably meant to do the same thing.\n22-FlashT.png\n24-FlashB.png\n8-Makoto25.png\n: The explosion severely damaged the body, making it impossible to know what really killed her.\n19-Makoto28.png\n: It was all the killer's attempt to\n**\ndestroy all evidence\nof their crime!\n35-Byakuya9.png\n: So they wanted us to notice the stab wound, and then detonated the body afterward... They meant for us to latch onto the knife as the cause of death, then destroy any evidence proving otherwise.\n30-Hina9.png\n: Oh, hey, I have a question! It kinda goes back to the beginning, but... What's the deal with that explosion, anyway? Why'd the body just blow up all of a sudden like that?\n36-Byakuya15.png\n: If you bothered to put that lump of grey matter between your ears to use, you'd know the answer...\n37-Hina22.png\n: Well if you're so smart, just tell me!\n10-Hiro2.png\n: I'll tell ya! I bet some unknown quantum particle caused an atomic-level spontaneous combustion!\n39-Hina15.png\n: I might be dumb, but even I'm not dumb enough to believe that!\n36-Byakuya15.png\n: Go ahead, Makoto. Tell her, or we won't make any headway on this.\nThere's only one explanation I can think of for the explosion...\n> Present \"Fragments Near the Dead Body\"\n42-Makoto26.png\n: After the explosion, we found a\n**\ntiny fragment\nof something on the ground near the body, right? That fragment reveals the\n**\ncause\nof the explosion.\n4-Hina2.png\n: Huh? You know, I feel like I've seen something like it before...\n19-Makoto28.png\n: That's only natural. Because, of course...\n22-FlashT.png\n24-FlashB.png\n19-Makoto28.png\n: We saw the same thing when we dismantled Monokuma. It's\n**\npart of a bomb\n.\n45-Hina21.png\n: Oh! Then the explosion was cuz of the Monokuma bomb!\n46-Byakuya.png\n: Anyway, the culprit's motive is becoming more and more obvious by the minute. They wanted the knife wound to look like the fatal injury so that we'd suspect Makoto.\n47-Byakuya2.png\n: And the only one who would benefit from that...\n49-ToSurvive.png\n50-Byakuya8.png\n: ...is the only other possible suspect. You,\n**\nKyoko\n.\n51-Kyoko17.png\n: ...\n52-Makoto20.png\n: Hold on a second, Byakuya...\n53-Byakuya5.png\n: ...What's the problem?\n52-Makoto20.png\n: Well I just feel like...we need to think this through. We still don't know what actually killed the victim.\n55-Hina20.png\n: That's true! It's definitely bugging me. What really killed her...?\n56-Byakuya3.png\n: ...Fine, I have no problem with that. Let us continue the debate. It won't change the facts of the case, regardless.\n51-Kyoko17.png\n: ...\nWe need to determine what ultimately killed the victim... I need to concentrate!\n",
            "testimonies": [
                {
                    "testimony": "Then shall we continue the debate? ***The victim's fatal injury*** has yet to be determined, correct?",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "The ***explosion*** didn't kill her for sure, I guess...",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "Well, yeah. She was already totally dead when that happened.",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "And it wasn't b-because of the ***knife*** , right? Th-Then there's only one other thing...",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "Oh yeah, um...according to the Monokuma File...",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "That's gotta be it! There was evidence that showed she was ***hit on the back of her head*** !",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "And more than that, the victim had suffered ***countless wounds*** across her entire body.",
                    "person": "Byakuya",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "The titanium arrow... It was in the dojo locker, right?",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "I have no doubt, ***that was the murder weapon*** .",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "Are you sure...?",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "You don't sound convinced. What's the problem?",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "Well, cuz in the Monokuma File...it said the weapon must've been about as think as a metal pipe, right? It seems like an arrow would just be ***too thin*** .",
                    "person": "Hina",
                    "present": [
                        "Bloody Duct Tape"
                    ]
                },
                {
                    "testimony": "Talking back to Master...",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "You have no r-right!",
                    "person": "Toko",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "15-ClassTrialTHESUN.png\n16-Makoto30.png\n: You're right. Just the one arrow would've been too weak. That's why the killer used\n**\nanother weapon\n.\n17-Hina11.png\n: Another weapon...?\n18-FlashT.png\n20-FlashB.png\n21-Makoto25.png\n: Inside the dojo locker, we also found a balled-up wad of\n**\nduct tape\n.\n16-Makoto30.png\n: The killer probably used this duct tape to\n**\nbind\nmultiple arrows together. Bundling them together using the duct tape would easily create a\n**\nsingle weapon as think as a pipe\n.\n23-Makoto29.png\n: And that's exactly what the killed did!\n24-Toko.png\n: It's similar to Aesop's fable about the bundle of sticks... One stick is weak, but put them together, and they become strong. It's meant to teach cooperation.\n25-Hiro13.png\n: Damn, that's harsh...\n8-Toko12.png\n: How is it harsh? Were you even listening?\n27-Byakuya9.png\n: Anyway, that explains the murder weapon. As for who the culprit is that stashed the weapon in the dojo locker...\n5-Byakuya4.png\n: It was you, Kyoko!\n29-Kyoko2.png\n: ...I've never been to the dojo.\n30-Byakuya8.png\n: Oh no, you absolutely have.\n6-Hina9.png\n: How can you say that with such confidence?\n31-Byakuya5.png\n: Because we have proof, of course. Don't we, Makoto?\n♪\n**\nMusic fades out.\n♪\n33-Makoto20.png\n: O-Oh, um... ...\n31-Byakuya5.png\n: Hm? What's the matter?\n34-Byakuya15.png\n: Surely you don't intend to protect a murderer... You know what will happen if you do, don't you? If you cover for the culprit, there's only one thing that can lead to...\n36-ClassTrialChaos.png\n31-Byakuya5.png\n: The death of us all. Remember?\n33-Makoto20.png\n: O-Of course I remember...!\n31-Byakuya5.png\n: Then show us! Show everyone the evidence that proves Kyoko went to the dojo!\n37-Kyoko17.png\n: ...\nI have evidence...? Evidence that\n**\nKyoko went to the dojo\n...\n> Present \"Woodblock Key\"\n40-Makoto31.png\n: The one thing that proves Kyoko was in the dojo is right here. The\n**\nkey to the dojo locker\n.\n41-Kyoko7.png\n: And how does that prove anything?\n42-Makoto35.png\n: Because...I found it in your room.\n41-Kyoko7.png\n: It was...in my room?\n31-Byakuya5.png\n: Don't bother trying to play dumb. That key is just the final piece of the puzzle. Your non-existent alibi, your clear motive, your attempts to frame Makoto for the crime...\n5-Byakuya4.png\n: This all proves that you are the true culprit. You can't explain this away, so just give up.\n44-Makoto36.png\n: ...Hold on a second.\n45-Byakuya7.png\n: Not this again. You really are dead-set on defending her, aren't you?\n33-Makoto20.png\n: No...it's not that I want to defend her. It's just... There's one more thing I need to ask her.\n41-Kyoko7.png\n: ...\n40-Makoto31.png\n: Kyoko, I want you to tell me something.\n18-FlashT.png\n20-FlashB.png\n40-Makoto31.png\n: Last night...you were in my room, weren't you? Why? What were you doing there? That's what I need to know.\n♪\n**\nMusic cuts out.\n♪\n41-Kyoko7.png\n: ...I was just...protecting you.\n49-Makoto33.png\n: What...?\nShe was protecting me...? Then does that mean she...?\n18-FlashT.png\n20-FlashB.png\nShe knew I was being attacked...\n18-FlashT.png\n20-FlashB.png\n...and she came to my rescue. Could that be when...!?\n53-DISTRUST.png\nWhich would mean that Kyoko... She killed someone...for me...?\n54-Byakuya.png\n: That's enough. The time for idle chatter is over. A verdict is close at hand...\n41-Kyoko7.png\n: Wait. I'm warning you, don't make this mistake. I'm not the killer.\n4-Byakuya3.png\n: I knew you were stubborn, but this is just getting ridiculous.\n41-Kyoko7.png\n: Really? But you should know better than anyone I didn't do it.\n36-ClassTrialChaos.png\n57-Kyoko13.png\n: Can you tell me I'm wrong?\n58-Byakuya12.png\n: I...should know?\nWhat...? Byakuya should know better than anyone...? What does that mean?\n",
            "testimonies": [
                {
                    "testimony": "Those words you just spoke... What do you mean?",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "Exactly what I said. I'm ***not the killer*** .",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "You should understand that more than anyone here.",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "Byakuya, what are you hiding!?",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "Master would n-never hide something from me!",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": ": ***There's proof*** that you aren't the culprit... Is that what you're saying?",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "You stated a theory earlier. You said I hid the evidence of my crime in the dojo locker...and then left ***the locker key in my own room*** . Correct?",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "But...could I really have done that?",
                    "person": "Kyoko",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "> Pursue the lie\n3-ClassTrialChaos.png\n4-Makoto32.png\n: There was a\n**\nlie\nhidden within Kyoko's statement just now...\n5-Byakuya12.png\n: A lie...?\n6-Makoto28.png\n: Isn't that right, Kyoko?\n8-Kyoko17.png\n: ...You said it. The burden of proof is on you.\n9-Kyoko13.png\n: So let's hear it. Where's the lie, then?\nKyoko is definitely lying. And it must be because...there's some deeper truth she wants to keep hidden!\n",
            "testimonies": [
                {
                    "testimony": "I didn't have the key to my room...",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "...because I'd ***given it to Byakuya*** .",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "There's no doubt about that, right?",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "You are correct.",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "So I couldn't possible have ***gotten into my room*** .",
                    "person": "Kyoko",
                    "present": [
                        "Kyoko's Account"
                    ]
                },
                {
                    "testimony": "Then...when we searched Kyoko's room...",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "...how else could ***the key*** have gotten there?",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "Someone other than me must have put it there. That's the only explanation.",
                    "person": "Kyoko",
                    "present": []
                }
            ]
        }
    ]
}