{
    "previousContext": "2-NewWorldOrder.png\nThe Ultimate Despair... A group of people who caused The Tragedy one year ago... Those same people put together this killing game and began broadcasting it around the world. The most desperately awful group of people ever... *That* is the mastermind's true identity. Our enemy has finally been revealed... But right now...\n4-Kyoko2.png\n: Right now we have to get out of this horrible place. Figuring out the rest of the story can come after.\n5-Makoto2.png\n: Yeah, you're right... Kyoko, do you still have that one thing? Monokuma's \"secret tool\" that you got from the headmaster's room?\n4-Kyoko2.png\n: Of course I do.\n4-Kyoko2.png\n: It's an absolutely vital part of ensnaring the mastermind. I would never part with it.\n5-Makoto2.png\n: And it can open any door in the school, right?\n7-Kyoko.png\n: That's right.\nThen we should be able to use it on that door, right?\n5-Makoto2.png\n: Hey, Kyoko. We can use that key of yours to open this door, right?\n7-Kyoko.png\n: Let's find out.\nKyoko took out the key with the Monokuma design on it and slid it into the keyhole. And then...\n*Click*\n5-Makoto2.png\n: Yes! It opened!\n4-Kyoko2.png\n: And now we can get out of here. Let's go.\n5-Makoto2.png\n: Sounds good.\nWe quickly opened the door and made our escape from the garbage pit.\nFinally... We were finally free. But there wasn't even time to take a breath of relief. Because the real fight had just begun...\n13-WelcometoDespair.png\nAfter leaving the garbage pit, we found ourselves in a tunnel extending straight up, like a chimney. There was a metal ladder leading up into the tunnel. We started climbing the ladder, intent on reaching the surface.\nThe ladder was impossibly long; I couldn't even see where it ended. We climbed into the darkness... The passage was so dark and cramped, I couldn't even see my own feet beneath me.\n5-Makoto2.png\n: I had no idea we were so far down...\n7-Kyoko.png\n: Don't lose your footing. If you slip, I won't be able to catch you...\n5-Makoto2.png\n: Y-Yeah, I'll be careful...\nBut now that you said that, I'm getting kind of nervous...\n5-Makoto2.png\n: ...\nMaybe talking will help keep my mind off it...\n5-Makoto2.png\n: Um, so Kyoko...there's something I wanted to ask you. You said you're the\nUltimate Detective\n, right? So how long have you been doing detective work?\n7-Kyoko.png\n: How long...? Ever since I can remember. I come from a long line of detectives. Detective work is in my blood. There was a time when being a detective was considered a sacred duty. My family's always seen it that way.\n5-Makoto2.png\n: Then...is your family famous?\n7-Kyoko.png\n: Quite the opposite, actually. Even among actual detectives, many people haven't heard of us.\n5-Makoto2.png\n: Huh? But...how come? It's like your family tradition, right? So...\n7-Kyoko.png\n: Because we take pride in it.\nPride...?\n7-Kyoko.png\n: A detective is neither light nor shadow. We represent neither justice nor evil. That is how we can uncover the absolute truth. We stand neutral in all things. And to do that, we have to stand separate from the rest of society. Which is why we've made a conscious effort to conceal our existence.\n16-Makoto35.png\n: A conscious effort...?\n7-Kyoko.png\n: It's kind of old-fashioned, and I can't say it's entirely rational... But it's our family creed, and we do what we must to protect it. Because, like I said, it's our source of pride.\nPride... So that explains...\n17-FlashT.png\n19-FlashB.png\nBefore I came here, when I was looking up info about the school online, I never saw anything about her. Because she hid herself on purpose, to protect the pride of her family...\n21-Kyoko17.png\n: And yet... I...gave up some of that pride.\n16-Makoto35.png\n: Huh...?\n7-Kyoko.png\n: In order to enter Hope's Peak, I had to reveal myself to the school. I did it knowing it was something a true Kirigiri detective would never do.\nBut the reason you gave up that pride... The reason you would go so far to enter Hope's Peak...\n16-Makoto35.png\n: It was because that's how much you wanted to reconnect with your dad, right? There's no shame in that.\n7-Kyoko.png\n: ...Reconnect...? I had absolutely no desire to reconnect with my father.\n16-Makoto35.png\n: Huh...? B-But...you'd be reuniting after all those years, right? You would've had so much to talk about...\n7-Kyoko.png\n: There's nothing I want to talk to my father about. There is something I want to *say* to him, though.\n16-Makoto35.png\n: What...?\n7-Kyoko.png\n: No matter what it takes, I have to find him and tell him, face to face...\n5-Makoto2.png\n: Wh-What is it...?\n23-DeathWish.png\n7-Kyoko.png\n: I want to sever all ties with him.\nSever...?\n21-Kyoko17.png\n: The last time I saw him...I was still very young. So I don't remember myself, but apparently he was extremely intelligent. He was in line to become the next head of the Kirigiri family. He was talented, he had a promising future. But he had no interest in detective work. So he cut himself off from the family. Not long after that, my mother died, and he simply...ran away. He went to my grandfather, and they had a huge argument. And young as I was...he left me behind.\n16-Makoto35.png\n: I-I'm sure there was a reason for that. I'm sure your dad wanted to take you with him.\n21-Kyoko17.png\n: If that's true, then I need to thank him. Thank him for leaving me... Because unlike him, I take\npride\nin the work I do. I take\npride\nin my family name. So every last part of me is happy he didn't take me with him. If I'd gone with him, I never would have had the chance to become a detective.\nI was above Kyoko on the ladder, so I wasn't able to see her expression. So I couldn't tell... I couldn't see how she looked when she said that, what she might have been feeling. All I could tell was that compared to her usual self...she was more talkative. And more emotional.\n7-Kyoko.png\n: I don't blame him, you know. He had his own life to live. That's what anyone in my position might say, right? But it's not true... There's one thing... One thing I can never forgive.\n16-Makoto35.png\n: Really...?\n21-Kyoko17.png\n: The way everyone else looked at me. I was never sad about being left behind. Like I said, I think it was a good thing. But when the rest of my family looked at me, they saw something different. They only saw me as\nthe little girl that was abandoned by her father\n. That's how they see me even to this day. His shadow has been following me my entire life. I'm sick of it. I need him out of my life. I need to step out of his shadow. That's why I have to find him, and tell him we're no longer family. In order to settle the past... In order to remove him from my life forever. I have no doubt he forgot about me years ago.\n5-Makoto2.png\n: B-But...you're family. To just cut him out like that...\n7-Kyoko.png\n: Our only connection is through blood, nothing more. Are we connected by heart and soul? No. Is blood really enough to call someone family?\nOnly connected by blood, not by heart or soul... I was so shocked to hear her say something like that, I didn't know how to respond. So instead...I said nothing.\nI just kept climbing the ladder in complete silence. And after I don't know how long...we finally reached the top.\n26-BeautifulDeath.png\n5-Makoto2.png\n: Looks like this is it.\n7-Kyoko.png\n: On the other side of this door...Hope's Peak is waiting for us.\n5-Makoto2.png\n: We're...back.\n7-Kyoko.png\n: Remember that hatch on the ground near the trash room? I'm fairly certain that's where we'll come out. I unlocked it earlier, so it should open without much trouble.\n5-Makoto2.png\n: Well, here goes nothin'...\nI reached my right hand up and pushed against the hatch.\n*Creak*\nThe hatch opened with ease. And so...\n5-Makoto2.png\n: Looks like we're back...\n21-Kyoko17.png\n: But I can't believe how long that ladder was. I'm exhausted...\nI can't exactly say we're safe and sound, but...at least we're out of there. Now we're back in Hope's Peak Academy...\n5-Makoto2.png\n: Kyoko...thank you. I never would've gotten out of there without you.\n4-Kyoko2.png\n: No thanks necessary. I was just returning the favor.\n5-Makoto2.png\n: So...now what do we do? I'm glad I didn't die, of course, but if the mastermind finds out... And I'm worried about you, too. You helped me, so they might...\n30-Kyoko7.png\n: You're worried?\n5-Makoto2.png\n: Y-Yeah, of course.\n4-Kyoko2.png\n: Then let's just get a concrete answer.\n5-Makoto2.png\n: Huh...?\n32-DISTRUST.png\n33-Kyoko13.png\n: Let's ask Monokuma if there's a problem with you escaping.\n5-Makoto2.png\n: W-Wait, that's--!\n4-Kyoko2.png\n: If we try to hide, it's only a matter of time till we're found out. And it's not like we can run away.\nAs she said that, she pointed at the nearby surveillance camera.\n5-Makoto2.png\n: So you're saying rather than stressing out over getting caught, we should just give up now?\n21-Kyoko17.png\n: Don't worry. What you think is going to happen, isn't.\n33-Kyoko13.png\n: Because the mastermind is the one that's ensnared.\nThe mastermind is ensnared...\n5-Makoto2.png\n: You said something like that before. What does it mean...?\n30-Kyoko7.png\n: The mastermind stood exposed during the investigation into Mukuro's death. There was a moment where the mastermind let their guard down.\n5-Makoto2.png\n: There was...?\n36-Kyoko3.png\n: If we can talk to Monokuma, we can confirm it. And it'll be better for us if we go to him directly before he tracks us down. That should help with out negotiations...\n...I'm still a little--no, super uneasy about this.\n5-Makoto2.png\n: But...we don't really have a choice, do we?\n4-Kyoko2.png\n: Monokuma should be in the gym. Let's get going.\n2-DISTRUST.png\n8-Narration.png\n: Here goes nothing...\n10-Monokuma2.png\n: Hey hey hey hey hey hey HEY!\n12-MrMonokumaAfterClass.png\n10-Monokuma2.png\n: Kyoko I don't mind so much.\n13-Monokuma6.png\n: But Makoto's supposed to be dead! What's HE doing here!?\nThat's exactly how I thought he'd react... Are we really gonna be okay...?\n14-Monokuma3.png\n: You were supposed to be punished! Did Kyoko help you!?\n15-Kyoko2.png\n: So what if I did? What will you do?\n17-Monokuma12.png\n: If the guilty party is exposed during the class trial, they alone will be executed. It's unfortunate, but that *is* the rule...\n13-Monokuma6.png\n: So now I gotta punish you again! And this time I won't leave anything to chance!\n18-Makoto2.png\n: K-Kyoko...!\n15-Kyoko2.png\n: Do whatever you feel you have to.\n18-Makoto2.png\n: What!?\n20-Kyoko3.png\n: But before you do, let me just say one thing.\n21-Kyoko13.png\n: If you execute Makoto, that means you lose. Not that that matters to you, right?\n22-Monokuma11.png\n: Huh? I...lose?\n13-Monokuma6.png\n: You! Explain yourself! What do you mean by that!?\n24-Kyoko11.png\n: Well you set up this latest class trial yourself, right? I was getting in your way, so you wanted an excuse to kill me.\n21-Kyoko13.png\n: I was supposed to be chosen as the blackened and then executed, right?\n10-Monokuma2.png\n: H-Hey, what are you talking about?\n25-Kyoko15.png\n: But when Makoto chose to overlook my lie, your plan came crashing down. The results of the trial weren't at all what you were expecting. Because you never imagined that in that position, one person would protect another like that.\n26-Kyoko17.png\n: And in response to that unexpected development...\n21-Kyoko13.png\n: ...you reacted by proclaiming *Makoto* the blackened and trying to execute *him*. You made that choice out of desperation. No, more than that... You must have realized that Makoto, who refused to be manipulated, was a threat to you, as well.\n28-Monokuma.png\n: ...\n24-Kyoko11.png\n: But then there was *another* unexpected development waiting for you. An entity that would throw a wrench, so to speak, in your precious execution machinery.\n18-Makoto2.png\n: Alter Ego...\n25-Kyoko15.png\n: You never imagined the possibility of a being that could come to our aid even after you'd \"killed\" it.\n30-Kyoko16.png\n: Now, here's the absolute truth. Makoto didn't kill Mukuro. You did.\n28-Monokuma.png\n: ...\n31-Kyoko14.png\n: So executing Makoto for it would surely be a violation of your rules, which I know you love so much. If the blackened is exposed, they alone will be executed. That's what you told us, right?\n28-Monokuma.png\n: Hmph. And that means I lose? You talk a big game. You're saying the blackened is me and not Makoto?\n22-Monokuma11.png\n: And you can prove this, right?\n15-Kyoko2.png\n: No, I can't.\nDon't just say it like that!\n10-Monokuma2.png\n: What is this, a comedy routine? To make such bold claims without a shred of evidence...\n15-Kyoko2.png\n: I don't have any right now, but with a little more time I guarantee I'll find some.\n21-Kyoko13.png\n: Because no matter how deeply you try to bury it, there is only ever one absolute truth.\n10-Monokuma2.png\n: And now you're trying to talk like some kind of famous detective type?\n26-Kyoko17.png\n: If Makoto really was the killer, he never would have come to you willingly like this. He would have feared for his life, feared another execution. He would have tried to run and hide. He would have been gripped by the despair you so love to inspire.\n34-Kyoko.png\n: But here we are--confronting you with nothing but hope in our hearts.\n10-Monokuma2.png\n: And that's supposed to be enough to convince me in the absence of evidence?\n26-Kyoko17.png\n: It's not you I'm trying to convince.\n36-NewWorldOrder.png\n34-Kyoko.png\n: If you were to execute Makoto now,\neveryone out there watching this\nwould be extremely displeased.\n18-Makoto2.png\n: Huh...?\n21-Kyoko13.png\n: Imagine what everyone out there would think if you killed Makoto... They would assume that you killed him because what we said is exactly right.\n31-Kyoko14.png\n:\nDespair\ncan never kill\nhope\n.\n10-Monokuma2.png\n: Grh--!\n25-Kyoko15.png\n: Of course, you can say we're just making this all up. You're welcome to prove us wrong. No, you have no choice *but* to prove it. Because if you kill Makoto without proving your own innocence, you'll be accepting your own defeat.\n14-Monokuma3.png\n: Gh-grg-grah!\n21-Kyoko13.png\n: If you want to earn our despair \"fair and square\", then I suggest you take my advice.\n14-Monokuma3.png\n: ...So? What is this \"advice\" of yours?\n25-Kyoko15.png\n: To do Mukuro's trial over again. Only this time, you follow the school regulations to ensure a fair trial.\n30-Kyoko16.png\n: It's time for one last showdown--one final battle between\nhope\n...and\ndespair\n!\n25-Kyoko15.png\n: Well? That would make for a proper climax, wouldn't you say?\nA fair trial...one last showdown... In other words... This would be out chance to expose the true identity of Mukuro's killer--of the mastermind themselves! But...what reason would the mastermind have to accept the challenge? They'll probably just execute me without another word...\n♪\nMusic fades out.\n♪\n10-Monokuma2.png\n: ... ...\n40-Monokuma9.png\n: Kehehe... Interesting.\n28-Monokuma.png\n: Beary interesting indeed!\n18-Makoto2.png\n: ...Beary?\n42-MrMonokumasLesson.png\n43-Monokuma4.png\n: Oh, I was getting bored, so I decided to change things up a little. So, time for bear jokes! Now, what you've suggested might be pawsible. It would certainly make for one honey of a climax!\n21-Kyoko13.png\n: Does that mean you accept?\n28-Monokuma.png\n: If we do things your way, that'll be enough to convince you *and* the viewers, right? And it would cause you unbearable despair, right? Then I'm prebeared to agree to your terms!\n10-Monokuma2.png\n: Will your hope win out? Or will my desbear claim victory...?\n45-Monokuma5.png\n: Let's have one final grizzly showdown!\nHe agreed...! Then we still have a shot at this...!\n43-Monokuma4.png\n: But this is the long-awaited climax, right? Just guessing the killer is bearly a fitting end. So for this final face-off, you'll have to unearth all the mysteries that have been bearied here!\n18-Makoto2.png\n: All the mysteries...?\n28-Monokuma.png\n: That's right. Every last mystery that's pawing around the school. If you can do that...\n45-Monokuma5.png\n: ...then that'll be enough to koalafy as a victory for you!\n25-Kyoko15.png\n: That's what we've been trying to do all along...\n28-Monokuma.png\n: Okay, well, good! Then let's bear it all! If you can claw your way to the truth of Mukuro's death, AND solve the mysteries of this school...\n17-Monokuma12.png\n: ...then you win!\n43-Monokuma4.png\n: But if you *can't* do all of that...\n21-Kyoko13.png\n: We'll all face execution. Right?\n43-Monokuma4.png\n: Kehehe... I can bearly contain my excitement... When you learn the whole truth...what kind of despair will you show me?\n25-Kyoko15.png\n: We're as excited as you are, I'm sure.\n31-Kyoko14.png\n: When we've uncovered every last truth, how will the Ultimate Despair reveal their own despair...?\nI honestly can't believe how this has all turned out...\n♪\nMusic fades out.\n♪\n21-Kyoko13.png\n: But before we get started, I want to clarify one more thing. Do you remember the rule? When one student kills another, that's when a class trial is held.\n22-Monokuma11.png\n: I remember that, fur sure. So what?\n34-Kyoko.png\n: I just want to confirm, that *is* what you said, right? And it's a true statement?\n2-DISTRUST.png\n43-Monokuma4.png\n: Kehehe. You don't have to be so suspicious. I've said it before, but it bears repeating... Everything is based on the school regulations. And having a trial for Mukuro is no exception to that.\n18-Makoto2.png\n: Huh...?\nMukuro's trial is no exception? Then...it's part of the regulations? Which would have to mean that whoever killed Mukuro...\n43-Monokuma4.png\n: Kehehe... It's a very polarizing approach, I know, but--okay, enough puns. Anyway, here's a hint... I'm sure I told you this already, but...this\nkilling game\nbegan with sixteen participants, all of them high school students. And the only people to take a single step in Hope's Peak since the killing game began...are those sixteen students.\n18-Makoto2.png\n: What...?\n48-Kyoko7.png\n: Are you telling the truth?\n28-Monokuma.png\n: ... ...\n18-Makoto2.png\n: Why'd he go quiet all of a sudden...?\n43-Monokuma4.png\n: ...Puhu... Puhuhu...\n42-MrMonokumasLesson.png\n13-Monokuma6.png\n: I'm done talking! I got nothin' left to say to you! So get lost, would ya!?\n18-Makoto2.png\n: Why so mad!?\n26-Kyoko17.png\n: He seems...emotionally unstable.\n13-Monokuma6.png\n: Leave me alone! Get outta here!\n18-Makoto2.png\n: O-Okay, I'm going. I just... You're really gonna let me go?\n13-Monokuma6.png\n: ...\n10-Monokuma2.png\n: Hmph. I don't even care anymore. You're all gonna get your punishment later anyway. I need to start getting it ready. A super duper extra special punishment, overflowing with despair...\n43-Monokuma4.png\n: Puhu... Puhuhu... Puhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhu...\n48-Kyoko7.png\n: Come on, Makoto. Let's go.\n18-Makoto2.png\n: Okay...\n43-Monokuma4.png\n: Puhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhuhu...\nMonokuma's unstable laughter seemed to cling to us as we walked away. And just like that, we were out of the gym.\n51-BeautifulDeath.png\n...I could hardly believe it, but...somehow I ended up not getting executed. I still had my life, and we still had a chance... Overall, things turned out way better than expected.\n24-Kyoko11.png\n: ...\nOnce again, I was in Kyoko's debt.\n18-Makoto2.png\n: Kyoko...thank you. Everything I have right now is because of you.\n15-Kyoko2.png\n: Don't thank me just yet. The real battle is still ahead of us.\n18-Makoto2.png\n: Yeah, true...\n54-Kyoko5.png\n: But still, I'm glad it worked out. I wasn't sure it the enemy would accept my proposal.\n18-Makoto2.png\n: B-But honestly, why would the mastermind agree to that? I mean, they don't stand to gain anything from a final showdown, do they?\n15-Kyoko2.png\n: They had no choice but to accept.\n18-Makoto2.png\n: Huh...?\n34-Kyoko.png\n: It's all because of that one moment that the mastermind\n[let down their guard]\n, like I said.\n> let down their guard\n18-Makoto2.png\n: So when was it that the mastermind let their guard down...?\n21-Kyoko13.png\n: I wasn't there to hear it myself, but do you remember what the mastermind said? They said they had\nhijacked the airwaves to broadcast our school life to the outside world\n, right?\n18-Makoto2.png\n: Y-Yeah, they definitely said that...\n56-Kyoko12.png\n: And what did you think when you heard that? Pretty hard to believe, right?\n18-Makoto2.png\n: Well...I mean, the idea of actually taking over the airwaves seems so...unbelievable.\n24-Kyoko11.png\n: You don't exactly read about something like that happening very often, so it's hard to imagine. In other words, that kind of thing is extremely difficult to pull off.\n21-Kyoko13.png\n: And yet somehow...the mastermind was able to do it.\n31-Kyoko14.png\n: But think of it another way--there must have been some reason they *had* to do something that difficult.\n18-Makoto2.png\n: A reason...?\n21-Kyoko13.png\n: They had to show the world something, no matter the cost--us killing each other.\n18-Makoto2.png\n: They wanted to show the world...?\n24-Kyoko11.png\n: The mastermind has been very adamant about not killing us directly, but\nforcing us to kill each other\n. And all their rules and regulation were designed to encourage that.\n18-Makoto2.png\n: Yeah, that makes sense. If those stupid regulations didn't exist, nobody would've killed anybody...\n21-Kyoko13.png\n: So the mastermind's ultimate goal was to make us kill each other, and show that off to the world.\n18-Makoto2.png\n: But...why?\n26-Kyoko17.png\n: To prove a point, most likely.\n18-Makoto2.png\n: Prove...a point?\n34-Kyoko.png\n: The outside world has a name for the students of Hope's Peak, right? A certain concept...\n18-Makoto2.png\n: You're talking about \"hope,\" right?\n26-Kyoko17.png\n: And for those of us who represent\nhope\nto kill each other and sink into\ndespair\n...\n60-DespairSyndrome2.png\n21-Kyoko13.png\n: The mastermind wants the world to see that, to try and prove that\ndespair\nis better than\nhope\n. That's their goal, as the Ultimate Despair.\n18-Makoto2.png\n: ...What?\nThey want to prove that despair...is better than hope?\n18-Makoto2.png\n: But that...that's ridiculous!\n26-Kyoko17.png\n: You're right. It *is* ridiculous, completely irrational. It's the kind of thing that nobody but those who call themselves the Ultimate Despair would devise. That group whose only purpose and motivation comes from despair...\n18-Makoto2.png\n: B-But--! Is that really their only reason for making the rest of us suffer!?\n48-Kyoko7.png\n: I know how angry it must make you. And yet...that same motivation is what led to the mastermind revealing their weakness.\n18-Makoto2.png\n: What...?\n21-Kyoko13.png\n: Because their goal is to broadcast this killing game to the world...the mastermind has had to be more particular than is reasonable about their own regulations. If the mastermind simply ignored their rules, this wouldn't have been a \"game,\" but a one-sided slaughter.\n31-Kyoko14.png\n: At least, that's how\nthose who are watching this\nwould have seen it.\n18-Makoto2.png\n: And that's why the mastermind couldn't kill any of us themselves?\n21-Kyoko13.png\n: That is precisely the reason. No matter how much they may hate what I'm doing, I haven't violated a single one of their regulations.\n62-FlashT.png\n64-FlashB.png\n21-Kyoko13.png\n: Junko broke the rules, so she was punished. But in my case, they couldn't lay a finger on me. So instead, they tried to use the class trial, following all their proper rules, to get me killed. They began a trial that didn't have a right answer, then made me out to be the killer.\n18-Makoto2.png\n: But even that didn't work...\n15-Kyoko2.png\n: Yes, thanks to you. And due to that failure, the mastermind took yet another risk.\n18-Makoto2.png\n: And when that fact was exposed on live TV to the entire outside world...the mastermind had to accept your suggestion?\n24-Kyoko11.png\n: To prove to the world that despair is better than hope, they have to defeat us in perfect form...\n21-Kyoko13.png\n: It would only do the mastermind harm to have it shown that they'd violated their own regulations.\n18-Makoto2.png\n: But all of that was a hunch, right? And you were still able to get the mastermind to accept your challenge...\n21-Kyoko13.png\n: Well, it's only thanks to you that we got that chance. Because you believed in me, another path opened up.\n18-Makoto2.png\n: Still, I can't believe how much of the mastermind's thoughts and plans you were able to figure out. I didn't have the slightest clue...\n20-Kyoko3.png\n: In the end, though, I couldn't prove any of it. It was just my reasoning. Essentially, I was making a bet.\n26-Kyoko17.png\n: But it looks like I got it right. This time, at least, I won the bet.\nShe let out a quick sigh. I took it as a small sign of relief.\n54-Kyoko5.png\n: To be honest, I haven't been that nervous in a long time.\n18-Makoto2.png\n: I totally couldn't tell you were nervous at all... You seemed totally confident from the moment we decided to go talk to him.\n25-Kyoko15.png\n: Well, presenting a strong demeanor is a fundamental part of negotiation and persuasion, wouldn't you say? Plus, if I'd showed my uneasiness, that would have just made you that much more uneasy.\nYeah, you're probably right. How pathetic...\n34-Kyoko.png\n: Anyway, we can't relax just yet. All we've done is earn another chance to fight. We have to win this time.\n26-Kyoko17.png\n: Or everything we've gone through will have been for nothing...\n18-Makoto2.png\n: You're right...\nIf we can't defeat the mastermind, it'll cost us our lives...! There is no option except to win!\n15-Kyoko2.png\n: But before we begin the final battle, we have to tell the others what's going on.\n18-Makoto2.png\n: True, but now we know who our real enemy is. All we have to do now is work together with everyone to destroy the mastermind...!\n15-Kyoko2.png\n: Work together with everyone...\n20-Kyoko3.png\n: Is that really possible?\n18-Makoto2.png\n: ...Huh?\n15-Kyoko2.png\n: Anyway, right now we have to go find the others. They're probably in the dorms somewhere. Shall we go?\n2-Narration.png\n: The dining hall is usually where we find the others.\nAnd suddenly, we were greeted with...\n5-MrMonokumasLesson.png\n6-Monokuma.png\n: Skrgh@yaGfew, anji&\\krakAW;! fzzlbRff#[]\n7-Makoto2.png\n: You again...\n8-Monokuma7.png\n: Hrskzzzz_dat.; EgspllER103.2.1.255\n7-Makoto2.png\n: Is he...broken?\n10-Kyoko2.png\n: I suppose his emotional instability reached its limit.\n11-Monokuma12.png\n: aG^3. 4sum=(SEN|akt~____ 61! *leaves*\n7-Makoto2.png\n: Jeez... What the heck?\n♪\nMusic fades out.\n♪\n13-Kyoko7.png\n: I wonder what that was all about...\nI couldn't help but let out a sigh of relief.\n???: Ah--!\n15-BeautifulDays.png\n16-Hina31.png\n: Is that...Makoto?\n17-Makoto.png\n: Y-You guys!\n16-Hina31.png\n: It is! There's no two ways about it, that's Makoto!\n18-Toko20.png\n: Huh? You s-survived?\n19-Byakuya24.png\n: Jeez... You're like a stubborn little cockroach, you know that?\n20-Hiro21.png\n: I'm just asking to make sure, but...you're not a ghost, right?\nEveryone was there. All my friends who had struggled together...and survived... As soon as I saw their faces, I couldn't help myself... I started to tear up.\n♪\nMusic cuts out.\n♪\n22-Byakuya15.png\n: Wait...what's that smell?\n23-Hiro12.png\n: Yeah man, that seriously stinks!\n24-Hina12.png\n: It's Makoto! He smells like a wet dog!\n25-Toko12.png\n: G-Get away! Shoo! Shoo!\n17-Makoto.png\n: ...\nAnd in a flash, my tears dried up.\n27-BeautifulDeath.png\n2-Narration.png\n: Let's have a chat with the others before continuing the plot.\n29-Hiro18.png\n: Makoto! What was it like hanging out in the spirit world!?\n17-Makoto.png\n: I...didn't go to the spirit world.\n30-Hiro.png\n: Did you get to talk to her?\n17-Makoto.png\n: Who?\n31-Hiro2.png\n: Miss Cleo!\n17-Makoto.png\n: No, I didn't talk to her. I mean, I didn't go to the spirit world...!\nI mean--who the heck is Miss Cleo?\n2-Narration.png\n: (This is a really weirdly timed reference to make considering Miss Cleo actually died a few weeks ago...)\n34-Byakuya.png\n: I still can't believe you survived.\n17-Makoto.png\n: Yeah, me either...\n35-Byakuya2.png\n: You do realize why it is you escaped execution?\n17-Makoto.png\n: It was...Alter Ego. He...saved my life.\n34-Byakuya.png\n: Not too many people can say they had their lives saved by a computer program.\n36-Byakuya3.png\n: I imagine it was a learning experience for you.\n17-Makoto.png\n: So what have you guys been doing while I was gone?\n39-Hina2.png\n: Well, we figured that since the trial was over, we'd have access to new places again.\n17-Makoto.png\n: And?\n40-Hina14.png\n: No dice. All the rooms that were locked before...were still locked.\nSo there weren't any new areas... Then where can we go to find new clues?\n43-Toko4.png\n: Ugh, you s-stink...! Are you rotten!?\n44-Toko13.png\n: Rotten ph-physically, mentally, every way you can b-be rotten!\n17-Makoto.png\n: Sorry... I was rolling around in garbage for a while.\n45-Toko3.png\n: This smell is s-so...smelly...!\n46-Toko14.png\n: Ahaha! Super smelly! You smell even w-worse than me! Way worse than m-me!\n47-Toko10.png\n: ...I win.\nShe seems...happy for some reason.\n2-Narration.png\n: With that done, let's tell everyone what we've agreed to.\n13-Kyoko7.png\n: There's no time to indulge in an extended happy reunion. We need to explain to everyone what happened with Monokuma.\n50-Byakuya7.png\n: Explain...? Explain what?\n23-Hiro12.png\n: But is it okay that you're here? What if the mastermind catches you?\n51-Kyoko.png\n: That's related to\n[what I have to tell you all]\n.\n> what I have to tell you all\n7-Makoto2.png\n: I need to tell you all about...the last class trial.\n53-Hina9.png\n: Last class trial...?\n54-Kyoko13.png\n: We're going to redo Mukuro's trial.\n24-Hina12.png\n: What!? Seriously!?\n55-Hiro15.png\n: What's the point of redoing it? Makoto killed her, right?\n7-Makoto2.png\n: No, I didn't do it! Like I keep telling you...\n56-Kyoko17.png\n: Makoto isn't the killer. And of course it's not me or any of you.\n57-Toko5.png\n: Th-Then...who is it?\n35-Byakuya2.png\n: What she's saying is, it was all the work of the mastermind.\n59-Hiro7.png\n: What!? You're saying the mastermind killed Mukuro!?\n54-Kyoko13.png\n: That's right. It was all an elaborate trap contrived by the mastermind. Makoto spotted the trap in time, and did what he had to to stop it.\n56-Kyoko17.png\n: But his decision meant that *he* would be the one to die.\n60-Byakuya12.png\n: You spotted the trap, did you Makoto?\nYou make it sound like it was easy. I just, ya know...\n13-Kyoko7.png\n: But executing Makoto, who *wasn't* the blackened, is a clear violation of the school regulations. The rules state that *only* the blackened is to be executed. The mastermind broke their own rules.\n62-Kyoko15.png\n: Which is why I went and negotiated with them to have the trial one more time.\n24-Hina12.png\n: And the mastermind agreed!? Does that mean they really did break the rules...?\n34-Byakuya.png\n: They had no choice but to agree. You used the TV broadcast to gain the leverage you needed, didn't you?\n10-Kyoko2.png\n: Very observant of you.\n35-Byakuya2.png\n: I recall what you said at the end of the last trial... When you said \"\nNow it's the mastermind that's ensnared\n,\" that's what you were referring to.\n63-Hiro16.png\n: Hey! I'm totally in the dark here!\n50-Byakuya7.png\n: For anyone who doesn't understand, you can ask Kyoko to explain it again. Later.\n65-Toko2.png\n: So, knowing all th-this...what do we do now?\n66-Hina20.png\n: It's about who killed Mukuro, right? So our job is to expose the mastermind...?\n36-Byakuya3.png\n: But there's more to it than that, correct?\n7-Makoto2.png\n: Um, yeah... For us to win this time, we have to solve every last mystery surrounding the school.\n24-Hina12.png\n: Every last mystery...?\n53-Hina9.png\n: But we've been looking around all this time, and we still don't know anything, right?\n54-Kyoko13.png\n: You've probably guessed already, but if we lose this time...everyone dies.\n68-Hiro8.png\n: E-Everyone!?\n44-Toko13.png\n: H-Hey! Who said you could agree to those t-terms without talking to the rest of u-us!?\n69-Toko17.png\n: I'm fine with things the w-way they are! I'm fine living here forever with M-Master!\n22-Byakuya15.png\n: I, meanwhile, want to get out of here as soon as humanly possible.\n54-Kyoko13.png\n: Anyway, at this point the only way for us to survive is to unravel the truth.\n36-Byakuya3.png\n: In other words, one decisive final battle. A rather interesting development, I'd say.\n39-Hina2.png\n: But figuring out who the mastermind is, AND how they killed Mukuro, AND all the school's mysteries...\n71-Hiro13.png\n: It's a pretty tall friggin' order...\n7-Makoto2.png\n: Maybe, but this time the trial is different. We know who our enemy is now. So if we work together and search as hard as we can, I'm sure we'll solve all those mysteries!\n73-DespairSyndrome2.png\n10-Kyoko2.png\n: I'm not so sure about that.\n7-Makoto2.png\n: ...Huh?\n56-Kyoko17.png\n: I\n[can't agree]\nwith the idea of working together with everyone.\n> can't agree\n7-Makoto2.png\n: You...can't agree? Why not? I mean, working together with everyone seems like the most obvious way to solve all the mysteries...\n13-Kyoko7.png\n: That's what I thought, too...at first. Until Monokuma gave us that little hint of his...\nHint...?\n74-FlashT.png\n76-FlashB.png\n77-Monokuma4.png\n: Kehehe... It's a very polarizing approach, I know, but--okay, enough puns. Anyway, here's a hint... I'm sure I told you this already, but...this\nkilling game\nbegan with sixteen participants, all of them high school students. And the only people to take a single step in Hope's Peak since the killing game began...are those sixteen students.\n79-Byakuya9.png\n: Monokuma said that, did he? Then Kyoko's opinion is perfectly reasonable.\n80-Hina11.png\n: Huh? But why...?\n79-Byakuya9.png\n: If the mastermind really is the one who killed Mukuro, as Kyoko says...then the mastermind would have had to set foot in this school, right? Monokuma could probably murder Mukuro, but there's no way he could have disguised the scene like that.\n34-Byakuya.png\n: But according to Monokuma, the only people who have set foot in Hope's Peak...are the\nsixteen students\nwho have been taking part in the killing game.\n81-Toko7.png\n: Then...the m-masterming is...!\n82-FlashTLong.png\n84-FlashBLong.png\n81-Toko7.png\n: There were fifteen of us in the m-main hall at the very beginning... Add in M-Mukuro, and you get sixteen...\n86-ToSurvive.png\n87-Toko6.png\n: So the mastermind w-would have to be...one of them?\n88-Byakuya4.png\n: And of those sixteen people we started out with, the only ones still alive...are the people standing right here. Need I continue, or do you get it now?\n89-Hiro6.png\n: You're saying the mastermind is one of us!?\n90-Hina10.png\n: Y-You can't be serious!\n7-Makoto2.png\n: W-Wait! We can't say for sure that's true yet! Monokuma might have just said all that to confuse us...!\n92-Kyoko11.png\n: It's certainly a possibility. But only one among many...\n13-Kyoko7.png\n: The mastermind being one of us is *also* a possibility.\n22-Byakuya15.png\n: And that is one possibility we can't ignore.\n43-Toko4.png\n: Yeah! I mean, they're an u-ultimate, right? The\nUltimate Despair\n. So they m-must be a high schooler!\n25-Toko12.png\n: You can't say it's not p-possible...!\n7-Makoto2.png\n: But if one of us was the mastermind, they'd have to be controlling Monokuma somehow, right? But did you ever see anyone acting suspicious any time Monokuma was active?\n57-Toko5.png\n: Maybe they s-snuck off and controlled him i-in secret...\n53-Hina9.png\n: I don't care how sneaky you are, we would've noticed someone sneaking off that many times.\n55-Hiro15.png\n: Then maybe Monokuma was on autopilot! Maybe they loaded up all the dialogue and actions beforehand!\n7-Makoto2.png\n: In that case, there's no way he could have had all those back-and-forth conversations with us.\n79-Byakuya9.png\n: Well...it wouldn't be entirely impossible, if they directed the flow of the conversation.\n7-Makoto2.png\n: W-Well, maybe...but still!\n♪\nMusic fades out.\n♪\n94-TrueEndingMode.png\n*Ding dong, bing bong*\n97-MonokumaTV.png\n: Ahh, this is a school announcement. You've all probably figured this out by now, but at this point, the killing game has now entered \"\nTrue Ending\n\" mode. So in the name of fairness, I will unlock every room in the school! Look wherever you want! Solve the mystery in whatever way you see fit! Puhuhu... Then we can all meet up at the class trial, okay? Gaahahaha! Ahahaha...!\n27-BeautifulDeath.png\n10-Kyoko2.png\n: How very magnanimous of him to unlock all the rooms.\n34-Byakuya.png\n: The time for talk is done. Now we need to begin our investigation.\n7-Makoto2.png\n: B-But...!\n34-Byakuya.png\n: I was planning on working alone from the beginning anyway.\n88-Byakuya4.png\n: At this point, I can rely only on myself, on the\nTogami blood\nflowing through my veins.\n100-Byakuya14.png\n: I have no time to worry about the rest of you. Each of you must uphold your responsibility. Well then... *leaves*\nAfter making his final statement, Byakuya left the dining hall.\n57-Toko5.png\n: Gaah! M-Master! He didn't take me w-with him...!\n102-Hiro14.png\n: Do ya blame him?\n25-Toko12.png\n: Without Master, the r-rest of you are like...coffee with cream w-without the cream! Or c-coffee!\n69-Toko17.png\n: You're totally useless!\n43-Toko4.png\n: S-So...bye! *leaves*\nWith that, Toko trudged out of the dining hall.\n104-Hiro4.png\n: And now *she's* gone... And you're gonna go off by yourself, right Kyoko?\n56-Kyoko17.png\n: That's right.\n105-Hiro5.png\n: Which just leaves Makoto, Hina, and me...\n23-Hiro12.png\n: ...\n31-Hiro2.png\n: In that case, I'm gonna go by myself, too!\n107-Hina15.png\n: Wait, how come!?\n55-Hiro15.png\n: Just wait and see! I'm gonna use my totally awesome spirit power to figure out the mastermind's identity!\n59-Hiro7.png\n: Hahahaha! *leaves*\nLaughing loudly, Hiro left the dining hall...\n40-Hina14.png\n: Everyone's really gonna go off by themselves...?\n7-Makoto2.png\n: What about you, Hina?\n66-Hina20.png\n: Umm... I guess I'll do the same thing.\n39-Hina2.png\n: I mean, it's not that I don't trust everyone, ya know?\n40-Hina14.png\n: But...up till now, I haven't really been all that useful. I just depended on Sakura, and everyone else.\n7-Makoto2.png\n: You're not useless! If you hadn't been here, I woulda died!\n24-Hina12.png\n: M-Makoto...!\n110-Hina6.png\n: Nng...that's really nice of you to say...!\n40-Hina14.png\n: But still, I know I've mostly been totally useless.\n111-Hina22.png\n: So I figure, at least here at the end, maybe I can find something that'll help us all get out of here. So I'm gonna go off and do it all on my own!\n112-Hina5.png\n: Okay, see ya later! *leaves*\nHina was in surprisingly high spirits as she dashed out of the dining hall. And once again...\n7-Makoto2.png\n: ...it's just us two.\n56-Kyoko17.png\n: Indeed.\n7-Makoto2.png\n: So...you're gonna go off on your own too, right Kyoko?\n10-Kyoko2.png\n: Well, don't misunderstand. Just because we're going to do our searches separately doesn't mean we can't still work together.\n56-Kyoko17.png\n: That goes for all of us.\nI think I see what you mean... Doing out own investigating doesn't mean we can't work together in the end. I should just see it as us splitting up to cover more ground. And then we can get back together and share what we found. Yeah...that's right!\n10-Kyoko2.png\n: Well, I'd better get going. I have an endless list of things I need to check.\n13-Kyoko7.png\n: Monokuma said all the doors in the school had been unlocked, right? So we should be able to investigate every nook and cranny in the school.\n7-Makoto2.png\n: We can visit all the places we couldn't go before...\n115-Kyoko19.png\n: Makoto...no matter what it takes, we *have* to uncover the truth. By any means necessary... *leaves*\nWith that, Kyoko was gone. Leaving only me...\n117-Makoto38.png\n: I don't have time to waste, either. I have to begin my search...\nI still can't believe the mastermind might be one of us. So that's what I have to prove...\nI'll prove that the mastermind ISN'T one of us! I'll expose the mastermind's true identity, and solve the mystery of this school...\n118-Makoto29.png\n: ...and then we can all escape together!\n2-BOX16.png\nI guess I'll start by taking another look at Mukuro's Monokuma File...\n\"Due to the explosion, the victim's identity is unknown. They were, however, dead before the blast. The victim had been stabbed a single time with a knife, which went completely through the body. They had also been struck in the head with an object about as thick as a metal pipe. The body was covered with other wounds, but these were at least several days old.\"\n4-Makoto2.png\n: Once we find out who killed Mukuro Ikusaba...then we'll know who the mastermind is.\nSo, where should I start my investigation to figure out who killed her...?\n4-Makoto2.png\n: I guess I should start with the rooms that were locked up until now.\nThe headmaster's room, the bio lab, and the door in the data center with Monokuma's face on it... Oh, and the 2nd floor of the dorms where the gate was down before... That should be open now, right?\n4-Makoto2.png\n: After that, I'll have to double-check the areas that are connected to the murder...\nWhich means the garden and the dojo...\n4-Makoto2.png\n: Okay! Time to get started!\n7-Narration.png\n: It's time for the final investigation! There's a LOT of stuff to investigate this time. New rooms to explore, old ones connected to the case that we need to go over once again looking for new evidence... We're gonna be quite busy.\n7-Narration.png\n: First things first, the 2nd floor of the dorms is finally open to us after being locked all game long.\nThe gate's open... We can finally check out the 2nd floor of the dorms... Which means...\n4-Makoto2.png\n: ...I have to do it.\n11-DespairSyndrome2.png\n4-Makoto2.png\n: *This* is the 2nd floor of the dorms...!?\nIt looks like some ancient ruins... Or no...it's more like a battlefield. Like a bomb blew up here or something...\n7-Narration.png\n: This place has seen better days...\n7-Narration.png\n: There are even dry bloodstains around.\n7-Narration.png\n: Most of the map is obstructed but there are a few places we can go in\n7-Narration.png\n: All but one of the dorms up here are blocked off.\n7-Narration.png\n: Even the dorm rooms are destroyed. Maybe this is where Kyoko stayed to avoid the \"You may only sleep in the dorms\" regulation. There is actually nothing to discover in here but it is unsettling nonetheless.\n7-Narration.png\n: More destruction, but more interestingly, there's a Eye of Horus painted on the walls back here. I'd actually never noticed it before.\n7-Narration.png\n: Apparently, the Eye of Horus has several different meanings, but was often painted on Ancient Egyptian ships to ensure safe passage. It was also used to symbolize sacrifice, healing, restoration and protection. No clue if it's supposed to have any meaning here. This place certainly doesn't look safe or protected. Maybe sacrifice considering the whole Tragedy thing...\n7-Narration.png\n: Impromptu history aside, there's a door here with a strange drawing on it.\n4-Makoto2.png\n: This room is filled with lockers...\nIt must have been for the Hope's Peak students who came before us... The\nclass before ours\nmust have used these lockers.\n7-Narration.png\n: Most of these lockers are destroyed and inaccessible.\nThere's a metal plate mounted to the locker... There's no way to get it open.\n7-Narration.png\n: This one however...\nI wonder if I can open this locker...\n*Rattle rattle*\nNope. Locked.\nThere's a card reader installed on the door. That must be how you get the locker open. After all, it's pretty similar to the card readers for the locker rooms on the 2nd floor of the school. And you have to use your e-Handbook to open those up. So does that mean...?\n4-Makoto2.png\n: Well, let's just give it a try.\nI took out my handbook and ran it across the card reader. And then...\nBzzt!\n4-Makoto2.png\n: No luck...\nMaybe only the locker's owner can open it. Which means none of us can do it...\n7-Narration.png\n: There are a couple more intact lockers but they are all locked too. Nothing else we can do in here for now.\n7-Narration.png\n: At the very end of the hall is this big wooden door.\n4-Makoto2.png\n: This room doesn't really feel like a student's room. It has a more...adult atmosphere.\n31-Kyoko2.png\n: It's the headmaster's private room.\n4-Makoto2.png\n: Kyoko!\n32-Kyoko3.png\n: I've been through this room several times already, but I still have one little\nregret\n. So I decided to check it out one more time.\nHuh? A regret...?\n7-Narration.png\n: There are a few things to check out here. Let's start with this computer.\nThere's a PC on the desk. It must have belonged to the headmaster...\n32-Kyoko3.png\n: Whoever used this last, it looks like they were very interested in the Ultimate Despair. The PC still has some search results left on it...\n4-Makoto2.png\n: Then we might be able to get some info on the Ultimate Despair!?\n36-Kyoko17.png\n: There's not much, though. Nothing we don't already know.\n37-Kyoko7.png\n: \"The Ultimate Despair isn't one individual, but instead points to some kind of\ngroup\n. That group is responsible for\nThe Tragedy\n, which happened one year ago. They're the worst sorts of people, whose driving force comes from despair...\"\n36-Kyoko17.png\n: And that's all there is. Not much to it, is there?\n31-Kyoko2.png\n: But I guess that's the best he could do as a complete Kirigiri failure...\n4-Makoto2.png\n: B-But...any information about the mastermind is helpful, right? I appreciate whatever info we can get our hands on.\n31-Kyoko2.png\n: I see. That's a good outlook to have.\n37-Kyoko7.png\n: ...\nKyoko looks almost...meek right now. She must be thinking about something. I probably shouldn't bother her...\n7-Narration.png\n: There is a suspicious indentation on this wall...\nHuh? There's a strange gap in the wall... Is it some kind of design mistake, or a construction defect or something?\n31-Kyoko2.png\n: There's a gap here, but not just any normal gap... I can feel a breeze coming out.\n4-Makoto2.png\n: A breeze...?\n31-Kyoko2.png\n: There's likely an open space on the other side of this wall.\nOpen space? Does that mean...?\n4-Makoto2.png\n: You mean, like...a hidden room!?\n31-Kyoko2.png\n: I think I might know\n[how to open it]\n.\n> how to open it\n4-Makoto2.png\n: You know how to open it? Did you figure out some kind of trick or something?\n37-Kyoko7.png\n: A very easy trick, yes. So easy, I'm not sure you can even call it a trick... I saw a program on that PC that I think controls it. Enter the right password, and the door should open right up.\n45-Kyoko11.png\n: But I don't have a clue what that password might be. All we know is it's probably made up of letters and/or numbers. We can't really go from there...\n4-Makoto2.png\n: You're right, that's not nearly enough to go on...\n32-Kyoko3.png\n: I looked through all his paperwork, all the files on the PC, everything I could think of. I learned more about him than I had any desire to, but nothing that might have been his password... When I think of how much time I wasted on this...\nJeez... So there's a hidden room she couldn't get into. That's what she meant by regret... I think we can assume that there must be some kind of clue waiting in there. But maybe for her, there's more to it than that...\nAnyway, if we want to get in there, we need to figure out the password. And if Kyoko can't figure it out, no way do I stand a chance...\n...No, wait. There might be a chance... The password could be... Something Kyoko wouldn't have thought of. Or something she didn't *want* to think of... For example...\n4-Makoto2.png\n: What about your name?\n49-Kyoko9.png\n: Huh?\n4-Makoto2.png\n: Oh, sorry. I was just trying to think of what the password might be.\n37-Kyoko7.png\n: ...\nI'm sure she hasn't tried it. I mean, it's totally understandable... After the way she talked about her dad, the idea that he would use her name as his password. Knowing how she is, I bet the idea never even occurred to her.\n4-Makoto2.png\n: Umm...do you mind if I try it, just to be sure?\n31-Kyoko2.png\n: ...It's not like you need my permission. If you want to try it, try it. Do whatever you want.\n4-Makoto2.png\n: O-Okay...\nYou know, I'm glad I thought of trying Kyoko's name. But if that's not it, that might just hurt Kyoko even more...\n4-Makoto2.png\n: ...\n37-Kyoko7.png\n: If you're worried about me, Makoto, don't be. I already know that your guess it wrong.\n4-Makoto2.png\n: Okay... In that case, here goes nothin'...\nI collected myself, then turned to face the computer monitor.\n4-Makoto2.png\n: Lemme just...type the password here...\nI typed in her full name, \"Kyoko Kirigiri\"... My hands were tense, slightly trembling, and as I finished typing it in...\n*Beep* ... *Krrrnnnn*\n54-DISTRUST.png\n4-Makoto2.png\n: What...? That did it!? Kyoko! It worked!\n37-Kyoko7.png\n: ...\n56-Kyoko8.png\n: ...Why?\n4-Makoto2.png\n: K-Kyoko...?\n56-Kyoko8.png\n: ... *leaves*\nWithout looking at me, she disappeared into the hidden room. She looked...grim.\n4-Makoto2.png\n: Kyoko...\n37-Kyoko7.png\n: ...\n4-Makoto2.png\n: H-Hey, Kyoko...?\nI may as well not even have been in the room. Her gaze was fixed on only one thing...\nA present...? Wrapped and covered with such joy... That's what made it so unusual...\nThere's a brightly colored box here. It seems totally out of place in here. The more I look at it, the more suspicious I get. Should we open it? I'm getting kind of a bad vice from it... But I mean, we can't *not* open it.\n4-Makoto2.png\n: O-Okay!\n37-Kyoko7.png\n: Be careful, Makoto...\n4-Makoto2.png\n: Why, you think it's dangerous!?\n36-Kyoko17.png\n: No, not dangerous. But...surprising, probably.\n4-Makoto2.png\n: Huh...?\n37-Kyoko7.png\n: If it is what I think it is...at the very least, it's not something you'll be happy to see.\n4-Makoto2.png\n: Wait, so...you know what's in there?\n31-Kyoko2.png\n: Just don't scream or anything, okay?\nA-Are you saying...it's something that'll make me *want* to scream?\n4-Makoto2.png\n: ...O-Okay, I'm just gonna open it!\nStep by heavy step, I approached the box. I took a deep breath, then took hold of the lid. Slowly, ever so slowly, I lifted it up...\n♪\nMusic fades out.\n♪\nLight began to sneak its way into the box. I stole a hesitant glance inside, and...\n64-Makoto33.png\n: Gh...\n65-Makoto34.png\n: Guwaaaaaaaahhh!\nKyoko's advice was no use. I let out a trembling cry.\n67-ToSurvive.png\nWhat was in the box... It was bones. Human bones... It was the last thing I expected to find in such a bright, joyful box. I mean, who could have possibly imagined...?\n37-Kyoko7.png\n: Just as I thought.\n4-Makoto2.png\n: What...? Just as you thought...? How could you have known that? I mean...there were bones in there! Human bones!\n31-Kyoko2.png\n: Well, it's not that I was thinking of the bones specifically. I just...had a feeling it would be his body.\n4-Makoto2.png\n: Th-That's pretty much the same thing! A dead guy in a box!\n36-Kyoko17.png\n: My father...\n4-Makoto2.png\n: Huh? What about him?\n69-BoysLifeofDespair.png\n70-Kyoko.png\n: What you found in the box... Those bones... That...body... That's my father. Or at least...what's left of him.\n4-Makoto2.png\n: A-Are you serious!?\nThis is...Kyoko's dad? The same man she's been searching for...?\n4-Makoto2.png\n: H-Hold on! How can you know that for sure? How do you know...that's him?\n32-Kyoko3.png\n: Given all the information we have already, that's the only possible answer.\n71-FlashT.png\n73-FlashB.png\n74-AlterEgo5.png\n: So that same person may very well be the mastermind who planned all this out. And according to the files, the headmaster is a man in his late thirties. It seems possible, even likely, that he's\nsomewhere in this school\nright now.\n71-FlashT.png\n73-FlashB.png\n76-Monokuma4.png\n: Kehehe... It's a very polarizing approach, I know, but--okay, enough puns. Anyway, here's a hint... I'm sure I told you this already, but...this\nkilling game\nbegan with sixteen participants, all of them high school students. And the only people to take a single step in Hope's Peak since the killing game began...are those sixteen students.\n78-DeathWish.png\n45-Kyoko11.png\n: Alter Ego said that the headmaster was probably here in the school...but the only ones who were\nalive\nat the start of the killing game were us sixteen students. When you put those two ideas together, it doesn't take much to assume...\n36-Kyoko17.png\n: ...that most likely, my father *was* in this school, but he was also\ndead\n. That's my assumption, anyway.\nAs Kyoko explained her analysis, she was completely calm. Or, no...she *wasn't* calm. She was only\ntrying to *seem* calm\n. She said it was just as she thought. So she knew it was a possibility. But I have to believe that at some point, she wanted to be proven wrong. Which is why she never looked in the box herself, even though she had plenty of chances. I know Kyoko said she wanted to see her father so she could cut off all ties. But was that all there was to it?\n71-FlashT.png\n73-FlashB.png\n36-Kyoko17.png\n: I...gave up some of that pride. In order to enter Hope's Peak, I had to reveal myself to the school. I did it knowing it was something a true Kirigiri detective would never do.\nWould she really give up her pride just for that? I couldn't help but wonder...\nHuh? This picture...\nIt's all faded. It must be pretty old. Wait, is this a picture of...!?\n4-Makoto2.png\n: H-hey, Kyoko...!\n85-Kyoko10.png\n: ...!\n56-Kyoko8.png\n: ...Well, this is annoying. I came here to cut myself free of the past. And yet... To now find something like this... So what do you expect me to do now...?\nThen I was right. It's a picture of Kyoko when she was a little girl. Knowing the headmaster had this picture all this time... He must have really cared about her...\n56-Kyoko8.png\n: Why? What...? I wanted to face him and tell him myself. To cut him out of my life for abandoning me... That's the whole reason I came here. And now he's abandoned me again. And this time, he even stole the only opportunity I had to move on. He there ever been a worse father...?\nKyoko...\nThe headmaster's desk... It's probably hiding some kind of clue, so I really want to check it out, but...I really don't want to touch Kyoko's dad's desk without her permission.\n31-Kyoko2.png\n: Don't worry about me. Feel free to look around as much as you like.\n4-Makoto2.png\n: Are you sure?\n31-Kyoko2.png\n: Never let anything get in the way of the investigation. I don't.\n4-Makoto2.png\n: O-Okay, then...if you don't mind...\nStarting from the top, I opened all the desk drawers and looked inside. I rummaged through each one, finding nothing but unrelated documents. But in the last drawer...\n4-Makoto2.png\n: Huh? Is this...?\nIt's...an e-Handbook, right? And it has a label on it that says \"in case of emergency\"...!\n36-Kyoko17.png\n: A\nhandbook with no limitations\n, given to the school's ultimate authority, the headmaster... I'm assuming that's what it is.\n4-Makoto2.png\n: I think you're probably right.\n36-Kyoko17.png\n: It might prove useful as we continue our investigation.\n37-Kyoko7.png\n: Why don't you hold on to it?\n4-Makoto2.png\n: Huh? But Kyoko...\n36-Kyoko17.png\n: I don't need it. If you don't want it, go ahead and leave it here.\n4-Makoto2.png\n: Th-Then...I guess I'll take it.\n36-Kyoko17.png\n: ...\nIs it...really okay?\n37-Kyoko7.png\n: ...Listen, Makoto...?\n4-Makoto2.png\n: Huh?\n37-Kyoko7.png\n: Can I ask you a\n[favor]\n?\n> favor\n4-Makoto2.png\n: A favor? What is it...?\n36-Kyoko17.png\n: I know it's completely unreasonable to ask you this. And I know it'll only inconvenience you that much more. But...\n37-Kyoko7.png\n: ...could you leave?\n4-Makoto2.png\n: Huh?\n31-Kyoko2.png\n: Just for a little while. I'd just...like to be alone for a bit.\n4-Makoto2.png\n: K-Kyoko...\n31-Kyoko2.png\n: Don't worry, I'm fine. I just need to calm down a little...\n36-Kyoko17.png\n: I need to...get my emotions in order.\n4-Makoto2.png\n: ...You know, Kyoko... You told me before about the relationship you had with your dad. How you're only connected by blood, not by heart and soul. But...\n37-Kyoko7.png\n: Maybe that picture motivated him, maybe he hoped to see me again someday. Is that what you were going to say?\n4-Makoto2.png\n: ...\n37-Kyoko7.png\n: If so, it's just a theory. And this isn't an issue that can be settled with theories. That picture doesn't change the facts of what happened, what I went through.\n36-Kyoko17.png\n: That problem can't be solved so easily.\n4-Makoto2.png\n: You're right... I'm sorry.\n36-Kyoko17.png\n: Once I've got myself under control, I'll return to the investigation immediately. So please, just give me some time to myself.\n4-Makoto2.png\n: O-Okay, I understand. Then...I'll see you later.\n93-Kyoko19.png\n: ...\n11-DespairSyndrome2.png\nIs she really okay...? Kyoko...it must have been a complete shock to her. I mean, it was a shock to *me*.\n71-FlashT.png\n73-FlashB.png\nTo find out what happened to the headmaster... There's no doubt the mastermind performed that evil deed. They killed the headmaster--killed Kyoko's father. They killed him... The headmaster...is dead.\n71-FlashT.png\n73-FlashB.png\n74-AlterEgo5.png\n: The one leading the Hope's Peak staff, the one who finalized the plan to isolate you...was the\nHope's Peak headmaster\n. So that same person may very well be the mastermind who planned all this out. And according to the files, the headmaster is\na man in his late thirties\n. It seems possible, even likely, that he's\nsomewhere in this school\nright now.\nBut we were wrong about that. The headmaster *wasn't* the mastermind... Which means the mastermind's true identity is...\n71-FlashT.png\n73-FlashB.png\n76-Monokuma4.png\n: Kehehe... It's a very polarizing approach, I know, but--okay, enough puns. Anyway, here's a hint... I'm sure I told you this already, but...this\nkilling game\nbegan with sixteen participants, all of them high school students. And the only people to take a single step in Hope's Peak since the killing game began...are those sixteen students.\n[i]Fifteen of us met in the mail hall. Add Mukuro to the mix and you get sixteen. And including me, only\nsix of us\nare still alive. Everyone else...is dead.\n71-FlashT.png\n73-FlashB.png\n71-FlashT.png\n73-FlashB.png\n71-FlashT.png\n73-FlashB.png\n71-FlashT.png\n73-FlashB.png\n71-FlashT.png\n73-FlashB.png\n71-FlashT.png\n73-FlashB.png\n71-FlashT.png\n73-FlashB.png\n71-FlashT.png\n73-FlashB.png\n71-FlashT.png\n73-FlashB.png\nEven Mukuro. Even she's undeniably dead. So the ones still left alive are...\n71-FlashT.png\n73-FlashB.png\nMe.\n71-FlashT.png\n73-FlashB.png\nByakuya.\n71-FlashT.png\n73-FlashB.png\nHiro.\n71-FlashT.png\n73-FlashB.png\nToko.\n71-FlashT.png\n73-FlashB.png\nHina.\n71-FlashT.png\n73-FlashB.png\nAnd Kyoko...\nOnly\nthose six people\nare still alive. Then there's no question...\n4-Makoto2.png\n: Wait, no! That can't be! I refuse to believe it! There has to be some other way... There just HAS to be!\n2-DespairSyndrome2.png\n3-Narration.png\n: Last time we got an e-Handbook with no limitations. Maybe we can use it in the locker room.\nMaybe only the locker's owner can open it. Which means none of us can do it...\n6-Makoto2.png\n: Wait, but...?\n6-Makoto2.png\n: What about that emergency handbook I found in the headmaster's hidden room? Okay, let's give it one more try...!\nI took the emergency handbook and ran that across the card reader, and...\n*Beep*\nAlright! Just what I was hoping for! Now let's see what we've got inside.\n6-Makoto2.png\n: ...I don't see anything that might be a clue...\n3-Narration.png\n: Some of the intact lockers are empty, but this one...\n*Beep*\nLooks like the locker opened... Now let's see what we've got inside.\nThis thing is practically empty. There's just one thing--some kind of pocketbook. I don't see a name written on it, so I can't say for sure whose it is. But there's some writing inside. It could be important.\n6-Makoto2.png\n: I don't like violating the owner's privacy, but I'd better take a look.\nIt looks like a girl's handwriting... And all the letters are spaced out evenly, like whoever wrote them was measuring them. Whoever wrote this must have been really meticulous.\n♪\nMusic fades out.\n♪\n6-Makoto2.png\n: Huh...?\nI was flipping through the pocketbook, but my hand froze when I got to a certain page. I saw something familiar written there, words I'd heard before.\n13-DISTRUST.png\n???: \"There's a plan to turn Hope's Peak into a shelter, and isolate the students here in a communal life. I decided to talk to the one who came up with the plan directly. It just so happens to be the headmaster--and my father. He was willing to give me some more details regarding the plan. Here's what he said...\n'The point is to keep our student prodigies safe, to keep them as our hope for the future. Only their genius can overcome disaster, and only their hope can overcome despair. For the future of our country, our world, it's not an exaggeration to call this our final hope. We must isolate ou superior youth from the corrupted world, to server as the foundation for a new era. This is the only hope we have. I hope that you'll be willing to go along with this plan...'\n???: \"So that's what my father had to say to me. As usual, he made a selfish decision without consulting anyone else. I can't imagine a worse father.\"\n6-Makoto2.png\n: This...can't be true, can it?\nBut I knew it was. And I knew exactly who the pocketbook belonged to. Kyoko... It couldn't be anyone else.\n6-Makoto2.png\n: But if this belongs to Kyoko...\n...what was it doing in this locker? And what she wrote here completely contradicts what she already told me. She said she hasn't seen her dad since he left when she was little.\n???: \"I decided to talk to the one who came up with the plan directly. It just so happens to be the headmaster--and my father.\"\n6-Makoto2.png\n: What does this all mean...!?\nI quickly scanned the remaining pages of the notebook. I must have been looking for something that would prove me wrong about this whole thing. But when I reached the last page, the question marks spinning through my mind just started spinning that much faster.\nWhen I looked at it... Unlike the rest of the pocketbook, the writing here was messy, disorganized, scrawled.\n6-Makoto2.png\n: What is this...? What does it mean? I have no idea... How could this possibly make any sense?\n2-DespairSyndrome2.png\n*Beep*\nLooks like the locker opened... Now let's see what we've got inside.\nThis locker is totally disorganized. Whoever it belongs to probably has organization problems in every part of their life...\nIs this a deck of playing cards? No...they're tarot cards. But...wait... Aren't those used for telling fortunes?\n6-Makoto2.png\n: ...It's...just a coincidence, right?\nThis is...a crystal ball. Huh? A crystal ball...?\n6-Makoto2.png\n: No...it can't be...\nThere's no way\nhe\never used this locker. It's just not possible...\n6-Makoto2.png\n: There's all kinds of textbooks and notebooks stacked up in no particular order. And dust everywhere... I have to assume whoever's stuff this is didn't do a lot of studying. ...Not that I can really talk.\nTrying to act as casual and natural as possible...I picked up one of the notebooks I saw. But the moment I looked inside the notebook...any sense of easiness I may have had evaporated.\n13-DISTRUST.png\n6-Makoto2.png\n: ...What?\nThere was no denying what I saw. Inside the notebook was written \"\nYasuhiro Hagakure\n.\"\n6-Makoto2.png\n: Is this... *our* Yasuhiro?\nThe notebook also contained a large number of notes for a variety of different classes. Which would mean...\n6-Makoto2.png\n: He...attended classes here?\nNo...that can't be possible. I mean, Hiro came to this school at the same time as the rest of us. And we were all sucked into this evil world. We never had the chance to take any classes...\n6-Makoto2.png\n: So...what *is* this notebook?\nBut the more I see, the less sense it makes. Because these lockers... I mean, they had to belong to the previous students, right? So why am I seeing this...? Why are there things in the lockers that look like they belong to people here?\n6-Makoto2.png\n: A notebook that seems like it belongs to Hiro... And a pocketbook that seems like it belongs to Kyoko...\n6-Makoto2.png\n: ...There has to be some kind of explanation. But if I want to find that out, I have to keep moving the investigation forward. And I have to believe in everyone.\n32-BOX16.png\n3-Narration.png\n: Time to leave the depressing 2nd floor dorms and continue our investigation elsewhere.\n3-Narration.png\n: The Monokuma room in the Data Center should be open now.\n36-Hina5.png\n: Ah, Makoto! Are you here to look around, too?\n6-Makoto2.png\n: Is that what you're doing here?\n37-Hina20.png\n: Yeah. I can't help but wonder about that Monokuma door...\n39-Hina22.png\n: So I figured...if all the doors in school had been unlocked, that one should be open too, right!?\n40-Hina14.png\n: Although...I couldn't being myself to open it.\n39-Hina22.png\n: Cuz it might explode, right!? And that'd really suck. So...you open it!\nI'm sure she didn't mean it, but she made it sound like she was okay with *me* getting blown up...\n6-Makoto2.png\n: Okay, so...I guess I'll open it.\n43-Hina12.png\n: Ah, wait! Lemme take cover first! I don't wanna get exploded!\nHina raced over to a nearby desk and hid underneath it.\n39-Hina22.png\n: Okay! Go ahead!\n6-Makoto2.png\n: ...\nEverything will be okay...right?\n6-Makoto2.png\n: Alright, here goes nothin'...!\nI threw all my weight into it, but the door opened much easier than I expected.\n♪\nNo Music.\n♪\nThere was no explosion, thankfully. My first impression was...\n43-Hina12.png\n: Whoa! This place is totally sci-fi!\n6-Makoto2.png\n: ...Yeah, I was kinda thinking the same thing.\n13-DISTRUST.png\n48-Hina16.png\n: I mean, every part of this school leaves a bad taste in my mouth, but...\n49-Hina15.png\n: ...this place is like number one gross! It's in a whole different league of creepy!\nThere's some kind of hatch on the floor... But right now I'm more concerned about that weird device...\nWhat is this device? It looks like some kind of...control panel. It's really over the top, though. Like some kind of military installation or something...\n37-Hina20.png\n: Yeah, it kinda looks like a mech cockpit, right? Hifumi'd probably freak out if he saw it!\n6-Makoto2.png\n: Cockpit...?\nSo the Monokuma room has a control panel that looks like some kind of...cockpit. Then could that mean...?\n39-Hina22.png\n: Alright! Let's start poking at it or whatever! I'm gonna start pushing buttons!\n6-Makoto2.png\n: H-Hold on! You can't just \"or whatever\" something like this!\nBut it was too late... Hina was already jabbing away at the control panel.\n♪\nMusic cuts out.\n♪\n*Boing*\n3-Narration.png\n: Something I have failed to mention until this point, mostly because there's never been a reason to bring it up, is that every time Monokuma appears or disappears a very distinct \"boing\" sound effect plays. It's at this moment that that very sound effect plays.\n56-Hina11.png\n: Huh? Did you hear that?\n6-Makoto2.png\n: Yeah, I think it came from the other room. Hina...what did you push?\n57-Hina6.png\n: I-I'm not totally sure, but...I think it was that one. The button that says\nData Center\n.\n6-Makoto2.png\n: Data center...?\n2-DespairSyndrome2.png\nI took a good look at the control panel...and I saw a bunch of buttons, each with the name of a room next to it. And just like Hina said, there was one labeled\nData Center\n. That must be the one she pushed. But the data center... That's right next door. The room we were just in... That's where the strange noise came from.\n6-Makoto2.png\n: I'd probably better go check it out...\n39-Hina22.png\n: Yes please! I'm kinda scared out of my mind right now, so I'll just...cheer you on from over here!\nDid I just hear what I think I heard...?\n62-100MileJunkFoodDash.png\n63-Monokuma.png\n: ...\nIs that...Monokuma?\n63-Monokuma.png\n: ...\n6-Makoto2.png\n: H-Hey!\n65-Monokuma6.png\n: Graar! Groooar! Gimme all yer donuts!\n6-Makoto2.png\n: ...Is that...you, Hina?\n66-Monokuma11.png\n: What!? Aw man, busted! How did you know?\n63-Monokuma.png\n: Anyway, what is this? Some kinda remote-control camera kinda setup?\n6-Makoto2.png\n: You don't even know what you're controlling...?\n68-Monokuma13.png\n: Well I mean, I can't really see anything from in here.\n69-Monokuma4.png\n: Ah, guess what I found! A self-destruct button!\n6-Makoto2.png\n: Whatever you do, don't push it!\n71-Monokuma8.png\n: Aww maaaan!\n6-Makoto2.png\n: ...Were you seriously gonna push it?\nA-Anyway...I guess that settles it. The room with the Monokuma drawing on it, and the control panel inside...\n32-BOX16.png\n39-Hina22.png\n: Whoa! Hey Makoto, what the heck was that just now!?\n6-Makoto2.png\n: Monokuma.\n56-Hina11.png\n: Huh? What do you mean?\n6-Makoto2.png\n: What you were controlling just now. It was Monokuma.\n74-Hina2.png\n: Monokuma...?\n43-Hina12.png\n: What!? For real!?\n6-Makoto2.png\n: Yup. It looks like that panel definitely controls Monokuma. Which means...the mastermind has been controlling Monokuma from this room.\nYeah...they were definitely in here. The mastermind has been controlling Monokuma from this room. And this control room is\ntotally separate\nfrom the data center area with all the monitors. In other words...\n75-FlashT.png\n77-FlashB.png\n78-Kyoko13.png\n: Maybe the mastermind can't monitor us and control Monokuma at the same time.\nKyoko's theory was right...\n80-Hina9.png\n: But...if the mastermind's been controlling Monokuma from here...that means they've been inside the school this whole time, right?\n6-Makoto2.png\n: I guess that would have to be true.\nBut if that *is* true...\n75-FlashT.png\n77-FlashB.png\n69-Monokuma4.png\n: Kehehe... It's a very polarizing approach, I know, but--okay, enough puns. Anyway, here's a hint... I'm sure I told you this already, but...this\nkilling game\nbegan with sixteen participants, all of them high school students. And the only people to take a single step in Hope's Peak since the killing game began...are those sixteen students.\nThen the mastermind, Monokuma's puppeteer, really is the sixteenth student...?\n6-Makoto2.png\n: ...\nNo, it can't be... There's no way...right?\n74-Hina2.png\n: What's wrong, Makoto? I don't like that face you're making...\n6-Makoto2.png\n: Oh, no...it's nothing.\n80-Hina9.png\n: O-Oh, okay...\n40-Hina14.png\n: ...\n6-Makoto2.png\n: What about you? Is everything okay?\n74-Hina2.png\n: Oh, well, it's just... This is where the mastermind's been hiding, right? Who knows if they set up traps or something...?\nI can't say it isn't possible... But I really hope it's not true.\n74-Hina2.png\n: So, like...\n80-Hina9.png\n: You wanna leave soon? There's still lots of other places to check out.\n6-Makoto2.png\n: Yeah, good point. We can't waste all out time standing around here. Okay, you wanna get going?\n80-Hina9.png\n: Y-Yeah...\n♪\nMusic fades out.\n♪\n*Click*\nAs soon as the door to the data center was closed, I heard a strange sound.\n6-Makoto2.png\n: What was that...?\n86-DespairSyndrome1.png\n87-Hina10.png\n: Ah! The door! It just locked on its own!\n6-Makoto2.png\n: What!?\nMy hand shot out to grab the doorknob...\n*Rattle rattle*\n6-Makoto2.png\n: You're right, it's locked. But...why?\n89-MrMonokumasLesson.png\n69-Monokuma4.png\n: Of course it's locked! Because the data center is now restricted!\n6-Makoto2.png\n: M-Monokuma!?\n49-Hina15.png\n: Hey, no fair! You can't just go around restricting whatever you feel like!\n90-Monokuma2.png\n: It's for YOUR benefit! Cuz if that room stays open, I won't be able to move around.\n92-Monokuma10.png\n: Imagine how depressed everyone would get if the school mascot just up and stopped moving!\n6-Makoto2.png\n: Then...that room...\n63-Monokuma.png\n: As you may have guessed, that's where my controls are!\n74-Hina2.png\n: So...right now, you're being operated by\nsomeone\nin that room?\n63-Monokuma.png\n: Correctamundo!\n48-Hina16.png\n: But that doesn't make any sense! We were just in there, and we didn't see anyone!\n69-Monokuma4.png\n: Oh you didn't, did you? Puhuhu... Are you sure you were as thorough as you could have been?\n75-FlashT.png\n77-FlashB.png\n69-Monokuma4.png\n: Did you happen to check...a certain suspicious hatch?\n6-Makoto2.png\n: N-No way...! The hatch on the floor...!?\n69-Monokuma4.png\n: Puhuhu, too bad! That was your one big chance, and ya blew it!\n96-Monokuma12.png\n: Of course, that hatch can't be opened from the outside anyway. So whatever!\n63-Monokuma.png\n: Now then, this room is officially restricted. So no more investigating! I'll be relying on you guys to tell the others.\n69-Monokuma4.png\n: Puhuhu... Peace! *leaves*\n86-DespairSyndrome1.png\n74-Hina2.png\n: He's gone. But...\n80-Hina9.png\n: ...was he telling the truth? The mastermind was hiding in there?\n6-Makoto2.png\n: In fact, if you think back to when we got locked out of the control room, that proves it for sure.\n43-Hina12.png\n: Then...when I said we should leave...\n6-Makoto2.png\n: Well, that hatch couldn't be opened from the outside anyway, right? So it's not your fault.\n40-Hina14.png\n: O-Okay...\n6-Makoto2.png\n: Anyway, we don't have to let it get to us. We have to stay positive and make the most of the time we have left!\n40-Hina14.png\n: You're right... If there's one thing I'm good at, it's keeping my body moving...!\n32-BOX16.png\n39-Hina22.png\n: Okay! I'm gonna go run around and tell everyone what we found here! Nice! You've got me all motivated again!\n36-Hina5.png\n: Okay, I'm out! See ya later!\nHina took off at a full sprint.\n6-Makoto2.png\n: And I have to do what I can, too...!\nThat's the only way forward!\n2-BOX16.png\n3-Narration.png\n: We were going to break into the headmaster's office last chapter, but since the door is open now, I guess we can just walk right in.\nThis is the headmaster's room... I've heard an awful lot about it, but this'll be my first time seeing it for myself...\n7-Byakuya.png\n: Ah, Makoto. It's you...\n8-Makoto2.png\n: Oh, Byakuya.\n9-Byakuya3.png\n: Well, you came to the right place this time. Would you like to see\n[something interesting]\n?\n> something interesting\n8-Makoto2.png\n: What do you mean, something interesting?\n11-DISTRUST.png\n12-Byakuya2.png\n: Take a look at this... It was on top of that pathetically ostentatious desk.\n8-Makoto2.png\n: Class #78...Student Registry...?\n12-Byakuya2.png\n: It contains profiles for all of us...and Mukuro.\n13-Byakuya9.png\n: Apparently\nclass #78\n...refers to us.\n8-Makoto2.png\n: Wait, when we found Mukuro's profile in Kyoko's room...\n14-FlashT.png\n16-FlashB.png\n13-Byakuya9.png\n: That's right. It also mentioned\nclass #78\n. This must be where Kyoko got that page.\n13-Byakuya9.png\n: And since the rest of our profiles are listed in there along with hers...\n12-Byakuya2.png\n: ...there can be no doubt. Mukuro was a student here at Hope's Peak Academy, just like the rest of us.\nMukuro Ikusaba...the sixteenth student... That must how Kyoko learned about it...\n7-Byakuya.png\n: But it seems that Kyoko was in a hurry...\n8-Makoto2.png\n: Huh? What do you mean?\n7-Byakuya.png\n: I'm talking about when she stole it. The uneven tearing, the way the paper had been crumpled, she must have been in a hurry.\n8-Makoto2.png\n: Well, since she snuck in to get it, I'm sure she wanted to get out as fast as possible. But what's your point?\n19-NewWorldOrder.png\n9-Byakuya3.png\n: She was in so much of a hurry...that she only got the first page.\n8-Makoto2.png\n: The...first page?\n9-Byakuya3.png\n: Correct. Mukuro's profile actually contains *two* pages.\n8-Makoto2.png\n: What...?\n12-Byakuya2.png\n: In other words, when it comes to this profile...there was more\n[information about Mukuro]\nthat we still didn't have.\n> information about Mukuro\n8-Makoto2.png\n: What kind of information is it...?\n21-Byakuya7.png\n: Why do you ask me to explain every little thing? You can read, can't you? It seems to be some sort of\ndetailed report\nput together by the headmaster himself.\n9-Byakuya3.png\n: I don't know what kind of man he was, but I'm glad he left us such an interesting clue...\nI was half-listening to Byakuya as I skimmed through the report.\n\"Mukuro reappeared suddenly, and in the background an entity floats, close but just out of reach. The entity known as...the Ultimate Despair. Right now, I can't be sure if this is a single person, or some kind of group. Whatever it is, Mukuro definitely has some sort of connection to it.\n\"I have a bad feeling about all this. I need to push forward with my research into the Ultimate Despair. And I need to pay attention to Mukuro's behavior, too. This is just my gut feeling, but I think she's dangerous. Despite the countless battles she must have gone through as a member of Fenrir, when she entered Hope's Peak, she didn't display any signs of battle wounds or scars. That fact alone proves her tremendous skill in battle.\n\"Naturally, I want to believe in her. She's one of my students, after all. But if I decide she's a danger to the other students I will be forced to take all reasonable measures.\"\nMukuro...was a part of the Ultimate Despair. I don't think there can be any doubt about it now. But...wouldn't that mean Mukuro and the mastermind were allies? So why...? Why would they kill Mukuro? Plus, even the headmaster seemed to be afraid of what Mukuro was capable of. They would've had to take her completely by surprise to kill her like that... Or...maybe it means the mastermind is even stronger than Mukuro was...\n12-Byakuya2.png\n: What's wrong, Makoto?\n8-Makoto2.png\n: Huh...?\n9-Byakuya3.png\n: You seem to be lost in thought. But I should probably point out one other thing. There's another important bit of information within the file that you should note.\n8-Makoto2.png\n: Wh-What is it?\n7-Byakuya.png\n: Did you notice the picture in there? A picture of a girl perhaps you've never seen before?\n12-Byakuya2.png\n: A girl who seems to be included as part of our class #78. That should be enough for you to figure out who the girl is.\n13-Byakuya9.png\n: And further information about that girl is included in the file. 5 foot 7 inches, 97 pounds. And it even lists her vitals...31-22-32.\n12-Byakuya2.png\n: Well? What do you think?\n8-Makoto2.png\n: What do I think? Are you asking me, like...if she has a nice body?\n21-Byakuya7.png\n: You hopeless idiot. What I'm trying to tell you, is maybe you'll want to keep that in mind for later. Maybe you'll make your way back to the corpse, and maybe you'll think, \"Oh, could that mean...?\"\nWait...is he trying to say...?\n14-FlashT.png\n16-FlashB.png\nThere's a chance the body isn't actually Mukuro? Is that what he's saying?\n7-Byakuya.png\n: Personally, what I'm thinking seems all but impossible. But it wouldn't hurt to confirm, right?\n12-Byakuya2.png\n: That's all I was trying to say. What you do with that information is your business.\nSo I'm back to bring Byakuya's errand boy...\n2-BOX16.png\n7-Byakuya.png\n: Oh, and one last thing... It's a bit of\n[advice]\nfrom me to you, so I suggest you pay attention.\n> advice\n8-Makoto2.png\n: Advice...for me?\n7-Byakuya.png\n: You seem to be getting along with Kyoko quite well.\n8-Makoto2.png\n: It's not that we're getting along. She's just done a lot to help me...\n28-Byakuya5.png\n: Well, don't put too much faith in her.\n8-Makoto2.png\n: Huh...?\n28-Byakuya5.png\n: The cost of that faith might be more than you can afford.\n8-Makoto2.png\n: Wh-What are you saying...?\n21-Byakuya7.png\n: Just what I think. Call it a hunch.\n8-Makoto2.png\n: A hunch...\n7-Byakuya.png\n: But my hunches tend to be proven right. The advice is free this time. Take it or don't, as you will.\n8-Makoto2.png\n: I-I'll keep it in mind. Thanks...\n7-Byakuya.png\n: ...\n3-Narration.png\n: The rest of the room surprisingly has nothing else to offer us. You can examine the desk to get another look at Mukuro's profile but otherwise, there's nothing to look at. Onwards!\n3-Narration.png\n: Up on the 5th floor, the bio lab should now be open.\nWell, here I am in the bio lab.\n8-Makoto2.png\n: It's so cold...!\nIt's like...abnormally cold. I feel like I'm in a giant refrigerator. Seriously, why is it so cold!?\nThere's some kind of weird machine or something built into the wall. And on the left side, there's a bunch of glowing blue lights... But on the other side...\nThere's some kind of weird machine or something built into the wall. I've seen something like this before... Ah, that's it! I've seen this kind of thing in horror movies and stuff...\n8-Makoto2.png\n: It's...a fridge for storing dead bodies.\nDoes that mean this bio lab is actually...a morgue?\n8-Makoto2.png\n: ...\nI should probably take a closer look around...\nOh, there's some kind of booklet here...\n8-Makoto2.png\n: It looks like...an instruction manual.\n\"We offer an eco-friendly alternative to standard dry ice for all your cadaver needs. In addition to the germicidal lamps, we also provide an ozone generator for the removal of ethylene gas. Simply insert the cadaver, and the blue light will let you know the automated systems have activated. Temperature and humidity levels will be adjusted automatically for optimum settings. With our system, anyone can keep a body fresh as a daisy for as long as you need! In the unlikely event of a problem, the red light will activate and an alarm will sound immediately. The exterior is stainless steel, and we do offer an optional leather upholstery upgrade package.\"\nThis is...the instruction manual for the fridge?\nThere's a stack of tarps here.\n8-Makoto2.png\n: I've been seeing a lot of those things lately...\n3-Narration.png\n: You actually have to examine the fridges again to progress.\nThere's some kind of weird machine or something built into the wall. And on the left side, there's a bunch of glowing blue lights... But only some of the lights are on... The ones on the left.\nThe right-hand lights are off...\n8-Makoto2.png\n: Well, looking around, I think I get it... It seems clear to me now... It was a makeshift morgue.\nAnd about those lights by each slot... It looks like it's set up so that when a slot is occupied, the blue light comes on. Which would mean, inside each slot lit up in blue...another one of the victims is...\n8-Makoto2.png\n: ...\nI can't let my emotions take control right now... There's only one thing I can do for everyone who's died... And that's...defeat the mastermind!\n8-Makoto2.png\n: And to do that, I have to continue my investigation. I don't have any other option.\n3-Narration.png\n: We needed to revisit the dojo since it was related to the last trial.\n49-Toko5.png\n: ...\n8-Makoto2.png\n: Oh, Toko. So this is where you were.\n50-Toko4.png\n: What do you w-want? Am I so d-disgusting you want me out of y-your sight?\n8-Makoto2.png\n: N-No, that's not it at all. I just thought maybe you'd found a clue...\n49-Toko5.png\n: Well I h-haven't... I didn't find anything... Not one s-single clue!\n52-Toko12.png\n: I figured since this place was r-related to the case, it would have to h-have something, right? But there wasn't a-anything out of the ordinary here!\n53-Toko17.png\n: Give it b-back... Give me back my precious t-time!\n8-Makoto2.png\n: C-Calm down, Toko...\n52-Toko12.png\n: Don't tell m-me to calm down! Do you have any idea what I-I'm going through right now? When everyone finds o-out, they're gonna call me useless! G-Good for nothing!\n8-Makoto2.png\n: Nobody's gonna say that.\n55-Toko9.png\n: Master will!\nI'm...not sure I can disagree with that.\n56-Toko13.png\n: I don't want that! I'm sick of a-always being looked down on! Why w-won't anyone accept me...?\nUm, well...I don't think there are any clues here, so...maybe I'm gonna get going.\n55-Toko9.png\n: Gh...ngaaaAAaAAAahhH!\n3-Narration.png\n: Good to see some things never change. Time to check the garden for more clues.\n♪\nMusic fades out.\n♪\n...Umm...\n8-Makoto2.png\n: Huh?\nIt's gone... Mukuro's body...\n8-Makoto2.png\n: It's...not here?\n11-DISTRUST.png\n3-Narration.png\n: Makoto's right, the body is gone. We can't even examine the blast marks where the body had been.\n3-Narration.png\n: The only thing worth investigating is the toolshed again.\nMaybe the body is inside the toolshed.\n8-Makoto2.png\n: I'd better check, just to be sure.\nI didn't find anything even close to a dead body...\n8-Makoto2.png\n: But if it's not in here either, then it must be... Could it be...in the bio lab?\nBut corpses aren't the only thing I need to check in here. There's one other thing... That tarp. A tarp played a key role in another case, so... I'd better look into it...\nThe killer used the tarp to keep the sprinklers from getting the body wet. Which means the killer might have left some clue behind here...\n8-Makoto2.png\n: Huh...?\nI didn't notive this before, but there's a small stamp on one corner of the tarp.\n8-Makoto2.png\n: It says...bio lab?\nThen...this originally came from the bio lab?\nThat's all I really needed to check here.\n♪\nNo Music.\n♪\n69-AHintFromMonokuma.png\n*Ding dong, bing bong*\n72-MonokumaTV.png\n: Umm, this is a school announcement... Is everyone working hard? Is your investigation coming along nicely? Well then. Since you're all giving it your best, your generous headmaster will give you a little hint! Puhuhu... For those of you who are interested, please make your way to the gym ASAPossible!\nWhat...? *Now* he wants to give us a hint?\n8-Makoto2.png\n: It's suspicious, there's no doubt about that... This could be a trap...\nHe said to go to the gym, right...?\n75-DespairSyndrome2.png\n76-Hiro13.png\n: ...\n8-Makoto2.png\n: Oh, hey Hiro!\n77-Hiro8.png\n: Uwah! Makoto!?\n8-Makoto2.png\n: Why'd you act so surprised...?\n79-Hiro4.png\n: O-Oh, no reason!\n8-Makoto2.png\n: You heard Monokuma's announcement, right? Are you here to find out what he has to say?\n80-Hiro5.png\n: I...I... I just did, actually. I'm on my way out...\n8-Makoto2.png\n: You already talked to him? What'd he say!?\n80-Hiro5.png\n: ...Listen, sorry, b-but I...!\n82-Hiro6.png\n: I gotta go! *leaves*\n8-Makoto2.png\n: Hiro, wait!\nThere was no point in trying to stop him. He ran off like a frightened animal.\n8-Makoto2.png\n: H-Hiro...?\nIt was like he was trying to avoid me... I was hoping to talk to him about\nthe notebook I found in the locker\n...\n8-Makoto2.png\n: Has he been hiding something this whole time?\n4-MrMonokumasLesson.png\n5-Monokuma.png\n: Hello, welcome! Welcome, hello! Are you ready for your final hint!? Well, it just so happens to be in the envelope on the ground in front of you!\nThe envelope...?\nThis must be the envelope...\n9-Monokuma4.png\n: Puhuhu... And just so you know, I won't be answering any questions about what you find inside!\n10-Makoto2.png\n: Wh-What...?\n11-Monokuma13.png\n: Don't worry, just get on with it!\nMonokuma's cryptic words didn't make me feel any better, but I picked up the envelope...and opened it.\nWhat I found was...a single photograph.\n14-BoysLifeofDespair.png\nIt featured a bunch of faces I recognized extremely well. It was everyone who'd come to Hope's Peak at the same time as me.\n10-Makoto2.png\n: Wait, but...\n10-Makoto2.png\n: There's someone behind Sayaka... She's the only one I don't recognize...! Wait, that's not true. I *do* recognize her! That's right... When Byakuya and I were in the headmaster's room, and we looked at that file...\n10-Makoto2.png\n: Mukuro Ikusaba...? Then this girl is...?\n10-Makoto2.png\n: What...? Why...? Why is Mukuro here with everyone else? And even more than that...\nJust having everyone here posed like this is weird enough by itself. And we're all wearing matching uniforms. I don't remember anything like this... AND now that I'm looking at it...it's\nnot even everyone\n.\nI'm...not in the picture. I'm the only one not there... The picture has all fifteen other students...but not me.\nBut I guess that makes sense. After all, I don't remember ever taking a picture like this... I went to junior high with Sayaka, but the first time I met everyone else...was when I arrived here at Hope's Peak Academy. So it's natural for me not to be in this picture. But what's definitely *unnatural*...is that everyone else *is* in the picture.\nI thought everyone was like me, and didn't know each other till they got here. But if this picture is real...\n...then could that mean...?\n10-Makoto2.png\n: Could it be...? Everyone else...? And just me...? Everyone here except me is...?\n9-Monokuma4.png\n: Puhuhu... How long are you gonna keep up this rambling soliloquy of yours, Hamlet?\n5-Monokuma.png\n: You're kinda gettin' in the way standing there, ya know?\n19-Monokuma12.png\n: So...I mean...get out!\n10-Makoto2.png\n: B-But--!\n20-Monokuma2.png\n: I told you, I'm not fielding any questions!\n21-Monokuma3.png\n: What kind of mystery would this be if I gave you all the answers? That'd be totally out of left field!\n23-Monokuma6.png\n: dugretTt/r@@2e!-- brRRrqffqZZzzkkKk>3\nI guess that means he's done talking.\n10-Makoto2.png\n: Dammit...!\nSo in the end, all I found in the gym...was even more confusion. And with that confusion in hands, I left the gym dejected.\n26-DespairSyndrome1.png\n10-Makoto2.png\n: How does that count as a hint? It just made me even more confused...!\nIs that what Monokuma was going for? Did he put together a fake photo just to confuse me...?\nBut it looked so real, so full of life. How could anyone fake that...?\nWhich would mean...everyone but me...\n10-Makoto2.png\n: ...\nMaybe I should just ask everyone directly. That should clear all this up.\n10-Makoto2.png\n: No...I HAVE to clear all this up!\n29-BOX16.png\n30-Narration.png\n: Alright so we need to talk to the others. They're currently scattered around the school. Byakuya's in the archive, Hina's in the Dining Hall, Hiro's in the Garden and Toko's in the Bio Lab.\n10-Makoto2.png\n: Oh, Byakuya!\n36-Byakuya5.png\n: ...\n10-Makoto2.png\n: Listen, do you think we could talk?\n36-Byakuya5.png\n: ...\n10-Makoto2.png\n: Byakuya...?\n38-Byakuya4.png\n: I have nothing to talk to you about.\n39-Byakuya14.png\n: Don't talk to me as if we're friends. *leaves*\n10-Makoto2.png\n: H-Hey, Byakuya! Wait!\nBut of course he didn't. He just walked away.\n10-Makoto2.png\n: What the...? Why was he acting like that? Like he was purposefully trying to avoid me...\n10-Makoto2.png\n: So this is where you've been hiding. Listen, I was hoping to talk to you...\n45-Hina12.png\n: M-Makoto!?\n47-Hina10.png\n: ...S-Sorry! Gotta go! *leaves*\n10-Makoto2.png\n: What...?\nShe ran off so fast, I didn't even have time to ask her to stop.\n10-Makoto2.png\n: Hina...\nWhy...? Why won't you talk to me?\n10-Makoto2.png\n: Hey, Hiro!\n53-Hiro8.png\n: Gwah! M-M-Makoto!\n10-Makoto2.png\n: What's going on with you? Every time I see you, you freak out like that.\n54-Hiro4.png\n: N-No, I...\n56-Hiro6.png\n: No! Sorry, but I'm in a big hurry! *leaves*\nOnce again, he ran off like a terrified rabbit.\n10-Makoto2.png\n: Hiro...what's wrong?\nI still wasn't able to talk to him about the notebook I'd found. It was like he was avoiding me... Like he was afraid of me...\n10-Makoto2.png\n: Why...?\n30-Narration.png\n: This is very strange... Everyone is acting really suspicious.\n♪\nMusic fades out.\n♪\nI decided to visit the bio lab one more time. And the first thing I saw when I got there...\n14-BoysLifeofDespair.png\n...was her, passed out. Again.\n10-Makoto2.png\n: Huh? Toko...? T-Toko! Are you okay!?\nNo... No! She's not...dead, is she!?\n62-100MileJunkFoodDash.png\n63-Jill3.png\n: Kyeeehahahaha!\n10-Makoto2.png\n: Uwah!\n64-Jill4.png\n: It's cold... It's super cold! It's so cold, I think I might catch cold!\n10-Makoto2.png\n: If you keep taking naps in places like this, I'm sure you will...\n65-Jill5.png\n: What, I was asleep? Ahh, I musta fainted again!\n67-Jill6.png\n: I bet you were standing there, staring at me, getting all excited! Weren't you!?\n10-Makoto2.png\n: No...I wasn't...\n68-Jill2.png\n: Oh, then what? Hot and bothered? Straight-up horny!?\n10-Makoto2.png\n: Um, okay, so...why did you pass out?\n65-Jill5.png\n: I dunno! Last thing I remember was me waking up just now! What'd you do to Miss Morose!?\n10-Makoto2.png\n: Oh, that's right. Your memory stops and starts each time you switch...\n70-Jill9.png\n: Bingo bazinga! We share some basic knowledge, but our memories are very much separate!\n71-Jill8.png\n: And don't say it like it's a bad thing! It's a blessing as far as I'm concerned!\n68-Jill2.png\n: Cuz even if *she* forgets something, I totally remember!\n72-Jill7.png\n: So it's like double the memory!\nUh, no...it's more like half.\n65-Jill5.png\n: But all I wanna know right now is, where's my little darling!? Tell me now, or I slit your throat!\n10-Makoto2.png\n: I-I don't know. I'm sure Byakuya's around somewhere, doing his own investigating.\n75-Jill12.png\n: By himself!?\n10-Makoto2.png\n: I assume so...\n77-Jill11.png\n: I knew it! I totally knew it! I'm a total pro when it comes to all things Master!\n64-Jill4.png\n: Anyway, I gotta hurry! I can't even imagine how lonely he must be right now!\n63-Jill3.png\n: Kyeeeeehahahahahaha! *leaves*\nToko shot off, her eerie laughter echoing behind her.\n10-Makoto2.png\n: Ah, I totally forgot to ask her about the picture...\nWell, there's no point asking Genocide Jack anyway. Besides, I have more important things to do right now. Why did Toko faint? There's gotta be some reason for it...\n30-Narration.png\n: Sorry this one was kinda short. The update would become way too long if I continued on from this point so next time we'll pick up by examining this open morgue unit.\n2-BOX16.png\nThe fridge--it's open!\n4-Makoto2.png\n: But I'm sure they were all shut tight last time I was here...\n???: That must be why she passed out.\n6-Kyoko2.png\n: She faints so easily...\n4-Makoto2.png\n: K-Kyoko!\n7-Kyoko17.png\n: It's getting late, isn't it?\n4-Makoto2.png\n: Are you...okay?\n9-Kyoko3.png\n: I'm sorry if I made you worry.\n4-Makoto2.png\n: N-No, you don't have to apologize.\n6-Kyoko2.png\n: But listen, about this room...\n10-Kyoko7.png\n: It's a morgue.\n4-Makoto2.png\n: Y-Yeah...\n12-Kyoko11.png\n: I suspected as much. And Toko must have looked inside the fridge, seen what was in there, and...well, there you have it.\n4-Makoto2.png\n: You knew she'd fainted?\n6-Kyoko2.png\n: I was on my way here, when Genocide Jack came running past me. I assumed she must have sneezed, but once I got inside, the real reason became clear.\n13-Kyoko12.png\n: I imagine she came here to investigate, and when she opened the slot there...\n4-Makoto2.png\n: That's when she saw the body inside and dropped like a bag of rocks...\nWhy's everything gotta be so difficult with her?\n7-Kyoko17.png\n: Anyway, we should close it up. Don't want to leave it hanging open like that...\n4-Makoto2.png\n: Yeah, good idea.\n15-Kyoko19.png\n: Give me a hand with this.\nKyoko approached the fridge, hands outstretched. But suddenly...she stopped.\n4-Makoto2.png\n: What's wrong?\n17-DISTRUST.png\n10-Kyoko7.png\n: Maybe we should wait a second before closing it.\n4-Makoto2.png\n: Huh? How come...?\n10-Kyoko7.png\n: Because\n[Mukuro's body]\nis in here.\n> Mukuro's body\n4-Makoto2.png\n: Mukuro's corpse...? Mukuro's body is inside the fridge!?\n12-Kyoko11.png\n: Just like every other time, the mastermind probably brought it up here while we were in the class trial.\n4-Makoto2.png\n: The mastermind did it...? Because they assumed we wouldn't be doing the class trial over again, I guess...\n13-Kyoko12.png\n: You may be right... Either way, now I can finally get a good look at the body.\nOh, that's right. Kyoko didn't get a chance to check the body during the last investigation.\n19-Kyoko13.png\n: I need to do my own examination of the corpse as soon as possible. I'm going to find a clue this time, and I'm going to grab the mastermind by the tail...\n4-Makoto2.png\n: Okay, so...what should *I* do?\n6-Kyoko2.png\n: Why don't you just...wait over there? I'll let you know as soon as I'm finished.\nJust...wait over there? That's it?\n21-Narration.png\n: While we wait, let's reconfirm something we saw in the garden.\nYou know, I think I've seen a tarp like this somewhere before...\n23-Flashback.png\nAh, it's the same as the one I found in the garden toolshed...! And if I remember, that tarp...\nIt had a stamp on it that said\nbio lab\n.\n23-Flashback.png\nAnd that's the tarp that was used to help camouflage the murder in the garden... At some point, someone got it from the bio lab and took it over there.\nOn the left side of the refrigerator, a bunch of blue lights are on.\n4-Makoto2.png\n: But these ones aren't...\n13-Kyoko12.png\n: It would seem the blue light comes on when a slot is occupied.\nSo when someone's in there...the blue light comes on... Looking around, the number of lights that are on, including Mukuro's... There's nine in all.\n4-Makoto2.png\n: Nine... Nine lights...?\nI should ask Kyoko about the group photo...\n33-FlashT.png\n35-FlashB.png\nAfter all, she's in it too.\n4-Makoto2.png\n: Don't let me interrupt your investigation, but I wanted to talk to you about something.\n12-Kyoko11.png\n: ...What is it?\n4-Makoto2.png\n: It's about that announcement Monokuma made earlier...\n7-Kyoko17.png\n: You mean the one about a \"hint\" or something? I didn't take him up on the offer.\n4-Makoto2.png\n: Huh? Why not?\n10-Kyoko7.png\n: The only reason he'd give us a \"hint\" at this point would be to confuse us, to cloud our judgment. I can solve this mystery on my own, without whatever hints he may have to offer.\n4-Makoto2.png\n: That's...a good point.\nI wish I could go back and do the same thing, but what's done is done, I guess... Standing here looking at her...I don't think she's hiding anything from me. Is she right? Did the mastermind forge that picture as a trap to confuse us? That's gotta be it. There's no other explanation...\n7-Kyoko17.png\n: Okay, Makoto. I'm done.\n4-Makoto2.png\n: Already? Jeez, that was fast!\n19-Kyoko13.png\n: Anyone can do good work if they go slow. In that spirit, I'll make my\n[report]\nbrief.\n> report\n4-Makoto2.png\n: So, did you find anything?\n9-Kyoko3.png\n: I paid careful attention to the wounds and the traces of blood. And it seems highly likely that the stomach wound and blow to the back of the head were inflicted\nafter death\n.\n4-Makoto2.png\n: Really...?\n9-Kyoko3.png\n: The burnt tissue made things a little difficult, but I'm completely confident in my findings.\nSo that means neither of those were the fatal injury, right?\n4-Makoto2.png\n: Then what *was* the fatal injury...?\n\"Due to the explosion, the victim's identity is unknown. They were, however, dead before the blast. The victim had been stabbed a single time with a knife, which went completely through the body. They had also been struck in the head with an object about as thick as a metal pipe. The body was covered with other wounds, but these were at least several days old.\"\n4-Makoto2.png\n: The only other option is those \"\nother wounds\n,\" but the file said they were old.\n19-Kyoko13.png\n: Where does it say they're old?\n4-Makoto2.png\n: ...Huh?\n19-Kyoko13.png\n: All the Monokuma File says is that they were inflicted\nat least several days ago\n.\n4-Makoto2.png\n: I...guess I don't see the difference.\n42-Kyoko14.png\n: Well the difference is immense, considering the impression they give.\n12-Kyoko11.png\n: You seem to be equating \"several days old\" with simple \"\nold\n\".\n19-Kyoko13.png\n: But that doesn't quite follow logically. \"Old wounds,\" it makes it sound like they've been there forever, like they're not related to the murder.\n4-Makoto2.png\n: Are you saying...they are? But we all got the Monokuma File right after she was killed, right? So if the wounds were at least a few days old, there's no way they could've had anything to do with it.\n44-Kyoko.png\n: But what if Mukuro herself wasn't killed within the last few days.\n4-Makoto2.png\n: What...!?\n19-Kyoko13.png\n: Certainly you can allow it as one of the many possibilities, can't you?\n4-Makoto2.png\n: One of...many?\n7-Kyoko17.png\n: A detective doesn't have supernatural powers. There's no way to predict the answer from the beginning. Instead, the ideal detective begins by imagining as many possible scenarios as they can.\n19-Kyoko13.png\n: They envision these possibilities without prejudice, without bias, using only their logic and common sense. Then, as they investigate, they test what they find against each of these possibilities.\n46-Kyoko15.png\n: Of course, me telling you this doesn't mean you'll be any good at detective work. but beyond using that to solve this particular mystery, you should keep it in mind for the future.\n6-Kyoko2.png\n: So, if there's anything else you'd like to know about\n[the condition of the body]\n, now's the time.\n> the condition of the body\n4-Makoto2.png\n: Come to think of it, there was on thing... Earlier, when I was looking at Mukuro's profile, it listed her height and weight...\n9-Kyoko3.png\n: 5 foot 7 inches, 97 pounds. Vitals were...31-22-32. Did I get all that right?\n4-Makoto2.png\n: You remembered all that...?\n19-Kyoko13.png\n: They are indeed consistent with the corpse.\n4-Makoto2.png\n: So then...\n12-Kyoko11.png\n: And don't forget about the Fenrir tattoo. There's absolutely no mistake...\n42-Kyoko14.png\n: Our victim in this case is, without a doubt, Mukuro Ikusaba...!\n2-BOX16.png\n6-Kyoko2.png\n: Is that all you wanted to ask?\n4-Makoto2.png\n: Y-Yeah, I think so...\n9-Kyoko3.png\n: Then it looks like we have no further business with Mukuro's body. Let's get going. It's kind of chilly in here...\n4-Makoto2.png\n: Oh, wait, are we not gonna put the body back? Don't you think it's kinda...sad, leaving it out like this?\n10-Kyoko7.png\n: Sad...? Did you forget? She was our enemy once. A part of the\nUltimate Despair\n.\n4-Makoto2.png\n: B-But she still got killed. She's still a victim...\n10-Kyoko7.png\n: Have you ever heard the phrase \"you reap what you sow\"?\n4-Makoto2.png\n: W-Well, yeah, but still...\n10-Kyoko7.png\n: ...\n7-Kyoko17.png\n: You really are naive, you know that? It's really quite appalling...\nBut she could have abandoned me...but she decided to help me instead. So for someone like that, what does it mean to be \"naive\"?\n*Grrrrnn* *Click*\n6-Kyoko2.png\n: I think we've done all we can do here. Back to our separate investigations, yes?\n4-Makoto2.png\n: Ah, hold on!\nI still have one more thing to do... Something I need to talk to Kyoko about...\n33-FlashT.png\n35-FlashB.png\nI need to ask her about the pocketbook I found in that locker. If I don't do it now...\n4-Makoto2.png\n: Hey, Kyoko... I did have one last thing... I know I shouldn't, but I feel like I have to ask...\n44-Kyoko.png\n: Go ahead, then. Out with it.\n4-Makoto2.png\n: Have you really not seen your dad even once since you got here?\n53-DespairSyndrome2.png\n54-Kyoko9.png\n: What...?\n10-Kyoko7.png\n: What do you mean?\n4-Makoto2.png\n: Well...you know all those lockers on the 2nd floor of the dorms?\n10-Kyoko7.png\n: I do, yes. But to get into any of the lockers, you'd need the handbook of whoever the locker belongs to.\n4-Makoto2.png\n: Actually...I managed to get them open using that emergency handbook.\n12-Kyoko11.png\n: The one you found in the headmaster's hidden room...\n44-Kyoko.png\n: So? Did you find anything worthwhile in the lockers?\n4-Makoto2.png\n: I found...a pocketbook. And after looking through it...I think it must be *your* pocketbook.\n10-Kyoko7.png\n: ...What makes you say that...? Like I said, only the locker's owner should be able to get into it, right? I can't imagine those lockers belonged to any of us... After all, we only got access to that area just recently. What I'm saying is, there's no way I could've had access to any of those lockers. And if I *did* have a pocketbook, why would I bother putting it in a locker?\n4-Makoto2.png\n: Everything you just said makes perfect sense. But there was something written inside... It was about the headmaster--about your father.\n17-DISTRUST.png\n56-Kyoko10.png\n: ...!?\n57-Kyoko8.png\n: Could that mean... That video...is real, too...?\n4-Makoto2.png\n: Video?\n10-Kyoko7.png\n: Makoto...I think everything is finally starting to fit together to reveal a cohesive picture. Although...I'm afraid that picture might be worse than anything we could have imagined.\n4-Makoto2.png\n: Wh-What are you talking about...?\n10-Kyoko7.png\n: I need to go investigate those lockers, right now. I need to confirm what you just said with my own two eyes.\n4-Makoto2.png\n: Oh, let me give you the headmaster's handbook. That way you can--\n6-Kyoko2.png\n: That won't be necessary. If I'm right about this, I shouldn't have any problem opening the locker with my own handbook. After all, it would seem that it's\nmy locker\n.\n4-Makoto2.png\n: Your locker...?\n7-Kyoko17.png\n: If you watch this, it'll all make sense.\nA DVD...? And it says...\"Class #78: Urgent Interviews\"!?\n7-Kyoko17.png\n: I found it in that hidden room, after you left.\n10-Kyoko7.png\n: I don't have time to explain what I think it means, so just watch it and see for yourself. I think you'll realize exactly what it means... You'll understand why you found my pocketbook in a place none of us have ever seen before.\nNone of this makes sense right now... But I guess that means there's some important clue on this DVD...\n60-DeathWish.png\n7-Kyoko17.png\n: Oh, and now it's my turn. Do you have a second to listen to me ramble...?\n4-Makoto2.png\n: Ramble...?\n7-Kyoko17.png\n: So as it turns out...the arrangements I'd made...didn't stick. What I mean is, I'm less and less sure of everything. Even my own feelings...\nYou're talking about your dad, right?\n7-Kyoko17.png\n: I can never find the answers to the questions I wanted to ask. For the rest of my life...\nAnd all because of the mastermind...\n10-Kyoko7.png\n: But there's one thing I *am* sure of. When it comes to the mastermind, there's no room in my heart for forgiveness. I swore to destroy the mastermind. This is just one more reason to follow through on that.\nKyoko's eyes burned with the fire of determination... The determination to defeat the mastermind...\n6-Kyoko2.png\n: It's strange...to be confronted with his death, and suddenly feel this way. I couldn't care less if my father had found happiness.\n7-Kyoko17.png\n: So why is it...? Why does it bother me so much to know how he suffered...? It's ridiculous. There's just no understanding it, I guess...\nShe let out a small laugh as she said it. But her smile was filled with sorrow.\n6-Kyoko2.png\n: So, that's it for my rambling. There's still much to do before I can consider my task complete.\n4-Makoto2.png\n: Yeah, you're right.\n44-Kyoko.png\n: But keep this in mind... There is only ever one absolute truth. Whether that truth serves\njustice\nor\nsuffering\n... Whether it's the\ngreatest\ntruth, or the\nworst\n...\n4-Makoto2.png\n: What do you mean...?\n7-Kyoko17.png\n: Even if the truth you uncover is filled with hopelessness...you still can't give up hope.\n4-Makoto2.png\n: A-Absolutely not! Because... Because all I can do is keep moving forward. That's pretty much all I'm good at, ya know?\n62-Kyoko5.png\n: Indeed... Sorry if that was...strange.\n15-Kyoko19.png\n: Anyway, I need to get going. I'll see you at the class trial... *leaves*\n2-BOX16.png\nLeaving behind that final farewell, Kyoko was gone.\n4-Makoto2.png\n: I'd better get going myself.\nI got that DVD from Kyoko... I should head to the A/V room to check it out.\nKyoko said something about hopeless truth... But no matter what happens, I *won't* lose hope. Even if it's the worst truth in the world...I can't afford to lose!\n21-Narration.png\n: Next time, we watch that DVD.\n1-Narration.png\n: I'm providing a video for the first part of this update if you'd like to watch this section instead of reading it. It only goes halfway through, so don't forget to come back when it's finished.\n../Smilies/emot-siren.gif\nClick here for a video.\n../Smilies/emot-siren.gif\n3-BOX16.png\nThis should be able to play DVDs just fine...\n6-Makoto2.png\n: Well then, I'd better take a look...\nI took the DVD Kyoko gave me and put it in the player.\n♪\nMusic fades out.\n♪\nIt said that it was playing, but nothing appeared on screen. I stared into the black of the monitor. It must have only been a few seconds...but to me it felt like an eternity. And then, all of a sudden...an image appeared.\n10-NewWorldOrder.png\n11-Makoto33.png\n: S-Sayaka!?\nIt took me by total surprise. I hadn't seen Sayaka in who knows how long, and there she was...\n12-Headmaster.png\n: Okay then, are you ready to begin?\nThe voice I heard was of the man positioned on one side of the screen. It was the voice of a middle-aged man.\n12-Headmaster.png\n: I do apologize, but I hope you don't mind if I record our conversation. I'm a little slow, you know. I never really got the hang of taking notes while having a conversation.\nIt sounded like he was trying to make a joke, but Sayaka's tense face didn't move a single millimeter.\n12-Headmaster.png\n: So, this video is meant to serve as a kind of contract substitute. It's not that I don't trust you guys. It's more like...insurance. So please don't worry too much.\n13-Sayaka20.png\n: ...\n12-Headmaster.png\n: Now then, let me get straight to the point. There is a chance that you may have to spend the rest of your life here in the school. Can you accept that?\n13-Sayaka20.png\n: Y-You want me to accept that...?\nSayaka was obviously at a total loss. It made total sense. Who would agree to spending the rest of your life in this school?\n13-Sayaka20.png\n: I...accept.\n...What?\n12-Headmaster.png\n: Thank you. And I'm sorry about all this... Well, I can promise you that I will do everything in my power to keep you safe. As the headmaster of Hope's Peak Academy, I give you my word.\nAs if on cue, that's where the video cut out.\n6-Makoto2.png\n: ...\nThere was a lot I hadn't understood up till now. But this...only this... I simply couldn't comprehend what I'd heard. Because I know how much Sayaka wanted to get out of here. I know how much she wanted to escape and pursue her dreams with her friends again.\n6-Makoto2.png\n: She wanted that so bad...she tried to frame me for murder. So...why? Why would she say yes to living here for the rest of her life?\nAs I sat there thinking about it, I noticed a sudden light. On the monitor, the video that I thought was finished flashed back onscreen. My eyes darted back to the screen.\nAnd if I was confused before...what I saw next pushed me right over the edge.\n16-Makoto21.png\n: ...Huh?\nWhat I was was...me. Impossibly, undeniably, me...\n12-Headmaster.png\n: So, Makoto. Before we begin, I should let you know that I'll be recording our conversation.\n17-Makoto18.png\n: Yes...\nMe and the headmaster were looking at each other. He and I were having what seemed like a fairly normal conversation. But I, the I in the here and now...had absolutely no memory of it. I had no memory of even meeting the headmaster, much less sitting down to talk to him like this.\n12-Headmaster.png\n: Now, shall we get straight to the point? Makoto... There's a chance you may have to spend the rest of your life in the school. Can you accept that?\n17-Makoto18.png\n: ...Yes.\nThis can't be real... I...said yes?\n12-Headmaster.png\n: I'm sorry I'm putting you through all this.\n17-Makoto18.png\n: Well, I mean...we don't have much of a choice, do we?\n12-Headmaster.png\n: But I promise that as long as you're in this school, I will do everything I can to protect you. As the headmaster of Hope's Peak Academy, that's the very least I can do for you.\nOnce again, the video cut out. From there, the video repeated the same scene again and again with the others.\nByakuya...\nToko...\nHina... Everyone... They all said that they agreed to live in this school...forever. And then...\nKyoko... Her interview with him had been recorded just as clearly. Without a doubt, she *had* met him. She'd sat down with the headmaster of Hope's Peak Academy--her father... And when he asked her his question, she answered the same as everyone else. She accepted a life within the school.\nJust as Kyoko's interview was wrapping up...\n*Click*\n♪\nMusic cuts out.\n♪\n...the monitor suddenly went black.\n6-Makoto2.png\n: Huh...?\nIt wasn't just the monitor. The DVD player itself had apparently turned off. Which of course meant that the DVD player wasn't playing anymore.\n6-Makoto2.png\n: Wh-What the heck just happened...?\n23-MrMonokumasLesson.png\n24-Monokuma11.png\n: Oopsie! Looks like it broke! Out of service!\n6-Makoto2.png\n: What? It just so happened to break just now...?\n25-Monokuma.png\n: Now, then, when, doesn't matter! Failure can strike anywhere, anytime!\n26-Monokuma5.png\n: That's what failure IS, right!? *leaves*\n27-DespairSyndrome2.png\n6-Makoto2.png\n: Failure my ass! You cut the power on purpose!\nWell, whatever...\n6-Makoto2.png\n: Even if I watched the whole thing, it'd just be more of the same... He'd ask them the question, and they'd all say yes...\nI couldn't help myself. I let out a huge, exasperated sigh. But as I did...I remembered something.\n28-Flashback.png\n30-Kyoko2.png\n: I fainted, too. And when *I* woke up...I noticed a strange feeling of...separation within myself. A disconnect.\n31-Kyoko7.png\n: Thinking back on it now, at that point my memory was gone. At that time...I'd forgotten. I couldn't remember why I'd come to this school, and I couldn't remember what my \"ultimate\" ability was.\n6-Makoto2.png\n: But...what would make you forget all that?\n30-Kyoko2.png\n: Strange, isn't it? It's hard to imagine it happened by chance. It seems much too convenient.\n28-Flashback.png\nA convenient outcome... Something that seemed to obviously work in favor of the mastermind... So does that mean...\n6-Makoto2.png\n: ...I've lost my memory, too?\nWhat about the others? Have we *all* forgotten? Or... ...\n33-TimefortheFinalTrial.png\n*Ding dong, bing bong*\n36-MrMonokumaAfterClass.png\n37-MonokumaTV.png\n: For anything that has a start, there has to be an end. And if the end comes, then that means it's time for a fresh start. There is no night that doesn't have a dawn... Although that dawn is totally pitch-black! There is no storm that won't eventually end... Of course, then that leads to drought! But as I said, every end is the promise of a new beginning. Which is why I'm sure we'll get to meet again. Because the end is only the beginning!\n37-MonokumaTV.png\n: Anyway, let's get started! The beginning of the end of the class trial! Everyone gather once again at you know where! Puhuhuhuhu! Puhuhu!\n10-NewWorldOrder.png\nIt's about to begin again... The class trial...is going to start. The final class trial... The last time all our lives will be on the line... The last time hope and despair are on the line...\n6-Makoto2.png\n: I don't have a choice. I have to do this...\nOkay, then! This is the end...!\n41-BoysLifeofDespair.png\nI guess I'm the first one this time...\n42-Kyoko13.png\n: You're early, Makoto.\n42-Kyoko13.png\n: Does that mean you feel prepared?\n6-Makoto2.png\n: Yeah...for now, at least. But where's everyone else? Why aren't they here yet?\n30-Kyoko2.png\n: Don't worry, I'm sure they'll be here soon.\nAnd just like she said...\n46-Byakuya2.png\n: ...\n6-Makoto2.png\n: Byakuya!\n47-Byakuya5.png\n: ...\n6-Makoto2.png\n: B-Byakuya...?\n♪\nMusic fades out.\n♪\nThey arrived, one after another. But they were all in the same state of shock.\n50-Hina16.png\n: ...\n6-Makoto2.png\n: Hina...?\n50-Hina16.png\n: ...\n52-Hiro5.png\n: ...\n6-Makoto2.png\n: Hiro?\n52-Hiro5.png\n: ...\nSilence. And it wasn't any normal silence. It was the deafening silence of fear and suspicion. It was like...the first class trial.\n41-BoysLifeofDespair.png\n55-Jill2.png\n: AaaahhhI'mlaaaattteeee!!!\n56-Byakuya.png\n: ...\n57-Jill6.png\n: Ahh, strong silent Master is so wonderful! So cool, so hot, my loins are ablaze!\n55-Jill2.png\n: Now listen, everything'll be just fine if you leave it to me!\n59-Jill7.png\n: With my scissor-sharp scissors in hand, I'll stab and gouge and shiv the master of evil...!\n6-Makoto2.png\n: But, I thought you couldn't kill anyone but adorable little boys...\n60-Jill12.png\n: If it's what Master wants, it can be a boy, girl, or anything in between! I can handle it...\n62-Toko16.png\n: ...Achoo!\n64-Toko5.png\n: N...nng...where a-am I?\n6-Makoto2.png\n: ...\n30-Kyoko2.png\n: No human language can describe the disappointment I'm feeling right now.\n66-Monokuma4.png\n: Puhuhu. Is everyone here? Ooh, and wearing our Gloomy Gus faces, I see!\n25-Monokuma.png\n: Okay, well then...let's begin!\n26-Monokuma5.png\n: This final class trial is gonna be slathered in pitch-black despair! Climaximum sorrow!\n31-Kyoko7.png\n: You're right. This *is* the final class trial. And this time, it'll be fair.\n68-Monokuma2.png\n: Whaddya mean, THIS time!? Stop with all the slander! I'm a bear in good standing, ya know!\n69-Monokuma3.png\n: If there was a Mr. Fair Guy Universe contest, I'd take home the tiara every year! I'm gonna win this game super fair and square!\n70-Monokuma10.png\n: And I'll make sure everyone watching at home knows...that\ndespair\nis mightier than\nhope\n.\n47-Byakuya5.png\n: Enough of your tedious drivel. Begin the trial already.\n66-Monokuma4.png\n: Sure, sure. Let's begin the trial already! I'll be waiting for you down below.\n72-Monokuma12.png\n: So don't try and run away...\n26-Monokuma5.png\n: Ahh-hahahaha! *leaves*\nLaughing as loud as ever, Monokuma disappeared.\n74-Byakuya7.png\n: Hmph. Whatever.\n75-Byakuya4.png\n: This will be over in no time. *leaves*\nWith an inexplicable confidence, Byakuya was the first into the elevator. One by one the others followed.\n50-Hina16.png\n: ... *leaves*\n52-Hiro5.png\n: ... *leaves*\n64-Toko5.png\n: Gh-ngh... *leaves*\nNobody made eye contact, nobody said a word. They just disappeared into the elevator.\n31-Kyoko7.png\n: They're all acting...odd. Like they're paranoid, suspicious of each other... But you know why that is, don't you?\n6-Makoto2.png\n: Y-Yeah, I think so...\n30-Kyoko2.png\n: Well, you can tell us all about it soon. At the class trial...\n6-Makoto2.png\n: You're right. I'm ready...\n78-Kyoko15.png\n: Ready to win, right?\n6-Makoto2.png\n: Of course...\n79-Kyoko19.png\n: I'm glad to hear you say that. *leaves*\nAnd then Kyoko was aboard the elevator.\n♪\nMusic fades out.\n♪\nI started making my way toward the opening. Step after step toward that gaping maw... I'd resolved that this would be the last time. I repeated to myself that there was no fear, no mystery left. I pushed my anxiety down, calmed my trembling body. And finally, on steady legs...\n...I passed the threshold and stood in the elevator.\nWithout warning it began to descend... Deeper and deeper...\nDeeper...deeper...deeper still.\nDeeper and deeper, deeper and deeper, deeper and deeper...\nDeeper and deeper it fell...\nI closed my eyes, and sight fell away. All sound, too, disappeared. Alone in the universe, I waited for the elevator doors to open for the last time. What could have been seconds or centuries later...I felt the gentle vibration of the elevator come to an end. I slowly opened my eyes.\n6-Makoto2.png\n: This...is the final trial site?\n72-Monokuma12.png\n: Whaddya think? Isn't it just the perfect background for deciding a person's fate!?\n86-Monokuma6.png\n: It's the long-awaited last stage! The always-exciting final boss battle!\n66-Monokuma4.png\n: Puhuhu... And I'm gonna sit in on this one! I'll just sit right here in the vacant sixteenth seat!\n26-Monokuma5.png\n: Well then! Let's...BEGIIIIIIIIIIIINNN!!!\n89-UndergroundTrial.png\n1-Narration.png\n: Welcome...to the Final Class Trial. It's all come down to this.\n1-Narration.png\n: The ticker along the bottom reads the following:\n\"The mastermind stands exposed, and must pay for their crimes. Now all that's left is the looming mystery of Hope's Peak Academy itself...\"\n1-Narration.png\n: Unfortunately, since Chapter 6 has no Free Times, I didn't get enough SP over the course of the game to add\nBreathing Technique\nto my list of equipped skills. Therefore, the list of skills I'll take in to this trial will remain the following:\nAlgorithm, Upshift, Cool and Composed, Robot Jock, Melodious Voice and Handiwork\n.\n1-Narration.png\n: Lastly, let's go over our Truth Bullets.\n92-Tutorial.png\n: They had also been struck in the head with an object about as thick as a metal pipe. The body was covered with other wounds, but these were at least several days old.\n92-Tutorial.png\n: In addition, the areas directly connected to Mukuro Ikusaba's death are the garden and dojo.\n92-Tutorial.png\n: ...there's no doubt that this tarp came from there.\nHeight: 5 foot 7 inches\nWeight: 97 pounds\nVitals: 31-22-32\n92-Tutorial.png\n: Kyoko has confirmed that the corpse matches these characteristics.\n92-Tutorial.png\n: They are motivated only by despair, making them some of the most despicable people to ever live.\n92-Tutorial.png\n: ...the pocketbook:\n92-Tutorial.png\n: \"Despair walks among us. And so, we survive... There's a second 'despair'...\"\n92-Tutorial.png\n: ...Mukuro's body inside, comes to a total of nine.\n92-Tutorial.png\n: ...somehow...?\n92-Tutorial.png\n: ...interference, Makoto wasn't able to watch the DVD all the way through.\n1-Narration.png\n: And with that, join me next time for The Final Class Trial.\n",
    "evidence_objects": [
        {
            "name": "Places to Check",
            "description": "Several rooms had been locked up until this point: The headmaster's room on the 4th floor, the bio lab on the 5th floor, the Monokuma door in the data center on the 4th floor, and the 2nd floor of the dormitory area. In addition, the areas directly connected to Mukuro Ikusaba's death are the garden and dojo."
        },
        {
            "name": "Monokuma Control Room",
            "description": "The Monokuma room in the data center opened to reveal a small room used to command Monokuma. This is where the mastermind had been issuing commands to the ursine robot."
        },
        {
            "name": "Tarp",
            "description": "The tarp found in the garden had played a part in Mukuro's murder. \"Bio lab\" had been stamped onto one corner of the tarp."
        },
        {
            "name": "Mukuro Ikusaba's Profile",
            "description": "According to the headmaster's report, Mukuro did not have a single scar or wound when she came to Hope's Peak Academy. In addition, her physical features were as follows: Height: 5 foot 7 inches. Weight: 97 pounds. Vitals: 31-22-32."
        },
        {
            "name": "The Ultimate Despair",
            "description": "The phrase \"the Ultimate Despair\" doesn't refer to a single individual, but a like-minded group of people. One year ago, that group brought about the single worst event in human history. They are motivated only by despair, making them some of the most despicable people to ever live."
        },
        {
            "name": "Hidden Room Present",
            "description": "There was a brightly colored box sitting in the headmaster's hidden room. Inside the box were human bones—the last remains of the headmaster."
        },
        {
            "name": "Photo of Kyoko and Headmaster",
            "description": "In his hidden room, the headmaster kept a photo of him and a young Kyoko together. In the photo, they are both smiling."
        },
        {
            "name": "Headmaster's e-Handbook",
            "description": "An emergency handbook was found in the headmaster's hidden room. This handbook apparently has no restrictions, and was given to the school's ultimate authority—the headmaster."
        },
        {
            "name": "Locker Notebook",
            "description": "The notebook was found in a locker on the 2nd floor of the dorms. Yasuhiro's name was written on the inside, and it has notes for a number of different classes."
        },
        {
            "name": "Locker Pocketbook",
            "description": "The pocketbook was found in a locker on the 2nd floor of the dorms, and based on what was written inside, it's believed to be Kyoko's. There's some kind of message scrawled on the last page of the pocketbook: \"Despair walks among us. And so, we survive... There's a second 'despair'...\""
        },
        {
            "name": "Bio Lab Secret",
            "description": "The bio lab on the 5th floor seems to have been repurposed as a morgue."
        },
        {
            "name": "Bio Lab Lights",
            "description": "A corpse fridge has been installed in the bio lab. It seems that a blue light comes"
        },
        {
            "name": "Group Photo",
            "description": "The photo depicts all the Hope's Peak students wearing matching uniforms. Worth"
        },
        {
            "name": "Genocide Jack's Memory",
            "description": "It would seem that while Toko and Genocide Jack share certain fundamental knowledge, their individual memories are separate."
        },
        {
            "name": "Kyoko's Account",
            "description": "Kyoko attests that both the stab wound and the blow to the head were inflicted after death."
        },
        {
            "name": "Interview DVD",
            "description": "Kyoko found this DVD in the headmaster's hidden room, and handed over to Makoto for him to watch."
        },
        {
            "name": "Mukuro's Fatal Injury",
            "description": "Mukuro's fatal injury would appear to be the collection of wounds covering her body."
        },
        {
            "name": "The <a href=\"/wiki/Ultimate_Hope\" title=\"Ultimate Hope\">Ultimate Hope</a>",
            "description": "It would appear that Makoto may have hidden within him the power to stand against the Ultimate Despair."
        }
    ],
    "turn": [
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "Okay, so you want us to figure out who killed her before we do anything else...",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "So who did it...? Who killed her?",
                    "person": "Monokuma",
                    "present": []
                },
                {
                    "testimony": "Whoever did it is the same one who's ***behind everything*** .",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "That much I'm sure of.",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "But when you think about it... Is the mastermind really here in the school?",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "Of course!",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "They hafta be ***here somewhere*** !",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "What makes you so sure?",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "Umm... what *does* make me so sure...?",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "Exactly. You're j-just making stuff up. There's no way the m-mastermind is here. The mastermind is p-probably ***a million miles away*** ...",
                    "person": "Toko",
                    "present": [
                        "Monokuma Control Room"
                    ]
                },
                {
                    "testimony": "C-Cuz masterminds always lurk off in the b-background, right? ***Where is the mastermind*** ...?",
                    "person": "Toko",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "Mukuro w-was the ***Ultimate Soldier*** . She must've been in a h-hundred different battles.",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "So when you th-think about it...",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "Obviously she g-got ***all those wounds in battle*** !",
                    "person": "Toko",
                    "present": [
                        "Mukuro Ikusaba's Profile"
                    ]
                },
                {
                    "testimony": "Are you finished?",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "You didn't d-deny me this timesy wimesy!",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "Agh! You made me go all cutesy!",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "Don't worry. There wasn't anything cute about it.",
                    "person": "Hiro",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "15-ClassTrialTHESUN.png\n16-Makoto28.png\n: No, Mukuro didn't\n**\nsuffer those wounds\nin battle. The file we found in the headmaster's room said as much.\n18-Makoto29.png\n: Despite the time she spent in battle after battle as a member of Fenrir...when she entered this school, she\n**\nhadn't sustained a single injury\n.\n19-Toko3.png\n: T-To be denied so completely... Actually, it's k-kind of refreshing!\n20-Toko7.png\n: *gasp* M-Maybe it's cuz of all of Master's t-training!\n21-Byakuya15.png\n: ...\n23-Makoto23.png\n: Anyway... So we can be sure that Mukuro suffered all those wounds\n**\nafter coming to this school\n.\n16-Makoto28.png\n: In which case, they could be the very thing that killed her!\n7-Kyoko3.png\n: As a matter of fact, it's hard to imagine any other possibility.\n25-Kyoko11.png\n: When examining her body, I found that her stomach and head wounds came\n**\nafter she was already dead\n.\n26-Makoto25.png\n: Unless anyone has any better suggestions, I think we can say this with confidence...\n18-Makoto29.png\n: The wounds Mukuro sustained all over her body are what\n**\nultimately killed her\n!\n30-ClassTrialDawn.png\n31-Hiro12.png\n: But if that's what killed her...\n32-Hiro15.png\n: ...then does that mean she's really been dead for who knows how long!?\n26-Makoto25.png\n: That's exactly what it means. When we found her body in the garden, she'd already been\n**\ndead for several days\n.\n33-Byakuya9.png\n: So then, what about the little matter of what happened last night?\n34-FlashT.png\n36-FlashB.png\n33-Byakuya9.png\n: Makoto, you said you were attacked in your room by\n**\na masked assailant\n. If Mukuro had already been dead for several days, certainly it couldn't have been her. So who was it that attacked you?\nThe identity of the one who attacked me... I can't think of anyone else...!\n> The mastermind\n16-Makoto28.png\n: The one who attacked me...was the true\n**\nmastermind\n.\n34-FlashT.png\n36-FlashB.png\n16-Makoto28.png\n: When we discovered Mukuro in the garden wearing the same mask...I naturally assumed she must have been the one who attacked me. But I was wrong. It wasn't her at all. It was the mastermind!\n40-ClassTrialChaos.png\n41-Monokuma5.png\n: Ahaha! Hahahaha!\n5-Toko12.png\n: Wh-What are you laughing at...?\n42-Monokuma13.png\n: Oh, don't mind me. I'm just getting a little impatient sitting her listening. I think I'm gonna jump in!\n44-Monokuma.png\n: Let's start off with a nice, easy question. Your assumption that I attacked Makoto is just that, right? An\n**\nassumption\n. You can't really know who was under that mask, can you? I mean, that's the whole point of a mask!\n45-Monokuma6.png\n: The true identity of the masked attacker is Mukuro Ikusaba! At least, that's what I think!\n46-Monokuma4.png\n: Puhuhu... Do you have any evidence that might convince me otherwise?\nNo, there's no way Mukuro is the one that attacked me... Even if I didn't see their face...\n34-FlashT.png\n36-FlashB.png\nIf you compared what we know about Mukuro to the masked attacker...it should be obvious!\n",
            "testimonies": [
                {
                    "testimony": "You never saw their face, right?",
                    "person": "Monokuma",
                    "present": []
                },
                {
                    "testimony": "So you can't have any idea who was under that mask!",
                    "person": "Monokuma",
                    "present": []
                },
                {
                    "testimony": "I'm telling you now, ***it was Mukuro Ikusaba*** !",
                    "person": "Monokuma",
                    "present": []
                },
                {
                    "testimony": "You're wrong. Even without seeing their face...there's another part of the attacker we can use to prove it wasn't her.",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "Oh? And what is this other part?",
                    "person": "Monokuma",
                    "present": []
                },
                {
                    "testimony": "Is it the ***right hand*** ? Or the ***left hand*** ? Maybe the ***right foot*** ? Or perhaps the ***left foot*** ?",
                    "person": "Monokuma",
                    "present": []
                },
                {
                    "testimony": "Or could it be... the ***hips*** !? ***something Mukuro definitely had*** ... That should be proof enough that the one who attacked me wasn't Mukuro!",
                    "person": "Monokuma",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "3-BTB.png\n7-Monokuma9.png\n:\n**\nLa-la-la! I can't hear you! La-la-la-la-la!\n9-Narration.png\n: The number of lights on in the bio lab doesn't match the number of people who have died!\n> Fire \"Bio Lab Lights\"\n14-ClassTrialTHESUN.png\n15-Makoto29.png\n: The inconsistency Kyoko's talking about is...\n**\nthe lights\n!\n16-Monokuma7.png\n: Ga-haaah!\n17-Monokuma2.png\n: Wh-What are you talking about? What about the lights...?\n18-Makoto31.png\n: Like I said before, the bio lab also acts as a morgue.\n19-FlashT.png\n21-FlashB.png\n18-Makoto31.png\n: And as part of that, a giant\n**\nrefrigerator\nwas installed in there. That's where everyone who's died is stored.\n23-Kyoko12.png\n: And it was set up so that when a slot had a body in it, a\n**\nblue light would turn on\n.\n24-Byakuya2.png\n: In other words, if the blue light is on, that means there's a body in that slot.\n19-FlashT.png\n21-FlashB.png\n18-Makoto31.png\n: But I counted up the number of blue lights that were on, including the one Mukuro was in...and there were only\n**\nnine\n!\n27-Hiro2.png\n: Why does that matter? You gotta give me the bite-size version here, man!\nNine lights doesn't make sense. The number of lights that should be on is...\n> Ten lights\n18-Makoto31.png\n:\n**\nTen\nof the lights should have been on. Any other number is incredibly suspicious!\n30-Toko5.png\n: S-Suspicious...? Why?\n31-Kyoko13.png\n: That's simple. Just recall who's died here so far, and it should become clear.\nThat's right... That's the key to solving this mystery...\n19-FlashT.png\n21-FlashB.png\nSayaka died first...\n19-FlashT.png\n21-FlashB.png\nJunko was second...\n19-FlashT.png\n21-FlashB.png\nLeon was third...\n19-FlashT.png\n21-FlashB.png\nChihiro was fourth...\n19-FlashT.png\n21-FlashB.png\nMondo was fifth...\n19-FlashT.png\n21-FlashB.png\nTaka was sixth, then Hifumi was seventh...\n19-FlashT.png\n21-FlashB.png\nCeleste was eighth...\n19-FlashT.png\n21-FlashB.png\nSakura was ninth...\n19-FlashT.png\n21-FlashB.png\nAnd victim number ten was Mukuro.\n42-Hina9.png\n: Hm... So\n**\nten people\nin all?\n43-Makoto28.png\n: That's right. Any other number should make you immediately suspicious. But according to the lights in the bio lab, only nine people were being stored there...\n44-Hiro8.png\n: Y-You're saying a dead body just...up and disappeared!?\n45-Hina16.png\n: I got it! The mastermind destroyed one of the bodies to get rid of evidence!\n46-Makoto25.png\n: But if they wanted to do that, they would've destroyed Mukuro's body, since they actually killed her. And yet...her body was left alone.\n47-Hina12.png\n: Then...whose body disappeared?\n49-Kyoko.png\n: It may very well be...that none of them disappeared.\n50-Toko12.png\n: B-But if that's true, then why doesn't the b-body count match...?\n23-Kyoko12.png\n: Including Monokuma's executions, there have apparently been ten deaths. But there were only nine bodies.\n51-Kyoko15.png\n: That's the point I'm trying to make.\n47-Hina12.png\n: I'm completely lost! How can the number of victims be less than the number of murders!?\nThe reason there are less bodies than murders... The explanation for more murders than victims... Why is that...? What would it take for that to make sense...?\n> The same person was killed twice\n46-Makoto25.png\n: What about if...the same person was\n**\nkilled twice\n?\n54-Hiro7.png\n: Huh? Killed twice...?\n46-Makoto25.png\n: Officially, ten murders have been committed so far.\n43-Makoto28.png\n: But one of the victims may have been murdered...and then murdered again.\n56-Toko6.png\n: Murdered and...m-murdered again...?\n57-Makoto30.png\n: If that's the case, there could have been ten killings but still only nine victims, right?\n58-Hina10.png\n: T-Technically you're right I guess, but still...something like that--\n31-Kyoko13.png\n: Could easily have happened. No, it *is* what happened.\n59-Byakuya3.png\n: Sounds like you're already convinced. Then can you tell us who was killed twice?\n61-ClassTrialChaos.png\n62-Kyoko14.png\n: Before she was killed as Mukuro Ikusaba, she was killed as someone else.\n63-Byakuya7.png\n: And that's why the body had to be stored in the bio lab until the moment we found it in the garden...\n17-Monokuma2.png\n: No no no, that's crazy talk! She was killed as someone else? Come on!\n65-Monokuma3.png\n: Besides, who could that \"someone else\" even have been!?\n66-Kyoko17.png\n: All you have to do is look at those bodily injuries of hers and that will become obvious.\n17-Monokuma2.png\n: Nothing's gonna become obvious...!\n67-Monokuma5.png\n: Because Kyoko's totally delusional!\n",
            "testimonies": [
                {
                    "testimony": "Who is this \"someone else\" that Mukuro was killed as? Was it... ***Sayaka Maizono*** ? ***Junko Enoshima*** ? ***Leon Kuwata*** ? ***Chihiro Fujisaki*** ? ***Mondo Owada*** ? ***Kiyotaka Ishimaru*** ? ***Hifumi Yamada*** ? ***Celestia*** Lu--whatever? Or maybe ***Sakura Ogami*** ? No no no...",
                    "person": "Monokuma",
                    "present": []
                },
                {
                    "testimony": "There's no way anyone was ***murdered twice*** !",
                    "person": "Monokuma",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "14-ClassTrialTHESUN.png\n43-Makoto28.png\n:\n**\nJunko\n... Wasn't her fatal injury\n**\npretty similar\nto Mukuro's?\n77-Hina11.png\n: What do you mean...?\n19-FlashT.png\n21-FlashB.png\n46-Makoto25.png\n: Well, remember what happened to her? She was impaled by a bunch of spears, all over her body.\n80-Byakuya9.png\n: And Mukuro died from a number of wounds across her body... When you compare that to the stab wounds Junko suffered...\n81-Toko7.png\n: Then the s-similarities...match...?\n82-Kyoko11.png\n: Yes, and those are the *only* fatal injuries that match up.\n31-Kyoko13.png\n: That explains why those \"two\" bodies are actually one and the same.\n24-Byakuya2.png\n: So let me see if I have this straight...\n19-FlashT.png\n21-FlashB.png\n24-Byakuya2.png\n: Junko, or someone going by that name, was stabbed to death with multiple spears.\n19-FlashT.png\n21-FlashB.png\n24-Byakuya2.png\n: Then her body was kept in the bio lab for however long, before being dragged out again.\n19-FlashT.png\n21-FlashB.png\n24-Byakuya2.png\n: Only this time, it was presented as the corpse of one Mukuro Ikusaba.\n43-Makoto28.png\n: It all matches up, right? Those wounds Junko suffered could easily be these same injuries.\n54-Hiro7.png\n: Then...it's really true? Mukuro and Junko are the same person...?\n87-Hiro12.png\n: Wait, so then...\n88-Hiro13.png\n: Nng! What does it all mean!?\n61-ClassTrialChaos.png\n90-Byakuya.png\n: It means that there haven't been ten victims, but nine. Which also means that among the people we thought were dead...one is still alive.\n91-Hina22.png\n: ...And that's the true identity of the mastermind!?\n92-Hiro15.png\n: Who is it!? Who's behind all this!?\n93-Toko13.png\n: We already kn-know the answer to that... It's Mukuro! Sh-She's still alive!\n19-FlashT.png\n21-FlashB.png\n93-Toko13.png\n: She took J-Junko's body...\n19-FlashT.png\n21-FlashB.png\n93-Toko13.png\n: ...and made it look like she was th-the one who died!\n93-Toko13.png\n: S-So Mukuro is still alive. She's g-gotta be!\n97-Monokuma8.png\n: ...\n98-Toko3.png\n: Total silence...? Then I m-must be right...! I'm right, aren't I?\nMukuro...alive? The one that's still alive is Mukuro...? But... Can we really believe that?\n",
            "testimonies": [
                {
                    "testimony": "The body we f-found in the garden...",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "It ***wasn't Mukuro*** !",
                    "person": "Toko",
                    "present": [
                        "Mukuro Ikusaba's Profile"
                    ]
                },
                {
                    "testimony": "Then she's still alive!?",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "Th-That's right. She made it look like Junko's b-body was her!",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "S-So the ***mastermind's true identity*** is...Mukuro!",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "Whaddya say, Monokuma!? Do you give up!?",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": ": ***Hmmmmmmm...*** Mukuro is still alive? Can I really believe that?",
                    "person": "Monokuma",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "Come on, bitches! Remember or die! What the fuck happened outside!?",
                    "person": "Junko",
                    "present": []
                },
                {
                    "testimony": "You want us to remember or whatever, but... When it comes to that ***crazy confusing video*** you showed us...",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "...I don't understand a damn thing!",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "What's the meaning of ***the footage we saw*** ...?",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "Is this another one of your practical jokes?",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "I mean, you're telling us to remember, but what am I supposed to be remembering!?",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "I-If ***nobody can remember anything*** ...",
                    "person": "Toko",
                    "present": [
                        "Genocide Jack's Memory"
                    ]
                },
                {
                    "testimony": "...this is the end f-for all of us! What other ch-choice do we have!? ***every one of us*** has lost our memory...! It really is hopeless, after all...",
                    "person": "Toko",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "We won't give up...!",
                    "person": "Makoto",
                    "present": []
                },
                {
                    "testimony": "As long as there's ***hope*** , we'll never give up!",
                    "person": "Makoto",
                    "present": []
                },
                {
                    "testimony": "If I were to die...that would be the end of Hope's Peak Academy.",
                    "person": "Junko",
                    "present": []
                },
                {
                    "testimony": ": ***... ... ...*** ",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "By the way, the air outside is totally polluted, ya know. The only reason we're okay in here...is thanks to the air purifiers in the physics lab.",
                    "person": "Junko",
                    "present": []
                },
                {
                    "testimony": ": ***... ... ...*** ",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "If I die, the purifiers will screech to a halt. In other words, as soon as I die...the communal life you've all been living will come to an end.",
                    "person": "Junko",
                    "present": []
                },
                {
                    "testimony": ": ***... ... ...*** ",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "All of you will have to leave. You'll have to go into the world outside, where only death and despair are waiting...",
                    "person": "Junko",
                    "present": []
                },
                {
                    "testimony": ": ***... ... ...*** ",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "So? What are you gonna do? Will you just die? Is that what you want?",
                    "person": "Junko",
                    "present": []
                },
                {
                    "testimony": "...",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "The world is in despair. *You* are in despair.",
                    "person": "Junko",
                    "present": []
                },
                {
                    "testimony": ": We're not here to refute any arguments this time. Throw out all your Truth Bullets. There's only one thing we can do here. We need to pull everyone from the clutches of despair!",
                    "person": "Narration",
                    "present": []
                }
            ]
        }
    ]
}