{
    "Chapter 1": [
        {
            "name": "Monokuma File #1",
            "description": "The victim was Sayaka Maizono. The time of death is estimated to be around 1:30 a.m. The body was discovered in Makoto's room, in the dormitory.The death took place in the bathroom. The cause of death was a stab wound to the abdomen, and her right wrist appears to have been fractured."
        },
        {
            "name": "Evidence of a Struggle",
            "description": "There are a number of scratches and gouges on the bed and walls in Makoto's room."
        },
        {
            "name": "Replica Sword",
            "description": "Makoto took this from the gym entryway and put it in his room. The sword was found out of its sheath on the floor in the middle of the room. The sword handle was missing some of the gold coating, as was part of the blade"
        },
        {
            "name": "Replica Sword Sheath",
            "description": "Makoto took this from the gym entryway and put it in his room. The sheath was found some distance from the sword itself, and it shows evidence of being scratched with a sharp object. If you were going to attack someone with the sword, you would almost certainly remove the sheath first."
        },
        {
            "name": "Switching Rooms",
            "description": "On the night of the murder, Makoto and Sayaka traded rooms and room keys. When the victim was discovered, Makoto's room key was also found in Makoto's room. Sayaka had originally asked Makoto to switch with her when someone attempted to force their way into her room, and she became frightened."
        },
        {
            "name": "Toolkit",
            "description": "This had been placed in Makoto's room before he arrived. It remains unopened, and there is no evidence of it having ever been used. All the other male students claim that they haven't used theirs, either. But still..."
        },
        {
            "name": "Makoto's Room's Cleanliness",
            "description": "Not a single hair was found on the floor at the scene of the crime. In addition, the lint roller shows evidence of being used."
        },
        {
            "name": "Sayaka's Wrist",
            "description": "Sayaka's right wrist had been fractured, and her wrist was \"glittery\" at the injury's location. In addition, her hands appeared to be completely clean, except for the index finger of her left hand, which had some blood on it."
        },
        {
            "name": "Dying Message",
            "description": "A series of numbers had been written in blood on Makoto's bathroom wall—11037. It is assumed that Sayaka wrote these numbers while leaned up against the wall, as she lay dying."
        },
        {
            "name": "Bathroom Doorframe",
            "description": "Makoto's bathroom door was difficult to open, due to it not quite fitting in the doorframe properly. The only two people who knew the trick to opening it were Makoto, the room's owner, and Sayaka, the victim."
        },
        {
            "name": "Bathroom Doorknob",
            "description": "Makoto's bathroom doorknob had been broken—the screws holding it in place had all been partially or completely removed."
        },
        {
            "name": "Dorm Nameplates",
            "description": "The nameplates on the doors to Sayaka and Makoto's rooms were apparently switched at some point."
        },
        {
            "name": "Kitchen Knife Set",
            "description": "The kitchen in the dining hall has a set of kitchen knives. Apparently one of the knives had gone missing."
        },
        {
            "name": "<a href=\"/wiki/Aoi_Asahina\" title=\"Aoi Asahina\">Aoi's</a> Account",
            "description": "The knife from the kitchen went missing while Aoi was in the dining hall. Aoi swears that Makoto did not come to the dining hall at any point while she was there."
        },
        {
            "name": "Cleaning Duty",
            "description": "There's apparently a trash room within the school. It's blocked off by a sturdy gate that can only be opened with the trash room key."
        },
        {
            "name": "Incinerator",
            "description": "The incinerator can be activated via a switch on the machine. Hifumi was on cleaning duty, and he claims that the last time he saw the incinerator, it was off. However, when Makoto checked it after the incident, the incinerator was, in fact, on. The distance from the gate to the incinerator is roughly thirty feet."
        },
        {
            "name": "Burnt Shirt Piece",
            "description": "A piece of burnt clothing was found next to the incinerator in the trash room.It is apparently part of a shirt cuff, and it has a noticeable bloodstain on it."
        },
        {
            "name": "Shattered Crystal Ball",
            "description": "Shards of glass were found next to the incinerator in the trash room. As it turns out, the glass ball would have fit comfortably in the palm of a person's hand."
        }
    ],
    "Chapter 2": [
        {
            "name": "Monokuma File #2",
            "description": "The victim was Chihiro Fujisaki. The time of death is estimated to be around 2:00 a.m. The body was discovered in the girls locker room, on the 2nd floor of the school. The cause of death was a blow to the head with a blunt object. She was killed instantly."
        },
        {
            "name": "Sakura's Account",
            "description": "Although Chihiro wanted to get stronger, she declined several invitations from Sakura and Aoi, and may have used the locker room late at night to avoid them. Despite this, Chihiro had stated that she desired help with her efforts. She may have been meeting someone in the locker room the night she was murdered."
        },
        {
            "name": "Locker Room Dumbbell",
            "description": "The dumbbell found on the floor of the girls locker room had a significant amount of blood on it."
        },
        {
            "name": "<a href=\"/wiki/Mondo_Owada\" title=\"Mondo Owada\">Mondo</a>'s Account",
            "description": "Chihiro had told anyone willing to listen that she wanted to get stronger. Some assume that due to her inferiority complex about being weak, she admired strength more than anything else."
        },
        {
            "name": "Card Reader",
            "description": "To unlock a locker room, you need to swipe your e-Handbook over the card reader. You need a male student's handbook for the boys locker room, and a female student's for the girls. It is not possible for two people to enter at the same time. Additionally, lending someone your handbook is a violation of school regulations."
        },
        {
            "name": "Main Hall e-Handbook",
            "description": "The handbook of each student that has died is placed in the mailbox in the main hall."
        },
        {
            "name": "Broken e-Handbook",
            "description": "One of the handbooks found in the main hall had been broken, which is apparently a rare occurrence. Junko and Sayaka's handbooks both seem to still work, so it is assumed that the broken handbook is Leon's. However, Monokuma claims it's very unlikely that Leon's handbook would have broken."
        },
        {
            "name": "Genocide Jack Case File",
            "description": "Suspected Genocide Jack victims include Ken Harada, Tetsuhiro Honda, and Shoji Gaku, among countless others. They were killed in the same way, and mounted to a nearby wall. The word \"bloodlust\" was found at the scene of each crime, written in blood. Profiling indicates the killer is likely a student suffering from a split personality."
        },
        {
            "name": "Aoi's Account",
            "description": "Chihiro seems to have consciously kept her distance from the other girls at the school, even from the beginning. Meanwhile, it had been noticed that she got along remarkably well with her male classmates."
        },
        {
            "name": "Boys Locker Room Carpet",
            "description": "The carpet in the boys locker room was found with a blackish stain on it."
        },
        {
            "name": "Two Locker Room Posters",
            "description": "Blood was found on the poster in the girls locker room. The poster featured a big-breasted supermodel popular among young boys. Meanwhile, the poster in the boys locker room was for a boy band popular with teenage girls."
        },
        {
            "name": "Chihiro's e-Handbook",
            "description": "Chihiro's handbook was not found on her corpse, and has apparently gone missing."
        },
        {
            "name": "Status of the Dead Body",
            "description": "Chihiro's body had been suspended, and her hands had been bound with some kind of rope. Her fatal injury was a blow to the head."
        },
        {
            "name": "Disappearing Stain",
            "description": "Sakura mentioned that she was responsible for a coffee stain on the girls locker room floor. However, the stain had since been inexplicably scrubbed away."
        },
        {
            "name": "Celeste's Account",
            "description": "On the night of the murder, right before \"nighttime,\" Chihiro was spotted leaving the warehouse. It seems she was stuffing some blue exercise clothes into a duffel bag. Presumably she was on her way to exercise, but the clothes were not found at the crime scene. Celeste had not told anyone other than Makoto about this encounter."
        }
    ],
    "Chapter 3": [
        {
            "name": "Monokuma File #3",
            "description": "The victims were Hifumi Yamada and Kiyotaka Ishimaru. The cause of death for each was a blow to the head. It is thought that they were both killed with a similar weapon."
        },
        {
            "name": "Blue Tarp",
            "description": "The tarp was found in the repository, under Kiyotaka's lifeless body. It was apparently used to move Kiyotaka in order to avoid leaving any bloodstains."
        },
        {
            "name": "Repository Dolly",
            "description": "The dolly was found when the body was rediscovered in the repository. This specific dolly has no handles, and blood was found on one of its wheels. It is assumed that this is the same dolly that was in the equipment room, where Kiyotaka's body was originally discovered."
        },
        {
            "name": "Hifumi's Glasses",
            "description": "When they were first found in the nurse's office, Hifumi's glasses were covered in blood. However, when they were next seen in the repository, they were completely clean."
        },
        {
            "name": "Spotless Hammer",
            "description": "Hammers of all shapes and sizes were found in the repository. One of them was found wet, and had apparently been recently washed."
        },
        {
            "name": "Repository Door",
            "description": "The door connecting the art room to the repository was designed to open only from the repository side. According to Aoi, it was locked during the search for the missing body. However, when the body was rediscovered, it had somehow been unlocked..."
        },
        {
            "name": "Equipment Room Bloodstain",
            "description": "A puddle of blood was found in the equipment room where Kiyotaka's body was initially found. A tire track had been left behind in the blood."
        },
        {
            "name": "Glasses Cleaning Cloth",
            "description": "The cloth was found in the trash can in the nurse's office. It is branded with a popular cartoon character, and was found with blood on it. One has to wonder if someone used it to wipe some blood away..."
        },
        {
            "name": "Celeste's Account",
            "description": "Hifumi's body disappeared when Celeste and Aoi left the nurse's office to use the bathroom. Apparently they weren't gone for more than a minute or two."
        },
        {
            "name": "Yasuhiro's Message",
            "description": "This is the note that Yasuhiro wrote to get everyone to meet in the dining hall. \"Meet in the dining hall!\" is all it says. The handwriting is remarkably neat and clear."
        },
        {
            "name": "Robo Justice Blueprints",
            "description": "These are the blueprints for Robo Justice, which were found in Yasuhiro's room."
        },
        {
            "name": "<a href=\"/wiki/Robo_Justice\" class=\"mw-redirect\" title=\"Robo Justice\">Robo Justice</a> Costume",
            "description": "No one but Yasuhiro could have possibly fit into the costume. In addition, anyone wearing it would not be able to see their feet, or bend at the waist more than 90 degrees."
        },
        {
            "name": "Yasuhiro's Account",
            "description": "Apparently, Yasuhiro received a mysterious note last night. The note reads... \"I found a hole maybe we can use to escape. Monokuma can't find out, so don't tell anyone else for now. Let's meet in the rec room at 1 a.m.\""
        },
        {
            "name": "Broken Wristwatch",
            "description": "Kiyotaka's wristwatch broke with the hands pointing just past 6 o'clock. It was confirmed that as of late last night, the watch still worked, which means it must have broken the following morning when he was attacked."
        },
        {
            "name": "Kiyotaka's Scrap of Paper",
            "description": "Kiyotaka's lifeless hand was found clutching a small scrap of paper."
        },
        {
            "name": "The Note Hifumi Had",
            "description": "Hifumi had this note hidden on him. One edge of it appears to be torn. The note reads: \"I found a hole maybe we can use to escape. Monokuma can't find out, so don't tell anyone else for now. Let's meet in the equipment room at 6 a.m.\""
        },
        {
            "name": "e-Handbook",
            "description": "Each student has their own e-Handbook, which also acts as a cardkey. The owner's name is displayed each time the handbook is booted up. It is believed that no handbooks were involved in carrying out the murders this time."
        }
    ],
    "Chapter 4": [
        {
            "name": "Monokuma File #4",
            "description": "The victim was Sakura Ogami. The time of death is estimated to be around 12 noon. The body was discovered in the rec room, on the 3rd floor of the school. There is evidence of a strong blow to the victim's head. No other injuries were noted; however, it seems that at some point, the victim suffered from violent vomiting of blood."
        },
        {
            "name": "Rec Room Door",
            "description": "A chair had been jammed against the door within the rec room, blocking access from the outside. It is believed that the killer did this to create a \"locked room\" scenario."
        },
        {
            "name": "Status of Sakura's Body",
            "description": "Sakura was found dead seated in a chair, slumping forward. Traces of blood were found around her mouth, presumably from when she vomited blood. However, there was no injury or indication as to why she would have vomited blood."
        },
        {
            "name": "Magazine Shelf Bloodstain",
            "description": "A bloodstain was found in front of the shelf of magazines. The blood is presumed to be Sakura's. There is currently no explanation for how a bloodstain would have appeared so far away from where the victim was found."
        },
        {
            "name": "Polka Dot Candy Wrapper",
            "description": "At one point Aoi had been injured and taken to the nurse's office. After she was taken care of, she gave a piece of candy to Sakura which had this type of wrapper. According to Aoi, she had \"monopolized\" this candy as soon as it had become available, so obtaining a piece would have been difficult to impossible."
        },
        {
            "name": "Glass Shards on the Floor",
            "description": "There were pieces of red glass scattered near the table in the rec room. After finding the top and bottom pieces, it was concluded that the shards must have come from a bottle."
        },
        {
            "name": "Figure on the Floor",
            "description": "A Monokuma figure was found laying on the rec room floor. It would fit roughly in the palm of your hand."
        },
        {
            "name": "Monokuma Bottles",
            "description": "There are a number of red bottles on a shelf in the rec room. Inside each bottle is a Monokuma figure."
        },
        {
            "name": "Empty Protein Drink",
            "description": "An empty protein drink was found near the rec room door. The container had a label reading CHEM A-2. The shards of glass from the window that was broken to get into the room were found both around and underneath the container."
        },
        {
            "name": "Locker Handprint",
            "description": "A fresh handprint was found inside the rec room's open locker. Since the locker was open before they opened the \"locked room,\" there's no way someone was hiding in there before they arrived."
        },
        {
            "name": "Aoi's Account",
            "description": "Sakura had written notes to Toko, Byakuya, and Yasuhiro asking them to meet her in the rec room by noon. She had slid these notes underneath each person's room door."
        },
        {
            "name": "Byakuya's Account",
            "description": "Byakuya confirmed that he received Sakura's note, but also claimed that he never went to see her, and in fact had not seen her at all that day."
        },
        {
            "name": "Toko's Account",
            "description": "Toko confirmed that she received Sakura's note, but also claimed that she never went to see her."
        },
        {
            "name": "Pocket Trash",
            "description": "A small bit of garbage accidentally fell out of Yasuhiro's pocket. It was a piece of paper with red polka dots on it."
        },
        {
            "name": "Yellow Powder",
            "description": "Yellow powder was found on the instep of Sakura's foot."
        },
        {
            "name": "Kyoko Examination Summary",
            "description": "Sakura suffered two blows to the head, not one. No blood was found on either of her hands."
        },
        {
            "name": "Monokuma Bottle Experiment",
            "description": "All of the Monokuma Bottles appear to be roughly the same weight. However, when the bottle shards were weighed against an intact bottle, the shards were found to be heavier."
        },
        {
            "name": "Magazine Dying Message",
            "description": "On the magazine shelf, one magazine had been put back upside down. Inside this magazine, Toko's name had been written in blood. It is assumed that whoever wrote it used their finger to do so."
        },
        {
            "name": "Chem Lab Shelf",
            "description": "On the shelf in the chem lab, section A contains supplements, section B contains reagents, and section C contains harmful chemicals. A bottle of poison labeled as section C had been placed in section A of the shelf."
        },
        {
            "name": "Source of the Powder",
            "description": "There was a broken bottle in front of the chem lab shelf, which was labeled CHEM C-4. The powder on the floor is assumed to have come from this. According to Byakuya, the powder would had to have been spilled after the incident took place."
        },
        {
            "name": "Footprints in the Powder",
            "description": "Someone had left footprints in the powder spilled in the chem lab. These footprints appeared only near the leftmost section of the shelf. From this it can be assumed that the suspect only had business in this area."
        }
    ],
    "Chapter 5": [
        {
            "name": "Monokuma File #5",
            "description": "Due to the the explosion, the victim's identity is unknown. They were, however, dead before the blast. The victim had been stabbed a single time with a knife, which went completely through the body. They had also been struck in the head with an object about as thick as a metal pipe. The body was covered with other wounds, but these were at least several days old."
        },
        {
            "name": "Exploded Body Analysis",
            "description": "The explosion has burnt the upper half of the body beyond recognition. The upper half of the body remained on fire and had to be extinguished. Because of this, the upper half was soaking wet, while the bottom half remained dry."
        },
        {
            "name": "Fake Nails",
            "description": "The body was wearing notably long fake nails."
        },
        {
            "name": "Tattoo on the Right Hand",
            "description": "The body had a tattoo of a dog on the back of the right hand."
        },
        {
            "name": "Fragments Near the Dead Body",
            "description": "There were bits of charred debris near the body. It seems familiar to something that was seen earlier..."
        },
        {
            "name": "Sprinklers",
            "description": "The sprinklers are programmed to come on every morning at 7:30, and this time is impossible to change. As such, it can be assumed that if the body had been in the garden before 7:30, it would have gotten wet."
        },
        {
            "name": "When the Body Was Found",
            "description": "7 a.m.: Makoto wakes to the morning announcement. 7:30 a.m.: Makoto and Aoi arrive in the dining hall. 7:30-9 a.m.: Makoto meets the others in the gym, and together they head to the headmaster's room. 9 a.m.: Toko is told to find the pickaxe in the garden, where she discovers the body."
        },
        {
            "name": "Knife at the Crime Scene",
            "description": "The knife found near the body was the same knife that was used to stab it before the explosion. It is also the same knife that Toko had given to Makoto for safe keeping, and the knife the masked assailant was holding when they attacked Makoto."
        },
        {
            "name": "Tarp",
            "description": "The tarp was hidden among the other items in the toolshed. One side was wet and filthy with mud and grime. The other side was completely clean and dry."
        },
        {
            "name": "Chicken Coop Chickens",
            "description": "The number of chickens in the chicken coop had decreased from five to four. Yasuhiro claims that there were without a doubt five chickens just before nighttime last night, and yet..."
        },
        {
            "name": "Byakuya's Account",
            "description": "Byakuya stated that there was no corpse in the garden just after nighttime last night, so it can be assumed the murder must have taken place sometime after that. Byakuya also said that he, Yasuhiro, Toko, and Aoi were in the gym the entire night, and none of them were alone at any point."
        },
        {
            "name": "Body Before the Explosion",
            "description": "The corpse had a mask covering its head, and a white jacket covering the body. A knife had been thrust into the abdomen, and there were bloodstains around the wound. The body had stopped bleeding, but the blood was still wet. It was noted, however, that there was no blood on the ground around the body."
        },
        {
            "name": "Monokuma's Account",
            "description": "Apparently, the killing game began with sixteen participants—all students. It is assumed that Mukuro Ikusaba was the sixteenth student. Monokuma also revealed that the reason Kyoko wears gloves is to hide something she doesn't want anyone to see."
        },
        {
            "name": "Woodblock Key",
            "description": "This woodblock decoration was found in Kyoko's room. It looks like it's actually the key to one of the lockers in the dojo."
        },
        {
            "name": "Titanium Arrows",
            "description": "A set of titanium arrows was found in a dojo locker. There appear to be ten in total."
        },
        {
            "name": "Bloody Duct Tape",
            "description": "Along with the arrows, there was also a wadded up ball of duct tape in the locker. The duct tape had traces of blood on it. It's assumed that this is related to the case, but nobody can imagine how..."
        },
        {
            "name": "Kyoko's Account",
            "description": "Kyoko used Monokuma's \"secret tool,\" which grants access to any room in the school, to sneak into the 2nd floor of the dorms. This area seems to have no monitors or security cameras."
        },
        {
            "name": "Disguised Dead Body",
            "description": "The murder took place before the sprinklers turned on. The suspect covered the body with a tarp to prevent it from getting wet. Later, when they removed the tarp, the suspect placed the white jacket on the body. This jacket had previously been treated with blood to make it look like the corpse had been wearing it."
        }
    ],
    "Chapter 6": [
        {
            "name": "Places to Check",
            "description": "Several rooms had been locked up until this point: The headmaster's room on the 4th floor, the bio lab on the 5th floor, the Monokuma door in the data center on the 4th floor, and the 2nd floor of the dormitory area. In addition, the areas directly connected to Mukuro Ikusaba's death are the garden and dojo."
        },
        {
            "name": "Monokuma Control Room",
            "description": "The Monokuma room in the data center opened to reveal a small room used to command Monokuma. This is where the mastermind had been issuing commands to the ursine robot."
        },
        {
            "name": "Tarp",
            "description": "The tarp found in the garden had played a part in Mukuro's murder. \"Bio lab\" had been stamped onto one corner of the tarp."
        },
        {
            "name": "Mukuro Ikusaba's Profile",
            "description": "According to the headmaster's report, Mukuro did not have a single scar or wound when she came to Hope's Peak Academy. In addition, her physical features were as follows: Height: 5 foot 7 inches. Weight: 97 pounds. Vitals: 31-22-32."
        },
        {
            "name": "The Ultimate Despair",
            "description": "The phrase \"the Ultimate Despair\" doesn't refer to a single individual, but a like-minded group of people. One year ago, that group brought about the single worst event in human history. They are motivated only by despair, making them some of the most despicable people to ever live."
        },
        {
            "name": "Hidden Room Present",
            "description": "There was a brightly colored box sitting in the headmaster's hidden room. Inside the box were human bones—the last remains of the headmaster."
        },
        {
            "name": "Photo of Kyoko and Headmaster",
            "description": "In his hidden room, the headmaster kept a photo of him and a young Kyoko together. In the photo, they are both smiling."
        },
        {
            "name": "Headmaster's e-Handbook",
            "description": "An emergency handbook was found in the headmaster's hidden room. This handbook apparently has no restrictions, and was given to the school's ultimate authority—the headmaster."
        },
        {
            "name": "Locker Notebook",
            "description": "The notebook was found in a locker on the 2nd floor of the dorms. Yasuhiro's name was written on the inside, and it has notes for a number of different classes."
        },
        {
            "name": "Locker Pocketbook",
            "description": "The pocketbook was found in a locker on the 2nd floor of the dorms, and based on what was written inside, it's believed to be Kyoko's. There's some kind of message scrawled on the last page of the pocketbook: \"Despair walks among us. And so, we survive... There's a second 'despair'...\""
        },
        {
            "name": "Bio Lab Secret",
            "description": "The bio lab on the 5th floor seems to have been repurposed as a morgue."
        },
        {
            "name": "Bio Lab Lights",
            "description": "A corpse fridge has been installed in the bio lab. It seems that a blue light comes"
        },
        {
            "name": "Group Photo",
            "description": "The photo depicts all the Hope's Peak students wearing matching uniforms. Worth"
        },
        {
            "name": "Genocide Jack's Memory",
            "description": "It would seem that while Toko and Genocide Jack share certain fundamental knowledge, their individual memories are separate."
        },
        {
            "name": "Kyoko's Account",
            "description": "Kyoko attests that both the stab wound and the blow to the head were inflicted after death."
        },
        {
            "name": "Interview DVD",
            "description": "Kyoko found this DVD in the headmaster's hidden room, and handed over to Makoto for him to watch."
        },
        {
            "name": "Mukuro's Fatal Injury",
            "description": "Mukuro's fatal injury would appear to be the collection of wounds covering her body."
        },
        {
            "name": "The <a href=\"/wiki/Ultimate_Hope\" title=\"Ultimate Hope\">Ultimate Hope</a>",
            "description": "It would appear that Makoto may have hidden within him the power to stand against the Ultimate Despair."
        }
    ],
    "Navigation": []
}