{
    "court_record": {
        "evidence_objects": [
            {
                "name": "Monokuma File #4",
                "description": "The victim was Sakura Ogami. The time of death is estimated to be around 12 noon. The body was discovered in the rec room, on the 3rd floor of the school. There is evidence of a strong blow to the victim's head. No other injuries were noted; however, it seems that at some point, the victim suffered from violent vomiting of blood."
            },
            {
                "name": "Rec Room Door",
                "description": "A chair had been jammed against the door within the rec room, blocking access from the outside. It is believed that the killer did this to create a \"locked room\" scenario."
            },
            {
                "name": "Status of Sakura's Body",
                "description": "Sakura was found dead seated in a chair, slumping forward. Traces of blood were found around her mouth, presumably from when she vomited blood. However, there was no injury or indication as to why she would have vomited blood."
            },
            {
                "name": "Magazine Shelf Bloodstain",
                "description": "A bloodstain was found in front of the shelf of magazines. The blood is presumed to be Sakura's. There is currently no explanation for how a bloodstain would have appeared so far away from where the victim was found."
            },
            {
                "name": "Polka Dot Candy Wrapper",
                "description": "At one point Aoi had been injured and taken to the nurse's office. After she was taken care of, she gave a piece of candy to Sakura which had this type of wrapper. According to Aoi, she had \"monopolized\" this candy as soon as it had become available, so obtaining a piece would have been difficult to impossible."
            },
            {
                "name": "Glass Shards on the Floor",
                "description": "There were pieces of red glass scattered near the table in the rec room. After finding the top and bottom pieces, it was concluded that the shards must have come from a bottle."
            },
            {
                "name": "Figure on the Floor",
                "description": "A Monokuma figure was found laying on the rec room floor. It would fit roughly in the palm of your hand."
            },
            {
                "name": "Monokuma Bottles",
                "description": "There are a number of red bottles on a shelf in the rec room. Inside each bottle is a Monokuma figure."
            },
            {
                "name": "Empty Protein Drink",
                "description": "An empty protein drink was found near the rec room door. The container had a label reading CHEM A-2. The shards of glass from the window that was broken to get into the room were found both around and underneath the container."
            },
            {
                "name": "Locker Handprint",
                "description": "A fresh handprint was found inside the rec room's open locker. Since the locker was open before they opened the \"locked room,\" there's no way someone was hiding in there before they arrived."
            },
            {
                "name": "Aoi's Account",
                "description": "Sakura had written notes to Toko, Byakuya, and Yasuhiro asking them to meet her in the rec room by noon. She had slid these notes underneath each person's room door."
            },
            {
                "name": "Byakuya's Account",
                "description": "Byakuya confirmed that he received Sakura's note, but also claimed that he never went to see her, and in fact had not seen her at all that day."
            },
            {
                "name": "Toko's Account",
                "description": "Toko confirmed that she received Sakura's note, but also claimed that she never went to see her."
            },
            {
                "name": "Pocket Trash",
                "description": "A small bit of garbage accidentally fell out of Yasuhiro's pocket. It was a piece of paper with red polka dots on it."
            },
            {
                "name": "Yellow Powder",
                "description": "Yellow powder was found on the instep of Sakura's foot."
            },
            {
                "name": "Kyoko Examination Summary",
                "description": "Sakura suffered two blows to the head, not one. No blood was found on either of her hands."
            },
            {
                "name": "Monokuma Bottle Experiment",
                "description": "All of the Monokuma Bottles appear to be roughly the same weight. However, when the bottle shards were weighed against an intact bottle, the shards were found to be heavier."
            },
            {
                "name": "Magazine Dying Message",
                "description": "On the magazine shelf, one magazine had been put back upside down. Inside this magazine, Toko's name had been written in blood. It is assumed that whoever wrote it used their finger to do so."
            },
            {
                "name": "Chem Lab Shelf",
                "description": "On the shelf in the chem lab, section A contains supplements, section B contains reagents, and section C contains harmful chemicals. A bottle of poison labeled as section C had been placed in section A of the shelf."
            },
            {
                "name": "Source of the Powder",
                "description": "There was a broken bottle in front of the chem lab shelf, which was labeled CHEM C-4. The powder on the floor is assumed to have come from this. According to Byakuya, the powder would had to have been spilled after the incident took place."
            },
            {
                "name": "Footprints in the Powder",
                "description": "Someone had left footprints in the powder spilled in the chem lab. These footprints appeared only near the leftmost section of the shelf. From this it can be assumed that the suspect only had business in this area."
            }
        ]
    },
    "events": [
        {
            "category": "cross_examination",
            "newContext": "3-ClassTrialDawn.png\n4-Monokuma.png\n: Let's begin with a basic explanation of the class trial! So, your votes will determine the results. If you can figure out \"whodunnit\" then only they will receive punishment. But if you pick the wrong one... Then I'll punish everyone *besides* the blackened, and the one that deceived everyone else will graduate!\n5-Monokuma11.png\n: Now then...where to begin...?\n♪\n**\nMusic cuts out.\n♪\n7-Hina16.png\n: We already know who did it...!\n8-Monokuma4.png\n: Whoa! Deja vu!\n7-Hina16.png\n: The one who killed Sakura...\n10-ToSurvive.png\n11-Hina15.png\n: ...is one of the people that hated her! Byakuya, Toko or Hiro! It was one of you!\n12-Byakuya3.png\n: Hmph. Idiot.\n13-Toko5.png\n: I-I had nothing to d-do with it...\n14-Hiro5.png\n: Y-Yeah! I'd never kill someone, no way!\n7-Hina16.png\n: I don't wanna hear your stupid excuses!\nHina seems really sure that one of those three is the killer... But she must have some reason for believing that...\n",
            "testimonies": [
                {
                    "testimony": "It was one of you...",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "One of you killed Sakura!",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "And what reason do you have for saying so?",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "Because you all had a motive!",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "You ***hated her*** !",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "Is that it? That doesn't make any sense...",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "That's ***the only reason you have*** for accusing us?",
                    "person": "Hiro",
                    "present": [
                        "Aoi's Account"
                    ]
                },
                {
                    "testimony": "That's l-low... That's about as low a-as you can g-get!",
                    "person": "Toko",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "26-Makoto25.png\n: Another reason you suspect them is because\n**\nSakura wanted to meet with them\n, right?\n7-Hina16.png\n: Yeah! And that was\n**\nright before she died\n!\n11-Hina15.png\n: So there's no doubt about it! One of those three killed her!\nI can't disagree with Hina. There's good reason to suspect all three of them... Then does that mean...one of them did it?\n",
            "testimonies": [
                {
                    "testimony": "The fact that Sakura wanted to meet with all three of them... There's no way that's not suspicious!",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "One of you is absolutely guilty!",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "I don't deny that she wanted to meet with us, but... I ***never went*** to see her.",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": ": ***I-I didn't either*** ...",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "Yeah, same here! ***I never saw her*** ...!",
                    "person": "Hiro",
                    "present": [
                        "Pocket Trash"
                    ]
                },
                {
                    "testimony": "Come on! There's no way *none* of you went!",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "At least one of you is lying!",
                    "person": "Hina",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "35-ClassTrialTHESUN.png\n36-Makoto2.png\n: Hiro...when we were talking before, you dropped a\n**\nsmall piece of paper\n, remember? It was\n**\nwhite with red polka dots\n...\n37-Hiro8.png\n: Wh-What's that got to do with anything!?\n38-Hina11.png\n: Red polka dots...?\n7-Hina16.png\n: That's gotta be the\n**\nwrapper from the candy\nI gave Sakura!\n14-Hiro5.png\n: N-No, it's...it's, um...\n7-Hina16.png\n: Ever since we got into the warehouse, I totally monopolized that entire box of candy.\n11-Hina15.png\n: So there's no way a single one of them was left in the warehouse!\n40-Makoto28.png\n: In that case, Hiro...where *did* you get that piece of candy?\n11-Hina15.png\n: From Sakura! It's the only explanation!\n14-Hiro5.png\n: U-Umm... W-Well, I mean...yeah, sure I got it from her, but...\n42-Hiro16.png\n: But she gave it to me forever ago! It doesn't have anything to do with what happened to her!\n7-Hina16.png\n: When? When did she give it to you?\n36-Makoto2.png\n: The last time you saw Sakura was...when Hina had to go to the nurse's office, right?\n14-Hiro5.png\n: Y-Yeah, so I musta got it...some time before then.\nBut...what Hiro said can't be right. Because Sakura could only have gotten the candy *after* the incident in the nurse's office. And the reason I know that is...\n> When Sakura got that candy\n40-Makoto28.png\n: I'm not sure about that, Hiro... Hina didn't actually give Sakura the candy till\n**\nafter she left the nurse's office\n.\n45-Makoto29.png\n: So if that was the last time you saw her, there's no reason you should've had that candy!\n37-Hiro8.png\n: Dammit!\n♪\n**\nMusic fades out.\n♪\n46-Hiro6.png\n: Er, I mean...what I meant was, uh... ...\n48-BoysLifeofDespair.png\n42-Hiro16.png\n: Oh, that's right! I DID meet up with her in the rec room! You got a problem with that!?\n49-Toko7.png\n: Why the s-sudden hostility...?\n50-Hiro11.png\n: But we just talked, that's all! I didn't do anything! You gotta believe me!\n52-Toko12.png\n: Y-You're acting incredibly s-suspicious...\n42-Hiro16.png\n: YOU'RE acting incredibly suspicious!\n52-Toko12.png\n: More h-hostility...\n54-Hiro15.png\n: It's not just normal hostility! You're the real culprit! I even have proof!\n13-Toko5.png\n: Huh? P-Proof! What are you t-talking about?\n54-Hiro15.png\n: I'm talking about her\n**\nshining message\n!\nWhat would a shining message even be...?\n56-Hiro12.png\n: At the scene of the crime, she had written out \"\n**\nToko\n\" in\n**\nher own blood\n, right?\n57-Hiro2.png\n: It was her \"\n**\ndying message\n\"! Just like what you guys were talking about with Sayaka!\n58-Hina21.png\n: That's true! I saw it for myself!\n57-Hiro2.png\n: See? See!? Toko did it!\n13-Toko5.png\n: Wh-Wh-What are you saying!? No w-way! I didn't d-do it!\n42-Hiro16.png\n: You just don't know when you're beat, do ya!?\n60-Kyoko17.png\n: Hiro, hold on...\n61-Kyoko13.png\n: When did you see that dying message of hers?\n62-Hiro7.png\n: Huh...?\n14-Hiro5.png\n: W-Well, when we found Ogre's body. Duh...\n60-Kyoko17.png\n: But if you recall, Hina was very adamant about keeping you away from the scene of the crime. So it's hard to believe that's when you actually saw the message for yourself.\nHuh? Hold on... But when Kyoko found the magazine with the dying message in it, it was...\n> On the magazine shelf\n26-Makoto25.png\n: Kyoko, you found the magazine on the\n**\nmagazine shelf\n, right?\n66-Kyoko12.png\n: That's right. Looking through the shelf, I found the magazine with the dying message on it. I found it right there at the scene of the crime,\n**\nafter we'd started the investigation\n.\n26-Makoto25.png\n: If that's true, then what Hiro just said doesn't really make sense, does it?\n14-Hiro5.png\n: D-Doesn't make sense...?\n42-Hiro16.png\n: What doesn't make sense!? Everything I said makes perfect sense!\nNo, there's an obvious problem with what Hiro said before...!\n",
            "testimonies": [
                {
                    "testimony": "I can tell you exactly when I found the dying message: When ***Ogre's body was discovered*** !",
                    "person": "Hiro",
                    "present": [
                        "magazine shelf"
                    ]
                },
                {
                    "testimony": "And I can tell you when *I* found the dying message...",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "It was only after ***the investigation had begun*** . I found the magazine tucked away on the ***magazine shelf*** ...",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "When I pulled it out, I saw her final words...",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "What's your problem?",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "What I said makes total sense!",
                    "person": "Hiro",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "2-BTB.png\n4-Narration.png\n: So there are no new mechanics for this BTB. I don't really have anything to add other than I'm somehow getting better at doing these without proper audio sync.\n4-Narration.png\n: The key to finishing these fast is really just to lock on to multiple phrases before firing because you do extra damage by shooting more than one at a time.\n4-Narration.png\n: Hiro uses Negative Time here but like before you just need to counter with your own Focus Gauge. Not too bad overall.\n> Fire \"Kyoko's Examination Summary\"\n12-ClassTrialTHESUN.png\n13-Makoto28.png\n: I'm completely unconvinced that\n**\nSakura wrote that dying message\n. Because if you look at it, the message was almost certainly written using a\n**\nfinger\n, but...\n14-Makoto29.png\n: ...both of her hands were\n**\ncompletely free of blood\n.\n15-Hiro9.png\n: Say wh--!?\n16-Hina16.png\n: Then...who did write it...?\n17-Kyoko12.png\n: Hiro could very well have written it himself.\n18-Kyoko15.png\n: That would explain how he knew about the message in the first place.\n19-Hiro6.png\n: N-Ngh...grr...!\n21-ClassTrialDawn.png\n22-Hiro13.png\n: Yeah... Yeah, that's exactly what happened.\n23-Hina12.png\n: Ah! He admits it!\n24-Kyoko2.png\n: I figured as much.\n25-Makoto20.png\n: But...why would you write something like that?\n22-Hiro13.png\n: B-Because...\n27-DespairSyndrome2.png\n19-Hiro6.png\n: Because\n**\nI killed her\n!\nYou're...admitting to killing her?\n22-Hiro13.png\n: Please, just let me explain what happened... I got Ogre's note, and so I headed to the rec room right before noon, just like it said...\n28-Byakuya15.png\n: You just did exactly as the note asked? What a fool...\n22-Hiro13.png\n: And when I got there...\n29-Flashback.png\n31-Sakura4.png\n: Sorry, but do you mind waiting? I asked a couple of other people to meet, as well.\n32-Hiro5.png\n: O-Okay...\n33-Sakura3.png\n: Would you like a piece of candy? It might help give you some energy.\n32-Hiro5.png\n: O-Oh, sure... Thanks.\n22-Hiro13.png\n:\nAnd that's all she said. After that, we just stood around in awkward silence... Suddenly, I heard her mutter something...\n31-Sakura4.png\n: This is it... I'm going to end it today... I'm going to end...everything.\n22-Hiro13.png\n:\nAs soon as I heard that, I just knew... I knew she was gonna try and kill me! She was gonna kill me and make her escape! So of course I freaked out, and then...\n*SMASH!*\n22-Hiro13.png\n: I saw my only chance. I grabbed a Monokuma Bottle from the shelf, and smashed it across her head! I...I hit her from behind,\n**\nbefore she had any idea\nwhat was happening!\n29-Flashback.png\n22-Hiro13.png\n: Then she just...went limp. I didn't see her move again after that. Once it was over, I pulled myself together. I realized if I didn't do something, I'd be caught and executed. So I wrote\n**\nToko's name\nin blood across a magazine on the table, and...I ran away.\n37-Toko13.png\n: I-I can't believe you! You're the worst! I hope you d-die!\n22-Hiro13.png\n: Well, that's what happened. Go ahead, roast me, boil me, do whatever you want...\n39-BoysLifeofDespair.png\n16-Hina16.png\n: You're not gonna get off that easy. It's death...death for the one that killed Sakura!\n40-Hina15.png\n: We're ready to vote now, right!? We know who did it!\n42-Kyoko11.png\n: No, I think there's more to Hiro's story...\n43-Hina9.png\n: What are you talking about? What else could there be!?\n42-Kyoko11.png\n: There's one thing that Hiro's story just now doesn't explain. And until we figure that part out, we can't consider the case closed.\nSo what is it that Hiro did that doesn't make sense...?\n> Why the magazine was hidden\n46-Makoto25.png\n: That's true. Everything you just said...it doesn't explain why\n**\nthe magazine was hidden\n, does it?\n47-Hiro7.png\n: Huh...?\n48-Makoto2.png\n: By the time the body was discovered, the magazine had been picked up and put on the shelf... Why would you take the time to write that message, then stick it somewhere we might not find it?\n32-Hiro5.png\n: Oh. Well, uh... I didn't hide it. I'm sure I just left it sitting there on the table.\n50-Makoto33.png\n: ...Really?\n37-Toko13.png\n: H-He's lying! He's g-gotta be lying!\n52-Kyoko17.png\n: I don't see any reason he would lie now, after already confessing to the crime...\n16-Hina16.png\n: Then...he's *not* lying?\n53-Byakuya.png\n: Assuming he's telling the truth, someone else must have put the magazine back on the shelf.\n55-Byakuya2.png\n: In other words, at least one other person was in the rec room both before and after the incident.\n56-Kyoko.png\n: I don't think there's any question about that.\n57-Hina22.png\n: Th-Then...who was it?\n52-Kyoko17.png\n: If they went to the trouble of hiding the magazine, they\n**\nmust not have liked\nwhat was written on it.\nSomeone who wouldn't like what had been written. There's only one choice...\n> Toko\n48-Makoto2.png\n: It had to be\n**\nToko\n, right?\n60-ClassTrialChaos.png\n61-Toko5.png\n: Wh--?\n25-Makoto20.png\n: Who else would want to hide the magazine other than the person whose name was written on it?\n16-Hina16.png\n: Is he right, Toko? Did you really go to the rec room...?\n61-Toko5.png\n: Wh-Why would I have...? Wait, b-but more important...!\n63-Toko12.png\n: That doesn't even m-matter! We already know who d-did it, right!? Hiro just a-admitted it!\n22-Hiro13.png\n: That's right. I killed her.\n25-Makoto20.png\n: No, you didn't.\n63-Toko12.png\n: Wh-Who asked you!?\n46-Makoto25.png\n: I don't doubt Hiro attacked Sakura with the bottle. But that's not where this case ends.\n43-Hina9.png\n: What do you mean...?\n52-Kyoko17.png\n: What he means is that Hiro isn't the killer.\n37-Toko13.png\n: You can't be s-serious! That's just... I don't b-believe it!\n66-Kyoko13.png\n: Hiro, tell us what happened one more time. If we go through it once more, it should become clear he's not Sakura's killer.\n32-Hiro5.png\n: Um, so...what do you want me to do?\n56-Kyoko.png\n: Just tell us what happened one more time, when you\n**\nattacked Sakura\n.\n67-Hiro4.png\n: I don't really see why, but...okay!\nWe haven't reached the end of the case just yet. Hiro isn't the real killer... And I have to prove that!\n",
            "testimonies": [
                {
                    "testimony": "I didn't want to, but...I did it. I grabbed a Monokuma Bottle from the shelf nearby and ***I hit Ogre from behind*** before she could do anything!",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "You hit her from behind... And you only hit her once, is that right?",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "Yeah, ***just once*** ... After the first swing, the bottle shattered.",
                    "person": "Hiro",
                    "present": [
                        "Kyoko's Examination Summary"
                    ]
                },
                {
                    "testimony": "And...she went limp.",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "S-See? Isn't it obvious?",
                    "person": "Toko",
                    "present": []
                },
                {
                    "testimony": "Hiro really is the k-killer!",
                    "person": "Toko",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "I was just sleeping peacefully...",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "And all of a sudden, Sakura was right there in front of me! I remember waking up right in front of the magazine shelf!",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "And you were taken by surprise when you saw ***Ogre covered in blood*** ...",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "So you smashed her head in with the Monokuma Bottle?",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "You got it! I smashed her good!",
                    "person": "Jill",
                    "present": []
                },
                {
                    "testimony": "And where did the attack take place?",
                    "person": "Byakuya",
                    "present": []
                },
                {
                    "testimony": "Right where I woke up! I killed her there ***in front of the shelf*** !",
                    "person": "Jill",
                    "present": [
                        "Status of Sakura's Body"
                    ]
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "16-ClassTrialTHESUN.png\n17-Makoto29.png\n: We found Sakura sitting upright in a chair... If the blow\n**\nby the shelf\nwas the cause of death, there's no explanation why she was in that chair...\n18-Byakuya3.png\n: So, you finally noticed.\n19-Hina15.png\n: That's just another lie from a bloodthirsty serial killer!\n7-Hiro15.png\n: Are you sure you didn't attack her while she was sitting in the chair?\n20-Byakuya9.png\n: No, I'm sure she's telling the truth. Anyone who saw the murder scene should think the same way.\nThat has to be it... The evidence that proves there was an attack in front of the magazine shelf...\n> Present Magazine Shelf Bloodstain\n23-Makoto25.png\n: Sakura was definitely attacked in front of the shelf. The\n**\nbloodstain\nby the magazines is proof of that.\n24-Hiro4.png\n: Then she must have moved the body after she killed her, right?\n7-Hiro15.png\n: All to make it look like I did it! Cuz when I hit her, she *was* sitting in the chair!\n26-Jill7.png\n: Hey, come on now. Look at me. I can't carry anything heavier than my own scissors!\n27-Jill8.png\n: There's no way I could move a muscle-bound heavyweight like that!\n28-Hiro5.png\n: Then...then what's the deal?\n18-Byakuya3.png\n: Well? Are you still convinced the case has come to an end?\n30-Hina16.png\n: B-But...!\n31-Kyoko11.png\n: Plus, the biggest mystery of all--the locked room--still has yet to be explained. Until we take care of that, we can't say this case has been properly settled.\n30-Hina16.png\n: Oh, that part's easy! After she killed Sakura, Toko just hid in the locker again!\n33-Hiro2.png\n: Huh! So she just hid in there till everyone showed up and opened the door? And while everything was all confused and hectic, she just snuck out of the locker into the group!\n34-Makoto2.png\n: No, I don't think that's possible.\nThe reason there's no way Toko was hiding in the locker is because...\n> I saw it for myself\n36-FlashT.png\n38-FlashB.png\n34-Makoto2.png\n: Even before we opened the door to the rec room, Hina and I both got a look inside. And at that point,\n**\nthe locker was already open\n. So obviously Toko couldn't have been hiding in there.\n24-Hiro4.png\n: Hrmm... Okay then, where *was* she hiding?\n4-Jill9.png\n: I dunno! What's this whole \"locked room\" thing about, anyway?\n40-Hiro16.png\n: How do you not know!? You killed her!\n41-Jill12.png\n: I think the fact that I don't know proves I DIDN'T kill her, thank you very much!\n19-Hina15.png\n: Y-You're lying!\n18-Byakuya3.png\n: No, she's not. I've been saying all along, there's still more to this case.\n28-Hiro5.png\n: But if Genocide Jill didn't do it, that means Ogre didn't die from the shot to the head...\n43-Byakuya7.png\n: And?\n44-Hina2.png\n: W-Well, I can't imagine what else could have killed her...\n18-Byakuya3.png\n: That's because you're overlooking vital information.\nCould we really be missing something so important...? If there's another possible explanation, maybe it's...\n",
            "testimonies": [
                {
                    "testimony": "What was it that killed Ogre? If it wasn't from ***Genocide Jill's attack*** ...",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "...then what was it?",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "There's no other possible cause. What killed Sakura...",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "I can't think of anything other than ***the shot to her head*** !",
                    "person": "Hina",
                    "present": [
                        "Monokuma File #4"
                    ]
                },
                {
                    "testimony": "So you're dead set on blaming me, huh!?",
                    "person": "Jill",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "",
            "testimonies": [
                {
                    "testimony": "First I went to section C... That's when ***I grabbed the poison*** .",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "And you spilled some of the powder on the ground in front of the shelf.",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "Yeah. When I grabbed the bottle, I dropped it...",
                    "person": "Hina",
                    "present": []
                },
                {
                    "testimony": "Okay, and then...?",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "I moved ***from section C to section A*** ... And that's where I switched the powders. Once I was done switching them I put the bottle filled with the protein ***powder back in section A*** . Then I took the bottle with the poison in it and left the chem lab. That's all there is to it.",
                    "person": "Hina",
                    "present": [
                        "Footprints in the Powder"
                    ]
                },
                {
                    "testimony": "Honestly, that's enough. How much longer must we tolerate this?",
                    "person": "Byakuya",
                    "present": []
                }
            ]
        },
        {
            "category": "cross_examination",
            "newContext": "12-ClassTrialTHESUN.png\n13-Makoto31.png\n: You said you went to get the poison from section C, and that's where you spilled the powder, right?\n14-Hina9.png\n: Yeah...what about it?\n13-Makoto31.png\n: And after that, you said you moved from section C to section A to get the protein...\n15-FlashT.png\n17-FlashB.png\n13-Makoto31.png\n: But the\n**\nfootprints left at the scene\nwere *not* moving from section C to section A. That contradicts what you just said.\n19-Hina12.png\n: Wh--!?\n20-Hiro5.png\n: Then...maybe she moved in some weird direction on purpose to disguise her movements...?\n21-Makoto30.png\n: No, that can't be it. Remember what Hina just said?\n15-FlashT.png\n17-FlashB.png\n23-Hina15.png\n: I was just...nervous! So I didn't notice I'd left a footprint!\n25-Hina13.png\n: Ah--!\n26-Byakuya6.png\n: What the--? Hina, what's the meaning of this!?\n19-Hina12.png\n: U-Um, well...\n28-Kyoko13.png\n: You lied to us, plain and simple. If you look at the footprints, your movements in the chem lab are obvious. The powder had already been spilled when you came in, and you went straight to section A. So you never went to section C. Whatever you did there, it only involved section A.\n19-Hina12.png\n: W-Well, you see... ...\n29-Byakuya12.png\n: Wh-What the...?\n31-Byakuya11.png\n: What the hell? What's going on here!?\n32-Kyoko15.png\n: And the footprints aren't the only problem with her account.\n31-Byakuya11.png\n: What...?\n34-Kyoko14.png\n: Before I explain that part, I'd like to submit some\n**\nnew evidence\n.\n26-Byakuya6.png\n: New evidence!? Impossible! There can't be!\n32-Kyoko15.png\n: ...Are you sure? After all, you're the one that gave it to me.\n31-Byakuya11.png\n: I...did?\n36-Kyoko.png\n: It was hidden inside the bottle of poison you gave me.\n32-Kyoko15.png\n: I'm amazed you of all people would miss such a vital clue. A truly grave oversight...\n26-Byakuya6.png\n: ... Just say it, already! What is it you think you found!?\n28-Kyoko13.png\n: I found this.\nHuh? A piece of glass...?\n5-Kyoko11.png\n: It had sunk to the bottom of the bottle. And the hidden clue was exposed thanks to you ingesting the powder.\n32-Kyoko15.png\n: I couldn't have solved the mystery without you. So, thank you for that.\n31-Byakuya11.png\n: B-But...what is it?\n39-Kyoko17.png\n: Oh, you still don't realize? Well then...\n28-Kyoko13.png\n: Makoto, why don't you explain it?\n40-Makoto33.png\n: Huh? Me!?\n31-Byakuya11.png\n: ...\n26-Byakuya6.png\n: F-Fine! If you really do know, explain the meaning of that shard of glass!\nThe shard of light blue glass Kyoko found in the bottle of poison...\n> The rec room window\n21-Makoto30.png\n: It's...\n**\npart of the window\nfrom the rec room door, right?\n31-Byakuya11.png\n: The window...?\n15-FlashT.png\n17-FlashB.png\n21-Makoto30.png\n: The window we broke to get in was light blue, just like that. So I think that must be it.\n28-Kyoko13.png\n: You're right, it must be. Of course, that leads to another question... How did a shard of glass from the window get inside this bottle of poison?\n45-Jill2.png\n: What's so strange about that!?\n21-Makoto30.png\n: What's strange is that...according to\n**\nwhat Hina told us\n...\nWhere was it the bottle of poison should have been when I broke the rec room window? According to what Hina told us...\n> Section A of the shelf\n13-Makoto31.png\n: The bottle of poison was left\n**\non the shelf in the chem lab\n. That is what you said, right Hina?\n48-Hina3.png\n: Uh...umm...\n13-Makoto31.png\n: And yet, somehow a piece of glass from the rec room window made its way into the bottle...\n50-Hiro8.png\n: Then everything Hina told us was\n**\na lie\n!?\n13-Makoto31.png\n: In reality, that bottle of poison most definitely found its way to the\n**\nrec room\n. It was there at least until the window got broken. In other words, when the locked room was unlocked. There's no other way to explain the presence of that glass in that bottle.\n28-Kyoko13.png\n: And then, once the room was opened, the bottle somehow got moved back to the shelf in the chem lab. Meanwhile, the protein can we found at the crime scene was planted there.\n34-Kyoko14.png\n: That had to be after the locked room was opened. In other words, after Sakura died.\n31-Byakuya11.png\n: Wait, hold on... You're moving too fast!\n26-Byakuya6.png\n: I'll grant you, the bottle of poison may well have been in the rec room when it was locked, but how can you say the protein can was put there after the room was unlocked!? We already know she was given the protein can with the poison inside, right? If that can wasn't there when she died, how did she get poisoned!?\n39-Kyoko17.png\n: You're right. We do need to explain that. But before we do, there's something I'd like to confirm with everyone here.\n52-Hiro7.png\n: Huh...?\n5-Kyoko11.png\n: It has to do with the protein can. After Sakura's body was discovered, did anyone move it or trip over it or anything like that?\n26-Byakuya6.png\n: What are you talking about? Is this some kind of loaded question?\n39-Kyoko17.png\n: Not at all. Just answer to the best of your ability.\n26-Byakuya6.png\n: ...Well, no. Not that I remember.\n55-Makoto20.png\n: Yeah, me either.\n20-Hiro5.png\n: Not me.\n56-Jill9.png\n: Same here!\n14-Hina9.png\n: Y-Yeah, me either...\n32-Kyoko15.png\n: Okay then, that settles it. That proves that the protein can found its way to the murder scene *after* the room was opened.\n31-Byakuya11.png\n: Oh, come on! How can you say that!?\n26-Byakuya6.png\n: How can you know what I don't know!?\nThe reason she can say that is because there's evidence... There's proof that someone brought the protein can to the rec room *after* it was opened!\n",
            "testimonies": [
                {
                    "testimony": "When it comes to that protein can, there's not a doubt in my mind. Until ***the locked room was unlocked*** , it absolutely was not in there!",
                    "person": "Kyoko",
                    "present": []
                },
                {
                    "testimony": "So you're saying...someone planted it there after we got the door open?",
                    "person": "Hiro",
                    "present": []
                },
                {
                    "testimony": "No...no, that's impossible... I-It had to have been in there the whole time! It had to be! It was in there before ***the rec room was unlocked*** !",
                    "person": "Byakuya",
                    "present": [
                        "Empty Protein Drink"
                    ]
                }
            ]
        }
    ]
}